{
    "cik": "56978",
    "company": "KULICKE & SOFFA INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-16",
    "period_of_report": "2023-09-30",
    "sic": "3674",
    "state_of_inc": "PA",
    "state_location": "U0",
    "fiscal_year_end": "0928",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/56978/0000056978-23-000172-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/56978/000005697823000172/klic-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/56978/0000056978-23-000172.txt",
    "filename": "56978_10K_2023_0000056978-23-000172.htm",
    "content": "Item 1. BUSINESS\nFounded in 1951, Kulicke and Soffa Industries, Inc. (K&S, we, us, our, or the Company) specializes in developing cutting-edge semiconductor and electronics assembly solutions enabling a smarter and more sustainable future. Our ever-growing range of products and services supports growth and facilitates technology transitions across large-scale markets, such as advanced display, automotive, communications, compute, consumer, data storage, energy storage and industrial.\nWe design, develop, manufacture and sell capital equipment and consumables and provide services used to assemble semiconductor and electronic devices, such as integrated circuits, power discretes, light-emitting diode (LEDs), advanced displays and sensors. We also service, maintain, repair and upgrade our equipment and sell consumable aftermarket solutions and services for our and our peer companies equipment. Our customers primarily consist of integrated device manufacturers (IDMs), outsourced semiconductor assembly and test providers (OSATs), foundry service providers, and other electronics manufacturers and automotive electronics suppliers.\nOur goal is to be the technology leader and the most competitive supplier in terms of cost and performance in each of our major product lines. Accordingly, we invest in research and engineering projects intended to expand our market access and enhance our leadership position in semiconductor, electronics and display assembly. We also remain focused on enhancing our value to customers through higher productivity systems, more autonomous capabilities and continuous improvement and optimization of our operational costs. Delivering new levels of value to our customers is a critically important goal.\nK&S was incorporated in Pennsylvania in 1956. Our principal offices are located at 23A Serangoon North Avenue 5, #01-01, Singapore 554369 and 1005 Virginia Dr., Fort Washington, PA 19034, and our telephone number in the United States is (215) 784-6000. We maintain a website with the address www.kns.com. We are not including the information contained on our website as a part of, or incorporating it by reference into, this filing. We make available free of charge (other than an investors own Internet access charges) on or through our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to these reports, as soon as reasonably practicable after the material is electronically filed with or otherwise furnished to the Securities and Exchange Commission (SEC). Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports are also available on the SEC's website at www.sec.gov.\nOur year end for each of fiscal 2023, 2022 and 2021 was September 30, 2023, October 1, 2022, and October 2, 2021, respectively.\nCurrent Events\nIsrael - Hamas War\nOn October 7, 2023, an escalated armed conflict between Israel and the Hamas terrorist organization commenced, leading to a series of extended hostilities along Israels border with the Gaza Strip. Additionally, since October 8, 2023, the Hezbollah militant group has increased its hostilities against Israel over its northern region, including Haifa.\nOur Company has a manufacturing facility and a business office in Haifa, and our capillaries are manufactured at our facilities in Israel and China.\nAs of the date of this report, our business and manufacturing operations in Israel have not been impacted and no material damage or utilities interruption have been noted at our Israeli facility. Trade routes remain open, and our suppliers and business partners in Israel remain operational. Furthermore, save for a handful of employees who have been mobilized as members of the Israeli military reserves to active duty, disruption to our workforce has been minimal.\nWe employ around 70 employees in Israel. The safety and well-being of our employees and their families remain our top priority. Our Company is actively providing support to employees and their families who have been impacted by these events, and employees in our Israeli facilities have the option of working from home to facilitate care-giving needs.\nGiven that the intensity, duration and outcome of the ongoing war is uncertain, any further escalation or other hostilities may result in government-mandated lockdowns and disrupt our business operations. We continue to monitor the situation and remain ready to activate our Business Continuity Plan (BCP) if necessary.\nKey Events in Fiscal 2023\nAcquisition of Advanced Jet Automation Co., Ltd.\nAs part of our corporate strategy, we continually evaluate our portfolio of businesses and may from time to time decide to buy or sell businesses or enter into joint ventures or other strategic alliances. On February 22, 2023, we completed the acquisition of Advanced Jet Automation Co., Ltd. (AJA), including the material business and assets formerly owned by its affiliate, Samurai Spirit Inc., a leading developer and manufacturer of high-precision micro-dispensing equipment and solutions in Taiwan. The purchase price consisted of $38.1 million in cash paid at closing, of which $4.0 million from the purchase price is being held by us in escrow for a period of 24 months from the closing date. This acquisition provides new access to adjacent process steps throughout the existing semiconductor, electronic assembly and advanced display portfolio, increasing market access to several exciting growth areas such as emerging advanced backlighting and direct-emissive display technologies utilizing mini and micro-LEDs, as well as advanced packaging opportunities which are demanding finer-pitch assembly capabilities. As of February 22, 2023, AJA became our wholly-owned subsidiary and on March 30, 2023, AJA was renamed Kulicke and Soffa Hi-Tech Co., Ltd. (K&S Hi-Tech). The newly acquired business of K&S Hi-Tech is deemed a separate operating segment (advanced dispensing solutions) under the All Others category. Please refer to Note 3-Business Combination for additional information related to our acquisition of AJA.\nMacroeconomic Headwinds\nSupply chain disruptions and global shortages in electronic components are generally abating in many jurisdictions. However, the cost of logistics remains high as a result of macroeconomic conditions, and labor shortages persist across layers of the supply chain. Additionally, the Companys management continues to monitor the ongoing Israel-Hamas war and the prolonged Ukraine/Russia conflict, especially in light of the impact it may have on the availability and cost of raw materials that are produced in the Middle East and Europe in general. Management is also monitoring for signs of any expansion of economic or supply chain disruptions or broader supply chain inflationary costs resulting either directly or indirectly from the tensions in the Middle East and between Ukraine and Russia.\nDuring fiscal years 2021 and 2022, semiconductor suppliers rapidly increased production output in response to increases in end-consumer demand. Concerns surrounding supply availability have spurred defensive inventory purchases, which led to a heightened demand for our products.\nThe current macroeconomic conditions and declining consumer sentiment have resulted in significant inventory buildup in the semiconductor industry. Many of our consumers who accumulated our products in the past three years are reducing their order rates as a result of inventory adjustment and shorter lead times. The general reduction in demand within the semiconductor industry may also result in the instability of our key suppliers, as they struggle with oversupply and the rising cost of business.\nDue to general inflationary pressures, declining consumer sentiment, and an economic downturn caused, directly or indirectly, by various macroeconomic factors, including the ongoing Israel-Hamas war and the prolonged Ukraine/Russia conflict, the sector is seeing short-term volatility and disruption. However, we believe that the semiconductor industry macroeconomics have not changed and we anticipate that the industrys long-term growth projections will normalize.\nThe prolonged Ukraine/Russia conflict did not materially impact our financial condition and operating results in fiscal 2023. We believe that our existing cash, cash equivalents, short-term investments, existing Facility Agreements, and anticipated cash flows from operations will be sufficient to meet our liquidity and capital requirements, notwithstanding the ongoing Israel-Hamas war and the prolonged Ukraine/Russia conflict and other macroeconomic factors, for at least the next twelve months from the date of filing. However, this is a highly dynamic situation. As the macroeconomic situation remains highly volatile and the geopolitical situation remains uncertain, there is uncertainty surrounding the operations of our manufacturing locations, our business, our expectations regarding future demand or supply conditions, our near- and long-term liquidity and our financial condition. Consequently, our operating results could deteriorate.\nFor other information, please see Part I, Item 1A. RISK FACTORS\nSemiconductor Industry and Macroeconomic Risks\nOur operating results and financial condition could be adversely impacted by volatile worldwide economic conditions and unpredictable spending by our customers due to uncertainties in the macroeconomic environment.\nThough the semiconductor industrys cycle can be independent of the general economy, global economic conditions may have a direct impact on demand for semiconductor units and ultimately demand for semiconductor capital equipment and tools. Accordingly, our business and financial performance is impacted, both positively and negatively, by fluctuations in the macroeconomic environment. Expenditures by our customers depend on the current and anticipated market demand for semiconductors and products that use semiconductors, LEDs and batteries, including mobile devices, personal computers, consumer electronics, telecommunications equipment, automotive components, electric vehicles and other industrial products. Reductions or other fluctuations in our customers' spending as a result of uncertain conditions and volatility in the macroeconomic environment, including from government, economic or fiscal instability, economic recession, actual or potential inflation, rising interest rates, slower growth in certain geographic regions, global trade issues, global health crises and pandemics, restricted global credit conditions, reduced demand, excess inventory, higher energy prices, or other conditions, could adversely affect our business, financial condition and operating results. Further, our profitability can be affected by volatility because we incur a certain amount of fixed costs that we cannot modulate up and down to meet increases or decreases in demand. The impact of broad-based weakening in the global macroeconomic environment could make our customers cautious and delay orders until the economic outlook becomes clearer. Significant downturns in the market for semiconductor devices or in general economic conditions reduce demand for our products and can materially and adversely affect our business, financial condition and operating results. Our visibility into future demand is generally limited and forecasting is difficult, and we believe historic, industry-wide volatility will persist.\nThe ongoing Israel-Hamas war may adversely affect our business, financial condition or results of operations.\nOn October 7, 2023, an escalated armed conflict between Israel and the Hamas terrorist organization commenced, leading to a series of extended hostilities along Israels border with the Gaza Strip. Additionally, since October 8, 2023, the Hezbollah militant group has increased its hostilities against Israel over its northern region, including Haifa.\nMany multinational companies in the semiconductor industry have research, design and development centers situated in Israel, including our Company, which has a manufacturing facility and a business office in Haifa.\nThe intensity, duration and outcome of the ongoing war is uncertain and its continuation or escalation may have a material adverse effect on our business and operations. While we are currently maintaining business and operations in Israel without material damage or interruptions at our Israeli facility, our assets and operations in Israel could be vulnerable to future property damage, inventory loss, business disruption, and expropriation.\nWe have around 70 employees in Israel. While to our knowledge, there have been no reported casualties or injuries to our employees as of the date of this report, some of our Israeli employees have been mobilized as members of the Israeli military reserves to active duty. The ongoing war could cause harm to our employees and otherwise impair their ability to work for extended periods of time, as well as disrupt supply chains, transport networks, telecommunications and financial systems, and other critical infrastructure necessary to conduct business in Israel. As the intensity of the war has been rapidly evolving, including the potential for heightened geopolitical tensions in the Middle East, we continue to receive and review reports concerning our operations and business partners and remain vigilant.\nThe risk of cybersecurity incidents may also increase in connection with the ongoing war. These attacks may impact critical infrastructure and financial institutions globally, which in turn could adversely affect our operations. While we have taken actions to mitigate such potential risks, the proliferation of malware from the war into systems unrelated to the war, or cyberattacks targeted against U.S. companies, could adversely affect our operations.\nEven if the war moderates, or a peaceful resolution in the region is reached, the detrimental impact to the global financial markets may be far-reaching, and may not recover immediately. The potential effects of these conditions could have a material adverse effect on our business, results of operations and financial condition.\nWe depend on our suppliers, including sole source suppliers, for raw materials, components and subassemblies. If our suppliers do not deliver their products to us, or deliver non-compliant or defective products, we would be unable to deliver our products to our customers.\nOur products are complex and require raw materials, components and subassemblies having a high degree of reliability, accuracy and performance. We rely on subcontractors to manufacture many of these components and subassemblies and we rely on sole source suppliers for certain key technology parts and raw materials. As a result, we are exposed to a number of significant risks, including:\ndecreased control over the manufacturing process for components and subassemblies;\nchanges in our manufacturing processes in response to changes in the market, which may delay our shipments;\nour inadvertent use of defective or contaminated raw materials;\nthe relatively small operations and limited manufacturing resources of some of our suppliers, which may limit their ability to manufacture and sell subassemblies, components or parts in the volumes we require and at acceptable quality levels and prices;\nrestrictions on our ability to rely on suppliers due to changes in trade regulation as well as laws and regulations enacted in response to concerns related to climate change, conflict minerals, or responsible sourcing practices;\nthe inability of suppliers to meet our or other customer demand requirements;\nreliability or quality issues with certain key subassemblies provided by single source suppliers as to which we may not have any short-term alternative;\nshortages caused by disruptions at our suppliers and subcontractors for a variety of reasons, including public health emergencies and associated containment measures, war or geopolitical tensions (such as the Israel-Hamas war, tensions in the Middle East and the Ukraine/Russia conflict), significant natural disasters (including as a result of climate change) or significant price changes (including as a result of inflationary pressures);\ndelays in the delivery of raw materials or subassemblies, which, in turn, may delay shipments to our customers;\nloss of suppliers as a result of consolidation of suppliers in the industry; and\nloss of suppliers because of their bankruptcy or insolvency.\nIf any of these risks were to materialize, we might be unable to deliver our products to our customers on time and at expected cost, or at all. While we observed some easing of the industry-wide supply constraints towards the end of fiscal 2022 and in fiscal 2023, we expect some constraints to continue and the duration of such constraints or their long-term impact on our business cannot be predicted at this time.\nAs part of our supply chain management, we may from time to time increase our inventory levels to mitigate against anticipated future component shortages. These increases in our inventory levels may lead to an excess of materials in the future in the event that the demand for our products is lower than our expectations or if we otherwise fail to anticipate future customer demand properly. Excess inventory levels could result in inventory write-downs at discounted prices, which could adversely affect our cash flows or gross margins. As a result, our business, financial condition and operating results would be materially and adversely affected.\nThe semiconductor industry is volatile with sharp periodic downturns and slowdowns. Cyclical industry downturns are made worse by volatile global economic conditions.\nThe semiconductor industry is volatile, with periods of rapid growth followed by industry-wide retrenchment. These periodic downturns and slowdowns have in the past adversely affected our business, financial condition and operating results. Downturns have been characterized by, among other things, diminished product demand, excess production capacity, and accelerated erosion of selling prices. Historically these downturns have severely and negatively affected the industrys demand for capital equipment, including assembly equipment and, to a lesser extent, tools. In any case, we believe the historical volatility of our business, both upward and downward, will persist. Consequently, our revenues may decline, and our results of operations and financial condition may be adversely affected.\nDifficulties in forecasting demand for our product lines may lead to periodic inventory shortages or excesses.\nWe typically operate our business with limited visibility of future demand. We do not have long-term contracts with many of our customers. As a result, demand for our products in future periods is difficult to predict and we sometimes experience inventory shortages or excesses. We generally order supplies and otherwise plan our production based on internal forecasts for demand. We have in the past failed, and may again in the future fail, to accurately forecast demand for our products. This has led to, and may in the future lead to, delays in product shipments or, alternatively, an increased risk of inventory obsolescence. As part of our supply chain management, we have increased our inventory levels in an effort to mitigate component shortages, which may increase the risk of inventory obsolescence. If we fail to accurately forecast demand for our products, our business, financial condition and operating results may be materially and adversely affected.\nOur quarterly operating results fluctuate significantly and may continue to do so in the future.\nIn the past, our quarterly operating results have fluctuated significantly. We expect that our quarterly results will continue to fluctuate. Although these fluctuations are partly due to the cyclical and volatile nature of the semiconductor industry, they also reflect other factors, many of which are outside of our control.\nSome of the factors that may cause our net revenue and operating margins to fluctuate significantly from period to period are:\nmarket downturns;\nindustry inventory levels;\nthe mix of products we sell because, for example:\n◦certain lines of equipment or certain aftermarket tools within our business segments are more profitable than others; and\n◦some sales arrangements have higher gross margins than others;\ncanceled or deferred orders;\nvariations in sales channel or mix of direct sales and indirect sales;\nseasonality;\ncompetitive pricing pressures may force us to reduce prices;\nhigher than anticipated costs of development, achieving customer acceptance or production of new products;\nthe availability and cost of the components for our products;\ndelays in the development and manufacture of our new products and upgraded versions of our products and market acceptance of these products when introduced;\ncustomers delay in purchasing our products due to anticipation that we or our competitors may introduce new or upgraded products; and\nour competitors introduction of new products.\nMany of our expenses, such as research and development, selling, general and administrative expenses, and interest expense, do not vary directly with our net revenue. Our research and development efforts include long-term projects lasting a year or more, which require significant investments. In order to realize the benefits of these projects, we believe that we must continue to fund them even during periods when our revenue has declined. As a result, a decline in our net revenue would adversely affect our operating results as we continue to make these expenditures. In addition, if we were to incur additional expenses in a quarter in which we did not experience comparable increased net revenue, our operating results would decline. In a downturn, we may have excess inventory, which could be written off. Some of the other factors that may cause our expenses to fluctuate from period-to-period include:\ntiming and extent of our research and development efforts;\nseverance, restructuring, and other costs of relocating facilities;\ninventory write-offs due to obsolescence or other causes; and\nan increase in the cost of labor or materials.\nBecause our net revenue and operating results are volatile and difficult to predict, we believe consecutive period-to-period or year-over-year comparisons of our operating results may not be a good indication of our future performance.\nCompetitive Risks\nOur average selling prices usually decline over time and may continue to do so.\nTypically, our average selling prices have declined over time due to continuous price pressure from our customers and competitive cost reductions in our industrys supply chains. We seek to offset this decline by continually reducing our cost structure by consolidating operations in lower cost areas, reducing other operating costs, by pursuing product strategies focused on product performance and customer service, and developing new products for which we are able to charge higher prices. These efforts may not enable us to fully offset price declines, and if they do not, our financial condition and operating results may be materially and adversely affected.\nWe may not be able to rapidly develop, manufacture and gain market acceptance of new and enhanced products required to maintain or expand our business.\nWe believe our continued success depends on our ability to continuously develop and manufacture new products and product enhancements on a timely and cost-effective basis. We must introduce these products and product enhancements into the market in a timely manner in response to customers demands for higher performance assembly equipment and leading-edge materials customized to address rapid technological advances in integrated circuits, and capital equipment designs. Our competitors may develop new products or enhancements to their products that offer improved performance and features, or lower prices which may render our products less competitive. The development and commercialization of new products require significant capital expenditures over an extended period of time, and some products we seek to develop may never become profitable. In addition, we may not be able to develop and introduce products incorporating new technologies in a timely manner that will satisfy our customers future needs or achieve market acceptance. If we are not able to develop and sell our products that meet the demands of our customers, it would result in lower net revenues and our operating results would be adversely affected.\nWe may be unable to continue to compete successfully in the highly competitive semiconductor equipment and packaging materials industries.\nThe semiconductor equipment and packaging materials industries are very competitive. In the semiconductor equipment industry, significant competitive factors include price, speed/throughput, production yield, process control, delivery time, innovation, quality and customer support. In the semiconductor packaging materials industry, significant competitive factors include price, delivery and quality.\nIn each of our markets, we face competition and the threat of competition from established competitors and potential new entrants. In addition, established competitors may combine to form larger, better-capitalized companies. Some of our competitors have or may have significantly greater financial, engineering, manufacturing and marketing resources than we do. Some of these competitors are Asian and European companies that have had, and may continue to have, an advantage over us in supplying products to local customers who appear to prefer to purchase from local suppliers. Some of these competitors compete across many of our product lines, while others are primarily focused in a specific product area, all of which could result in lowering the barriers to entry. Some governments may have provided, and will continue to provide, financial assistance or other support to some of our competitors or to new entrants, to advance the nation's growth in the semiconductor equipment and packaging materials industries.\nWe expect our competitors to improve their current products performance, and to introduce new products and materials with improved price and performance characteristics. Our competitors may independently develop technology similar to or better than ours. They may also appropriate our technology and our intellectual property to compete against us and we may not have adequate legal recourse. New product and material introductions by existing competitors or by new market entrants could hurt our sales. If a semiconductor manufacturer or subcontract assembler selects a competitors product or materials for a particular assembly operation, we may not be able to sell products or materials to that manufacturer or assembler for a significant period of time. Manufacturers and assemblers sometimes develop lasting relationships with suppliers and assembly equipment providers in our industry and often go years without requiring replacement. In addition, we may have to lower our prices in response to price cuts by our competitors, which may materially and adversely affect our business, financial condition and operating results. If we cannot compete successfully, we could lose customers and experience reduced margins and profitability.\nGeographic, Trade and Customer Risks\nSubstantially all of our sales, distribution channels and manufacturing operations are located outside of the U.S., which subjects us to risks, including risks from changes in trade regulations, currency fluctuations, political instability and conflicts.\nFrom time to time, our customers may request that we deliver our products to countries where they own or operate production facilities or to countries where they utilize third-party subcontractors or warehouses as part of their supply chain. Our customer base in the Asia/Pacific region has become more geographically concentrated over time as a result of general economic and industry conditions and trends. Over 90% of our net revenue is derived from shipments to customers located outside of the U.S., primarily in the Asia/Pacific region. Approximately 38.6%, 45.8% and 43.4% of our net revenue for fiscal 2023, 2022, and 2021, respectively, was derived from shipments to customers headquartered in China.\nWe expect our future performance to depend on our ability to continue to compete in foreign markets, particularly in the Asia/Pacific region. Some of these economies have been highly volatile, resulting in significant fluctuation in local currencies, and political and economic instability. Some of these economies may also increase trade protectionism, thereby increasing barriers to entry, amplifying supply chain risks and adversely affecting the demand for our products. These conditions may continue or worsen, which may materially and adversely affect our business, financial condition and operating results.\nWe also rely on non-U.S. suppliers for materials and components used in our products, and substantially all of our manufacturing operations are located in countries other than the U.S. We manufacture our ball, wedge and APAMATM bonders in Singapore, our Hybrid and Electronic Assembly solutions in the Netherlands, our dicing blades, capillaries and bonding wedges in China, our capillaries in Israel and China, and our advanced dispensing equipment in Taiwan. We also rely on independent foreign distribution channels for certain of our product lines. As a result, a major portion of our business is subject to the risks associated with international commerce, particularly Asia/Pacific region, such as:\nstringent and frequently changing trade compliance regulations;\nless protective foreign intellectual property laws, and the enforcement of patent and other intellectual property rights;\nlonger payment cycles in foreign markets;\nforeign exchange restrictions and capital controls, monetary policies and regulatory requirements;\nrestrictions or significant taxes on the repatriation of our assets, including cash;\ntariff and currency fluctuations;\ndifficulties of staffing and managing dispersed international operations, including labor work stoppages and strikes in our factories or the factories of our suppliers;\nchanges in our structure or tax incentive arrangements;\npossible disagreements with tax authorities;\nepisodic events outside our control such as, for example, outbreaks of coronaviruses, influenza or other illnesses;\nnatural disasters such as earthquakes, fires or floods, including as a result of climate change;\nwar, risks and rumors of war and civil disturbances, including the Israel-Hamas war and the Ukraine/Russia conflict, or other events that may limit or disrupt manufacturing, markets and international trade;\nact of terrorism that impact our operations, customers or supply chain or that target U.S. interests or U.S. companies;\nseizure of our foreign assets, including cash;\nthe imposition of sanctions of countries in which we do business;\nchanging political conditions and rising geopolitical tensions; and\nlegal systems which are less developed and may be less predictable than those in the U.S.\nIn addition, there is a potential risk of conflict and instability in the relationship between Taiwan and China which could disrupt the operations of our customers and/or suppliers in both Taiwan and China, our manufacturing operations in Taiwan and China, and our future plans in the region.\nOur international operations also depend on favorable trade relations between the U.S. and those foreign countries in which our customers, subcontractors and materials suppliers have operations. A protectionist trade environment in either the U.S. or those foreign countries in which we do business, such as a change in the current tariff structures, export compliance or other trade policies, may materially and adversely affect our ability to sell our products in foreign markets.\nCatastrophic events, such as pandemics and extreme weather events as a result of climate change, can have a material adverse effect on our operations and financial results.\nOur operations and business, and those of our customers and suppliers, can be disrupted by natural disasters, public health issues, cybersecurity incidents, interruptions of service from utilities, or other catastrophic events including as a result of climate change. For example, we have at times experienced temporary disruptions in our manufacturing processes as a result of power outages. In addition, global climate change can result in natural disasters occurring more frequently, with greater intensity and with less predictability. For example, in September 2023, territories in the East Asian monsoon region, including Guangdong, Hong Kong, Fujian and Taiwan, experienced significant typhoons and storm surges, resulting in a temporary suspension of business and services. Such temporary suspension of business and services impacted some of the semiconductor factories and suppliers who operate there. The long-term effects of climate change on the global economy and the semiconductor industry in particular are unclear but could be severe, and could exacerbate the other risk factors described herein. Catastrophic events could make it difficult or impossible to manufacture or deliver products to our customers, receive materials from our suppliers, or perform critical functions, whether on a timely basis or at all, which could adversely affect our revenue and operations. Some of the systems we maintain as part of our business recovery plans cannot guarantee us protection from such disruptions. Furthermore, even if our operations are unaffected or if we managed to recover our operations quickly, if our customers or suppliers cannot timely resume their own operations due to a catastrophic event, we may be unable to fulfil our customers orders, and may experience reduced or cancelled orders or other disruptions to our supply chain that may adversely affect our results of operations.\nWe are subject to export restrictions that may limit our ability to sell to certain customers, and trade wars, in particular the U.S.-China trade war, could adversely affect our business.\nThe U.S. and several other countries levy tariffs on certain goods and impose other trade restrictions that may impact our customers investment in manufacturing equipment, reduce the competitiveness of our products, or inhibit our ability to sell products or purchase necessary equipment and supplies. In particular, trade tensions between the U.S. and China have been escalating since 2018, with U.S. tariffs on Chinese goods and retaliatory Chinese tariffs on U.S. goods. We cannot predict what further actions may ultimately be taken with respect to tariffs or trade relations between the U.S. and other countries, what products may be subject to such actions, or what actions may be taken by other countries in response. Further changes in trade policy, tariffs, additional taxes, restrictions on exports or other trade barriers, or restrictions on supplies, equipment, and raw materials, may limit our ability to produce products, increase our selling and/or manufacturing costs, reduce the competitiveness of our products, or inhibit our ability to sell products or purchase necessary equipment and supplies, which could have a material adverse effect on our business, results of operations, or financial condition.\nThough nearly all of our manufacturing activities take place outside of the U.S., certain of our advanced packaging products are subject to the EAR because they are based on U.S. technology or contain more than a de minimis amount of controlled U.S. content. The EAR require licenses for, and sometimes prohibit, the export of certain products. The CCL sets forth the types of goods and services controlled by the EAR, including civilian science, technology, and engineering dual-use items. For products listed on the CCL, a license may be required as a condition to export depending on the end destination, end use or end user and any applicable license exceptions.\nIn 2020, the U.S. Department of Commerce Bureau of Industry and Security (BIS) amended the EAR to expand controls on certain foreign products based on U.S. technology and sold to Huawei and certain other companies. In October 2022, the BIS amended the EAR again to extend those foreign controls to numerous companies on BIS so-called Entity List. The 2020 and 2022 amendments impact some of our advanced packaging products, which are based on U.S. technology and are within the scope of the expanded EAR controls on Huawei and other Entity List companies. Therefore, these products cannot be sold to Huawei and other Entity List companies, and are subject to certain end-use restrictions. To date, these amendments to the EAR have not had a material direct impact on our business, financial condition or results of operations and we do not expect that they will, although they could have indirect impact, including increasing tensions in U.S. and Chinese trade relations, potentially leading to negative sentiments towards U.S.-based companies among Chinese consumers. Additionally, some end users may prefer to avoid the U.S. supply chain in its entirety to avoid the application of these regulations.\nThe rules promulgated by the BIS are typically complex, and the BIS could revise or expand them in response to public comments. Likewise, the BIS may issue guidance clarifying the scope of the rules. Such revisions, expansions or guidance could change the impact of the rules for our business.\nFuture changes in, and responses to, the various export regulations, tariffs, or other trade regulations between the U.S. and other countries may be unpredictable. Such further changes may limit our ability to produce products, increase our selling or manufacturing costs, decrease margins, reduce the competitiveness of our products and cause our sales to decline, and therefore could have a material adverse effect on our business, financial condition or results of operations.\nBecause a small number of customers account for most of our sales, our net revenue could decline if we lose a significant customer.\nThe semiconductor manufacturing industry is highly concentrated, with a relatively small number of large semiconductor manufacturers and their subcontract assemblers and vertically integrated manufacturers of electronic systems purchasing a substantial portion of our semiconductor assembly equipment and packaging materials. Sales to a relatively small number of customers have historically accounted for a significant percentage of our net revenue. There was no customer with sales representing more than 10% of net revenue in fiscal 2023. Sales to our ten largest customers comprised 53.5% and 49.1% of our net revenue for fiscal 2023 and fiscal 2022, respectively.\nWe expect that a small number of customers will continue to account for a high percentage of our net revenue for the foreseeable future. Thus, our business success depends on our ability to maintain strong relationships with our customers. Any one of a number of factors could adversely affect these relationships. If, for example, during periods of escalating demand for our equipment, we were unable to add inventory or increase our production capacity quickly enough to meet the needs of our customers, or if we are not able to fulfil our customers' orders due to supply chain constraints, they may turn to other suppliers making it more difficult for us to retain their business. We may also make commitments from time-to-time to our customers regarding minimum volumes and performance standards, and if we are unable to meet those commitments, we may incur liabilities to our customers. If we lose orders from a significant customer that we are not able to replace, or if a significant customer reduces its orders substantially, or if we incur liabilities for not meeting customer commitments, these losses, reductions or liabilities may materially and adversely affect our business, financial condition and operating results.\nWe maintain a backlog of customer orders that is subject to cancellation, reduction or delay in delivery schedules, which may result in lower than expected revenues.\nWe manufacture products primarily pursuant to purchase orders for current delivery or to forecast, rather than pursuant to long-term supply contracts. As a result, we must commit resources to the manufacture of products without binding purchase commitments from customers. The semiconductor industry is occasionally subject to double-booking and rapid changes in customer outlooks or unexpected build ups of inventory in the supply channel as a result of shifts in end market demand and macro-economic conditions. Accordingly, many of these purchase orders or forecasts may be revised or canceled without penalty. Even in cases where our standard terms and conditions of sale or other contractual arrangements do not permit a customer to cancel an order without penalty, we may from time to time accept cancellations to maintain customer relationships or because of industry practice, custom or other factors. The broad-based weakening in the global macroeconomic environment may result in lower than expected demand for our products, and our inability to sell products after we devote significant resources to them could have a material adverse effect on our levels of inventory, revenues and profitability.\nHuman Capital Risks\nOur business depends on attracting and retaining management, sales and technical employees as well as on the succession of senior management.\nOur future success depends on our ability to hire and retain qualified management, sales, finance, accounting and technical employees, including senior management. Experienced personnel with the relevant and necessary skill sets in our industry are in high demand and competition for their talents is intense, especially in Asia, where most of the Companys key personnel are located. If we are unable to continue to attract and retain the managerial, marketing, finance, accounting and technical personnel we require, our business, financial condition and operating results may be materially and adversely affected.\nEffective succession planning is also important to our long-term success. Failure to ensure effective transfer of knowledge and smooth transitions involving senior management could hinder our strategic planning and execution. From time to time, senior management or other key employees may leave our company, and the loss of any key employee could result in significant disruptions to our operations, including adversely affecting the timeliness of product releases, the successful implementation and completion of company initiatives, the effectiveness of our disclosure controls and procedures and our internal control over financial reporting, and the results of our operations. Changes in immigration policies may also impair our ability to recruit and hire technical and professional talent. In addition, hiring, training, and successfully integrating replacement critical personnel could be time consuming, may cause additional disruptions to our operations, and may be unsuccessful, which could negatively impact future revenues.\nProduct Risks\nAlternative packaging technologies may render some of our products obsolete and materially and adversely affect our overall business and financial results.\nAlternative packaging technologies have emerged that may improve device performance, reduce the size of or enhance the number of components inherent in an integrated circuit package, as compared to traditional wire bonding. These technologies include flip chip and wafer-level packaging. Some of these alternative technologies eliminate the need for wires to establish the electrical connection between a die and its package. The semiconductor industry may, in the future, shift a significant part of its volume into alternative packaging technologies which do not employ our products. If a significant shift to alternative packaging technologies or to another technology not offered by us were to occur, demand for our equipment and related packaging materials may be materially and adversely affected. Given that a majority of our revenue comes from wire bonding, a reduced demand for our wire bonding equipment could materially and adversely affect our financial results.\nWe may send products and equipment to customers or potential customers for trial, evaluation or other purposes which may result in retrofit charges, impairments or write-down of inventory value if the products and equipment are not subsequently purchased by the customers.\nFrom time to time we send certain products and equipment to customers or potential customers for testing, evaluation or other purposes in advance of receiving any confirmation of purchase or purchase orders. Such equipment may be at the customer location for an extended period of time per the agreements with these customers and potential customers. The customer or potential customer may refuse to buy all or partial quantities of such product or equipment and return this back to us. As a result, we may incur charges to retrofit the machines or sell the machines as second hand at a lower price, and accordingly may have to record impairments on the returned inventory, all of which would adversely affect our operating results.\nUndetected problems in our products could directly impair our financial results.\nIf errata (deviations from product specifications) or flaws in design, production, assembly or testing of our products (by us or our suppliers) were to occur, we could experience a rate of failure in our products that would result in materially adverse consequences, including:\nincurring warranty expenses;\nwriting off the value of inventory;\ndisposing of products that cannot be fixed;\nretrofitting products that have been shipped;\nproviding product replacements or modifications; and\ndefending against litigation.\nContinued improvement in manufacturing capabilities, control of material and manufacturing quality and costs and product testing are critical factors in our future growth. Our efforts to monitor, develop, modify and implement appropriate tests and manufacturing processes for our products may not be sufficient to permit us to avoid a rate of failure in our products that results in substantial delays in shipment, significant repair or replacement costs, potential damage to our reputation or general customer dissatisfaction with our products. We may also not be able to successfully claim against our suppliers or obtain product liability or other insurance to fully cover such risks. Any of the foregoing risks, if they were to materialize, could have a material adverse effect on our business, results of operations or financial condition.\nOperations and Supply Chain Risks\nWe may not be able to continue to consolidate manufacturing and other facilities or entities without incurring unanticipated costs and disruptions to our business.\nAs part of our ongoing efforts to drive further efficiency, we may consolidate our manufacturing and other facilities or entities. Should we consolidate, we may experience unanticipated events, including the actions of governments, suppliers, employees or customers, which may result in unanticipated costs and disruptions to our business. We may also incur restructuring charges, severance costs, asset impairments, loss of accumulated knowledge, inefficiency during transitional periods, employee attrition and other effects that could negatively impact our financial condition and results of operations.\nWe may be materially and adversely affected by environmental and safety laws and regulations, including laws and regulations implemented in response to climate change.\nWe are subject to various federal, state, local and foreign laws and regulations governing, among other things, the generation, storage, use, emission, discharge, transportation and disposal of hazardous material, investigation and remediation of contaminated sites and the health and safety of our employees. Public attention continues to focus on the environmental impact of manufacturing operations and the risk to neighbors of waste and chemical releases from such operations.\nProper waste disposal plays an important role in the operation of our manufacturing plants. In many of our facilities we maintain wastewater treatment systems that remove metals and other contaminants from process wastewater. These facilities operate under permits that must be renewed periodically. A violation of those permits may lead to revocation of the permits, fines, penalties or the incurrence of capital or other costs to comply with the permits, including the potential shutdown of operations.\nCompliance with existing or future land use, environmental, climate-related and health and safety laws and regulations may: (1) result in significant costs to us for additional capital equipment or other process requirements; (2) restrict our ability to expand our operations; and/or (3) cause us to curtail our operations. We also could incur significant costs, including cleanup costs, fines or other sanctions and third-party claims for property damage or personal injury, as a result of violations of or liabilities under such laws and regulations.\nIncreasingly, various agencies and governmental bodies have expressed interest in promulgating rules relating to climate change. For example, in March 2022, the SEC published a proposed rule that would require companies to provide significantly expanded climate-related disclosures in their Form 10-K, which may require us to incur significant additional costs to comply and impose increased oversight obligations on our management and Board of Directors. The cost of complying, or of failing to comply, with these and other regulatory requirements or contractual obligations could adversely affect our operating results, financial condition and ability to conduct our business.\nTo the extent that higher costs result in higher prices for our products, we may experience a reduction in the demand for those products, which could negatively affect our results of operations. Conversely, we may not be able to pass these increased costs onto our customers in the form of higher prices, as a result of which our results of operations may also be adversely affected.\nWe may acquire or divest businesses or enter into joint ventures or strategic alliances, which may materially affect our business, financial condition and operating results.\nWe continually evaluate our portfolio of businesses and may decide to buy or sell businesses or enter into joint ventures or other strategic alliances. We may not find suitable acquisition candidates, we may not be able to close such acquisitions, and the acquisitions we complete may not be successful. We may be unable to successfully integrate acquired businesses with our existing businesses and successfully implement, improve and expand our systems, procedures and controls to accommodate these acquisitions. If we are not able to successfully integrate any acquired businesses with ours, the anticipated benefits of the acquisitions may not be realized fully or may take longer than expected to be realized. We may also incur higher than expected costs as a result of any acquisitions or experience an overall post-completion process that takes longer than originally anticipated.\nThese transactions place additional demands on our management, our various functional teams and our current labor force. The combination of businesses may result in the loss of key personnel or an interruption of, or loss of momentum in, our existing businesses and/or the acquired business. In addition, we may need to divest existing businesses, which would cause a decline in revenue or profitability and may make our financial results more volatile. If we fail to integrate and manage acquired businesses successfully or to mitigate the risks associated with divestitures, joint ventures or other alliances, or if the time and costs associated with integration exceeds our expectations, or if our acquired business were to perform poorly, our business, financial condition and operating results may be materially and adversely affected.\nIncreasing attention to ESG matters, including any targets or other ESG initiatives, could result in additional costs or risks or adversely impact our business\nCertain investors, shareholder advocacy groups, other market participants, customers and other stakeholder groups have focused increasingly on companies' environmental, social and governance (ESG) initiatives, including those concerning climate change, greenhouse gas emissions, human rights, diversity and inclusion, and shareholder proxy access. This may result in increased costs, enhanced compliance or disclosure obligations and related costs, or other adverse impacts on our business, financial condition or results of operations.\nFrom time to time, we create and publish voluntary disclosures regarding ESG matters. Our sustainability report, currently in its seventh edition and available on our website, continues to outline our Companys strategies, initiatives and performance of ESG topics identified through a materiality assessment to be most relevant to the operations and stakeholders of our Company. The identification, assessment, and disclosure of such matters is complex. Many of the statements in such voluntary disclosures are based on our expectations and assumptions, which may require substantial discretion and forecasts about costs and future circumstances.\nAdditionally, ESG matters continue to evolve rapidly. Organizations that provide information to investors on ESG matters may develop more discrete rating matrices, benchmarks and processes on evaluating companies on their ESG approach. This may create opportunities for misalignment or perceived failure resulting in unfavorable ESG ratings. This could foster negative investor sentiment toward us, our customers, or our industry, which could negatively impact our business and operations. To the extent ESG matters negatively impact our reputation, it may also impede our ability to compete as effectively to recruit or retain employees, which may adversely affect our operations.\nIntellectual Property Risks\nOur success depends in part on our intellectual property, which we may be unable to protect.\nOur success depends in part on our proprietary technology. To protect this technology, we rely principally on contractual restrictions (such as nondisclosure and confidentiality provisions) in our agreements with employees, subcontractors, vendors, consultants and customers and on the common law of trade secrets and proprietary know-how. We also rely, in some cases, on patent and copyright protection, although this protection may in some cases be insufficient due to the rapid development of technology in our industry. We may not be successful in protecting our technology for a number of reasons, including the following:\nemployees, subcontractors, vendors, consultants and customers may violate their contractual agreements or post-employment non-competition obligations, and the cost of enforcing those agreements may be prohibitive, or those agreements may be unenforceable or more limited than we anticipate;\nforeign intellectual property laws may not adequately protect our intellectual property rights;\nour patent and copyright claims may not be sufficiently broad to effectively protect our technology; our patents or copyrights may be challenged, invalidated or circumvented; or we may otherwise be unable to obtain adequate protection for our technology; and\nwhen our patents expire, or if they are invalidated, narrowed or circumvented, our competitors may be able to utilize the inventions protected by our patents.\nAlso, competitors may copy or misappropriate our trade secrets, products or designs either through lawful means of reverse engineering or through independent development. We remain vigilant and take note of similar products and solutions offered by our competitors and, based on reasonable efforts, investigate whether any of our competitors products or solutions is the outcome of unlawful reverse engineering. For example, we are currently investigating a potential unlawful reverse engineering incident and, where necessary, plan to pursue appropriate legal action against parties that may be involved in such unlawful reverse engineering.\nCompetitors or third parties (including ex-employees violating their surviving contractual obligations with us) may also copy or reverse engineer aspects of our products or solutions through unlawful means, or illegally use information that we regard as proprietary. While we conduct active surveillance and monitor potential threats surrounding any unauthorized use from competitors or third parties, we may not be able to detect misuse of our proprietary information before it occurs. For example, as a result of our active surveillance, we have learned that certain ex-employees in China, who had access to materials containing proprietary information and trade secrets about our products and designs, may have provided them to their current employer that is our direct competitor. We continue to fully investigate this matter and, if appropriate, pursue litigation against all parties that may be involved to protect our confidential information and trade secrets.\nDespite our best efforts in active surveillance and monitoring, such policing may be difficult, time-consuming, non-definitive and non-exhaustive, and we cannot be certain that the steps we have taken will prevent misappropriation of our intellectual property.\nAdditionally, laws of foreign countries may not provide us with adequate remedy against unauthorized use of our intellectual property, or we may be unable to prove unauthorized use as prescribed by such foreign laws. In either case, if the protection of our intellectual property proves to be inadequate or unenforceable, others may be able to use our proprietary developments without compensation or appropriate remediation to us, resulting in potential cost advantages to our competitors and consequentially eroding our market share.\nFurthermore, our partners and alliances may have rights to technology developed by us. We may incur significant expense to protect or enforce our intellectual property rights. If we are unable to protect our intellectual property rights, our competitive position may be weakened.\nThird parties may claim we are infringing on their intellectual property, which could cause us to incur significant litigation costs or other expenses, or prevent us from selling some of our products.\nThe semiconductor industry is characterized by rapid technological change, with frequent introductions of new products and technologies. Industry participants often develop products and features similar to those introduced by others, creating a risk that their products and processes may give rise to claims they infringe on the intellectual property of others. We may unknowingly infringe on the intellectual property rights of others and incur significant liability for that infringement. If we are found to have infringed on the intellectual property rights of others, we could be enjoined from continuing to manufacture, market or use the affected product, or be required to obtain a license to continue manufacturing or using the affected product. A license could be very expensive to obtain or may not be available at all. Similarly, changing or re-engineering our products or processes to avoid infringing the rights of others may be costly, impractical or time consuming.\nOccasionally, third parties assert that we are, or may be, infringing on or misappropriating their intellectual property rights. Some of these assertions may not be legitimate. In these cases, we defend or in some instances dispel, and will continue to defend or dispel, against claims or negotiate licenses where we consider these actions appropriate. Intellectual property cases are uncertain, time-consuming and involve complex legal and factual questions. If we become involved in this type of litigation, it could consume significant resources and divert our attention from our business.\nInformation Technology and Enterprise System Risks\nWe may be subject to disruptions or failures in our information technology systems and network infrastructures that could have a material adverse effect on us.\nWe maintain and rely extensively on information technology systems and network infrastructures for the effective operation of our business. We also hold large amounts of data in data center facilities around the world, primarily in Singapore and the U.S., on which our business depends. A disruption, infiltration or failure of our information technology systems owned or used by us or any of our data centers as a result of software or hardware malfunctions, computer viruses, cyber-attacks, employee theft or misuse, power disruptions, natural disasters or accidents could cause breaches of data security and loss of critical data, which in turn could materially adversely affect our business. Our security procedures, such as virus protection software, data loss protection and our business continuity planning, such as our disaster recovery policies and back-up systems, may not be adequate or implemented properly to fully address the adverse effect of such events, which could adversely impact our operations.\nIn addition, our business could be adversely affected to the extent we do not make the appropriate level of investment in our technology systems as our technology systems become out-of-date or obsolete and are not able to deliver the type of data integrity and reporting we need to run our business. Furthermore, when we implement new systems and/or upgrade existing systems, we could be faced with temporary or prolonged disruptions that could adversely affect our business. For example, artificial intelligence (AI) may be used to generate cyberattacks with greater scale and efficacy than the traditional threat actors. In other instance, a cybersecurity threat could be introduced as the result of our business partners incorporating the output of an AI tool that includes a threat, such as introducing malicious code by incorporating an AI generated source code.\nWe have experienced, and expect to continue to be subject to, cybersecurity threats and incidents, ranging from employee error or misuse, to individual attempts to gain unauthorized access to information systems, to sophisticated and targeted measures known as advanced persistent threats, none of which have been material to the Company to date. We devote significant resources to network security and other measures to protect our systems and data from unauthorized access or misuse. However, depending on its nature and scope, cybersecurity incidents could result in business disruption; misappropriation, corruption or loss of confidential information and critical data (of the Company or that belonging to its third parties); reputational damage; litigation with third parties; diminution in the value of our investment in research, development and engineering; data privacy issues; and increased cybersecurity protection and remediation costs.\nWe also try to protect the confidential nature of our proprietary information by using commonly accepted information technology systems and network security measures. Such measures may not provide adequate protection for our proprietary information. For example, our internal procedures may not prevent an existing or former employee or consultant from misappropriating our trade secrets and providing them to a competitor, and recourse we take against such misconduct may not provide an adequate remedy to fully protect our interests.\nWhile we maintain insurance policies that may cover certain liabilities in connection with a cybersecurity incident, we cannot be certain that our insurance coverage will be adequate for liabilities actually incurred, that insurance will continue to be available to us on commercially reasonable terms, or at all, or that any insurer will not deny coverage as to any future claim.\nWe are implementing a new enterprise resource planning system. Our failure to implement it successfully, on time and on budget could have a material adverse effect on us.\nIn 2020 we began implementing a new enterprise resource planning (ERP) system, and will continue to implement the new system in phases across our various entities over the next two years. ERP implementations are complex, time-consuming, labor intensive, and involve substantial expenditures on system software and implementation activities. The ERP system is critical to our ability to provide important information to our management, obtain and deliver products, provide services and customer support, send invoices and track payments, fulfill contractual obligations, accurately maintain books and records, provide accurate, timely and reliable reports on our financial and operating results, and otherwise operate our business. ERP implementations also require transformation of business and financial processes in order to reap the benefits of the ERP system. Any such implementation involves risks inherent in the conversion to a new computer system, including loss of information and potential disruption to our normal operations. The implementation and maintenance of the new ERP system has required, and will continue to require, the investment of significant financial and human resources and the implementation may be subject to delays and cost overruns. In addition, we may not be able to successfully complete the implementation of the new ERP system without experiencing difficulties.\nAny disruptions, delays or deficiencies in the design and implementation or the ongoing maintenance of the new ERP system could adversely affect our ability to process orders, ship products, provide services and customer support, send invoices and track payments, fulfill contractual obligations, accurately maintain books and records, provide accurate, timely and reliable reports on our financial and operating results, including reports required by the SEC such as the evaluation of our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act of 2002, and otherwise operate our business. Additionally, if we do not effectively implement the ERP system as planned or the system does not operate as intended, the effectiveness of our internal control over financial reporting could be adversely affected or our ability to assess it adequately could be delayed.\nCurrency and Tax Risks\nWe are exposed to fluctuations in currency exchange rates that could negatively impact our financial results and cash flows.\nBecause most of our foreign sales are denominated in U.S. dollar, an increase in value of the U.S. dollar against foreign currencies will make our products more expensive than those offered by some of our foreign competitors. In addition, a weakening of the U.S. dollar against other currencies could make our costs in certain non-U.S. locations more expensive to fund. Our ability to compete overseas may therefore be materially and adversely affected by the fluctuations of the U.S. dollar against other currencies.\nBecause nearly all of our business is conducted outside the U.S., we face exposure to adverse movements in foreign currency exchange rates which could have a material adverse impact on our financial results and cash flows. Historically, our primary exposures have related to net working capital exposures denominated in currencies other than the foreign subsidiaries functional currency, and remeasurement of our foreign subsidiaries net monetary assets from the subsidiaries local currency into the subsidiaries functional currency. In general, an increase in the value of the U.S. dollar could require certain of our foreign subsidiaries to record translation and remeasurement gains. Conversely, a decrease in the value of the U.S. dollar could require certain of our foreign subsidiaries to record losses on translation and remeasurement. An increase in the value of the U.S. dollar could increase the cost to our customers of our products in those markets outside the U.S. where we sell in U.S. dollars, and a weakened U.S. dollar could increase the cost of local operating expenses and procurement of raw materials, both of which could have an adverse effect on our cash flows. Our primary exposures include the Singapore Dollar, Chinese Yuan, Japanese Yen, Swiss Franc, Philippine Peso, Thai Baht, Taiwan Dollar, South Korean Won, Israeli Shekel, Malaysian Ringgit and Euro. Although we have entered into foreign exchange forward contracts from time to time to hedge our operating expenses against certain foreign currency exposure, our attempts to hedge against these risks may not be successful and may result in a material adverse impact on our financial results and cash flows.\nChanges to our existing tax incentive in Singapore may materially reduce our reported results of operations in future periods.\nOur existing tax incentive, scheduled to expire in our fiscal 2025, allows certain classes of income to be subject to reduced income tax rates in Singapore provided we meet certain employment and investment conditions. If we cannot, or elect not to, comply with these conditions, we could be required to refund material tax benefits previously realized with respect to this tax incentive. Subsequent renewals are at the discretion of the Singapore government and we may not be able to extend the tax incentive arrangement beyond its expiration date or we may also elect not to renew this tax incentive arrangement. In the absence of the tax incentive, the income tax rate in Singapore that would otherwise apply is 17%, which would result in a significant increase in our provision for (benefit from) income taxes in future periods.\nChanges in tax legislation could adversely impact our future profitability.\nWe are subject to income taxes in the U.S. and many foreign jurisdictions. Tax laws and regulations are continuously evolving with corporate tax reform, base-erosion efforts, global minimum tax, and increased transparency continuing to be high priorities in many tax jurisdictions in which we operate. Although the timing and methods of implementation may vary, many countries, including those in the Asia/Pacific region in which we have significant operations, have implemented, or are in the process of implementing, legislation or practices inspired by the base erosion and profit shifting project undertaken by the Organization for Economic Co-operation and Development (OECD). In December 2021, the OECD issued its guidance on the Global Anti-Base Erosion (GloBE) rules with the purpose of ensuring multinational companies pay a minimum level tax on the income generated in each of the jurisdictions where they operate in. In December 2022, the European Council attained a consensus on Pillar Two of the GloBE rules to implement the 15% global minimum tax, and many EU and G20 countries have specified their plan to adhere to the OECD guidelines as early as fiscal 2025 which may materially impact our income tax expense. Further, the increased scrutiny on international tax and continuous changes to countries tax legislation may also affect the policies and decisions of tax authorities with respect to certain income tax and transfer pricing positions taken by the Company in prior or future periods. We continue to monitor new tax legislation or other developments since significant changes in tax legislation, or in the interpretation of existing legislation, could materially and adversely affect our financial condition and operating results.\nOther changes in taxation could materially impact our future effective tax rate.\nAdditionally, our future effective tax rate could be affected by numerous other factors including higher or lower than anticipated foreign earnings in various jurisdictions where we are subjected to tax rates that differ from the U.S. federal statutory tax rate, by changes in the valuation allowances recorded against certain deferred tax balances, or by changes in accounting principles and reporting requirements, or including the interpretations and application of such accounting principles and reporting requirements. Changes in our assertion for foreign earnings, whether permanently or non-permanently reinvested, as a result of changes in facts and circumstances or challenges by tax authorities to our historic or future tax positions and transfer pricing policies, could also significantly adversely impact our future effective tax rate.\nRisks Related to Our Shares and Corporate Law\nWe have the ability to issue additional equity securities, which would lead to dilution of our issued and outstanding common stock.\nWe may from time to time issue additional equity securities or securities convertible into equity securities, which would result in dilution of our existing shareholders equity interests in us. Our board of directors has the authority to issue, without vote or action of shareholders, preferred shares in one or more series, and has the ability to fix the rights, preferences, privileges and restrictions of any such series. Any such series of preferred shares could contain dividend rights, conversion rights, voting rights, terms of redemption, redemption prices, liquidation preferences or other rights superior to the rights of holders of our common stock. In addition, we are authorized to issue, without shareholder approval, up to an aggregate of 200 million common stock, of which approximately 56.3 million shares were outstanding as of September 30, 2023. We are also authorized to issue, without shareholder approval (except as required by the rules of the Nasdaq stock market), securities convertible into either common stock or preferred stock. We may issue such shares in connection with financing transactions, joint ventures, mergers and acquisitions or other purposes. In addition, our shareholders will experience additional dilution when performance or restricted share units vest and settle, when we issue equity awards to our employees under our equity incentive plans, or when we otherwise issue additional equity.\nAnti-takeover provisions in our articles of incorporation and bylaws and under Pennsylvania law may discourage other companies from attempting to acquire us.\nSome provisions of our articles of incorporation and bylaws as well as Pennsylvania law may discourage some transactions where we would otherwise experience a fundamental change. For example, our articles of incorporation and bylaws contain provisions that:\nclassify our board of directors into four classes, with one class being elected each year;\npermit our board to issue blank check preferred shares without shareholder approval; and\nprohibit us from engaging in some types of business combinations with a holder of 20% or more of our voting securities without super-majority board or shareholder approval.\nFurther, under the Pennsylvania Business Corporation Law, because our shareholders approved bylaw provisions that provide for a classified board of directors, shareholders may remove directors only for cause. These provisions and some other provisions of the Pennsylvania Business Corporation Law could delay, defer or prevent us from experiencing a fundamental change and may adversely affect our common shareholders' voting and other rights.\nIf our internal controls over financial reporting or our disclosure controls and procedures are not effective, we may not be able to accurately report our financial results or file our periodic reports in a timely manner, which may cause investors to lose confidence in our reported financial information and may lead to a decline in the trading price of our common stock.\nAs a public company, we are required to maintain internal control over financial reporting and disclosure controls and procedures. Section 404 of the Sarbanes-Oxley Act requires that we evaluate and determine the effectiveness of our internal control over financial reporting and provide a management report on our internal control over financial reporting. As described in Part II, Item 9A - Controls and Procedures of this Annual Report, we previously identified a material weakness in our internal control over financial reporting. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a companys annual or interim financial statements will not be prevented or detected on a timely basis. Management has concluded that this material weakness was remediated as of September 30, 2023. However, one or more material weaknesses may be identified in the future during the evaluation and testing process of our internal controls in future years. If we identify one or more material weaknesses in our internal control over financial reporting, we will be unable to certify that our internal control over financial reporting is effective, our consolidated financial statements may contain material misstatements and we could be required to revise or restate our financial results. This could materially and adversely affect our business, results of operations and financial condition, restrict our ability to access the capital markets, require us to expend significant resources to correct the material weakness, subject us to fines, penalties or judgments, harm our reputation, adversely affect the trading price of our common stock, or otherwise cause a decline in investor confidence. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. Item 2. PROPERTIES\nThe following table reflects our major facilities as of September 30, 2023:\nCountry Facility (1) Approximate Size Function Reportable Segment\nSingapore Serangoon 251,000 sq. ft. Corporate headquarters, manufacturing, technology, sales and service center Ball Bonding Equipment\nWedge Bonding Equipment\nAdvanced Solutions\nKranji 148,000 sq. ft. Manufacturing center Advanced Solutions\nChina Suzhou 155,000 sq. ft. Manufacturing, technology and shared support services center APS\nThe Netherlands Eindhoven 116,000 sq. ft. Manufacturing, technology, sales and service center All Others\nUnited States Fort Washington, Pennsylvania 88,000 sq. ft. Corporate headquarters, technology, sales and service center Ball Bonding Equipment\nAdvanced Solutions\nSanta Ana, California 65,000 sq. ft. Technology, sales and service center Wedge Bonding Equipment\nHorsham, Pennsylvania 28,000 sq. ft. Technology center Advanced Solutions\nIsrael Haifa 31,000 sq. ft. Manufacturing and technology center APS\nTaiwan Taipei 20,000 sq. ft. Manufacturing and technology center All Others\n(1)Each of the facilities listed in this table is leased other than the facilities in Suzhou, China and Fort Washington, Pennsylvania.\nIn addition, the Company rents space for sales support, customer support, services and administrative functions in China, Germany, Japan, Malaysia, South Korea, Switzerland, Taiwan, Thailand, Vietnam and the Philippines. The Company believes the facilities are generally in good condition and suitable to the extent of utilization needed. Item 3. LEGAL PROCEEDINGS\nFrom time to time, we may be a plaintiff or defendant in legal proceedings and claims arising out of our business. We are party to ordinary, routine litigation incidental to our business. We cannot be assured of the results of any pending or future litigation, but we do not believe resolution of any currently pending matters will materially or adversely affect our business, financial condition or operating results. Item 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II Item 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is traded on The Nasdaq Global Market (Nasdaq) under the symbol KLIC. On November 13, 2023, there were approximately 145 holders of record of the shares of outstanding common stock.\nOn August 23, 2023, June 8, 2023, March 2, 2023 and November 16, 2022, the Board of Directors declared a quarterly dividend $0.19 per share of common stock. During the fiscal year ended September 30, 2023, the Company declared dividends of $0.76 per share of common stock. The declaration of any future cash dividend is at the discretion of the Board of Directors, subject to applicable laws, and will depend on the Companys financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination that such dividends are in the best interests of the Companys stockholders.\nFor the purpose of calculating the aggregate market value of shares of our common stock held by non-affiliates, as shown on the cover page of this report, we have assumed all of our outstanding shares were held by non-affiliates except for shares held by our directors and executive officers. However, this does not necessarily mean that all directors and executive officers of the Company are, in fact, affiliates of the Company, or there are no other persons who may be deemed to be affiliates of the Company. Further information concerning the beneficial ownership of our executive officers, directors and principal shareholders will be included in our Proxy Statement for the 2024 Annual Meeting of Shareholders to be filed with the Securities and Exchange Commission.\nRecent Sales of Unregistered Securities and Use of Proceeds\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nThe following table summarizes the repurchases of common stock during the three months ended September 30, 2023 (in thousands, except per share amounts):\nPeriod Total Number of Shares Purchased Average Price Paid Per Share Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs Approximate Dollar Value of Shares That May Yet Be Purchased Under the Plans or Programs (1)\nJuly 2, 2023 to July 29, 2023 16 $ 57.45 16 $ 189,313\nJuly 30, 2023 to September 2, 2023 48 $ 52.08 48 $ 186,811\nSeptember 3, 2023 to September 30, 2023 119 $ 48.39 119 $ 181,042\nFor the three months ended September 30, 2023 183 183\n(1)On August 15, 2017, the Companys Board of Directors authorized a program (the Program) to repurchase up to $100 million in total of the Companys common stock on or before August 1, 2020. In 2018, 2019 and 2020, the Board of Directors increased the share repurchase authorization under the Program to $200 million, $300 million and $400 million respectively. On March 3, 2022, the Board of Directors further increased the share repurchase authorization under the Companys existing share repurchase program by an additional $400 million to $800 million, and extended its duration through August 1, 2025. The Company may purchase shares of its common stock through open market and privately negotiated transactions at prices deemed appropriate by management. On May 7, 2022, the Company entered into a written trading plan under Rule 10b5-1 of the Exchange Act to facilitate repurchases under the Program. This trading plan was most recently modified on May 29, 2023. The Program may be suspended or discontinued at any time and will be funded using the Companys available cash, cash equivalents and short-term investments. The timing and amount of repurchase transactions under the Program depend on market conditions as well as corporate and regulatory considerations. Item 6. [Reserved]\nNot applicable. Item 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis section of this Form 10-K generally discusses fiscal 2023 and 2022 items and year-to-year comparisons between fiscal 2023 and 2022. Discussions of fiscal 2021 items and year-to-year comparisons between fiscal 2022 and 2021 that are not included in this Form 10-K can be found in Managements Discussion and Analysis of Financial Condition and Results of Operations in Part II, Item 7 of the 2022 Annual Report filed on November 17, 2022, and amended on August 8, 2023 (the 2022 Annual Report).\nOur Managements Discussion and Analysis (MD&A) is provided in addition to the accompanying consolidated financial statements and notes to assist readers in understanding our results of operations, financial condition, and cash flows. The MD&A is organized as follows:\nOverview: Introduction of our operations, key events, business environment, technology leadership, products and services\nCritical Accounting Policies and Estimates\nRecent Accounting Pronouncements\nResults of Operations\nLiquidity and Capital Resources\nOther Obligations and Contingent Payments\nOverview\nFor an overview of our business, please see Part I, Item 1 - Business.\nCritical Accounting Policies and Estimates\nThe preparation of consolidated financial statements requires us to make assumptions, estimates and judgments that affect the reported amounts of assets and liabilities, net revenue and expenses during the reporting periods, and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements. On an ongoing basis, we evaluate estimates, including, but not limited to, those related to accounts receivable, reserves for excess and obsolete inventory, carrying value and lives of fixed assets, goodwill and intangible assets, income taxes, equity-based compensation expense and warranties. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable. As a result, we make judgments regarding the carrying values of our assets and liabilities that are not readily apparent from other sources. Authoritative pronouncements, historical experience and assumptions are used as the basis for making estimates, and on an ongoing basis, we evaluate these estimates. Actual results may differ from these estimates.\nWe believe the following critical accounting policies, which have been reviewed with the Audit Committee of our Board of Directors, reflect our more significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenue Recognition\nIn accordance with ASC No. 606, Revenue from Contracts with Customers, the Company recognizes revenue when we satisfy performance obligations as evidenced by the transfer of control of our products or services to customers. In general, the Company generates revenue from product sales, either directly to customers or to distributors. In determining whether a contract exists, we evaluate the terms of the agreement, the relationship with the customer or distributor and their ability to pay.\nThe Company recognizes revenue from sales of our products, including sales to our distributors, at a point in time, generally upon shipment or delivery to the customer or distributor, depending upon the terms of the sales order. Control is considered transferred when title and risk of loss pass, when the customer becomes obligated to pay and, where applicable, when the customer has accepted the products or upon expiration of the acceptance period. For sales to distributors, payment is due on our standard commercial terms and is not contingent upon resale of the products.\nOur business is subject to contingencies related to customer orders, including:\nRight of Return: A large portion of our revenue comes from the sale of equipment used in the semiconductor assembly process. Other product sales relate to consumable products, which are sold in high-volume quantities, and are generally maintained at low stock levels at the customers facility. Customer returns have historically represented a very small percentage of customer sales on an annual basis.\nWarranties: Our equipment is generally shipped with a one-year warranty against manufacturing defects. We establish reserves for estimated warranty expense when revenue for the related equipment is recognized. The reserve for estimated warranty expense is based upon historical experience and managements estimate of future expenses, including product parts replacement, freight charges and labor costs expected to be incurred to correct product failures during the warranty period.\nConditions of Acceptance: Sales of our consumable products generally do not have customer acceptance terms. In certain cases, sales of our equipment have customer acceptance clauses which may require the equipment to perform in accordance with customer specifications or when installed at the customers facility. In such cases, if the terms of acceptance are satisfied at our facility prior to shipment, the revenue for the equipment will be recognized upon shipment. If the terms of acceptance are satisfied at our customers facilities, the revenue for the equipment will not be recognized until acceptance, which is typically obtained after installation and testing, is received from the customer.\nService revenue is generally recognized over time as the services are performed.\nThe Company measures revenue based on the amount of consideration we expect to be entitled to in exchange for products or services. Any variable consideration such as sales incentives are recognized as a reduction of net revenue at the time of revenue recognition.\nThe length of time between invoicing and payment is not significant under our payment terms. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. Shipping and handling costs billed to customers are recognized in net revenue.\nShipping and handling costs paid by the Company are included in cost of sales.\nAllowance for Doubtful Accounts\nWe maintain allowances for doubtful accounts for estimated losses resulting from our customers failure to make required payments. If the financial condition of our customers were to deteriorate, resulting in an impairment of their ability to make payments, additional allowances may be required. We are subject to concentrations of customers and sales to a few geographic locations, which could also impact the collectability of certain receivables. If global or regional economic conditions deteriorate or political conditions were to change in some of the countries where we do business, it could have a significant impact on our results of operations, and our ability to realize the full value of our accounts receivable.\nInventories\nInventories are stated at the lower of cost (on a first-in, first-out basis) or net realizable value. We generally provide reserves for obsolete inventory and for inventory considered to be in excess of demand. Demand is generally defined as 18 months forecasted future consumption for equipment, 24 months forecasted future consumption for spare parts, and 12 months forecasted future consumption for tools. Forecasted consumption is based upon internal projections, historical sales volumes, customer order activity and a review of consumable inventory levels at customers facilities. We communicate forecasts of our future consumption to our suppliers and adjust commitments to those suppliers accordingly. If required, we reserve the difference between the carrying value of our inventory and the lower of cost or net realizable value, based upon projections about future consumption, and market conditions. If actual market conditions are less favorable than projections, additional inventory reserves may be required.\nInventory reserve provision for certain subsidiaries is determined based on managements estimate of future consumption for equipment and spare parts. This estimate is based on historical sales volumes, internal projections and market developments and trends.\nAccounting for Impairment of Goodwill\nASC No. 350, Intangibles-Goodwill and Other requires goodwill and other intangible assets with indefinite lives to be reviewed for impairment annually, or more frequently if circumstances indicate a possible impairment. We assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If, after assessing the qualitative factors, a company determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying value, then performing the impairment test is unnecessary. However, if a company concludes otherwise, then it is required to perform the goodwill impairment test. The Companys impairment test is performed by comparing the fair value of a reporting unit with its carrying value, and determining if the carrying amount exceeds its fair value.\nAs part of the annual evaluation, the Company performs an impairment test of its goodwill in the fourth quarter of each fiscal year to coincide with the completion of its annual forecasting and refreshing of its business outlook processes. On an ongoing basis, the Company monitors if a triggering event has occurred that may have the effect of reducing the fair value of a reporting unit below its respective carrying value. Adverse changes in expected operating results and/or unfavorable changes in other economic factors used to estimate fair values could result in a non-cash impairment charge in the future.\nImpairment assessments inherently involve judgment as to the assumptions made about the expected future cash flows and the impact of market conditions on those assumptions. Future events and changing market conditions may impact the assumptions as to prices, costs, growth rates or other factors that may result in changes in the estimates of future cash flows. Although the Company believes the assumptions that it has used in testing for impairment are reasonable, significant changes in any one of the assumptions could produce a significantly different result. Indicators of potential impairment, including significant and unforeseen customer losses, a significant adverse change in legal factors or in the business climate, a significant adverse action or assessment by a regulator, a significant stock price decline or unanticipated competition, may lead the Company to perform interim goodwill impairment assessments.\nFor further information on goodwill and other intangible assets, see Note 4 to our consolidated financial statements in Item 8.\nIncome Taxes\nIn accordance with ASC No. 740, Income Taxes, deferred income taxes are determined using the balance sheet method. The Company records a valuation allowance to reduce its deferred tax assets to the amount expected, on a more likely than not basis, to be realized. While the Company has considered future taxable income and ongoing tax planning strategies in assessing the need for the valuation allowance, if it were to determine that it would be able to realize its deferred tax assets in the future in excess of its net recorded amount, an adjustment to deferred tax assets would increase income in the period when such determination is made. Likewise, should the Company determine that it would not be able to realize all or part of its deferred tax assets in the future, an adjustment to deferred tax assets would decrease income in the period when such determination is made.\nThe Company determines the amount of unrecognized tax benefit with respect to uncertain tax positions taken or expected to be taken on its income tax returns in accordance with ASC No. 740 Topic 10, Income Taxes, General (ASC 740.10). Under ASC 740.10, the Company utilizes a two-step approach for evaluating uncertain tax positions. Step one, or recognition, requires a company to determine if the weight of available evidence indicates a tax position is more likely than not to be sustained upon examination solely based on its technical merit. Step two, or measurement, is based on the largest amount of benefit, which is more likely than not to be realized on settlement with the taxing authority, including resolution of related appeals or litigation processes, if any.\nEquity-Based Compensation\nThe Company accounts for equity-based compensation under the provisions of ASC No. 718, Compensation - Stock Compensation (ASC 718). ASC 718 requires the recognition of the fair value of the equity-based compensation in net income. Compensation expense associated with Relative TSR Performance Share Units is determined using a Monte-Carlo valuation model, and compensation expense associated with time-based and Growth Performance Share Units is determined based on the number of shares granted and the fair value on the date of grant. See Note 11 to our consolidated financial statements in Item 8 for a summary of the terms of these performance-based awards. The fair value of equity-based awards is amortized over the vesting period of the award and the Company elected to use the straight-line method for awards granted after the adoption of ASC 718.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 1 to our consolidated financial statements in Item 8 for a description of certain recent accounting pronouncements, including the expected dates of adoption and effects on our consolidated results of operations and financial condition.\nRESULTS OF OPERATIONS\nResults of Operations for fiscal 2023 and 2022\nThe following table reflects the income from operations for fiscal 2023 and 2022:\nFiscal\n(dollar amounts in thousands) 2023 2022 $ Change % Change\nNet revenue $ 742,491 $ 1,503,620 $ (761,129) (50.6) %\nCost of sales 383,836 755,300 (371,464) (49.2) %\nGross profit 358,655 748,320 (389,665) (52.1) %\nSelling, general and administrative 152,982 140,050 12,932 9.2 %\nResearch and development 144,701 136,852 7,849 5.7 %\nImpairment charges 21,535 1,346 20,189 1,499.9 %\nOperating expenses 319,218 278,248 40,970 14.7 %\nIncome from operations $ 39,437 $ 470,072 $ (430,635) (91.6) %\nBookings and Backlog\nOur backlog consists of customer orders scheduled for shipment within the next twelve months. A booking is recorded when a customer order is reviewed and it is determined that all specifications can be met, production (or service) can be scheduled, a delivery date can be set, and the customer meets our credit requirements. We use bookings to evaluate the results of our operations, generate future operating plans and assess the performance of our Company. While we believe that this measure is useful in evaluating our business, this information should be considered as supplemental in nature and is not meant as a substitute for revenue recognized in accordance with GAAP. In addition, other companies, including companies in our industry, may calculate bookings differently or not at all, which reduces its usefulness as a comparative measure. Reconciliation of bookings to net revenue is not practicable. A majority of our orders are subject to cancellation or deferral by our customers with limited or no penalties. Also, customer demand for our products can vary dramatically without prior notice. Because of the volatility of customer demand, possibility of customer changes in delivery schedules or cancellations and potential delays in product shipments, our backlog as of any particular date may not be indicative of net revenue for any succeeding period.\nThe following tables reflect the bookings and backlog for fiscal 2023 and 2022:\nFiscal\n(in thousands) 2023 2022\nBookings $ 656,170 $ 1,226,524\nAs of\n(in thousands) September 30, 2023 October 1, 2022\nBacklog $ 423,824 $ 510,145\nThe semiconductor industry is volatile and our operating results are adversely impacted by volatile worldwide economic conditions. Though the semiconductor industrys cycle can be independent of the general economy, global economic conditions may have a direct impact on demand for semiconductor units and ultimately demand for semiconductor capital equipment and expendable tools. Accordingly, our business and financial performance is impacted, both positively and negatively, by fluctuations in the macroeconomic environment. Our visibility into future demand is generally limited and forecasting is difficult. There can be no assurances regarding levels of demand for our products and we believe historical industry-wide volatility will persist.\nThe U.S. and several other countries have levied tariffs on certain goods. In particular, trade tensions between the U.S. and China have been escalating since 2018, with U.S. tariffs on Chinese goods and retaliatory Chinese tariffs on U.S. goods. These have resulted in uncertainties in the semiconductor, LED, memory and automotive markets. While the Company anticipates long-term growth in semiconductor consumption, we observed trade-related adverse impacts in demand from China, which continues to persist in fiscal 2023 and beyond.\nNet Revenue\nOur net revenues for fiscal 2023 decreased as compared to our net revenues for fiscal 2022. The decrease in net revenue is primarily due to lower volume in Ball Bonding Equipment, Wedge Bonding Equipment, Advanced Solutions, APS and All Others, as further outlined in the tables presented immediately below.\nThe following table reflects the net revenue by reportable segment for fiscal 2023 and 2022:\nFiscal\n(dollar amounts in thousands) 2023 2022 $ Change % Change\nNet revenue % of total net revenue Net revenue % of total net revenue\nBall Bonding Equipment $ 287,465 38.7 % $ 909,428 60.5 % $ (621,963) (68.4) %\nWedge Bonding Equipment 175,550 23.6 % 194,086 12.9 % (18,536) (9.6) %\nAdvanced Solutions 72,256 9.7 % 94,683 6.3 % (22,427) (23.7) %\nAPS 160,718 21.7 % 197,152 13.1 % (36,434) (18.5) %\nAll Others 46,502 6.3 % 108,271 7.2 % (61,769) (57.1) %\nTotal net revenue $ 742,491 100.0 % $ 1,503,620 100.0 % $ (761,129) (50.6) %\nBall Bonding Equipment\nFor fiscal 2023, the lower Ball Bonding Equipment net revenue as compared to fiscal 2022 was due to lower volume of customer purchases primarily in the General Semiconductor and Memory markets. The lower volume in these end markets was a result of uncertainties in the overall macroeconomic environment, leading to a decline in consumer and industrial purchases. This was exacerbated by the high semiconductor supply chain inventories, which contributed to low utilization of our equipment by our customers, resulting in lower demand for our products.\nWedge Bonding Equipment\nFor fiscal 2023, the lower Wedge Bonding Equipment net revenue as compared to fiscal 2022 was due to lower volume of customer purchases primarily in the General Semiconductor market due to the lower power discrete devices demand, which was partially offset by the higher volume of customer purchases in the automotive and renewable energy market.\nAdvanced Solutions\nFor fiscal 2023, the lower Advanced Solutions net revenue as compared to fiscal 2022 was due to timing of revenue recognition for certain customer contracts, which was partially offset by the higher volume of customer purchases in the General Semiconductor market.\nAPS\nFor fiscal 2023, the lower APS net revenue as compared to fiscal 2022 was primarily due to lower volume of customer purchases primarily in spares, services and bonding tools. The lower volume was also due to low utilization of our equipment resulting from the decline in consumer and industrial purchases and high semiconductor supply chain inventories.\nAll Others\nFor fiscal 2023, the lower net revenue in the All Others category as compared to fiscal 2022 was primarily due to lower volume of customer purchases in the General Semiconductor market and mini LED transfer solutions market. The lower volume was a result of uncertainties in the overall macroeconomic environment, leading to a decline in consumer purchases.\nGross Profit Margin\nThe following table reflects the gross profit as a percentage of net revenue by reportable segment for fiscal 2023 and 2022:\nFiscal\n2023 2022 Basis point\nchange\nBall Bonding Equipment 45.6 % 49.0 % (340)\nWedge Bonding Equipment 52.1 % 48.1 % 400\nAdvanced Solutions 37.4 % 33.7 % 370\nAPS 55.2 % 60.5 % (530)\nAll Others 44.4 % 54.5 % (1,010)\nTotal gross margin 48.3 % 49.8 % (150)\nBall Bonding Equipment\nFor fiscal 2023, the lower Ball Bonding Equipment gross profit margin as compared to fiscal 2022 was primarily driven by lower volume of customer purchases resulting from uncertainties in the overall macroeconomic environment and high semiconductor supply chain inventories, less favorable product mix, including lower sales of higher margin products, and less favorable customer mix.\nWedge Bonding Equipment\nFor fiscal 2023, the higher Wedge Bonding Equipment gross profit margin as compared to fiscal 2022 was primarily driven by favorable product mix, including higher sales of higher margin products.\nAdvanced Solutions\nFor fiscal 2023, the higher Advanced Solutions gross profit margin as compared to fiscal 2022 was primarily due to the reversal of previously accrued customer credit program due to the change in accounting estimates resulting from new information.\nAPS\nFor fiscal 2023, the lower APS gross profit margin as compared to fiscal 2022 was primarily driven by lower volume, less favorable product mix among the spares, services and bonding tools, and lower average selling prices of bonding tools.\nAll Others\nFor fiscal 2023, the lower All Others gross profit margin as compared to fiscal 2022 was primarily due to less favorable product mix. This was partially offset by the reversal of previously accrued customer credit program due to the change in accounting estimates resulting from new information.\nOperating Expenses\nThe following table reflects the operating expenses for fiscal 2023 and 2022:\nFiscal\n(dollar amounts in thousands) 2023 2022 $ Change % Change\nSelling, general and administrative $ 152,982 $ 140,050 $ 12,932 9.2 %\nResearch and development 144,701 136,852 $ 7,849 5.7 %\nImpairment charges 21,535 1,346 $ 20,189 1499.9 %\nTotal $ 319,218 $ 278,248 $ 40,970 14.7 %\nSelling, General and Administrative (SG&A)\nFor fiscal 2023, the higher SG&A expenses as compared to fiscal 2022 was primarily due to $15.4 million net unfavorable variance in foreign exchange, $2.7 million higher staff costs due to an increase in headcount, $1.7 million higher professional services and $1.2 million higher amortization. These were partially offset by $10.5 million lower sales representative commissions.\nResearch and Development (R&D)\nFor fiscal 2023, the higher R&D expenses as compared to fiscal 2022 was primarily due to $4.2 million higher prototype material costs and $3.3 million higher staff costs related to an increase in headcount.\nImpairment Charges\nFor fiscal 2023, the Company recognized a non-cash impairment charge of $21.5 million related to goodwill and intangible assets in the Lithography reporting unit, as well as on an investment in a non-marketable equity security. The impairment charge in the prior year period relates to the impairment on an investment in a non-marketable equity security. See Note 4: Goodwill and Intangible Assets and Note 6: Equity Investments of the Notes to the Consolidated Financial Statements for further information.\nIncome from Operations\nFor fiscal 2023, total income from operations was lower as compared to fiscal 2022. This was primarily due to lower gross profit and higher operating expenses in fiscal 2023.\nThe following tables reflect the income/(loss) from operations by reportable segment for fiscal 2023 and 2022:\nFiscal\n(dollar amounts in thousands) 2023 2022 $ Change % Change\nBall Bonding Equipment $ 81,929 $ 385,276 $ (303,347) (78.7) %\nWedge Bonding Equipment 63,088 66,649 (3,561) (5.3) %\nAdvanced Solutions (32,530) (15,389) (17,141) (111.4) %\nAPS 47,654 82,473 (34,819) (42.2) %\nAll Others (36,797) 25,732 (62,529) (243.0) %\nCorporate expenses (83,907) (74,669) (9,238) (12.4) %\nTotal income from operations $ 39,437 $ 470,072 $ (430,635) (91.6) %\nBall Bonding Equipment, Wedge Bonding Equipment, Advanced Solutions, APS and All Others\nFor fiscal 2023, the lower Ball Bonding Equipment, Wedge Bonding Equipment, and APS income from operations as compared to the prior year period was primarily due to the decrease in revenue and changes in operating expenses as explained under Net Revenue and Operating Expenses above.\nFor fiscal 2023, the higher Advanced Solutions loss from operations as compared to the prior year period was primarily due to the decrease in revenue and changes in operating expenses as explained under Net Revenue and Operating Expenses above.\nFor fiscal 2023, the loss from operations in the All Others category as compared to the income from operations in prior year period was primarily due to decrease in revenue as explained under Net Revenue above, the goodwill impairment charge, integration of newly acquired business and net unfavorable variance in foreign exchange.\nInterest Income and Expense\nThe following table reflects the interest income and interest expense for fiscal 2023 and 2022:\nFiscal\n(dollar amounts in thousands) 2023 2022 $ Change % Change\nInterest income $ 32,906 $ 7,124 $ 25,782 361.9 %\nInterest expense $ (142) $ (208) $ 66 (31.7) %\nInterest income\nFor fiscal 2023, the higher interest income as compared to fiscal 2022 was primarily due to higher weighted average interest rates on cash, cash equivalents and short-term investments.\nProvision for Income Taxes\nThe following table reflects the provision for income taxes and the effective tax rate for fiscal 2023 and 2022:\nFiscal\n(dollar amounts in thousands) 2023 2022 Change\nProvision for income taxes $ 15,053 $ 43,443 $ (28,390)\nEffective tax rate 20.8 % 9.1 % 11.7 %\nFor fiscal 2023, the decrease in provision for income taxes as compared to fiscal 2022 was primarily due to a decrease in profitability and the increase in effective tax rate was primarily related to the increase in the Global Intangible Low-Taxed Income (GILTI), resulting from the capitalization of research and development expenditures as mandated by the U.S. Tax Cuts and Jobs Act of 2017 (TCJA) effective in fiscal 2023 and the net release of valuation allowances recorded against certain loss and credit carryforwards in fiscal 2022, partially offset by tax benefits from changes jurisdictional mix of profitability.\nPlease refer to Note 15: Income Taxes to our consolidated financial statements in Item 8 for additional information.\nLIQUIDITY AND CAPITAL RESOURCES\nThe following table reflects the total cash, cash equivalents and short-term investments as of September 30, 2023 and October 1, 2022:\nAs of\n(dollar amounts in thousands) September 30, 2023 October 1, 2022 Change\nCash and cash equivalents $ 529,402 $ 555,537 $ (26,135)\nShort-term investments 230,000 220,000 10,000\nTotal cash, cash equivalents, and short-term investments $ 759,402 $ 775,537 $ (16,135)\nPercentage of total assets 50.6 % 48.8 %\nThe following table reflects the summarized Consolidated Statements of Cash Flows information for fiscal 2023 and 2022:\nFiscal\n(in thousands) 2023 2022\nNet cash provided by operating activities $ 173,404 $ 390,188\nNet cash (used in) / provided by investing activities (91,338) 133,799\nNet cash used in financing activities (111,876) (321,191)\nEffect of exchange rate changes on cash and cash equivalents 3,675 (10,047)\nChanges in cash, and cash equivalents $ (26,135) $ 192,749\nCash and cash equivalents, beginning of period 555,537 362,788\nCash and cash equivalents, end of period $ 529,402 $ 555,537\nFiscal 2023\nNet cash provided by operating activities consisted of net income of $57.1 million, non-cash adjustments of $73.8 million and a net favorable change in operating assets and liabilities of $42.4 million. The net change in operating assets and liabilities was primarily driven by a decrease in accounts and notes receivable of $152.7 million and prepaid expenses and other current assets of $8.6 million. This was partially offset by a decrease in accounts payable and accrued expenses and other current liabilities of $52.3 million, and income tax payable of $29.3 million, and an increase in inventories of $35.8 million.\nThe decrease in accounts and other receivable was primarily due to lower sales in fiscal 2023. The decrease in accounts payable and accrued expenses and other current liabilities was primarily due to higher payments to suppliers, lower material purchases and lower accrued employee compensation that was paid out in the period. The increase in inventories was due to slower utilization in the period and buildup of long lead time materials to fulfill certain customer purchase orders. The decrease in income tax payable was primarily due to lower profitability.\nThe net cash used in investing activities was due to net purchase of short-term investments of $10.0 million, cash outflow for the AJA acquisition of $36.9 million and capital expenditures of $44.4 million.\nThe net cash used in financing activities was primarily due to common stock repurchases of $69.2 million and dividend payments of $42.0 million.\nFiscal 2022\nNet cash provided by operating activities consisted of net income of $433.5 million, non-cash adjustments of $22.6 million and a net unfavorable change in operating assets and liabilities of $65.9 million. The net change in operating assets and liabilities was primarily driven by a decrease in accounts payable and accrued expenses and other current liabilities of $128.7 million, and an increase in prepaid expenses and other current assets of $37.9 million and inventories of $14.9 million. This was partially offset by a decrease in accounts and notes receivable of $113.3 million and income tax payable of $4.9 million.\nThe decrease in accounts payable and accrued expenses and other current liabilities was primarily due to lower purchases in the fourth quarter of fiscal 2022, lower accrued employee compensation, accrued customer obligations and accrued commissions. The increase in prepaid expenses and other current assets was mainly due to the addition of contract assets in fiscal 2022. The increase in inventories was due to increased manufacturing activities to meet higher demand in the first half of fiscal 2022 followed by slower utilization due to lower demand in the second half of fiscal 2022. The decrease in accounts and notes receivable was due to lower sales in the fourth quarter of fiscal 2022 and a change in customer mix of different credit terms.\nThe net cash provided by investing activities was primarily due to net maturity of short-term investments of $157.0 million, partially offset by capital expenditures of $23.0 million.\nThe net cash used in financing activities was primarily due to common stock repurchases of $281.3 million and dividend payments of $39.4 million.\nFiscal 2024 Liquidity and Capital Resource Outlook\nWe expect our fiscal 2024 capital expenditures to be between $23.0 million and $27.0 million. The actual amounts for fiscal 2024 will vary depending on market conditions. Expenditures are anticipated to be primarily used for research and development projects, enhancements to our manufacturing operations, improvements to our information technology security, implementation of our enterprise resource planning system and leasehold improvements for our facilities. Our ability to make these expenditures will depend, in part, on our future cash flows, which are determined by our future operating performance and, therefore, subject to prevailing macroeconomic conditions, trade tensions, inflationary pressures, geopolitical tensions, including the ongoing Israel-Hamas war, tensions in the Middle East, and the prolonged Ukraine/Russia conflict, and other factors, some of which are beyond our control.\nAs of September 30, 2023 and October 1, 2022, approximately $576.9 million and $499.8 million of cash, cash equivalents, and short-term investments were held by the Companys foreign subsidiaries, respectively, with a large portion of the cash amounts expected to be available for use in the U.S. without incurring additional U.S. income tax.\nThe Companys operations and capital requirements are funded primarily by cash on hand, cash generated by foreign operating activities and cash from our existing Facility Agreements. We believe these sources of cash and liquidity are sufficient to meet our additional liquidity needs for the foreseeable future including repayment of any outstanding balances under our existing Facility Agreements, as well as payment of dividends, share repurchases and income taxes.\nWe believe that our existing cash, cash equivalents, short-term investments, existing Facility Agreements, and anticipated cash flows from operations will be sufficient to meet our liquidity and capital requirements, notwithstanding the macroeconomic headwinds, for the next twelve months and beyond. Our liquidity is affected by many factors, some based on normal operations of our business and others related to macroeconomic conditions including inflationary pressures, industry-related uncertainties, and effects arising from the ongoing Israel-Hamas war and the prolonged Ukraine/Russia conflict, which we cannot predict. We also cannot predict economic conditions and industry downturns or the timing, strength or duration of recoveries. We intend to continue to use our cash for working capital needs and for general corporate purposes.\nIn this unprecedented macroeconomic environment, and as a result of the ongoing Israel-Hamas war and the prolonged Ukraine/Russia conflict or for other reasons, we may seek, as we believe appropriate, additional debt or equity financing which would provide capital for corporate purposes, working capital funding, additional liquidity needs or to fund future growth opportunities, including possible acquisitions. The timing and amount of potential capital requirements cannot be determined at this time and will depend on a number of factors, including our actual and projected demand for our products, semiconductor and semiconductor capital equipment industry conditions, competitive factors, the condition of financial markets and the global economic situation.\nShare Repurchase Program\nOn August 15, 2017, the Companys Board of Directors authorized the Program to repurchase up to $100 million of the Companys common stock on or before August 1, 2020. In 2018, 2019 and 2020, the Board of Directors increased the share repurchase authorization under the Program to $200 million, $300 million and $400 million, respectively. On March 3, 2022, the Board of Directors increased the share repurchase authorization under the Program by an additional $400 million to $800 million, and extended its duration through August 1, 2025. On May 7, 2022, the Company entered into a written trading plan under Rule 10b5-1 of the Exchange Act to facilitate repurchases under the Program. This trading plan was most recently modified on May 29, 2023. The Program may be suspended or discontinued at any time and is funded using the Companys available cash, cash equivalents and short-term investments. Under the Program, shares may be repurchased through open market and/or privately negotiated transactions at prices deemed appropriate by management. The timing and amount of repurchase transactions under the Program depend on market conditions as well as corporate and regulatory considerations.\nDuring the fiscal year ended September 30, 2023, the Company repurchased a total of approximately 1,515.0 thousand shares of common stock at a cost of approximately $68.1 million. The stock repurchases were recorded in the periods they were delivered and accounted for as treasury stock in the Companys Consolidated Balance Sheets. The Company records treasury stock purchases under the cost method using the first-in, first-out (FIFO) method. Upon re-issuance of treasury stock, amounts in excess of the acquisition cost are credited to additional paid-in capital. If the Company reissues treasury stock at an amount below its acquisition cost and additional paid-in capital associated with prior treasury stock transactions is insufficient to cover the difference between acquisition cost and the reissue price, this difference is recorded against retained earnings.\nAs of September 30, 2023, our remaining stock repurchase authorization under the Program was approximately $181.0 million.\nDividends\nOn August 23, 2023, June 8, 2023, March 2, 2023 and November 16, 2022, the Board of Directors declared a quarterly dividend $0.19 per share of common stock. During the fiscal year ended September 30, 2023, the Company declared dividends of $0.76 per share of common stock. The declaration of any future cash dividend is at the discretion of the Board of Directors and will depend on the Companys financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination that such dividends are in the best interests of the Companys stockholders.\nOther Obligations and Contingent Payments\nIn accordance with U.S. generally accepted accounting principles, certain obligations and commitments as of September 30, 2023 are appropriately not included in the Consolidated Balance Sheets and Statements of Operations in this Form 10-K. However, because these obligations and commitments are entered into in the normal course of business and because they may have a material impact on our liquidity, we have disclosed them in the table below.\nAdditionally, as of September 30, 2023, the Company had deferred tax liabilities of $37.3 million and unrecognized tax benefit recorded within the income tax payable for uncertain tax positions of $17.7 million, including related accrued interest of $2.8 million. These amounts are not included in the contractual obligation table below because we are unable to reasonably estimate the timing of these payments at this time.\nThe following table presents certain payments due by the Company under contractual obligations with minimum firm commitments as of September 30, 2023:\nPayments due in\n(in thousands) Total Less than 1 year 1 - 3 years 3 - 5 years More than 5 years\nInventory purchase obligations (1)\n$ 182,567 182,567 $ - $ - $ -\nU.S. one-time transition tax payable (2)\n(reflected on our Balance Sheets)\n47,686 12,606 35,080 - -\nTotal $ 230,253 $ 195,173 $ 35,080 $ - $ -\n(1)We order inventory components in the normal course of our business. A portion of these orders are non-cancellable and a portion may have varying penalties and charges in the event of cancellation.\n(2)Associated with the U.S. one-time transition tax on certain earnings and profits of our foreign subsidiaries in relation to the TCJA.\nCredit Facilities\nOn February 15, 2019, the Company entered into a Facility Letter and Overdraft Agreement (collectively, the Facility Agreements) with MUFG Bank, Ltd., Singapore Branch (the Bank). The Facility Agreements provide the Company and one of its subsidiaries with an overdraft facility of up to $150.0 million (the Overdraft Facility) for general corporate purposes. Amounts outstanding under the Overdraft Facility, including interest, are payable upon thirty days written demand by the Bank. Interest on the Overdraft Facility is calculated on a daily basis, and the applicable interest rate is calculated at the Secured Overnight Financing Rate (SOFR) plus a margin of 1.5% per annum. The Overdraft Facility is an unsecured facility per the terms of the Facility Agreements. The Facility Agreements contain customary non-financial covenants, including, without limitation, covenants that restrict the Companys ability to sell or dispose of its assets, cease owning at least 51% of two of its subsidiaries (the Subsidiaries), or encumber its assets with material security interests (including any pledge of monies in the Subsidiaries cash deposit account with the Bank). The Facility Agreements also contain customary events of default, including, without limitation, non-payment of financial obligations when due, cross defaults to other material indebtedness of the Company and any breach of a representation or warranty under the Facility Agreements. As of September 30, 2023, there were no outstanding amounts under the Overdraft Facility.\nAs of September 30, 2023, other than the bank guarantee disclosed in Note 10, we did not have any other off-balance sheet arrangements, such as contingent interests or obligations associated with variable interest entities. Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk\nOur available-for-sale securities, if applicable, may consist of short-term investments in highly rated debt instruments of the U.S. Government and its agencies, financial institutions, and corporations. We continually monitor our exposure to changes in interest rates and credit ratings of issuers with respect to any available-for-sale securities and target an average life to maturity of less than 18 months. Accordingly, we believe that the effects to us of changes in interest rates and credit ratings of issuers are limited and would not have a material impact on our financial condition or results of operations.\nForeign Currency Risk\nOur international operations are exposed to changes in foreign currency exchange rates due to transactions denominated in currencies other than the locations functional currency. Our international operations are also exposed to foreign currency fluctuations that impact the remeasurement of net monetary assets of those operations whose functional currency, the U.S. dollar, differs from their respective local currencies, most notably in Israel, Singapore and Switzerland. Our U.S. operations also have foreign currency exposure due to net monetary assets denominated in currencies other than the U.S. dollar. In addition to net monetary remeasurement, we have exposures related to the translation of subsidiary financial statements from their functional currency, the local currency, into its reporting currency, the U.S. dollar, most notably in the Netherlands, China, Taiwan, Japan and Germany.\nBased on our foreign currency exposure as of September 30, 2023, a 10.0% fluctuation could impact our financial position, results of operations or cash flows by $5.0 to $6.0 million. Our attempts to hedge against these risks may not be successful and may result in a material adverse impact on our financial results and cash flow.\nWe enter into foreign exchange forward contracts to hedge a portion of our forecasted foreign currency-denominated expenses in the normal course of business and, accordingly, they are not speculative in nature. These instruments generally mature within twelve months. We have foreign exchange forward contracts with a notional amount of $54.6 million outstanding as of September 30, 2023. Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm 42\nConsolidated Balance Sheets as of September 30, 2023 and October 1, 2022\nConsolidated Statements of Operations for fiscal 2023, 2022, and 2021\nConsolidated Statements of Comprehensive Income for fiscal 2023, 2022, and 2021\nConsolidated Statements of Changes in Shareholders Equity for fiscal 2023, 2022, and 2021\nConsolidated Statements of Cash Flows for fiscal 2023, 2022, and 2021\nNotes to Consolidated Financial Statements 49\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Kulicke and Soffa Industries, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Kulicke and Soffa Industries, Inc. and its subsidiaries (the Company) as of September 30, 2023 and October 1, 2022, and the related consolidated statements of operations, of comprehensive income, of changes in shareholders equity and of cash flows for each of the three years in the period ended September 30, 2023, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended September 30, 2023 appearing under Item 15(a)(2) (collectively referred to as the consolidated financial statements). We also have audited the Companys internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and October 1, 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Companys management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nAs described in Managements Report on Internal Control over Financial Reporting, management has excluded Kulicke and Soffa Hi-Tech Co., Ltd. (K&S Hi-Tech) from its assessment of internal control over financial reporting as of September 30, 2023 because it was acquired by the Company in a purchase business combination during the year ended September 30, 2023. We have also excluded K&S Hi-Tech from our audit of internal control over financial reporting. K&S Hi-Tech is a wholly-owned subsidiary whose total assets and total revenues excluded from managements assessment and our audit of internal control over financial reporting represent less than 1%, respectively, of the related consolidated financial statement amounts as of and for the year ended September 30, 2023.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements; and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nValuation of inventories - Reserves for excess and obsolete raw materials\nAs described in Notes 1 and 2 to the consolidated financial statements, the Companys consolidated net inventory balance was $217.3 million. The Company generally provides reserves for obsolete inventory and for inventory considered to be in excess of demand. Demand is generally defined as forecasted future consumption for inventories, and is based upon internal projections, historical sales volumes, customer order activity and a review of consumable inventory levels at customers facilities.\nThe principal considerations for our determination that performing procedures relating to the valuation of inventories, specifically the reserves for excess and obsolete raw materials, is a critical audit matter are our assessment that this is an area of significant judgment by management when developing reserves for excess and obsolete raw materials, including developing the assumptions related to forecasted future consumption for raw materials. This has in turn led to significant auditor judgment, subjectivity, and effort in performing procedures and evaluating the reasonableness of managements significant assumptions related to the forecasted future consumption for raw materials.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to managements reserves for excess and obsolete raw materials, including controls over managements assumptions related to forecasted future consumption for raw materials. These procedures also included, among others, testing managements process for developing the reserves for excess or obsolete raw materials; evaluating the appropriateness of managements approach; testing the completeness and accuracy of underlying data used in the approach; and evaluating the reasonableness of managements assumptions related to forecasted future consumption for raw materials. Evaluating managements assumptions related to forecasted future consumption for raw materials involved evaluating whether the assumptions used by management was reasonable considering (i) current and past sales results, (ii) the consistency of sales with external market and industry data, and (iii) comparing prior year estimates of sales to actual sales results in the current year.\n/s/ PricewaterhouseCoopers LLP\nSingapore\nNovember 16, 2023\nWe have served as the Companys auditor since 2011.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share amount)\nAs of\nSeptember 30, 2023 October 1, 2022\nASSETS\nCurrent assets:\nCash and cash equivalents $ 529,402 $ 555,537\nShort-term investments 230,000 220,000\nAccounts and notes receivable, net of allowance for doubtful accounts of $49 and $0, respectively\n158,601 309,323\nInventories, net 217,304 184,986\nPrepaid expenses and other current assets 53,751 62,200\nTotal current assets 1,189,058 1,332,046\nProperty, plant and equipment, net 110,051 80,908\nOperating right-of-use assets 47,148 41,767\nGoodwill 88,673 68,096\nIntangible assets, net 29,357 31,939\nDeferred tax assets 31,551 25,572\nEquity investments 716 5,397\nOther assets 3,223 2,874\nTOTAL ASSETS $ 1,499,777 $ 1,588,599\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable 49,302 67,311\nOperating lease liabilities 6,574 6,766\nAccrued expenses and other current liabilities 103,005 134,541\nIncome taxes payable 22,670 40,063\nTotal current liabilities 181,551 248,681\nDeferred tax liabilities 37,264 34,037\nIncome taxes payable 52,793 64,634\nOperating lease liabilities 41,839 34,927\nOther liabilities 11,769 11,670\nTOTAL LIABILITIES $ 325,216 $ 393,949\nCommitments and contingent liabilities (Note 17)\nSHAREHOLDERS EQUITY:\nPreferred stock, without par value:\nAuthorized 5,000 shares; issued - none\n$ - $ -\nCommon stock, no par value:\nAuthorized 200,000 shares; issued 85,364 and 85,364 respectively; outstanding 56,310 and 57,128 shares, respectively\n577,727 561,684\nTreasury stock, at cost, 29,054 and 28,236 shares, respectively\n(737,214) (675,800)\nRetained earnings 1,355,810 1,341,666\nAccumulated other comprehensive loss (21,762) (32,900)\nTOTAL SHAREHOLDERS EQUITY\n$ 1,174,561 $ 1,194,650\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY\n$ 1,499,777 $ 1,588,599\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nFiscal\n2023 2022 2021\nNet revenue $ 742,491 $ 1,503,620 $ 1,517,664\nCost of sales 383,836 755,300 820,678\nGross profit 358,655 748,320 696,986\nSelling, general and administrative 152,982 140,050 147,061\nResearch and development 144,701 136,852 137,478\nImpairment charges 21,535 1,346 -\nOperating expenses 319,218 278,248 284,539\nIncome from operations 39,437 470,072 412,447\nInterest income 32,906 7,124 2,321\nInterest expense (142) (208) (218)\nIncome before income taxes 72,201 476,988 414,550\nProvision for income taxes 15,053 43,443 47,295\nShare of results of equity-method investee, net of tax - - 94\nNet income $ 57,148 $ 433,545 $ 367,161\nNet income per share:\nBasic $ 1.01 $ 7.21 $ 5.92\nDiluted $ 0.99 $ 7.09 $ 5.78\nWeighted average shares outstanding:\nBasic 56,682 60,164 62,009\nDiluted 57,548 61,182 63,515\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in thousands)\nFiscal\n2023 2022 2021\nNet income $ 57,148 $ 433,545 $ 367,161\nOther comprehensive income / (loss):\nForeign currency translation adjustment 9,676 (30,536) 672\nUnrecognized actuarial (loss) / gain on pension plan, net of tax (49) 2,276 -\n9,627 (28,260) 672\nDerivatives designated as hedging instruments:\nUnrealized gain / (loss) on derivative instruments, net of tax 2,381 (2,694) 24\nReclassification adjustment for (gain) / loss on derivative instruments recognized, net of tax\n(870) 1,076 (1,197)\nNet increase / (decrease) from derivatives designated as hedging instruments, net of tax 1,511 (1,618) (1,173)\nTotal other comprehensive income / (loss) 11,138 (29,878) (501)\nComprehensive income $ 68,286 $ 403,667 $ 366,660\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS' EQUITY\n(in thousands)\nCommon Stock Treasury Stock Retained earnings Accumulated Other Comprehensive (loss) / income Shareholders' Equity\nShares Amount\nBalances as of October 3, 2020 61,558 $ 539,213 $ (394,817) $ 616,119 $ (2,521) $ 757,994\nIssuance of stock for services rendered 23 616 202 - - 818\nRepurchase of common stock (215) - (10,182) - - (10,182)\nIssuance of shares for equity-based compensation 565 (4,385) 4,385 - - -\nEquity-based compensation - 14,673 - - - 14,673\nCash dividend declared - - - (34,726) - (34,726)\nComponents of comprehensive income:\nNet income - - - 367,161 - 367,161\nOther comprehensive loss - - - - (501) (501)\nTotal comprehensive income / (loss) - - - 367,161 (501) 366,660\nBalances as of October 2, 2021 61,931 $ 550,117 $ (400,412) $ 948,554 $ (3,022) $ 1,095,237\nIssuance of stock for services rendered 18 774 175 - - 949\nRepurchase of common stock (5,576) - (282,807) - - (282,807)\nIssuance of shares for equity-based compensation 755 (7,244) 7,244 - - -\nEquity-based compensation - 18,037 - - - 18,037\nCash dividend declared - - - (40,433) - (40,433)\nComponents of comprehensive income:\nNet income - - - 433,545 - 433,545\nOther comprehensive loss - - - - (29,878) (29,878)\nTotal comprehensive income/(loss) - - - 433,545 (29,878) 403,667\nBalances as of October 1, 2022 57,128 $ 561,684 $ (675,800) $ 1,341,666 $ (32,900) $ 1,194,650\nIssuance of stock for services rendered 21 798 202 - - 1,000\nRepurchase of common stock (1,515) - (68,115) - - (68,115)\nIssuance of shares for equity-based compensation 676 (6,499) 6,499 - - -\nEquity-based compensation - 21,744 - - - 21,744\nCash dividend declared - - - (43,004) - (43,004)\nComponents of comprehensive income:\nNet income - - - 57,148 - 57,148\nOther comprehensive income - - - - 11,138 11,138\nTotal comprehensive income - - - 57,148 11,138 68,286\nBalances as of September 30, 2023 56,310 $ 577,727 $ (737,214) $ 1,355,810 $ (21,762) $ 1,174,561\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nFiscal\n2023 2022 2021\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income $ 57,148 $ 433,545 $ 367,161\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 28,857 21,293 19,810\nImpairment charges 21,535 1,346 -\nEquity-based compensation and employee benefits 22,744 18,986 15,491\nAdjustment for doubtful accounts 49 (245) (248)\nAdjustment for inventory valuation 5,214 (2,613) (2,965)\nDeferred taxes (4,478) (8,648) (9,818)\n(Gain) / loss on disposal of property, plant and equipment (499) (253) 259\nGain on disposal of equity-method investments - - (1,046)\nUnrealized fair value changes on equity investment 323 - -\nUnrealized foreign currency translation 85 (7,278) (378)\nShare of results of equity-method investee - - 94\nChanges in operating assets and liabilities, net of assets and liabilities assumed in businesses combinations:\nAccounts and notes receivable 152,667 113,340 (221,924)\nInventory (35,755) (14,924) (52,719)\nPrepaid expenses and other current assets 8,619 (37,907) (4,573)\nAccounts payable, accrued expenses and other current liabilities (52,333) (128,734) 181,960\nIncome taxes payable (29,312) 4,946 7,686\nOther, net (1,460) (2,666) 1,242\nNet cash provided by operating activities 173,404 390,188 300,032\nCASH FLOWS FROM INVESTING ACTIVITIES:\nAcquisition of business, net of cash acquired (36,881) - (26,338)\nPurchases of property, plant and equipment (44,406) (22,985) (22,775)\nProceeds from sales of property, plant and equipment 591 181 291\nInvestment in private equity fund (642) (397) -\nPurchase of short term investments (595,000) (469,000) (507,000)\nMaturity of short term investments 585,000 626,000 472,000\nDisposal of equity-method investments - - 2,115\nNet cash provided by / (used in) investing activities (91,338) 133,799 (81,707)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nPayment on short term debt - (54,500) (22,750)\nPayment for finance leases (629) (509) (379)\nRepurchase of common stock (69,210) (281,319) (10,426)\nProceeds from short term debt - 54,500 22,750\nCommon stock cash dividends paid (42,037) (39,363) (33,453)\nNet cash used in financing activities (111,876) (321,191) (44,258)\nEffect of exchange rate changes on cash and cash equivalents 3,675 (10,047) 594\nChanges in cash and cash equivalents (26,135) 192,749 174,661\nCash and cash equivalents at beginning of period 555,537 362,788 188,127\nCash and cash equivalents at end of period $ 529,402 $ 555,537 $ 362,788\nSUPPLEMENTAL DISCLOSURE OF NON-CASH INVESTING ACTIVITIES:\nProperty, plant and equipment included in accounts payable and accrued expenses 3,000 9,063 1,928\nCASH PAID FOR:\nInterest $ 142 $ 208 $ 218\nIncome taxes $ 56,254 $ 50,309 $ 51,856\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1: BASIS OF PRESENTATION\nThese consolidated financial statements include the accounts of Kulicke and Soffa Industries, Inc. and its subsidiaries (the Company), with appropriate elimination of intercompany balances and transactions.\nFiscal Year\nEach of the Companys first three fiscal quarters ends on the Saturday that is 13 weeks after the end of the immediately preceding fiscal quarter. The fourth quarter of each fiscal year ends on the Saturday closest to September 30. In fiscal years consisting of 53 weeks, the fourth quarter will consist of 14 weeks. The 2023, 2022, and 2021 fiscal years ended on September 30, 2023, October 1, 2022 and October 2, 2021, respectively.\nNature of Business\nThe Company designs, develops, manufactures and sells capital equipment and tools as well as services, maintains, repairs and upgrades equipment, all used to assemble semiconductor devices. The Companys operating results depend upon the capital and operating expenditures of integrated device manufacturers (IDMs), outsourced semiconductor assembly and test providers (OSATs), foundry service providers, and other electronics manufacturers and automotive electronics suppliers worldwide which, in turn, depend on the current and anticipated market demand for semiconductors and products utilizing semiconductors. The semiconductor industry is highly volatile and experiences downturns and slowdowns which can have a severe negative effect on the semiconductor industrys demand for semiconductor capital equipment, including assembly equipment manufactured and sold by the Company and, to a lesser extent, tools, solutions and services, including those sold or provided by the Company. These downturns and slowdowns have in the past adversely affected the Companys operating results. The Company believes such volatility will continue to characterize the industry and the Companys operations in the future.\nUse of Estimates\nThe preparation of consolidated financial statements requires management to make assumptions, estimates and judgments that affect the reported amounts of assets and liabilities, net revenue and expenses during the reporting periods, and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements. On an ongoing basis, management evaluates estimates, including but not limited to, those related to accounts receivable, reserves for excess and obsolete inventory, carrying value and lives of fixed assets, goodwill and intangible assets, accrual for customer credit programs, the valuation estimates and assessment of impairment and observable price adjustments, income taxes, equity-based compensation expense, and warranties. Management bases its estimates on historical experience and on various other assumptions believed to be reasonable. As a result, management makes judgments regarding the carrying values of the Companys assets and liabilities that are not readily apparent from other sources. Authoritative pronouncements, historical experience and assumptions are used as the basis for making estimates, and on an ongoing basis, management evaluates these estimates. Actual results may differ from these estimates.\nIn light of the macroeconomic headwinds, there has been uncertainty and disruption in the global economy and financial markets. The Company is not aware of any specific event or circumstance that would require an update to its estimates or judgments or a revision of the carrying value of its assets or liabilities as of September 30, 2023. While there was no material impact to our consolidated financial statements as of and for the year ended September 30, 2023, these estimates may change, as new events occur and additional information is obtained, as well as other factors related to the macroeconomic headwinds that could materially impact our consolidated financial statements in future reporting periods.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nVulnerability to Certain Concentrations\nFinancial instruments which may subject the Company to concentrations of credit risk as of September 30, 2023 and October 1, 2022 consisted primarily of trade receivables. The Company manages credit risk associated with investments by investing its excess cash in highly rated debt instruments of the U.S. government and its agencies, financial institutions, and corporations. The Company has established investment guidelines relative to diversification and maturities designed to maintain safety and liquidity. These guidelines are periodically reviewed and modified as appropriate.\nThe Companys trade receivables result primarily from the sale of semiconductor equipment, related accessories and replacement parts, and tools to a relatively small number of large manufacturers in a highly concentrated industry. Write-offs of uncollectible accounts have historically not been material. The Company actively monitors its customers financial strength to reduce the risk of loss, especially in light of the current macroeconomic headwinds.\nThe Companys products are complex and require raw materials, components and subassemblies having a high degree of reliability, accuracy and performance. The Company relies on subcontractors to manufacture many of these components and subassemblies and it relies on sole source suppliers for some important components and raw material inventory.\nForeign Currency Translation and Remeasurement\nThe majority of the Companys business is transacted in U.S. dollars; however, the functional currencies of some of the Companys subsidiaries are their local currencies. In accordance with ASC No. 830, Foreign Currency Matters (ASC 830), for a subsidiary of the Company that has a functional currency other than the U.S. dollar, gains and losses resulting from the translation of the functional currency into U.S. dollars for financial statement presentation are not included in determining net income, but are accumulated in the cumulative translation adjustment account as a separate component of shareholders equity (accumulated other comprehensive income / (loss)). The tax effect of currency translation adjustments related to unremitted foreign earnings no longer deemed to be indefinitely reinvested outside the U.S. is reflected in the determination of the Company's net income or other comprehensive income (OCI). Gains and losses resulting from foreign currency transactions are included in the determination of net income.\nThe Companys operations are exposed to changes in foreign currency exchange rates due to transactions denominated in currencies other than the locations functional currency. The Company is also exposed to foreign currency fluctuations that impact the remeasurement of net monetary assets of those operations whose functional currency, the U.S. dollar, differs from their respective local currencies, most notably in Israel, Singapore and Switzerland. In addition to net monetary remeasurement, the Company has exposures related to the translation of subsidiary financial statements from their functional currency, the local currency, into its reporting currency, the U.S. dollar, most notably in the Netherlands, China, Taiwan, Japan and Germany. The Companys U.S. operations also have foreign currency exposure due to net monetary assets denominated in currencies other than the U.S. dollar.\nDerivative Financial Instruments\nThe Companys primary objective for holding derivative financial instruments is to manage the fluctuation in foreign exchange rates and accordingly is not speculative in nature. The Companys international operations are exposed to changes in foreign exchange rates as described above. The Company has established a program to monitor the forecasted transaction currency risk to protect against foreign exchange rate volatility. Generally, the Company uses foreign exchange forward contracts in these hedging programs. These instruments, which have maturities of up to twelve months, are recorded at fair value and are included in prepaid expenses and other current assets, or accrued expenses and other current liabilities.\nOur accounting policy for derivative financial instruments is based on whether they meet the criteria for designation as a cash flow hedge. A designated hedge with exposure to variability in the functional currency equivalent of the future foreign currency cash flows of a forecasted transaction is referred to as a cash flow hedge. The criteria for designating a derivative as a cash flow hedge include the assessment of the instruments effectiveness in risk reduction, matching of the derivative instrument to its underlying transaction, and the assessment of the probability that the underlying transaction will occur. For derivatives with cash flow hedge accounting designation, we report the after-tax gain / (loss) from the effective portion of the hedge as a component of accumulated other comprehensive income / (loss) and reclassify it into earnings in the same period in which the hedged transaction affects earnings and in the same line item on the consolidated statement of operations as the impact of the hedged transaction. Derivatives that we designate as cash flow hedges are classified in the consolidated statement of cash flows in the same section as the underlying item, primarily within cash flows from operating activities.\nThe hedge effectiveness of these derivative instruments is evaluated by comparing the cumulative change in the fair value of the hedge contract with the cumulative change in the fair value of the forecasted cash flows of the hedged item.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nIf a cash flow hedge is discontinued because it is no longer probable that the original hedged transaction will occur as previously anticipated, the cumulative unrealized gain or loss on the related derivative is reclassified from accumulated other comprehensive income / (loss) into earnings. Subsequent gain / (loss) on the related derivative instrument is recognized into earnings in each period until the instrument matures, is terminated, is re-designated as a qualified cash flow hedge, or is sold. Ineffective portions of cash flow hedges, as well as amounts excluded from the assessment of effectiveness, are recognized in earnings.\nCash Equivalents\nThe Company considers all highly liquid investments with original maturities of three months or less when purchased to be cash equivalents. Cash equivalents are measured at fair value based on Level 1 measurement, or quoted market prices, as defined by ASC No. 820, Fair Value Measurements and Disclosures.\nEquity Investments\nThe Company invests in equity securities in companies to promote business and strategic objectives. Non-marketable equity securities are equity securities without readily determinable fair value that are measured and recorded as follows:\nEither using a measurement alternative that measures the securities at cost minus impairment, if any, plus or minus changes resulting from qualifying observable price changes, or;\nUsing the published or estimated Net Asset Value (NAV) for investments that qualify as a practical expedient to determine the fair values of equity securities. The fair values of the underlying investments are determined using quoted market prices, or independent third-party broker or dealer price quotes if quoted market prices are not available. Changes in the fair value of the investments are recognized as gains and losses in earnings.\nAllowance for Doubtful Accounts\nThe Company maintains allowances for doubtful accounts for estimated losses resulting from its customers failure to make required payments. If the financial condition of the Companys customers were to deteriorate, resulting in an impairment of their ability to make payments, including as a result of the existing macroeconomic headwinds, additional allowances may be required. If global or regional economic conditions deteriorate or political conditions were to change in some of the countries where the Company does business, it could have a significant impact on the results of operations, and the Companys ability to realize the full value of its accounts receivable.\nInventories\nInventories are stated at the lower of cost (on a first-in, first-out basis) or net realizable value. The Company generally provides reserves for obsolete inventory and for inventory considered to be in excess of demand. Demand is generally defined as 18 months forecasted future consumption for equipment, 24 months forecasted future consumption for spare parts, and 12 months forecasted future consumption for tools. Forecasted consumption is based upon internal projections, historical sales volumes, customer order activity and a review of consumable inventory levels at customers facilities. The Company communicates forecasts of its future consumption to its suppliers and adjusts commitments to those suppliers accordingly. If required, the Company reserves the difference between the carrying value of its inventory and the lower of cost or net realizable value, based upon projections about future consumption, and market conditions. If actual market conditions are less favorable than projections, additional inventory reserves may be required.\nInventory reserve provision for certain subsidiaries is determined based on managements estimate of future consumption for equipment, spare parts and tools. This estimate is based on historical sales volumes, internal projections and market developments and trends.\nProperty, Plant and Equipment\nProperty, plant and equipment are carried at cost. The cost of additions and those improvements which increase the capacity or lengthen the useful lives of assets are capitalized while repair and maintenance costs are expensed as incurred. Depreciation and amortization are provided on a straight-line basis over the estimated useful lives as follows: buildings 25 years; machinery, equipment, furniture and fittings 3 to 10 years; toolings 1 year; and leasehold improvements are based on the shorter of the life of lease or life of asset. Purchased computer software costs related to business and financial systems are amortized over a five-year period on a straight-line basis. Land is not depreciated.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nValuation of Long-Lived Assets\nIn accordance with ASC No. 360, Property, Plant & Equipment (ASC 360), the Companys definite lived intangible assets and property, plant and equipment are tested for impairment based on undiscounted cash flows when triggering events occur, and if impaired, written-down to fair value based on either discounted cash flows or appraised values. ASC 360 also provides a single accounting model for long-lived assets to be disposed of by sale and establishes additional criteria that would have to be met to classify an asset as held for sale. The carrying amount of an asset or asset group is not recoverable to the extent it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset or asset group. Estimates of future cash flows used to test the recoverability of a long-lived asset or asset group must incorporate the entitys own assumptions about its use of the asset or asset group and must factor in all available evidence.\nASC 360 requires that long-lived assets be tested for recoverability whenever events or changes in circumstances indicate that their carrying amount may not be recoverable. Such events include significant under-performance relative to historical internal forecasts or projected future operating results; significant changes in the manner of use of the assets; significant negative industry or economic trends; or significant changes in market capitalization. During the fiscal years ended September 30, 2023 and October 1, 2022, no triggering events occurred.\nAccounting for Impairment of Goodwill\nASC No. 350, Intangibles - Goodwill and Other requires goodwill and other intangible assets with indefinite lives to be reviewed for impairment annually, or more frequently if circumstances indicate a possible impairment. We assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If, after assessing the qualitative factors, a company determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying value, then performing the impairment test is unnecessary. However, if a company concludes otherwise, then it is required to perform the goodwill impairment test. The Companys impairment test is performed by comparing the fair value of a reporting unit with its carrying value, and determining if the carrying amount exceeds its fair value.\nAs part of the annual evaluation, the Company performs an impairment test of its goodwill in the fourth quarter of each fiscal year to coincide with the completion of its annual forecasting and refreshing of its business outlook processes. On an ongoing basis, the Company monitors if a triggering event has occurred that may have the effect of reducing the fair value of a reporting unit below its respective carrying value. Adverse changes in expected operating results and/or unfavorable changes in other economic factors used to estimate fair values could result in a non-cash impairment charge in the future.\nImpairment assessments inherently involve judgment as to the assumptions made about the expected future cash flows and the impact of market conditions on those assumptions. Future events and changing market conditions may impact the assumptions as to prices, costs, growth rates or other factors that may result in changes in the estimates of future cash flows. Although the Company believes the assumptions that it has used in testing for impairment are reasonable, significant changes in any one of the assumptions could produce a significantly different result. Indicators of potential impairment, including significant and unforeseen customer losses, a significant adverse change in legal factors or in the business climate, a significant adverse action or assessment by a regulator, a significant stock price decline or unanticipated competition may lead the Company to perform interim goodwill impairment assessments.\nFor further information on goodwill and other intangible assets, see Note 4 below.\nGovernment Incentives\nThe Company receives government incentives for qualifying research and development, and other activities as defined by the relevant government entities awarding the grants. Government grants, including non-income tax incentives, are recognized when there is reasonable assurance that the grant will be received and the Company will comply with the conditions specified in the grant agreement. The Company records operating grants as a reduction to expense in the same line item on the consolidated statements of income as the expenditure for which the grant is intended to compensate. The Company recognized an immaterial benefit for operating grants in fiscal 2023.\nRevenue Recognition\nIn accordance with ASC No. 606, Revenue from Contracts with Customers, the Company recognizes revenue when we satisfy performance obligations as evidenced by the transfer of control of our products or services to customers. In general, the Company generates revenue from product sales, either directly to customers or to distributors. In determining whether a contract exists, we evaluate the terms of the agreement, the relationship with the customer or distributor and their ability to pay.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe Company recognizes revenue from sales of our products, including sales to our distributors, at a point in time, generally upon shipment or delivery to the customer or distributor, depending upon the terms of the sales order. Control is considered transferred when title and risk of loss pass, when the customer becomes obligated to pay and, where applicable, when the customer has accepted the products or upon expiration of the acceptance period. For sales to distributors, payment is due on our standard commercial terms and is not contingent upon the distributors resale of the products.\nOur business is subject to contingencies related to customer orders, including:\nRight of Return: A large portion of our revenue comes from the sale of equipment used in the semiconductor assembly process. Other product sales relate to consumable products, which are sold in high-volume quantities, and are generally maintained at low stock levels at the customers facility. Customer returns have historically represented a very small percentage of customer sales on an annual basis.\nWarranties: Our equipment is generally shipped with a one-year warranty against manufacturing defects. We establish reserves for estimated warranty expense when revenue for the related equipment is recognized. The reserve for estimated warranty expense is based upon historical experience and managements estimate of future expenses, including product parts replacement, freight charges and labor costs expected to be incurred to correct manufacturing defects during the warranty period.\nConditions of Acceptance: Sales of our consumable products generally do not have customer acceptance terms. In certain cases, sales of our equipment have customer acceptance clauses which may require the equipment to perform in accordance with agreed specifications, customer specifications or subject to satisfactory installation at the customers facility. In such cases, if the terms of acceptance are satisfied at our facility prior to shipment, the revenue for the equipment will be recognized upon shipment. If the terms of acceptance are satisfied at our customers facilities, the revenue for the equipment will not be recognized until acceptance, which is typically obtained after installation and testing, is received from the customer.\nService revenue is generally recognized over time as the services are performed. For fiscal 2023 and 2022, the service revenue is not material.\nThe Company measures revenue based on the amount of consideration we expect to be entitled to in exchange for products or services. Any variable consideration such as sales incentives are recognized as a reduction of net revenue at the time of revenue recognition.\nThe length of time between invoicing and payment is not significant under our payment terms. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. Shipping and handling costs billed to customers are recognized in net revenue.\nShipping and handling costs paid by the Company are included in cost of sales.\nContract Assets\nA contract asset is the Companys right to consideration in exchange for goods or services that the Company has transferred to a customer. ASC 606, Revenue from Contracts with Customers, distinguishes between a contract asset and a receivable based on whether receipt of the consideration is conditional on something other than the passage of time. When the Company transfers control of goods or services to a customer before the customer pays consideration, the Company records either a contract asset or a receivable depending on the nature of the Companys right to consideration for its performance. The point at which a contract asset becomes an account receivable may be earlier than the point at which an invoice is issued. The Company assesses a contract asset for impairment in accordance with ASC 310, Receivables.\nResearch and Development\nThe Company charges research and development costs associated with the development of new products to expense when incurred. In certain circumstances, pre-production machines that the Company intends to sell are carried as inventory until sold.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nIncome Taxes\nIn accordance with ASC No. 740, Income Taxes, deferred income taxes are determined using the balance sheet method. The Company records a valuation allowance to reduce its deferred tax assets to the amount expected, on a more likely than not basis, to be realized. While the Company has considered future taxable income and ongoing tax planning strategies in assessing the need for the valuation allowance, if it were to determine that it would be able to realize its deferred tax assets in the future in excess of its net recorded amount, an adjustment to deferred tax assets would increase income in the period when such determination is made. Likewise, should the Company determine it would not be able to realize all or part of its deferred tax assets in the future, an adjustment to deferred tax assets would decrease income in the period when such determination is made.\nThe Company determines the amount of unrecognized tax benefit with respect to uncertain tax positions taken or expected to be taken on its income tax returns in accordance with ASC No. 740 Topic 10, Income Taxes, General (ASC 740.10). Under ASC 740.10, the Company utilizes a two-step approach for evaluating uncertain tax positions. Step one, or recognition, requires a company to determine if the weight of available evidence indicates a tax position is more likely than not to be sustained upon examination solely based on its technical merit. Step two, or measurement, is based on the largest amount of benefit, which is more likely than not to be realized on settlement with the taxing authority, including resolution of related appeals or litigation processes, if any.\nEquity-Based Compensation\nThe Company accounts for equity-based compensation under the provisions of ASC No. 718, Compensation - Stock Compensation (ASC 718). ASC 718 requires the recognition of the fair value of the equity-based compensation in net income. Compensation expense associated with Relative TSR Performance Share Units is determined using a Monte-Carlo valuation model, and compensation expense associated with time-based and Growth Performance Share Units is determined based on the number of shares granted and the fair value on the date of grant. See Note 11 for a summary of the terms of these performance-based awards. The fair value of equity-based awards is amortized over the vesting period of the award, and the Company elected to use the straight-line method for awards granted after the adoption of ASC 718.\nEarnings per Share\nEarnings per share (EPS) are calculated in accordance with ASC No. 260, Earnings per Share. Basic EPS include only the weighted average number of common stock outstanding during the period. Diluted EPS include the weighted average number of common stock and the dilutive effect of stock options, performance share units and restricted share units outstanding during the period, when such instruments are dilutive.\nAccelerated Share Repurchase\nFrom time to time, the Company may enter into accelerated share repurchase (ASR) agreements with third-party financial institutions to repurchase shares of the Companys common stock. Under an ASR agreement, in exchange for an up-front payment, the counterparty makes an initial delivery of shares of the Companys common stock during the purchase period of the relevant ASR. This initial delivery of shares represents the minimum number of shares that the Company may receive under an ASR agreement. Upon settlement of an ASR agreement, the counterparty may deliver additional shares, with the final number of shares delivered determined based on the volume-weighted average price of the Companys common stock over the term of such ASR agreement, less an agreed-upon discount. The transactions are accounted for as equity transactions and are included in Treasury Stock when the shares are received, at which time there is an immediate reduction in the weighted-average common stock calculation for basic and diluted earnings per share.\nAccounting for Business Acquisitions\nThe Company accounts for business acquisitions in accordance with ASC No. 805, Business Combinations. The fair value of the net assets acquired and the results of operations of the acquired businesses are included in the consolidated financial statements from the acquisition date forward. The Company is required to make estimates and assumptions that affect the reported amounts of assets and liabilities and results of operations during the reporting period. Estimates are used in accounting for, among other things, the fair value of acquired net operating assets, property, plant and equipment, intangible assets and related deferred income taxes, useful lives of property, plant and equipment, and amortizable lives of acquired intangible assets. Any excess of the purchase consideration over the identified fair value of the assets and liabilities assumed is recognized as goodwill. The valuation of these tangible and identifiable intangible assets and liabilities is subject to further management review and may change materially between the preliminary allocation and end of the purchase price allocation period.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nRestructuring Charges\nRestructuring charges may consist of voluntary or involuntary severance-related charges, asset-related charges and other costs due to exit activities. We recognize voluntary termination benefits when an employee accepts the offered benefit arrangement. We recognize involuntary severance-related charges depending on whether the termination benefits are provided under an ongoing benefit arrangement or under a one-time benefit arrangement. If the former, we recognize the charges once they are probable and the amounts are estimable. If the latter, we recognize the charges once the benefits have been communicated to employees.\nRecent Accounting Pronouncements\nGovernment Assistance\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832): Disclosure by Business Entities about Government Assistance which aims at increasing the transparency of government assistance received by most business entities. The standard requires business entities to make annual disclosures about the nature of the transactions and the related accounting policy used to account for the transactions, the line items and applicable amounts on the balance sheet and income statement that are affected by the transactions, and significant terms and conditions of the transactions, including commitments and contingencies. If an entity omits any required disclosures because it is legally prohibited, it must disclose that fact. This ASU is effective for fiscal years (and interim periods within those fiscal years) beginning after December 15, 2021, which for the Company is the first quarter of fiscal 2023. The adoption of this ASU did not have a material impact on our consolidated financial statements.\nBusiness Combinations\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which clarifies that an acquirer of a business should recognize and measure contract assets and contract liabilities in a business combination in accordance with Topic 606: Revenue from Contracts with Customers. The amendments should be applied prospectively to business combinations occurring on or after the effective date of the amendments with early adoption permitted. We elected for an early adoption of this ASU in fiscal year 2023. The adoption of this ASU did not have a material impact on our consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 2: BALANCE SHEET COMPONENTS\nThe following tables reflect the components of significant balance sheet accounts as of September 30, 2023 and October 1, 2022:\nAs of\n(in thousands) September 30, 2023 October 1, 2022\nInventories, net:\nRaw materials and supplies $ 114,827 $ 118,833\nWork in process 74,555 40,114\nFinished goods 49,207 45,277\n238,589 204,224\nInventory reserves (21,285) (19,238)\n$ 217,304 $ 184,986\nProperty, plant and equipment, net:\nLand $ 2,182 $ 2,182\nBuildings and building improvements 23,105 22,783\nLeasehold improvements 82,927 32,400\nData processing equipment and software 37,483 38,223\nMachinery, equipment, furniture and fixtures 95,692 90,151\nConstruction in progress 11,099 25,004\n252,488 210,743\nAccumulated depreciation (142,437) (129,835)\n$ 110,051 $ 80,908\nAccrued expenses and other current liabilities:\nAccrued customer obligations (1)\n$ 35,701 $ 58,916\nWages and benefits 33,096 50,279\nCommissions and professional fees 4,091 5,019\nDividends payable 10,710 9,743\nAccrued leasehold renovations 11,005 -\nOther 8,402 10,584\n$ 103,005 $ 134,541\n(1)Represents customer advance payments, customer credit program, accrued warranty expense and accrued retrofit obligations.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 3: BUSINESS COMBINATIONS\nAcquisition of Advanced Jet Automation Co., Ltd.\nOn September 8, 2022, the Company through one of its subsidiaries, Kulicke and Soffa Luxembourg S.À R.L, entered into a definitive agreement (the Definitive Agreement) for the acquisition of Advanced Jet Automation Co., Ltd. (AJA), a technology company headquartered in Taiwan.\nOn February 22, 2023 (the Closing Date), pursuant to the Definitive Agreement, the Company completed its acquisition of AJA, including the material business and assets formerly owned by AJAs affiliate, Samurai Spirit Inc., a leading developer and manufacturer of high-precision micro-dispensing equipment and solutions in Taiwan. AJA became a wholly-owned subsidiary of the Company and on March 30, 2023, AJA was renamed Kulicke and Soffa Hi-Tech Co., Ltd. (K&S Hi-Tech). The newly acquired business of K&S Hi-Tech will operate as a business unit (advanced dispensing solutions), deemed a separate operating segment which is reported under the All Others category. The acquisition broadens the Companys existing semiconductor, electronic assembly and advanced display portfolio, increasing opportunities across several exciting growth areas including mini and micro-LED, which support both backlighting and direct-emissive approaches.\nThe purchase price consisted of $38.1 million in cash paid at closing (the Purchase Price) and additional potential earn-out payments based on certain revenue and earnings before interest, tax, depreciation and amortization (EBITDA) benchmarks established for the dispensing business unit. As at September 30, 2023, the Company held $4.0 million in escrow and will continue to hold such sums for a period of twenty-four (24) months from the Closing Date, as security pending the completion of Ruo Chuan Inc.s obligations as the seller under the Definitive Agreement.\nThe Company has estimated the preliminary fair value of acquired assets and liabilities as of the date of acquisition based on current information available. The valuation of these tangible and identifiable intangible assets and liabilities is subject to further management review and may change materially between the preliminary allocation and end of the purchase price allocation period of February 21, 2024. Any changes in these estimates may have a material impact on our Consolidated Statements of Operations or Consolidated Balance Sheets.\nThe acquisition of AJA was accounted for in accordance with ASC No. 805, Business Combinations, using the acquisition method.\nThe following table summarizes the allocation of the assets acquired and liabilities assumed based on the fair values as of the acquisition date:\n(in thousands) February 22, 2023\nCash and cash equivalents $ 1,238\nAccount and other receivables, net 1,156\nInventory 1,581\nProperty, plant and equipment, net 1,462\nRight-of-use assets 989\nOther assets 127\nGoodwill 27,975\nIntangible assets 7,768\nAccounts and other payables (965)\nAccrued expenses and other liabilities (251)\nContract liabilities (187)\nLease liability (989)\nDeferred tax liabilities (1,785)\nTotal purchase price, net of cash acquired $ 38,119\nExcluding inventory and property, plant and equipment, all other tangible net assets (liabilities) were valued at their respective carrying amounts, which the Company believes approximate their current fair values at the Closing Date. In connection with the acquisition of AJA, the Company recorded deferred tax liabilities primarily relating to the acquired intangible assets.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nGoodwill represents the excess of the purchase price over the fair value of the net tangible and identifiable intangible assets acquired and includes the value of expected future cash flows of AJA from expected synergies with our other affiliates and other unidentifiable intangible assets. None of the goodwill recorded as part of the acquisition will be deductible for income tax purposes.\nThe following table summarizes the fair value, useful life and valuation methodology of each identifiable intangible asset.\n(in thousands) Fair Value Useful Lives\nDeveloped technology(1)\n$ 4,261 8\nCustomer relationships(2)\n2,131 8\nIn-process research and development (IPR&D)(3)\n459 N.A.\nPatents(3)\n524 8\nOrder Backlog(4)\n393 1\nTotal identifiable intangible assets $ 7,768\n(1)The fair value of developed technology was determined using the Relief-from-Royalty Method under the income approach.\n(2)Customer relationships represent the fair value of the existing relationships using the Multi-Period Excess Earnings Method under the income approach.\n(3)The fair value of IPR&D and Patents were determined using the Replacement Cost Method, a form of the cost approach.\n(4)Order backlog represents primarily the fair value of purchase arrangements with customers using the Multi-Period Excess Earnings Method under the income approach.\nIPR&D is recorded as an indefinite-lived intangible asset and not amortized, but rather is reviewed for impairment on an annual basis or more frequently if indicators of impairment are present, until the project is completed, abandoned, or transferred to a third party. Developed technology, customer relationships, patents and order backlog are amortized using a straight-line method, representing the Companys best estimate of the distribution of the economic value of the identifiable intangible assets.\nFor fiscal 2023, the acquired dispensing business unit contributed to a net loss of $3.0 million.\nFor fiscal 2023, the Company incurred $0.5 million of expenses related to the acquisition, which is included within selling, general and administrative expense in the Consolidated Statements of Operations.\nThe acquisition did not result in material contributions to revenue and net income in the consolidated financial statements for fiscal 2023. Additionally, pro forma financial information is not provided for consolidated revenue and net income as such amounts attributable to AJA were insignificant to the Companys consolidated financial statements taken as a whole.\nNOTE 4: GOODWILL AND INTANGIBLE ASSETS\nGoodwill\nIntangible assets classified as goodwill are not amortized. The goodwill established in connection with our acquisitions represents the estimated future economic benefits arising from the assets we acquired that did not qualify to be identified and recognized individually. The goodwill also includes the value of expected future cash flows from the acquisitions, expected synergies with our other affiliates and other unidentifiable intangible assets.\nThe Company performs an annual impairment test of its goodwill during the fourth quarter of each fiscal year, which coincides with the completion of its annual forecasting and refreshing of business outlook process.\nDuring the fiscal year ended September 30, 2023, the Company reviewed qualitative factors to ascertain if a \"triggering\" event may have taken place that may have the effect of reducing the fair value of the reporting unit below its carrying value. The Company concluded that a triggering event had occurred during the third quarter in the fiscal year ended September 30, 2023 in connection with the Lithography reporting unit, which is grouped within the All Others category. The triggering event occurred based on the long-term financial and business outlook for the Lithography reporting unit updated as part of the Companys annual strategic planning process performed during the third quarter. This updated outlook projected that the near-term projected cash flows are expected to be lower than previously forecasted due to a shift in market penetration timeline and increase in cost of materials being purchased. Under ASC 350, the Company is required to test its goodwill and other intangible assets for impairment annually or when a triggering event has occurred that would indicate it is more likely than not that the fair value of the reporting unit is less than the carrying value including goodwill and other intangible assets. Accordingly, the Company has performed the goodwill impairment test for the Lithography reporting unit with reference to the guidance under ASC 350.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe Company used a discounted cash flow model to determine the fair value of the Lithography reporting unit. The cash flow projections used within the discounted cash flow model were prepared using the forecasted financial results of the reporting unit, which was based upon underlying estimates of the total market size using independent third party industry reports, and market share data developed using the combination of independent third-party data and our internal data. Significant assumptions used to determine the fair value of the Lithography reporting unit include revenue forecasts, terminal growth rate of 2.5%, working capital, tax rate and a weighted average cost of capital (discount rate) of 11.7%.\nIn accordance with the guidance under ASC 350, the Companys impairment test is performed by comparing the fair value of a reporting unit with its carrying amount, and recognizing an impairment charge for the amount by which the carrying amount of the reporting unit exceeds its fair value. Based on the calculation, the Company determined that the carrying value exceeded the fair value of this reporting unit which resulted in a goodwill impairment charge of $9.8 million, representing the entire goodwill assigned to this reporting unit. This goodwill impairment charge, which is a non-cash charge, has been reflected in the Companys Consolidated Statements of Operations for the fiscal year ended September 30, 2023.\nWhile we have concluded that a triggering event for the other reporting units did not occur during the fiscal year ended September 30, 2023, the persistent macroeconomic headwinds could impact the results of operations due to changes to assumptions utilized in the determination of the estimated fair values of the reporting units that could be significant enough to trigger an impairment.\nNet sales and earnings growth rates could be negatively impacted by reductions or changes in demand for our products. The discount rate utilized in our valuation model could also be impacted by changes in the underlying interest rates and risk premiums included in the determination of the cost of capital.\nThe following table summarizes the Companys recorded goodwill based on its reportable segments as of September 30, 2023 and October 1, 2022:\n(in thousands) Wedge Bonding Equipment APS All Others Total\nBalance at October 1, 2022(1)\n18,280 25,907 23,909 68,096\nAcquired in business combination - - 27,975 27,975\nImpairment charges - - (9,794) (9,794)\nOther - 202 2,194 2,396\nBalance at September 30, 2023 18,280 26,109 44,284 88,673\n(1) Cumulative goodwill impairment as of October 1, 2022 was approximately $35.2 million.\nIntangible Assets\nIntangible assets with determinable lives are amortized over their estimated useful lives. The Companys intangible assets consist primarily of developed technology, customer relationships, in-process research and development, and trade and brand names.\nIn connection with the evaluation of the goodwill impairment in the Lithography reporting unit performed during the third quarter of fiscal year ended September 30, 2023, the Company assessed tangible and intangible assets for impairment prior to performing the first step of the goodwill impairment test. The Company first compared the carrying value to the undiscounted cash flows of the reporting unit which was lower. Subsequently, the Company proceeded to measure the impairment loss by comparing the carrying value against the discounted cash flow model to determine the fair value of the asset group for the Lithography reporting unit, where significant assumptions include revenue forecasts, terminal growth rate of 2.5%, working capital, tax rate and a weighted average cost of capital (discount rate) of 11.7%.\nAs a result of the analysis, the Company determined an impairment charge of $6.9 million on the developed technology reported within the All Others category for the fiscal year ended September 30, 2023. The impairment of intangible assets is a non-cash charge which has been reflected in the Companys Consolidated Statements of Operations for the fiscal year ended September 30, 2023.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects net intangible assets as of September 30, 2023 and October 1, 2022:\nAs of Average estimated\n(dollar amounts in thousands) September 30, 2023 October 1, 2022 useful lives (in years)\nDeveloped technology $ 80,959 $ 89,017 6.0 to 15.0\nAccumulated amortization $ (55,877) $ (58,636)\nNet developed technology $ 25,082 $ 30,381\nCustomer relationships $ 36,764 $ 33,515 5.0 to 8.0\nAccumulated amortization $ (34,789) $ (33,515)\nNet customer relationships $ 1,975 $ -\nIn-process research and development $ 459 $ - N.A.\nNet in-process research and development $ 459 $ -\nTrade and brand name $ 7,130 $ 6,945 7.0 to 8.0\nAccumulated amortization $ (7,130) $ (6,945)\nNet trade and brand name $ - $ -\nOther intangible assets $ 5,617 $ 4,700 1.0 to 8.0\nAccumulated amortization $ (3,776) $ (3,142)\nNet other intangible assets $ 1,841 $ 1,558\nNet intangible assets $ 29,357 $ 31,939\nThe following table reflects estimated annual amortization expense related to intangible assets as of September 30, 2023:\nAs of\n(in thousands) September 30, 2023\nFiscal 2024\n$ 5,154\nFiscal 2025\n$ 4,990\nFiscal 2026\n$ 4,990\nFiscal 2027\n$ 4,715\nFiscal 2028\n$ 4,290\nFiscal 2029 and thereafter\n$ 5,218\nTotal amortization expense $ 29,357\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 5: CASH, CASH EQUIVALENTS, AND SHORT-TERM INVESTMENTS\nCash equivalents consist of instruments with remaining maturities of three months or less at the date of purchase. In general, these investments are free of trading restrictions.\nCash, cash equivalents and short-term investments consisted of the following as of September 30, 2023:\n(dollar amounts in thousands) Amortized\nCost Unrealized\nGains Unrealized\nLosses Estimated Fair Value\nCurrent assets:\nCash $ 37,292 $ - $ - $ 37,292\nCash equivalents:\nMoney market funds (1)\n202,113 - (10) 202,103\nTime deposits (2)\n290,007 - - 290,007\nTotal cash and cash equivalents $ 529,412 $ - $ (10) $ 529,402\nShort-term investments:\nTime deposits (2)\n$ 230,000 $ - $ - $ 230,000\nTotal short-term investments $ 230,000 $ - $ - $ 230,000\nTotal cash, cash equivalents, and short-term investments $ 759,412 $ - $ (10) $ 759,402\n(1)The fair value was determined using unadjusted prices in active, accessible markets for identical assets, and as such they were classified as Level 1 assets in the fair value hierarchy.\n(2)All short-term investments were classified as available-for-sale and the fair value approximates cost basis. The Company did not recognize any realized gains or losses on the sale of investments during the fiscal years ended 2023 and 2022.\nCash, cash equivalents, restricted cash and short-term investments consisted of the following as of October 1, 2022:\n(dollar amounts in thousands) Amortized\nCost Unrealized\nGains Unrealized\nLosses Estimated Fair Value\nCurrent assets:\nCash $ 173,402 $ - $ - $ 173,402\nCash equivalents:\nMoney market funds (1)\n157,145 - (20) 157,125\nTime deposits (2)\n225,010 - - 225,010\nTotal cash and cash equivalents $ 555,557 $ - $ (20) $ 555,537\nShort-term investments:\nTime deposits (2)\n220,000 - - 220,000\nTotal short-term investments $ 220,000 $ - $ - $ 220,000\nTotal cash, cash equivalents, restricted cash and short-term investments $ 775,557 $ - $ (20) $ 775,537\n(1)The fair value was determined using unadjusted prices in active, accessible markets for identical assets, and as such they were classified as Level 1 assets in the fair value hierarchy.\n(2)All short-term investments were classified as available-for-sale and the fair value approximates cost basis. The Company did not recognize any realized gains or losses on the sale of investments during the fiscal years ended 2023 and 2022.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 6: EQUITY INVESTMENTS\nEquity investments consisted of the following as of September 30, 2023 and October 1, 2022:\nAs of\n(in thousands) September 30, 2023 October 1, 2022\nNon-marketable equity securities $ 716 $ 5,397\nDuring the year ended September 30, 2023, the Company recorded an impairment of $5.0 million on a non-marketable equity security without a readily determinable fair value. The entire amount of the investment in the non-marketable equity security was impaired due to a significant deterioration in the earnings performance of the equity investee. The impairment amount is recorded within Selling, general and administrative expense in the Consolidated Statement of Operations.\nNet Asset Value (NAV) (Private Equity Fund): Equity investments in affiliated investment funds are valued based on the NAV reported by the investment fund in accordance with ASC Topic 820-10. Investments held by the affiliated investment fund include a diversified portfolio of investments in the global semiconductor industry. The Company receives distributions through the liquidation of the underlying investments by the affiliated investment fund. However, the period of time over which the underlying investments are expected to be liquidated is unknown. Additionally, the Companys ability to withdraw from the fund is subject to restrictions. The term of the fund will continue until March 18, 2032 unless dissolved earlier or extended by the General Partner. In accordance with ASC Topic 820-10, this investment is measured at fair value using the NAV per share (or its equivalent) practical expedient has not been classified in the fair value hierarchy. As of September 30, 2023, the Company has funded $1.0 million into the affiliated investment fund and recognized an unrealized fair value loss of $0.3 million on the Consolidated Statements of Operations. The Company has recorded the amount of funded capital that has been called as an equity investment.\nNOTE 7: FAIR VALUE MEASUREMENTS\nAccounting standards establish three levels of inputs that may be used to measure fair value: quoted prices in active markets for identical assets or liabilities (referred to as Level 1), inputs other than Level 1 that are observable for the asset or liability either directly or indirectly (referred to as Level 2) and unobservable inputs to the valuation methodology that are significant to the measurement of fair value of assets or liabilities (referred to as Level 3).\nAssets and Liabilities Measured and Recorded at Fair Value on a Recurring Basis\nWe measure certain financial assets and liabilities at fair value on a recurring basis. There were no transfers between fair value measurement levels during the fiscal year ended September 30, 2023.\nFair Value Measurements on a Nonrecurring Basis\nOur non-financial assets such as intangible assets and property, plant and equipment are carried at cost unless impairment is deemed to have occurred.\nFair Value of Financial Instruments\nAmounts reported as accounts receivables, prepaid expenses and other current assets, accounts payable and accrued expenses approximate fair value.\nNOTE 8: DERIVATIVE FINANCIAL INSTRUMENTS\nThe Companys international operations are exposed to changes in foreign exchange rates due to transactions denominated in currencies other than U.S. dollars. Most of the Companys revenue and cost of materials are transacted in U.S. dollars. However, a significant amount of the Companys operating expenses is denominated in foreign currencies, primarily in Singapore.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe foreign currency exposure of our operating expenses is generally hedged with foreign exchange forward contracts. The Companys foreign exchange risk management programs include using foreign exchange forward contracts with cash flow hedge accounting designation to hedge exposures to the variability in the U.S. dollar equivalent of forecasted non-U.S. dollar-denominated operating expenses. These instruments generally mature within twelve months. For these derivatives, we report the after-tax gain or loss from the effective portion of the hedge as a component of accumulated other comprehensive income (loss), and we reclassify it into earnings in the same period or periods in which the hedged transaction affects earnings and in the same line item on the Consolidated Statements of Operations as the impact of the hedged transaction.\nThe fair value of derivative instruments on our Consolidated Balance Sheets as of September 30, 2023 and October 1, 2022 is as follows:\nAs of\n(in thousands) September 30, 2023 October 1, 2022\nNotional Amount Fair Value Liability Derivatives(1)\nNotional Amount Fair Value Liability Derivatives(1)\nDerivatives designated as hedging instruments:\nForeign exchange forward contracts (2)\n$ 54,590 $ (723) $ 57,570 $ (2,234)\nTotal derivatives $ 54,590 $ (723) $ 57,570 $ (2,234)\n(1)The fair value of derivative liabilities is measured using level 2 fair value inputs and is included in accrued expenses and other current liabilities on our Consolidated Balance Sheets.\n(2)Hedged amounts expected to be recognized into earnings within the next twelve months.\nThe effect of derivative instruments designated as cash flow hedges in our Consolidated Statements of Operations for the fiscal years ended September 30, 2023 and October 1, 2022 was as follows:\n(in thousands) Fiscal\n2023 2022\nForeign exchange forward contract in cash flow hedging relationships:\nNet gain/(loss) recognized in OCI, net of tax(1)\n$ 2,381 $ (2,694)\nNet gain/(loss) reclassified from accumulated OCI into earnings, net of tax(2)\n$ 870 $ (1,076)\n(1)Net change in the fair value of the effective portion classified in OCI.\n(2)Effective portion classified as selling, general and administrative expense.\nNOTE 9: LEASES\nWe have entered into various non-cancellable operating and finance lease agreements for certain of our offices, manufacturing, technology, sales support and service centers, equipment, and vehicles. We determine if an arrangement is a lease, or contains a lease, at inception and record the leases in our financial statements upon lease commencement, which is the date when the underlying asset is made available for use by the lessor. Our lease terms may include one or more options to extend the lease terms, for periods from one year to 20 years, when it is reasonably certain that we will exercise that option. As of September 30, 2023, four option to extend the lease were recognized as right-of-use (ROU) assets and lease liabilities. We have lease agreements with lease and non-lease components, and non-lease components are accounted for separately and not included in\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nour leased assets and corresponding liabilities. We have elected not to present short-term leases on the Consolidated Balance Sheets as these leases have a lease term of 12 months or less at lease inception.\nOperating leases are included in operating ROU assets, current and non-current operating lease liabilities, and finance leases are included in property, plant and equipment, accrued expenses and other current liabilities, and other liabilities on the Consolidated Balance Sheets. As of September 30, 2023, our finance leases are not material.\nThe following table shows the components of lease expense:\n(in thousands) Fiscal\n2023 2022\nOperating lease expense (1)\n$ 10,746 8,625\n(1) Operating lease expense includes short-term lease expense, which is immaterial for the fiscal year ended September 30, 2023.\nThe following table shows the cash flows arising from lease transactions. Cash payments related to short-term leases are not included in the measurement of operating and finance lease liabilities, and, as such, are excluded from the amounts below:\n(in thousands) Fiscal\n2023 2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflows from operating leases $ 9,314 $ 7,908\nThe following table shows the weighted-average lease terms and discount rates for operating leases:\nFiscal\n2023 2022\nOperating leases:\nWeighted-average remaining lease term (in years): 7.7 8.0\nWeighted-average discount rate: 6.7 % 5.8 %\nFuture lease payments, excluding short-term leases, as of September 30, 2023, are detailed as follows:\n(in thousands) Operating leases\nFiscal 2024 $ 9,553\nFiscal 2025 9,180\nFiscal 2026 8,702\nFiscal 2027 6,796\nFiscal 2028 6,357\nFiscal 2029 and thereafter 22,307\nTotal minimum lease payments 62,895\nLess: Interest 14,482\nPresent value of lease obligations 48,413\nLess: Current portion 6,574\nLong-term portion of lease obligations $ 41,839\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 10: DEBT AND OTHER OBLIGATIONS\nBank Guarantees\nOn November 22, 2013, the Company obtained a $5.0 million credit facility with Citibank in connection with the issuance of bank guarantees for operational purposes. As of September 30, 2023 and October 1, 2022, the outstanding amount was $3.1 million and $2.9 million respectively.\nCredit Facilities\nOn February 15, 2019, the Company entered into a Facility Letter and Overdraft Agreement (collectively, the Facility Agreements) with MUFG Bank, Ltd., Singapore Branch (the Bank). The Facility Agreements provide the Company and one of its subsidiaries with an overdraft facility of up to $150 million (the Overdraft Facility) for general corporate purposes. Amounts outstanding under the Overdraft Facility, including interest, are payable upon thirty days written demand by the Bank. Interest on the Overdraft Facility is calculated on a daily basis, and the applicable interest rate is calculated at the secured overnight financing rate (SOFR) plus a margin of 1.5% per annum. The Overdraft Facility is an unsecured facility per the terms of the Facility Agreements. The Facility Agreements contain customary non-financial covenants, including, without limitation, covenants that restrict the Companys ability to sell or dispose of its assets, cease owning at least 51% of two of its subsidiaries (the Subsidiaries), or encumber its assets with material security interests (including any pledge of monies in the Subsidiaries cash deposit account with the Bank). The Facility Agreements also contain customary events of default, including, without limitation, non-payment of financial obligations when due, cross defaults to other material indebtedness of the Company and any breach of a representation or warranty under the Facility Agreements. As of September 30, 2023, there were no outstanding amounts under the Overdraft Facility.\nNOTE 11: SHAREHOLDERS EQUITY AND EMPLOYEE BENEFIT PLANS\n401(k) Retirement Income Plans\nThe Company has a 401(k) retirement plan (the 401(k) Plan) for eligible U.S. employees. The 401(k) Plan allows for employee contributions and matching Company contributions from 4% to 6% based upon terms and conditions of the 401(k) Plan.\nThe following table reflects the Companys contributions to the 401(k) Plan during fiscal 2023 and 2022:\nFiscal\n(in thousands) 2023 2022\nCash $ 2,001 $ 1,973\nShare Repurchase Program\nOn August 15, 2017, the Company's Board of Directors authorized a program (the \"Program\") to repurchase up to $100 million of the Companys common stock on or before August 1, 2020. In 2018, 2019 and 2020, the Board of Directors increased the share repurchase authorization under the Program to $200 million, $300 million and $400 million, respectively. On March 3, 2022, the Board of Directors increased the share repurchase authorization under the Program by an additional $400 million to $800 million, and extended its duration through August 1, 2025. On May 7, 2022, the Company entered into a written trading plan under Rule 10b5-1 of the Exchange Act to facilitate repurchases under the Program. This trading plan was most recently modified on May 29, 2023. The Program may be suspended or discontinued at any time and is funded using the Companys available cash, cash equivalents and short-term investments. Under the Program, shares may be repurchased through open market and/or privately negotiated transactions at prices deemed appropriate by management. The timing and amount of repurchase transactions under the Program depend on market conditions as well as corporate and regulatory considerations.\nDuring the fiscal year ended September 30, 2023, the Company repurchased a total of approximately 1,515.0 thousand shares of common stock at a cost of approximately $68.1 million. The stock repurchases were recorded in the periods they were delivered and accounted for as treasury stock in the Companys Consolidated Balance Sheets. The Company records treasury stock purchases under the cost method using the first-in, first-out (FIFO) method. Upon reissuance of treasury stock, amounts in excess of the acquisition cost are credited to additional paid-in capital. If the Company reissues treasury stock at an amount below its acquisition cost and additional paid-in capital associated with prior treasury stock transactions is insufficient to cover the difference between acquisition cost and the reissue price, this difference is recorded against retained earnings.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nAs of September 30, 2023, our remaining stock repurchase authorization under the Program was approximately $181.0 million.\nDividends\nOn August 23, 2023, June 8, 2023, March 2, 2023 and November 16, 2022, the Board of Directors declared a quarterly dividend $0.19 per share of common stock. During the fiscal year ended September 30, 2023, the Company declared dividends of $0.76 per share of common stock. The declaration of any future cash dividend is at the discretion of the Board of Directors, subject to applicable laws, and will depend on the Companys financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination that such dividends are in the best interests of the Companys stockholders.\nAccumulated Other Comprehensive Income\nThe following table reflects the accumulated other comprehensive loss reflected on the Consolidated Balance Sheets as of September 30, 2023 and October 1, 2022:\nAs of\n(in thousands) September 30, 2023 October 1, 2022\nLoss from foreign currency translation adjustments $ (20,178) $ (29,854)\nUnrecognized actuarial loss on pension plan, net of tax (861) (812)\nUnrealized loss on hedging (723) (2,234)\nAccumulated other comprehensive loss $ (21,762) $ (32,900)\nEquity-Based Compensation\nThe Company has a stockholder-approved equity-based compensation plan, the 2021 Omnibus Incentive Plan (the Plan) from which employees and directors receive grants. As of September 30, 2023, 2.5 million shares of common stock are available for grant to the Companys employees and directors under the Plan.\nRelative TSR Performance Share Units (Relative TSR PSUs) entitle the employee to receive common stock of the Company on the award vesting date, typically the third anniversary of the grant date (or as soon as administratively practicable if later), if market performance objectives which measure relative total shareholder return (TSR) are attained. Relative TSR is calculated based upon the 90-calendar day average price at the end of the performance period of the Companys stock as compared to specific peer companies that comprise the GICS (45301020) Semiconductor Index. TSR is measured for the Company and each peer company over a performance period, which is generally three years. Vesting percentages range from 0% to 200% of awards granted. The provisions of the Relative TSR PSUs are reflected in the grant date fair value of the award; therefore, compensation expense is recognized regardless of whether the market condition is ultimately satisfied. Compensation expense is reversed if the award is forfeited prior to the vesting date.\nRevenue Growth Performance Share Units (Growth PSUs) entitle the employee to receive common stock of the Company on the award vesting date, typically the third anniversary of the grant date (or as soon as administratively practicable if later), based on organic revenue growth objectives and relative growth performance against named competitors as set by the Management Development and Compensation Committee (MDCC) of the Companys Board of Directors. Organic revenue growth is calculated by averaging revenue growth (net of revenues from acquisitions) over a performance period, which is generally three years. Revenues from acquisitions will be included in the calculation after four fiscal quarters after acquisition. Any portion of the grant that does not meet the revenue growth objectives and relative growth performance is forfeited. Vesting percentages range from 0% to 200% of awards granted.\nIn general, Time-based Restricted Share Units (Time-based RSUs) awarded to employees vest ratably over a three-year period on the anniversary of the grant date provided the employee remains employed by the Company.\nEquity-based compensation expense recognized in the Consolidated Statements of Operations for fiscal 2023, 2022, and 2021 was based upon awards ultimately expected to vest, with forfeiture accounted for when they occur.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the total equity-based compensation expense, which includes Relative TSR PSUs, Time-based RSUs, Growth PSUs, and common stock, included in the Consolidated Statements of Operations for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nCost of sales $ 1,192 $ 960 $ 828\nSelling, general and administrative 16,239 13,911 10,998\nResearch and development 5,313 4,115 3,676\nTotal equity-based compensation expense $ 22,744 $ 18,986 $ 15,502\nThe following table reflects the equity-based compensation expense, by type of award, for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nRelative TSR PSUs 4,949 4,255 3,916\nTime-based RSUs 14,304 11,655 10,314\nGrowth PSUs 2,491 2,127 444\nCommon stock 1,000 949 828\nTotal equity-based compensation expense $ 22,744 $ 18,986 $ 15,502\nEquity-Based Compensation: Relative TSR PSUs\nThe following table reflects the Relative TSR PSUs activity for fiscal 2023, 2022, and 2021:\nNumber of shares (in thousands) Unrecognized compensation expense (in thousands) Average remaining service period (in years) Weighted average grant date fair value per share\nRelative TSR PSUs outstanding as of October 3, 2020 403 $ 4,198 1.1\nGranted 155 $ 28.21\nForfeited or expired (6)\nVested (108)\nRelative TSR PSUs outstanding as of October 2, 2021 444 $ 4,455 1.1\nGranted 152 $ 52.18\nForfeited or expired (11)\nVested (205)\nRelative TSR PSUs outstanding as of October 1, 2022 380 $ 4,619 0.9\nGranted 187 $ 48.35\nForfeited or expired (3)\nVested (197)\nRelative TSR PSUs outstanding as of September 30, 2023 367 $ 5,939 1.0\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the assumptions used to calculate compensation expense related to the Companys Relative TSR PSUs issued during fiscal 2023, 2022, and 2021:\nFiscal\n2023 2022 2021\nGrant price $ 37.50 $ 49.20 $ 23.88\nExpected dividend yield 1.81 % 1.14 % 2.01 %\nExpected stock price volatility 53.79 % 48.50 % 45.15 %\nRisk-free interest rate 4.42 % 0.68 % 0.21 %\nEquity-Based Compensation: Time-based RSUs\nThe following table reflects the Time-based RSUs activity for fiscal 2023, 2022, and 2021:\nNumber of shares (in thousands) Unrecognized compensation expense (in thousands) Average remaining service period (in years) Weighted average grant date fair value per share\nTime-based RSUs outstanding as of October 3, 2020 788 $ 10,480 1.6\nGranted 486 $ 24.34\nForfeited or expired (24)\nVested (333)\nTime-based RSUs outstanding as of October 2, 2021 917 $ 11,420 1.4\nGranted 301 $ 49.47\nForfeited or expired (29)\nVested (453)\nTime-based RSUs outstanding as of October 1, 2022 736 $ 13,752 1.2\nGranted 513 $ 37.64\nForfeited or expired (28)\nVested (389)\nTime-based RSUs outstanding as of September 30, 2023 832 $ 17,693 1.5\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nEquity-Based Compensation: Growth PSUs\nThe following table reflects the Growth PSUs activity for fiscal 2023, 2022, and 2021:\nNumber of shares (in thousands) Unrecognized compensation expense (in thousands) Average remaining service period (in years) Weighted average grant date fair value per share\nSpecial/Growth PSUs outstanding as of October 3, 2020 151 $ 1,252 1.1\nGranted 52 $ 24.01\nForfeited or expired (34)\nVested (17)\nSpecial/Growth PSUs outstanding as of October 2, 2021 152 $ 1,247 1.0\nGranted 79 $ 49.26\nForfeited or expired (4)\nVested (100)\nSpecial/Growth PSUs outstanding as of October 1, 2022 127 $ 1,405 0.9\nGranted 91 $ 37.55\nForfeited or expired (1)\nVested (95)\nSpecial/Growth PSUs outstanding as of September 30, 2023 122 $ 1,626 1.0\nAs of September 30, 2023, there were no employee stock options.\nEquity-Based Compensation: Non-Employee Directors\nThe 2021 Equity Plan provides for the grant of common stock to each non-employee director upon initial election to the board and on the first business day of each calendar quarter while serving on the board. The grant to a non-employee director upon initial election to the board is that number of common stock closest in value to, without exceeding, $120,000. The quarterly grant to a non-employee director upon the first business day of each calendar quarter is that number of common stock closest in value to, without exceeding, $39,500.\nThe following table reflects shares of common stock issued to non-employee directors and the corresponding fair value for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nNumber of common stock issued 21 18 22\nFair value based upon market price at time of issue $ 1,000 $ 949 $ 828\nPension Plan\nThe following table reflects the Companys defined benefits pension obligations, mainly in Switzerland and Taiwan, as of September 30, 2023 and October 1, 2022:\nAs of\n(in thousands) September 30, 2023 October 1, 2022\nSwitzerland pension obligation $ 1,119 $ 1,038\nTaiwan pension obligation 1,257 1,189\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nOther Plans\nSome of the Companys other foreign subsidiaries have retirement plans that are integrated with and supplement the benefits provided by laws of the various countries. These other plans are not required to report nor do they determine the actuarial present value of accumulated benefits or net assets available for plan benefits as they are defined contribution plans.\nNOTE 12: REVENUE AND CONTRACT BALANCES\nThe Company recognizes revenue when we satisfy performance obligations as evidenced by the transfer of control of our products or services to customers. In general, the Company generates revenue from product sales, either directly to customers or to distributors. In determining whether a contract exists, we evaluate the terms of the agreement, the relationship with the customer or distributor and their ability to pay. Service revenue is generally recognized over time as the services are performed. For the fiscal years ended September 30, 2023, and October 1, 2022, service revenue is not material. Please refer to Note 1: Basis of Presentation - Revenue Recognition, for additional disclosure on the Companys revenue recognition policy.\nThe Company reports revenue based on our reportable segments and end markets, which provides information about how the nature, amount, timing, and uncertainty of revenue and cash flows are affected by economic factors. Please refer to Note 16: Segment Information, for disclosure of revenue by segments and end markets.\nContract Balances\nOur contract assets relate to our rights to consideration for revenue with collection dependent on events other than the passage of time, such as the achievement of specified payment milestones. The contract assets will be transferred to net account receivables as our right to consideration for these contract assets become unconditional. Contracts assets are reported in the accompanying Consolidated Balance Sheets within prepaid expenses and other current assets.\nOur contract liabilities are primarily related to payments received in advance of satisfying performance obligations, and are reported in the accompanying Consolidated Balance Sheets within accrued expenses and other current liabilities.\nContract liabilities increase as a result of receiving new advance payments from customers and decrease as revenue is recognized from product sales under advance payment arrangements upon satisfying the performance obligations.\nThe following table shows the changes in contract asset balances during the fiscal years ended September 30, 2023 and October 1, 2022:\nFiscal\n(in thousands) 2023 2022\nContract assets, beginning of period $ 26,317 $ -\nAdditions 4,230 51,774\nTransferred to accounts receivable or collected (20,366) (25,457)\nContract assets, end of period $ 10,181 $ 26,317\nThe following table shows the changes in contract liability balances during the fiscal years ended September 30, 2023 and October 1, 2022:\nFiscal\n(in thousands) 2023 2022\nContract liabilities, beginning of period $ 3,160 $ 15,596\nRevenue recognized (38,435) (116,399)\nAdditions 40,072 103,963\nContract liabilities, end of period $ 4,797 $ 3,160\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 13: EARNINGS PER SHARE\nBasic income per share is calculated using the weighted average number of shares of common stock outstanding during the period. Restricted stock are included in the calculation of diluted earnings per share, except when their effect would be anti-dilutive.\nThe following table reflects a reconciliation of the shares used in the basic and diluted net income per share computation for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands, except per share) 2023 2022 2021\nBasic Diluted Basic Diluted Basic Diluted\nNUMERATOR:\nNet income $ 57,148 $ 57,148 $ 433,545 $ 433,545 $ 367,161 $ 367,161\nDENOMINATOR:\nWeighted average shares outstanding - Basic 56,682 56,682 60,164 60,164 62,009 62,009\nDilutive effect of Equity Plans 866 1,018 1,506\nWeighted average shares outstanding - Diluted 57,548 61,182 63,515\nEPS:\nNet income per share - Basic $ 1.01 $ 1.01 $ 7.21 $ 7.21 $ 5.92 $ 5.92\nEffect of dilutive shares $ (0.02) $ (0.12) $ (0.14)\nNet income per share - Diluted $ 0.99 $ 7.09 $ 5.78\nAnti-dilutive shares(1)\n15 1 2\n(1) Represents the Relative TSR PSUs and Growth PSUs that are excluded from the calculation of diluted earnings per share for fiscal 2023, 2022, and 2021 as the effect would have been anti-dilutive.\nNOTE 14: OTHER FINANCIAL DATA\nThe following table reflects the other financial data for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nIncentive compensation expense $ 10,424 $ 27,011 $ 39,779\nWarranty and retrofit expense 13,729 16,349 22,068\nNOTE 15: INCOME TAXES\nThe following table reflects the U.S. and foreign income (loss) before income taxes for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nUnited States $ (5,635) $ (11,415) $ (8,853)\nForeign 77,836 488,403 423,403\nIncome before income taxes $ 72,201 $ 476,988 $ 414,550\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the current and deferred components of provision for (benefit from) income taxes for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nCurrent:\nFederal $ 10,412 $ 14,975 $ 26,563\nState (128) 246 261\nForeign 8,830 37,448 30,771\nDeferred:\nFederal 1,304 (5,809) (2,979)\nState - - -\nForeign (5,365) (3,417) (7,321)\nProvision for income taxes $ 15,053 $ 43,443 $ 47,295\nThe following table reconciles the provision for (benefit from) income taxes with the expected income tax provision computed based on the applicable U.S. federal statutory tax rate for fiscal 2023, 2022, and 2021:\nFiscal\n(dollar amounts in thousands) 2023 2022 2021\nExpected income tax provision based on the U.S. federal statutory tax rate $ 15,162 $ 100,212 $ 86,915\nEffect of earnings of foreign subsidiaries subject to different tax rates (8,448) (17,936) (15,028)\nBenefit from tax incentives (11,198) (50,113) (45,501)\nBenefit from research and development tax credits (4,038) (2,995) (2,705)\nBenefit from foreign tax credits (7,834) (26,021) (20,281)\nValuation allowance 3,127 (5,830) (11,620)\nForeign operations (Deemed income, taxes on undistributed foreign earnings, and withholding taxes) 24,450 45,421 52,414\nGoodwill impairment 2,517 - -\nOther, net (1)\n1,315 705 3,101\nProvision for income taxes $ 15,053 $ 43,443 $ 47,295\nEffective tax rate 20.8 % 9.1 % 11.4 %\n(1) Certain balances in fiscal 2022 and 2021 have been reclassified to conform to the current period presentation. These reclassifications have no impact to the consolidated financial statements in fiscal 2022 and 2021.\nAs of September 30, 2023, a large portion of the Companys undistributed foreign earnings are not considered to be indefinitely reinvested outside the U.S. and are expected to be available for use in the U.S. without incurring additional U.S. income tax. Determination of the amount of unrecognized deferred tax liabilities related to the indefinitely reinvested undistributed foreign earnings is not practicable.\nFurther, we operate in a number of foreign jurisdictions, including Singapore, where we have a tax incentive that allows for a reduced tax rate on certain classes of income, provided the Company meets certain employment and investment conditions through the expiration date in fiscal 2025. In fiscal 2023, 2022, and 2021, the tax incentive arrangement helped to reduce the Companys provision for income taxes by $11.2 million or $0.19 per share, $50.1 million or $0.82 per share and $45.5 million or $0.72 per share, respectively.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the deferred tax balances based on the tax effects of cumulative temporary differences for fiscal 2023 and 2022:\nFiscal\n(in thousands) 2023 2022\nAccruals and reserves $ 13,118 $ 14,168\nCapitalized Research(1)\n12,529 25,105\nTax credit carryforwards 5,026 3,893\nNet operating loss carryforwards 26,607 15,329\nGross deferred tax assets $ 57,280 $ 58,495\nValuation allowance $ (21,483) $ (21,750)\nDeferred tax assets, net of valuation allowance $ 35,797 $ 36,745\nFixed and intangible assets(1)\n$ (16,357) $ (19,142)\nTaxes on undistributed foreign earnings (25,153) (26,068)\nDeferred tax liabilities $ (41,510) $ (45,210)\nNet deferred tax liabilities $ (5,713) $ (8,465)\nReported as\nDeferred tax assets $ 31,551 $ 25,572\nDeferred tax liabilities (37,264) (34,037)\nNet deferred tax liabilities $ (5,713) $ (8,465)\n(1) Certain balances in fiscal 2022 have been reclassified to conform to the current period presentation. These reclassifications have no impact to the consolidated financial statements in fiscal 2022.\nAs of September 30, 2023, the Company has foreign net operating loss carryforwards of $89.7 million, state net operating loss carryforwards of $35.0 million, and U.S. federal and state tax credit carryforwards of $7.8 million that can be used to offset future income tax obligations. These net operating loss and tax credit carryforwards can be utilized prior to their expiration dates in fiscal years 2024 through 2042, except for certain credits and foreign net operating losses that can be carried forward indefinitely. The Company has recorded valuation allowances against certain foreign and state net operating loss carryforwards and state tax credits which are expected to expire unutilized.\nThe following table reconciles the beginning and ending balances of the Companys unrecognized tax benefit, excluding related accrued interest and penalties, for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nUnrecognized tax benefit, beginning of year $ 16,623 $ 14,922 $ 13,064\nAdditions for tax positions, current year 1,493 2,288 4,003\nReductions for tax positions, prior year (1,497) (587) (2,145)\nUnrecognized tax benefit, end of year $ 16,619 $ 16,623 $ 14,922\nThe Company recognizes interest and penalties related to potential income tax liabilities as a component of unrecognized tax benefit and in provision for income taxes. The amount of interest and penalties related to unrecognized tax benefit recorded in fiscal 2023 provision for income taxes is not material. As of September 30, 2023, the Company has recognized $2.8 million of accrued interest and penalties related to unrecognized tax benefit within the income tax payable for uncertain tax positions and approximately $17.9 million of unrecognized tax benefit, including related interest and penalties, that if recognized, would impact the Companys effective tax rate.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nIt is reasonably possible that the amount of the unrecognized tax benefit with respect to certain uncertain tax positions will increase or decrease during the next 12 months due to the expected lapse of statutes of limitation and/or settlements of tax examinations. Given the number of years and numerous matters that remain subject to examination in various tax jurisdictions, we cannot practicably estimate the financial outcomes of these examinations.\nThe Company files a U.S. federal income tax return, as well as income tax returns in various state and foreign jurisdictions. For U.S. federal income tax returns purposes, tax years from fiscal 2020 remain subject to examination. For most state tax returns, tax years following fiscal 2004 remain subject to examination as a result of the generation of net operating loss carryforwards. In the foreign jurisdictions where the Company files income tax returns, the statutes of limitations with respect to these jurisdictions vary from jurisdiction to jurisdiction and range from 4 to 6 years. The Companys tax returns are currently under examination by tax authorities in multiple state and foreign jurisdictions. The Company believes that adequate provisions have been made for any adjustments that may result from the examination.\nNOTE 16: SEGMENT INFORMATION\nReportable segments are defined as components of an enterprise that engage in business activities for which discrete financial information is available and regularly reviewed by the chief operating decision maker (the CODM) in deciding how to allocate resources and assess performance. The Companys Chief Executive Officer is the CODM. The CODM does not review discrete asset information.\nThe Company operates four reportable segments consisting of: (1) Ball Bonding Equipment, (2) Wedge Bonding Equipment, (3) Advanced Solutions, and (4) Aftermarket Products and Services (APS). The four reportable segments are disclosed below:\nBall Bonding Equipment: Reflects the results of the Company from the design, development, manufacture and sale of ball bonding equipment and wafer level bonding equipment.\nWedge Bonding Equipment: Reflects the results of the Company from the design, development, manufacture and sale of wedge bonding equipment.\nAdvanced Solutions: Reflects the results of the Company from the design, development, manufacture and sale of certain advanced display, die-attach and thermocompression systems and solutions.\nAPS: Reflects the results of the Company from the design, development, manufacture and sale of a variety of tools, spares and services for our equipment.\nAny other operating segments that have not been aggregated within the reportable segments described above which do not meet the quantitative threshold to be disclosed as a separate reportable segment have been grouped within an All Others category. This group is reflective of the results of the Company from the design, development, manufacture and sale of certain advanced display, advanced dispense, electronics assembly, die-attach and lithography systems and solutions. Results for the All Others category and other corporate expenses are included as a reconciling item between the Companys reportable segments and its consolidated results of operations.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the operating information by reportable segment for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nNet revenue:\nBall Bonding Equipment $ 287,465 $ 909,428 $ 1,016,663\nWedge Bonding Equipment 175,550 194,086 138,836\nAdvanced Solutions 72,256 94,683 35,123\nAPS 160,718 197,152 205,088\nAll Others 46,502 108,271 121,954\nNet revenue 742,491 1,503,620 1,517,664\nIncome/(loss) from operations:\nBall Bonding Equipment $ 81,929 385,276 401,450\nWedge Bonding Equipment 63,088 66,649 34,563\nAdvanced Solutions (32,530) (15,389) (40,759)\nAPS 47,654 82,473 75,400\nAll Others (36,797) 25,732 20,565\nCorporate Expenses (83,907) (74,669) (78,772)\nIncome from Operations 39,437 470,072 412,447\nWe have considered: (1) information that is regularly reviewed by our CODM in evaluating financial performance and how to allocate resources; and (2) other financial data, including information that we include in our earnings releases but which is not included in our financial statements, to disaggregate revenues by end markets served. The principal category we use to disaggregate revenues is by the end markets served.\nThe following table reflects the net revenue by end markets served for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nGeneral Semiconductor $ 333,937 $ 843,763 $ 928,259\nAutomotive & Industrial 175,249 198,138 129,817\nLED 50,166 137,077 187,568\nMemory 22,421 127,490 66,932\nAPS 160,718 197,152 205,088\nTotal revenue $ 742,491 $ 1,503,620 $ 1,517,664\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following tables reflect the capital expenditures, depreciation and amortization expense by reportable segment for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nCapital expenditures:\nBall Bonding Equipment $ 1,087 $ 978 $ 1,627\nWedge Bonding Equipment 436 1,450 387\nAdvanced Solutions 30,522 19,036 6,090\nAPS 5,298 4,964 5,286\nAll Others $ 658 $ 1,364 $ 1,046\nCorporate Expenses 9,701 4,441 8,119\nCapital expenditures $ 47,702 $ 32,233 $ 22,555\nFiscal\n(in thousands) 2023 2022 2021\nDepreciation expense:\nBall Bonding Equipment $ 1,538 $ 1,398 $ 1,153\nWedge Bonding Equipment 1,169 981 940\nAdvanced Solutions 7,706 2,034 845\nAPS 6,166 6,632 5,969\nAll Others $ 1,505 1,047 1,179\nCorporate Expenses 4,674 4,284 3,750\nDepreciation expense $ 22,758 $ 16,376 $ 13,836\nFiscal\n(in thousands) 2023 2022 2021\nAmortization expense:\nBall Bonding Equipment $ - $ - $ -\nWedge Bonding Equipment - - -\nAdvanced Solutions - - -\nAPS 896 994 2,319\nAll Others $ 4,837 3,557 3,369\nCorporate Expenses 366 366 286\nAmortization expense $ 6,099 $ 4,917 $ 5,974\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nGeographical information\nThe following tables reflect destination sales to unaffiliated customers by country and long-lived assets by country for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nDestination sales to unaffiliated customers:\nChina $ 335,393 $ 855,345 $ 843,470\nUnited States 65,705 83,906 54,353\nTaiwan 66,358 123,995 275,251\nMalaysia 64,013 126,520 70,253\nJapan 35,849 18,092 11,850\nPhilippines 31,527 44,510 17,651\nKorea 17,977 87,647 58,308\nHong Kong 13,933 27,216 82,436\nAll other(1)\n111,736 136,389 104,092\nTotal destination sales to unaffiliated customers $ 742,491 $ 1,503,620 $ 1,517,664\n(1) Certain balances in fiscal 2022 and 2021 have been reclassified to conform to the current period presentation. These reclassifications have no impact to the consolidated financial statements in fiscal 2022 and 2021.\nFiscal\n(in thousands) 2023 2022\nLong-lived assets:\nSingapore $ 95,489 $ 59,672\nUnited States 24,894 31,469\nChina 17,717 19,548\nIsrael 9,264 10,610\nAll others\n13,774 9,647\nTotal long-lived assets $ 161,138 $ 130,946\nNOTE 17: COMMITMENTS, CONTINGENCIES AND CONCENTRATIONS\nWarranty Expense\nThe Companys equipment is generally shipped with a one-year warranty against manufacturing defects. The Company establishes reserves for estimated warranty expense when revenue for the related equipment is recognized. The reserve for estimated warranty expense is based upon historical experience and managements estimate of future warranty costs, including product part replacement, freight charges and related labor costs expected to be incurred to correct product failures during the warranty period.\nThe following table reflects the reserve for product warranty activity for fiscal 2023, 2022, and 2021:\nFiscal\n(in thousands) 2023 2022 2021\nReserve for warranty, beginning of period $ 13,443 $ 16,961 $ 9,576\nProvision for warranty 12,850 12,907 18,889\nUtilization of reserve (15,836) (16,425) (11,504)\nReserve for warranty, end of period $ 10,457 $ 13,443 $ 16,961\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nOther Commitments and Contingencies\nThe following table reflects the obligations not reflected on the Consolidated Balance Sheets as of September 30, 2023:\nPayments due by fiscal year\n(in thousands) Total 2024 2025 2026 2027 Thereafter\nInventory purchase obligation (1)\n$ 182,567 $ 182,567 $ - $ - $ - $ -\n(1) The Company orders inventory components in the normal course of its business. A portion of these orders are non-cancelable and a portion may have varying penalties and charges in the event of cancellation.\nFrom time to time, the Company is party to or the target of lawsuits, claims, investigations and proceedings, including for personal injury, intellectual property, commercial, contract, and employment matters, which are handled and defended in the ordinary course of business. The Company accrues a contingent loss liability for such matters when it is probable that a liability has been incurred and the amount can be reasonably estimated. When a single amount cannot be reasonably estimated but the cost can be estimated within a range, the Company accrues the minimum amount. The Company expenses legal costs, including those expected to be incurred in connection with a loss contingency, as incurred.\nUnfunded Capital Commitments\nAs of September 30, 2023, the Company also has an obligation to fund uncalled capital commitments of approximately $9.0 million, as and when required, in relation to its investment in a private equity fund.\nConcentrations\nThe following table reflect the significant customer concentrations as a percentage of net revenue for fiscal 2023, 2022, and 2021:\nFiscal\n2023 2022 2021\nASE Technology Holding * * 17.4 %\n* Represents less than 10% of total net revenue\nThe following table reflects the significant customer concentrations as a percentage of total accounts receivable as of September 30, 2023 and October 1, 2022:\nAs of\nSeptember 30, 2023 October 1, 2022\nTianshui Huatian Technology Co., Ltd. * 16.7 %\nHaoseng Industrial Co., Ltd. (1)\n* 12.6 %\n(1) Distributor of the Company's products\n* Represents less than 10% of total accounts receivables Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. Item 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of September 30, 2023. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that, as of September 30, 2023, our disclosure controls and procedures were effective in providing reasonable assurance that the information required to be disclosed by us in reports filed under the Securities Exchange Act of 1934, as amended, is (i) recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and (ii) accumulated and communicated to our management, including the Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding disclosure.\nManagements Report on Internal Control Over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) and 15d-15(f) of the Securities Exchange Act of 1934, as amended. The Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles in the United States of America.\nThe Companys internal control over financial reporting includes those policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles; provide reasonable assurance that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement evaluated the effectiveness of the Companys internal control over financial reporting as of September 30, 2023. In making this assessment, management used the framework established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Managements assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of our internal control over financial reporting. Management reviewed the results of its assessment with the Audit Committee of the Companys Board of Directors.\nWe completed the acquisition of Advanced Jet Automation Co., Ltd. (AJA) on February 22, 2023, as discussed in Note 3: Business Combination of the Notes to the Consolidated Financial Statements. On March 30, 2023, AJA was renamed Kulicke and Soffa Hi-Tech Co., Ltd. (K&S Hi-Tech). Although existing event driven controls were followed related to the business combination accounting for the acquisition, management has excluded K&S Hi-Tech from its assessment of the Companys internal control over financial reporting for the fiscal year ending September 30, 2023. As of September 30, 2023, K&S Hi-Tech total assets and total revenues represent less than 1%, respectively, of the related consolidated financial statement amounts as of and for the year ended September 30, 2023. See Note 3 of our Notes to Consolidated Financial Statements for more information. This exclusion is in accordance with the SECs general guidance that an assessment of a recently acquired business may be omitted from our scope in the first fiscal year in which the acquisition occurred.\nBased on that assessment, management has concluded that, as of September 30, 2023, the Companys internal control over financial reporting was effective.\nThe effectiveness of the Companys internal control over financial reporting as of September 30, 2023 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in its report, which appears in Part II, Item 8 of this Form 10-K.\nRemediation of Previously Disclosed Material Weakness\nAs described in Part II, Item 9A Controls and Procedures of our 2022 Annual Report, we identified a material weakness in our internal control over financial reporting that existed as of October 1, 2022 and which related to a design gap in the existing review of our segment reporting process, which failed to (a) identify all of the key metrics used by the CODM to evaluate performance and allocate resources, (b) assess in totality the level of information provided to and utilized by the CODM to evaluate performance and allocate resources, and (c) appropriately analyze every factor pertinent to whether operating segments share economic similarities that is required for aggregation under ASC 280. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nThe Company has implemented remediation steps to address the material weakness and improve our internal control over financial reporting. Specifically, we have designed and implemented a segment review control which (a) identifies all of the key metrics used by the CODM to evaluate performance and allocate resources, (b) assesses in totality the level of information provided to and utilized by the CODM to evaluate performance and allocate resources, and (c) appropriately analyzes every factor pertinent to whether operating segments share economic similarities that is required for aggregation under ASC 280. As part of the design and implementation of the segment review control that was completed in the fourth quarter, the Company engaged an outside consultant to assist management on the development of the segment analysis framework. Testing of both the design and operating effectiveness of the Companys enhanced controls was completed, and management concluded that the material weakness described above had been fully remediated as of September 30, 2023.\nChanges in Internal Control over Financial Reporting\nOther than the completion remediation actions described above, there has been no change in the Companys internal control over financial reporting during the three months ended September 30, 2023, that has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. OTHER INFORMATION\nDirector and Officer Trading Plans and Arrangements\nNone of the Companys directors or officers have adopted, modified or terminated a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement during the Companys fiscal quarter ended September 30, 2023, as such terms are defined under Item 408(a) of Regulation S-K.\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by Item 401 of Regulation S-K with respect to the directors and executive officers will appear under the heading ITEM 1 - ELECTION OF DIRECTORS in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference. The other information required by Item 401 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 405 of Regulation S-K will appear, as applicable, under the heading CORPORATE GOVERNANCE-Section 16(a) Beneficial Ownership Reporting Compliance in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 406 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Code of Ethics in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 407(c)(3) of Regulation will appear under the headings CORPORATE GOVERNANCE-Committees of the Board of Directors-Nominating and Governance Committee and Shareholder Proposals in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Items 407(d)(4) and (d)(5) of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Committees of the Board of Directors-Audit Committee in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference. Item 11. EXECUTIVE COMPENSATION\nThe information required by Item 402 of Regulation S-K will appear under the heading COMPENSATION OF EXECUTIVE OFFICERS, in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 407(e)(4) of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Management Development and Compensation Committee Interlocks and Insider Participation in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 407(e)(5) of Regulation S-K will appear under the heading MANAGEMENT DEVELOPMENT AND COMPENSATION COMMITTEE REPORT in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required under Item 403 of Regulation S-K concerning security ownership of certain beneficial owners and management will appear under the headings CORPORATE GOVERNANCE-Security Ownership Of Certain Beneficial Owners and CORPORATE GOVERNANCE-SECURITY OWNERSHIP OF DIRECTORS, NOMINEES AND EXECUTIVE OFFICERS, in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 201(d) of Regulation S-K relating to securities authorized for issuance under equity compensation plans is included under the heading EQUITY COMPENSATION PLAN INFORMATION in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which is incorporated herein by reference. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by Item 404 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Certain Relationships and Related Transactions in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Section 407(a) of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Board Matters in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference. Item 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nOur independent public accounting firm is PricewaterhouseCoopers LLP, Singapore, PCAOB ID 1093.\nThe information required hereunder will appear under the heading AUDIT AND RELATED FEES in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nPart IV Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following documents are filed as part of this report:\nPage\n(1) Financial Statements: See our consolidated financial statements under Item 8\n(2) Financial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts 84\nAll other schedules are omitted because they are not applicable or the required information is\nshown in the Consolidated Financial Statements or notes thereto.\n(3) Exhibits:\nSee Exhibit Index within Item 15 below. 85\nKULICKE AND SOFFA INDUSTRIES, INC.\nSchedule II-Valuation and Qualifying Accounts\n(in thousands)\nFiscal 2023: Beginning of period Charged to Costs and Expenses Other Additions Other Deductions End of period\nAllowance for doubtful accounts $ - $ 49 $ - $ - (1) $ 49\nInventory reserve $ 19,238 $ 4,284 $ - $ (2,237) (2) $ 21,285\nValuation allowance for deferred taxes $ 21,750 $ - $ - $ (267) (3) $ 21,483\nFiscal 2022:\nAllowance for doubtful accounts $ 687 $ (245) $ - $ (442) (1) $ -\nInventory reserve $ 23,042 $ (2,171) $ - $ (1,633) (2) $ 19,238\nValuation allowance for deferred taxes $ 34,095 $ - $ - $ (12,345) (3) $ 21,750\nFiscal 2021:\nAllowance for doubtful accounts $ 968 $ (248) $ - $ (33) (1) $ 687\nInventory reserve $ 31,163 $ (2,965) $ - $ (5,156) (2) $ 23,042\nValuation allowance for deferred taxes $ 46,561 $ - $ - $ (12,466) (3) $ 34,095\n(1) Represents write-offs of specific accounts receivable.\n(2) Sale or scrap of previously reserved inventory.\n(3) Reflects the net decrease in the valuation allowance primarily associated with the Companys utilization of certain U.S. and foreign net operating losses for which a valuation allowance had previously been recorded, partially offset by an increase for U.S. and foreign tax credits, U.S. and foreign net operating losses and other deferred tax assets.\nEXHIBIT INDEX\nEXHIBIT NUMBER ITEM\n3.1 The Company's Amended and Restated Articles of Incorporation, dated December 5, 2007, is incorporated herein by reference to Exhibit 3(i) to the Company's Annual Report on Form 10-K for the fiscal year ended September 29, 2007, SEC file number 000-00121.\n3.2 The Company's Amended and Restated By-Laws, dated October 12, 2023, is incorporated herein by reference to Exhibit 3(i) to the Company's Current Report on Form 8-K dated October 13, 2023.\n4.1 Specimen Common Share Certificate of Kulicke and Soffa Industries Inc., is incorporated herein by reference to Exhibit 4 to the Company's Form-8A12G/A dated September 11, 1995, SEC file number 000-00121.\n4.2 Description of the Company's securities.\n10.1 Kulicke & Soffa Industries, Inc. Executive Severance Pay Plan, dated as of August 9, 2011, is incorporated herein by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on August 12, 2011.*\n10.2 Kulicke & Soffa Industries, Inc. Officer Severance Pay Plan, dated as of August 9, 2011, is incorporated herein by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed on August 12, 2011.*\n10.3 Form of Change of Control Agreement, is incorporated herein by reference to Exhibit 10.3 to the Company's Current Report on Form 8-K filed on August 12, 2011.*\n10.4 Form of Director Indemnification Agreement is incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 10, 2013.*\n10.5 Lease Agreement between DBS Trustee Limited, as trustee of Mapletree Industrial Trust, and the Kulicke & Soffa Pte. Ltd, dated December 1, 2013, is incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 5, 2013.\n10.6 Lease Agreement Variation Letter between DBS Trustee Limited, as trustee of Mapletree Industrial Trust, and the Kulicke & Soffa Pte. Ltd, dated December 1, 2013, is incorporated herein by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on December 5, 2013.\n10.7 Lease Agreement between DBS Trustee Limited, as trustee of Mapletree Industrial Trust, and Kulicke & Soffa Pte. Ltd, dated October 23, 2023.\n10.8 Form of Officer Indemnification Agreement is incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 11, 2013.*\n10.9 Offer Letter between Kulicke and Soffa Industries, Inc. and Fusen Chen dated October 3, 2016, incorporated herein by reference to Exhibit 10.1 of the Company's Current Report on Form 8-K filed on October 3, 2016.*\n10.10 2017 Equity Plan is incorporated herein by reference to Appendix A to the Company's Proxy Statement on Schedule 14A for the annual meeting of shareholders on March 14, 2017.*\n10.11 Form of Performance Share Unit Award Agreement regarding the 2017 Equity Plan is incorporated herein by reference to Exhibit 10.1 of the Company's Current Report on Form 8-K filed on November 6, 2017.\n10.12 Form of Restricted Share Unit Award Agreement regarding the 2017 Equity Plan is incorporated herein by reference to Exhibit 10.2 of the Company's Current Report on Form 8-K filed on November 6, 2017.\n10.13 The Company's 2021 Omnibus Incentive Plan is incorporated herein by reference to the Company's Proxy Statement on Schedule 14A for the annual meeting of shareholders on March 4, 2021\n10.14 Form of CEO Performance Share Unit Award Agreement (Growth PSUs) regarding the 2021 Omnibus Incentive Plan.\n10.15 Form of Executive Performance Share Unit Award Agreement (Growth PSUs) regarding the 2021 Omnibus Incentive Plan.\n10.16 Form of CEO Performance Share Unit Award Agreement (Relative TSR) regarding the 2021 Omnibus Incentive Plan.\n10.17 Form of Executive Performance Share Unit Award Agreement (Relative TSR) regarding the 2021 Omnibus Incentive Plan.\n10.18 Form of Restricted Stock Unit Award Agreement regarding the 2021 Omnibus Incentive Plan.\n10.19 Incentive Compensation Plan Fiscal Year 2023.\n10.20 Clawback Policy adopted as of October 12, 2023.\n10.21 Insider Trading Policy.\n21.1 Subsidiaries of the Company.\n23.1 Consent of PricewaterhouseCoopers LLP (Independent Registered Public Accounting Firm).\n31.1 Certification of Fusen Chen, Chief Executive Officer of Kulicke and Soffa Industries, Inc., pursuant to Rule 13a-14(a) or Rule 15d-14(a).\n31.2 Certification of Lester Wong, Chief Financial Officer of Kulicke and Soffa Industries, Inc., pursuant to Rule 13a-14(a) or Rule 15d-14(a).\n32.1 Certification of Fusen Chen, Chief Executive Officer of Kulicke and Soffa Industries, Inc., pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2 Certification of Lester Wong, Chief Financial Officer of Kulicke and Soffa Industries, Inc., pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document.\n104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101).\n* Indicates a management contract or compensatory plan or arrangement\n** Copies of certain instruments defining the rights of holders of certain of our long-term debt are not filed herewith. We hereby agree to furnish a copy of any such instrument to the SEC upon request.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nKULICKE AND SOFFA INDUSTRIES, INC.\nBy: /s/ FUSEN CHEN\nFusen Chen\nPresident and Chief Executive Officer\nDated: November 16, 2023\nSignature Title Date\n/s/ FUSEN CHEN President and Chief Executive Officer November 16, 2023\nFusen Chen (Principal Executive Officer)\n/s/ LESTER WONG Executive Vice President and Chief Financial Officer November 16, 2023\nLester Wong (Principal Financial Officer and Principal Accounting Officer)\n/s/ JON A. OLSON Director November 16, 2023\nJon A. Olson\n/s/ GREGORY F. MILZCIK\nDirector November 16, 2023\nGregory F. Milzcik\n/s/ CHIN HU LIM Director November 16, 2023\nChin Hu Lim\n/s/ JEFF RICHARDSON Director November 16, 2023\nDavid J. Richardson\n/s/ MUI SUNG YEO Director November 16, 2023\nMui Sung Yeo\n/s/ PETER T. KONG Director November 16, 2023\nPeter T. Kong\n/s/ DENISE M. DIGNAM Director November 16, 2023\nDenise M. Dignam"
}