{
    "cik": "56978",
    "company": "KULICKE & SOFFA INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-11-17",
    "period_of_report": "2022-10-01",
    "sic": "3674",
    "state_of_inc": "PA",
    "state_location": "U0",
    "fiscal_year_end": "1001",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/56978/0000056978-22-000136-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/56978/000005697822000136/klic-20221001.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/56978/0000056978-22-000136.txt",
    "filename": "56978_10K_2022_0000056978-22-000136.htm",
    "content": "Item 1. BUSINESS\nKulicke and Soffa Industries, Inc. (we, the Company or K&S) designs, manufactures and sells capital equipment and tools used to assemble semiconductor devices, including integrated circuits (ICs), high and low powered discrete devices, light-emitting diodes (LEDs), and power modules. In addition, we have a portfolio of equipment that is used to assemble components onto electronic circuit boards. We also service, maintain, repair and upgrade our equipment, and sell consumable aftermarket tools for our and our peer companies equipment. Our customers primarily consist of semiconductor device manufacturers, integrated device manufacturers (IDMs), outsourced semiconductor assembly and test providers (OSATs), other electronics manufacturers and automotive electronics suppliers.\nK&S was incorporated in Pennsylvania in 1956. Our principal offices are located at 23A Serangoon North Avenue 5, #01-01, Singapore 554369 and 1005 Virginia Dr., Fort Washington, PA 19034, and our telephone number in the United States is (215) 784-6000. We maintain a website with the address www.kns.com. We are not including the information contained on our website as a part of, or incorporating it by reference into, this filing. We make available free of charge (other than an investors own Internet access charges) on or through our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to these reports, as soon as reasonably practicable after the material is electronically filed with or otherwise furnished to the Securities and Exchange Commission (SEC). Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports are also available on the SEC's website at www.sec.gov.\nOur year end for each of fiscal 2022, 2021 and 2020 was October 1, 2022, October 2, 2021, and October 3, 2020, respectively.\nKey Events in Fiscal 2022\nSigning of definitive agreement for the acquisition of Advanced Jet Automation Co., Ltd.\nOn September 8, 2022, the Company announced that one of its subsidiaries signed a definitive agreement for the acquisition of Advanced Jet Automation Co., Ltd. (AJA), a technology company headquartered in Taiwan. Upon the consummation of the transaction, we will acquire the designated dispensing assets and the dispensing business of AJAs affiliate, Samurai Spirit Inc., a leading developer and manufacturer of high-precision micro dispensing equipment and solutions in Taiwan. The acquisition is expected to close in fiscal 2023, subject to customary closing conditions, including applicable regulatory approvals.\nCOVID-19 Pandemic\nThe COVID-19 pandemic and the resulting containment measures have significantly impacted the global economy, disrupted global supply chains, created volatility in equity market valuations, created significant volatility and disruption in financial markets, and affected unemployment levels. The global COVID-19 response remains dynamic and some countries continue to impose quarantines, containment measures or travel restrictions. In certain jurisdictions there has been a resurgence of illnesses or the threat of emerging new variants of the virus, which has led to more severe restrictions.\nIn response to the COVID-19 pandemic, we previously had to temporarily close certain offices in the United States, Europe and Asia as well as execute our Business Continuity Plan (BCP), which measures have disrupted our business operations. Our manufacturing locations have returned to normal operations and, as most countries have relaxed the containment measures over the past few months, we have recalibrated our BCP and restarted other activities in conformance with local guidelines. Our BCP has not included significant headcount reductions or changes in our overall liquidity position.\nMacroeconomic Headwinds\nWe continue to be impacted by the global shortage in electronic components and our supply chain is strained in some cases as the availability of materials, logistics and freight options are challenging in many jurisdictions, especially to, from and within China. In addition, the costs of logistics have increased as a result of macroeconomic conditions and general inflationary pressures, and labor shortages have further contributed to rising costs across the supply chain, further exacerbating the impact the pandemic has had on the supply chain.\nWe believe that the semiconductor industry macroeconomics have not changed and we anticipate that the industrys long-term growth projections will normalize, but the sector is seeing short-term volatility and disruptions due to general inflationary pressures, falling consumer sentiment, or economic downturn caused, directly or indirectly, by various macroeconomic factors, including the prolonged Ukraine/Russia conflict.\nThe prolonged Ukraine/Russia conflict did not materially impact our financial condition and operating results in fiscal 2022. We believe that our existing cash, cash equivalents, short-term investments, existing Facility Agreements, and anticipated cash flows from operations will be sufficient to meet our liquidity and capital requirements, notwithstanding the prolonged Ukraine/Russia conflict or other macroeconomic factors, for at least the next twelve months from the date of filing of this Annual Report on Form 10-K. However, this is a highly dynamic situation. As the macroeconomic situation remains highly volatile and the geopolitical situation remains uncertain, there is uncertainty surrounding the operations of our manufacturing locations, our business, our expectations regarding future demand or supply conditions and our near- and long-term liquidity, our financial condition and, consequentially, our operating results could deteriorate.\nThe effects of the COVID-19 pandemic and general macroeconomic conditions could adversely affect our business, results of operations, and financial condition. For other information, please see Part I Item 1A. RISK FACTORS\nSemiconductor Industry and Macroeconomic Risks\nOur operating results and financial condition could be adversely impacted by volatile worldwide economic conditions and unpredictable spending by our customers due to uncertainties in the macroeconomic environment.\nThough the semiconductor industrys cycle can be independent of the general economy, global economic conditions may have a direct impact on demand for semiconductor units and ultimately demand for semiconductor capital equipment and tools. Accordingly, our business and financial performance is impacted, both positively and negatively, by fluctuations in the macroeconomic environment. Expenditures by our customers depend on the current and anticipated market demand for semiconductors and products that use semiconductors, LEDs and batteries, including mobile devices, personal computers, consumer electronics, telecommunications equipment, automotive components, electric vehicles and other industrial products. Reductions or other fluctuations in our customers' spending as a result of uncertain conditions and volatility in the macroeconomic environment, including from government, economic or fiscal instability, economic recession, actual or potential inflation, rising interest rates, slower growth in certain geographic regions, global health crises and pandemics, restricted global credit conditions, reduced demand, excess inventory, higher energy prices, or other conditions, could adversely affect our business, financial condition and operating results. Further, our profitability can be affected by volatility because we incur a certain amount of fixed costs that we cannot modulate up and down to meet increases or decreases in demand. The impact of broad-based weakening in the global macroeconomic environment could make our customers cautious and delay orders until the economic outlook becomes clearer. Significant downturns in the market for semiconductor devices or in general economic conditions reduce demand for our products and can materially and adversely affect our business, financial condition and operating results. Our visibility into future demand is generally limited and forecasting is difficult, and we believe historic, industry-wide volatility will persist.\nThe COVID-19 pandemic has adversely affected our business, and may in the future materially and adversely affect our results of operations and financial condition.\nThe ongoing COVID-19 pandemic and resulting containment measures have significantly impacted the global economy, disrupted global supply chains, created significant volatility and disruption in financial markets, and affected unemployment levels. The global responses to the COVID-19 pandemic remain dynamic. Some countries continue to impose quarantines, containment measures or travel restrictions, and certain countries, such as China, continue to impose periodic lockdowns in response to rising case numbers. In certain jurisdictions, there has been a resurgence of illnesses or threat of emerging new variants of the virus, potentially leading to more severe restrictions in the future.\nWhile we continue our normal operations in all of our manufacturing locations, work-from-home practices have been instituted or permitted from time-to-time across our offices worldwide, which have in some cases impacted our non-manufacturing productivity. We could experience further productivity disruptions in the event of an outage to systems and technologies critical to effect remote work, or from the increased data security and technology risks arising therefrom.\nThe COVID-19 pandemic continues to disrupt our supply chain, including materials, equipment, engineering support and services, especially to, from and within China. In addition, the costs of logistics have increased as a result of general inflationary pressures, and labor shortages have further contributed to rising costs across the supply chain, further exacerbating the impact the pandemic has had on the supply chain.\nOther effects of the COVID-19 pandemic on our business will depend on future developments that cannot be accurately predicted at this time, but may include the following:\na decrease in short-term and/or long-term demand for our products resulting from widespread business shutdowns and slowdowns, quarantines, travel and logistics restrictions and other actions taken by governments, businesses, and the general public in an effort to limit exposure to and spread of COVID-19;\nnegative impacts to our operations, technology development, new product introduction and customer qualifications resulting from our efforts to mitigate the impact of COVID-19 through execution of our BCP;\nincreased volatility in the semiconductor and electric vehicle industries due to heightened uncertainty, including our inability to keep pace relative to our competitors during a post-COVID-19 market recovery should that occur; and\nreduced sales volume to or loss of customers, or cancellation, delay or reduction of backlogged customer orders.\nThe ultimate impact of COVID-19 on our business will depend on, among other things:\nthe extent and duration of the pandemic, the severity of the disease;\nthe emergence of new variants of the virus;\nthe distribution and effectiveness of available vaccines and boosters and the rates at which they are administered;\nthe effects on the economy of the pandemic and of the measures taken by governmental authorities and other third parties restricting day-to-day life,\ninternational travel and border crossings, and the length of time that such measures remain in place; and\ngovernmental programs implemented to assist businesses impacted by the COVID-19 pandemic.\nTo the extent the COVID-19 pandemic adversely affects our business, results of operations and financial conditions, it may also exacerbate the other risks discussed in this section on Risk Factors.\nWe depend on our suppliers, including sole source suppliers, for raw materials, components and subassemblies. If our suppliers do not deliver their products to us, or deliver non-compliant or defective products, we would be unable to deliver our products to our customers.\nOur products are complex and require raw materials, components and subassemblies having a high degree of reliability, accuracy and performance. We rely on subcontractors to manufacture many of these components and subassemblies and we rely on sole source suppliers for certain key technology parts and raw materials. As a result, we are exposed to a number of significant risks, including:\ndecreased control over the manufacturing process for components and subassemblies;\nchanges in our manufacturing processes in response to changes in the market, which may delay our shipments;\nour inadvertent use of defective or contaminated raw materials;\nthe relatively small operations and limited manufacturing resources of some of our suppliers, which may limit their ability to manufacture and sell subassemblies, components or parts in the volumes we require and at acceptable quality levels and prices;\nrestrictions on our ability to rely on suppliers due to changes in trade regulation as well as laws and regulations enacted in response to concerns related to climate change, conflict minerals, or responsible sourcing practices;\nthe inability of suppliers to meet our or other customer demand requirements;\nreliability or quality issues with certain key subassemblies provided by single source suppliers as to which we may not have any short-term alternative;\nshortages caused by disruptions at our suppliers and subcontractors for a variety of reasons, including public health emergencies and associated containment measures (such as the COVID-19 pandemic), geopolitical tensions (such as the Ukraine/Russia conflict), significant natural disasters (including as a result of climate change) or significant price changes (including as a result of inflationary pressures);\ndelays in the delivery of raw materials or subassemblies, which, in turn, may delay shipments to our customers;\nloss of suppliers as a result of consolidation of suppliers in the industry; and\nloss of suppliers because of their bankruptcy or insolvency.\nIf any of these risks were to materialize, we might be unable to deliver our products to our customers on time and at expected cost, or at all. While we observed some easing of the industry-wide supply constraints towards the end of fiscal 2022, we expect constraints to continue and the duration of such constraints or their long-term impact on our business cannot be predicted at this time.\nAs part of our supply chain management, we have increased our inventory levels in an effort to mitigate component shortages. These increases in our inventory levels may lead to an excess of materials in the future in the event that the demand for our products is lower than our expectations or if we otherwise fail to anticipate future customer demand properly. Excess inventory levels could result in inventory write-downs at discounted prices, which could adversely affect our cash flows or gross margins. As a result, our business, financial condition and operating results would be materially and adversely affected.\nThe semiconductor industry is volatile with sharp periodic downturns and slowdowns. Cyclical industry downturns are made worse by volatile global economic conditions.\nThe semiconductor industry is volatile, with periods of rapid growth followed by industry-wide retrenchment. These periodic downturns and slowdowns have in the past adversely affected our business, financial condition and operating results. Downturns have been characterized by, among other things, diminished product demand, excess production capacity, and accelerated erosion of selling prices. Historically these downturns have severely and negatively affected the industrys demand for capital equipment, including assembly equipment and, to a lesser extent, tools. In any case, we believe the historical volatility of our business, both upward and downward, will persist. Consequently, our revenues may decline, and our results of operations and financial condition may be adversely affected.\nDifficulties in forecasting demand for our product lines may lead to periodic inventory shortages or excesses.\nWe typically operate our business with limited visibility of future demand. We do not have long-term contracts with many of our customers. As a result, demand for our products in future periods is difficult to predict and we sometimes experience inventory shortages or excesses. We generally order supplies and otherwise plan our production based on internal forecasts for demand. We have in the past failed, and may again in the future fail, to accurately forecast demand for our products. This has led to, and may in the future lead to, delays in product shipments or, alternatively, an increased risk of inventory obsolescence. As part of our supply chain management, we have increased our inventory levels in an effort to mitigate component shortages, which may increase the risk of inventory obsolescence. If we fail to accurately forecast demand for our products, our business, financial condition and operating results may be materially and adversely affected.\nOur quarterly operating results fluctuate significantly and may continue to do so in the future.\nIn the past, our quarterly operating results have fluctuated significantly. We expect that our quarterly results will continue to fluctuate. Although these fluctuations are partly due to the cyclical and volatile nature of the semiconductor industry, they also reflect other factors, many of which are outside of our control.\nSome of the factors that may cause our net revenue and operating margins to fluctuate significantly from period to period are:\nmarket downturns;\nindustry inventory levels;\nthe mix of products we sell because, for example:\n◦certain lines of equipment or certain aftermarket tools within our business segments are more profitable than others; and\n◦some sales arrangements have higher gross margins than others;\ncanceled or deferred orders;\nvariations in sales channel or mix of direct sales and indirect sales;\nseasonality;\ncompetitive pricing pressures may force us to reduce prices;\nhigher than anticipated costs of development, achieving customer acceptance or production of new products;\nthe availability and cost of the components for our products;\ndelays in the development and manufacture of our new products and upgraded versions of our products and market acceptance of these products when introduced;\ncustomers delay in purchasing our products due to anticipation that we or our competitors may introduce new or upgraded products; and\nour competitors introduction of new products.\nMany of our expenses, such as research and development, selling, general and administrative expenses, and interest expense, do not vary directly with our net revenue. Our research and development efforts include long-term projects lasting a year or more, which require significant investments. In order to realize the benefits of these projects, we believe that we must continue to fund them even during periods when our revenue has declined. As a result, a decline in our net revenue would adversely affect our operating results as we continue to make these expenditures. In addition, if we were to incur additional expenses in a quarter in which we did not experience comparable increased net revenue, our operating results would decline. In a downturn, we may have excess inventory, which could be written off. Some of the other factors that may cause our expenses to fluctuate from period-to-period include:\ntiming and extent of our research and development efforts;\nseverance, restructuring, and other costs of relocating facilities;\ninventory write-offs due to obsolescence or other causes; and\nan increase in the cost of labor or materials.\nBecause our net revenue and operating results are volatile and difficult to predict, we believe consecutive period-to-period or year-over-year comparisons of our operating results may not be a good indication of our future performance.\nCompetitive Risks\nOur average selling prices usually decline over time and may continue to do so.\nTypically, our average selling prices have declined over time due to continuous price pressure from our customers and competitive cost reductions in our industrys supply chains. We seek to offset this decline by continually reducing our cost structure by consolidating operations in lower cost areas, reducing other operating costs, by pursuing product strategies focused on product performance and customer service, and developing new products for which we are able to charge higher prices. These efforts may not enable us to fully offset price declines, and if they do not, our financial condition and operating results may be materially and adversely affected.\nWe may not be able to rapidly develop, manufacture and gain market acceptance of new and enhanced products required to maintain or expand our business.\nWe believe our continued success depends on our ability to continuously develop and manufacture new products and product enhancements on a timely and cost-effective basis. We must introduce these products and product enhancements into the market in a timely manner in response to customers demands for higher performance assembly equipment and leading-edge materials customized to address rapid technological advances in integrated circuits, and capital equipment designs. Our competitors may develop new products or enhancements to their products that offer improved performance and features, or lower prices which may render our products less competitive. The development and commercialization of new products require significant capital expenditures over an extended period of time, and some products we seek to develop may never become profitable. In addition, we may not be able to develop and introduce products incorporating new technologies in a timely manner that will satisfy our customers future needs or achieve market acceptance. If we are not able to develop and sell our products that meet the demands of our customers, it would result in lower net revenues and our operating results would be adversely affected.\nWe may be unable to continue to compete successfully in the highly competitive semiconductor equipment and packaging materials industries.\nThe semiconductor equipment and packaging materials industries are very competitive. In the semiconductor equipment industry, significant competitive factors include price, speed/throughput, production yield, process control, delivery time, innovation, quality and customer support. In the semiconductor packaging materials industry, significant competitive factors include price, delivery and quality.\nIn each of our markets, we face competition and the threat of competition from established competitors and potential new entrants. In addition, established competitors may combine to form larger, better-capitalized companies. Some of our competitors have or may have significantly greater financial, engineering, manufacturing and marketing resources than we do. Some of these competitors are Asian and European companies that have had, and may continue to have, an advantage over us in supplying products to local customers who appear to prefer to purchase from local suppliers. Some of these competitors compete across many of our product lines, while others are primarily focused in a specific product area, sometimes with government assistance or through the support of strategic alliances, all of which could result in lowering the barriers to entry.\nWe expect our competitors to improve their current products performance, and to introduce new products and materials with improved price and performance characteristics. Our competitors may independently develop technology similar to or better than ours. They may also appropriate our technology and our intellectual property to compete against us and we may not have adequate legal recourse. New product and material introductions by existing competitors or by new market entrants could hurt our sales. If a semiconductor manufacturer or subcontract assembler selects a competitors product or materials for a particular assembly operation, we may not be able to sell products or materials to that manufacturer or assembler for a significant period of time. Manufacturers and assemblers sometimes develop lasting relationships with suppliers and assembly equipment providers in our industry and often go years without requiring replacement. In addition, we may have to lower our prices in response to price cuts by our competitors, which may materially and adversely affect our business, financial condition and operating results. If we cannot compete successfully, we could lose customers and experience reduced margins and profitability.\nGeographic, Trade and Customer Risks\nSubstantially all of our sales, distribution channels and manufacturing operations are located outside of the U.S., which subjects us to risks, including risks from changes in trade regulations, currency fluctuations, political instability and conflicts.\nOver 90% of our net revenue is derived from shipments to customers located outside of the U.S., primarily in the Asia/Pacific region. In the Asia/Pacific region, our customer base remains more geographically concentrated in China as a result of economic and industry conditions. Approximately 56.9%, 55.6% and 51.6% of our net revenue for fiscal 2022, 2021, and 2020, respectively, was derived from shipments to customers located in China.\nWe expect our future performance to depend on our ability to continue to compete in foreign markets, particularly in the Asia/Pacific region. Some of these economies have been highly volatile, resulting in significant fluctuation in local currencies, and political and economic instability. Some of these economies may also increase trade protectionism, thereby increasing barriers to entry, amplifying supply chain risks and adversely affecting the demand for our products. These conditions may continue or worsen, which may materially and adversely affect our business, financial condition and operating results.\nWe also rely on non-U.S. suppliers for materials and components used in our products, and substantially all of our manufacturing operations are located in countries other than the U.S. We manufacture our ball, wedge and APAMA bonders in Singapore, our Hybrid and Electronic Assembly solutions in the Netherlands, our dicing blades, capillaries and bonding wedges in China, and our capillary blanks in Israel and China. We also rely on independent foreign distribution channels for certain of our product lines. As a result, a major portion of our business is subject to the risks associated with international, and particularly Asia/Pacific, commerce, such as:\nstringent and frequently changing trade compliance regulations;\nless protective foreign intellectual property laws, and the enforcement of patent and other intellectual property rights;\nlonger payment cycles in foreign markets;\nforeign exchange restrictions and capital controls, monetary policies and regulatory requirements;\nrestrictions or significant taxes on the repatriation of our assets, including cash;\ntariff and currency fluctuations;\ndifficulties of staffing and managing dispersed international operations, including labor work stoppages and strikes in our factories or the factories of our suppliers;\nchanges in our structure or tax incentive arrangements;\npossible disagreements with tax authorities;\nepisodic events outside our control such as, for example, outbreaks of coronaviruses, influenza or other illnesses;\nnatural disasters such as earthquakes, fires or floods, including as a result of climate change;\nrisks of war and civil disturbances, including the Ukraine/Russia conflict, or other events that may limit or disrupt manufacturing, markets and international trade;\nact of terrorism that impact our operations, customers or supply chain or that target U.S. interests or U.S. companies;\nseizure of our foreign assets, including cash;\nthe imposition of sanctions of countries in which we do business;\nchanging political conditions and rising geopolitical tensions; and\nlegal systems which are less developed and may be less predictable than those in the U.S.\nIn addition, there is a potential risk of conflict and instability in the relationship between Taiwan and China which could disrupt the operations of our customers and/or suppliers in both Taiwan and China, our manufacturing operations in China, and our future plans in the region.\nOur international operations also depend on favorable trade relations between the U.S. and those foreign countries in which our customers, subcontractors and materials suppliers have operations. A protectionist trade environment in either the U.S. or those foreign countries in which we do business, such as a change in the current tariff structures, export compliance or other trade policies, may materially and adversely affect our ability to sell our products in foreign markets.\nCatastrophic events, such as pandemics and extreme weather events as a result of climate change, can have a material adverse effect on our operations and financial results.\nOur operations and business, and those of our customers and suppliers, can be disrupted by natural disasters, public health issues (including the COVID-19 pandemic), cybersecurity incidents, interruptions of service from utilities, or other catastrophic events including as a result of climate change. For example, we have at times experienced temporary disruptions in our manufacturing processes as a result of power outages. In addition, global climate change can result in natural disasters occurring more frequently, with greater intensity and with less predictability. For example, in August 2022, Chinas Sichuan province ordered all factories to shut down for an extended period to ease a power shortage in the region resulting from an unprecedented heat wave crossing 104-degree Fahrenheit in dozens of Chinese cities. As Sichuan is a key manufacturing location for the semiconductor and solar panel industries, such power rationing measures impacted factories and suppliers who operate there. The long-term effects of climate change on the global economy and the semiconductor industry in particular are unclear but could be severe, and could exacerbate the other risk factors described herein. Catastrophic events could make it difficult or impossible to manufacture or deliver products to our customers, receive materials from our suppliers, or perform critical functions, whether on a timely basis or at all, which could adversely affect our revenue and operations. Some of the systems we maintain as part of our business recovery plans cannot guarantee us protection from such disruptions. Furthermore, even if our operations are unaffected or recover quickly, if our customers or suppliers cannot timely resume their own operations due to a catastrophic event, we may be unable to fulfil our customers orders, and may experience reduced or cancelled orders or other disruptions to our supply chain that may adversely affect our results of operations.\nWe are subject to export restrictions that may limit our ability to sell to certain customers, and trade wars, in particular the U.S.-China trade war, could adversely affect our business.\nThe U.S. and several other countries levy tariffs on certain goods and impose other trade restrictions that may impact our customers investment in manufacturing equipment, reduce the competitiveness of our products, or inhibit our ability to sell products or purchase necessary equipment and supplies. In particular, trade tensions between the U.S. and China have been escalating since 2018, with U.S. tariffs on Chinese goods and retaliatory Chinese tariffs on U.S. goods. We cannot predict what further actions may ultimately be taken with respect to tariffs or trade relations between the U.S. and other countries, what products may be subject to such actions, or what actions may be taken by other countries in response. Further changes in trade policy, tariffs, additional taxes, restrictions on exports or other trade barriers, or restrictions on supplies, equipment, and raw materials, may limit our ability to produce products, increase our selling and/or manufacturing costs, reduce the competitiveness of our products, or inhibit our ability to sell products or purchase necessary equipment and supplies, which could have a material adverse effect on our business, results of operations, or financial condition.\nThough nearly all of our manufacturing activities take place outside of the U.S., certain of our advanced packaging products are subject to the EAR because they are based on U.S. technology or contain more than a de minimis amount of controlled U.S. content. The EAR require licenses for, and sometimes prohibit, the export of certain products. The CCL sets forth the types of goods and services controlled by the EAR, including civilian science, technology, and engineering dual-use items. For products listed on the CCL, a license may be required as a condition to export depending on the end destination, end use or end user and any applicable license exceptions.\nIn 2020, the U.S. Department of Commerce Bureau of Industry and Security (BIS) amended the EAR to expand controls on certain foreign products based on U.S. technology and sold to Huawei and certain other companies. In October 2022, the BIS amended the EAR again to extend those foreign controls to numerous companies on BIS so-called Entity List. The 2020 and 2022 amendments impact some of our advanced packaging products, which are based on U.S. technology and are within the scope of the expanded EAR controls on Huawei and other Entity List companies. Therefore, these products cannot be sold to Huawei and other Entity List companies, and are subject to certain end-use restrictions. To date, these amendments to the EAR have not had a material direct impact on our business, financial condition or results of operations and we do not expect that they will, although they could have indirect impacts, including increasing tensions in U.S. and Chinese trade relations, potentially leading to negative sentiments towards U.S.-based companies among Chinese consumers. Additionally, some end users may prefer to avoid the U.S. supply chain to avoid the application of these regulations.\nFuture changes in, and responses to, U.S. trade policy could reduce the competitiveness of our products and cause our sales to decline, and therefore could have a material adverse effect on our business, financial condition or results of operations.\nBecause a small number of customers account for most of our sales, our net revenue could decline if we lose a significant customer.\nThe semiconductor manufacturing industry is highly concentrated, with a relatively small number of large semiconductor manufacturers and their subcontract assemblers and vertically integrated manufacturers of electronic systems purchasing a substantial portion of our semiconductor assembly equipment and packaging materials. Sales to a relatively small number of customers have historically accounted for a significant percentage of our net revenue. There was no customer with sales representing more than 10% of net revenue in fiscal 2022. Sales to our ten largest customers comprised 49.1% and 62.0% of our net revenue for fiscal 2022 and fiscal 2021, respectively.\nWe expect a small number of customers will continue to account for a high percentage of our net revenue for the foreseeable future. Thus, our business success depends on our ability to maintain strong relationships with our customers. Any one of a number of factors could adversely affect these relationships. If, for example, during periods of escalating demand for our equipment, we were unable to add inventory and production capacity quickly enough to meet the needs of our customers, or if because of supply chain constraints we are not able to fulfil our customers' orders, they may turn to other suppliers making it more difficult for us to retain their business. We may also make commitments from time-to-time to our customers regarding minimum volumes and performance standards, and if we are unable to meet those commitments, we may incur liabilities to our customers. If we lose orders from a significant customer that we are not able to replace, if a significant customer reduces its orders substantially, or if we incur liabilities for not meeting customer commitments, these losses, reductions or liabilities may materially and adversely affect our business, financial condition and operating results.\nWe maintain a backlog of customer orders that is subject to cancellation, reduction or delay in delivery schedules, which may result in lower than expected revenues.\nWe manufacture products primarily pursuant to purchase orders for current delivery or to forecast, rather than pursuant to long-term supply contracts. As a result, we must commit resources to the manufacture of products without binding purchase commitments from customers. The semiconductor industry is occasionally subject to double-booking and rapid changes in customer outlooks or unexpected build ups of inventory in the supply channel as a result of shifts in end market demand and macro-economic conditions. Accordingly, many of these purchase orders or forecasts may be revised or canceled without penalty. Even in cases where our standard terms and conditions of sale or other contractual arrangements do not permit a customer to cancel an order without penalty, we may from time to time accept cancellations to maintain customer relationships or because of industry practice, custom or other factors. The broad-based weakening in the global macroeconomic environment may result in lower than expected demand for our products, and our inability to sell products after we devote significant resources to them could have a material adverse effect on our levels of inventory, revenues and profitability.\nHuman Capital Risks\nIncreased labor costs and competition for qualified personnel may reduce the efficiency of our flexible manufacturing model and adversely impact our operating results.\nThe labor costs in the various countries in which we operate are rising. There is substantial competition in China and Singapore for qualified and capable manufacturing personnel, which may make it difficult for us to recruit and retain qualified employees. In addition, current or future immigration laws, policies or regulations may limit our ability to attract, hire and retain qualified employees in Singapore. If we are unable to staff sufficient personnel at our China, Singapore, Israel and the Netherlands facilities or if there are increases in labor costs that we are unable to recover in our pricing to our customers, we may experience increased manufacturing costs, which would adversely affect our operating results.\nOur business depends on attracting and retaining management, sales and technical employees as well as on the succession of senior management.\nOur future success depends on our ability to hire and retain qualified management, sales, finance, accounting and technical employees, including senior management. Experienced personnel with the relevant and necessary skill sets in our industry are in high demand and competition for their talents is intense, especially in Asia, where most of the Companys key personnel are located. If we are unable to continue to attract and retain the managerial, marketing, finance, accounting and technical personnel we require, our business, financial condition and operating results may be materially and adversely affected.\nEffective succession planning is also important to our long-term success. Failure to ensure effective transfer of knowledge and smooth transitions involving senior management could hinder our strategic planning and execution. From time to time, senior management or other key employees may leave our company, and the loss of any key employee could result in significant disruptions to our operations, including adversely affecting the timeliness of product releases, the successful implementation and completion of company initiatives, the effectiveness of our disclosure controls and procedures and our internal control over financial reporting, and the results of our operations. Changes in immigration policies may also impair our ability to recruit and hire technical and professional talent. In addition, hiring, training, and successfully integrating replacement critical personnel could be time consuming, may cause additional disruptions to our operations, and may be unsuccessful, which could negatively impact future revenues.\nProduct Risks\nAlternative packaging technologies may render some of our products obsolete and materially and adversely affect our overall business and financial results.\nAlternative packaging technologies have emerged that may improve device performance or reduce the size of an integrated circuit package, as compared to traditional wire bonding. These technologies include flip chip and wafer-level packaging. Some of these alternative technologies eliminate the need for wires to establish the electrical connection between a die and its package. The semiconductor industry may, in the future, shift a significant part of its volume into alternative packaging technologies which do not employ our products. If a significant shift to alternative packaging technologies or to another technology not offered by us were to occur, demand for our equipment and related packaging materials may be materially and adversely affected. Given that a majority of our revenue comes from wire bonding, a reduced demand for our wire bonding equipment could materially and adversely affect our financial results.\nWe may send products and equipment to customers or potential customers for trial, evaluation or other purposes which may result in retrofit charges, impairments or write-down of inventory value if the products and equipment are not subsequently purchased by the customers.\nFrom time to time we send certain products and equipment to customers or potential customers for testing, evaluation or other purposes in advance of receiving any confirmation of purchase or purchase orders. Such equipment may be at the customer location for an extended period of time per the agreements with these customers and potential customers. The customer or potential customer may refuse to buy all or partial quantities of such product or equipment and return this back to us. As a result, we may incur charges to retrofit the machines or sell the machines as second hand at a lower price, and accordingly may have to record impairments on the returned inventory, all of which would adversely affect our operating results.\nUndetected problems in our products could directly impair our financial results.\nIf errata (deviations from product specifications) or flaws in design, production, assembly or testing of our products (by us or our suppliers) were to occur, we could experience a rate of failure in our products that would result in materially adverse consequences, including:\nincurring warranty expenses;\nwriting off the value of inventory;\ndisposing of products that cannot be fixed;\nretrofitting products that have been shipped;\nproviding product replacements or modifications; and\ndefending against litigation.\nContinued improvement in manufacturing capabilities, control of material and manufacturing quality and costs and product testing are critical factors in our future growth. Our efforts to monitor, develop, modify and implement appropriate tests and manufacturing processes for our products may not be sufficient to permit us to avoid a rate of failure in our products that results in substantial delays in shipment, significant repair or replacement costs, potential damage to our reputation or general customer dissatisfaction with our products. We may also not be able to obtain product liability or other insurance to fully cover such risks. Any of the foregoing risks, if they were to materialize, could have a material adverse effect on our business, results of operations or financial condition.\nOperations and Supply Chain Risks\nWe may not be able to continue to consolidate manufacturing and other facilities or entities without incurring unanticipated costs and disruptions to our business.\nAs part of our ongoing efforts to drive further efficiency, we may consolidate our manufacturing and other facilities or entities. Should we consolidate, we may experience unanticipated events, including the actions of governments, suppliers, employees or customers, which may result in unanticipated costs and disruptions to our business. We may also incur restructuring charges, severance costs, asset impairments, loss of accumulated knowledge, inefficiency during transitional periods, employee attrition and other effects that could negatively impact our financial condition and results of operations.\nWe may be materially and adversely affected by environmental and safety laws and regulations, including laws and regulations implemented in response to climate change.\nWe are subject to various federal, state, local and foreign laws and regulations governing, among other things, the generation, storage, use, emission, discharge, transportation and disposal of hazardous material, investigation and remediation of contaminated sites and the health and safety of our employees. Public attention continues to focus on the environmental impact of manufacturing operations and the risk to neighbors of waste and chemical releases from such operations.\nProper waste disposal plays an important role in the operation of our manufacturing plants. In many of our facilities we maintain wastewater treatment systems that remove metals and other contaminants from process wastewater. These facilities operate under permits that must be renewed periodically. A violation of those permits may lead to revocation of the permits, fines, penalties or the incurrence of capital or other costs to comply with the permits, including the potential shutdown of operations.\nCompliance with existing or future land use, environmental, climate-related and health and safety laws and regulations may: (1) result in significant costs to us for additional capital equipment or other process requirements; (2) restrict our ability to expand our operations, and/or (3) cause us to curtail our operations. We also could incur significant costs, including cleanup costs, fines or other sanctions and third-party claims for property damage or personal injury, as a result of violations of or liabilities under such laws and regulations.\nIncreasingly, various agencies and governmental bodies have expressed interest in promulgating rules relating to climate change. For example, in March 2022, the SEC published a proposed rule that would require companies to provide significantly expanded climate-related disclosures in their Form 10-K, which may require us to incur significant additional costs to comply and impose increased oversight obligations on our management and Board of Directors. The cost of complying, or of failing to comply, with these and other regulatory requirements or contractual obligations could adversely affect our operating results, financial condition and ability to conduct our business.\nTo the extent that higher costs result in higher prices for our products, we may experience a reduction in the demand for those products, which could negatively affect our results of operations. Conversely, we may not be able to pass these increased costs onto our customers in the form of higher prices, as a result of which our results of operations may also be adversely affected.\nWe may acquire or divest businesses or enter into joint ventures or strategic alliances, which may materially affect our business, financial condition and operating results.\nWe continually evaluate our portfolio of businesses and may decide to buy or sell businesses or enter into joint ventures or other strategic alliances. We may not find suitable acquisition candidates, we may not be able to close such acquisitions, and the acquisitions we complete may not be successful. We may be unable to successfully integrate acquired businesses with our existing businesses and successfully implement, improve and expand our systems, procedures and controls to accommodate these acquisitions. If we are not able to successfully integrate any acquired businesses with ours, the anticipated benefits of the acquisitions may not be realized fully or may take longer than expected to be realized. We may also incur higher than expected costs as a result of any acquisitions or experience an overall post-completion process that takes longer than originally anticipated.\nThese transactions place additional demands on our management, our various functional teams and our current labor force. The combination of businesses may result in the loss of key personnel or an interruption of, or loss of momentum in, our existing businesses and/or the acquired business. In addition, we may need to divest existing businesses, which would cause a decline in revenue or profitability and may make our financial results more volatile. If we fail to integrate and manage acquired businesses successfully or to mitigate the risks associated with divestitures, joint ventures or other alliances, or if the time and costs associated with integration exceeds our expectations, or if our acquired business were to perform poorly, our business, financial condition and operating results may be materially and adversely affected.\nIncreasing attention to ESG matters, including any targets or other ESG initiatives, could result in additional costs or risks or adversely impact our business\nCertain investors, shareholder advocacy groups, other market participants, customers and other stakeholder groups have focused increasingly on companies' environmental, social and governance (ESG) initiatives, including those concerning climate change, human rights, diversity and inclusion, and shareholder proxy access. This may result in increased costs, enhanced compliance or disclosure obligations and costs, or other adverse impacts on our business, financial condition or results of operations.\nFrom time to time, we create and publish voluntary disclosures regarding ESG matters. Our sustainability report, currently in its sixth edition, continues to outline our Companys strategies, initiatives and performance of ESG topics identified through a materiality assessment to be most relevant to the operations and stakeholders of our Company. The identification, assessment, and disclosure of such matters is complex. Many of the statements in such voluntary disclosures are based on our expectations and assumptions, which may require substantial discretion and forecasts about costs and future circumstances.\nAdditionally, ESG matters continue to evolve rapidly. Organizations that provide information to investors on ESG matters may develop more discrete rating matrices, benchmarks and processes on evaluating companies on their ESG approach. This may create opportunities for misalignment or perceived failure resulting in unfavorable ESG ratings. This could foster negative investor sentiment toward us, our customers, or our industry, which could negatively impact our business and operations. To the extent ESG matters negatively impact our reputation, it may also impede our ability to compete as effectively to recruit or retain employees, which may adversely affect our operations.\nIntellectual Property Risks\nOur success depends in part on our intellectual property, which we may be unable to protect.\nOur success depends in part on our proprietary technology. To protect this technology, we rely principally on contractual restrictions (such as nondisclosure and confidentiality provisions) in our agreements with employees, subcontractors, vendors, consultants and customers and on the common law of trade secrets and proprietary know-how. We also rely, in some cases, on patent and copyright protection, although this protection may in some cases be insufficient due to the rapid development of technology in our industry. We may not be successful in protecting our technology for a number of reasons, including the following:\nemployees, subcontractors, vendors, consultants and customers may violate their contractual agreements, and the cost of enforcing those agreements may be prohibitive, or those agreements may be unenforceable or more limited than we anticipate;\nforeign intellectual property laws may not adequately protect our intellectual property rights; and\nour patent and copyright claims may not be sufficiently broad to effectively protect our technology; our patents or copyrights may be challenged, invalidated or circumvented; or we may otherwise be unable to obtain adequate protection for our technology.\nAlso, competitors may copy or misappropriate our trade secrets, products or designs either through lawful means of reverse engineering or through unlawful means that we are unable to prove, in either case eroding our market share. In addition, our partners and alliances may have rights to technology developed by us. We may incur significant expense to protect or enforce our intellectual property rights. If we are unable to protect our intellectual property rights, our competitive position may be weakened.\nThird parties may claim we are infringing on their intellectual property, which could cause us to incur significant litigation costs or other expenses, or prevent us from selling some of our products.\nThe semiconductor industry is characterized by rapid technological change, with frequent introductions of new products and technologies. Industry participants often develop products and features similar to those introduced by others, creating a risk that their products and processes may give rise to claims they infringe on the intellectual property of others. We may unknowingly infringe on the intellectual property rights of others and incur significant liability for that infringement. If we are found to have infringed on the intellectual property rights of others, we could be enjoined from continuing to manufacture, market or use the affected product, or be required to obtain a license to continue manufacturing or using the affected product. A license could be very expensive to obtain or may not be available at all. Similarly, changing or re-engineering our products or processes to avoid infringing the rights of others may be costly, impractical or time consuming.\nOccasionally, third parties assert that we are, or may be, infringing on or misappropriating their intellectual property rights. In these cases, we defend, and will continue to defend, against claims or negotiate licenses where we consider these actions appropriate. Intellectual property cases are uncertain and involve complex legal and factual questions. If we become involved in this type of litigation, it could consume significant resources and divert our attention from our business.\nInformation Technology and Enterprise System Risks\nWe may be subject to disruptions or failures in our information technology systems and network infrastructures that could have a material adverse effect on us.\nWe maintain and rely extensively on information technology systems and network infrastructures for the effective operation of our business. We also hold large amounts of data in data center facilities around the world, primarily in Singapore and the U.S., on which our business depends. A disruption, infiltration or failure of our information technology systems or any of our data centers as a result of software or hardware malfunctions, computer viruses, cyber-attacks, employee theft or misuse, power disruptions, natural disasters or accidents could cause breaches of data security and loss of critical data, which in turn could materially adversely affect our business. Our security procedures, such as virus protection software, data loss protection and our business continuity planning, such as our disaster recovery policies and back-up systems, may not be adequate or implemented properly to fully address the adverse effect of such events, which could adversely impact our operations. In addition, our business could be adversely affected to the extent we do not make the appropriate level of investment in our technology systems as our technology systems become out-of-date or obsolete and are not able to deliver the type of data integrity and reporting we need to run our business. Furthermore, when we implement new systems and/or upgrade existing systems, we could be faced with temporary or prolonged disruptions that could adversely affect our business.\nWe have experienced, and expect to continue to be subject to, cybersecurity threats and incidents, ranging from employee error or misuse, to individual attempts to gain unauthorized access to information systems, to sophisticated and targeted measures known as advanced persistent threats, none of which have been material to the Company to date. We devote significant resources to network security and other measures to protect our systems and data from unauthorized access or misuse. However, depending on the nature and scope, cybersecurity incidents could result in business disruption; the misappropriation, corruption or loss of confidential information and critical data (of the Company or that belonging to third parties); reputational damage; litigation with third parties; diminution in the value of our investment in research, development and engineering; data privacy issues; and increased cybersecurity protection and remediation costs.\nWe are implementing a new enterprise resource planning system. Our failure to implement it successfully, on time and on budget could have a material adverse effect on us.\nIn 2020 we began implementing a new enterprise resource planning (ERP) system, and will continue to implement the new system in phases across our various entities over the next two years. ERP implementations are complex, time-consuming, labor intensive, and involve substantial expenditures on system software and implementation activities. The ERP system is critical to our ability to provide important information to our management, obtain and deliver products, provide services and customer support, send invoices and track payments, fulfill contractual obligations, accurately maintain books and records, provide accurate, timely and reliable reports on our financial and operating results, and otherwise operate our business. ERP implementations also require transformation of business and financial processes in order to reap the benefits of the ERP system. Any such implementation involves risks inherent in the conversion to a new computer system, including loss of information and potential disruption to our normal operations. The implementation and maintenance of the new ERP system has required, and will continue to require, the investment of significant financial and human resources and the implementation may be subject to delays and cost overruns. In addition, we may not be able to successfully complete the implementation of the new ERP system without experiencing difficulties.\nAny disruptions, delays or deficiencies in the design and implementation or the ongoing maintenance of the new ERP system could adversely affect our ability to process orders, ship products, provide services and customer support, send invoices and track payments, fulfill contractual obligations, accurately maintain books and records, provide accurate, timely and reliable reports on our financial and operating results, including reports required by the SEC such as the evaluation of our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act of 2002, and otherwise operate our business. Additionally, if we do not effectively implement the ERP system as planned or the system does not operate as intended, the effectiveness of our internal control over financial reporting could be adversely affected or our ability to assess it adequately could be delayed.\nCurrency and Tax Risks\nWe are exposed to fluctuations in currency exchange rates that could negatively impact our financial results and cash flows.\nBecause most of our foreign sales are denominated in U.S. dollar, an increase in value of the U.S. dollar against foreign currencies will make our products more expensive than those offered by some of our foreign competitors. In addition, a weakening of the U.S. dollar against other currencies could make our costs in non-U.S. locations more expensive to fund. Our ability to compete overseas may therefore be materially and adversely affected by the fluctuations of the U.S. dollar against other currencies.\nBecause nearly all of our business is conducted outside the U.S., we face exposure to adverse movements in foreign currency exchange rates which could have a material adverse impact on our financial results and cash flows. Historically, our primary exposures have related to net working capital exposures denominated in currencies other than the foreign subsidiaries functional currency, and remeasurement of our foreign subsidiaries net monetary assets from the subsidiaries local currency into the subsidiaries functional currency. In general, an increase in the value of the U.S. dollar could require certain of our foreign subsidiaries to record translation and remeasurement gains. Conversely, a decrease in the value of the U.S. dollar could require certain of our foreign subsidiaries to record losses on translation and remeasurement. An increase in the value of the U.S. dollar could increase the cost to our customers of our products in those markets outside the U.S. where we sell in U.S. dollars, and a weakened U.S. dollar could increase the cost of local operating expenses and procurement of raw materials, both of which could have an adverse effect on our cash flows. Our primary exposures include the Singapore Dollar, Chinese Yuan, Japanese Yen, Swiss Franc, Philippine Peso, Thai Baht, Taiwan Dollar, South Korean Won, Israeli Shekel, Malaysian Ringgit and Euro. Although we from time to time have entered into foreign exchange forward contracts to hedge certain foreign currency exposure of our operating expenses, our attempts to hedge against these risks may not be successful and may result in a material adverse impact on our financial results and cash flows.\nChanges to our existing tax incentive in Singapore may materially reduce our reported results of operations in future periods.\nOur existing tax incentive, scheduled to expire in our fiscal 2025, allows certain classes of income to be subject to reduced income tax rates in Singapore provided we meet certain employment and investment conditions. If we cannot, or elect not to, comply with these conditions, we could be required to refund material tax benefits previously realized with respect to this tax incentive. Subsequent renewals are at the discretion of the Singapore government and we may not be able to extend the tax incentive arrangement beyond its expiration date or we may also elect not to renew this tax incentive arrangement. In the absence of the tax incentive, the income tax rate in Singapore that would otherwise apply is 17%, which would result in a significant increase in our provision for (benefit from) income taxes in future periods.\nChanges in tax legislation could adversely impact our future profitability.\nWe are subject to income taxes in the U.S. and many foreign jurisdictions. Tax laws and regulations are continuously evolving with corporate tax reform, base-erosion efforts, global minimum tax, and increased transparency continuing to be high priorities in many tax jurisdictions in which we operate. Although the timing and methods of implementation may vary, many countries, including those in the Asia/Pacific region in which we have significant operations, have implemented, or are in the process of implementing, legislation or practices inspired by the base erosion and profit shifting project undertaken by the Organization for Economic Co-operation and Development (OECD). Unless repealed or otherwise modified, beginning in our fiscal 2023, the U.S. Tax Cuts and Jobs Act of 2017 (TCJA) enactment of IRC Section 174 will require the capitalization and amortization of R&D expenditures which will increase our effective tax rate and reduce our operating cash flows. Further, the increased scrutiny on international tax and continuous changes to countries tax legislation may also affect the policies and decisions of tax authorities with respect to certain income tax and transfer pricing positions taken by the Company in prior or future periods. We continue to monitor new tax legislation or other developments since significant changes in tax legislation, or in the interpretation of existing legislation, could materially and adversely affect our financial condition and operating results.\nOther changes in taxation could materially impact our future effective tax rate.\nAdditionally, our future effective tax rate could be affected by numerous other factors including higher or lower than anticipated foreign earnings in various jurisdictions where we are subjected to tax rates that differ from the U.S. federal statutory tax rate, by changes in the valuation allowances recorded against certain deferred tax balances, or by changes in accounting principles and reporting requirements, or interpretations and application thereof. Changes in our assertion for foreign earnings permanently or non-permanently reinvested as a result of changes in facts and circumstances and challenges by tax authorities to our historic or future tax positions and transfer pricing policies could also significantly adversely impact our future effective tax rate.\nRisks Related to Our Shares and Corporate Law\nWe have the ability to issue additional equity securities, which would lead to dilution of our issued and outstanding common shares.\nWe may from time to time issue additional equity securities or securities convertible into equity securities, which would result in dilution of our existing shareholders equity interests in us. Our board of directors has the authority to issue, without vote or action of shareholders, preferred shares in one or more series, and has the ability to fix the rights, preferences, privileges and restrictions of any such series. Any such series of preferred shares could contain dividend rights, conversion rights, voting rights, terms of redemption, redemption prices, liquidation preferences or other rights superior to the rights of holders of our common shares. In addition, we are authorized to issue, without shareholder approval, up to an aggregate of 200 million common shares, of which approximately 57.1 million shares were outstanding as of October 1, 2022. We are also authorized to issue, without shareholder approval (except as required by the rules of the Nasdaq stock market), securities convertible into either common shares or preferred shares. We may issue such shares in connection with financing transactions, joint ventures, mergers and acquisitions or other purposes. In addition, our shareholders will experience additional dilution when performance or restricted share units vest and settle, when we issue equity awards to our employees under our equity incentive plans, or when we otherwise issue additional equity.\nAnti-takeover provisions in our articles of incorporation and bylaws and under Pennsylvania law may discourage other companies from attempting to acquire us.\nSome provisions of our articles of incorporation and bylaws as well as Pennsylvania law may discourage some transactions where we would otherwise experience a fundamental change. For example, our articles of incorporation and bylaws contain provisions that:\nclassify our board of directors into four classes, with one class being elected each year;\npermit our board to issue blank check preferred shares without shareholder approval; and\nprohibit us from engaging in some types of business combinations with a holder of 20% or more of our voting securities without super-majority board or shareholder approval.\nFurther, under the Pennsylvania Business Corporation Law, because our shareholders approved bylaw provisions that provide for a classified board of directors, shareholders may remove directors only for cause. These provisions and some other provisions of the Pennsylvania Business Corporation Law could delay, defer or prevent us from experiencing a fundamental change and may adversely affect our common shareholders' voting and other rights. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. Item 2. PROPERTIES\nThe following table reflects our major facilities as of October 1, 2022:\nCountry Facility (1) Approximate Size Function Business Segment\nSingapore Serangoon 221,000 sq. ft. Corporate headquarters, manufacturing, technology, sales and service center Capital Equipment\nKranji 148,000 sq. ft. Manufacturing center Capital Equipment\nChina Suzhou 155,000 sq. ft. Manufacturing, technology and shared support services center APS\nThe Netherlands Eindhoven 116,000 sq. ft. Manufacturing, technology, sales and service center Capital Equipment\nUnited States Fort Washington, Pennsylvania 88,000 sq. ft. Corporate headquarters, technology, sales and service center Capital Equipment\nSanta Ana, California 65,000 sq. ft. Technology, sales and service center Capital Equipment\nHorsham, Pennsylvania 28,000 sq. ft. Technology center Capital Equipment\nIsrael Haifa 31,000 sq. ft. Manufacturing and technology center APS\n(1)Each of the facilities listed in this table is leased other than the facilities in Suzhou, China and Fort Washington, Pennsylvania.\nIn addition, the Company rents space for sales support, customer support, services and administrative functions in China, Germany, Japan, Malaysia, South Korea, Switzerland, Taiwan, Thailand, Vietnam and the Philippines. The Company believes the facilities are generally in good condition and suitable to the extent of utilization needed. Item 3. LEGAL PROCEEDINGS\nFrom time to time, we may be a plaintiff or defendant in legal proceedings and claims arising out of our business. We are party to ordinary, routine litigation incidental to our business. We cannot be assured of the results of any pending or future litigation, but we do not believe resolution of any currently pending matters will materially or adversely affect our business, financial condition or operating results. Item 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II Item 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is traded on The Nasdaq Global Market (Nasdaq) under the symbol KLIC. On November 14, 2022, there were approximately 150 holders of record of the shares of outstanding common stock.\nOn August 30, 2022, June 8, 2022, March 3, 2022 and October 18, 2021, the Board of Directors declared a quarterly dividend $0.17 per share of common stock. During the fiscal year ended October 1, 2022, the Company declared dividends of $0.68 per share of common stock. The declaration of any future cash dividend is at the discretion of the Board of Directors, subject to applicable laws, and will depend on the Companys financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination that such dividends are in the best interests of the Companys stockholders.\nFor the purpose of calculating the aggregate market value of shares of our common stock held by non-affiliates, as shown on the cover page of this report, we have assumed all of our outstanding shares were held by non-affiliates except for shares held by our directors and executive officers. However, this does not necessarily mean that all directors and executive officers of the Company are, in fact, affiliates of the Company, or there are no other persons who may be deemed to be affiliates of the Company. Further information concerning the beneficial ownership of our executive officers, directors and principal shareholders will be included in our Proxy Statement for the 2023 Annual Meeting of Shareholders to be filed with the Securities and Exchange Commission.\nRecent Sales of Unregistered Securities and Use of Proceeds\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nThe following table summarizes the repurchases of common stock during the three months ended October 1, 2022 (in thousands, except per share amounts):\nPeriod Total Number of Shares Purchased Average Price Paid Per Share Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs Approximate Dollar Value of Shares That May Yet Be Purchased Under the Plans or Programs (1)\nJuly 3, 2022 to July 30, 2022 419 $ 44.92 419 $ 290,519\nJuly 31, 2022 to September 3, 2022 522 $ 46.49 522 $ 266,236\nSeptember 4, 2022 to October 1, 2022 418 $ 40.82 418 $ 249,156\nFor the three months ended October 1, 2022 1,359 1,359\n(1)On August 15, 2017, the Companys Board of Directors authorized a program (the Program) to repurchase up to $100 million in total of the Companys common stock on or before August 1, 2020. In 2018, 2019 and 2020, the Board of Directors increased the share repurchase authorization under the Program to $200 million, $300 million and $400 million respectively. On May 3, 2022, the Board of Directors increased the share repurchase authorization under the Program by an additional $400 million to $800 million, and extended its duration through August 1, 2025. The Company may purchase shares of its common stock through open market and privately negotiated transactions at prices deemed appropriate by management. The Company has entered into a written trading plan under Rule 10b5-1 of the Exchange Act to facilitate repurchases under the Program. The Program may be suspended or discontinued at any time and will be funded using the Companys available cash, cash equivalents and short-term investments. The timing and amount of repurchase transactions under the Program depend on market conditions as well as corporate and regulatory considerations. Item 6. [Reserved]\nNot applicable. Item 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn addition to historical information, this filing contains statements relating to future events or our future results. These statements are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended (the Securities Act) and Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act), and are subject to the safe harbor provisions created by statute. Such forward-looking statements include, but are not limited to, statements with respect to our future revenue increasing, continuing or strengthening, or decreasing or weakening; our capital allocation strategies, including any share repurchases; demand for our products, including replacement demand; our research and development efforts; our ability to identify and realize new growth opportunities; our ability to control costs; and our operational flexibility as a result of (among other factors):\nour expectations regarding the potential impacts on our business of the novel coronavirus (COVID-19) pandemic, including supply chain disruptions, the economic and public health effects, and governmental and other responses to these impacts;\nour expectations regarding the potential impacts on our business of actual or potential inflationary pressures, interest rate and risk premium adjustments, falling consumer sentiment, or economic recession caused, directly or indirectly, by the prolonged Ukraine/Russia conflict, the COVID-19 pandemic, geopolitical tensions, catastrophic events including as a result of climate change and other macroeconomic factors;\nour expectations regarding our effective tax rate and our unrecognized tax benefit;\nour ability to operate our business in accordance with our business plan;\nrisks inherent in doing business on an international level, including currency risks, regulatory requirements, political risks, export restrictions and other trade barriers;\nprojected growth rates in the overall semiconductor industry, the semiconductor assembly equipment market, and the market for semiconductor packaging materials; and\nprojected demand for our products and services.\nGenerally, words such as may, will, should, could, anticipate, expect, intend, estimate, plan, continue, goal and believe, or the negative of or other variations on these and other similar expressions identify forward-looking statements. These forward-looking statements are made only as of the date of this filing. We do not undertake to update or revise the forward-looking statements, whether as a result of new information, future events or otherwise.\nForward-looking statements are based on current expectations and involve risks and uncertainties. Our future results could differ significantly from those expressed or implied by our forward-looking statements. These risks and uncertainties include, without limitation, those described below and under the heading Risk Factors in this Annual Report on Form 10-K and our other reports and registration statements filed from time to time with the Securities and Exchange Commission. This discussion should be read in conjunction with our audited financial statements included in this Annual Report.\nWe operate in a rapidly changing and competitive environment. New risks emerge from time to time and it is not possible for us to predict all risks that may affect us. Future events and actual results, performance and achievements could differ materially from those set forth in, contemplated by or underlying the forward-looking statements, which speak only as of the date on which they were made. Except as required by law, we assume no obligation to update or revise any forward-looking statement to reflect actual results or changes in, or additions to, the factors affecting such forward-looking statements. Given those risks and uncertainties, investors should not place undue reliance on forward-looking statements as predictions of actual results.\nThis section of this Form 10-K generally discusses fiscal 2022 and 2021 items and year-to-year comparisons between fiscal 2022 and 2021. Discussions of fiscal 2020 items and year-to-year comparisons between fiscal 2021 and 2020 that are not included in this Form 10-K can be found in Managements Discussion and Analysis of Financial Condition and Results of Operations in Part II, Item 7 of the Companys Annual Report on Form 10-K for the fiscal year ended October 2, 2021, which was filed with the SEC on November 18, 2021.\nOur Management's Discussion and Analysis (MD&A) is provided in addition to the accompanying consolidated financial statements and notes to assist readers in understanding our results of operations, financial condition, and cash flows. The MD&A is organized as follows:\nOverview: Introduction of our operations, key events, business environment, technology leadership, products and services\nCritical Accounting Policies and Estimates\nRecent Accounting Pronouncements\nResults of Operations\nLiquidity and Capital Resources\nOther Obligations and Contingent Payments\nOverview\nFor an overview of our business, see Part I - Item 1. - Business.\nCritical Accounting Policies and Estimates\nThe preparation of consolidated financial statements requires us to make assumptions, estimates and judgments that affect the reported amounts of assets and liabilities, net revenue and expenses during the reporting periods, and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements. On an ongoing basis, we evaluate estimates, including, but not limited to, those related to accounts receivable, reserves for excess and obsolete inventory, carrying value and lives of fixed assets, goodwill and intangible assets, income taxes, equity-based compensation expense and warranties. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable. As a result, we make judgments regarding the carrying values of our assets and liabilities that are not readily apparent from other sources. Authoritative pronouncements, historical experience and assumptions are used as the basis for making estimates, and on an ongoing basis, we evaluate these estimates. Actual results may differ from these estimates.\nWe believe the following critical accounting policies, which have been reviewed with the Audit Committee of our Board of Directors, reflect our more significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenue Recognition\nIn accordance with ASC No. 606, Revenue from Contracts with Customers, the Company recognizes revenue when we satisfy performance obligations as evidenced by the transfer of control of our products or services to customers. In general, the Company generates revenue from product sales, either directly to customers or to distributors. In determining whether a contract exists, we evaluate the terms of the agreement, the relationship with the customer or distributor and their ability to pay.\nThe Company recognizes revenue from sales of our products, including sales to our distributors, at a point in time, generally upon shipment or delivery to the customer or distributor, depending upon the terms of the sales order. Control is considered transferred when title and risk of loss pass, when the customer becomes obligated to pay and, where applicable, when the customer has accepted the products or upon expiration of the acceptance period. For sales to distributors, payment is due on our standard commercial terms and is not contingent upon resale of the products.\nOur business is subject to contingencies related to customer orders, including:\nRight of Return: A large portion of our revenue comes from the sale of equipment used in the semiconductor assembly process. Other product sales relate to consumable products, which are sold in high-volume quantities, and are generally maintained at low stock levels at the customers facility. Customer returns have historically represented a very small percentage of customer sales on an annual basis.\nWarranties: Our equipment is generally shipped with a one-year warranty against manufacturing defects. We establish reserves for estimated warranty expense when revenue for the related equipment is recognized. The reserve for estimated warranty expense is based upon historical experience and managements estimate of future expenses, including product parts replacement, freight charges and labor costs expected to be incurred to correct product failures during the warranty period.\nConditions of Acceptance: Sales of our consumable products generally do not have customer acceptance terms. In certain cases, sales of our equipment have customer acceptance clauses which may require the equipment to perform in accordance with customer specifications or when installed at the customers facility. In such cases, if the terms of acceptance are satisfied at our facility prior to shipment, the revenue for the equipment will be recognized upon shipment. If the terms of acceptance are satisfied at our customers facilities, the revenue for the equipment will not be recognized until acceptance, which is typically obtained after installation and testing, is received from the customer.\nService revenue is generally recognized over time as the services are performed.\nThe Company measures revenue based on the amount of consideration we expect to be entitled to in exchange for products or services. Any variable consideration such as sales incentives are recognized as a reduction of net revenue at the time of revenue recognition.\nThe length of time between invoicing and payment is not significant under our payment terms. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. Shipping and handling costs billed to customers are recognized in net revenue.\nShipping and handling costs paid by the Company are included in cost of sales.\nAllowance for Doubtful Accounts\nWe maintain allowances for doubtful accounts for estimated losses resulting from our customers failure to make required payments. If the financial condition of our customers were to deteriorate, resulting in an impairment of their ability to make payments, additional allowances may be required. We are subject to concentrations of customers and sales to a few geographic locations, which could also impact the collectability of certain receivables. If global or regional economic conditions deteriorate or political conditions were to change in some of the countries where we do business, it could have a significant impact on our results of operations, and our ability to realize the full value of our accounts receivable.\nInventories\nInventories are stated at the lower of cost (on a first-in, first-out basis) or net realizable value. We generally provide reserves for obsolete inventory and for inventory considered to be in excess of demand. Demand is generally defined as 18 months forecasted future consumption for equipment, 24 months forecasted future consumption for spare parts, and 12 months forecasted future consumption for tools. Forecasted consumption is based upon internal projections, historical sales volumes, customer order activity and a review of consumable inventory levels at customers facilities. We communicate forecasts of our future consumption to our suppliers and adjust commitments to those suppliers accordingly. If required, we reserve the difference between the carrying value of our inventory and the lower of cost or net realizable value, based upon projections about future consumption, and market conditions. If actual market conditions are less favorable than projections, additional inventory reserves may be required.\nInventory reserve provision for certain subsidiaries is determined based on managements estimate of future consumption for equipment and spare parts. This estimate is based on historical sales volumes, internal projections and market developments and trends.\nAccounting for Impairment of Goodwill\nASC No. 350, Intangibles-Goodwill and Other requires goodwill and other intangible assets with indefinite lives to be reviewed for impairment annually, or more frequently if circumstances indicate a possible impairment. We assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If, after assessing the qualitative factors, a company determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying value, then performing the impairment test is unnecessary. However, if a company concludes otherwise, then it is required to perform the goodwill impairment test. The Companys impairment test is performed by comparing the fair value of a reporting unit with its carrying value, and determining if the carrying amount exceeds its fair value.\nAs part of the annual evaluation, the Company performs an impairment test of its goodwill in the fourth quarter of each fiscal year to coincide with the completion of its annual forecasting and refreshing of its business outlook processes. On an ongoing basis, the Company monitors if a triggering event has occurred that may have the effect of reducing the fair value of a reporting unit below its respective carrying value. Adverse changes in expected operating results and/or unfavorable changes in other economic factors used to estimate fair values could result in a non-cash impairment charge in the future.\nImpairment assessments inherently involve judgment as to the assumptions made about the expected future cash flows and the impact of market conditions on those assumptions. Future events and changing market conditions may impact the assumptions as to prices, costs, growth rates or other factors that may result in changes in the estimates of future cash flows. Although the Company believes the assumptions that it has used in testing for impairment are reasonable, significant changes in any one of the assumptions could produce a significantly different result. Indicators of potential impairment, including significant and unforeseen customer losses, a significant adverse change in legal factors or in the business climate, a significant adverse action or assessment by a regulator, a significant stock price decline or unanticipated competition, may lead the Company to perform interim goodwill impairment assessments.\nFor further information on goodwill and other intangible assets, see Note 4 to our consolidated financial statements in Item 8.\nIncome Taxes\nIn accordance with ASC No. 740, Income Taxes, deferred income taxes are determined using the balance sheet method. The Company records a valuation allowance to reduce its deferred tax assets to the amount expected, on a more likely than not basis, to be realized. While the Company has considered future taxable income and ongoing tax planning strategies in assessing the need for the valuation allowance, if it were to determine that it would be able to realize its deferred tax assets in the future in excess of its net recorded amount, an adjustment to deferred tax assets would increase income in the period when such determination is made. Likewise, should the Company determine that it would not be able to realize all or part of its deferred tax assets in the future, an adjustment to deferred tax assets would decrease income in the period when such determination is made.\nThe Company determines the amount of unrecognized tax benefit with respect to uncertain tax positions taken or expected to be taken on its income tax returns in accordance with ASC No. 740 Topic 10, Income Taxes, General (ASC 740.10). Under ASC 740.10, the Company utilizes a two-step approach for evaluating uncertain tax positions. Step one, or recognition, requires a company to determine if the weight of available evidence indicates a tax position is more likely than not to be sustained upon examination solely based on its technical merit. Step two, or measurement, is based on the largest amount of benefit, which is more likely than not to be realized on settlement with the taxing authority, including resolution of related appeals or litigation processes, if any.\nEquity-Based Compensation\nThe Company accounts for equity-based compensation under the provisions of ASC No. 718, Compensation - Stock Compensation (ASC 718). ASC 718 requires the recognition of the fair value of the equity-based compensation in net income. Compensation expense associated with Relative TSR Performance Share Units is determined using a Monte-Carlo valuation model, and compensation expense associated with time-based and Growth Performance Share Units is determined based on the number of shares granted and the fair value on the date of grant. See Note 11 to our consolidated financial statements in Item 8 for a summary of the terms of these performance-based awards. The fair value of equity-based awards is amortized over the vesting period of the award and the Company elected to use the straight-line method for awards granted after the adoption of ASC 718.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 1 to our consolidated financial statements in Item 8 for a description of certain recent accounting pronouncements, including the expected dates of adoption and effects on our consolidated results of operations and financial condition.\nRESULTS OF OPERATIONS\nResults of Operations for fiscal 2022 and 2021\nThe following table reflects our income from operations for fiscal 2022 and 2021:\nFiscal\n(dollar amounts in thousands) 2022 2021 $ Change % Change\nNet revenue $ 1,503,620 $ 1,517,664 $ (14,044) (0.9) %\nCost of sales 755,300 820,678 (65,378) (8.0) %\nGross profit 748,320 696,986 51,334 7.4 %\nSelling, general and administrative 141,396 147,061 (5,665) (3.9) %\nResearch and development 136,852 137,478 (626) (0.5) %\nOperating expenses 278,248 284,539 (6,291) (2.2) %\nIncome from operations $ 470,072 $ 412,447 $ 57,625 14.0 %\nBookings and Backlog\nOur backlog consists of customer orders scheduled for shipment within the next twelve months. A booking is recorded when a customer order is reviewed and it is determined that all specifications can be met, production (or service) can be scheduled, a delivery date can be set, and the customer meets our credit requirements. We use bookings to evaluate the results of our operations, generate future operating plans and assess the performance of our Company. While we believe that this measure is useful in evaluating our business, this information should be considered as supplemental in nature and is not meant as a substitute for revenue recognized in accordance with GAAP. In addition, other companies, including companies in our industry, may calculate bookings differently or not at all, which reduces its usefulness as a comparative measure. Reconciliation of bookings to net revenue is not practicable. A majority of our orders are subject to cancellation or deferral by our customers with limited or no penalties. Also, customer demand for our products can vary dramatically without prior notice. Because of the volatility of customer demand, possibility of customer changes in delivery schedules or cancellations and potential delays in product shipments, our backlog as of any particular date may not be indicative of net revenue for any succeeding period.\nThe following tables reflect our bookings and backlog for fiscal 2022 and 2021:\nFiscal\n(in thousands) 2022 2021\nBookings $ 1,226,524 $ 2,176,981\nAs of\n(in thousands) October 1, 2022 October 2, 2021\nBacklog $ 510,145 $ 787,241\nThe semiconductor industry is volatile and our operating results are adversely impacted by volatile worldwide economic conditions. Though the semiconductor industrys cycle can be independent of the general economy, global economic conditions may have a direct impact on demand for semiconductor units and ultimately demand for semiconductor capital equipment and expendable tools. Accordingly, our business and financial performance is impacted, both positively and negatively, by fluctuations in the macroeconomic environment. Our visibility into future demand is generally limited and forecasting is difficult. There can be no assurances regarding levels of demand for our products and we believe historical industry-wide volatility will persist.\nThe U.S. and several other countries have levied tariffs on certain goods. In particular, trade tensions between the U.S. and China have been escalating since 2018, with U.S. tariffs on Chinese goods and retaliatory Chinese tariffs on U.S. goods. These have resulted in uncertainties in the semiconductor, LED, memory and automotive markets. While the Company anticipates long-term growth in semiconductor consumption, we observed trade-related adverse impacts in demand from China from the fourth quarter of fiscal 2018 through fiscal 2022, and such impacts may increase in severity in fiscal 2023 and/or beyond.\nNet Revenue\nOur net revenues for fiscal 2022 decreased as compared to our net revenues for fiscal 2021. The decrease in net revenue is primarily due to lower volume in both Capital Equipment and APS.\nThe following table reflects net revenue by business segment for fiscal 2022 and 2021:\nFiscal\n(dollar amounts in thousands) 2022 2021 $ Change % Change\nNet revenue % of total net revenue Net revenue % of total net revenue\nCapital Equipment $ 1,306,468 86.9 % $ 1,312,576 86.5 % $ (6,108) (0.5) %\nAPS 197,152 13.1 % 205,088 13.5 % (7,936) (3.9) %\nTotal net revenue $ 1,503,620 100.0 % $ 1,517,664 100.0 % $ (14,044) (0.9) %\nCapital Equipment\nFor fiscal 2022, the lower Capital Equipment net revenue as compared to fiscal 2021 was due to lower volume. The lower volume was due to a decrease in customer investments as a result of uncertainties in the overall macroeconomic environment, partially offset by favorable price variance due to product mix.\nAPS\nFor fiscal 2022, the lower APS net revenue as compared to fiscal 2021 was primarily due to lower volume in spares, services and bonding tools. The lower volume was due to a decrease in customer utilization.\nGross Profit Margin\nThe following table reflects gross profit as a percentage of net revenue by business segment for fiscal 2022 and 2021:\nFiscal\n2022 2021 Basis point\nchange\nCapital Equipment 48.2 % 44.0 % 420\nAPS 60.4 % 58.2 % 220\nTotal gross margin 49.8 % 45.9 % 390\nCapital Equipment\nFor fiscal 2022, the higher Capital Equipment gross profit margin as compared to fiscal 2021 was primarily driven by favorable price variance due to product mix.\nAPS\nFor fiscal 2022, the higher APS gross profit margin as compared to fiscal 2021 was primarily driven by favorable product mix in spares and services offset by less favorable price variance in bonding tools.\nOperating Expenses\nThe following table reflects operating expenses for fiscal 2022 and 2021:\nFiscal\n(dollar amounts in thousands) 2022 2021 $ Change % Change\nSelling, general and administrative $ 141,396 $ 147,061 $ (5,665) (3.9) %\nResearch and development 136,852 137,478 $ (626) (0.5) %\nTotal $ 278,248 $ 284,539 $ (6,291) (2.2) %\nSelling, General and Administrative (SG&A)\nFor fiscal 2022, the lower SG&A expenses as compared to fiscal 2021 was primarily due to $7.1 million net favorable variance in foreign exchange. This was partially offset by a $2.0 million COVID-19 related grant received from the Singapore government in the prior year period.\nResearch and Development (R&D)\nFor fiscal 2022, the lower R&D expenses as compared to fiscal 2021 was primarily due to lower staff costs related to incentive compensation. This is partially offset by higher spending on prototype materials.\nIncome from Operations\nFor fiscal 2022, total income from operations was higher as compared to fiscal 2021. This was primarily due to higher gross profit and lower operating expenses in fiscal 2022.\nThe following tables reflect income from operations by business segment for fiscal 2022 and 2021:\nFiscal\n(dollar amounts in thousands) 2022 2021 $ Change % Change\nCapital Equipment $ 397,920 $ 355,982 $ 41,938 11.8 %\nAPS 72,152 56,465 15,687 27.8 %\nTotal income from operations $ 470,072 $ 412,447 $ 57,625 14.0 %\nCapital Equipment\nFor fiscal 2022, the higher Capital Equipment income from operations as compared to fiscal 2021 was primarily due to a higher gross profit as explained under Gross Profit Margin above.\nAPS\nFor fiscal 2022, the higher APS income from operations as compared to fiscal 2021 was primarily due to lower operating expenses as explained under Operating Expenses above.\nInterest Income and Expense\nThe following table reflects interest income and interest expense for fiscal 2022 and 2021:\nFiscal\n(dollar amounts in thousands) 2022 2021 $ Change % Change\nInterest income $ 7,124 $ 2,321 $ 4,803 206.9 %\nInterest expense $ (208) $ (218) $ 10 (4.6) %\nInterest income\nFor fiscal 2022, the higher interest income as compared to fiscal 2021 was primarily due to higher weighted average interest rates on cash, cash equivalents and short-term investments.\nInterest expense\nFor fiscal 2022, the lower interest expense as compared to fiscal 2021 was primarily due to lower levels of average short-term debt outstanding. Please refer to Note 10: Debt and Other Obligations to our consolidated financial statements in Item 8 for a discussion of the Overdraft Facility.\nProvision for Income Taxes\nThe following table reflects the provision for income taxes and the effective tax rate for fiscal 2022 and 2021:\nFiscal\n(dollar amounts in thousands) 2022 2021 Change\nProvision for income taxes $ 43,443 $ 47,295 $ (3,852)\nEffective tax rate 9.1 % 11.4 % (2.3) %\nFor fiscal 2022, the lower effective tax rate as compared to fiscal 2021 is primarily due to tax benefits from foreign exchange losses and increase in tax credits generated during the fiscal year.\nPlease refer to Note 15: Income Taxes to our consolidated financial statements in Item 8.\nLIQUIDITY AND CAPITAL RESOURCES\nThe following table reflects total cash, cash equivalents and short-term investments as of October 1, 2022 and October 2, 2021:\nAs of\n(dollar amounts in thousands) October 1, 2022 October 2, 2021 Change\nCash and cash equivalents $ 555,537 $ 362,788 $ 192,749\nShort-term investments 220,000 377,000 (157,000)\nTotal cash, cash equivalents, and short-term investments $ 775,537 $ 739,788 $ 35,749\nPercentage of total assets 48.8 % 46.2 %\nThe following table reflects summary Consolidated Statements of Cash Flows information for fiscal 2022 and 2021:\nFiscal\n(in thousands) 2022 2021\nNet cash provided by operating activities $ 390,188 $ 300,032\nNet cash provided by / (used in) investing activities 133,799 (81,707)\nNet cash used in financing activities (321,191) (44,258)\nEffect of exchange rate changes on cash and cash equivalents (10,047) 594\nChanges in cash, and cash equivalents $ 192,749 $ 174,661\nCash and cash equivalents, beginning of period 362,788 188,127\nCash and cash equivalents, end of period $ 555,537 $ 362,788\nFiscal 2022\nNet cash provided by operating activities consisted of net income of $433.5 million, non-cash adjustments of $22.6 million and a net unfavorable change in operating assets and liabilities of $65.9 million. The net change in operating assets and liabilities was primarily driven by a decrease in accounts payable and accrued expenses and other current liabilities of $128.7 million, and an increase in prepaid expenses and other current assets of $37.9 million and inventories of $14.9 million. This was partially offset by a decrease in accounts and notes receivable of $113.3 million and income tax payable of $4.9 million.\nThe decrease in accounts payable and accrued expenses and other current liabilities was primarily due to lower purchases in the fourth quarter of fiscal 2022, lower accrued employee compensation, accrued customer obligations and accrued commissions. The increase in prepaid expenses and other current assets was mainly due to the addition of contract assets in fiscal 2022. The increase in inventories was due to increased manufacturing activities to meet higher demand in the first half of fiscal 2022 followed by slower utilization due to lower demand in the second half of fiscal 2022. The decrease in accounts and notes receivable was due to lower sales in the fourth quarter of fiscal 2022 and a change in customer mix of different credit terms.\nThe net cash provided by investing activities was primarily due to net maturity of short-term investments of $157.0 million, partially offset by capital expenditures of $23.0 million.\nThe net cash used in financing activities was primarily due to common stock repurchases of $281.3 million and dividend payments of $39.4 million.\nFiscal 2021\nNet cash provided by operating activities consisted of net income of $367.2 million, non-cash adjustments of $21.2 million and a net unfavorable change in operating assets and liabilities of $88.3 million. The net change in operating assets and liabilities was primarily driven by an increase in accounts and notes receivable of $221.9 million, inventories of $52.7 million, and prepaid expenses and other current assets of $4.6 million. This was partially offset by an increase in accounts payable and accrued expenses and other current liabilities of $182.0 million, and income tax payable of $7.7 million.\nThe increase in accounts payable and accrued expenses and other current liabilities was primarily due to higher purchases due to higher manufacturing activities. The increase in inventories was due to increased manufacturing activities in fiscal 2021 in response to increased sales. The increase in accounts receivable was due to higher sales.\nThe net cash used in investing activities was primarily due to net purchases of short-term investments of $35.0 million, the Uniqarta acquisition of $26.3 million, and capital expenditures of $22.8 million, partially offset by proceeds from the sale of an equity-method investment of $2.1 million.\nThe net cash used in financing activities was primarily due to dividend payments of $33.5 million, and common stock repurchases of $10.4 million.\nFiscal 2023 Liquidity and Capital Resource Outlook\nWe expect our fiscal 2023 capital expenditures to be between $70.0 million and $74.0 million. The actual amounts for fiscal 2023 will vary depending on market conditions. Expenditures are anticipated to be primarily used for research and development projects, enhancements to our manufacturing operations, improvements to our information technology security, implementation of an enterprise resource planning system and leasehold improvements for our facilities. Our ability to make these expenditures will depend, in part, on our future cash flows, which are determined by our future operating performance and, therefore, subject to prevailing macroeconomic conditions, including the impact from the COVID-19 pandemic, inflationary pressures, geopolitical tensions including the prolonged Ukraine/Russia conflict and other factors, some of which are beyond our control.\nAs of October 1, 2022 and October 2, 2021, approximately $499.8 million and $724.5 million of cash, cash equivalents, and short-term investments were held by the Companys foreign subsidiaries, respectively, with a large portion of the cash amounts expected to be available for use in the U.S. without incurring additional U.S. income tax. The decrease is primarily due to the repatriation of cash held by the Companys foreign subsidiaries to the U.S.\nThe Companys international operations and capital requirements are funded primarily by cash generated by foreign operating activities and cash held by foreign subsidiaries. In fiscal 2022, the Companys U.S. operations and capital requirements have been funded primarily by cash generated from U.S. operating activities, cash held by U.S. entities, and cash previously held by foreign subsidiaries that was repatriated to the U.S. entities during the fiscal year. In the future, the Company may repatriate additional cash held by foreign subsidiaries that has already been subject to U.S. income tax or drawdown cash from our existing Facility Agreements. We believe these sources of cash and liquidity are sufficient to meet our additional liquidity needs for the foreseeable future including repayment of outstanding balances under the Facility Agreements, as well as payment of dividends, share repurchases and income taxes. Should the Companys U.S. cash needs exceed its funds generated by U.S. and foreign operations due to changing business conditions or transactions outside the ordinary course, such as acquisitions of large capital assets, businesses or any other capital appropriation in the U.S., the Company may require additional financing in the U.S. In this event, the Company could seek U.S. borrowing alternatives.\nWe believe that our existing cash, cash equivalents, short-term investments, existing Facility Agreements, and anticipated cash flows from operations will be sufficient to meet our liquidity and capital requirements, notwithstanding the COVID-19 pandemic and macroeconomic headwinds, for the next twelve months and beyond. Our liquidity is affected by many factors, some based on normal operations of our business and others related to macroeconomic conditions including inflationary pressures, industry-related uncertainties, effects arising from the prolonged Ukraine/Russia conflict, which we cannot predict. We also cannot predict economic conditions and industry downturns or the timing, strength or duration of recoveries. We intend to continue to use our cash for working capital needs and for general corporate purposes.\nIn this unprecedented environment, as a result of the COVID-19 pandemic, the prolonged Ukraine/Russia conflict or for other reasons, we may seek, as we believe appropriate, additional debt or equity financing which would provide capital for corporate purposes, working capital funding, additional liquidity needs or to fund future growth opportunities, including possible acquisitions. The timing and amount of potential capital requirements cannot be determined at this time and will depend on a number of factors, including our actual and projected demand for our products, semiconductor and semiconductor capital equipment industry conditions, competitive factors, the condition of financial markets and the global economic situation.\nShare Repurchase Program\nOn August 15, 2017, the Companys Board of Directors authorized a program (the Program) to repurchase up to $100 million of the Companys common stock on or before August 1, 2020. In 2018, 2019 and 2020, the Board of Directors increased the share repurchase authorization under the Program to $200 million, $300 million and $400 million, respectively. On March 3, 2022, the Board of Directors increased the share repurchase authorization under the Program by an additional $400 million to $800 million, and extended its duration through August 1, 2025. The Company has entered into a written trading plan under Rule 10b5-1 of the Exchange Act to facilitate repurchases under the Program. The Program may be suspended or discontinued at any time and is funded using the Companys available cash, cash equivalents and short-term investments. Under the Program, shares may be repurchased through open market and/or privately negotiated transactions at prices deemed appropriate by management. The timing and amount of repurchase transactions under the Program depend on market conditions as well as corporate and regulatory considerations.\nDuring the fiscal year ended October 1, 2022, the Company repurchased a total of approximately 2,782.1 thousand shares of common stock at a cost of approximately $132.8 million. The stock repurchases were recorded in the periods they were delivered and accounted for as treasury stock in the Companys Consolidated Balance Sheets. The Company records treasury stock purchases under the cost method using the first-in, first-out (FIFO) method. Upon re-issuance of treasury stock, amounts in excess of the acquisition cost are credited to additional paid-in capital. If the Company reissues treasury stock at an amount below its acquisition cost and additional paid-in capital associated with prior treasury stock transactions is insufficient to cover the difference between acquisition cost and the reissue price, this difference is recorded against retained earnings.\nAccelerated Share Repurchase (ASR)\nIn addition to the 2,782.1 thousand shares of common stock repurchased under the Program during the fiscal year ended October 1, 2022, on March 9, 2022, the Company entered into an ASR agreement (the March 2022 ASR Agreement) with an investment bank counterparty (Dealer) to repurchase $150 million of the Companys common stock. The March 2022 ASR Agreement was entered into pursuant to the Companys current $800 million share repurchase authorization.\nUnder the March 2022 ASR Agreement, the Company made an up-front payment of $150 million to the Dealer and received an initial delivery of 2,449.9 thousand shares of common stock at a cost of approximately $120 million on March 10, 2022. The final number of shares to be repurchased will be based on the volume-weighted average price of the Companys common stock during the term of the transaction, less a discount and subject to adjustments pursuant to the terms and conditions of the March 2022 ASR Agreement. For accounting purposes, the March 2022 ASR Agreement is evaluated as an unsettled forward contract indexed to the Companys own stock, with $30 million being classified within common stock. At settlement, the Dealer may be required to deliver additional shares of common stock to the Company, or, under certain circumstances, the Company may be required to deliver shares of its common stock or may elect to make a cash payment to the Dealer.\nThe March 2022 ASR Agreement was settled between the Company and the Dealer on April 22, 2022 and the Company received an additional 344.5 thousand shares of common stock from the Dealer. In total, an aggregate of 2,794.4 thousand shares of common stock were delivered by the Dealer under the March 2022 ASR Agreement at an average price of $53.68 per share, which was then reclassified as treasury stock from common stock in shareholders equity. As of October 1, 2022, our remaining stock repurchase authorization under the Program was approximately $249.2 million.\nDividends\nOn August 30, 2022, June 8, 2022, March 3, 2022 and October 18, 2021, the Board of Directors declared a quarterly dividend $0.17 per share of common stock. During the fiscal year ended October 1, 2022, the Company declared dividends of $0.68 per share of common stock. The declaration of any future cash dividend is at the discretion of the Board of Directors and will depend on the Companys financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination that such dividends are in the best interests of the Companys stockholders.\nOther Obligations and Contingent Payments\nIn accordance with U.S. generally accepted accounting principles, certain obligations and commitments as of October 1, 2022 are appropriately not included in the Consolidated Balance Sheets and Statements of Operations in this Form 10-K. However, because these obligations and commitments are entered into in the normal course of business and because they may have a material impact on our liquidity, we have disclosed them in the table below.\nAdditionally, as of October 1, 2022, the Company had deferred tax liabilities of $34.0 million and unrecognized tax benefit recorded within the income tax payable for uncertain tax positions of $16.9 million, including related accrued interest of $2.0 million. These amounts are not included in the contractual obligation table below because we are unable to reasonably estimate the timing of these payments at this time.\nThe following table presents certain payments due by the Company under contractual obligations with minimum firm commitments as of October 1, 2022:\nPayments due in\n(in thousands) Total Less than 1 year 1 - 3 years 3 - 5 years More than 5 years\nInventory purchase obligations (1)\n$ 316,123 316,123 $ - $ - $ -\nU.S. one-time transition tax payable (2)\n(reflected on our Balance Sheets)\n54,408 6,723 29,414 18,271 -\nTotal $ 370,531 $ 322,846 $ 29,414 $ 18,271 $ -\n(1)We order inventory components in the normal course of our business. A portion of these orders are non-cancellable and a portion may have varying penalties and charges in the event of cancellation.\n(2)Associated with the U.S. one-time transition tax on certain earnings and profits of our foreign subsidiaries in relation to the TCJA.\nCredit Facilities\nOn February 15, 2019, the Company entered into a Facility Letter and Overdraft Agreement (collectively, the Facility Agreements) with MUFG Bank, Ltd., Singapore Branch (the Bank). The Facility Agreements provide the Company and one of its subsidiaries with an overdraft facility of up to $150.0 million (the Overdraft Facility) for general corporate purposes. Amounts outstanding under the Overdraft Facility, including interest, are payable upon thirty days written demand by the Bank. Interest on the Overdraft Facility is calculated on a daily basis, and the applicable interest rate is calculated at the Secured Overnight Financing Rate (SOFR) plus a margin of 1.5% per annum. The Overdraft Facility is an unsecured facility per the terms of the Facility Agreements. The Facility Agreements contain customary non-financial covenants, including, without limitation, covenants that restrict the Companys ability to sell or dispose of its assets, cease owning at least 51% of two of its subsidiaries (the Subsidiaries), or encumber its assets with material security interests (including any pledge of monies in the Subsidiaries cash deposit account with the Bank). The Facility Agreements also contain customary events of default, including, without limitation, non-payment of financial obligations when due, cross defaults to other material indebtedness of the Company and any breach of a representation or warranty under the Facility Agreements. As of October 1, 2022, there were no outstanding amounts under the Overdraft Facility.\nAs of October 1, 2022, other than the bank guarantee disclosed in Note 10, we did not have any other off-balance sheet arrangements, such as contingent interests or obligations associated with variable interest entities. Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInterest Rate Risk\nOur available-for-sale securities, if applicable, may consist of short-term investments in highly rated debt instruments of the U.S. Government and its agencies, financial institutions, and corporations. We continually monitor our exposure to changes in interest rates and credit ratings of issuers with respect to any available-for-sale securities and target an average life to maturity of less than 18 months. Accordingly, we believe that the effects to us of changes in interest rates and credit ratings of issuers are limited and would not have a material impact on our financial condition or results of operations.\nForeign Currency Risk\nOur international operations are exposed to changes in foreign currency exchange rates due to transactions denominated in currencies other than the locations functional currency. Our international operations are also exposed to foreign currency fluctuations that impact the remeasurement of net monetary assets of those operations whose functional currency, the U.S. dollar, differs from their respective local currencies, most notably in Israel, Singapore and Switzerland. Our U.S. operations also have foreign currency exposure due to net monetary assets denominated in currencies other than the U.S. dollar. In addition to net monetary remeasurement, we have exposures related to the translation of subsidiary financial statements from their functional currency, the local currency, into its reporting currency, the U.S. dollar, most notably in the Netherlands, China, Taiwan, Japan and Germany.\nBased on our foreign currency exposure as of October 1, 2022, a 10.0% fluctuation could impact our financial position, results of operations or cash flows by $6.0 to $7.0 million. Our attempts to hedge against these risks may not be successful and may result in a material adverse impact on our financial results and cash flow.\nWe enter into foreign exchange forward contracts to hedge a portion of our forecasted foreign currency-denominated expenses in the normal course of business and, accordingly, they are not speculative in nature. These instruments generally mature within twelve months. We have foreign exchange forward contracts with a notional amount of $57.6 million outstanding as of October 1, 2022. Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe consolidated financial statements of Kulicke and Soffa Industries, Inc. listed in the index appearing under Item 15(a)(1) herein are filed as part of this Report under this Item 8.\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Kulicke and Soffa Industries, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Kulicke and Soffa Industries, Inc. and its subsidiaries (the Company) as of October 1, 2022 and October 2, 2021, and the related consolidated statements of operations, of comprehensive income, of changes in shareholders equity and of cash flows for each of the three years in the period ended October 1, 2022, including the related notes and schedule of valuation and qualifying accounts for each of the three years in the period ended October 1, 2022 appearing under Item 15(a)(2) (collectively referred to as the consolidated financial statements). We also have audited the Companys internal control over financial reporting as of October 1, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of October 1, 2022 and October 2, 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 1, 2022 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 1, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Companys management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nValuation of inventories - Reserves for excess and obsolete raw materials\nAs described in Notes 1 and 2 to the consolidated financial statements, the Companys consolidated net inventory balance was $185.0 million. The Company generally provides reserves for obsolete inventory and for inventory considered to be in excess of demand. Demand is generally defined as forecasted future consumption for inventories, and is based upon internal projections, historical sales volumes, customer order activity and a review of consumable inventory levels at customers facilities.\nThe principal considerations for our determination that performing procedures relating to the valuation of inventories, specifically the reserves for excess and obsolete raw materials, is a critical audit matter are our assessment that this is an area of significant judgment by management when developing reserves for excess and obsolete raw materials, including developing the assumption related to forecasted future consumption for raw materials. This has in turn led to significant auditor judgment, subjectivity, and effort in performing procedures and evaluating managements assumptions over the reasonableness of the significant assumptions related to the forecasted future consumption for raw materials.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to managements reserves for excess and obsolete raw materials, including controls over managements assumption related to forecasted future consumption for raw materials. These procedures also included, among others, testing managements process for developing the reserves for excess or obsolete raw materials; evaluating the appropriateness of managements approach; testing the completeness and accuracy of underlying data used in the approach; and evaluating the reasonableness of managements assumption related to forecasted future consumption for raw materials. Evaluating managements assumption related to forecasted future consumption for raw materials involved evaluating whether the assumption used by management was reasonable considering (i) current and past sales results, (ii) the consistency of sales with external market and industry data, and (iii) comparing prior year estimates of sales to actual sales results in the current year.\n/s/ PricewaterhouseCoopers LLP\nSingapore\nNovember 17, 2022\nWe have served as the Companys auditor since 2011.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except per share amount)\nAs of\nOctober 1, 2022 October 2, 2021\nASSETS\nCurrent assets:\nCash and cash equivalents $ 555,537 $ 362,788\nShort-term investments 220,000 377,000\nAccounts and notes receivable, net of allowance for doubtful accounts of $0 and $687, respectively\n309,323 421,193\nInventories, net 184,986 167,323\nPrepaid expenses and other current assets 62,200 23,586\nTotal current assets 1,332,046 1,351,890\nProperty, plant and equipment, net 80,908 67,982\nOperating right-of-use assets 41,767 41,592\nGoodwill 68,096 72,949\nIntangible assets, net 31,939 42,752\nDeferred tax assets 25,572 15,715\nEquity investments 5,397 6,388\nOther assets 2,874 2,363\nTOTAL ASSETS $ 1,588,599 $ 1,601,631\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable 67,311 154,636\nOperating lease liabilities 6,766 4,903\nAccrued expenses and other current liabilities 134,541 161,570\nIncome taxes payable 40,063 30,766\nTotal current liabilities 248,681 351,875\nDeferred tax liabilities 34,037 32,828\nIncome taxes payable 64,634 69,422\nOperating lease liabilities 34,927 38,084\nOther liabilities 11,670 14,185\nTOTAL LIABILITIES $ 393,949 $ 506,394\nCommitments and contingent liabilities (Note 17)\nSHAREHOLDERS' EQUITY:\nPreferred stock, without par value:\nAuthorized 5,000 shares; issued - none\n$ - $ -\nCommon stock, no par value:\nAuthorized 200,000 shares; issued 85,364 and 85,364 respectively; outstanding 57,128 and 61,931 shares, respectively\n561,684 550,117\nTreasury stock, at cost, 28,237 and 23,433 shares, respectively\n(675,800) (400,412)\nRetained earnings 1,341,666 948,554\nAccumulated other comprehensive loss (32,900) (3,022)\nTOTAL SHAREHOLDERS' EQUITY $ 1,194,650 $ 1,095,237\nTOTAL LIABILITIES AND SHAREHOLDERS' EQUITY $ 1,588,599 $ 1,601,631\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nFiscal\n2022 2021 2020\nNet revenue $ 1,503,620 $ 1,517,664 $ 623,176\nCost of sales 755,300 820,678 325,201\nGross profit 748,320 696,986 297,975\nSelling, general and administrative 141,396 147,061 116,007\nResearch and development 136,852 137,478 123,459\nOperating expenses 278,248 284,539 239,466\nIncome from operations 470,072 412,447 58,509\nInterest income 7,124 2,321 7,541\nInterest expense (208) (218) (1,716)\nIncome before income taxes 476,988 414,550 64,334\nProvision for income taxes 43,443 47,295 11,998\nShare of results of equity-method investee, net of tax - 94 36\nNet income $ 433,545 $ 367,161 $ 52,300\nNet income per share:\nBasic $ 7.21 $ 5.92 $ 0.83\nDiluted $ 7.09 $ 5.78 $ 0.83\nWeighted average shares outstanding:\nBasic 60,164 62,009 62,828\nDiluted 61,182 63,515 63,359\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in thousands)\nFiscal\n2022 2021 2020\nNet income $ 433,545 $ 367,161 $ 52,300\nOther comprehensive income / (loss):\nForeign currency translation adjustment (30,536) 672 7,755\nUnrecognized actuarial gain / (loss) on pension plan, net of tax 2,276 - (1,490)\n(28,260) 672 6,265\nDerivatives designated as hedging instruments:\nUnrealized (loss) / gain on derivative instruments, net of tax (2,694) 24 358\nReclassification adjustment for loss / (gain) on derivative instruments recognized, net of tax 1,076 (1,197) 796\nNet (decrease) / increase from derivatives designated as hedging instruments, net of tax (1,618) (1,173) 1,154\nTotal other comprehensive (loss) / income (29,878) (501) 7,419\nComprehensive income $ 403,667 $ 366,660 $ 59,719\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS' EQUITY\n(in thousands)\nCommon Stock Treasury Stock Retained earnings Accumulated Other Comprehensive (loss) / income Shareholders' Equity\nShares Amount\nBalances as of September 28, 2019 63,173 $ 533,590 $ (349,212) $ 594,625 $ (9,940) $ 769,063\nIssuance of stock for services rendered 37 491 359 - - 850\nRepurchase of common stock (2,486) - (55,001) - - (55,001)\nIssuance of shares for equity-based compensation 834 (9,037) 9,037 - - -\nEquity-based compensation - 14,169 - - - 14,169\nCumulative effect of accounting changes - - - (769) - (769)\nCash dividend declared - - - (30,037) - (30,037)\nComponents of comprehensive income:\nNet income - - - 52,300 - 52,300\nOther comprehensive income - - - - 7,419 7,419\nTotal comprehensive income - - - 52,300 7,419 59,719\nBalances as of October 3, 2020 61,558 $ 539,213 $ (394,817) $ 616,119 $ (2,521) $ 757,994\nIssuance of stock for services rendered 23 616 202 - - 818\nRepurchase of common stock (215) - (10,182) - - (10,182)\nIssuance of shares for equity-based compensation 565 (4,385) 4,385 - - -\nEquity-based compensation - 14,673 - - - 14,673\nCash dividend declared - - - (34,726) - (34,726)\nComponents of comprehensive income:\nNet income - - - 367,161 - 367,161\nOther comprehensive loss - - - - (501) (501)\nTotal comprehensive income/(loss) - - - 367,161 (501) 366,660\nBalances as of October 2, 2021 61,931 $ 550,117 $ (400,412) $ 948,554 $ (3,022) $ 1,095,237\nIssuance of stock for services rendered 18 774 175 - - 949\nRepurchase of common stock (5,576) - (282,807) - - (282,807)\nIssuance of shares for equity-based compensation 755 (7,244) 7,244 - - -\nEquity-based compensation - 18,037 - - 18,037\nCash dividend declared - - - (40,433) - (40,433)\nComponents of comprehensive income:\nNet income - - - 433,545 - 433,545\nOther comprehensive loss - - - - (29,878) (29,878)\nTotal comprehensive income / (loss) - - - 433,545 (29,878) 403,667\nBalances as of October 1, 2022 57,128 $ 561,684 $ (675,800) $ 1,341,666 $ (32,900) $ 1,194,650\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nFiscal\n2022 2021 2020\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income $ 433,545 $ 367,161 $ 52,300\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 21,293 19,810 19,739\nImpairment charges 1,346 - -\nEquity-based compensation and employee benefits 18,986 15,491 15,019\nAdjustment for doubtful accounts (245) (248) 371\nAdjustment for inventory valuation (2,613) (2,965) 4,170\nChange in the estimation of warranty reserve\n- - (5,417)\nDeferred taxes (8,648) (9,818) (827)\n(Gain) / loss on disposal of property, plant and equipment (253) 259 953\nGain on disposal of equity-method investments - (1,046) -\nUnrealized foreign currency translation (7,278) (378) 874\nShare of results of equity-method investee - 94 36\nChanges in operating assets and liabilities:\nAccounts and notes receivable 113,340 (221,924) (1,928)\nInventory (14,924) (52,719) (26,194)\nPrepaid expenses and other current assets (37,907) (4,573) (3,561)\nAccounts payable, accrued expenses and other current liabilities (128,734) 181,960 38,148\nIncome taxes payable 4,946 7,686 (291)\nOther, net (2,666) 1,242 1,020\nNet cash provided by operating activities 390,188 300,032 94,412\nCASH FLOWS FROM INVESTING ACTIVITIES:\nAcquisition of business, net of cash acquired - (26,338) -\nPurchases of property, plant and equipment (22,985) (22,775) (11,719)\nProceeds from sales of property, plant and equipment 181 291 50\nPurchase of equity investments (397) - (1,288)\nPurchase of short term investments (469,000) (507,000) (442,000)\nMaturity of short term investments 626,000 472,000 329,000\nDisposal of equity-method investments - 2,115 -\nNet cash provided by / (used in) investing activities 133,799 (81,707) (125,957)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nPayment on short term debt (54,500) (22,750) (147,143)\nPayment for finance leases (509) (379) (123)\nRepurchase of common stock (281,319) (10,426) (54,549)\nProceeds from short term debt 54,500 22,750 86,239\nCommon stock cash dividends paid (39,363) (33,453) (30,233)\nNet cash used in financing activities (321,191) (44,258) (145,809)\nEffect of exchange rate changes on cash and cash equivalents (10,047) 594 1,297\nChanges in cash and cash equivalents 192,749 174,661 (176,057)\nCash and cash equivalents at beginning of period 362,788 188,127 364,184\nCash and cash equivalents at end of period $ 555,537 $ 362,788 $ 188,127\nCASH PAID FOR:\nInterest $ 208 $ 218 $ 1,716\nIncome taxes $ 50,309 $ 51,856 $ 13,271\nThe accompanying notes are an integral part of these consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1: BASIS OF PRESENTATION\nThese consolidated financial statements include the accounts of Kulicke and Soffa Industries, Inc. and its subsidiaries (the Company), with appropriate elimination of intercompany balances and transactions.\nFiscal Year\nEach of the Companys first three fiscal quarters ends on the Saturday that is 13 weeks after the end of the immediately preceding fiscal quarter. The fourth quarter of each fiscal year ends on the Saturday closest to September 30. In fiscal years consisting of 53 weeks, the fourth quarter will consist of 14 weeks. The 2022, 2021, and 2020 fiscal years ended on October 1, 2022, October 2, 2021 and October 3, 2020, respectively.\nNature of Business\nThe Company designs, manufactures and sells capital equipment and tools as well as services, maintains, repairs and upgrades equipment, all used to assemble semiconductor devices. The Companys operating results depend upon the capital and operating expenditures of semiconductor device manufacturers, integrated device manufacturers (IDMs), outsourced semiconductor assembly and test providers (OSATs), and other electronics manufacturers, including automotive electronics suppliers, worldwide which, in turn, depend on the current and anticipated market demand for semiconductors and products utilizing semiconductors. The semiconductor industry is highly volatile and experiences downturns and slowdowns which can have a severe negative effect on the semiconductor industrys demand for semiconductor capital equipment, including assembly equipment manufactured and sold by the Company and, to a lesser extent, tools, including those sold by the Company. These downturns and slowdowns have in the past adversely affected the Companys operating results. The Company believes such volatility will continue to characterize the industry and the Companys operations in the future.\nUse of Estimates\nThe preparation of consolidated financial statements requires management to make assumptions, estimates and judgments that affect the reported amounts of assets and liabilities, net revenue and expenses during the reporting periods, and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements. On an ongoing basis, management evaluates estimates, including but not limited to, those related to accounts receivable, reserves for excess and obsolete inventory, carrying value and lives of fixed assets, goodwill and intangible assets, the valuation estimates and assessment of impairment and observable price adjustments, income taxes, equity-based compensation expense, and warranties. Management bases its estimates on historical experience and on various other assumptions believed to be reasonable. As a result, management makes judgments regarding the carrying values of the Companys assets and liabilities that are not readily apparent from other sources. Authoritative pronouncements, historical experience and assumptions are used as the basis for making estimates, and on an ongoing basis, management evaluates these estimates. Actual results may differ from these estimates.\nDue to the coronavirus (COVID-19) pandemic and macroeconomic headwinds, there has been uncertainty and disruption in the global economy and financial markets. The Company is not aware of any specific event or circumstance that would require an update to its estimates or judgments or a revision of the carrying value of its assets or liabilities as of October 1, 2022. While there was no material impact to our consolidated financial statements as of and for the year ended October 1, 2022, these estimates may change, as new events occur and additional information is obtained, as well as other factors related to COVID-19 and macroeconomic headwinds that could materially impact our consolidated financial statements in future reporting periods.\nThe Company reviews its warranty reserve balances as part of its ongoing policy review. At the start of fiscal 2020, the Company determined there was a need to obtain granular data given uncertainty in sales demand. Accordingly, the Company commenced the collection of granular data over the four fiscal quarters in 2020 to establish a more precise estimate of its warranty reserve. This collection was finalized and the information incorporated in the fourth quarter of fiscal 2020. This resulted in a decrease to the reserve for warranty and an increase in net income by $5.4 million for the fiscal year 2020, as well as an increase to net income per share, basic and diluted, by $0.09 and $0.09, respectively. For further information on warranty reserve, see Notes 14 and 17 below.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nVulnerability to Certain Concentrations\nFinancial instruments which may subject the Company to concentrations of credit risk as of October 1, 2022 and October 2, 2021 consisted primarily of trade receivables. The Company manages credit risk associated with investments by investing its excess cash in highly rated debt instruments of the U.S. government and its agencies, financial institutions, and corporations. The Company has established investment guidelines relative to diversification and maturities designed to maintain safety and liquidity. These guidelines are periodically reviewed and modified as appropriate.\nThe Companys trade receivables result primarily from the sale of semiconductor equipment, related accessories and replacement parts, and tools to a relatively small number of large manufacturers in a highly concentrated industry. Write-offs of uncollectible accounts have historically not been material. The Company actively monitors its customers financial strength to reduce the risk of loss, including as a result of COVID-19 and macroeconomic headwinds.\nThe Companys products are complex and require raw materials, components and subassemblies having a high degree of reliability, accuracy and performance. The Company relies on subcontractors to manufacture many of these components and subassemblies and it relies on sole source suppliers for some important components and raw material inventory.\nForeign Currency Translation and Remeasurement\nThe majority of the Companys business is transacted in U.S. dollars; however, the functional currencies of some of the Companys subsidiaries are their local currencies. In accordance with ASC No. 830, Foreign Currency Matters (ASC 830), for a subsidiary of the Company that has a functional currency other than the U.S. dollar, gains and losses resulting from the translation of the functional currency into U.S. dollars for financial statement presentation are not included in determining net income, but are accumulated in the cumulative translation adjustment account as a separate component of shareholders equity (accumulated other comprehensive income / (loss)). The tax effect of currency translation adjustments related to unremitted foreign earnings no longer deemed to be indefinitely reinvested outside the U.S. is reflected in the determination of the Company's net income or other comprehensive income (OCI). Gains and losses resulting from foreign currency transactions are included in the determination of net income.\nThe Companys operations are exposed to changes in foreign currency exchange rates due to transactions denominated in currencies other than the locations functional currency. The Company is also exposed to foreign currency fluctuations that impact the remeasurement of net monetary assets of those operations whose functional currency, the U.S. dollar, differs from their respective local currencies, most notably in Israel, Singapore and Switzerland. In addition to net monetary remeasurement, the Company has exposures related to the translation of subsidiary financial statements from their functional currency, the local currency, into its reporting currency, the U.S. dollar, most notably in the Netherlands, China, Taiwan, Japan and Germany. The Companys U.S. operations also have foreign currency exposure due to net monetary assets denominated in currencies other than the U.S. dollar.\nDerivative Financial Instruments\nThe Companys primary objective for holding derivative financial instruments is to manage the fluctuation in foreign exchange rates and accordingly is not speculative in nature. The Companys international operations are exposed to changes in foreign exchange rates as described above. The Company has established a program to monitor the forecasted transaction currency risk to protect against foreign exchange rate volatility. Generally, the Company uses foreign exchange forward contracts in these hedging programs. These instruments, which have maturities of up to twelve months, are recorded at fair value and are included in prepaid expenses and other current assets, or accrued expenses and other current liabilities.\nOur accounting policy for derivative financial instruments is based on whether they meet the criteria for designation as a cash flow hedge. A designated hedge with exposure to variability in the functional currency equivalent of the future foreign currency cash flows of a forecasted transaction is referred to as a cash flow hedge. The criteria for designating a derivative as a cash flow hedge include the assessment of the instruments effectiveness in risk reduction, matching of the derivative instrument to its underlying transaction, and the assessment of the probability that the underlying transaction will occur. For derivatives with cash flow hedge accounting designation, we report the after-tax gain / (loss) from the effective portion of the hedge as a component of accumulated other comprehensive income / (loss) and reclassify it into earnings in the same period in which the hedged transaction affects earnings and in the same line item on the consolidated statement of operations as the impact of the hedged transaction. Derivatives that we designate as cash flow hedges are classified in the consolidated statement of cash flows in the same section as the underlying item, primarily within cash flows from operating activities.\nThe hedge effectiveness of these derivative instruments is evaluated by comparing the cumulative change in the fair value of the hedge contract with the cumulative change in the fair value of the forecasted cash flows of the hedged item.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nIf a cash flow hedge is discontinued because it is no longer probable that the original hedged transaction will occur as previously anticipated, the cumulative unrealized gain or loss on the related derivative is reclassified from accumulated other comprehensive income / (loss) into earnings. Subsequent gain / (loss) on the related derivative instrument is recognized into earnings in each period until the instrument matures, is terminated, is re-designated as a qualified cash flow hedge, or is sold. Ineffective portions of cash flow hedges, as well as amounts excluded from the assessment of effectiveness, are recognized in earnings.\nCash Equivalents\nThe Company considers all highly liquid investments with original maturities of three months or less when purchased to be cash equivalents. Cash equivalents are measured at fair value based on Level 1 measurement, or quoted market prices, as defined by ASC No. 820, Fair Value Measurements and Disclosures.\nEquity Investments\nThe Company invests in equity securities in companies to promote business and strategic objectives. Equity investments are measured and recorded as follows:\nNon-marketable equity securities are equity securities without readily determinable fair value that are measured and recorded using a measurement alternative that measures the securities at cost minus impairment, if any, plus or minus changes resulting from qualifying observable price changes.\nAllowance for Doubtful Accounts\nThe Company maintains allowances for doubtful accounts for estimated losses resulting from its customers failure to make required payments. If the financial condition of the Companys customers were to deteriorate, resulting in an impairment of their ability to make payments, including as a result of COVID-19 and macroeconomic headwinds, additional allowances may be required. If global or regional economic conditions deteriorate or political conditions were to change in some of the countries where the Company does business, it could have a significant impact on the results of operations, and the Companys ability to realize the full value of its accounts receivable.\nInventories\nInventories are stated at the lower of cost (on a first-in, first-out basis) or net realizable value. The Company generally provides reserves for obsolete inventory and for inventory considered to be in excess of demand. Demand is generally defined as 18 months forecasted future consumption for equipment, 24 months forecasted future consumption for spare parts, and 12 months forecasted future consumption for tools. Forecasted consumption is based upon internal projections, historical sales volumes, customer order activity and a review of consumable inventory levels at customers facilities. The Company communicates forecasts of its future consumption to its suppliers and adjusts commitments to those suppliers accordingly. If required, the Company reserves the difference between the carrying value of its inventory and the lower of cost or net realizable value, based upon projections about future consumption, and market conditions. If actual market conditions are less favorable than projections, additional inventory reserves may be required.\nInventory reserve provision for certain subsidiaries is determined based on managements estimate of future consumption for equipment and spare parts. This estimate is based on historical sales volumes, internal projections and market developments and trends.\nProperty, Plant and Equipment\nProperty, plant and equipment are carried at cost. The cost of additions and those improvements which increase the capacity or lengthen the useful lives of assets are capitalized while repair and maintenance costs are expensed as incurred. Depreciation and amortization are provided on a straight-line basis over the estimated useful lives as follows: buildings 25 years; machinery, equipment, furniture and fittings 3 to 10 years; toolings 1 year; and leasehold improvements are based on the shorter of the life of lease or life of asset. Purchased computer software costs related to business and financial systems are amortized over a five-year period on a straight-line basis. Land is not depreciated.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nValuation of Long-Lived Assets\nIn accordance with ASC No. 360, Property, Plant & Equipment (ASC 360), the Companys definite lived intangible assets and property, plant and equipment are tested for impairment based on undiscounted cash flows when triggering events occur, and if impaired, written-down to fair value based on either discounted cash flows or appraised values. ASC 360 also provides a single accounting model for long-lived assets to be disposed of by sale and establishes additional criteria that would have to be met to classify an asset as held for sale. The carrying amount of an asset or asset group is not recoverable to the extent it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset or asset group. Estimates of future cash flows used to test the recoverability of a long-lived asset or asset group must incorporate the entitys own assumptions about its use of the asset or asset group and must factor in all available evidence.\nASC 360 requires that long-lived assets be tested for recoverability whenever events or changes in circumstances indicate that their carrying amount may not be recoverable. Such events include significant under-performance relative to historical internal forecasts or projected future operating results; significant changes in the manner of use of the assets; significant negative industry or economic trends; or significant changes in market capitalization. During the fiscal years ended October 1, 2022 and October 2, 2021, no triggering events occurred.\nAccounting for Impairment of Goodwill\nASC No. 350, Intangibles - Goodwill and Other requires goodwill and other intangible assets with indefinite lives to be reviewed for impairment annually, or more frequently if circumstances indicate a possible impairment. We assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If, after assessing the qualitative factors, a company determines that it is not more likely than not that the fair value of a reporting unit is less than its carrying value, then performing the impairment test is unnecessary. However, if a company concludes otherwise, then it is required to perform the goodwill impairment test. The Companys impairment test is performed by comparing the fair value of a reporting unit with its carrying value, and determining if the carrying amount exceeds its fair value.\nAs part of the annual evaluation, the Company performs an impairment test of its goodwill in the fourth quarter of each fiscal year to coincide with the completion of its annual forecasting and refreshing of its business outlook processes. On an ongoing basis, the Company monitors if a triggering event has occurred that may have the effect of reducing the fair value of a reporting unit below its respective carrying value. Adverse changes in expected operating results and/or unfavorable changes in other economic factors used to estimate fair values could result in a non-cash impairment charge in the future.\nImpairment assessments inherently involve judgment as to the assumptions made about the expected future cash flows and the impact of market conditions on those assumptions. Future events and changing market conditions may impact the assumptions as to prices, costs, growth rates or other factors that may result in changes in the estimates of future cash flows. Although the Company believes the assumptions that it has used in testing for impairment are reasonable, significant changes in any one of the assumptions could produce a significantly different result. Indicators of potential impairment, including significant and unforeseen customer losses, a significant adverse change in legal factors or in the business climate, a significant adverse action or assessment by a regulator, a significant stock price decline or unanticipated competition may lead the Company to perform interim goodwill impairment assessments.\nFor further information on goodwill and other intangible assets, see Note 4 below.\nRevenue Recognition\nIn accordance with ASC No. 606, Revenue from Contracts with Customers, the Company recognizes revenue when we satisfy performance obligations as evidenced by the transfer of control of our products or services to customers. In general, the Company generates revenue from product sales, either directly to customers or to distributors. In determining whether a contract exists, we evaluate the terms of the agreement, the relationship with the customer or distributor and their ability to pay.\nThe Company recognizes revenue from sales of our products, including sales to our distributors, at a point in time, generally upon shipment or delivery to the customer or distributor, depending upon the terms of the sales order. Control is considered transferred when title and risk of loss pass, when the customer becomes obligated to pay and, where applicable, when the customer has accepted the products or upon expiration of the acceptance period. For sales to distributors, payment is due on our standard commercial terms and is not contingent upon the distributors resale of the products.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nOur business is subject to contingencies related to customer orders, including:\nRight of Return: A large portion of our revenue comes from the sale of equipment used in the semiconductor assembly process. Other product sales relate to consumable products, which are sold in high-volume quantities, and are generally maintained at low stock levels at the customers facility. Customer returns have historically represented a very small percentage of customer sales on an annual basis.\nWarranties: Our equipment is generally shipped with a one-year warranty against manufacturing defects. We establish reserves for estimated warranty expense when revenue for the related equipment is recognized. The reserve for estimated warranty expense is based upon historical experience and managements estimate of future expenses, including product parts replacement, freight charges and labor costs expected to be incurred to correct manufacturing defects during the warranty period.\nConditions of Acceptance: Sales of our consumable products generally do not have customer acceptance terms. In certain cases, sales of our equipment have customer acceptance clauses which may require the equipment to perform in accordance with agreed specifications, customer specifications or subject to satisfactory installation at the customers facility. In such cases, if the terms of acceptance are satisfied at our facility prior to shipment, the revenue for the equipment will be recognized upon shipment. If the terms of acceptance are satisfied at our customers facilities, the revenue for the equipment will not be recognized until acceptance, which is typically obtained after installation and testing, is received from the customer.\nService revenue is generally recognized over time as the services are performed. For fiscal 2022 and 2021, the service revenue is not material.\nThe Company measures revenue based on the amount of consideration we expect to be entitled to in exchange for products or services. Any variable consideration such as sales incentives are recognized as a reduction of net revenue at the time of revenue recognition.\nThe length of time between invoicing and payment is not significant under our payment terms. In instances where the timing of revenue recognition differs from the timing of invoicing, we have determined our contracts generally do not include a significant financing component. Shipping and handling costs billed to customers are recognized in net revenue.\nShipping and handling costs paid by the Company are included in cost of sales.\nContract Assets\nA contract asset is the Companys right to consideration in exchange for goods or services that the Company has transferred to a customer. ASC 606, Revenue from Contracts with Customers, distinguishes between a contract asset and a receivable based on whether receipt of the consideration is conditional on something other than the passage of time. When the Company transfers control of goods or services to a customer before the customer pays consideration, the Company records either a contract asset or a receivable depending on the nature of the Companys right to consideration for its performance. The point at which a contract asset becomes an account receivable may be earlier than the point at which an invoice is issued. The Company assesses a contract asset for impairment in accordance with ASC 310, Receivables.\nResearch and Development\nThe Company charges research and development costs associated with the development of new products to expense when incurred. In certain circumstances, pre-production machines that the Company intends to sell are carried as inventory until sold.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nIncome Taxes\nIn accordance with ASC No. 740, Income Taxes, deferred income taxes are determined using the balance sheet method. The Company records a valuation allowance to reduce its deferred tax assets to the amount expected, on a more likely than not basis, to be realized. While the Company has considered future taxable income and ongoing tax planning strategies in assessing the need for the valuation allowance, if it were to determine that it would be able to realize its deferred tax assets in the future in excess of its net recorded amount, an adjustment to deferred tax assets would increase income in the period when such determination is made. Likewise, should the Company determine it would not be able to realize all or part of its deferred tax assets in the future, an adjustment to deferred tax assets would decrease income in the period when such determination is made.\nThe Company determines the amount of unrecognized tax benefit with respect to uncertain tax positions taken or expected to be taken on its income tax returns in accordance with ASC No. 740 Topic 10, Income Taxes, General (ASC 740.10). Under ASC 740.10, the Company utilizes a two-step approach for evaluating uncertain tax positions. Step one, or recognition, requires a company to determine if the weight of available evidence indicates a tax position is more likely than not to be sustained upon examination solely based on its technical merit. Step two, or measurement, is based on the largest amount of benefit, which is more likely than not to be realized on settlement with the taxing authority, including resolution of related appeals or litigation processes, if any.\nEquity-Based Compensation\nThe Company accounts for equity-based compensation under the provisions of ASC No. 718, Compensation - Stock Compensation (ASC 718). ASC 718 requires the recognition of the fair value of the equity-based compensation in net income. Compensation expense associated with Relative TSR Performance Share Units is determined using a Monte-Carlo valuation model, and compensation expense associated with time-based and Growth Performance Share Units is determined based on the number of shares granted and the fair value on the date of grant. See Note 11 for a summary of the terms of these performance-based awards. The fair value of equity-based awards is amortized over the vesting period of the award, and the Company elected to use the straight-line method for awards granted after the adoption of ASC 718.\nEarnings per Share\nEarnings per share (EPS) are calculated in accordance with ASC No. 260, Earnings per Share. Basic EPS include only the weighted average number of common shares outstanding during the period. Diluted EPS include the weighted average number of common shares and the dilutive effect of stock options, restricted stock awards, performance share units and restricted share units outstanding during the period, when such instruments are dilutive.\nAccelerated Share Repurchase\nFrom time to time, the Company may enter into accelerated share repurchase (ASR) agreements with third-party financial institutions to repurchase shares of the Companys common stock. Under an ASR agreement, in exchange for an up-front payment, the counterparty makes an initial delivery of shares of the Companys common stock during the purchase period of the relevant ASR. This initial delivery of shares represents the minimum number of shares that the Company may receive under an ASR agreement. Upon settlement of an ASR agreement, the counterparty may deliver additional shares, with the final number of shares delivered determined based on the volume-weighted average price of the Companys common stock over the term of such ASR agreement, less an agreed-upon discount. The transactions are accounted for as equity transactions and are included in Treasury Stock when the shares are received, at which time there is an immediate reduction in the weighted-average common shares calculation for basic and diluted earnings per share.\nAccounting for Business Acquisitions\nThe Company accounts for business acquisitions in accordance with ASC No. 805, Business Combinations. The fair value of the net assets acquired and the results of operations of the acquired businesses are included in the consolidated financial statements from the acquisition date forward. The Company is required to make estimates and assumptions that affect the reported amounts of assets and liabilities and results of operations during the reporting period. Estimates are used in accounting for, among other things, the fair value of acquired net operating assets, property, plant and equipment, deferred revenue, intangible assets and related deferred income taxes, useful lives of property, plant and equipment, and amortizable lives of acquired intangible assets. Any excess of the purchase consideration over the identified fair value of the assets and liabilities assumed is recognized as goodwill. The valuation of these tangible and identifiable intangible assets and liabilities is subject to further management review and may change materially between the preliminary allocation and end of the purchase price allocation period.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nRestructuring Charges\nRestructuring charges may consist of voluntary or involuntary severance-related charges, asset-related charges and other costs due to exit activities. We recognize voluntary termination benefits when an employee accepts the offered benefit arrangement. We recognize involuntary severance-related charges depending on whether the termination benefits are provided under an ongoing benefit arrangement or under a one-time benefit arrangement. If the former, we recognize the charges once they are probable and the amounts are estimable. If the latter, we recognize the charges once the benefits have been communicated to employees.\nRecent Accounting Pronouncements\nIncome Taxes\nIn December 2019, the Financial Accounting Standards Board (FASB) issued ASU 2019-12, Income Taxes (Topic 740). The amendments in this ASU, among other changes, simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740, clarify and amend the existing guidance. We adopted this ASU in the first quarter of fiscal 2022. The adoption of this ASU did not have a material impact on our consolidated financial statements.\nContracts in Entitys Own Equity\nIn August 2020, the FASB issued ASU 2020-06, Derivatives and Hedging - Contracts in Entitys Own Equity (Topic 815). The amendments in this ASU, among other changes, remove current guidance that allows an entity to rebut the presumption that potential share settlement be included in the diluted earnings per share calculation when an instrument may be settled in cash or shares if the entity has a history or policy of cash settlement. These amendments affect any instrument that may be settled in cash or shares and, therefore, affects the diluted earnings per share calculation for both convertible instruments and contracts in an entity's own equity. We elected to early adopt this ASU in the second quarter of fiscal 2022. The adoption of this ASU did not have a material impact on our consolidated financial statements.\nCodification Improvements\nIn October 2020, the FASB issued ASU 2020-10, Codification Improvements. The amendments in this ASU affect a wide variety of topics in the Codification and improve the consistency of the Codification by including all disclosure guidance in the appropriate disclosure sections (Section 50). We adopted this ASU in the first quarter of fiscal 2022. The adoption of this ASU did not have a material impact on our consolidated financial statements.\nGovernment Assistance\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832): Disclosure by Business Entities about Government Assistance which aims at increasing the transparency of government assistance received by most business entities. The standard requires business entities to make annual disclosures about the nature of the transactions and the related accounting policy used to account for the transactions, the line items and applicable amounts on the balance sheet and income statement that are affected by the transactions, and significant terms and conditions of the transactions, including commitments and contingencies. If an entity omits any required disclosures because it is legally prohibited, it must disclose that fact. This ASU is effective for fiscal years (and interim periods within those fiscal years) beginning after December 15, 2021, which for the Company is the first quarter of fiscal 2023. The Company is currently evaluating the impact the adoption of this standard will have on its consolidated financial statements.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 2: BALANCE SHEET COMPONENTS\nThe following tables reflect the components of significant balance sheet accounts as of October 1, 2022 and October 2, 2021:\nAs of\n(in thousands) October 1, 2022 October 2, 2021\nShort term investments, available-for-sale(1)\n$ 220,000 $ 377,000\nInventories, net:\nRaw materials and supplies $ 118,833 $ 94,493\nWork in process 40,114 55,866\nFinished goods 45,277 40,006\n204,224 190,365\nInventory reserves (19,238) (23,042)\n$ 184,986 $ 167,323\nProperty, plant and equipment, net:\nLand $ 2,182 $ 2,182\nBuildings and building improvements 22,783 23,314\nLeasehold improvements 32,400 30,054\nData processing equipment and software 38,223 40,945\nMachinery, equipment, furniture and fixtures 90,151 87,994\nConstruction in progress 25,004 9,562\n210,743 194,051\nAccumulated depreciation (129,835) (126,069)\n$ 80,908 $ 67,982\nAccrued expenses and other current liabilities:\nAccrued customer obligations (2)\n$ 58,916 $ 72,478\nWages and benefits 50,279 66,531\nCommissions and professional fees 5,019 6,190\nDividends payable 9,743 8,673\nSeverance 19 31\nOther 10,565 7,667\n$ 134,541 $ 161,570\n(1)All short-term investments were classified as available-for-sale and the fair value approximates cost basis. The Company did not recognize any realized gains or losses on the sale of investments during the fiscal years ended 2022 and 2021.\n(2)Represents customer advance payments, customer credit program, accrued warranty expense and accrued retrofit obligations.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 3: BUSINESS COMBINATIONS\nAcquisition of Uniqarta\nOn January 19, 2021, Kulicke and Soffa Industries, Inc. entered into a Stock Purchase Agreement with Uniqarta, Inc. (Uniqarta) and its equity holders to purchase all of Uniqartas outstanding equity interests. Upon the closing of the acquisition, Uniqarta became a wholly-owned subsidiary of the Company. Uniqarta is a developer of laser transfer technology and the acquisition expands the Companys presence in the LED end market.\nThe purchase price consisted of $26.5 million in cash paid at closing. The acquisition of Uniqarta was accounted for in accordance with ASC No. 805, Business Combinations, using the acquisition method.\nOn January 19, 2022, the Company finalized the valuation of the tangible and identifiable intangible assets and liabilities in connection with the acquisition of Uniqarta and no further adjustment was recorded. On July 15, 2022, the Company released the escrow amount of $3.5 million to the seller in respect of Uniqartas completion of its post-closing obligations under the Agreement.\nThe following table summarizes the allocation of the assets acquired and liabilities assumed based on the fair values as of the acquisition date:\n(in thousands) January 19, 2021\nAccounts and other receivable $ 7\nPrepaid expenses and other current assets 6\nProperty, plant and equipment, net 539\nGoodwill 16,799\nIntangible assets 11,200\nAccounts payable (77)\nAccrued expenses and other current liabilities (98)\nDeferred tax liabilities (2,038)\nTotal purchase price, net of cash acquired $ 26,338\nTangible net assets (liabilities) were valued at their respective carrying amounts, which the Company believes approximate their current fair values at the acquisition date.\nThe valuation of identifiable intangible assets acquired, representing in-process research and development (IPR&D) and others, reflects managements estimates based on, among other factors, the use of an established valuation method. The intangible assets are valued using a cost replacement method. As of October 2, 2021, the IPR&D intangible asset of $9.0 million is not amortized, but rather is reviewed for impairment on an annual basis or more frequently if indicators of impairment are present, until the project is completed, abandoned, or transferred to a third party. As of October 1, 2022, the IPR&D were transferred to developed technology (definite-lived intangible assets) as the research and development process was completed. The other intangible assets acquired of $2.2 million and the IPR&D are amortized over the period of estimated benefit using the straight-line method and the estimated useful life of six years. The straight-line method of amortization represents the Companys best estimate of the distribution of the economic value of the identifiable intangible assets. Goodwill represents the excess of the purchase price over the fair value of the net tangible and identifiable intangible assets acquired and includes the value of expected future cash flows of Uniqarta from expected synergies with our other affiliates and other unidentifiable intangible assets. None of the goodwill recorded as part of the acquisition will be deductible for income tax purposes.\nIn connection with the acquisition of Uniqarta, the Company recorded deferred tax liabilities primarily relating to the acquired intangible assets, which are partially offset by the acquired tax attributes. The acquired tax attributes are comprised of net operating losses and research and development credits.\nFor the year ended October 2, 2021, the acquired business contributed a net loss of $0.2 million.\nDuring fiscal 2021, the Company incurred $1.7 million of expenses related to the acquisition, which is included within selling, general and administrative expense in the Consolidated Statements of Operations.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following unaudited pro forma information presents the combined results of operations as if the acquisition had been completed on September 29, 2019, the beginning of the comparable prior annual reporting period. The unaudited pro forma results include: (i) amortization associated with preliminary estimates for the acquired intangible assets; and (ii) the associated tax impact on the unaudited pro forma adjustments.\nThe unaudited pro forma results do not reflect any cost saving synergies from operating efficiencies or the effect of the incremental costs incurred in integrating the two companies. Accordingly, these unaudited pro forma results are presented for informational purposes only and are not necessarily indicative of what the actual results of operations of the combined company would have been if the acquisition had occurred at the beginning of the periods presented, nor are they indicative of future results of operations:\nFiscal\n(in thousands) 2021 2020\nNet revenue $ 1,517,664 $ 623,176\nNet income 368,546 49,766\nNOTE 4: GOODWILL AND INTANGIBLE ASSETS\nGoodwill\nIntangible assets classified as goodwill are not amortized. The goodwill established in connection with our acquisitions represents the estimated future economic benefits arising from the assets we acquired that did not qualify to be identified and recognized individually. The goodwill also includes the value of expected future cash flows from the acquisitions, expected synergies with our other affiliates and other unidentifiable intangible assets.\nThe Company performs an annual impairment test of its goodwill during the fourth quarter of each fiscal year, which coincides with the completion of its annual forecasting and refreshing of business outlook process.\nThe Company performed its annual impairment test in the fourth quarter of fiscal 2022 and concluded that no impairment charge was required. Any future adverse changes in expected operating results and/or unfavorable changes in other economic factors used to estimate fair values could result in a noncash impairment in the future.\nDuring the fiscal year ended October 1, 2022, the Company reviewed qualitative factors to ascertain if a triggering event may have taken place that may have the effect of reducing the fair value of the reporting unit below its carrying value and concluded that no triggering event had occurred. While we have concluded that a triggering event did not occur during the fiscal year ended October 1, 2022, the prolonged COVID-19 pandemic and macroeconomic headwinds could impact the results of operations due to changes to assumptions utilized in the determination of the estimated fair values of the reporting units that could be significant enough to trigger an impairment. Net sales and earnings growth rates could be negatively impacted by reductions or changes in demand for our products. The discount rate utilized in our valuation model could also be impacted by changes in the underlying interest rates and risk premiums included in the determination of the cost of capital.\nThe following table summarizes the Companys recorded goodwill by reportable segments as of October 1, 2022 and October 2, 2021:\n(in thousands) Capital Equipment\nAPS Total\nBalance at October 2, 2021 46,561 26,388 72,949\nOther (4,372) (481) (4,853)\nBalance at October 1, 2022 42,189 25,907 68,096\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nIntangible Assets\nIntangible assets with determinable lives are amortized over their estimated useful lives. The Companys intangible assets consist primarily of developed technology, customer relationships, in-process research and development, and trade and brand names.\nThe following table reflects net intangible assets as of October 1, 2022 and October 2, 2021:\nAs of Average estimated\n(dollar amounts in thousands) October 1, 2022 October 2, 2021 useful lives (in years)\nDeveloped technology $ 89,017 $ 90,427 6.0 to 15.0\nAccumulated amortization $ (58,636) $ (58,494)\nNet developed technology $ 30,381 $ 31,933\nCustomer relationships $ 33,515 $ 36,114 5.0 to 6.0\nAccumulated amortization $ (33,515) $ (36,114)\nNet customer relationships $ - $ -\nIn-process research and development(1)\n$ - $ 8,795 N.A.\nAccumulated amortization $ - $ -\nNet in-process research and development $ - $ 8,795\nTrade and brand name $ 6,945 $ 7,374 7.0 to 8.0\nAccumulated amortization $ (6,945) $ (7,275)\nNet trade and brand name $ - $ 99\nOther intangible assets $ 4,700 $ 4,700 1.9 to 6.0\nAccumulated amortization $ (3,142) $ (2,775)\nNet other intangible assets $ 1,558 $ 1,925\nNet intangible assets $ 31,939 $ 42,752\n(1) During the year ended October 1, 2022, $7.9 million of in-process research and development assets were transferred to developed technology (definite-lived intangible assets) as the research and development process was completed, and are being amortized over the period of estimated benefit using the straight-line method and the estimated useful life of six years.\nThe following table reflects estimated annual amortization expense related to intangible assets as of October 1, 2022:\nAs of\n(in thousands) October 1, 2022\nFiscal 2023 $ 5,348\nFiscal 2024 $ 5,348\nFiscal 2025 $ 5,348\nFiscal 2026 $ 5,348\nFiscal 2027 $ 4,685\nFiscal 2028 and thereafter $ 5,862\nTotal amortization expense $ 31,939\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 5: CASH, CASH EQUIVALENTS, AND SHORT-TERM INVESTMENTS\nCash equivalents consist of instruments with remaining maturities of three months or less at the date of purchase. In general, these investments are free of trading restrictions.\nCash, cash equivalents and short-term investments consisted of the following as of October 1, 2022:\n(dollar amounts in thousands) Amortized\nCost Unrealized\nGains Unrealized\nLosses Estimated Fair Value\nCurrent assets:\nCash $ 173,402 $ - $ - $ 173,402\nCash equivalents:\nMoney market funds (1)\n157,145 - (20) 157,125\nTime deposits (2)\n225,010 - - 225,010\nTotal cash and cash equivalents $ 555,557 $ - $ (20) $ 555,537\nShort-term investments:\nTime deposits (2)\n$ 220,000 $ - $ - $ 220,000\nTotal short-term investments $ 220,000 $ - $ - $ 220,000\nTotal cash, cash equivalents, and short-term investments $ 775,557 $ - $ (20) $ 775,537\n(1)The fair value was determined using unadjusted prices in active, accessible markets for identical assets, and as such they were classified as Level 1 assets in the fair value hierarchy.\n(2)Fair value approximates cost basis.\nCash, cash equivalents, restricted cash and short-term investments consisted of the following as of October 2, 2021:\n(dollar amounts in thousands) Amortized\nCost Unrealized\nGains Unrealized\nLosses Estimated Fair Value\nCurrent assets:\nCash $ 269,201 $ - $ - $ 269,201\nCash equivalents:\nMoney market funds (1)\n93,598 - (18) 93,580\nTime deposits (2)\n7 - - 7\nTotal cash and cash equivalents $ 362,806 $ - $ (18) $ 362,788\nShort-term investments:\nTime deposits (2)\n377,000 - - 377,000\nTotal short-term investments $ 377,000 $ - $ - $ 377,000\nTotal cash, cash equivalents, restricted cash and short-term investments $ 739,806 $ - $ (18) $ 739,788\n(1)The fair value was determined using unadjusted prices in active, accessible markets for identical assets, and as such they were classified as Level 1 assets in the fair value hierarchy.\n(2)Fair value approximates cost basis.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 6: EQUITY INVESTMENTS\nEquity investments consisted of the following as of October 1, 2022 and October 2, 2021:\nAs of\n(in thousands) October 1, 2022 October 2, 2021\nNon-marketable equity securities $ 5,397 $ 6,388\nDuring the year ended October 1, 2022, the Company recorded an impairment of $1.3 million on a non-marketable equity security without a readily determinable fair value. The entire amount of the investment in the non-marketable equity security was impaired due to a significant deterioration in the earnings performance of the equity investee. The impairment amount is recorded within Selling, general and administrative expense in the Consolidated Statement of Operations.\nNOTE 7: FAIR VALUE MEASUREMENTS\nAccounting standards establish three levels of inputs that may be used to measure fair value: quoted prices in active markets for identical assets or liabilities (referred to as Level 1), inputs other than Level 1 that are observable for the asset or liability either directly or indirectly (referred to as Level 2) and unobservable inputs to the valuation methodology that are significant to the measurement of fair value of assets or liabilities (referred to as Level 3).\nAssets and Liabilities Measured and Recorded at Fair Value on a Recurring Basis\nWe measure certain financial assets and liabilities at fair value on a recurring basis. There were no transfers between fair value measurement levels during the fiscal year ended October 1, 2022.\nFair Value Measurements on a Nonrecurring Basis\nOur non-financial assets such as intangible assets and property, plant and equipment are carried at cost unless impairment is deemed to have occurred.\nFair Value of Financial Instruments\nAmounts reported as accounts receivables, prepaid expenses and other current assets, accounts payable and accrued expenses approximate fair value.\nNOTE 8: DERIVATIVE FINANCIAL INSTRUMENTS\nThe Companys international operations are exposed to changes in foreign exchange rates due to transactions denominated in currencies other than U.S. dollars. Most of the Companys revenue and cost of materials are transacted in U.S. dollars. However, a significant amount of the Companys operating expenses is denominated in foreign currencies, primarily in Singapore.\nThe foreign currency exposure of our operating expenses is generally hedged with foreign exchange forward contracts. The Companys foreign exchange risk management programs include using foreign exchange forward contracts with cash flow hedge accounting designation to hedge exposures to the variability in the U.S. dollar equivalent of forecasted non-U.S. dollar-denominated operating expenses. These instruments generally mature within twelve months. For these derivatives, we report the after-tax gain or loss from the effective portion of the hedge as a component of accumulated other comprehensive income (loss), and we reclassify it into earnings in the same period or periods in which the hedged transaction affects earnings and in the same line item on the Consolidated Statements of Operations as the impact of the hedged transaction.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe fair value of derivative instruments on our Consolidated Balance Sheets as of October 1, 2022 and October 2, 2021 is as follows:\nAs of\n(in thousands) October 1, 2022 October 2, 2021\nNotional Amount Fair Value Liability Derivatives(1)\nNotional Amount Fair Value Liability Derivatives(1)\nDerivatives designated as hedging instruments:\nForeign exchange forward contracts (2)\n$ 57,570 $ (2,234) $ 57,682 $ (616)\nTotal derivatives $ 57,570 $ (2,234) $ 57,682 $ (616)\n(1)The fair value of derivative liabilities is measured using level 2 fair value inputs and is included in accrued expenses and other current liabilities on our Consolidated Balance Sheets.\n(2)Hedged amounts expected to be recognized into earnings within the next twelve months.\nThe effect of derivative instruments designated as cash flow hedges in our Consolidated Statements of Operations for the fiscal years ended October 1, 2022 and October 2, 2021 was as follows:\n(in thousands) Fiscal\n2022 2021\nForeign exchange forward contract in cash flow hedging relationships:\nNet (loss)/gain recognized in OCI, net of tax(1)\n$ (2,694) $ 24\nNet (loss)/gain reclassified from accumulated OCI into earnings, net of tax(2)\n$ (1,076) $ 1,197\n(1)Net change in the fair value of the effective portion classified in OCI.\n(2)Effective portion classified as selling, general and administrative expense.\nNOTE 9: LEASES\nWe have entered into various non-cancellable operating and finance lease agreements for certain of our offices, manufacturing, technology, sales support and service centers, equipment, and vehicles. We determine if an arrangement is a lease, or contains a lease, at inception and record the leases in our financial statements upon lease commencement, which is the date when the underlying asset is made available for use by the lessor. Our lease terms may include one or more options to extend the lease terms, for periods from one year to 20 years, when it is reasonably certain that we will exercise that option. As of October 1, 2022, one option to extend the lease were recognized as right-of-use (ROU) assets and lease liabilities. We have lease agreements with lease and non-lease components, and non-lease components are accounted for separately and not included in our leased assets and corresponding liabilities. We have elected not to present short-term leases on the Consolidated Balance Sheets as these leases have a lease term of 12 months or less at lease inception.\nOperating leases are included in operating ROU assets, current and non-current operating lease liabilities, and finance leases are included in property, plant and equipment, accrued expenses and other current liabilities, and other liabilities on the Consolidated Balance Sheets. As of October 1, 2022, our finance leases are not material.\nThe following table shows the components of lease expense:\n(in thousands) Fiscal\n2022 2021\nOperating lease expense (1)\n$ 8,625 7,629\n(1) Operating lease expense includes short-term lease expense, which is immaterial for the fiscal year ended October 1, 2022.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table shows the cash flows arising from lease transactions. Cash payments related to short-term leases are not included in the measurement of operating and finance lease liabilities, and, as such, are excluded from the amounts below:\n(in thousands) Fiscal\n2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflows from operating leases $ 7,908 $ 7,211\nThe following table shows the weighted-average lease terms and discount rates for operating leases:\nFiscal\n2022 2021\nOperating leases:\nWeighted-average remaining lease term (in years): 8.0 9.6\nWeighted-average discount rate: 5.8 % 5.8 %\nFuture lease payments, excluding short-term leases, as of October 1, 2022, are detailed as follows:\n(in thousands) Operating leases\nFiscal 2023 $ 8,748\nFiscal 2024 8,354\nFiscal 2025 7,649\nFiscal 2026 4,954\nFiscal 2027 3,195\nFiscal 2028 and thereafter 20,193\nTotal minimum lease payments 53,093\nLess: Interest 11,400\nPresent value of lease obligations 41,693\nLess: Current portion 6,766\nLong-term portion of lease obligations $ 34,927\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 10: DEBT AND OTHER OBLIGATIONS\nBank Guarantees\nOn November 22, 2013, the Company obtained a $5.0 million credit facility with Citibank in connection with the issuance of bank guarantees for operational purposes. As of October 1, 2022 and October 2, 2021, the outstanding amount was $2.9 million and $3.0 million respectively.\nCredit Facilities\nOn February 15, 2019, the Company entered into a Facility Letter and Overdraft Agreement (collectively, the Facility Agreements) with MUFG Bank, Ltd., Singapore Branch (the Bank). The Facility Agreements provide the Company and one of its subsidiaries with an overdraft facility of up to $150 million (the Overdraft Facility) for general corporate purposes. Amounts outstanding under the Overdraft Facility, including interest, are payable upon thirty days written demand by the Bank. Interest on the Overdraft Facility is calculated on a daily basis, and the applicable interest rate is calculated at the secured overnight financing rate (SOFR) plus a margin of 1.5% per annum. The Overdraft Facility is an unsecured facility per the terms of the Facility Agreements. The Facility Agreements contain customary non-financial covenants, including, without limitation, covenants that restrict the Companys ability to sell or dispose of its assets, cease owning at least 51% of two of its subsidiaries (the Subsidiaries), or encumber its assets with material security interests (including any pledge of monies in the Subsidiaries cash deposit account with the Bank). The Facility Agreements also contain customary events of default, including, without limitation, non-payment of financial obligations when due, cross defaults to other material indebtedness of the Company and any breach of a representation or warranty under the Facility Agreements. As of October 1, 2022, there were no outstanding amounts under the Overdraft Facility.\nNOTE 11: SHAREHOLDERS EQUITY AND EMPLOYEE BENEFIT PLANS\n401(k) Retirement Income Plans\nThe Company has a 401(k) retirement plan (the 401(k) Plan) for eligible U.S. employees. The 401(k) Plan allows for employee contributions and matching Company contributions from 4% to 6% based upon terms and conditions of the 401(k) Plan.\nThe following table reflects the Companys contributions to the 401(k) Plan during fiscal 2022 and 2021:\nFiscal\n(in thousands) 2022 2021\nCash $ 1,973 $ 1,780\nShare Repurchase Program\nOn August 15, 2017, the Company's Board of Directors authorized a program (the \"Program\") to repurchase up to $100 million of the Companys common stock on or before August 1, 2020. In 2018, 2019 and 2020, the Board of Directors increased the share repurchase authorization under the Program to $200 million, $300 million and $400 million, respectively. On March 3, 2022, the Board of Directors increased the share repurchase authorization under the Program by an additional $400 million to $800 million, and extended its duration through August 1, 2025. The Company has entered into a written trading plan under Rule 10b5-1 of the Exchange Act to facilitate repurchases under the Program. The Program may be suspended or discontinued at any time and is funded using the Companys available cash, cash equivalents and short-term investments. Under the Program, shares may be repurchased through open market and/or privately negotiated transactions at prices deemed appropriate by management. The timing and amount of repurchase transactions under the Program depend on market conditions as well as corporate and regulatory considerations.\nDuring the fiscal year ended October 1, 2022, the Company repurchased a total of approximately 2,782.1 thousand shares of common stock at a cost of approximately $132.8 million. The stock repurchases were recorded in the periods they were delivered and accounted for as treasury stock in the Companys Consolidated Balance Sheets. The Company records treasury stock purchases under the cost method using the first-in, first-out (FIFO) method. Upon reissuance of treasury stock, amounts in excess of the acquisition cost are credited to additional paid-in capital. If the Company reissues treasury stock at an amount below its acquisition cost and additional paid-in capital associated with prior treasury stock transactions is insufficient to cover the difference between acquisition cost and the reissue price, this difference is recorded against retained earnings.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nAccelerated Share Repurchase (ASR)\nIn addition to the 2,782.1 thousand shares of common stock repurchased under the Program during the fiscal year ended October 1, 2022, on March 9, 2022, the Company entered into an ASR agreement (the March 2022 ASR Agreement) with an investment bank counterparty (Dealer) to repurchase $150 million of the Companys common stock. The March 2022 ASR Agreement was entered into pursuant to the Companys current $800 million share repurchase authorization.\nUnder the March 2022 ASR Agreement, the Company made an up-front payment of $150 million to the Dealer and received an initial delivery of 2,449.9 thousand shares of common stock at a cost of approximately $120 million on March 10, 2022. The final number of shares to be repurchased will be based on the volume-weighted average price of the Companys common stock during the term of the transaction, less a discount and subject to adjustments pursuant to the terms and conditions of the March 2022 ASR Agreement. For accounting purposes, the March 2022 ASR Agreement is evaluated as an unsettled forward contract indexed to the Companys own stock, with $30 million being classified within common stock. At settlement, the Dealer may be required to deliver additional shares of common stock to the Company, or, under certain circumstances, the Company may be required to deliver shares of its common stock or may elect to make a cash payment to the Dealer.\nThe March 2022 ASR Agreement was settled between the Company and the Dealer on April 22, 2022 and the Company received an additional 344.5 thousand shares of common stock from the Dealer. In total, an aggregate of 2,794.4 thousand shares of common stock were delivered by the Dealer under the March 2022 ASR Agreement at an average price of $53.68 per share, which was then reclassified as treasury stock from common stock in shareholders equity. As of October 1, 2022, our remaining stock repurchase authorization under the Program was approximately $249.2 million.\nDividends\nOn August 30, 2022, June 8, 2022, March 3, 2022 and October 18, 2021, the Board of Directors declared a quarterly dividend $0.17 per share of common stock. During the fiscal year ended October 1, 2022, the Company declared dividends of $0.68 per share of common stock. The declaration of any future cash dividend is at the discretion of the Board of Directors, subject to applicable laws, and will depend on the Companys financial condition, results of operations, capital requirements, business conditions and other factors, as well as a determination that such dividends are in the best interests of the Companys stockholders.\nAccumulated Other Comprehensive Income\nThe following table reflects accumulated other comprehensive loss reflected on the Consolidated Balance Sheets as of October 1, 2022 and October 2, 2021:\nAs of\n(in thousands) October 1, 2022 October 2, 2021\n(Loss) / gain from foreign currency translation adjustments $ (29,854) $ 682\nUnrecognized actuarial loss on pension plan, net of tax (812) (3,088)\nUnrealized loss on hedging (2,234) (616)\nAccumulated other comprehensive loss $ (32,900) $ (3,022)\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nEquity-Based Compensation\nThe Company has a stockholder-approved equity-based compensation plan, the 2021 Omnibus Incentive Plan (the Plan) from which employees and directors receive grants. As of October 1, 2022, 3.3 million shares of common stock are available for grant to the Companys employees and directors under the Plan.\nRelative TSR Performance Share Units (Relative TSR PSUs) entitle the employee to receive common shares of the Company on the award vesting date, typically the third anniversary of the grant date (or as soon as administratively practicable if later), if market performance objectives which measure relative total shareholder return (TSR) are attained. Relative TSR is calculated based upon the 90-calendar day average price at the end of the performance period of the Companys stock as compared to specific peer companies that comprise the GICS (45301020) Semiconductor Index. TSR is measured for the Company and each peer company over a performance period, which is generally three years. Vesting percentages range from 0% to 200% of awards granted. The provisions of the Relative TSR PSUs are reflected in the grant date fair value of the award; therefore, compensation expense is recognized regardless of whether the market condition is ultimately satisfied. Compensation expense is reversed if the award is forfeited prior to the vesting date.\nRevenue Growth Performance Share Units (Growth PSUs) entitle the employee to receive common shares of the Company on the award vesting date, typically the third anniversary of the grant date (or as soon as administratively practicable if later), based on organic revenue growth objectives and relative growth performance against named competitors as set by the Management Development and Compensation Committee (MDCC) of the Companys Board of Directors. Organic revenue growth is calculated by averaging revenue growth (net of revenues from acquisitions) over a performance period, which is generally three years. Revenues from acquisitions will be included in the calculation after four fiscal quarters after acquisition. Any portion of the grant that does not meet the revenue growth objectives and relative growth performance is forfeited. Vesting percentages range from 0% to 200% of awards granted.\nIn general, stock options and Time-based Restricted Share Units (Time-based RSUs) awarded to employees vest ratably over a three-year period on the anniversary of the grant date provided the employee remains employed by the Company. The Company follows the non-substantive vesting method for stock options and recognizes compensation expense immediately for awards granted to retirement eligible employees, or over the period from the grant date to the date retirement eligibility is achieved.\nEquity-based compensation expense recognized in the Consolidated Statements of Operations for fiscal 2022, 2021, and 2020 was based upon awards ultimately expected to vest, with forfeiture accounted for when they occur.\nThe following table reflects total equity-based compensation expense, which includes Relative TSR PSUs, Time-based RSUs, Growth PSUs, and common stock, included in the Consolidated Statements of Operations for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nCost of sales $ 960 $ 828 $ 744\nSelling, general and administrative 13,911 10,998 11,071\nResearch and development 4,115 3,676 3,204\nTotal equity-based compensation expense $ 18,986 $ 15,502 $ 15,019\nThe following table reflects equity-based compensation expense, by type of award, for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nRelative TSR PSUs 4,255 3,916 $ 3,266\nTime-based RSUs 11,655 10,314 9,519\nGrowth PSUs 2,127 444 1,384\nCommon stock 949 828 850\nTotal equity-based compensation expense $ 18,986 $ 15,502 $ 15,019\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nEquity-Based Compensation: Relative TSR PSUs\nThe following table reflects Relative TSR PSUs activity for fiscal 2022, 2021, and 2020:\nNumber of shares (in thousands) Unrecognized compensation expense (in thousands) Average remaining service period (in years) Weighted average grant date fair value per share\nRelative TSR PSUs outstanding as of September 28, 2019 561 $ 4,136 0.9\nGranted 162 $ 28.80\nForfeited or expired (52)\nVested (268)\nRelative TSR PSUs outstanding as of October 3, 2020 403 $ 4,198 1.1\nGranted 155 $ 28.21\nForfeited or expired (6)\nVested (108)\nRelative TSR PSUs outstanding as of October 2, 2021 444 $ 4,455 1.1\nGranted 152 $ 52.18\nForfeited or expired (11)\nVested (205)\nRelative TSR PSUs outstanding as of October 1, 2022 380 $ 4,619 0.9\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the assumptions used to calculate compensation expense related to the Companys Relative TSR PSUs issued during fiscal 2022, 2021, and 2020:\nFiscal\n2022 2021 2020\nGrant price $ 49.20 $ 23.88 $ 22.95\nExpected dividend yield 1.14 % 2.01 % 2.09 %\nExpected stock price volatility 48.50 % 45.15 % 36.29 %\nRisk-free interest rate 0.68 % 0.21 % 1.49 %\nEquity-Based Compensation: Time-based RSUs\nThe following table reflects Time-based RSUs activity for fiscal 2022, 2021, and 2020:\nNumber of shares (in thousands) Unrecognized compensation expense (in thousands) Average remaining service period (in years) Weighted average grant date fair value per share\nTime-based RSUs outstanding as of September 28, 2019 947 $ 10,555 1.4\nGranted 490 $ 22.93\nForfeited or expired (80)\nVested (569)\nTime-based RSUs outstanding as of October 3, 2020 788 $ 10,480 1.6\nGranted 486 $ 24.34\nForfeited or expired (24)\nVested (333)\nTime-based RSUs outstanding as of October 2, 2021 917 $ 11,420 1.4\nGranted 301 $ 49.47\nForfeited or expired (29)\nVested (453)\nTime-based RSUs outstanding as of October 1, 2022 736 $ 13,752 1.2\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nEquity-Based Compensation: Growth PSUs\nThe following table reflects Growth PSUs activity for fiscal 2022, 2021, and 2020:\nNumber of shares (in thousands) Unrecognized compensation expense (in thousands) Average remaining service period (in years) Weighted average grant date fair value per share\nSpecial/Growth PSUs outstanding as of September 28, 2019 97 $ 1,128 1.6\nGranted 80 $ 23.65\nForfeited or expired (22)\nVested (4)\nSpecial/Growth PSUs outstanding as of October 3, 2020 151 $ 1,252 1.1\nGranted 52 $ 24.01\nForfeited or expired (34)\nVested (17)\nSpecial/Growth PSUs outstanding as of October 2, 2021 152 $ 1,247 1.0\nGranted 79 $ 49.26\nForfeited or expired (4)\nVested (100)\nSpecial/Growth PSUs outstanding as of October 1, 2022 127 $ 1,405 0.9\nAs of October 1, 2022, there were no employee stock options.\nEquity-Based Compensation: Non-Employee Directors\nThe 2021 Equity Plan provides for the grant of common shares to each non-employee director upon initial election to the board and on the first business day of each calendar quarter while serving on the board. The grant to a non-employee director upon initial election to the board is that number of common shares closest in value to, without exceeding, $120,000. The quarterly grant to a non-employee director upon the first business day of each calendar quarter is that number of common shares closest in value to, without exceeding, $39,500.\nThe following table reflects shares of common stock issued to non-employee directors and the corresponding fair value for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nNumber of common shares issued 18 22 37\nFair value based upon market price at time of issue $ 949 $ 828 $ 850\nPension Plan\nThe following table reflects the Companys defined benefits pension obligations, mainly in Switzerland and Taiwan, as of October 1, 2022 and October 2, 2021:\nAs of\n(in thousands) October 1, 2022 October 2, 2021\nSwitzerland pension obligation $ 1,038 $ 3,534\nTaiwan pension obligation 1,189 1,443\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nOther Plans\nSome of the Companys other foreign subsidiaries have retirement plans that are integrated with and supplement the benefits provided by laws of the various countries. These other plans are not required to report nor do they determine the actuarial present value of accumulated benefits or net assets available for plan benefits as they are defined contribution plans.\nNOTE 12: REVENUE AND CONTRACT BALANCES\nThe Company recognizes revenue when we satisfy performance obligations as evidenced by the transfer of control of our products or services to customers. In general, the Company generates revenue from product sales, either directly to customers or to distributors. In determining whether a contract exists, we evaluate the terms of the agreement, the relationship with the customer or distributor and their ability to pay. Service revenue is generally recognized over time as the services are performed. For the fiscal years ended October 1, 2022, and October 2, 2021, service revenue is not material. Please refer to Note 1: Basis of Presentation- Revenue Recognition, for additional disclosure on the Companys revenue recognition policy.\nThe Company reports revenue based on our reportable segments. The Company believes that reporting revenue on this basis provides information about how the nature, amount, timing, and uncertainty of revenue and cash flows are affected by economic factors. Please refer to Note 16: Segment Information, for disclosure of revenue by segment.\nContract Balances\nOur contract assets relate to our rights to consideration for revenue with collection dependent on events other than the passage of time, such as the achievement of specified payment milestones. The contract assets will be transferred to net account receivables as our right to consideration for these contract assets become unconditional. Contracts assets are reported in the accompanying Consolidated Balance Sheets within prepaid expenses and other current assets.\nOur contract liabilities are primarily related to payments received in advance of satisfying performance obligations, and are reported in the accompanying Consolidated Balance Sheets within accrued expenses and other current liabilities.\nContract liabilities increase as a result of receiving new advance payments from customers and decrease as revenue is recognized from product sales under advance payment arrangements upon satisfying the performance obligations.\nThe following table shows the changes in contract asset balances during the fiscal years ended October 1, 2022 and October 2, 2021:\nFiscal\n(in thousands) 2022 2021\nContract assets, beginning of period $ - $ -\nAdditions 51,774 -\nTransferred to accounts receivable or collected (25,457) -\nContract assets, end of period $ 26,317 $ -\nThe following table shows the changes in contract liability balances during the fiscal years ended October 1, 2022 and October 2, 2021:\nFiscal\n(in thousands) 2022 2021\nContract liabilities, beginning of period $ 15,596 $ 2,958\nRevenue recognized (116,399) (59,368)\nAdditions 103,963 72,006\nContract liabilities, end of period $ 3,160 $ 15,596\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nNOTE 13: EARNINGS PER SHARE\nBasic income per share is calculated using the weighted average number of shares of common stock outstanding during the period. Stock options and restricted stock are included in the calculation of diluted earnings per share, except when their effect would be anti-dilutive.\nThe following table reflects a reconciliation of the shares used in the basic and diluted net income per share computation for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands, except per share) 2022 2021 2020\nBasic Diluted Basic Diluted Basic Diluted\nNUMERATOR:\nNet income $ 433,545 $ 433,545 $ 367,161 $ 367,161 $ 52,300 $ 52,300\nDENOMINATOR:\nWeighted average shares outstanding - Basic 60,164 60,164 62,009 62,009 62,828 62,828\nDilutive effect of Equity Plans 1,018 1,506 531\nWeighted average shares outstanding - Diluted 61,182 63,515 63,359\nEPS:\nNet income per share - Basic $ 7.21 $ 7.21 $ 5.92 $ 5.92 $ 0.83 $ 0.83\nEffect of dilutive shares $ (0.12) $ (0.14) $ -\nNet income per share - Diluted $ 7.09 $ 5.78 $ 0.83\nAnti-dilutive shares(1)\n1 2 40\n(1) Represents the Relative TSR PSUs and Growth PSUs that are excluded from the calculation of diluted earnings per share for fiscal 2022, 2021, and 2020 as the effect would have been anti-dilutive.\nNOTE 14: OTHER FINANCIAL DATA\nThe following table reflects other financial data for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nIncentive compensation expense $ 27,011 $ 39,779 $ 18,524\nWarranty and retrofit expense 16,349 22,068 8,692\nNOTE 15: INCOME TAXES\nThe following table reflects U.S. and foreign income (loss) before income taxes for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nUnited States $ (11,415) $ (8,853) $ (14,909)\nForeign 488,403 423,403 79,243\nIncome before income taxes $ 476,988 $ 414,550 $ 64,334\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects the current and deferred components of provision for (benefit from) income taxes for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nCurrent:\nFederal $ 14,975 $ 26,563 $ 5,129\nState 246 261 89\nForeign 37,448 30,771 6,508\nDeferred:\nFederal (5,809) (2,979) (690)\nState - - -\nForeign (3,417) (7,321) 962\nProvision for income taxes $ 43,443 $ 47,295 $ 11,998\nThe following table reconciles the provision for (benefit from) income taxes with the expected income tax provision computed based on the applicable U.S. federal statutory tax rate for fiscal 2022, 2021, and 2020:\nFiscal\n(dollar amounts in thousands) 2022 2021 2020\nExpected income tax provision based on the U.S. federal statutory tax rate $ 100,212 $ 86,915 $ 13,510\nEffect of earnings of foreign subsidiaries subject to different tax rates (17,936) (15,028) (1,634)\nBenefit from tax incentives (50,113) (45,501) (6,781)\nBenefit from research and development tax credits (2,995) (2,705) (2,915)\nBenefit from foreign tax credits (26,021) (20,281) (1,701)\nValuation allowance (5,830) (11,620) 1,224\nForeign operations (Deemed income, taxes on undistributed foreign earnings, and withholding taxes) 45,421 52,414 8,886\nNon-deductible items 267 113 1,232\nOther, net (1)\n438 2,988 177\nProvision for income taxes $ 43,443 $ 47,295 $ 11,998\nEffective tax rate 9.1 % 11.4 % 18.6 %\n(1) Certain balances in fiscal 2021 and 2020 have been reclassified to conform to the current period presentation. These reclassifications have no impact to the consolidated financial statements in fiscal 2021 and 2020.\nFor fiscal 2022 and 2021, the effective tax rate differed from the U.S. federal statutory tax rate primarily due to tax benefits from tax incentives, foreign earnings subject to a lower statutory tax rate than the U.S. federal statutory tax rate, tax credits generated during the fiscal year, and the net release of valuation allowances recorded against certain loss and credit carryforwards, partially offset by tax expense related to deemed income and undistributed foreign earnings.\nAs of October 2, 2022, a large portion of the Companys undistributed foreign earnings are not considered to be indefinitely reinvested outside the U.S. and are expected to be available for use in the U.S. without incurring additional U.S. income tax.\nFurther, we operate in a number of foreign jurisdictions, including Singapore, where we have a tax incentive that allows for a reduced tax rate on certain classes of income, provided the Company meets certain employment and investment conditions through the expiration date in fiscal 2025. In fiscal 2022, 2021, and 2020, the tax incentive arrangement helped to reduce the Companys provision for income taxes by $50.1 million or $0.82 per share, $45.5 million or $0.72 per share and $6.8 million or $0.11 per share, respectively.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following table reflects deferred tax balances based on the tax effects of cumulative temporary differences for fiscal 2022 and 2021:\nFiscal\n(in thousands) 2022 2021\nAccruals and reserves $ 14,168 $ 11,890\nTax credit carryforwards 3,893 4,230\nFixed and intangible assets 5,963 465\nNet operating loss carryforwards 15,329 28,913\nGross deferred tax assets $ 39,353 $ 45,498\nValuation allowance $ (21,750) $ (34,095)\nDeferred tax assets, net of valuation allowance $ 17,603 $ 11,403\nTaxes on undistributed foreign earnings $ (26,068) $ (28,516)\nDeferred tax liabilities $ (26,068) $ (28,516)\nNet deferred tax liabilities $ (8,465) $ (17,113)\nReported as\nDeferred tax assets $ 25,572 $ 15,715\nDeferred tax liabilities (34,037) (32,828)\nNet deferred tax liabilities $ (8,465) $ (17,113)\nAs of October 1, 2022, the Company has foreign net operating loss carryforwards of $37.9 million, state net operating loss carryforwards of $54.6 million, and U.S. federal and state tax credit carryforwards of $6.5 million that can be used to offset future income tax obligations. These net operating loss and tax credit carryforwards can be utilized prior to their expiration dates in fiscal years 2023 through 2041, except for certain credits and foreign net operating losses that can be carried forward indefinitely. The Company has recorded valuation allowances against certain foreign and state net operating loss carryforwards and state tax credits which are expected to expire unutilized.\nThe following table reconciles the beginning and ending balances of the Companys unrecognized tax benefit, excluding related accrued interest and penalties, for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nUnrecognized tax benefit, beginning of year $ 14,922 $ 13,064 $ 12,925\nAdditions for tax positions, current year 2,288 4,003 537\nReductions for tax positions, prior year (587) (2,145) (398)\nUnrecognized tax benefit, end of year $ 16,623 $ 14,922 $ 13,064\nThe Company recognizes interest and penalties related to potential income tax liabilities as a component of unrecognized tax benefit and in provision for income taxes. The amount of interest and penalties related to unrecognized tax benefit recorded in fiscal 2022 provision for income taxes is not material. As of October 1, 2022, the Company has recognized $2.0 million of accrued interest and penalties related to unrecognized tax benefit within the income tax payable for uncertain tax positions and approximately $17.1 million of unrecognized tax benefit, including related interest and penalties, that if recognized, would impact the Companys effective tax rate.\nIt is reasonably possible that the amount of the unrecognized tax benefit with respect to certain uncertain tax positions will increase or decrease during the next 12 months due to the expected lapse of statutes of limitation and/or settlements of tax examinations. Given the number of years and numerous matters that remain subject to examination in various tax jurisdictions, we cannot practicably estimate the financial outcomes of these examinations.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe Company files a U.S. federal income tax return, as well as income tax returns in various state and foreign jurisdictions. For U.S. federal income tax returns purposes, tax years from fiscal 2019 remain subject to examination. For most state tax returns, tax years following fiscal 2003 remain subject to examination as a result of the generation of net operating loss carryforwards. In the foreign jurisdictions where the Company files income tax returns, the statutes of limitations with respect to these jurisdictions vary from jurisdiction to jurisdiction and range from 4 to 6 years. The Companys tax returns are currently under examination by tax authorities in multiple state and foreign jurisdictions. The Company believes that adequate provisions have been made for any adjustments that may result from the examination.\nNOTE 16: SEGMENT INFORMATION\nReportable segments are defined as components of an enterprise that engage in business activities for which discrete financial information is available and regularly reviewed by the chief operating decision maker (the CODM) in deciding how to allocate resources and assess performance. The Companys Chief Executive Officer is the CODM. The CODM does not review discrete asset information. The Company operates two reportable segments consisting of: (1) Capital Equipment; and (2) Aftermarket Products and Services (APS).\nThe following table reflects operating information by segment for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nNet revenue:\nCapital Equipment $ 1,306,468 $ 1,312,576 $ 462,059\nAPS 197,152 205,088 161,117\nNet revenue 1,503,620 1,517,664 623,176\nIncome from operations:\nCapital Equipment 397,920 355,982 22,069\nAPS 72,152 56,465 36,440\nIncome from operations $ 470,072 $ 412,447 $ 58,509\nWe have considered: (1) information that is regularly reviewed by our CODM as defined by the authoritative guidance on segment reporting, in evaluating financial performance and (2) other financial data, including information that we include in our earnings releases but which is not included in our financial statements, to disaggregate revenues by end markets served. The principal category we use to disaggregate revenues is by the end markets served in the Capital Equipment segment.\nThe following table reflects net revenue by Capital Equipment end markets served for fiscal 2022, 2021, and 2020\nFiscal\n(in thousands) 2022 2021 2020\nGeneral Semiconductor $ 843,763 $ 928,259 $ 290,220\nAutomotive & Industrial 198,138 129,817 60,169\nLED 137,077 187,568 76,574\nMemory 127,490 66,932 35,096\nTotal Capital Equipment revenue $ 1,306,468 $ 1,312,576 $ 462,059\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nThe following tables reflect capital expenditures, depreciation and amortization expense by segment for fiscal 2022, 2021, and 2020.\nFiscal\n(in thousands) 2022 2021 2020\nCapital expenditures:\nCapital Equipment $ 26,655 $ 15,257 $ 5,798\nAPS 5,578 7,298 8,716\nCapital expenditures $ 32,233 $ 22,555 $ 14,514\nFiscal\n(in thousands) 2022 2021 2020\nDepreciation expense:\nCapital Equipment $ 9,152 $ 6,938 $ 6,360\nAPS 7,224 6,898 6,008\nDepreciation expense $ 16,376 $ 13,836 $ 12,368\nFiscal\n(in thousands) 2022 2021 2020\nAmortization expense:\nCapital Equipment $ 3,873 $ 3,584 $ 4,255\nAPS 1,044 2,390 3,116\nAmortization expense $ 4,917 $ 5,974 $ 7,371\nGeographical information\nThe following tables reflect destination sales to unaffiliated customers by country and long-lived assets by country for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nDestination sales to unaffiliated customers:\nChina $ 855,345 $ 843,470 $ 321,294\nMalaysia 126,520 70,253 40,641\nTaiwan 123,995 275,251 64,373\nKorea 87,647 58,308 30,848\nUnited States 83,906 54,353 36,186\nHong Kong 27,216 82,436 43,288\nAll other(1)\n198,991 133,593 86,546\nTotal destination sales to unaffiliated customers $ 1,503,620 $ 1,517,664 $ 623,176\n(1) Certain balances in fiscal 2021 and 2020 have been reclassified to conform to the current period presentation. These reclassifications have no impact to the consolidated financial statements in fiscal 2021 and 2020.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nFiscal\n(in thousands) 2022 2021\nLong-lived assets:\nSingapore $ 59,672 $ 40,470\nUnited States 31,469 32,684\nChina 19,548 25,386\nIsrael 10,610 8,597\nAll other 9,647 11,187\nTotal long-lived assets $ 130,946 $ 118,324\nNOTE 17: COMMITMENTS, CONTINGENCIES AND CONCENTRATIONS\nWarranty Expense\nThe Companys equipment is generally shipped with a one-year warranty against manufacturing defects. The Company establishes reserves for estimated warranty expense when revenue for the related equipment is recognized. The reserve for estimated warranty expense is based upon historical experience and managements estimate of future warranty costs, including product part replacement, freight charges and related labor costs expected to be incurred to correct product failures during the warranty period.\nThe following table reflects the reserve for product warranty activity for fiscal 2022, 2021, and 2020:\nFiscal\n(in thousands) 2022 2021 2020\nReserve for warranty, beginning of period $ 16,961 $ 9,576 $ 14,185\nProvision for warranty 12,907 18,889 14,004\nChanges in the estimation of warranty reserve - - (5,417)\nUtilization of reserve (16,425) (11,504) (13,196)\nReserve for warranty, end of period $ 13,443 $ 16,961 $ 9,576\nFor the change in estimation of warranty reserve, see Note 1 for details.\nOther Commitments and Contingencies\nThe following table reflects obligations not reflected on the Consolidated Balance Sheets as of October 1, 2022:\nPayments due by fiscal year\n(in thousands) Total 2023 2024 2025 2026 Thereafter\nInventory purchase obligation (1)\n$ 316,123 $ 316,123 $ - $ - $ - $ -\n(1) The Company orders inventory components in the normal course of its business. A portion of these orders are non-cancelable and a portion may have varying penalties and charges in the event of cancellation.\nFrom time to time, the Company is party to or the target of lawsuits, claims, investigations and proceedings, including for personal injury, intellectual property, commercial, contract, and employment matters, which are handled and defended in the ordinary course of business. The Company accrues a contingent loss liability for such matters when it is probable that a liability has been incurred and the amount can be reasonably estimated. When a single amount cannot be reasonably estimated but the cost can be estimated within a range, the Company accrues the minimum amount. The Company expenses legal costs, including those expected to be incurred in connection with a loss contingency, as incurred.\nUnfunded Capital Commitments\nAs of October 1, 2022, the Company also has an obligation to fund uncalled capital commitments of approximately $9.6 million, as and when required, in relation to its investment in a private equity fund.\nKULICKE AND SOFFA INDUSTRIES, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS - (Continued)\nConcentrations\nThe following tables reflect significant customer concentrations as a percentage of net revenue for fiscal 2022, 2021, and 2020:\nFiscal\n2022 2021 2020\nASE Technology Holding * 17.4 % *\n* Represents less than 10% of total net revenue\nThe following table reflects significant customer concentrations as a percentage of total accounts receivable as of October 1, 2022 and October 2, 2021:\nAs of\nOctober 1, 2022 October 2, 2021\nTianshui Huatian Technology Co., Ltd. 16.7 % 18.2 %\nHaoseng Industrial Co., Ltd. (1)\n12.6 % 14.3 %\n(1) Distributor of the Company's products Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. Item 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of October 1, 2022. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that, as of October 1, 2022 our disclosure controls and procedures were effective in providing reasonable assurance that the information required to be disclosed by us in reports filed under the Securities Exchange Act of 1934, as amended, is (i) recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and (ii) accumulated and communicated to our management, including the Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding disclosure.\nManagements Report on Internal Control Over Financial Reporting\nThe management of Kulicke and Soffa Industries, Inc. (the Company) is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) and 15d-15(f) of the Securities Exchange Act of 1934, as amended. The Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles in the United States of America.\nThe Companys internal control over financial reporting includes those policies and procedures that pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles; provide reasonable assurance that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement evaluated the effectiveness of the Companys internal control over financial reporting as of October 1, 2022. In making this assessment, management used the framework established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Managements assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of our internal control over financial reporting. Management reviewed the results of its assessment with the Audit Committee of the Companys Board of Directors.\nBased on that assessment, management has concluded that, as of October 1, 2022, the Companys internal control over financial reporting was effective.\nThe effectiveness of the Companys internal control over financial reporting as of October 1, 2022 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in its report, which appears in Part II, Item 8 of this Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere has been no change in the Companys internal control over financial reporting during the three months ended October 1, 2022, that has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. OTHER INFORMATION\nNone.\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by Item 401 of Regulation S-K with respect to the directors and executive officers will appear under the heading ITEM 1 - ELECTION OF DIRECTORS in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference. The other information required by Item 401 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 405 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Section 16(a) Beneficial Ownership Reporting Compliance in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 406 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Code of Ethics in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 407(c)(3) of Regulation will appear under the headings CORPORATE GOVERNANCE-Nominating and Governance Committee and Shareholder Proposals in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Items 407(d)(4) and (d)(5) of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Audit Committee in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference. Item 11. EXECUTIVE COMPENSATION\nThe information required by Item 402 of Regulation S-K will appear under the heading COMPENSATION OF EXECUTIVE OFFICERS, in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 407(e)(4) of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Management Development and Compensation Committee Interlocks and Insider Participation in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 407(e)(5) of Regulation S-K will appear under the heading MANAGEMENT DEVELOPMENT AND COMPENSATION COMMITTEE REPORT in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required under Item 403 of Regulation S-K concerning security ownership of certain beneficial owners and management will appear under the headings CORPORATE GOVERNANCE-Security Ownership Of Certain Beneficial Owners and CORPORATE GOVERNANCE-SECURITY OWNERSHIP OF DIRECTORS, NOMINEES AND EXECUTIVE OFFICERS, in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Item 201(d) of Regulation S-K relating to securities authorized for issuance under equity compensation plans is included under the heading EQUITY COMPENSATION PLAN INFORMATION in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which is incorporated herein by reference. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by Item 404 of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Certain Relationships and Related Transactions in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nThe information required by Section 407(a) of Regulation S-K will appear under the heading CORPORATE GOVERNANCE-Board Matters in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference. Item 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nOur independent public accounting firm is PricewaterhouseCoopers LLP, Singapore, PCAOB ID 1038.\nThe information required hereunder will appear under the heading AUDIT AND RELATED FEES in the Companys Proxy Statement for the 2023 Annual Meeting of Shareholders, which information is incorporated herein by reference.\nPart IV Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following documents are filed as part of this report:\nPage\n(1) Financial Statements - Kulicke and Soffa Industries, Inc.:\nReport of Independent Registered Public Accounting Firm 36\nConsolidated Balance Sheets as of October 1, 2022 and October 2, 2021 38\nConsolidated Statements of Operations for fiscal 2022, 2021 and 2020 39\nConsolidated Statements of Comprehensive Income for fiscal 2022, 2021 and 2020 40\nConsolidated Statements of Changes in Shareholders' Equity for fiscal 2022, 2021 and 2020 41\nConsolidated Statements of Cash Flows for fiscal 2022, 2021 and 2020 42\nNotes to Consolidated Financial Statements 43\n(2) Financial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts 77\nAll other schedules are omitted because they are not applicable or the required information is\nshown in the Consolidated Financial Statements or notes thereto.\n(3) Exhibits:\nSee Exhibit Index within Item 15 below. 78\nKULICKE AND SOFFA INDUSTRIES, INC.\nSchedule II-Valuation and Qualifying Accounts\n(in thousands)\nFiscal 2022: Beginning of period Charged to Costs and Expenses Other Additions Other Deductions End of period\nAllowance for doubtful accounts $ 687 $ (245) $ - $ (442) (1) $ -\nInventory reserve $ 23,042 $ (2,171) $ - $ (1,633) (2) $ 19,238\nValuation allowance for deferred taxes $ 34,095 $ - $ - $ (12,345) (4) $ 21,750\nFiscal 2021:\nAllowance for doubtful accounts $ 968 $ (248) $ - $ (33) (1) $ 687\nInventory reserve $ 31,163 $ (2,965) $ - $ (5,156) (2) $ 23,042\nValuation allowance for deferred taxes $ 46,561 $ - $ - $ (12,466) (4) $ 34,095\nFiscal 2020:\nAllowance for doubtful accounts $ 597 $ 371 $ - $ - (1) $ 968\nInventory reserve $ 29,313 $ 4,170 $ - $ (2,320) (2) $ 31,163\nValuation allowance for deferred taxes $ 58,411 $ 6,887 (3) $ - $ (18,737) (5) $ 46,561\n(1) Represents write-offs of specific accounts receivable.\n(2) Sale or scrap of previously reserved inventory.\n(3) Reflects the net increase in the valuation allowance primarily associated with the Companys U.S. and foreign tax credits, U.S. and foreign net operating losses and other deferred tax assets.\n(4) Reflects the net decrease in the valuation allowance primarily associated with the Companys utilization of certain foreign net operating losses for which a valuation allowance had previously been recorded, partially offset by an increase for U.S. and foreign tax credits, U.S. and foreign net operating losses and other deferred tax assets.\n(5) Reflects the balances relating to foreign tax credits on undistributed foreign earnings and related valuation allowances that have been reclassified in fiscal 2020.\nEXHIBIT INDEX\nEXHIBIT NUMBER ITEM\n3.1 The Company's Amended and Restated Articles of Incorporation, dated December 5, 2007, is incorporated herein by reference to Exhibit 3(i) to the Company's Annual Report on Form 10-K for the fiscal year ended September 29, 2007, SEC file number 000-00121.\n3.2 The Company's Amended and Restated By-Laws, dated October 22, 2015, is incorporated herein by reference to Exhibit 3(ii) to the Company's Current Report on Form 8-K dated October 22, 2015.\n4.1 Specimen Common Share Certificate of Kulicke and Soffa Industries Inc., is incorporated herein by reference to Exhibit 4 to the Company's Form-8A12G/A dated September 11, 1995, SEC file number 000-00121.\n4.2 Description of the Company's securities.\n10.1 Kulicke & Soffa Industries, Inc. Executive Severance Pay Plan, dated as of August 9, 2011, is incorporated herein by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on August 12, 2011.*\n10.2 Kulicke & Soffa Industries, Inc. Officer Severance Pay Plan, dated as of August 9, 2011, is incorporated herein by reference to Exhibit 10.2 to the Company's Current Report on Form 8-K filed on August 12, 2011.*\n10.3 Form of Change of Control Agreement, is incorporated herein by reference to Exhibit 10.3 to the Company's Current Report on Form 8-K filed on August 12, 2011.*\n10.4 Form of Director Indemnification Agreement is incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 10, 2013.*\n10.5 Lease Agreement between DBS Trustee Limited, as trustee of Mapletree Industrial Trust, and the Kulicke & Soffa Pte. Ltd, dated December 1, 2013, is incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 5, 2013.\n10.6 Lease Agreement Variation Letter between DBS Trustee Limited, as trustee of Mapletree Industrial Trust, and the Kulicke & Soffa Pte. Ltd, dated December 1, 2013, is incorporated herein by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on December 5, 2013.\n10.7 Form of Officer Indemnification Agreement is incorporated herein by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on December 11, 2013.*\n10.8 Offer Letter between Kulicke and Soffa Industries, Inc. and Fusen Chen dated October 3, 2016, incorporated herein by reference to Exhibit 10.1 of the Company's Current Report on Form 8-K filed on October 3, 2016.*\n10.9 2017 Equity Plan is incorporated herein by reference to Appendix A to the Company's Proxy Statement on Schedule 14A for the annual meeting of shareholders on March 14, 2017.*\n10.10 Form of Performance Share Unit Award Agreement regarding the 2017 Equity Plan is incorporated herein by reference to Exhibit 10.1 of the Company's Current Report on Form 8-K filed on November 6, 2017.\n10.11 Form of Restricted Share Unit Award Agreement regarding the 2017 Equity Plan is incorporated herein by reference to Exhibit 10.2 of the Company's Current Report on Form 8-K filed on November 6, 2017.\n10.12 The Company's 2021 Omnibus Incentive Plan is incorporated herein by reference to the Company's Proxy Statement on Schedule 14A for the annual meeting of shareholders on March 4, 2021\n10.13 Form of CEO Performance Share Unit Award Agreement (Growth PSUs) regarding the 2021 Omnibus Incentive Plan.\n10.14 Form of Executive Performance Share Unit Award Agreement (Growth PSUs) regarding the 2021 Omnibus Incentive Plan.\n10.15 Form of CEO Performance Share Unit Award Agreement (Relative TSR) regarding the 2021 Omnibus Incentive Plan.\n10.16 Form of Executive Performance Share Unit Award Agreement (Relative TSR) regarding the 2021 Omnibus Incentive Plan.\n10.17 Form of Restricted Stock Unit Award Agreement regarding the 2021 Omnibus Incentive Plan.\n10.18 Incentive Compensation Plan Fiscal Year 2022.\n21.1 Subsidiaries of the Company.\n23.1 Consent of PricewaterhouseCoopers LLP (Independent Registered Public Accounting Firm).\n31.1 Certification of Fusen Chen, Chief Executive Officer of Kulicke and Soffa Industries, Inc., pursuant to Rule 13a-14(a) or Rule 15d-14(a).\n31.2 Certification of Lester Wong, Chief Financial Officer of Kulicke and Soffa Industries, Inc., pursuant to Rule 13a-14(a) or Rule 15d-14(a).\n32.1 Certification of Fusen Chen, Chief Executive Officer of Kulicke and Soffa Industries, Inc., pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2 Certification of Lester Wong, Chief Financial Officer of Kulicke and Soffa Industries, Inc., pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document.\n104 Cover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101).\n* Indicates a management contract or compensatory plan or arrangement\n** Copies of certain instruments defining the rights of holders of certain of our long-term debt are not filed herewith. We hereby agree to furnish a copy of any such instrument to the SEC upon request.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nKULICKE AND SOFFA INDUSTRIES, INC.\nBy: /s/ FUSEN CHEN\nFusen Chen\nPresident and Chief Executive Officer\nDated: November 17, 2022\nSignature Title Date\n/s/ FUSEN CHEN President and Chief Executive Officer November 17, 2022\nFusen Chen (Principal Executive Officer)\n/s/ LESTER WONG Executive Vice President and Chief Financial Officer November 17, 2022\nLester Wong (Principal Financial Officer and Principal Accounting Officer)\n/s/ JON A. OLSON Director November 17, 2022\nJon A. Olson\n/s/ GREGORY F. MILZCIK\nDirector November 17, 2022\nGregory F. Milzcik\n/s/ CHIN HU LIM Director November 17, 2022\nChin Hu Lim\n/s/ JEFF RICHARDSON Director November 17, 2022\nDavid J. Richardson\n/s/ MUI SUNG YEO Director November 17, 2022\nMui Sung Yeo\n/s/ PETER T. KONG Director November 17, 2022\nPeter T. Kong"
}