{
    "cik": "58361",
    "company": "LEE ENTERPRISES, Inc",
    "filing_type": "10-K",
    "filing_date": "2023-12-08",
    "period_of_report": "2023-09-24",
    "sic": "2711",
    "state_of_inc": "DE",
    "state_location": "IA",
    "fiscal_year_end": "0926",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/58361/0001628280-23-041119-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/58361/000162828023041119/lee-20230924.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/58361/0001628280-23-041119.txt",
    "filename": "58361_10K_2023_0001628280-23-041119.htm",
    "content": "ITEM 1. BUSINESS\nLee Enterprises, Incorporated, together with its subsidiaries (Lee, the Company, we, our or us), is a digital-first subscription business providing local markets with valuable, high quality, trusted, intensely local news, information, advertising and marketing services. We inform consumers in 75 mid-sized local communities in 26 states with a rapidly growing digital subscription platform including 721,000 digital subscribers. Our core strategy aims to grow audiences and engagement through creating, collecting, and distributing trusted local news and information, continuous improvements to subscriber experience, and offering a full suite of omni-channel advertising and marketing to more than 30,000 local advertisers.\nOur product portfolio includes digital subscription platforms, daily, weekly and monthly newspapers and niche products, all delivering original local news and information as well as national and international news. Our products offer digital and print editions, and our content and advertising is available in real time through our websites and mobile apps. We operate in predominately mid-sized communities with products ranging from large daily newspapers and associated digital products, such as the St. Louis Post-Dispatch and The Buffalo News, to non-daily newspapers with news websites and digital platforms serving smaller communities.\nWe have made investments in talent and technology to improve user experience, content, data visualization and marketing to align with the shift in spending habits by both consumers and advertisers toward digital products. In 2023, total digital revenues, which include digital advertising and marketing services revenues, digital-only subscription revenues, and digital services revenues, were $273.2 million, or 39.5% of our total revenues.\nWe aim to grow our business through three main categories: subscriptions to our product offerings, advertising and marketing solutions to local advertisers, and digital services to a diverse set of customers. Execution of this strategy is expected to transform Lee into a growing and sustainable local media organization.\nOur digital subscription platforms are the fastest growing digital subscription platforms in local media. At the end of 2023, we had 721,000 subscribers to our digital platforms, up 35.6% over 2022. Revenue from digital-only subscribers totaled more than $60 million in 2023, up 51% over 2022.\nAmplified Digital® (\"Amplified\"), our digital marketing services agency, offers a full suite of digital marketing solutions to local advertisers. Revenue at Amplified totaled more than $91.2 million in 2023 up 20% over 2022.\nBLOX Digital (formerly known as TownNews), our software as a service (SaaS) content platform, is one of the largest web-hosting and content management SaaS providers in North America. BLOX Digital represents a powerful opportunity to drive additional digital revenue by providing state-of-the-art web hosting and content management services to more than 2,000 customers who rely on BLOX Digital for their web, over-the-top display, mobile, video and social media products. Revenue at BLOX Digital, including intercompany revenue, totaled $35 million in 2023, and has achieved a compound annual growth rate of 11.0% over the last ten years.\nWe generate revenue primarily through advertising and marketing services, subscriptions to our digital and print products, and digital services, primarily through our majority-owned subsidiary, BLOX Digital.\nOn March 16, 2020, we completed the acquisition of BH Media Group, Inc. (\"BH Media\") and The Buffalo News, Inc. (\"Buffalo News\"), adding 31 local media operations and nearly doubling our audience size and total operating revenue. See Note 1 - Significant Accounting Policies, in the Consolidated Financial Statements for more information on the acquisition.\nAdvertising and Marketing Services - In 2023, advertising and marketing services revenue of $319.0 million comprised 46.2% of total operating revenue. Advertising and marketing services are primarily sold to local, regional, and nationwide businesses. There are four categories of advertising revenue:\nAdvertising on our owned and operated digital products;\nDigital marketing services through Amplified, including targeted display, video, OTT, custom content, web development, social media management, search, events, email marketing and other tactics;\nDisplay advertising in daily and non-daily print publications; and\nPreprinted advertising inserted in our daily and non-daily print publications.\nDigital advertising and marketing services remain a key strategic priority for us in 2024. Our advertising teams deploy an omni-channel sales approach that leverages our owned and operated products with Amplified to offer a full suite of digital advertising and marketing services. Through our nationally scaled sales force, proprietary ad tech, and sophisticated reporting and analytics, we believe we are well positioned to solve advertising solutions for our advertisers. Through our AI-driven media planning process, we present our advertisers with targeted, integrated solutions that help them reach their intended audiences.\nAdvertising and marketing services revenues are subject to moderate seasonality primarily due to fluctuations in advertising volumes tied to holidays and seasonal advertising. Our advertising and marketing services revenues are typically highest during the first quarter due to holiday and seasonal advertising and lowest in the second quarter following the holiday season.\nSubscription Revenue - In 2023, subscription revenue of $313.3 million comprised 45.3% of our total operating revenue. Subscription revenue is earned primarily from selling subscriptions to our content through our full access subscriptions, digital-only subscriptions and single copy sales.\nOur full access subscriptions include access to all of our content on multiple platforms; including our print products delivered or made available to consumers, websites, smartphone and tablet applications, and e-editions with pricing varying significantly by market and by frequency. Consistent with general publishing industry trends, print subscription volumes declined in 2023.\nWe experienced rapid growth of our digital-only subscriptions. Digital-only subscriptions include access to our content on our digital platforms. At the end of the fiscal year, we had over 721,000 digital-only subscribers, up 35.6% compared to 2022, with revenue totaling $60 million, or up 51% compared to 2022. Growing our digital-only subscribers and digital-only revenue remains a top strategic priority in 2024. Our primary digital-only subscriber acquisition tactics include:\nInvesting in relevant, trusted, and intensely local news and information that connects and engages our local communities;\nBrand marketing campaigns to raise awareness to the desirability of our content;\nContinuously improving our subscriber experience; and\nConverting our significant organic traffic through on-platform promotion, paywalls, and dynamic meters.\nA variety of pricing strategies are also used, including discounted introductory periods and sales, to encourage trial and habituation before transitioning to the full price rate.\nDigital Services Revenue - In 2023, digital services revenue of $19.4 million comprised 2.8% of our total operating revenue. In 2023, almost all of our digital services revenue is from BLOX Digital. BLOX Digital, operated through our 82.5% owned subsidiary INN Partners, L.C., is one of the largest web-hosting and content management SaaS providers in North America and offers state-of-the-art integrated digital publishing and content management solutions for creating, distributing, and monetizing multimedia content.\nBLOX Digital is the engine that powers our digital products. In addition, BLOX Digital services nearly 2,000 daily customers, including legacy media publications, universities, television stations and niche publications.\nIncluding intercompany revenue generated from our markets, revenue at BLOX Digital grew 13.2% in 2023 and totaled $35 million.\nWith strong product offerings, investments in video and streaming technology and diversifying the customer base into broadcast, BLOX Digital is positioned to continue to be a key component of our growth strategy.\nOther Revenue - In 2023, Other Revenue of $58.9 million comprised 8.5% of total operating revenue. Excluding digital services revenue, other revenue is comprised mainly of commercial printing and delivery of third-party products. In 2023, other revenue excluding digital services of $19.4 million, comprised 5.7% of our total operating revenue, compared to $18.0 million and 5.5% in 2022.\nWe compete with other media and digital companies for advertising and marketing spend. Our print and digital products competed with other forms of media including national media providers and amateur content creators, as well as other news and information outlets for subscription spend. The market for local digital marketing solutions is highly competitive and evolving allowing opportunities for new competitors to enter the market.\nAmplified competes with other digital marketing solutions agencies as well as other media companies which have a similar strategy for digital marketing solutions. While some of our competitors enjoy competitive advantages such as greater name recognition, longer histories as well as greater financial resources, we believe we compete favorably and our product capabilities meet customer requirements due to our data-driven, omni-channel sales approach, our experienced digital sales force and our overall customer satisfaction.\nThe number of competitors in any given market varies; however all of the forms of competition noted above exist to some degree in all of our markets.\nSTRATEGIC INITIATIVES\nWe are committed to a strategy that transforms Lee into a sustainable and growing digital business. Aligning with that commitment, our Three Pillar Digital Growth Strategy is focused on the following:\nExpand digital audiences by transforming the presentation of local news and information. We seek to maintain our dominant market position as the leading provider of news and information by providing best-in-class digital experiences to improve consumer engagement and grow our audiences. We aim to achieve this by delivering relevant, useful, and engaging content to the consumer using a multi-media approach, including video and audio.\nIn 2024, we plan to continuously improve the user experience with our digital products through targeted investments in top talent aimed at improving the mobile version of our digital products and leveraging the information we have to improve subscriber retention. Providing our local consumers with more and more high quality, trusted, engaging content is important to growing our digital audiences and driving subscription conversions.\nWe believe that our proprietary local content displayed in best-in-class multimedia platforms combined with new and engaging content and video channels will grow our audiences and increase our audience monetization capabilities.\nExpand digital subscription base and revenue. We are the fastest growing local media digital subscription business. Digital-only subscriber growth continued at a rapid pace in 2023, offsetting the declines in our traditional full access (print and digital) subscribers. Our digital audiences are comprised of full access subscribers, digital-only subscribers and non-subscribers who access our sites subject to our paywalls. More than 53% of our full access subscribers have activated their digital access, and digital-only subscribers increased 35.6% in 2023, reaching over 721,000 digital-only subscribers.\nOur acquisition and retention tactics are focused on growing our digital subscription base by using data and analytics to direct our huge addressable market of 31 million unique visitors toward obtaining a digital subscription.\nUsing these techniques, we expect digital-only subscribers to continue to grow substantially, reaching more than 1.2 million digital-only subscribers by 2028.\nWe believe our digital transformation will have a favorable impact on the environment. A key component of our digital growth strategy is to accelerate the pace of digital subscriber growth. Growing our digital revenue\nstreams as the print revenues mature will have a favorable impact on the environment as our production hubs will consume less energy, we will consume less newsprint, and there will be less environmental impact from our distribution channels that largely operate on fossil-fuel powered transportation.\nDiversify and expand offerings for local advertisers. According to eMarketer, local advertising spending is expected to reach nearly $150 billion in 2024. Our vast array of rapidly growing digital products, our large, digitally-adept salesforce and Amplified, our full service digital agency, create a powerful opportunity to gain scale both in and outside of our local markets.\nOur local sales forces are larger than any local competitor, and we believe they are the most highly trained and proficient sales force in our markets.\nWe have strong relationships with businesses in our markets and offer a wide array of products to deliver our advertisers' message.\nThrough Amplified we create sophisticated digital campaigns on our owned and operated sites and on third-party sites that give advertisers the ability to target their message to reach their desired audiences. Our sales force deploys an omni-channel sales approach that leverages the auction-based ad buying that is widely adopted by all major digital advertising channels, and tailors advertising and marketing solutions based on the size, scale, and needs of the advertiser. We collaborate with Google and other ad tech companies to provide key metrics and analytics to measure campaign effectiveness.\nBLOX Digitals represents a powerful opportunity for us to drive additional digital revenue through their SaaS content platform. In 2023, revenue at BLOX Digital, including intracompany revenue, totaled $35 million and since 2013 the compounded annual growth rate of BLOX Digital revenue has been 11.0%. Through continuous investment in product development and gaining essential technology, like world-class video and streaming technology, BLOX Digital is the leading CMS provider in the publishing CMS segment and is growing its market share in the broadcast CMS segment. In 2024, we believe we can grow revenue at BLOX Digital through modest market share gains in our core markets, increasing our average revenue per customer.\nDAILY NEWSPAPERS AND MARKETS\nThe Company, including our investments in TNI Partners (\"TNI\") in Tucson, AZ and Madison Newspapers, Inc. (\"MNI\") in Madison, WI, publish the following daily newspapers and maintain the following primary digital sites:\nAverage Units (5)\n2023 Monthly Average ('000s) (6)(7)\nNewspaper Primary Website Location Daily (3)\nSunday (3)\nUnique Visitors Page Views\nSt. Louis Post-Dispatch (1)\nstltoday.com St. Louis, MO 99,618 109,407 3,614 30,232\nBuffalo News (2)\nbuffalonews.com Buffalo, NY 69,842 89,694 2,325 21,830\nOmaha World Herald (1)\nomaha.com Omaha, NE 58,514 63,319 1,520 19,512\nWisconsin State Journal (1)(4)\nmadison.com Madison, WI 49,140 51,450 1,698 19,380\nRichmond Times-Dispatch (1)\nrichmond.com Richmond, VA 48,807 52,218 1,305 14,151\nThe Times (1)\nnwitimes.com Munster, Valparaiso, and Crown Point, IN 42,413 43,416 1,100 17,262\nArizona Daily Star (5) (1)\nazstarnet.com Tucson, AZ 39,500 45,848 1,368 13,339\nTulsa World (1)\ntulsaworld.com Tulsa, OK 33,565 36,484 1,210 9,965\nBillings Gazette billingsgazette.com Billings, MT 26,418 28,541 862 8,624\nLincoln Journal Star (1)\njournalstar.com Lincoln, NE 24,985 36,977 1,108 12,566\nQuad-City Times qctimes.com Davenport, IA 22,116 23,685 657 5,634\nThe Bismarck Tribune bismarcktribune.com Bismarck, ND 22,006 408 4,990\nAverage Units (5)\n2023 Monthly Average ('000s) (6)(7)\nNewspaper Primary Website Location Daily (3)\nSunday (3)\nUnique Visitors Page Views\nWinston Salem Journal (1)\njournalnow.com Winston-Salem, NC 19,674 20,548 693 6,081\nRoanoke Times roanoke.com Roanoke, VA 19,657 22,103 679 5,409\nLa Crosse Tribune lacrossetribune.com La Crosse, WI 18,837 - 443 4,362\nThe Press of Atlantic City pressofatlanticcity.com Atlantic City, NJ 18,294 - 726 6,631\nThe Pantagraph pantagraph.com Bloomington, IL 16,930 17,870 526 7,038\nMissoulian missoulian.com Missoula, MT 16,652 - 413 4,647\nThe Post-Star poststar.com Glens Falls, NY 15,866 - 434 4,606\nRapid City Journal rapidcityjournal.com Rapid City, SD 15,557 - 321 3,618\nGreensboro News-Record greensboro.com Greensboro, NC 15,151 16,725 578 3,741\nThe Journal Times journaltimes.com Racine, WI 14,749 15,915 405 4,274\nFreelance-Star fredericksburg.com Fredericksburg, VA 14,362 15,376 398 3,844\nIndependent Record helenair.com Helena, MT 14,083 - 316 4,063\nNapa Valley Register napavalleyregister.com Napa, CA 13,561 - 343 3,094\nDispatch-Argus qconline.com Moline, IL 13,039 13,618 226 3,131\nKenosha News kenoshanews.com Kenosha, WI 12,907 13,684 656 4,878\nWaco Tribune-Herald wacotrib.com Waco, TX 11,566 - 442 3,245\nThe Citizen auburnpub.com Auburn, NY 10,498 - 389 2,955\nThe Courier wcfcourier.com Waterloo and Cedar Falls, IA 10,342 - 386 3,510\nCharlottesville Daily Progress dailyprogress.com Charlottesville, VA 10,326 - 435 2,886\nSioux City Journal siouxcityjournal.com Sioux City, IA 10,208 - 346 2,962\nMontana Standard mtstandard.com Butte, MT 9,837 - 216 2,794\nThe Times-News magicvalley.com Twin Falls, ID 9,270 - 200 1,743\nThe Daily News tdn.com Longview, WA 9,141 - 206 1,851\nHerald & Review herald-review.com Decatur, IL 9,128 - 284 3,074\nLynchburg News & Advance newsadvance.com Lynchburg, VA 9,085 - 299 2,317\nThe Times and Democrat thetandd.com Orangeburg, SC 8,551 - 290 1,889\nHickory Daily Record hickoryrecord.com Hickory, NC 8,237 - 285 2,110\nGrand Island Independent theindependent.com Grand Island, NE 8,063 - 228 2,497\nDothan Eagle dothaneagle.com Dothan, AL 7,667 - 198 1,243\nBristol Herald Courier heraldcourier.com Bristol,VA 7,385 - 222 1,798\nCasper Star-Tribune trib.com Casper, WY 7,213 9,149 299 2,360\nCorvallis Gazette-Times gazettetimes.com Corvallis, OR 7,020 - 143 1,697\nElko Daily Free Press elkodaily.com Elko, NV 6,776 - 171 1,552\nBryan-College Station Eagle theeagle.com Bryan, TX 6,682 - 262 1,851\nAverage Units (5)\n2023 Monthly Average ('000s) (6)(7)\nNewspaper Primary Website Location Daily (3)\nSunday (3)\nUnique Visitors Page Views\nThe Sentinel cumberlink.com Carlisle, PA 6,477 - 189 1,578\nGlobe Gazette globegazette.com Mason City, IA 6,382 - 218 1,978\nThe Southern Illinoisan thesouthern.com Carbondale, IL 6,289 - 190 1,253\nAlbany Democrat-Herald democratherald.com Albany, OR 6,243 - 160 1,318\nScottsbluff Star-Herald starherald.com Scottsbluff, NE 5,690 - 134 947\nDaily Citizen wiscnews.com/bdc Beaver Dam, WI 5,372 - - -\nOpelika Auburn News oanow.com Opelika, AL 5,202 - 217 1,765\nThe News Herald morganton.com Morganton, NC 4,800 - 165 1,061\nFlorence Morning News scnow.com Florence, SC 4,787 - 195 1,263\nKearney Hub kearneyhub.com Kearney, NE 4,718 - - -\nMartinsville Bulletin martinsvillebulletin.com Martinsville, VA 4,704 - 130 966\nPortage Daily Register wiscnews.com/pdr Portage, WI 4,437 - - -\nBaraboo News Republic wiscnews.com/bnr Baraboo, WI 4,435 - - -\nStatesville Record & Landmark statesville.com Statesville, NC 3,999 - 201 993\nThe Daily Nonpareil nonpareilonline.com Council Bluffs, IA 3,944 - 126 875\nJournal Gazette & Times-Courier jg-tc.com Mattoon/Charleston, IL 3,849 - 302 2,023\nDanville Register & Bee godanriver.com Danville, VA 3,659 - 125 945\nNorth Platte Telegraph nptelegraph.com North Platte, NE 3,355 - 105 747\nColumbus Telegram columbustelegram.com Columbus, NE 3,068 - 126 919\nFremont Tribune fremonttribune.com Fremont, NE 2,984 - 155 934\nThe News Virginian newsvirginian.com Waynesboro, VA 2,875 - 90 433\nCulpeper Star-Exponent starexponent.com Culpeper, VA 2,738 - 120 559\nYork News-Times yorknewstimes.com York, NE 2,700 - 74 514\nBeatrice Daily Sun beatricedailysun.com Beatrice, NE 2,455 - 72 541\nThe McDowell News mcdowellnews.com Marion, NC 2,214 - 112 468\nThe Chippewa Herald chippewa.com Chippewa Falls, WI 2,009 - 100 673\nWinona Daily News winonadailynews.com Winona, MN 1,927 - 81 690\nMuscatine Journal muscatinejournal.com Muscatine, IA 1833 - 228 1020\nRavalli Republic ravallinews.com Hamilton, MT 707 - 64 353\n(1)Source: AAM: September 2023 Quarterly Executive Summary Data Report, unaudited\n(2)Source: AAM: March 2023 Quarterly Executive Summary Data Report, unaudited More recent data is not available\n(3)Not all newspapers are published Monday through Saturday or have a Sunday edition\n(4)Owned by MNI\n(5)Owned by Star Publishing and published through TNI\n(6)Source: Company statistics.\n(7)Excludes Agri-Media sites\nNEWSPRINT\nThe raw material of newspapers, and our other print publications, is newsprint. We purchase newsprint from U.S. and Canadian producers. We believe we will continue to receive a supply of newsprint adequate for our needs and consider our relationships with newsprint producers to be good. Newsprint purchase prices can be volatile and fluctuate based upon factors that include foreign currency exchange rates, tariffs and both foreign and domestic production capacity and consumption. Price fluctuations can affect our results of operations. We have not entered into derivative contracts for newsprint. For the quantitative impacts of these fluctuations, see Item 7A, Quantitative and Qualitative Disclosures about Market Risk, included herein.\nEMPLOYEES AND HUMAN CAPITAL RESOURCES\nWe believe the foundation of our business is the people and employees who support our business strategy. A major focus in 2023 was investing in top digital talent to carry out our Three Pillar Digital Growth Strategy and position us to achieve our long-term growth targets\nAt September 24, 2023, we had 3,342 employees, including 510 part-time employees, exclusive of TNI and MNI. Full-time equivalent employees in 2023 totaled approximately 3,171 of which 527 are represented by unions. We consider our relationships with our employees to be good. We are committed to creating an equitable and inclusive workplace that also reflects the diversity of our local readers and communities in which we serve.\nWe continue to demonstrate our commitment to diversity, equity and inclusion by assessing our hiring practices, extending our hiring reach, providing skill-building opportunities on diverse storytelling, and developing business strategies that include historically marginalized communities. These efforts and initiatives will help us reach our goal of a more diverse workforce at all levels of our company.\nCORPORATE GOVERNANCE AND PUBLIC INFORMATION\nWe have a long history of sound corporate governance practices. Currently, our Board of Directors has affirmatively determined that eight of its nine members are independent, including all members of the Board's Audit, Executive Compensation, and Nominating and Corporate Governance committees. The Audit Committee approves all services to be provided by our independent registered public accounting firm and its affiliates.\nAt www.lee.net, one may access a wide variety of information, including news releases, SEC filings, financial statistics, annual reports, investor presentations, governance documents, newspaper profiles and digital links. We make available via our website all filings made by the Company under the Securities Exchange Act of 1934 (\"Exchange Act\"), including Forms 10-K, 10-Q and 8-K, and related amendments, as soon as reasonably practicable after they are filed with, or furnished to, the SEC. All such filings are available free of charge. The content of any website referred to in this Annual Report on Form 10-K (\"Annual Report\") is not incorporated by reference unless expressly noted.\nFORWARD-LOOKING STATEMENTS\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements. This Annual Report contains information that may be deemed forward-looking that is based largely on our current expectations, and is subject to certain risks, trends and uncertainties that could cause actual results to differ materially from those anticipated. Among such risks, trends and other uncertainties, which in some instances are beyond our control, are:\nWe may be required to indemnify the previous owners of the BH Media Newspaper Business or Buffalo News for unknown legal and other matters that may arise;\nOur ability to manage declining print revenue;\nThe impact and duration of adverse conditions in certain aspects of the economy affecting our business;\nChange in advertising and subscription demand;\nChanges in technology that impact our ability to deliver digital advertising;\nPotential changes in newsprint, other commodities and energy costs;\nInterest rates;\nLabor costs;\nSignificant cyber-security breaches or failure of our information technology systems;\nOur ability to achieve planned expense reductions and realize the expected benefit of our acquisitions;\nOur ability to maintain employee and customer relationships;\nOur ability to manage increased capital costs;\nOur ability to maintain our listing status on the Nasdaq Global Select Market (\"NASDAQ\");\nCompetition; and\nOther risks detailed from time to time in our publicly filed documents, including this Annual Report and particularly in \"Risk Factors\", Part I, ITEM 1A. RISK FACTORS\nThe risks described below could materially and adversely affect our business, financial condition and results of operations. We could also be affected by additional risks that apply to all companies operating in the U.S., as well as other risks that are not presently known to us or that we currently consider to be immaterial. These Risk Factors should be carefully reviewed in conjunction with Management's Discussion and Analysis of Financial Condition and Results of Operations in Item 7 and our Financial Statements and Supplementary Data in Item 8 of this Report. For ease of review, the risk factors generally have been grouped into categories, but many of the risks described in a given category relate to multiple categories.\nRisks Related to our Business and Operations\nOur advertising revenues may decline due to weakness in the retail sector.\nA significant portion of our revenue is derived from advertising and a decline in the financial or economic conditions of our advertisers could alter discretionary spending by those advertisers. Our publications' and websites' advertisers are primarily retail businesses, which have been challenged in recent years by increased competition from online retailers. This trend has reduced and may continue to reduce advertising revenue from the brick-and-mortar retail sector. Specifically, advertising revenues may worsen if advertisers reduce their budgets, shift their spending priorities, are forced to consolidate, or cease operations.\nOur ability to generate revenue is highly sensitive to the strength of the economies in which we operate and the demographics of the local communities that we serve.\nOur advertising and marketing services revenues and subscription revenues depend upon a number of factors, including the size and demographic characteristics of the local population; the general local economic conditions; and the economic condition of the retail segments in the communities that our publications serve. In the case of an economic downturn in a market, our publications, revenues, and profitability in that market could be adversely affected. Our advertising and marketing services revenues could also be affected by negative trends in the general economy that affect consumer spending. The advertisers in our newspapers, other publications, and related websites are primarily retail businesses that can be significantly affected by regional or national economic downturns and other developments. Declines in the U.S. economy could also significantly affect key advertising revenue categories, such as help wanted, real estate, and automotive.\nUncertainty and adverse changes in the general economic conditions of markets in which we participate and increases in costs of raw materials, energy, labor and other factors may negatively affect our business.\nOur business and the companies with which we do business are subject risks and uncertainties caused by factors beyond our control. Such factors include economic pressures related to high inflation, rising interest rates, economic weakness or recession, as well as geopolitical and public health events such as the wars in Ukraine and Israel, pandemics, and workforce expectations.\nIn the past, these and other similar conditions and events have resulted in, and could lead to a tightening of credit and capital markets, lower levels of liquidity, lower consumer and business spending, unemployment, declines in real estate values, increases in employee-related costs, and other adverse economic conditions. These changes may negatively affect the sales of our products, increase exposure to losses from bad debts, increase the cost and decrease the availability of financing, or increase costs associated with publishing and distributing our publications. In addition, printing and distribution costs, including the costs of paper and ink, are a significant expense for the Company. We expect increases in these costs in the near-term from various factors, including increases in the cost of raw materials, energy, labor, transportation, and distribution, due to inflation and other adverse factors on the economy.\nIf we fail to maintain an effective system of internal control over financial reporting, we may not be able to accurately or timely report our financial results. As a result, current and potential stockholders could lose confidence in our financial reporting, which would harm the business and trading price of our common stock.\nAs a public company, we are required to maintain effective internal controls for financial reporting and disclosure controls and procedures. In particular, Section 404 of the Sarbanes-Oxley Act requires us to perform system\nand process evaluations and testing of our internal controls over financial reporting to allow management to report on the effectiveness of our internal controls over financial reporting. Compliance with Section 404 may require us to incur substantial accounting expenses and expend significant management efforts. Our testing has revealed and in the future may reveal deficiencies in our internal controls over financial reporting that are deemed to be material weaknesses. In the event we identify significant deficiencies or material weaknesses in our internal controls that we cannot remediate in a timely manner, the market price of our stock could decline if investors and others lose confidence in the reliability of our financial statements and we could be subject to sanctions or investigations by the SEC, NASDAQ, or other applicable regulatory authorities.\nWe have identified a material weakness in our internal control over financial reporting, which could result in loss of investor confidence in the Company and a negative impact on the value of our common stock.\nManagement assessed the effectiveness of our internal control over financial reporting as of September 24, 2023, and concluded we did not maintain effective internal control over financial reporting. Management did not design and implement controls to assess the reliability of certain internally generated information, or evaluate information received from certain third-party service providers, that are relevant to certain revenue recognized in the Companys consolidated financial statements. For additional information, see Item 9A, \"Controls and Procedures,\" below.\nUntil remediated, the material weakness could adversely affect our ability to report our financial condition and results of operations in a timely and accurate manner, which could negatively affect investor confidence in the Company and, in turn, the value of our common stock. While certain actions have been taken and planned to remediate and address the material weaknesses and enhance our internal control over financial reporting, we cannot be certain such remedial measures will be successful or otherwise sufficient to address the material weakness. In addition, if we are unable to remediate the material weakness, are otherwise unable to maintain effective internal control over financial reporting, or additional material weaknesses or significant deficiencies in our internal control over financial reporting are discovered or occur in the future, our ability to record, process and report financial information accurately, and to prepare financial statements within required time periods could be adversely affected, which, in addition to loss of investor confidence and a negative affect on the value of our common stock, could subject the Company to sanctions or investigations by the SEC, NASDAQ, or other regulatory authorities requiring additional financial and management resources to address.\nThe collectability of accounts receivable under adverse economic conditions could deteriorate to a greater extent than provided for in our financial statements and in our projections of future results.\nAdverse economic conditions in the U.S. may increase our exposure to losses resulting from financial distress, insolvency, and the potential bankruptcy of our advertising and marketing services customers. Our accounts receivable is stated at net estimated realizable value, and our allowance for credit losses has been determined based on several factors, including receivable agings, significant individual credit risk accounts, and historical experience. If such collectability estimates prove inaccurate, adjustments to future operating results could occur.\nThe value of our intangible assets may become further impaired, depending upon future operating results.\nAt September 24, 2023, the carrying value of our goodwill was $329.5 million, the carrying value of mastheads was $18.7 million, and the carrying value of our amortizable intangible assets was $76.3 million. The indefinite-lived assets (goodwill and mastheads) are subject to annual impairment testing and more frequent testing upon the occurrence of certain events or significant changes in our circumstances that indicate all or a portion of their carrying values may no longer be recoverable, in which case a non-cash charge to earnings may be necessary in the relevant period. We may subsequently experience market pressures which could cause future cash flows to decline below our current expectations, or volatile equity markets could negatively impact market factors used in the impairment analysis, including earnings multiples, discount rates, and long-term growth rates. Any future evaluations requiring an asset impairment charge for goodwill or other intangible assets would adversely affect future reported results of operations and stockholders equity.\nFor further information on goodwill and intangible assets, see Note 4 - Goodwill and other intangible assets.\nAttracting and retaining highly qualified personnel is difficult and costly, but the failure to do so Could negatively affect our operations.\nOur businesses depend on the efforts, abilities, and talents of our executive team and other highly qualified employees who possess substantial business, information technology, and operational knowledge. The market for such personnel, including technology-related, product and software development, data science, and digital marketing and sales roles is very competitive, and we cannot ensure success in retaining these employees or hiring and training replacement employees in a timely and cost-effective manner, particularly as we continue to focus on our digital products and services. These risks have been exacerbated by recent labor constraints, a trend of increasing employee turnover, and inflationary pressures on employee wages and benefits.\nNatural disasters, extreme weather conditions, public health emergencies or other catastrophic events could negatively affect our business, financial condition, and results of operations.\nNatural disasters and extreme weather conditions, such as hurricanes, derecho windstorms, floods, earthquakes, wildfires; acts of terrorism or violence, including active-shooter situations; and public health issues, including pandemics and quarantines, could negatively affect our operations and financial performance. Such events could result in physical damage to our properties, disruptions to our IT systems, temporary or long-term disruption in the supply of products from our suppliers, and delays in the delivery of goods to our printing facilities. Public health issues, whether occurring in the U.S. or Canada, could disrupt our operations, the operations of suppliers, or have an adverse impact on consumer spending and confidence levels.\nRisk Related to Competition from Digital Media\nOur operating revenue may be materially adversely affected if we do not successfully respond to the shift in newspaper readership and advertising expenditures away from traditional print media and towards digital media. Significant capital investments may be needed to respond to this shift.\nCurrently, a primary source of revenue is from advertising and marketing services, which accounts for 46% of our revenue. Subscription revenue accounts for 45% of our revenue. The media publishing industry has experienced rapid evolution in consumer demands and expectations due to advances in technology, which have led to a proliferation of delivery methods for news and information. The number of consumers who access online services through devices other than personal computers, such as tablets and mobile devices, has increased dramatically in recent years and likely will continue to increase. The media publishing industry also continues to be affected by demographic shifts, with older generations preferring more traditional print newspaper delivery and younger generations consuming news through digital media. Also, the revenues generated by media publishing companies have been affected significantly by the shift in advertising expenditures towards digital media.\nThe future revenue performance of our digital business depends to a significant degree upon the growth, development, and management of our subscriber and advertising audiences. The growth of our digital business over the long term depends on various factors, including, among other things, the ability to:\nContinue to increase digital audiences;\nAttract advertisers to our digital platforms;\nTailor our products to efficiently and effectively deliver content and advertising on mobile devices;\nMaintain or increase the advertising rates on our digital platforms;\nExploit new and existing technologies to distinguish our products and services from those of competitors and develop new content, products and services;\nInvest funds and resources in digital opportunities;\nPartner with, or use services from, providers that can assist us in effectively growing our digital business; and\nCreate digital content and platforms that attract and engage audiences in our markets.\nIf we are unable to grow our digital audience, distinguish our products and services from those of our competitors or develop compelling new products and services that engage users across multiple platforms, then our business, financial condition, and results of operations may be adversely affected. Responding to the changes described above may require us to make significant capital investments and incur significant research and development costs related to building, maintaining, and evolving our technology infrastructure, and our ability to make the level of investments required may be limited.\nSee Audiences in Item 1, included herein, for additional information on about our print and digital audiences.\nWe compete with a large number of companies in the local media industry, including digital media businesses and, if we are unable to compete effectively, our advertising and subscription revenues may decline.\nWe compete for audiences and advertising revenue with newspapers and other media such as web-based digital platforms (e.g., Alphabet, Amazon, Meta, TikTok etc.), magazines, broadcast, cable and satellite television, radio, direct mail, and billboards. As the use of the internet and mobile devices has increased, we have lost some classified advertising and subscribers to online advertising businesses and free Internet sites that contain abbreviated versions of our publications. Some of our current and potential competitors have greater financial and other resources than we do. If we fail to compete effectively with competing newspapers and other media, our results of operations may be materially adversely affected.\nRisks Related to Our Indebtedness\nOur Indebtedness could materially and adversely affect our business or financial condition.\nOur current indebtedness, and any future debt incurred, could have significant consequences on our future operations, including making it more difficult to satisfy our debt obligations and meet our operational goals. Our entire outstanding indebtedness is encompassed in a 25-year term loan (\"Term Loan\") with BH Finance LLC, a Nebraska limited liability company affiliated with Berkshire Hathaway, Inc. (\"BH Finance\"), which was part of a broader comprehensive refinancing of all of our then-outstanding debt, including a Credit Agreement, dated January 29, 2020 (collectively, the \"2020 Refinancing\").\nAt its inception, the aggregate principal amount and applicable interest rate of the Term Loan was $576.0 million and 9% annual rate, respectively, the proceeds of which were used to refinance our then-outstanding debt and fund the acquisition of BH Media and Buffalo News. The Term Loan is collateralized by all Company assets. Currently, the Term Note has an aggregate principal outstanding amount of $455.7 million. Our ability to make scheduled payments depends on our financial condition and operating performance, which are subject to prevailing economic and competitive conditions and to certain financial, business, competitive, legislative, regulatory, and other factors beyond our control. We may be unable to maintain a level of cash flow sufficient to permit us to pay the principal and interest on our debt.\nIf our cash flow and capital resources are insufficient to fund our debt obligations, we could face liquidity issues and be forced to reduce or delay investments, acquisitions, and capital expenditures or sell assets or operations, seek additional capital or restructure or refinance our indebtedness. We cannot assure investors we would be able to take any of these alternative actions, such actions would be permitted under the terms of the Credit Agreement, and, even if successful,, that such actions would permit us to meet our scheduled debt service obligations\nIn addition, the 2020 Refinancing terms impose operating and financial restrictions, including restrictions on incurring additional indebtedness, creating certain liens, making certain investments or acquisitions, issuing dividends, repurchasing shares of Company stock, and engaging in other capital transactions. A failure to satisfy out debt service obligations on the Term Loan could give rise to default. Moreover, these restrictions limit our flexibility in planning for or reacting to changes in our business, the economy, in general, and the economies in which we operate, which, in turn increases our vulnerability to adverse financial consequences related to such changes.\nA failure to satisfy our debt service obligations on the Term Loan could give rise to default and, in turn, the right of our lender to accelerate our indebtedness, making all principal and interest becoming due and payable.\nCertain actions, including our ability to incur additional indebtedness, require the consent of our lenders and note holders which, if not provided, would limit our ability to take advantage of future opportunities.\nThe terms of the 2020 Refinancing, limit our ability to take certain actions without requisite lender approval and modification of the loan agreements. These limitations include restrictions on incurring additional indebtedness, creating certain liens, making certain investments or acquisitions, issuing dividends, repurchasing shares of Company stock, and engaging in other capital transactions. While we have an established relationship with BH Finance, whose priorities and interests are familiar to us, there is no assurance BH Finance will approve or consent to our activities, even if the activities are in the best interests of our stockholders. If we are unable to secure the required consent of BH Finance, our ability to take advantage of future opportunities, including acquisition or financing opportunities, could be restricted.\nRisks Related to Cybersecurity\nOur business, operating results, and reputation may be negatively impacted, and we may be subject to legal and regulatory claims if there is a loss, destruction, disclosure, misappropriation, or alteration of or unauthorized access to data owned or maintained by us, or if we are the subject of a significant data breach or cyberattack.\nWe rely on our information technology and communications systems to manage our business data, including communications, news and advertising content, digital products, order entry, fulfillment and other business processes. These technologies and systems also help us manage many of our internal controls over financial reporting, disclosure controls and procedures and financial systems. Attempts to compromise information technology and communications systems occur regularly across many industries and sectors, and we may be vulnerable to security breaches resulting from accidental events (such as human error) or deliberate attacks. Moreover, the techniques used to attempt attacks and the perpetrators of such attacks are constantly expanding. We face threats both from use of malicious code (such as malware, viruses and ransomware), employee theft or misuse, advanced persistent threats, and phishing and denial-of-service attacks. The Company has complied with all applicable legal requirements relating to this activity. As cyberattacks become increasingly sophisticated, and as tools and resources become more readily available to malicious third parties, the Company will incur increased costs to secure its technology environment and there can be no guarantee that the Companys and our third-party vendors actions, security measures and controls designed to prevent, detect or respond to security breaches, to limit access to data, to prevent destruction, alteration, or exfiltration of data, or to limit the negative impact from such attacks, can provide absolute security against compromise. As a result, our business data, communications, news and advertising content, digital products, order entry, fulfillment and other business processes may be lost, destroyed, disclosed, misappropriated, altered or accessed without consent and various controls, automated procedures and financial systems could be compromised.\nA significant security breach or other successful attack could result in significant remediation costs, including repairing system damage, engaging third-party experts, deploying additional personnel or vendor support, training employees, and compensation or incentives offered to third parties whose data has been compromised. These incidents may also lead to lost revenues resulting from a loss in competitive advantage due to the unauthorized disclosure, alteration, destruction or use of business data, the failure to retain or attract customers, the disruption of critical business processes or systems, and the diversion of managements attention and resources. Moreover, such incidents may result in adverse media coverage, which may harm our reputation. These incidents may also lead to legal claims or proceedings, including regulatory investigations and actions and private lawsuits, and related legal fees, as well as potential settlements, judgments and fines. We maintain insurance, but the coverage and limits of our insurance policies may not be adequate to reimburse us for losses caused by security breaches.\nOur possession and use of personal information and the use of payment cards by our customers present risks and expenses that could harm our business. Unauthorized access to or disclosure or manipulation of such data, whether through breach of our network security or otherwise, could expose us to liabilities and costly litigation and damage our reputation.\nOur online systems store and process confidential subscriber and other sensitive data, such as names, email addresses, addresses, and other personal information. Therefore, maintaining our network security is critical. Additionally, we depend on the security of our third-party service providers. Unauthorized use of or\ninappropriate access to our, or our third-party service providers networks, computer systems and services could potentially jeopardize the security of confidential information, including payment card (credit or debit) information, of our customers. Because the techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently and often are not recognized until launched against a target, we or our third-party service providers may be unable to anticipate these techniques or to implement adequate preventative measures. A party that is able to circumvent our security measures could misappropriate our proprietary information or the information of our customers or users, cause interruption in our operations, or damage our computers or those of our customers or users. As a result of any such breaches, customers or users may assert claims of liability against us and these activities may subject us to legal claims, adversely impact our reputation, and interfere with our ability to provide our products and services, all of which may have an adverse effect on our business, financial condition and results of operations. The coverage and limits of our insurance policies may not be adequate to reimburse us for losses caused by security breaches.\nA significant number of our customers authorize us to bill their payment card accounts directly for all amounts charged by us. These customers provide payment card information and other personally identifiable information which, depending on the particular payment plan, may be maintained to facilitate future payment card transactions. Under payment card rules and our contracts with our card processors, if there is a breach of payment card information that we store, we could be liable to the banks that issue the payment cards for their related expenses and penalties. In addition, if we fail to follow payment card industry data security standards, even if there is no compromise of customer information, we could incur significant fines or lose our ability to give our customers the option of using payment cards. If we were unable to accept payment cards, our business would be seriously harmed.\nThere can be no assurance that any security measures we, or our third-party service providers, take will be effective in preventing a data breach. We may need to expend significant resources to protect against security breaches or to address problems caused by breaches. If an actual or perceived breach of our security occurs, the perception of the effectiveness of our security measures could be harmed and we could lose customers or users. Failure to protect confidential customer data or to provide customers with adequate notice of our privacy policies could also subject us to liabilities imposed by United States federal and state regulatory agencies or courts. We could also be subject to evolving state laws that impose data breach notification requirements, specific data security obligations, or other consumer privacy-related requirements. Our failure to comply with any of these laws or regulations may have an adverse effect on our business, financial condition and results of operations.\nRisks Related to Pension Liabilities\nSustained increases in funding requirements of our pension and postretirement obligations may reduce the cash available for our business.\nPension plans were in a net overfunded position of $10.3 million at September 24, 2023 compared to an underfunded position of $0.4 million at September 25, 2022.\nOur pension and postretirement plans invest in a variety of equity and debt securities. Future volatility and disruption in the securities markets could cause declines in the asset values of our pension and postretirement plans. In addition, a decrease in the discount rates or changes to mortality estimates and other assumptions used to determine the liability could increase the benefit obligation of the plans. Unfavorable changes to the plan assets and/or the benefit obligations could increase the level of required contributions above what is currently estimated, which could reduce the cash available for our business and debt service.\nWe expect to be subject to additional withdrawal liabilities in connection with multiemployer pension plans, which may reduce the cash available for our business.\nWe contributed to various multiemployer defined benefit pension plans during 2023 under the terms of collective-bargaining agreements (CBAs). For plans that are in critical status, benefit reductions may apply or we could be required to make additional contributions. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur executive offices are located in leased facilities at 4600 E. 53rd Street, Davenport, Iowa. The initial lease term expires August 1, 2029.\nWe have 19 print sites which print most of our dailies with the exception of 10 that are printed at third-party printers.\nOur newspapers and other publications have formal or informal backup arrangements for printing in the event of a disruption in production capability. ITEM 3. LEGAL PROCEEDINGS\nWe are involved in a variety of legal actions that arise in the normal course of business. Insurance coverage mitigates potential loss for certain of these matters. While we are unable to predict the ultimate outcome of these legal actions, it is our opinion that the disposition of these matters will not have a material adverse effect on our Consolidated Financial Statements, taken as a whole. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR THE REGISTRANT'S COMMON EQUITY,\nRELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur Common Stock is listed on NASDAQ.\nAt November 30, 2023, we had 4,116 registered holders of record of our Common Stock.\nOur Credit Agreement restricts us from paying dividends on our Common Stock. This restriction does not apply to dividends issued with the Company's Equity Interests or from the proceeds of a sale of the Company's Equity Interest. See Note 5 - Debt, of the Notes to Consolidated Financial Statements, included herein.\nPERFORMANCE PRESENTATION\nThe following graph compares the percentage change in the cumulative total return of the Company, the Standard & Poor's 500 Stock Index, and a peer group index, in each case for the five years ended September 24, 2023 (with September 24, 2018, as the measurement point). Total return is measured by dividing (a) the sum of (i) the cumulative amount of dividends declared for the measurement period, assuming dividend reinvestment and (ii) the difference between the issuer's share price at the end and the beginning of the measurement period, by (b) the share price at the beginning of the measurement period.\nCopyright© 2023 Standard & Poor's, a division of S&P Global. All rights reserved. ITEM 6. RESERVED ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion includes comments and analysis relating to our results of operations and financial condition as of and for the year ended September 24, 2023, and for fiscal years 2022 and 2021. This discussion should be read in conjunction with the Consolidated Financial Statements and related Notes thereto, included herein.\nCRITICAL ACCOUNTING POLICIES\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions about future events that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ significantly from those estimates. We believe the following discussion addresses our most critical accounting policies, which are those that are important to the presentation of our financial condition and results of operations and require management's most subjective and complex judgments.\nIntangible Assets, Other Than Goodwill\nLocal mastheads (e.g., publishing periodical titles, web site domain names, and trade names) are not subject to amortization. Non-amortized intangible assets are tested for impairment annually on the first day of the fourth fiscal quarter or more frequently if events or changes in circumstances suggest the asset might be impaired.\nThe quantitative impairment test consists of comparing the fair value of each masthead or domain name with its carrying amount. We use a relief from royalty approach which utilizes a discounted cash flow model to determine the fair value of each masthead, domain name, or trade name. Management's judgments and estimates of future operating results in determining the intangibles fair values are consistently applied to each underlying business in determining the fair value of each intangible asset. In 2023, 2022, and 2021, we recognized impairment charges of $7.7 million, $14.2 million, and $0.8 million, respectively. Only one of our mastheads has a fair value that is 20% over its carrying value, therefore our mastheads could experience impairment in the future if we do not achieve our revenue projections. As of September 24, 2023 the masthead carrying value is $18.7 million.\nOur amortizable intangible assets consist mainly of customer relationships including subscriber lists and advertiser relationships. These asset values are amortized systematically over their estimated useful lives. Intangible assets subject to amortization are tested for recoverability whenever events or changes in circumstances indicate that their carrying amounts may not be recoverable. The carrying amount of each asset group is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use of such asset group. In 2021, we recognized $0.2 million of impairment on intangible assets subject to amortization. There were no indicators of impairment on intangible assets subject to amortization in 2023 or 2022.\nOur quantitative impairment analysis includes several inputs that are considered estimates, these include royalty rates, discount rates, five-year revenue forecast, and long term growth rates. All of these estimates are subject to uncertainty as future results may or may not be achieved. In 2023, the royalty rates utilized range from 0% to 1.0%; a 50-basis point decrease in royalty rates would result in an additional $9.3 million of impairment. The Companys discount rate utilized in the analysis has ranged from 10.5% in 2021 to 13.0% 2023, depending on market conditions. Increasing the discount rate by 100 basis points would result in an additional $1.2 million of impairment. The Company has had various revenue forecasts utilized in the analysis over different years.\nFuture decreases in our market value, or significant differences in revenue, expenses or cash flows from estimates used to determine fair value, could result in additional masthead impairment charges in the future.\nFor information related to the Company's Goodwill impairment analysis, refer to Note 4 to the Consolidated Financial Statements.\nPension, Postretirement and Postemployment Benefit Plans\nWe, along with our subsidiaries, have various defined benefit retirement plans, postretirement plans and postemployment plans, under which substantially all of the benefits have been frozen in previous years.\nWe account for our pension, postretirement and postemployment plans in accordance with the applicable accounting guidance, which requires us to include the funded status of our pension plans in our balance sheets and to recognize, as a component of other comprehensive income (loss), the gains or losses that arise during the period but are not recognized in pension expense. The service cost component of net period benefit cost is reported on the Consolidated Statements of Income and Comprehensive Income and included in Compensation while all other components are included in other non-operating income/expense.\nThe determination of pension and postretirement plan obligations and expense is based on a number of actuarial assumptions. Two critical assumptions are the discount rates applied to pension and postretirement plan obligations and the expected long-term rate of return on plan assets.\nThe discount rate assumption is based on investment yields available at year-end on corporate bonds rated AA and above with a maturity to match the expected benefit payment stream. To determine the expected long-term rate of return of assets, we consider the current and expected asset allocations, as well as historical and expected returns on various categories of plan assets, input from the actuaries and investment consultants and long- term inflation assumptions. In 2023, we used an expected return of assets assumption of 5.0% for both our pension plan assets and our postretirement and postemployment benefit plan assets.\nA 50-basis point decrease in discount rates would result in an increase to pension and postretirement and postemployment benefits liabilities of $10.6 million. A 50-basis point decrease in expected rate of return of assets results would result in an increase to pension and postretirement and postemployment benefits expense of $1.1 million.\nIncome Taxes\nWe are subject to income taxes in the U.S. and record our tax provision for the anticipated tax consequences in our reported results of operations. Tax laws are complex and subject to different interpretations by the taxpayer and respective government taxing authorities. Significant management judgment is required in determining our provision for income taxes, deferred tax assets and liabilities, and the valuation allowance recorded against our net deferred tax assets, if any.\nOur current and deferred income tax provisions are calculated based on estimates and assumptions that could differ from the actual results reflected in income tax returns filed during the subsequent year. These estimates are reviewed and adjusted, if needed, throughout the year. Adjustments between our estimates and the actual results of filed returns are recorded when identified.\nDeferred tax assets and liabilities are determined based on the difference between the financial statement and tax basis of assets and liabilities using currently enacted tax rates. Deferred income tax assets are recognized for deductible temporary differences and loss carryforwards and deferred income tax liabilities are recognized for taxable temporary differences. Temporary differences are the difference between the reported amounts of assets and liabilities and their tax basis. Deferred income tax assets are reduced by a valuation allowance when, in our opinion, it is more likely than not that some portion or all of the deferred income tax assets will not be realized. Deferred income tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nWe recognize the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs. We record interest and penalties related to unrecognized tax benefits as a component of income tax expense.\nIMPACT OF RECENTLY ISSUED ACCOUNTING STANDARDS\nSee Note 1 to the Consolidated Financial Statements for a description of new accounting standards issued and/or adopted in the year ended September 24, 2023.\nOPERATIONS\nOperating results, as reported in the Consolidated Financial Statements, are summarized below:\n(Thousands of Dollars, Except Per Common Share Data) 2023 2022 Percent Change 2021 Percent Change\nOperating revenue:\nPrint advertising revenue 125,804 184,963 (32.0) % 227,892 (18.8) %\nDigital advertising revenue 193,173 181,465 6.5 % 141,391 28.3 %\nAdvertising and marketing services revenue 318,977 366,428 (12.9) % 369,283 (0.8) %\nPrint subscription revenue 252,591 313,504 (19.4) % 329,484 (4.9) %\nDigital subscription revenue 60,700 40,120 51.3 % 28,229 42.1 %\nSubscription revenue 313,291 353,624 (11.4) % 357,713 (1.1) %\nPrint other revenue 39,508 42,962 (8.0) % 48,656 (11.7) %\nDigital other revenue 19,362 17,955 7.8 % 18,997 (5.5) %\nOther revenue 58,870 60,917 (3.4) % 67,653 (10.0) %\nTotal operating revenue 691,138 780,969 (11.5) % 794,649 (1.7) %\nOperating expenses:\nCompensation 266,907 317,789 (16.0) % 330,896 (4.0) %\nNewsprint and ink 25,346 30,101 (15.8) % 29,775 1.1 %\nOther operating expenses 323,067 344,905 (6.3) % 325,597 5.9 %\nDepreciation and amortization 30,621 36,544 (16.2) % 42,841 (14.7) %\nAssets loss (gain) on sales, impairments and other 1,882 9,716 (80.6) % 8,214 NM\nRestructuring costs and other 12,673 22,720 (44.2) % 7,182 216.3 %\nTotal operating expenses 660,496 761,775 (13.3) % 744,505 2.3 %\nEquity in earnings of associated companies 6,527 5,657 15.4 % 6,412 (11.8) %\nOperating income 37,169 24,851 49.6 % 56,556 (56.1) %\nNon-operating income (expense):\nInterest expense (41,471) (41,770) (0.7) % (44,773) (6.7) %\nCurtailment gain - 1,027 (100.0) % 23,830 NM\nPension withdrawal cost (1,200) (2,335) (48.6) % (12,862) NM\nPension and OPEB related benefit (cost) and other, net 2,420 19,022 (87.3) % 9,296 104.6 %\nTotal non-operating expense, net (40,251) (24,056) 67.3 % (24,509) (1.8) %\n(Loss) income before income taxes (3,082) 795 (487.7) % 32,047 NM\nIncome tax (benefit) expense (349) 698 (150.0) % 7,255 (90.4) %\nNet (loss) income (2,733) 97 (2917.4) % 24,792 NM\nEarnings (loss) per common share:\nBasic (0.90) (0.35) 156.5 % 3.98 NM\nDiluted (0.90) (0.35) 156.5 % 3.90 NM\nWe acquired or disposed of certain properties in each of 2023, 2022 and 2021.\nOPERATING REVENUE\nRevenue Comparison 2023-2022\nTotal operating revenue totaled $691.1 million in 2023, down $89.8 million, or 11.5%, compared to 2022.\nAdvertising and marketing services revenue totaled $319.0 million in 2023, down $47.5 million, or 12.9% compared to 2022.\nPrint advertising revenues were $125.8 million in 2023, down $59.2 million, or 32.0% compared to 2022. The decline is due to the secular downward trend in print advertising.\nDigital advertising and marketing services revenue totaled $193.2 million in 2023, up 6.5% compared to 2022. Digital advertising and marketing services revenue represented 60.6% of 2023 total advertising and marketing services revenue compared to 49.5% in 2022. The increase in digital advertising is due to growth at Amplified, our full service digital marketing service. Revenue at Amplified increased 20.3% in 2023 totaling $91.2 million.\nSubscription revenue totaled $313.3 million in 2023, or down 11.4%, compared to 2022. The change in subscription revenue is due to decline in full access volume, consistent with historical and industry trends. The decrease was partially offset by growth in selective price increases on our full access subscriptions and in digital-only subscribers and digital-only revenue which were up 35.6% and 51.0%, respectively. As of September 2023, we had over 721,000 digital-only subscribers compared to 532,000 in 2022.\nOther revenue, which primarily consist of digital services revenue from BLOX Digital and commercial printing revenue totaled $58.9 million, a 3.4% decrease compared to 2022. Digital services revenue totaled $19.4 million in 2023, a 7.8% increase compared to 2022. Commercial printing revenue totaled $20.1 million in 2023, a 6.2% decline from 2022.\nRevenue at BLOX Digital, including intercompany revenue, totaled $35.0 million, an increase of 13.2%, due to increased market share and increases in average revenue per user due to additional value-added service offerings.\nTotal digital revenue including digital advertising revenue, digital-only subscription revenue and digital services revenue totaled $273.2 million in 2023, a 14.1% increase over 2022, and represented 39.5% of our total operating revenue in 2023, compared to 30.7% in 2022.\nRevenue Comparison 2022-2021\nTotal operating revenue totaled $781.0 million in 2022, down $13.7 million, or 1.7%, compared to 2021. Advertising and marketing services revenue totaled $366.4 million in 2022, down 0.8% compared to 2021. Print advertising revenues were $185.0 million in 2022, down $42.9 million, or 18.8% compared to 2021. The decline is due to the secular downward trend in print advertising.\nDigital advertising and marketing services revenue totaled $181.5 million in 2022, up 28.3% compared to 2021. Digital advertising and marketing services revenue represented 49.5% of 2022 total advertising and marketing services revenue compared to 38.3% in 2021. The increase in digital advertising is due to growth at Amplified, our full service digital marketing service. Revenue at Amplified increased 82.9% in 2022 totaling $75.8 million.\nSubscription revenue totaled $353.6 million in 2022, or down 1.1%, compared to 2021. The change in subscription revenue is due to decline in full access volume, consistent with historical and industry trends. The decrease was partially offset by growth in selective price increases on our full access subscriptions and in digital-only subscribers and digital-only revenue which were up 65% and 26%, respectively. As of September 2022, we had 532,000 digital-only subscribers compared to 402,000 in 2021.\nOther revenue, which primarily consist of digital services revenue from BLOX Digital and commercial printing revenue totaled $60.9 million, a 10.0% decrease compared to 2021. Digital services revenue totaled $17.9 million in 2022, a 5.4% decrease compared to 2021. Commercial printing revenue totaled $21.5 million in 2022, a 14.4% decline from 2021.\nRevenue at BLOX Digital, including intercompany revenue, totaled $30,906,000, an increase of 13.6%, due to increased market share and increases in average revenue per user due to additional value-added service offerings.\nTotal digital revenue including digital advertising revenue, digital-only subscription revenue and digital services revenue totaled $239.5 million in 2022, a 27.0% increase over 2021, and represented 30.7% of our total operating revenue in 2022, compared to 23.7% in 2021.\nOPERATING EXPENSES\nOperating Expense Comparison 2023-2022\nTotal operating expenses were $660.5 million, a 13.3% decrease compared to 2022. Cash Costs (a non-GAAP financial measure discussed below) were $615.3 million, a 11.2% decrease compared to 2022.\nCompensation expense decreased $50.9 million in 2023, or a 16.0% decrease compared to 2022. The decrease is attributable to reductions in full time employees (\"FTEs\") due to continued business transformation efforts, partially offset by investments in digital talent.\nNewsprint and ink costs decreased $4.8 million in 2023, or a 15.8% decrease compared to 2022. This decrease was attributable to declines in newsprint volumes partially offset by higher newsprint prices. See Item 7A, Commodities, included herein, for further discussion and analysis of the impact of newsprint on our business.\nOther operating expenses decreased $21.8 million in 2023, or a 6.3% decrease compared to 2022. Other operating expenses include all operating costs not considered to be compensation, newsprint and ink, depreciation and amortization, or restructuring costs and other. The largest components are costs associated with printing and distribution of our printed products, digital investments, digital cost of goods sold and facility expenses. The decrease is attributable to other print-related costs due to lower volumes of our print products partially offset by increases in investments to fund our digital growth strategy.\nRestructuring costs and other totaled $12.7 million and $22.7 million in 2023 and 2022, respectively. Restructuring costs and other in 2023 are predominately severance. Restructuring costs and other in 2022 include severance costs, litigation expenses, restructuring expenses, and advisor expenses associated with the unsolicited offer in November 2021.\nDepreciation expense decreased $2.8 million, or 19.2%, in 2023. Amortization expense decreased $3.2 million, or 14.3%, in 2023.\nAssets loss (gain) on sales, impairments and other was a net loss of $1.9 million in 2023 compared to a net loss of $9.7 million in 2022. Impairment losses in 2023 totaled $7.7 million for mastheads. Impairment losses in 2022 totaled $13.5 million for mastheads, $7.8 million for leases, and $0.7 million for the disposal of a non-core business, respectively. Assets loss (gain) on sales are part the Company's ongoing real estate and non-core asset monetization. They totaled a net gain of $6.0 million in 2023 and a net gain of $12.3 million in 2022.\nOperating Expense Comparison 2022-2021\nTotal operating expenses were $761.8 million, a 2.3% increase compared to 2021. Cash Costs were $692.8 million, a 1.0% increase compared to 2021.\nCompensation expense decreased $13.1 million in 2022, or a 4.0% decrease compared to 2021. The decrease is attributable to reductions in FTEs due to continued business transformation efforts, partially offset by investments in digital talent.\nNewsprint and ink costs increased $0.3 million in 2022, or a 1.1% increase compared to 2021. This increase was attributable to higher newsprint prices offset by a decline in newsprint volumes. See Item 7A, Commodities, included herein, for further discussion and analysis of the impact of newsprint on our business.\nOther operating expenses increased $19.3 million in 2022, or a 5.9% increase compared to 2021. Other operating expenses include all operating costs not considered to be compensation, newsprint and ink, depreciation and amortization, or restructuring costs and other. The largest components are costs associated\nwith printing and distribution of our printed products, digital investments, digital cost of goods sold and facility expenses. The increase is attributable to increases in investments to fund our digital growth strategy partially offset by lower delivery and other print-related costs due to lower volumes of our print products.\nRestructuring costs and other totaled $22.7 million and $7.2 million in 2022 and 2021, respectively. Restructuring costs and other in 2022 include severance costs, litigation expenses, restructuring expenses, and advisor expenses associated with the unsolicited offer in November 2021. Restructuring costs and other in 2021 are predominately severance.\nDepreciation expense decreased $3.6 million, or 20.1%, in 2022. Amortization expense decreased $2.7 million, or 10.8%, in 2022.\nAssets loss (gain) on sales, impairments and other was a net loss of $9.7 million in 2022 compared to a net loss of $8.2 million in 2021. Impairment losses in 2022 totaled $13.5 million for mastheads, $7.8 million for leases, and $0.7 million for the disposal of a non-core business, respectively. Impairment losses in 2021 totaled $1.0 million for mastheads. Assets loss (gain) on sales are part the Company's ongoing real estate and non-core asset monetization. They totaled a net gain of $12.3 million in 2022 and a net loss of $7.2 million in 2021.\nEquity In Equity Investments\nEquity in earnings of TNI and MNI increased $0.9 million in 2023, or 15.4%, compared to 2022. Equity in earnings of TNI and MNI decreased $0.8 million in 2022 compared to 2021.\nNON-OPERATING INCOME AND EXPENSES\nNon-operating Income and Expense Comparison 2023-2022\nInterest expense decreased $0.3 million, or 0.7%, to $41.5 million in 2023 due to lower debt balances. Our weighted average cost of debt, excluding amortization of debt financing cost, was 9.0% in 2023 and 2022.\nIncluded in other non-operating income and expense is income related to our defined benefit pension plans and other postemployment benefit plans, which totaled $1.2 million and $20.5 million in 2023 and 2022, respectively. We recognized pension withdrawal costs in 2023 and 2021 of $1.2 million and $12.9 million, respectively, in connection with the withdrawal from pension plans that covered certain employees. No withdrawal costs were recognized in 2022. The withdrawal liabilities will be paid over the next 20 years.\nAs more fully discussed in Note 5 of the Notes to the Consolidated Financial Statements, included herein, we recorded a liability for the Warrants, issued in connection with the Warrant Agreement in previous years. We re-measured the liability to fair value each reporting period, with changes reported in other non-operating income (expenses). Due to the fluctuation in the price of our Common Stock and changes in interest rates, the estimated fair value of the warrant liability can change each period. We recorded non-operating income of $0.1 million and $0.3 million in 2022 and 2021 respectively, due to the change in fair value of the Warrants.\nNon-operating Income and Expense Comparison 2022-2021\nInterest expense decreased $3.0 million, or 6.7%, to $41.8 million in 2022 due to lower debt balances. Our weighted average cost of debt, excluding amortization of debt financing cost, was 9.0% in 2022 and 2021.\nIncluded in other non-operating income and expense is income related to our defined benefit pension plans and other postemployment benefit plans, which totaled $20.5 million and $33.3 million in 2022 and 2021, respectively. We recognized a non-cash curtailment gain of $23.8 million and a reduction in our benefit obligation in 2021 by eliminating postretirement medical coverage for certain employees. We recognized pension withdrawal costs in 2021 of $12.9 million in connection with the withdrawal from pension plans that covered certain employees. The withdrawal liabilities will be paid over the next 20 years.\nDuring 2022 we notified certain participants in our defined benefit plans of changes to be made to the plans. The Company froze future benefits for four of the defined benefit plans. The freeze of future benefits resulted in a non-cash curtailment gain of $1.0 million related to the four plans. In connection with the freeze, the Company provided certain plan enhancements that resulted in an increase to our net pension liability and a decrease to Accumulated Other Comprehensive income of $6.1 million. Additionally, the Company merged the six frozen plans into one defined benefit plan effective in the second quarter of fiscal 2022.\nDuring September of 2022, the Company, as sponsor of the Lee Enterprises Incorporated Pension Plan (the \"Plan\") executed an agreement pursuant to which the Plan used a portion of its assets to purchase annuities from an insurance company (the \"Insurer\") and thereby assumed $85.6 million of the Plan's liabilities in exchange for $81.4 million of Plan assets. The non-cash settlement gain of $4.2 million is recorded in Pension and OPEB related benefit (cost) and other, net.\nAs more fully discussed in Note 5 of the Notes to the Consolidated Financial Statements, included herein, we recorded a liability for the Warrants, issued in connection with the Warrant Agreement in previous years. We re-measured the liability to fair value each reporting period, with changes reported in other non-operating income (expenses). Due to the fluctuation in the price of our Common Stock and changes in interest rates, the estimated fair value of the warrant liability can change each period. We recorded non-operating income of $0.1 million and $0.3 million in 2022 and 2021 respectively, due to the change in fair value of the Warrants.\nINCOME TAX EXPENSES\nIn 2023, we recorded income tax benefit of $0.3 million, or 11.3% of pretax loss and in 2022, we recorded an income tax expense of $0.7 million, or 87.8% of pretax income. In 2021, we recorded an income tax expense of $7.3 million, or 22.6% of pre-tax income. See Note 12 of the Notes to the Consolidated Financial Statements, included herein, for a discussion of the difference between the expected federal income tax rate and the actual tax rates.\nNET INCOME AND EARNINGS PER SHARE\nNet loss was $2.7 million in 2023 compared to net income of $0.1 million in 2022. In 2021, net income was $24.8 million.\nLosses per share was $0.90 per share in 2023 compared to losses per share of $0.35 per share in 2022. In 2021, diluted earnings per share were $3.90 per share.\nNON-GAAP FINANCIAL MEASURES\nWe use non-GAAP financial performance measures to supplement the financial information presented on a GAAP basis. These non-GAAP financial measures should not be considered in isolation or as a substitute for the relevant GAAP measures and should be read in conjunction with information presented on a GAAP basis.\nIn this report, we present Adjusted EBITDA and cash costs, which are non-GAAP financial performance measures that exclude from our reported GAAP results the impact of certain items consisting primarily of restructuring charges and non-cash charges. We believe such expenses, charges, and gains are not indicative of normal, ongoing operations, and their inclusion in results makes for more difficult comparisons between years and with peer group companies. In the future, however, we are likely to incur expenses, charges, and gains similar to the items for which the applicable GAAP financial measures have been adjusted and to report non-GAAP financial measures excluding such items. Accordingly, exclusion of those or similar items in our non-GAAP presentations should not be interpreted as implying the items are non-recurring, infrequent, or unusual.\nWe define our non-GAAP measures, which may not be comparable to similarly titled measures reported by other companies, as follows:\nAdjusted EBITDA is a non-GAAP financial performance measure that enhances financial statement users' overall understanding of the operating performance of the Company. The measure isolates unusual, infrequent, or non-cash transactions from the operating performance of the business. This allows users to easily compare operating performance among various fiscal periods and how management measures the performance of the business. This measure also provides users with a benchmark that can be used when forecasting future operating performance of the Company that excludes unusual, nonrecurring or one-time transactions. Adjusted EBITDA is also a component of the calculation used by stockholders and analysts to determine the value of our business when using the market approach, which applies a market multiple to financial metrics. It is also a measure used to calculate the leverage ratio of the Company, which is a key financial ratio monitored and used by the Company and its investors. Adjusted EBITDA is defined as net income (loss), plus non-operating expenses, income tax expense, depreciation and amortization, assets loss (gain) on sales, impairments\nand other, restructuring costs and other, stock compensation and our 50% share of EBITDA from TNI and MNI, minus equity in earnings of TNI and MNI.\nCash Costs represent a non-GAAP financial performance measure of operating expenses which are measured on an accrual basis and settled in cash. This measure is useful to investors in understanding the components of the Companys cash-settled operating costs. Cash Costs can be used by financial statement users to assess the Company's ability to manage and control its operating structure. Cash Costs are defined as compensation, newsprint and ink and other operating expenses. Depreciation and amortization, assets loss (gain) on sales, impairments and other, restructuring costs and other non-cash operating expenses and other non-operating expenses are excluded.\nTables reconciling Adjusted EBITDA to net income and Cash Costs to operating expenses, the most directly comparable measure under GAAP, are set forth below under the caption \"Reconciliation of Non-GAAP Financial Measures\".\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\n(UNAUDITED)\nThe table below reconciles the non-GAAP financial performance measure of Adjusted EBITDA to net income, the most directly comparable GAAP measure:\n(Thousands of Dollars) 2023 2022 2021\nNet (loss) income (2,733) 97 24,792\nAdjusted to exclude\nIncome tax (benefit) expense (349) 698 7,255\nNon-operating expenses, net 40,251 24,056 24,509\nEquity in earnings of TNI and MNI (6,527) (5,657) (6,412)\nAssets loss (gain) on sales, impairments and other, net 1,882 9,716 8,214\nDepreciation and amortization 30,621 36,544 42,841\nRestructuring costs and other 12,673 22,720 7,182\nStock compensation 1,806 1,337 854\nAdd:\nOwnership share of TNI and MNI EBITDA (50%) 7,604 6,541 7,317\nAdjusted EBITDA 85,228 96,052 116,552\nThe table below reconciles the non-GAAP financial performance measure of Cash Costs to Operating expenses, the most directly comparable GAAP measure:\n(Thousands of Dollars) 2023 2022 2021\nOperating expenses 660,496 761,775 744,505\nAdjustments\nDepreciation and amortization 30,621 36,544 42,841\nAssets (gain) loss on sales, impairments and other, net 1,882 9,716 8,214\nRestructuring costs and other 12,673 22,720 7,182\nCash Costs 615,320 692,795 686,268\nLIQUIDITY AND CAPITAL RESOURCES\nOur operations have historically generated positive cash flow, and are expected to continue providing sufficient liquidity, together with cash on hand, to meet our future cash requirements, which primarily relate to operating expenses, interest expense and capital expenditures. A summary of our cash flows is included in the narrative below.\nOperating Activities\nCash required for operating activities totaled $2.5 million in 2023 compared to cash provided by operating activities of $3.4 million in 2022, a decrease of $6.0 million. The decrease was primarily driven by a decrease in operating results of $18.2 million (defined as net income (loss) adjusted for non-working capital items) and partially offset by an increase in cash from working capital of $12.3 million, primarily related to favorable changes in accounts receivable and inventories, offset by unfavorable changes in unearned revenue, accrued interest, and pension and postretirement obligations.\nCash provided by operating activities totaled $3.4 million in 2022 compared to $50.1 million in 2021, a decrease of $46.6 million. The decrease was primarily driven by a decrease in operating results of $25.4 million (defined as net income (loss) adjusted for non-working capital items) and a decrease in cash from working capital of $21.2 million, primarily related to unfavorable changes in accounts receivable and income taxes payable, partially offset by favorable changes in accounts payable and pension and postretirement obligations.\nInvesting Activities\nCash provided by investing activities totaled $8.0 million in 2023 and $6.3 million in 2022. Capital spending totaled $5.1 million and $7.5 million in 2023 and 2022, respectively. Proceeds from sales of assets totaled $12.0 million and $14.8 million in 2023 and 2022, respectively.\nCash provided by investing activities totaled $6.3 million in 2022 and cash required for investing activities totaled $2.3 million in 2021. Capital spending totaled $7.5 million in 2022 and 2021, respectively. Proceeds from sales of assets totaled $14.8 million and $4.6 million in 2022 and 2021, respectively.\nWe anticipate that funds necessary for capital expenditures, which are expected to be $10.0 million in 2024, and other requirements, will be available from internally generated funds.\nFinancing Activities\nCash required for financing activities totaled $7.1 million in 2023 and $19.7 million in 2022 and $55.4 million in 2021. Debt reduction accounted for the majority of the usage of funds in 2023, 2022 and 2021, respectively.\nExcluding payments required from the Company's future excess cash flow (as defined in Note 5), the only required principal payments include payments from net cash proceeds from asset sales (as defined in the Credit Agreement) and payments upon certain instances of change in control. Current maturities of long-term debt are from excess cash flows. There are no other scheduled mandatory principal payments required under the Credit Agreement.\nLiquidity\nOur liquidity, consisting of cash on the balance sheet, totaled $14.5 million at September 24, 2023. This liquidity amount excludes any future cash flows from operations. We expect all interest and principal payments due in the next twelve months will be satisfied by existing cash and our cash flows, which will allow us to maintain an adequate level of liquidity.\nAt September 24, 2023, the principal amount of our outstanding debt totals $455.7 million.\nThe 2020 Refinancing as defined in Note 5, significantly extended our debt maturity profile with final maturity of our debt in 2045.\nSEASONALITY\nOur largest source of advertising and marketing services revenue, retail advertising, is seasonal and tends to fluctuate with retail sales in markets served. Historically, retail advertising is higher in the December and June quarters. Advertising and marketing services revenue is lowest in the March quarter.\nINFLATION\nPrice increases (or decreases) for our products are implemented when deemed appropriate by us. We continuously evaluate price increases, productivity improvements, sourcing efficiencies and other cost reductions to mitigate the impact of inflation.\nCONTRACTUAL OBLIGATIONS\nThe following table summarizes our significant contractual obligations at September 24, 2023:\n(Thousands of Dollars) Payments (or Commitments) Due (Years)\nNature of Obligation Total Less\nThan 1 1-3 3-5 More\nThan 5\nDebt (Principal Amount) (1)\n455,741 - - - 455,741\nInterest expense (2)\n881,859 41,017 123,050 123,050 594,742\nOperating lease obligations 57,142 12,179 20,329 14,025 10,609\nWithdrawal liabilities 27,305 1,564 3,127 3,127 19,487\nCapital expenditure commitments 3,707 3,707 - - -\n1,425,754 58,467 146,506 140,202 1,080,579\n(1)Maturities of long-term debt are presented based on mandatory payments. See Note 5 of the Notes to the Consolidated Financial Statements, included herein.\n(2)Interest expense includes an estimate of interest expense for the Term Note, until its maturity in March 2045. Interest expense under the Term Note is estimated using the 9.0% contractual rate applied to the outstanding balance as reduced by future contractual maturities of such debt. See Note 5 of the Notes to Consolidated Financial Statements, included herein.\nThe table above excludes future cash requirements for pension, postretirement and postemployment obligations. The periods in which these obligations will be settled in cash are not readily determinable and are subject to numerous future events and assumptions. See Notes 7 and 8 of the Notes to the Consolidated Financial Statements, included herein.\nThe contractual obligations above exclude unrecognized tax benefits to be recorded in accordance with Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") Topic 740, Income Taxes. We are unable to reasonably estimate the ultimate amount or timing of cash settlements with the respective taxing authorities for such matters. A substantial amount of our deferred income tax liabilities will not result in future cash payments. See Note 12 of the Notes to the Consolidated Financial Statements, included herein.  ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nInformation with respect to this Item is included herein under the caption Consolidated Financial Statements. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS\nON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we concluded an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) promulgated under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\").\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures include controls and procedures designed to ensure that information required to be disclosed in our Companys reports filed under the Exchange Act is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. Based on this evaluation the Company identified a material weakness in its internal control over financial reporting. Due to the material weakness, our principal executive officer and our principal financial officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were not effective.\nIn light of the material weakness described below, management performed additional analysis and monitoring procedures around third-party data to ensure that our interim and annual consolidated financial statements were prepared in accordance with U.S. GAAP. Accordingly, management believes that the consolidated financial statements included in this Annual Report on Form 10-K fairly present, in all material respects, our financial position, results of operations, and cash flows as of and for the periods presented, in accordance with U.S. GAAP.\nManagement's Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Rule 13a-15(f) of the Exchange Act. Any internal control system, no matter how well designed, has inherent limitations and may not prevent or detect misstatements. Accordingly, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nUnder the supervision and with the participation of our senior management, including our Chief Executive Officer and Chief Financial Officer, we assessed the effectiveness of our internal control over financial reporting as of the September 24, 2023 (the \"Evaluation Date\"), using the criteria set forth in the Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management has concluded that our internal control over financial reporting was not effective as of the Evaluation Date due to a material weakness in the Company's internal control over financial reporting described below. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the Company's annual or interim financial statements will not be prevented or detected on a timely basis.\nThe material weakness identified by the Company is as follows:\nManagement did not design and implement controls to assess the reliability of certain internally generated information, or evaluate information received from certain third-party service providers, that are relevant to certain revenue recognized in the Company's Consolidated Financial Statements.\nManagement previously reported this material weakness in Item 9A of our Annual Report on Form 10-K for the fiscal year ended September 25, 2022. The description of the material weakness has been updated to reflect information learned during the remediation process executed in fiscal 2023.\nBDO USA, P.C., our independent registered public accounting firm, has issued a report on our internal control over financial reporting as of September 24, 2023, which is included herein. As a result of the material weakness described above, such report includes an adverse audit report on the effectiveness of internal control over financial reporting as of September 24, 2023.\nRemediation Plans and Actions\nManagement is committed to remediating the material weakness that has been identified and maintaining an effective system of disclosure controls and procedures. During fiscal 2023, management executed certain actions steps to remediate the material weakness, including:\nEstablished a project team to review, evaluate and remediate the material weakness in internal controls over financial reporting. The Company's recently expanded Corporate Compliance function is leading management's efforts related to effective control design, documentation and implementation, as well as remediate ineffective controls.\nEnhanced the design of internal controls around evaluating data provided by third-parties, which included the initial implementation of a new revenue IT system.\nManagement will continue to execute the remediation steps outlined above until the material weakness is remediated. The material weakness will not be considered remediated until the remediated and/or newly implemented internal controls operate for a sufficient period of time and management has concluded, through testing, that these internal controls are operating effectively. We are working to have the material weakness remediated as soon as possible.\nRemediation of Previously Reported Material Weaknesses\nAs previously reported in Item 9A of our Annual Report on Form 10-K for the fiscal year ended September 25, 2022, management had concluded we had material weaknesses in internal control over financial reporting, specific to a) the Company's information technology general controls and b) controls to validate the accuracy of the tax basis associated with certain deferred tax assets and liabilities. To address the material weaknesses, during the fiscal year ended September 24, 2023 we (a) established a project team to review, evaluate, and remediate material weaknesses in internal controls over financial reporting including expanding our Corporate Compliance function, (b) underwent a complete user access review related to our information technology systems, (c) conducted additional training to relevant personnel, (d) enhanced existing internal control design, and (e) enhanced our record retention policy specifically around complex tax items.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nOther than as described above, there have been no changes in our internal control over financial reporting that occurred during the 13 weeks ended September 24, 2023 that have materially affected or are reasonably likely to materially affect our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nStockholders and Board of Directors\nLee Enterprises, Incorporated\nDavenport, Iowa\nOpinion on Internal Control over Financial Reporting\nWe have audited Lee Enterprises, Incorporateds (the Company) internal control over financial reporting as of September 24, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (the COSO criteria). In our opinion, the Company did not maintain, in all material respects, effective internal control over financial reporting as of September 24, 2023, based on the COSO criteria.\nWe do not express an opinion or any other form of assurance on managements statements referring to any corrective actions taken by the Company after the date of managements assessment.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 24, 2023 and September 25, 2022, the related consolidated statements of income (loss) and comprehensive income (loss), stockholders equity (deficit), and cash flows for the fiscal years ended September 24, 2023 and September 25, 2022, and the related notes (collectively referred to as the consolidated financial statements) and our report dated December 8, 2023, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Item 9A, Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit of internal control over financial reporting in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. A material weakness was identified regarding the following:\na.Management did not design and implement controls to assess the reliability of certain internally generated information, or evaluate information received from certain third-party service providers, that are relevant to certain revenue recognized in the Companys consolidated financial statements.\nThis material weakness was considered in determining the nature, timing, and extent of audit tests applied in our audit of the consolidated financial statements, and this report does not affect our report dated December 8, 2023, on those consolidated financial statements.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ BDO USA, P.C.\nChicago, Illinois\nDecember 8, 2023 ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation with respect to this Item, except for certain information related to our executive officers included under the caption Executive Team in Part I of this Annual Report, is included in our Proxy Statement to be filed in January 2024, which is incorporated herein by reference, under the captions Proposal 1 - Election of Directors and Section 16(a) Beneficial Ownership Reporting Compliance. Our executive officers are those elected officers whose names and certain information are set forth under the caption Executive Team in Part 1 of this Annual Report.\nWe have a Code of Business Conduct and Ethics (\"Code\") that applies to all of our employees, including our principal executive officer, and principal financial and accounting officer. The Code is monitored by the Audit Committee of our Board of Directors and is annually affirmed by our directors and executive officers. We maintain a corporate governance page on our website which includes the Code. The corporate governance page can be found at www.lee.net by clicking on Governance under the \"About\" tab. A copy of the Code will also be provided without charge to any stockholder who requests it. Any future amendment to, or waiver granted by us from, a provision of the Code will be posted on our website. ITEM 11. EXECUTIVE COMPENSATION\nInformation with respect to this Item is included in our Proxy Statement to be filed in January 2024, which is incorporated herein by reference, under the captions, Compensation of Non-Employee Directors, Executive Compensation and Compensation Discussion and Analysis; provided, however, that the subsection entitled Executive Compensation - Executive Compensation Committee Report shall not be deemed to be incorporated by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nAND RELATED STOCKHOLDER MATTERS\nInformation with respect to this Item is included in our Proxy Statement to be filed in January 2024, which is incorporated herein by reference, under the captions Voting Securities and Principal Holders Thereof and Equity Compensation Plan Information. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nAND DIRECTOR INDEPENDENCE\nInformation with respect to this Item is included in our Proxy Statement to be filed in January 2024, which is incorporated herein by reference, under the caption Directors' Meetings and Committees of the Board of Directors. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation with respect to this Item is included in our Proxy Statement to be filed in January 2024, which is incorporated herein by reference, under the caption Relationship with Independent Registered Public Accounting Firm.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nThe following documents are filed as part of this Annual Report:\nFINANCIAL STATEMENTS\nConsolidated Statements of Income (Loss) and Comprehensive Income (Loss) - 52 weeks ended September 24, 2023, 52 weeks ended September 25, 2022 and 52 weeks ended September 26, 2021\nConsolidated Balance Sheets - September 24, 2023 and September 25, 2022\nConsolidated Statements of Stockholders' Equity (Deficit) - 52 weeks ended September 24, 2023, 52 weeks ended September 25, 2022 and 52 weeks ended September 26, 2021\nConsolidated Statements of Cash Flows - 52 weeks ended September 24, 2023, 52 weeks ended September 25, 2022 and 52 weeks ended September 26, 2021\nNotes to Consolidated Financial Statements\nReports of Independent Registered Public Accounting Firms*\n*BDO USA, P.C. Chicago, IL; PCAOB Firm ID#243\n*KPMG LLP, Chicago, IL; PCAOB Firm ID#185\nFINANCIAL STATEMENT SCHEDULES\nAll schedules have been omitted as they are not required, not applicable, not deemed material or because the information is included in the Notes to Consolidated Financial Statements, included herein.\nEXHIBITS\nSee Exhibit Index, included herein.\nCONSOLIDATED FINANCIAL STATEMENTS PAGE\nConsolidated Statements of Income (Loss) and Comprehensive Income (Loss)\nConsolidated Balance Sheets\nConsolidated Statements of Stockholders' Equity (Deficit)\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nReports of Independent Registered Public Accounting Firm's\nCONSOLIDATED STATEMENTS OF INCOME (LOSS) AND COMPREHENSIVE INCOME (LOSS)\n(Thousands of Dollars, Except Per Common Share Data) 2023 2022 2021\nOperating revenue:\nAdvertising and marketing services 318,977 366,428 369,283\nSubscription 313,291 353,624 357,713\nOther 58,870 60,917 67,653\nTotal operating revenue 691,138 780,969 794,649\nOperating expenses:\nCompensation 266,907 317,789 330,896\nNewsprint and ink 25,346 30,101 29,775\nOther operating expenses 323,067 344,905 325,597\nDepreciation and amortization 30,621 36,544 42,841\nAssets loss (gain) on sales, impairments and other, net 1,882 9,716 8,214\nRestructuring costs and other 12,673 22,720 7,182\nTotal operating expenses 660,496 761,775 744,505\nEquity in earnings of associated companies 6,527 5,657 6,412\nOperating income 37,169 24,851 56,556\nNon-operating (expense) income:\nInterest expense (41,471) (41,770) (44,773)\nCurtailment gain - 1,027 23,830\nPension withdrawal cost (1,200) (2,335) (12,862)\nPension and OPEB related benefit and other, net 2,420 19,022 9,296\nTotal non-operating expense, net (40,251) (24,056) (24,509)\n(Loss) income before income taxes (3,082) 795 32,047\nIncome tax (benefit) expense (349) 698 7,255\nNet (loss) income (2,733) 97 24,792\nNet income attributable to non-controlling interests (2,534) (2,114) (2,047)\nLoss attributable to Lee Enterprises, Incorporated (5,267) (2,017) 22,745\nOther comprehensive income (loss), net of income taxes 10,190 (25,534) 62,237\nComprehensive income (loss) attributable to Lee Enterprises, Incorporated 4,923 (27,551) 84,982\nEarnings (loss) per common share:\nBasic: (0.90) (0.35) 3.98\nDiluted: (0.90) (0.35) 3.90\nThe accompanying Notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED BALANCE SHEETS\n(Thousands of Dollars) September 24\n2023 September 25\nASSETS\nCurrent assets:\nCash and cash equivalents 14,548 16,185\nAccounts receivable, less allowance for credit losses: 2023 $5,260; 2022 $5,237\n69,104 69,522\nInventories 7,504 8,265\nPrepaids and other 15,373 15,151\nTotal current assets 106,529 109,123\nInvestments:\nAssociated companies 27,819 27,378\nOther 5,572 5,971\nTotal investments 33,391 33,349\nProperty and equipment:\nLand and improvements 12,366 14,505\nBuildings and improvements 83,140 95,111\nEquipment 213,714 215,731\nConstruction in process 2,453 1,449\n311,673 326,796\nLess accumulated depreciation 250,439 253,083\nProperty and equipment, net 61,234 73,713\nOperating lease right-of-use assets 40,822 47,490\nGoodwill 329,504 329,504\nOther intangible assets, net 94,988 121,373\nPension plan assets, net 10,843 528\nMedical plan assets, net 21,565 19,066\nOther 12,741 9,896\nTotal assets 711,617 744,042\nThe accompanying Notes are an integral part of the Consolidated Financial Statements.\n(Thousands of Dollars and Shares, Except Per Share Data) September 24\n2023 September 25\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities:\nCurrent portion of lease liabilities 7,755 7,859\nAccounts payable 36,290 28,608\nCompensation and other accrued liabilities 29,448 44,740\nUnearned revenue 40,843 49,929\nTotal current liabilities 114,336 131,136\nLong-term debt, net of current maturities 455,741 462,554\nOperating lease liabilities 36,580 46,003\nPension obligations 586 966\nPostretirement and postemployment benefit obligations 8,618 9,221\nDeferred income taxes 41,351 42,719\nIncome taxes payable 5,809 8,292\nWithdrawal liabilities and other 24,890 25,914\nTotal liabilities 687,911 726,805\nEquity:\nStockholders' equity:\nSerial convertible preferred stock, no par value; authorized 500 shares; none issued\n- -\nCommon Stock, authorized 12,000 shares; issued and outstanding:\n61 60\nSeptember 24, 2023; 6,064 shares; $0.01 par value\nSeptember 25, 2022; 5,979 shares; $0.01 par value\nClass B Common Stock, $2 par value; authorized 3,000 shares; none issued\n- -\nAdditional paid-in capital 260,832 259,521\nAccumulated deficit (266,496) (261,229)\nAccumulated other comprehensive income 26,843 16,653\nTotal stockholders' equity 21,240 15,005\nNon-controlling interests 2,466 2,232\nTotal equity 23,706 17,237\nTotal liabilities and equity 711,617 744,042\nThe accompanying Notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIT)\nAmount Shares\n(Thousands of Dollars and Shares) 2023 2022 2021 2023 2022 2021\nCommon Stock:\nBalance, beginning of year 60 59 58 5,979 5,889 5,835\nShares issued 1 1 1 85 90 54\nBalance, end of year 61 60 59 6,064 5,979 5,889\nAdditional paid-in capital:\nBalance, beginning of year 259,521 258,063 256,957\nStock compensation 1,806 1,487 854\nShares (redeemed) issued (495) (29) 252\nBalance, end of year 260,832 259,521 258,063\nAccumulated deficit:\nBalance, beginning of year (261,229) (259,212) (281,957)\nNet income (loss) (2,733) 97 24,792\nNet income attributable to non-controlling interests (2,534) (2,114) (2,047)\nBalance, end of year (266,496) (261,229) (259,212)\nAccumulated other comprehensive income (loss):\nBalance, beginning of year 16,653 42,187 (20,050)\nChange in pension and postretirement benefits 13,364 (32,202) 82,204\nDeferred income taxes, net (3,174) 6,668 (19,967)\nBalance, end of year 26,843 16,653 42,187\nTotal stockholders' equity 21,240 15,005 41,097 6,064 5,979 5,889\nThe accompanying Notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Thousands of Dollars) 2023 2022 2021\nCash (required for) provided by operating activities:\nNet income (2,733) 97 24,792\nAdjustments to reconcile net income (loss) to net cash provided by (required for) operating activities:\nDepreciation and amortization 30,621 36,544 42,841\nBad debt expense 6,942 5,190 1,505\nCurtailment gain - (1,027) (23,830)\nPension withdrawal cost 1,200 2,335 12,862\nStock compensation expense 1,806 1,337 854\nAsset loss (gain) on sales, impairments and other, net 1,882 9,716 8,214\nGain on sale of investment (1,736) - -\nDeferred income taxes (4,542) (4,377) 5,160\nPension contributions - (112) (965)\nOther, net (2,290) (2,015) (1,253)\nChanges in operating assets and liabilities:\nDecrease (increase) in receivables (6,739) (7,804) (13,977)\nDecrease (increase) in inventories and other 977 (3,088) 1,237\n(Decrease) increase in accounts payable, unearned revenue, other accrued liabilities and operating lease obligations (26,155) (14,645) 4,731\nDecrease in pension, postretirement and postemployment benefit obligations (83) (21,449) (2,667)\nChange in income taxes payable 345 (236) (8,418)\nOther (2,019) 2,963 (1,008)\nNet cash (required for) provided by operating activities (2,524) 3,429 50,078\nCash provided by (required for) investing activities:\nPurchases of property and equipment (5,107) (7,536) (7,479)\nProceeds from sales of assets 11,952 14,835 4,616\nDistributions greater (less) than earnings of TNI and MNI (657) (576) 1,038\nOther, net 1,791 (386) (453)\nNet cash provided by (required for) investing activities 7,979 6,337 (2,278)\nCash required for financing activities:\nPrincipal payments on long-term borrowings (6,813) (20,062) (55,674)\nSale (purchases) of common stock transactions (279) 369 253\nNet cash required for financing activities (7,092) (19,693) (55,421)\nNet decrease in cash and cash equivalents (1,637) (9,927) (7,621)\nCash and cash equivalents:\nBeginning of year 16,185 26,112 33,733\nEnd of year 14,548 16,185 26,112\nThe accompanying Notes are an integral part of the Consolidated Financial Statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nReferences to \"we\", \"our\", \"us\" and the like throughout the Consolidated Financial Statements refer to Lee Enterprises, Incorporated and subsidiaries (the \"Company\"). Lee Enterprises, Incorporated is a leading provider of high quality, trusted, local news and information, and a major platform for advertising in the markets we serve. We operate 75 principally mid-sized local media operations (including TNI Partners (\"TNI\") and Madison Newspapers, Inc. (\"MNI\")) across 26 states.\n1. SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Consolidated Financial Statements include our accounts and those of our subsidiaries, all of which are wholly-owned, except for our 50% interest in TNI, 50% interest in MNI and 82.5% interest in BLOX Digital. TNI and MNI are accounted for under the equity method. Results of BLOX Digital are consolidated.\nOn March 16, 2020, the Company completed the acquisition of BH Media Group, Inc. and The Buffalo News, Inc. for a combined purchase price of $140.0 million (collectively, the \"Transactions\"). The Transactions were funded pursuant to a Credit Agreement dated as of January 29, 2020, between the Company and BH Finance LLC, a Nebraska limited liability company affiliated with Berkshire (the \"Credit Agreement\"), as described further in Note 5. In 2021, we allocated revenue from our full access subscriptions between print and digital subscription revenues.\nIn 2022, due to the increased prominence of digital-only revenues, we revised this presentation to classify full access subscriptions as print subscription revenue, and discretely present digital-only subscription revenues. 2021 amounts were reclassified in Note 2 to conform to the current year presentation. In 2023, certain prior period amounts have been adjusted to form with current period presentation. These matters did not change operating revenues, net income (loss), accumulated deficit, and earnings per share.\nFiscal Year\nAll of our enterprises use period accounting with the fiscal year ending on the last Sunday in September. References to \"2023\", \"2022\", \"2021\" and the like refer to the fiscal years ended the last Sunday in September. Fiscal years 2023, 2022, and 2021 include 52 weeks of operations.\nAccounting Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (\"GAAP\") requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We evaluate our estimates, which include estimates used in the valuation of goodwill and intangible assets periodically. We evaluate our estimates used in connection with our business combinations, the discount rate assumptions applied to our pension and postretirement plan obligations, the expected long-term rate of return on plan assets, and the provision for income taxes on an on-going basis. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nPrinciples of Consolidation\nAll significant intercompany transactions and balances have been eliminated.\nInvestments in TNI and MNI are accounted for using the equity method and are reported at cost, plus our share of undistributed earnings since acquisition less, for TNI, amortization of, and reductions in the value of, intangible assets.\nCash and Cash Equivalents\nWe consider all highly liquid debt instruments purchased with an original maturity of three months or less at date of acquisition to be cash equivalents.\nAccounts Receivable\nWe evaluate our allowance for credit losses based on historical credit experience, payment trends and other economic factors. Accounts considered to be uncollectible are written off.\nInventories\nNewsprint inventories and other inventories are priced at the lower of cost or net realizable value. LIFO newsprint inventories at September 24, 2023 and September 25, 2022 are less than replacement cost by $1.1 million and $1.4 million, respectively.\nThe components of inventory by cost method are as follows:\n(Thousands of Dollars) September 24, 2023 September 25, 2022\nNewsprint - FIFO method 200 393\nNewsprint - LIFO method 612 447\nOther inventory - FIFO method 2,173 2,219\nSpecific identification 4,519 5,206\n7,504 8,265\nInvestments\nInvestments in unconsolidated affiliates over which Lee exercises significant influence, but does not control, are accounted for by the equity method. Under this method, an investment account for each unconsolidated affiliate is increased by contributions made and by Lee's share of net income of the unconsolidated affiliate, and decreased by the share of net losses of and distributions from the unconsolidated affiliate.\nThe Company has elected to account for distributions under the cumulative earnings approach.\nProperty and Equipment\nProperty and equipment are carried at cost. Equipment and all other assets are depreciated using the straight line method. The estimated useful lives are as follows:\nYears\nBuildings and improvements 5 - 40\nPrinting presses and insertion equipment 5 - 25\nLeasehold improvements 3 - 10\nOther 3 - 15\nDepreciation expense for 2023, 2022 and 2021 was $11.6 million, $14.4 million, and $18.0 million, respectively.\nGoodwill and Other Intangible Assets\nGoodwill and other intangible assets are summarized in Note 4. Intangible assets include customer lists, newspaper subscriber lists and mastheads. Intangible assets subject to amortization are being amortized using the straight-line method except for intangible assets acquired in the Transactions which are being amortized in an accelerated manner consistent with the expected economic benefit.\nYears\nCustomer lists 10 - 20\nNewspaper subscriber lists 10 - 20\nWe review goodwill and non-amortizing intangible assets, which include only newspaper mastheads, for impairment annually as of the first day of the fiscal fourth quarter, or more frequently if events or changes in circumstances indicate that an asset may be impaired in accordance with Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") Topic 350, Intangibles - Goodwill and Other. Under ASC Topic 350, the impairment test for goodwill and non-amortizing intangible assets must be based on estimated fair values. Impairment would occur when the carrying amount of the reporting unit is greater than its fair value. Companies with reporting units with zero or negative carrying value are required to disclose the amount of goodwill for those reporting units.\nLeases\nThe Company determines if an arrangement is a lease at inception. Operating leases are included in operating lease ROU assets, current portion of long-term lease liabilities and operating lease liabilities on the Consolidated Balance Sheets. Finance leases would be included in property, plant and equipment, current portion of long-term debt and long-term debt on the Consolidated Balance Sheets. Amortization of operating lease ROU assets is included in other operating expenses. Amortization of finance leases would be included in depreciation expense.\nOperating lease ROU assets and operating lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. The ROU asset is adjusted to include lease payments made to date and initial direct costs incurred and to deduct for lease incentives received and impairment recognized. As most of the Company's leases do not provide an implicit rate, We determined the incremental borrowing rate based on a senior secured collateral adjusted yield curve for the Company. This yield curve reflects the estimated rate that would have been paid by the Company to borrow on a collateralized basis over a similar term in a similar economic environment. The lease terms may include options to extend or terminate the lease when it is reasonable certain that the option will be exercised. Lease expense for minimum lease payments is recognized on a straight-line basis over the lease term. Certain lease agreements have lease and non-lease components, which are accounted for together. See Note 6 for additional information related to leases.\nBusiness Combinations\nThe Company accounts for acquisitions in accordance with the provisions of ASC Topic 805 - Business Combinations, which provides guidance for recognition and measurement of identifiable assets and goodwill acquired, liabilities assumed, and any non-controlling interest in the acquiree at fair value. In a business combination, the assets acquired, liabilities assumed and non-controlling interest in the acquiree are recorded as of the date of acquisition at their respective fair values with limited exceptions. Any excess of the purchase price (consideration transferred) over the estimated fair values of net assets acquired is recorded as goodwill. Transaction costs are expensed as incurred. The operating results of the acquired business are reflected in the Company's Consolidated Financial Statements from the date of acquisition.\nRevenue Recognition\nRevenue is recognized when a performance obligation is satisfied by the transfer of control of the contracted goods or services to our customers, in an amount that reflects the consideration we expect to receive in exchange for those goods or services. See Note 2.\nRestructuring Costs and Other\nRestructuring costs and other primarily relate to severance expenses associated with involuntary terminations, as well as litigation, advisor, and other expenses associated with the unsolicited bid offer in November 2021. These costs are expensed as incurred.\nPension, Postretirement and Postemployment Benefit Plans\nWe evaluate our liabilities for pension, postretirement and postemployment benefit plans based upon computations made by consulting actuaries, incorporating estimates and actuarial assumptions of future plan service costs, future interest costs on projected benefit obligations, rates of compensation increases, when applicable, employee turnover rates, anticipated mortality rates, expected investment returns on plan assets, asset allocation assumptions of plan assets and other factors.\nWe apply a practical expedient under ASC Topic 715, Compensation - Retirement Benefits, which allows us to measure plan assets and benefit obligations using the month-end that is closest to our fiscal year-end. Accordingly, we measure our plan assets and benefit obligations as of September 30, or upon a remeasurement event. We use the alternative spot rate approach which utilizes a full yield curve to estimate the interest cost component of benefit cost by applying the specific spot rates along the yield curve used in the determination of the benefit obligation to the relevant projected cash flows.\nMultiemployer Pension Plans\nThe Company contributes to a number of multiemployer defined benefit pension plans under the terms of collective-bargaining agreements that cover certain of the Company's union represented employees. The risks of participating in these multiemployer plans are different from single-employer plans in that assets contributed are pooled and may be used to provide benefits to employees of other participating employers. If a participating employer withdraws from or otherwise ceases to contribute to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers. Alternatively, if the Company chooses to stop participating in one of its multiemployer plans, it may incur a withdrawal liability based on its actuarially determined share of the unfunded status of the plan.\nContributions made to multiemployer plans are based on collective-bargaining agreements and are accounted for under guidance related to multiemployer plans, which essentially provides that contributions to such plans are expensed when due. Any withdrawal liability would be recognized at the point withdrawal from the plan becomes probable. See Note 8 for additional information.\nIncome Taxes\nDeferred income tax assets are recognized for deductible temporary differences and loss carryforwards and deferred income tax liabilities are recognized for taxable temporary differences which are the difference between the reported amounts of assets and liabilities and their tax basis. Deferred income tax assets are reduced by a valuation allowance when, in our opinion, it is more likely than not that some portion or all of the deferred income tax assets will not be realized. Deferred income tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nWe recognize the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. Changes in recognition or measurement are reflected in the period in which the change in judgment occurs. We record interest and penalties related to unrecognized tax benefits as a component of income tax expense.\nFair Value Measurements\nWe utilize ASC Topic 820 - Fair Value Measurements and Disclosures, to measure and report fair value. ASC Topic 820 defines fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. ASC Topic 820 establishes a three-level hierarchy of fair value measurements based\non whether the inputs to those measurements are observable or unobservable, which consists of the following levels:\nLevel 1 - Quoted prices for identical instruments in active markets.\nLevel 2 - Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs are observable in active markets.\nLevel 3 - Valuations derived from valuation techniques in which one or more significant inputs are unobservable.\nInvestments measured at net asset value, as a practical expedient for fair value, are excluded from the fair value hierarchy.\nValuation methodologies measured at fair value are as follows:\nFinancial instruments consist of short term deposits valued based on quoted prices in active markets. Such investments are classified as Level 1.\nTreasury Inflation-Protected Securities (\"TIPS\") consist of low yield mutual funds and are valued by quoted inactive market prices. Such investments are classified as Level 2.\nEquity securities are valued based on the closing market price in an active market and are classified as Level 1. Certain investments in commingled funds are valued at the end of the period based upon the value of the underlying investments as determined by quoted market prices. Such investments are classified as Level 2. Certain equity securities are part of a collective investment fund for which there is no readily determinable fair value. This fund is valued at the net asset value of units held at the end of the period based upon the value of the underlying investments, which is determined using multiple approaches including by quoted market prices and by private market quotations. Such investments are excluded from the fair value hierarchy.\nDebt securities consist of government securities, corporate bonds, and mutual funds. Government securities and corporate bonds are valued based upon quoted market prices in an inactive market. Such investments are classified as Level 2. Mutual funds are valued based upon quoted market prices in an active market. Such investments are classified as Level 1.\nHedge funds consist of a long/short equity funds and a diversified fund of funds for which there is no readily determinable fair value. These funds are valued at the net asset value of units held at the end of the period based upon the value of the underlying investments, which is determined using multiple approaches including by quoted market prices and by private market quotations. Such investments are excluded from the fair value hierarchy.\nSegments\nOur business consists of approximately 50 strategic business units (\"SBU's\"). The SBUs generally include print and digital subscription products and the associated advertising and marketing services. Each of our SBUs have comparable types of costs (compensation, newsprint/ink, and other costs) to generate similar sources of advertising and marketing services revenue and subscription revenue, they produce products in similar manner; they have same class of customers and they use the same distribution processes. In other words, each SBU engages in the same business activities.\nSeparate operating results of each SBU are not reviewed by the chief operating decision maker (\"CODM\"). The CODM reviews Consolidated Statements of Income and Consolidated Balance Sheets on a monthly basis, and reviews the Consolidated Statements of Cash Flows (\"SOCF\") on a quarterly basis. The balance sheets and SOCF are only prepared on a consolidated level. Selective revenue and expense details by SBU are reviewed by the CODM, however, the focus of those reviews is on details of advertising and marketing services revenue by SBU and subscription revenue by SBU. Complete operating results or other profitability measures by SBU are not reviewed by the CODM. Further, business decisions by the CODM, including the allocation of resources, are determined based on reviewing consolidated information.\nStock Compensation and Warrants\nWe have several stock-based compensation plans. We account for grants under those plans under the fair value expense recognition provisions of ASC Topic 718 - Compensation-Stock Compensation. We determine the fair value of stock options using the Black-Scholes option pricing formula. Key inputs to this formula include expected term, expected volatility and the risk-free interest rate.\nThe expected term represents the period that our stock-based awards are expected to be outstanding, and is determined based on historical experience of similar awards, giving consideration to contractual terms of the awards, vesting schedules and expectations of future employee behavior. The volatility factor is calculated using historical market data for our Common Stock. The time frame used is equal to the expected term. We base the risk-free interest rate on the yield to maturity at the time of the stock option grant on zero-coupon U.S. government bonds having a remaining term equal to the option's expected term. When estimating forfeitures, we consider voluntary termination behavior as well as actual option forfeitures.\nWe amortize as compensation expense the value of stock options and restricted Common Stock using the straight-line method over the requisite service period or restriction period, which is generally one to four years.\nPrior to 2023, we also had 600,000 warrants outstanding to purchase shares of our Common Stock. Warrants were recorded at fair value determined using the Black-Scholes option pricing formula. These warrants expired in 2022. See Notes 5, 10 and 13.\nUninsured Risks\nWe are self-insured for health care, workers compensation and certain long-term disability costs of our employees, subject to stop loss insurance, which limits our losses in the event of large claims. We accrue our estimated health care costs in the period in which such costs are incurred, including an estimate of incurred but not-reported claims. Other risks are insured and carry deductible losses of varying amounts. We have posted cash collateral totaling $7.0 million and $4.6 million at September 24, 2023 and September 25,2022, respectively in support of our insurance programs recorded under Other on the Consolidated Balance Sheets.\nOur accrued reserves for health care and workers compensation claims are based upon estimates of the remaining liability for retained losses made by consulting actuaries. The amount of workers compensation reserve has been determined based upon historical patterns of incurred and paid loss development factors from the insurance industry.\nNew Accounting Pronouncements not yet Adopted\nIn November 2023, the FASB issued Accounting Standards Update (\"ASU\") 2023-07 - Segment Reporting to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. This pronouncement is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. Early adoption is permitted. The Company is evaluating the impact this will have on our Consolidated Financial Statements.\nRecently Issued Accounting Standards - Standards Adopted in 2023 and 2022\nNone\nRecently Issued Accounting Standards - Standards Adopted in 2021\nIn June 2016, the FASB issued a new standard ASC Topic 326 Financial Instruments - Credit Losses to replace the incurred loss impairment methodology with a methodology that reflects expected credit losses and requires consideration of a wider array of reasonable and supportable information to inform and develop credit loss estimates. We are required to use a forward-looking expected credit loss model for both accounts receivables and other financial instruments. The new standard was adopted on September 28, 2020, using a modified retrospective approach. This standard did not have a material impact on our Consolidated Financial Statements.\nIn August 2018, the FASB issued ASU 2018-13 Fair Value Measurements that changes disclosure requirements related to fair value measurements as part of the disclosure framework project. The disclosure framework project aims to improve effectiveness of disclosures in the notes to the financial statements by focusing on\nrequirements that clearly communicate the most important information to users of the financial statements. The new guidance was adopted on September 28, 2020, and did not have a material impact on our Consolidated Financial Statements.\nIn December 2019, the FASB issued new guidance that simplifies the accounting for income taxes by eliminating certain exceptions to the guidance in ASC Topic 740 Income Taxes related to the approach for intra-period tax allocation, the methodology for calculating income taxes in an interim period and the recognition for deferred tax liabilities for outside basis differences. The standard also simplifies aspects of the accounting for franchise taxes and enacted changes in tax laws or rates and clarifies the accounting for transactions that result in a step-up in the tax basis of goodwill. This new guidance was adopted September 28, 2020, and did not have a material impact on our Consolidated Financial Statements.\nIn August 2018, FASB issued ASU 2018-14 Compensation - Retirement Benefits - Defined Benefit Plans to amend disclosure requirements for employers that sponsor defined benefit pension or other postretirement plans. The new standard was adopted on September 28, 2020 using a retrospective approach, and did not have a material impact on our Consolidated Financial Statements.\n2. REVENUE\nRevenue is recognized when control of the promised goods or services is transferred to customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for goods or services. Revenues are recognized as performance obligations are satisfied either at a point in time, such as when an advertisement is published, or over time, such as audience subscription revenue. No single customer represented 10% or more of the Company's net revenue in any fiscal period presented.\nAdvertising and marketing services revenue\nPrint advertising revenue includes amounts charged to customers for retail, national, or classified advertising space purchased in our newspapers, advertising marketing services and other print advertising products such as preprint inserts and direct mail.\nDigital advertising revenue includes amounts for advertisements placed on our digital platforms, amounts charged to customers for digital marketing services which include: audience extension, Search Engine Optimization, Search Engine Marketing, web and mobile production, social media services and reputation monitoring and management.\nPayments for print and digital advertising revenue are due upon completion of our performance obligations at previously agreed upon rates. In instances where the timing of revenue recognition differs from the timing of invoicing, such timing differences are not large. As a result, we have determined that our contracts do not include a significant financing component.\nSubscription revenue\nPrint subscription revenue results from the sale of print editions of newspapers to individual subscribers and to sales outlets that resell the newspapers. Print subscriptions include full access to all forms of content provided. Single copy revenue is also included in subscription revenue. Subscription revenue from single-copy and home delivery subscriptions are recognized at the point in time the publications are delivered.\nDigital subscription revenue results from the sale of digital-only access to the Company's content delivered via digital products purchased. Digital subscription revenue is recognized over time as performance obligations are met throughout the subscription period.\nPayments for print and digital subscription revenue are typically collected in advance, are for contract periods of one year or less and result in an unearned revenue liability that is reduced when revenue is recognized.\nOther revenue\nOther revenue primarily consists of digital services, commercial printing and delivery of third party products. Digital services revenues, which are primarily delivered through BLOX Digital, are primarily comprised of contractual agreements to provide webhosting and content management services. As such, digital services revenue is recognized over the contract period. Prices for digital services are agreed upon in advance of the\ncontract beginning and are typically billed in arrears on a monthly basis, with the exception of implementation fees which are recognized as deferred revenue and amortized over the contract period. Commercial printing and delivery revenue is recognized when the product is delivered to the customer.\nThe following table presents our revenue disaggregated by source:\n(Thousands of Dollars) 2023 2022 2021\nOperating revenue:\nPrint advertising revenue 125,804 184,963 227,892\nDigital advertising revenue 193,173 181,465 141,391\nAdvertising and marketing services revenue 318,977 366,428 369,283\nPrint subscription revenue 252,591 313,504 329,484\nDigital-only subscription revenue 60,700 40,120 28,229\nSubscription Revenue 313,291 353,624 357,713\nPrint other revenue 39,508 42,962 48,656\nDigital other revenue 19,362 17,955 18,997\nOther revenue 58,870 60,917 67,653\nTotal operating revenue 691,138 780,969 794,649\nContract Liabilities: The Companys primary source of unearned revenue is from subscriptions paid in advance of the service provided. The Company expects to recognize the revenue related to unsatisfied performance obligations over the next twelve months in accordance with the terms of the subscriptions and other contracts with customers. The unearned revenue balances described herein are the Company's only contract liability. Unearned revenue was $40.8 million as of September 24, 2023, $49.9 million as of September 25, 2022, and $61.4 million as of September 26, 2021. Revenue recognized in 2023, 2022, and 2021 that was included in the contract liability as of September 25, 2022, September 26, 2021, and September 27, 2020 was $47.2 million, $54.7 million, and $56.1 million, respectively.\nAccounts receivable, excluding allowance for credit losses and contract assets, was $74.4 million, $74.8 million, and $71.6 million as of September 24, 2023, September 25, 2022 and September 26, 2021, respectively. Allowance for credit losses was $5.3 million and $5.2 million as of September 24, 2023 and September 25, 2022, respectively.\nPractical expedients: Sales commissions are expensed as incurred as the associated contractual periods are one year or less. These costs are recorded within compensation. The vast majority of our contracts have original expected lengths of one year or less and revenue is earned at a rate and amount that corresponds directly with the value to the customer.\n3. INVESTMENTS IN ASSOCIATED COMPANIES\nTNI Partners\nIn Tucson, Arizona, TNI, acting as agent for our subsidiary, Star Publishing Company (Star Publishing) and Citizen Publishing Company (Citizen), a subsidiary of Gannett Co. Inc., is responsible for printing, delivery, advertising and subscription activities of the Arizona Daily Star, as well as the related digital platforms and specialty publications. TNI collects all receipts and records income and pays substantially all operating expenses incident to the partnership's operations and publication of the newspaper and other media. Income or loss of TNI is allocated equally to Star Publishing and Citizen.\nSummarized financial information of TNI is as follows:\n(Thousands of Dollars) September 24\n2023 September 25\nASSETS\nCurrent assets 1,901 2,801\nInvestments and other assets 1,240 1,584\nTotal assets 3,141 4,385\nLIABILITIES AND MEMBERS' EQUITY (DEFICIT)\nLiabilities 3,837 5,005\nMembers' equity (696) (620)\nTotal liabilities and members' equity (deficit) 3,141 4,385\nSummarized results of TNI are as follows:\n(Thousands of Dollars) 2023 2022 2021\nOperating revenue 31,076 34,153 34,782\nOperating expenses 24,446 25,445 25,320\nOperating income 6,630 8,708 9,462\nNet income 7,142 8,708 9,462\nCompany's 50% share\n3,571 4,354 4,731\nLess amortization of intangible assets - - -\nEquity in earnings of TNI 3,571 4,354 4,731\nTNI makes periodic distributions of its earnings. We received $3.6 million, $3.8 million, and $5.2 million in distributions in 2023, 2022 and 2021, respectively.\nAt September 24, 2023 and September 25, 2022, the carrying value of the Company's 50% investment in TNI is $15.1 million and $15.3 million, respectively. The difference between our carrying value and our 50% share of the members' equity of TNI relates principally to goodwill of $12.4 million and other identified intangible assets of $2.3 million, certain of which have been amortized over their estimated useful lives through 2020. See Note 4.\nTNI provides editorial services to the Company. Editorial service costs are included in other operating expenses in the Consolidated Statements of Income and Comprehensive Income and totaled $4.4 million, $5.2 million, and $4.5 million in 2023, 2022 and 2021, respectively.\nMadison Newspapers, Inc.\nWe have a 50% ownership interest in MNI, which publishes daily and Sunday newspapers, and other publications in Madison, Wisconsin, and other Wisconsin locations, and related digital sites. Net income or loss of MNI (after income taxes) is allocated equally to us and The Capital Times Company (TCT). MNI conducts its business under the trade name Capital Newspapers.\nSummarized financial information of MNI is as follows:\n(Thousands of Dollars) September 24\n2023 September 25\nASSETS\nCurrent assets 8,916 5,837\nInvestments and other assets 29,267 29,903\nTotal assets 38,183 35,740\nLIABILITIES AND MEMBERS' EQUITY\nCurrent liabilities 6,352 5,922\nOther liabilities 6,303 5,696\nStockholders' equity 25,528 24,122\nTotal liabilities and members' equity 38,183 35,740\nSummarized results of MNI are as follows:\n(Thousands of Dollars) 2023 2022 2021\nOperating revenue 44,109 47,621 46,015\nOperating expenses, excluding restructuring costs, depreciation and amortization 30,654 37,922 35,583\nRestructuring costs 143 169 107\nDepreciation and amortization 539 672 711\nOperating income 12,773 8,858 9,614\nNet income 5,911 2,605 3,362\nEquity in earnings of MNI 2,956 1,303 1,681\nMNI makes periodic distributions of its earnings. We received $2.2 million, $1.3 million, and $2.3 million in distributions in 2023, 2022 and 2021, respectively.\nWe provide editorial services to MNI. Editorial service fees are included in other revenue in the Consolidated Statements of Income and Comprehensive Income and totaled $5.4 million, $5.6 million, and $5.6 million in 2023, 2022 and 2021, respectively.\nAt September 24, 2023 and September 25, 2022, the carrying value of the Company's 50% investment in MNI is $12.8 million and $12.0 million, respectively.\n4. GOODWILL AND OTHER INTANGIBLE ASSETS\nChanges in the carrying amount of goodwill are as follows:\n(Thousands of Dollars) 2023 2022\nGoodwill, gross amount 1,618,233 1,618,933\nAccumulated impairment losses (1,288,729) (1,288,729)\nGoodwill, beginning of year 329,504 330,204\nDisposal - (700)\nGoodwill, end of year 329,504 329,504\nIdentified intangible assets related to continuing operations consist of the following:\n(Thousands of Dollars) September 24\n2023 September 25\nNon-amortized intangible assets:\nMastheads 18,675 26,346\nAmortizable intangible assets:\nCustomer and newspaper subscriber lists 306,766 323,568\nLess accumulated amortization (230,453) (228,541)\n76,313 95,027\nIdentified intangible assets 94,988 121,373\nAs discussed in Note 1, the Company reviews goodwill and non-amortized intangible assets for impairment annually on the first day of the fourth quarter, or more frequently if events or changes in circumstances indicate that an asset may be impaired in accordance with ASC Topic 350.\nAll of the Companys goodwill is attributed to the single reporting unit. When evaluating these assets for impairment, we may first perform a qualitative assessment to determine whether it is more likely than not that a reporting unit is impaired, known as Step 0. If we do not perform a qualitative assessment, or if we determine that it is not more likely than not that the fair value of the reporting unit exceeds its carrying amount, we would calculate the estimated fair value of the reporting unit using discounted cash flows or a combination of discounted cash flow and market approaches. The Company performed its annual assessment on the first day of our fourth fiscal quarter, and determined the fair value of our single reporting unit was in excess of carrying value and as such, there was no impairment in 2023, 2022, and 2021.. In 2022, the Company disposed of a non-core operation with $0.7 million of attributable goodwill.\nFor mastheads, the calculated fair value includes Level 3 inputs that were determined using the relief from royalty method. The key assumptions used in the fair value estimates under the relief from royalty method are revenue and market growth, royalty rates for newspaper mastheads (the royalty rates utilized range from 0.0% to 1.0%), estimated tax rates, and appropriate risk-adjusted weighted-average cost of capital (for 2023, 2022 and 2021, the weighted-average cost of capital used was 13.00%, 11.00% and 10.50%, respectively). These assumptions reflect Lee's best estimates, but these items involve inherent uncertainties based on market conditions generally outside of the Company's control. A 50-basis point decrease in royalty rates would result in an additional $9.3 million of impairment. Increasing the discount rate by 100 basis points would result in an additional $1.2 million of impairment. In 2023, 2022, and 2021, we recorded non-cash charges to reduce the carrying value of non-amortized intangible assets. Such charges are recorded in assets loss (gain) on sales, impairments and other in the Consolidated Statements of Income (Loss) and Comprehensive Income (Loss). We recorded deferred income tax benefits related to these charges. Changes in market conditions and declines in revenue lead to the impairment charges noted above.\nA summary of the pretax impairment charges is included in the table below:\n(Thousands of Dollars) 2023 2022 2021\nNon-amortized intangible assets 7,671 14,203 787\nProperty, equipment and other assets - - 190\n7,671 14,203 977\nAmortization expense for 2023, 2022, and 2021 was $19.0 million, $22.2 million, and $24.9 million, respectively.\nAnnual amortization of intangible assets for the years ending September 2024 to September 2028 is estimated to be $18.4 million, $12.8 million, $7.3 million, $7.1 million, and $5.5 million, respectively. The weighted average amortization period for amortizable assets is 11.5 years.\n5. DEBT\nOn March 16, 2020 concurrent with closing the Transactions, the Company completed a comprehensive refinancing of its debt (the \"2020 Refinancing\"). The 2020 Refinancing consists of the Credit Agreement and Term Loan. The proceeds of the Term Loan were used, along with cash on hand, to refinance the Company's $431.5 million it incurred in 2014 (the \"2014 Refinancing\") as well as to fund the acquisition of BH Media Newspaper Business assets and the stock of Buffalo News for $140.0 million in cash. With the closing of this transaction, BH Finance became Lee's sole lender. Proceeds of the Term Loan were used to finance the Transactions and refinance all of the Company's outstanding debt at par. The Term Loan matures in March 2045. The Company's debt is collateralized by all Company assets.\nAs of September 24, 2023, the Company has $455.7 million in aggregate principal debt outstanding under the Term Loan. The debt has a fixed interest rate at September 24, 2023 of 9.0%.\nDuring the twelve months ended September 24, 2023, we made principal debt payments of $6.8 million. Payments were from the sale of non-core assets. Future payments are contingent on the Company's ability to generate future Excess Cash Flow, as defined below.\nThe Credit Agreement contains certain customary representations and warranties, certain affirmative and negative covenants and certain conditions, including restrictions on incurring additional indebtedness, creating certain liens, making certain investments or acquisitions, issuing dividends, repurchasing shares of stock of the Company and certain other capital transactions. Certain existing and future direct and indirect material domestic subsidiaries of the Company are guarantors of the Company's obligations under the Credit Agreement.\nThe Credit Agreement restricts us from paying dividends on our Common Stock. This restriction does not apply to dividends issued with the Company's Equity Interests or from the proceeds of a sale of the Company's Equity Interests. Further, the Credit Agreement restricts or limits, among other things, subject to certain exceptions, the ability of the Company and its subsidiaries to: (i) incur additional indebtedness, (ii) make certain investments, (iii) enter into mergers, acquisitions and asset sales, (iv) incur or create liens and (v) enter into transactions with certain affiliates. The Credit Agreement contains various representations and warranties by the Company and may be terminated upon the occurrence of certain events of default, including non-payment. The Credit Agreement also contains cross-default provisions tied to other agreements with BH Finance entered into by the Company and its subsidiaries in connection with the 2020 Refinancing.\nPrincipal Payments\nVoluntary pre-payments under the Credit Agreement are not subject to call premiums and are payable at par, with the exception of the change-of-control provisions discussed below.\nExcluding the Excess Cash Flow payments described below, there are no scheduled mandatory principal payments required under the Credit Agreement. The Company is required to make mandatory prepayments of the Term Loan as follows:\nThe Company must prepay the Term Loan in an aggregate amount equal to 100% of any Net Cash Proceeds received by the Company or any Subsidiary from a sale, transfer, license, or other disposition of any property of the Company or any subsidiary in excess of $0.5 million in any ninety (90) day period.\nThe Company is required to prepay the Term Loan with excess cash flow, defined as cash on the balance sheet at quarter-end in excess of $20.0 million (\"Excess Cash Flow\"). Excess Cash Flow is used to prepay the Term Loan, at par, and is due within 50-days of quarter-end.\nIf there is a Change of Control (as defined in the Credit Agreement), BH Finance has the option to require the Company to prepay the Term Loan in cash equal to 105% of the unpaid principal balance, plus accrued and unpaid interest.\nThe Company may, upon notice to BH Finance, at any time or from time to time, voluntarily prepay the Term Loan in whole or in part, at par, provided that any voluntary prepayment of the Term Loan shall be accompanied by payment of all accrued interest on the amount of principal prepaid to the date of prepayment.\nWarrants\nIn connection with the 2nd Lien Term Loan entered into in the 2014 Refinancing, we entered into a Warrant Agreement dated as of March 31, 2014 (the \"Warrant Agreement\"). Under the Warrant Agreement, certain affiliates or designees of the 2nd Lien Lenders received on March 31, 2014 their pro rata share of warrants to purchase, in cash, an initial aggregate of 600,000 shares of Common Stock, subject to adjustment pursuant to anti-dilution provisions (the \"Warrants\"). The Warrants represented, when fully exercised, approximately 10.1% of shares of Common Stock outstanding at March 30, 2014 on a fully diluted basis. The exercise price of the Warrants was $41.90 per share. The Warrants expired in March 2022.\nThe Warrant Agreement contained provisions requiring the Warrants to be measured at fair value and included in warrants and other liabilities in our Consolidated Balance Sheets. We re-measured at the fair value of the liability each reporting period, with changes reported in other, net non-operating income (expense). The initial fair value of the Warrants was $16.9 million. See Note 13.\nLiquidity\nPursuant to the terms of the Credit Agreement, our debt does not include a revolver.\nOur liquidity, consisting of cash on the balance sheet, totals $14.5 million at September 24, 2023. This liquidity amount excludes any future cash flows. We expect all interest and principal payments due in the next twelve months will be satisfied by existing cash and our cash flows, which will allow us to maintain an adequate level of liquidity.\nThere are numerous potential consequences under the Term Loan if an event of default, as defined, occurs and is not remedied. Many of those consequences are beyond our control. The occurrence of one or more events of default would give rise to the right of BH Finance to exercise their remedies under the Credit Agreement including, without limitation, the right to accelerate all outstanding debt and take actions authorized in such circumstances under applicable collateral security documents.\nOur ability to operate as a going concern is dependent on our ability to remain in compliance with debt covenants and to repay, refinance or amend our debt agreements as they become due. The Credit Agreement (as defined above) has only limited affirmative covenants with which we are required to maintain compliance and there are no leverage or financial performance covenants. We are in compliance with our debt covenants at September 24, 2023.\n6. LEASES\nWe lease certain real estate, vehicles, and equipment. Our leases have remaining lease terms of 1 to 40 years, some of which may include options to extend the leases, and some of which may include options to terminate the leases. The exercise of lease renewal options and terminations are at our sole discretion. The depreciable lives of assets and leasehold improvements are limited by the expected lease term unless there is a transfer of title or purchase option reasonably certain of exercise.\nIn connection with the Transactions, the Company entered into a lease agreement between BH Media, as Landlord, and the Company, as Tenant, providing for the leasing of 68 properties and related fixtures (including production equipment) used in the BH Media Newspaper Business (\"BH Lease\"). The BH Lease commenced on March 16, 2020. The BH Lease requires the Company to pay annual rent of $8.0 million, payable in equal payments, as well as all operating costs relating to the properties (including maintenance, repairs, property taxes and insurance). Rent payments are subject to a Rent Credit (as defined in the Lease) equal to 8.00% of the net consideration for any leased real estate sold by BH Media during the term of the Lease. As of September 24, 2023, the Company has earned monthly rent credits of $0.2 million, making current annual rent of $5.2 million. In connection with the BH Lease, the Company recognized $56.2 million and $56.2 million in right-of-use (\"ROU\") assets and offsetting lease liabilities as of March 16, 2020.\nDuring the period ended September 25, 2022, the Company permanently vacated office and distribution space related to 14 leases. The space was vacated as some of our locations have transitioned to long-term remote working arrangements and space consolidation. The abandonment of lease space is an indicator of impairment and the Company assessed the lease ROU asset and leasehold improvements for impairment. Estimates of fair value include Level 3 inputs which are subjective in nature and involve uncertainties and matters of significant judgement and are made at a specific point in time. During the period ended September 25, 2022, the Company recorded non-cash impairment losses of $7.8 million for right-of-use assets, which is recorded on the Consolidated Statements of Income (loss) and Comprehensive Income (loss) under the line item assets loss (gain) on sales, impairments and other.\nTotal lease expense consists of the following:\n(Thousands of Dollars) 2023 2022 2021\nOperating lease costs 12,688 13,786 14,846\nVariable lease costs 1,175 1,201 92\nShort-term lease costs 355 217 -\nTotal Operating Lease Expense 14,218 15,204 14,938\nSupplemental cash flow information related to our operating leases is as follows:\n(Thousands of Dollars) 2023 2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash outflow from operating leases 13,403 14,325 14,789\nRight-of-use assets obtained in exchange for operating lease liabilities 3,855 990 932\nAs of September 24, 2023, maturities of lease liabilities were as follows:\n(Thousands of Dollars)\n2024 12,179\n2025 10,960\n2026 9,369\n2027 7,701\n2028 6,324\nThereafter 10,609\nTotal lease payments 57,142\nLess: interest (12,806)\nPresent value of lease liabilities 44,336\nOur lease contracts are discounted using the incremental borrowing rate for the Company. We determined the incremental borrowing rate based on a senior secured collateral adjusted yield curve for the Company. This yield curve reflects the estimated rate that would have been paid by the Company to borrow on a collateralized basis over a similar term in a similar economic environment. The weighted average revolving lease terms and discount rates for all of our operating leases were as follows.\nSeptember 24, 2023\nWeighted average remaining lease term (years) 5 years, 7 months, 4 days\nWeighted Average discount rate 7.88 %\n7. DEFINED BENEFIT PENSION PLANS\nDuring 2022, the Company made several changes to its defined benefit plans. At the beginning of 2022, the Company was the sponsor of seven single-employer defined benefit plans, two of which were frozen to new participants and future benefits. As of September 24, 2023, we are the sponsor of one single-employer defined benefit plan, which provide benefits to certain current and former employees of Lee.\nDuring 2022 we notified certain participants in our defined benefit plans of changes to be made to the plans. The Company froze future benefits and participation for an additional four of the defined benefit plans. The freeze of future benefits resulted in a non-cash curtailment gain of $1.0 million related to the four plans. In connection with the freeze the Company provided certain benefit enhancements that resulted in an increase to our net pension liability and a decrease to accumulated other comprehensive income of $6.1 million. Additionally, the Company merged the six frozen plans into one fully-funded defined benefit plan, the Lee Enterprises Incorporated Pension Plan (\"Plan\") effective in the second quarter of fiscal 2022.\nDuring September of 2022, as part of a pension de-risking strategy for the Plan, the Company, executed an agreement pursuant to which it transferred to a third-party insurance company (the \"Insurer\") $85.6 million of the Plan's liabilities in exchange for $81.4 million of Plan assets and recorded a non-cash settlement gain of $4.2 million in Pension and OPEB related benefit (cost) and other, net. Collectively, the transactions are known as the \"Annuity Purchase\"\nDuring the year ended September 24, 2023, an immaterial defined benefit plan was merged into the Plan. The prior period net periodic pension cost (benefit) and changes in benefit obligations tables have been revised to include amounts from this plan that was previously excluded due to immateriality.\nThe net periodic cost (benefit) components of our pension plans are as follows:\n(Thousands of Dollars) 2023 2022 2021\nService cost for benefits earned during the year 19 488 2,529\nInterest cost on projected benefit obligation 10,368 7,999 7,147\nExpected return on plan assets (10,192) (18,261) (18,688)\nAmortization of net (gain) loss 10 (3,317) 4,018\nAmortization of prior service benefit 852 641 (6)\nSettlement gain - (4,245) -\nCurtailment gain - (1,027) -\nNet periodic pension cost (benefit) 1,057 (17,722) (5,000)\nChanges in benefit obligations and plan assets are as follows:\n(Thousands of Dollars) 2023 2022\nBenefit obligation, beginning of year 210,806 386,832\nService cost 19 488\nInterest cost 10,368 7,999\nPlan amendments - 6,077\nActuarial (gain) loss (9,876) (86,387)\nBenefits paid (12,130) (21,799)\nLiability (gain)/loss due to curtailment - (1,027)\nSettlements - (81,377)\nBenefit obligation, end of year 199,187 210,806\nFair value of plan assets, beginning of year: 211,058 400,907\nActual return on plan assets 12,638 (84,636)\nBenefits paid (12,130) (21,799)\nAdministrative expenses paid (1,535) (2,149)\nSettlements - (81,377)\nEmployer contributions - 112\nFair value of plan assets, end of year 210,031 211,058\nFunded status 10,844 252\nDisaggregated amounts recognized in the Consolidated Balance Sheets are as follows:\n(Thousands of Dollars) September 24\n2023 September 25\nNet pension assets 10,844 252\nAccumulated other comprehensive income (before income taxes) 16,653 5,005\nAmounts recognized in accumulated other comprehensive income (loss) are as follows:\n(Thousands of Dollars) September 24\n2023 September 25\nUnrecognized net actuarial gain (loss) 21,246 10,450\nUnrecognized prior service cost (4,593) (5,445)\n16,653 5,005\nWe expect to recognize $0.8 million of unrecognized prior service cost in net periodic pension costs in 2024.\nAssumptions\nWeighted-average assumptions used to determine benefit obligations are as follows:\n(Percent) September 24\n2023 September 25\nDiscount rate 5.7 5.3\nInterest crediting rate 2.5 2.5\nWeighted-average assumptions used to determine net periodic benefit cost are as follows:\n(Percent) 2023 2022 2021\nDiscount rate - service cost 5.8 5.4 3.0\nDiscount rate - interest cost 5.7 5.3 1.9\nExpected long-term return on plan assets 5.0 5.0 5.9\nFor 2023, the expected long-term return on Plan assets is 5.0%. The assumptions related to the expected long-term return on Plan assets are developed through an analysis of historical market returns, current market conditions and composition of Plan assets.\nFor the year ended September 24, 2023, the most significant driver of the decrease in benefit obligation was the actual return on assets exceeding expected returns and higher actuarial gains experienced by the Plan. The Plan recognized actuarial gains due to increases in bond yields that resulted in increases to the discount rate. For the year ended September 25, 2022, the most significant driver of the decrease in benefit obligation was the higher actuarial gains experienced by all plans and the Annuity Purchase mentioned above. The plans recognized actuarial gains due to significant increases in bond yields that resulted in increases to the discount rates. Discount rate increases were partially offset by actual return on assets falling behind expected returns for the year.\nPlan Assets\nThe primary objective of our investment strategy is to satisfy our pension obligations at a reasonable cost. Assets are actively invested to balance real growth of capital through appreciation, reinvestment of dividend and interest income, and safety of invested funds.\nOur investment policy outlines the governance structure for decision-making, sets investment objectives and restrictions and establishes criteria for selecting and evaluating investment managers. The use of derivatives is prohibited, except on a case-by-case basis where the manager has a proven capability, and only to hedge quantifiable risks such as exposure to foreign currencies. An investment committee, consisting of certain of our executives and supported by independent consultants, is responsible for monitoring compliance with the investment policy. Assets are periodically redistributed to maintain the appropriate policy allocation.\nThe weighted-average asset allocation of our pension assets, is as follows:\n(Percent) Policy Allocation Actual Allocation\nAsset Class September 24\n2023 September 24\n2023 September 25\nEquity securities 25 25 41\nDebt securities 65 62 43\nHedge fund investments 10 12 15\nCash and cash equivalents 1 1 1\nPlan assets include no Company securities. Assets include cash and cash equivalents and receivables from time to time due to the need to reallocate assets within policy guidelines.\nDue to the timing of the annuity purchase (as discussed above), funds were organized in a way that provided sufficient liquidity for the transaction. This caused our pension plans asset allocation to differ significantly from our desired policy as of September 25, 2022.\nFair Value Measurements\nThe fair value hierarchy of pension assets at September 24, 2023 is as follows:\n(Thousands of Dollars) NAV Level 1 Level 2 Level 3\nCash and cash equivalents - 1,937 - -\nDomestic equity securities 2,252 30,885 - -\nInternational equity securities - 7,565 5,644 -\nEmerging equity securities - 6,263 - -\nDebt securities - 78,740 52,304 -\nHedge fund investments 24,441 - - -\nThe fair value hierarchy of pension assets at September 25, 2022 was as follows:\n(Thousands of Dollars) NAV Level 1 Level 2 Level 3\nCash and cash equivalents - 1,562 - -\nDomestic equity securities 2,235 67,661 - -\nInternational equity securities - 5,743 4,519 -\nEmerging equity securities - 4,996 - -\nDebt securities - 25,742 65,364 -\nHedge fund investments 32,515 - - -\nThere were no purchases, sales or transfers of assets classified as Level 3 in 2023 or 2022. Pension assets that are excluded from the fair value hierarchy and are measured at net asset value or \"NAV\", include three investments:\nU.S. small cap value equity common/collective fund for which fund prices are not publicly available. The balance of this investment is $2.3 million and $2.2 million as of September 24, 2023 and September 25, 2022, respectively. We can redeem this fund on a monthly basis.\nGlobal equity long/short common/collective hedge fund-of-funds for which fund prices are established on a monthly basis. The balance of this investment is $11.7 million and $16.7 million as of September 24, 2023 and September 25, 2022, respectively. We can redeem up to 90% of our investment in this fund within 90-120 days of notice with the remaining distributed following completion of the audit of the Fund's financial statements for the year.\nGlobal equity long/short common/collective hedge fund-of-funds for which fund prices are established on a monthly basis. The balance of this investment is $12.7 million and $15.9 million as of September 24, 2023 and September 25, 2022, respectively. We can redeem up to 50% of our investment in this fund twice per year.\nThe activity within Other comprehensive income (loss) for both pension plans and postretirement plans was as follows:\n(Thousands of Dollars) 2023 2022 2021\nComprehensive (loss) income, net of taxes:\nChange in unrecognized benefit plan gain (loss) arising during the period, net of taxes $240, $279, and $19,148, respectively\n(560) (14,485) 59,663\nAmortization of items to periodic pension and other post-employment benefit costs during the period, net of taxes $3,414, $6,389, and $819, respectively\n10,750 (11,049) 2,574\nOther comprehensive (loss) income recognized in operations, net of taxes 10,190 (25,534) 62,237\nCash Flows\nBased on our forecast at September 24, 2023, we expect to make no contributions to our pension trust in 2024.\nWe anticipate future benefit payments to be paid from the pension trust as follows:\n(Thousands of Dollars)\n2024 16,262\n2025 14,575\n2026 14,816\n2027 14,944\n2028 15,021\n2029-2033 74,092\nOther Plans\nWe are the plan sponsor for other funded and unfunded defined benefit pension plans that are not considered material. The net benefit obligation for these plans are $0.6 million and $1.0 million at September 24, 2023 and September 25, 2022, respectively.\nSubsequent Event\nSubsequent to September 24, 2023, the Company offered a voluntary lump sum payment of future pension benefits to terminated vested participants of the Plan. As of November 30, 2023, 522 participants representing $22.6 million in Plan liabilities have elected to take the voluntary offer.\n8. POSTRETIREMENT AND POSTEMPLOYMENT BENEFITS\nWe provide retiree medical and life insurance benefits under postretirement plans at several of our operating locations. The level and adjustment of participant contributions vary depending on the specific plan. Our liability and related expense for benefits under the postretirement plans are recorded over the service period of active employees based upon annual actuarial calculations. We accrue postemployment disability benefits when it becomes probable that such benefits will be paid and when sufficient information exists to make reasonable estimates of the amounts to be paid.\nThe net periodic postretirement benefit cost (benefit) components for our postretirement plans are as follows:\n(Thousands of Dollars) 2023 2022 2021\nService cost for benefits earned during the year 68 108 207\nInterest cost on projected benefit obligation 598 340 429\nExpected return on plan assets (1,182) (1,053) (1,007)\nAmortization of net actuarial gain (1,014) (994) (685)\nAmortization of prior service benefit (647) (647) (647)\nCurtailment gains - - (23,830)\nNet periodic postretirement benefit (2,177) (2,246) (25,533)\nChanges in benefit obligations and plan assets are as follows:\n(Thousands of Dollars) 2023 2022\nBenefit obligation, beginning of year 12,287 18,538\nService cost 68 108\nInterest cost 598 340\nActuarial (gain) loss (1,049) (4,729)\nBenefits paid, net of premiums received (652) (1,958)\nMedicare Part D subsidies - (12)\nBenefit obligation, end of year 11,252 12,287\nFair value of plan assets, beginning of year 23,903 26,802\nActual return on plan assets 2,393 (2,453)\nEmployer contributions 165 1,525\nBenefits paid, net of premiums and Medicare Part D subsidies received (660) (2,105)\nPlan participant contributions 8 134\nFair value of plan assets at measurement date 25,809 23,903\nFunded status 14,557 11,616\nDisaggregated amounts recognized in the Consolidated Balance Sheets are as follows:\n(Thousands of Dollars) September 24\n2023 September 25\nNon-current assets 21,565 19,066\nPostretirement benefit obligations (7,008) (7,450)\nAccumulated other comprehensive income (before income tax benefit) 19,043 17,327\nAmounts recognized in accumulated other comprehensive income (loss) before income tax benefit are as follows:\n(Thousands of Dollars) September 24\n2023 September 25\nUnrecognized net actuarial gain 16,660 14,298\nUnrecognized prior service benefit 2,383 3,029\n19,043 17,327\nWe expect to recognize $1.2 million and $0.4 million of unrecognized net actuarial gain and unrecognized prior service benefit, respectively, in net periodic postretirement benefit in 2024.\nAssumptions\nWeighted-average assumptions used to determine postretirement benefit obligations are as follows:\n(Percent) September 24\n2023 September 25\nDiscount rate 5.6 5.3\nExpected long-term return on plan assets 5.0 5.0\nThe assumptions related to the expected long-term return on plan assets are developed through an analysis of historical market returns, current market conditions and composition of plan assets.\nWeighted-average assumptions used to determine net periodic benefit cost are as follows:\n(Percent) 2023 2022 2021\nDiscount rate - service cost 5.9 5.5 2.5\nDiscount rate - interest cost 5.5 5.1 1.9\nExpected long-term return on plan assets 5.0 5.0 4.0\nFor 2023, the expected long-term return on plan assets is 5.0%. The assumptions related to the expected long-term return on plan assets are developed through an analysis of historical market returns, current market conditions and composition of plan assets.\nAssumed health care cost trend rates are as follows:\n(Percent) September 24\n2023 September 25\nHealth care cost trend rates 3.9 10.6\nRate to which the cost trend rate is assumed to decline (the Ultimate Trend Rate) 4.5 4.5\nYear in which the rate reaches the Ultimate Trend Rate 2033 2032\nAdministrative costs related to indemnity plans are assumed to increase at the health care cost trend rates noted above.\nIn 2021, we notified certain participants in one of our postemployment medical plans of changes to their plan, including elimination of coverage for certain participants. These changes resulted in a non-cash curtailment gain of $23.8 million in 2021. The curtailment gain is recorded in Curtailment gain in the Consolidated Statements of Income (loss) and Comprehensive Income (loss). These charges also reduced the postemployment benefit obligation by $23.8 million in 2021.\nFor the year ended September 24, 2023, the most significant driver of the decrease in benefit obligations for the plans was the higher actual return on assets compared to expectations. The plans also recognized actuarial gains due to increases in bond yields that resulted in increases to the discount rates. For the year ended September 25, 2022, the most significant driver of the decrease in benefit obligations for the plans was the higher actuarial gains experienced by all plans. The plans recognized actuarial gains due to significant increases in bond yields that resulted in increases to the discount rates. Discount rate increases were partially offset by actual return on assets falling behind expected returns for the year.\nPlan Assets\nAssets of the retiree medical plan are invested in a master trust. The master trust also pays benefits of active employee medical plans for the same union employees. The fair value of master trust assets allocated to the active employee medical plans at September 24, 2023 and September 25, 2022 is $0.4 million and $0.6 million, respectively, which are included within the tables below.\nThe primary objective of our investment strategy is to satisfy our postretirement obligations at a reasonable cost. Assets are actively invested to balance real growth of capital through appreciation and reinvestment of dividend and interest income and safety of invested funds.\nOur investment policy outlines the governance structure for decision-making, sets investment objectives and restrictions and establishes criteria for selecting and evaluating investment managers. The use of derivatives is strictly prohibited, except on a case-by-case basis where the manager has a proven capability, and only to hedge quantifiable risks such as exposure to foreign currencies. An investment committee, consisting of certain of our executives and supported by independent consultants, is responsible for monitoring compliance with the investment policy. Assets are periodically redistributed to maintain the appropriate policy allocation.\nThe weighted-average asset allocation of our postretirement assets is as follows:\n(Percent) Policy Allocation Actual Allocation\nAsset Class September 24 2023 September 24\n2023 September 25\nEquity securities 20 20 17\nDebt securities 70 68 71\nHedge fund investment 10 12 12\nCash and cash equivalents - - -\nPlan assets include no Company securities. Assets include cash and cash equivalents and receivables from time to time due to the need to reallocate assets within policy guidelines.\nFair Value Measurements\nThe fair value hierarchy of postretirement assets at September 24, 2023 is as follows:\n(Thousands of Dollars) NAV Level 1 Level 2 Level 3\nCash and cash equivalents - 93 - -\nDomestic equity securities 870 2,303 - -\nEmerging equity securities - 535 - -\nInternational equity securities - 814 600 -\nDebt securities - 17,615 - -\nHedge fund investment 2,979 - - -\nThe fair value hierarchy of postretirement assets at September 25, 2022 is as follows:\n(Thousands of Dollars) NAV Level 1 Level 2 Level 3\nCash and cash equivalents - 26 - -\nDomestic equity securities 791 1,910 - -\nEmerging equity securities - 456 - -\nInternational equity securities - 573 480 -\nDebt securities - 17,248 - -\nHedge fund investment 2,782 - - -\nThere were no purchases, sales or transfers of assets classified as Level 3 in 2023 or 2022. Postretirement assets that are excluded from the fair value hierarchy and are measured at net asset value or \"NAV\", include two investments:\nU.S. small cap value equity common/collective fund for which fund prices are not publicly available. The balance of this investment is $0.9 million and $0.8 million as of September 24, 2023 and September 25, 2022, respectively. We can redeem this fund on a monthly basis.\nGlobal equity long/short common/collective hedge fund-of-funds for which fund prices are established on a monthly basis. The balance of this investment is $3.0 million and $2.8 million as of September 24, 2023 and September 25, 2022, respectively. We can redeem up to 90% of our investment in this fund within 90-120 days of notice with the remaining distributed following completion of the audit of the Fund's financial statements for the year.\nCash Flows\nBased on our forecast at September 24, 2023, we do not expect to contribute to our postretirement plans in 2024.\nThe Medicare Prescription Drug, Improvement and Modernization Act of 2003 (the Modernization Act) introduced a prescription drug benefit under Medicare (Medicare Part D) and a federal subsidy to sponsors of retiree health care benefit plans (Subsidy) that provide a benefit at least actuarially equivalent (as that term is defined in the Modernization Act) to Medicare Part D. We concluded we qualify for the Subsidy under the Modernization Act since the prescription drug benefits provided under our postretirement health care plans generally require lower premiums from covered retirees and have lower deductibles than the benefits provided in Medicare Part D and, accordingly, are actuarially equivalent to or better than, the benefits provided under the Modernization Act.\nWe anticipate future benefit payments to be paid either with future contributions to the plan or directly from plan assets, as follows:\n(Thousands of Dollars) Gross\nPayments Less\nMedicare\nPart D\nSubsidy\nNet\nPayments\n2024 906 - 906\n2025 906 - 906\n2026 916 - 916\n2027 933 - 933\n2028 912 - 912\n2029-2033 4,395 - 4,395\nPostemployment Plan\nOur postemployment benefit obligation, which represents certain disability benefits, was $1.6 million at September 24, 2023 and $1.8 million at September 25, 2022.\n9. OTHER RETIREMENT PLANS\nSubstantially all of our employees are eligible to participate in a qualified defined contribution retirement plan. We also have a non-qualified plan for employees whose incomes exceed qualified plan limits.\nThe defined contribution retirement plan costs were $3.5 million in 2023, $3.6 million in 2022 and $3.4 million in 2021.\nMultiemployer Pension Plans\nWe contributed to various multiemployer defined benefit pension plans under the terms of collective bargaining agreements (\"CBAs\"). The risks of participating in these multiemployer plans are different from our Company-sponsored plans in the following aspects:\nWe do not manage the plan investments or any other aspect of plan administration;\nAssets contributed to the multiemployer plan by one employer may be used to provide benefits to employees of other participating employers;\nIf a participating employer stops contributing to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers; and\nIf we choose to stop participating in one or more multiemployer plans, we may be required to fund over time an amount based on the unfunded status of the plan at the time of withdrawal, referred to as a \"withdrawal liability\".\nInformation related to these plans is outlined in the table below:\n(Thousands of Dollars) Zone Status\nSeptember 30 Funding Improvement\nPlan/Rehabilitation Plan\nStatus Contributions\nPension Plan 2023 2022 Status 2023 2022 2021 Surcharge Imposed EIN Expiration Dates of\nCBAs\nGCIU- Employer Retirement Fund Critical Critical Implemented - - 10 No 91-6024903 N/A (1)\nDistrict No. 9, International Association of Machinists and Aerospace Workers Pension Trust Green Endangered N/A - - 15 N/A 51-0138317 N/A (1)\nCWA/ITU negotiated Pension Plan Critical Critical Implemented - - 81 No 13-6212879 N/A (1)\nIAM National Pension Fund Green Green N/A 45 57 67 N/A 51-6031295 N/A (1)\nOperating Engineers Central Pension Fund of the International Union of Operating Engineers and Participating Employers Green Green N/A 32 50 49 N/A 36-6052390 12/31/2023\n(1)The Company has withdrawn from the multiemployer plan\nThe Company has effectuated withdrawals from all but one multiemployer plan. We record estimates of withdrawal liabilities as of the time the contracts agreeing to withdraw from those plans are ratified. As of September 24, 2023 and September 25, 2022, we had $25.1 million and $25.0 million of accrued withdrawal liabilities. The liabilities reflect the estimated net present value of payments to the fund, payable over 20 years.\nSeveral multiemployer plans have CBAs that expire in the next twelve months. It is reasonably possible that if the Company is unable to renegotiate these agreements employees could go on strike which could disrupt the normal operations of the Company. Of our employees in CBAs, approximately 55% have CBAs that expire in the next 12 months.\n10. COMMON STOCK\nWarrant Agreement\nIn connection with the previous 2nd Lien Term Loan entered into as part of the 2014 Refinancing, we entered into the Warrant Agreement. Under the Warrant Agreement, certain affiliates or designees of the 2nd Lien Lenders received on March 31, 2014, their pro rata share of Warrants to purchase, in cash, 600,000 shares of Common Stock, subject to adjustment pursuant to anti-dilution provisions. The Warrants represent, when fully exercised, approximately 10.1% of shares of Common Stock outstanding at March 30, 2014, on a fully diluted basis. The exercise price of the Warrants was $41.90 per share.\nThe Warrant Agreement contained a cash settlement provision in the event of a change of control prior to March 31, 2018, as well as other provisions requiring the Warrants to be measured at fair value and classified as warrants and other liabilities in our Consolidated Balance Sheets. We re-measured the liability to fair value each reporting period, with changes reported in other non-operating income (expense). The initial fair value of the Warrants was $16.9 million. The Warrants expired in March 2022.\nIn connection with the issuance of the Warrants, we entered into the Registration Rights Agreement. The Registration Rights Agreement requires, among other matters, that we use our commercially reasonable efforts to file and maintain the effectiveness for certain specified periods of a shelf registration statement covering the shares of Common Stock upon exercise of the Warrants.\n11. STOCK OWNERSHIP PLANS\nTotal non-cash stock compensation expense is $1.8 million, $1.3 million and $0.9 million, in 2023, 2022 and 2021, respectively.\nAt September 24, 2023, we have reserved 196,359 shares of Common Stock for issuance to employees under an incentive and non-statutory stock option and restricted stock plan approved by stockholders, of which 196,359 shares are available for granting of non-qualified stock options or issuance of restricted Common Stock.\nStock Options\nOptions are granted at a price equal to the fair market value on the date of the grant and are exercisable, upon vesting, over a ten-year period.\nA summary of stock option activity is as follows:\n(Thousands of Shares) 2023 2022 2021\nOutstanding, beginning of year - 36 41\nExercised - (9) (2)\nCanceled - (27) (3)\nOutstanding, end of year - - 36\nExercisable, end of year - - 36\nWeighted average prices of stock options are as follows:\n(Dollars) 2023 2022 2021\nExercised - 11.30 11.30\nCancelled - 11.30 11.30\nOutstanding, end of year - 11.40 11.40\nRestricted Common Stock\nA summary of restricted Common Stock activity is as follows:\n(Thousands of Shares) 2023 2022 2021\nOutstanding, beginning of year 165 154 155\nGranted 69 78 46\nVested (62) (66) (45)\nForfeited (10) (1) (2)\nOutstanding, end of year 162 165 154\nWeighted average grant date fair values of restricted Common Stock are as follows:\n(Dollars) 2023 2022 2021\nOutstanding, beginning of year 21.21 16.70 21.50\nGranted 17.87 30.01 11.20\nVested 17.27 20.93 27.30\nForfeited 24.04 23.60 16.10\nOutstanding, end of year 21.14 21.21 16.70\nTotal unrecognized compensation expense for unvested restricted Common Stock at September 24, 2023 is $1.7 million, which will be recognized over a weighted average period of 1.4 years.\nEmployee Stock Purchase Plans\nWe have 27,000 shares of Common Stock available for issuance pursuant to our Employee Stock Purchase Plan. We also have 870 shares of Common Stock available for issuance under our Supplemental Employee Stock Purchase Plan. There has been no activity under these plans in 2023, 2022, or 2021.\n12. INCOME TAXES\nIncome tax expense (benefit) consists of the following:\n(Thousands of Dollars) 2023 2022 2021\nCurrent:\nFederal 4,528 4,932 (2,431)\nState (336) 142 3,642\nDeferred (4,541) (4,376) 6,044\n(349) 698 7,255\nIncome tax (benefit) expense related to operations differs from the amounts computed by applying the U.S. federal income tax rate to income (loss) before income taxes. The reasons for these differences are as follows:\n(Percent of (Loss) Income Before Income Taxes) 2023 2022 2021\nComputed expected income tax expense 21.0 21.0 21.0\nState income tax benefit, net of federal tax benefit (5.4) (8.9) 5.6\nNet income of associated companies 31.2 (77.2) (1.8)\nResolution of tax matters 69.7 (32.2) 3.2\nRemeasurement due to state rate changes (84.0) (11.2) 0.1\nNon-deductible expenses (28.5) 124.0 0.9\nProvision to return adjustment (0.5) 70.2 -\nValuation allowance 16.0 11.9 (6.0)\nWage credit, net addback - (7.5) -\nWarrant valuation - (1.9) (0.4)\nInterest and penalties (9.0) - -\nOther 0.8 - -\n11.3 88.2 22.6\nNet deferred income tax liabilities consist of the following components:\n(Thousands of Dollars) September 24\n2023 September 25\nDeferred income tax liabilities:\nProperty and equipment (8,461) (11,712)\nIdentified intangible assets (18,705) (21,649)\nASC 842 - Leases DTL (9,890) (11,308)\nOther (615) -\nInvestments (31,296) (26,489)\n(68,967) (71,158)\nDeferred income tax assets:\nAllowance for credit losses 1,655 802\nPension and postretirement benefits 1,102 3,445\nLong-term debt 159 161\nInterest deduction limitation 9,828 4,809\nOperating loss carryforwards 25,749 26,224\nASC 842 - Leases DTA 11,037 13,112\nAccrued compensation 2,341 1,914\nAccrued expenses 1,510 1,663\nOther - 2,964\n53,381 55,094\nValuation allowance (25,765) (26,655)\nNet deferred income tax liabilities (41,351) (42,719)\nAll deferred taxes are categorized as non-current.\nA reconciliation of 2023 and 2022 changes in gross unrecognized tax benefits is as follows:\n(Thousands of Dollars) 2023 2022\nBalance, beginning of year 18,242 18,279\nChanges in tax positions for prior years (687) (307)\nIncreases (decrease) in tax positions for the current year (347) 1,887\nLapse in statute of limitations (2,294) (1,617)\nBalance, end of year 14,914 18,242\nApproximately $10.7 million and $11.9 million of the gross unrecognized tax benefit balances for 2023 and 2022, respectively, relate to state net operating losses which are netted against deferred taxes on our Consolidated Balance Sheet. The total amount of unrecognized tax benefits that, if recognized, would impact the effective tax rate was $2.5 million at September 24, 2023. The Company does not expect that unrecognized tax benefits will fluctuate significantly in the next twelve months. We recognize interest and penalties related to unrecognized tax benefits as a component of income tax expense. The amount of accrued interest related to unrecognized tax benefits was, net of tax, $1.2 million at September 24, 2023 and $1.5 million at September 25, 2022. There were no amounts provided for penalties at September 24, 2023 or September 25, 2022.\nAt September 24, 2023 and September 25, 2022, we had a deferred tax asset of $9.8 million and $4.8 million, respectively, related to disallowed interest expense.\nThe Company is current undergoing a New York Franchise Tax audit that includes fiscal year periods 2019 through 2021. Certain of the Company's state income tax returns for the year ended September 25, 2016 are open for examination. The Federal and remaining state returns are open beginning with the September 24, 2017 year.\nAt September 24, 2023, we have state tax benefits of approximately $43.3 million in net operating loss (\"NOL\") carryforwards that expire between 2022 and 2040. These NOL carryforwards result in a deferred income tax asset of $34.2 million at September 24, 2023, a portion of which is offset by a valuation allowance.\n13. FAIR VALUE OF FINANCIAL INSTRUMENTS\nThe following methods and assumptions are used to estimate the fair value of each class of financial instruments for which it is practicable to estimate value.\nThe carrying amounts of cash equivalents, accounts receivable and accounts payable approximate fair value because of the short maturity of those instruments. Certain other investments totaling $3.9 million, including our 16.7% ownership of the non-voting common stock and 0.7% of the voting common stock of TCT, which represents 8.7% of total TCT stock, and a private equity investment, are carried at cost. Certain other investments totaling $1.7 million, which include securities held in trust under a deferred compensation arrangement, are carried at fair value with gains and losses reported in earnings. These represent Level 2 fair value measurements.\nAt September 24, 2023, we had no floating rate debt. Our fixed rate debt consists of $455.7 million principal amount of the Term Note. At September 24, 2023 the fair value is $392.2 million. This represents a Level 2 fair value measurement.\nAs discussed more fully in Notes 5 and 10, we recorded a liability for the Warrants issued in connection with the Warrant Agreement. The liability was initially measured at its fair value and we re-measure the liability to fair value each reporting period, with changes reported in other non-operating income (expense). The initial fair value of the Warrants was $16.9 million. The fair value of the Warrants at September 24, 2023, September 25, 2022, and September 26, 2021 was zero, $0.1 million and $0.3 million, respectively. In other, net non-operating income (expense) in the Consolidated Statements of Income (loss) and Comprehensive Income (Loss), we recognized income of $0 in 2023, $0.1 million in 2022, and $0.3 million in 2021, for adjustments in the fair value of the Warrants. The Warrants expired in March 2022.\nThe following assumptions were used to estimate the fair value of the Warrants:\n2023 2022 2021\nVolatility (Percent) - - 43\nRisk-free interest rate (Percent) - - 0.05\nExpected term (Years) - - 0.5\nEstimated fair value (Dollars) - - 0.12\n14. EARNINGS PER COMMON SHARE\nThe following table sets forth the computation of basic and diluted earnings per common share:\n(Thousands of Dollars and Shares, Except Per Common Share Data) 2023 2022 2021\n(Loss) income attributable to Lee Enterprises, Incorporated: (5,267) (2,017) 22,745\nWeighted average Common Stock 6,037 5,946 5,873\nLess non-vested restricted Common Stock (170) (167) (156)\nBasic average Common Stock 5,867 5,779 5,717\nDilutive stock options and restricted Common Stock - - 109\nDiluted average Common Stock 5,867 5,779 5,826\nEarnings per common share:\nBasic: (0.90) (0.35) 3.98\nDiluted (0.90) (0.35) 3.90\nFor 2021 we had 600,000 weighted average shares not considered in the computation of diluted earnings per share because the exercise prices of the related stock options and Warrants were in excess of the fair market value of our Common Stock. For 2023 and 2022 we had 48,955 and 74,304 weighted average shares, respectively, not considered in the computation of diluted earnings per share because the Company recorded net losses.\n15. ALLOWANCE FOR CREDIT LOSSES\nValuation and qualifying account information related to the allowance for credit losses related to continuing operations is as follows:\n(Thousands of Dollars) 2023 2022 2021\nBalance, beginning of year 5,237 6,574 13,431\nAdditions charged to expense 6,942 5,190 1,505\nDeductions from reserves (6,919) (6,527) (8,362)\nBalance, end of year 5,260 5,237 6,574\n16. OTHER INFORMATION\nCompensation and other accrued liabilities consist of the following:\n(Thousands of Dollars) September 24\n2023 September 25\nCompensation 9,114 20,815\nRetirement plans 327 549\nOther 20,007 23,376\n29,448 44,740\nSupplemental cash flow information includes the following cash payments:\n(Thousands of Dollars) 2023 2022 2021\nInterest 41,471 41,770 45,214\nIncome tax payments, net 3,722 5,311 7,604\nAccumulated other comprehensive income (loss), net of deferred income taxes at September 24, 2023, and September 25, 2022, is related to pension and postretirement benefits.\n17. COMMITMENTS AND CONTINGENT LIABILITIES\nCapital Expenditures\nAt September 24, 2023, we had construction and equipment purchase commitments totaling approximately $3.7 million.\nIncome Taxes\nCommitments exclude unrecognized tax benefits to be recorded in accordance with ASC Topic 740, Income Taxes. We are unable to reasonably estimate the ultimate amount or timing of cash settlements with the respective taxing authorities for such matters. See Note 12.\nWe file income tax returns with the Internal Revenue Service and various state tax jurisdictions. From time to time, we are subject to routine audits by those agencies, and those audits may result in proposed adjustments. We have considered the alternative interpretations that may be assumed by the various taxing agencies, believe our positions taken regarding our filings are valid, and that adequate tax liabilities have been recorded to resolve such matters. However, the actual outcome cannot be determined with certainty and the difference could be material, either positively or negatively, to the Consolidated Statements of Income and Comprehensive Income (Loss) in the periods in which such matters are ultimately determined. We do not believe the final resolution of such matters will be material to our consolidated financial position or cash flows.\nWe have various income tax examinations ongoing and at various stages of completion, but generally our income tax returns have been audited or closed to audit through 2014.\nLegal Proceedings\nWe are involved in a variety of legal actions that arise in the normal course of business. Insurance coverage mitigates potential loss for certain of these matters. While we are unable to predict the ultimate outcome of these legal actions, it is our opinion that the disposition of these matters will not have a material adverse effect on our Consolidated Financial Statements, taken as a whole.\nReport of Independent Registered Public Accounting Firm\nStockholders and Board of Directors\nLee Enterprises, Incorporated\nDavenport, Iowa\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Lee Enterprises, Incorporated (the Company) as of September 24, 2023 and September 25, 2022, the related consolidated statements of income (loss) and comprehensive income (loss), stockholders equity (deficit), and cash flows for the fiscal years ended September 24, 2023 and September 25, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 24, 2023, and September 25, 2022, and the results of its operations and its cash flows for the fiscal years ended September 24, 2023, and September 25, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 24, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and our report dated December 8, 2023, expressed an adverse opinion thereon.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) related to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nValuation of indefinite-lived mastheads\nAs described in Notes 1 and 4 to the consolidated financial statements, the Companys non-amortized intangible assets in mastheads are $18.7 million as of September 24, 2023. The Company reviews the indefinite-lived mastheads for impairment on an annual basis or more frequently if events or changes in circumstances indicate the assets might be impaired. The impairment test consists of comparing the fair value of each masthead with its carrying amount. The Company determines fair value using the relief from royalty method, which utilizes a discounted cash flow model to determine the fair value of each masthead. The significant assumptions used in the determination of the fair value of indefinite-lived mastheads are the discount\nrate (weighted-average cost of capital) and royalty rates. During the year ended September 24, 2023, the Company recognized impairments of $7.7 million on these indefinite-lived mastheads.\nWe identified the determination of the fair values of the indefinite-lived mastheads as a critical audit matter because of the significant estimates and assumptions the Company makes to calculate their fair value, specifically the discount rate and royalty rates. Auditing the significant assumptions involved a high degree of subjective auditor judgment due to their significant estimation uncertainty, including the extent of specialized skills and knowledge needed.\nThe following are the primary procedures we performed to address this critical audit matter:\nUtilizing personnel with specialized skills and knowledge in valuation, who assisted in:\nEvaluating the discount rate by developing an independent expectation range using independently obtained market data of guideline public companies and compared to the rate used by the Company; and\nEvaluating the royalty rates by (i) evaluating managements profit-split analysis and (ii) comparing them to a range based on publicly available royalty rates.\n/s/ BDO USA, P.C.\nWe have served as the Company's auditor since 2021.\nChicago, Illinois\nDecember 8, 2023\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nLee Enterprises, Incorporated:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated statements of income (loss) and comprehensive income (loss), stockholders equity (deficit), and cash flows of Lee Enterprises, Incorporated and subsidiaries (the Company) for the 52-week period ended September 26, 2021, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the results of the Companys operations and its cash flows for the 52-week period ended September 26, 2021, in conformity with U.S. generally accepted accounting principles.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ KPMG LLP\nWe served as the Companys auditor from 2008 to 2021.\nChicago, Illinois\nDecember 10, 2021\nEXHIBIT INDEX\nExhibits marked with an asterisk (*) are incorporated by reference to documents previously filed by us with the SEC, as indicated. Exhibits marked with a plus (+) are management contracts or compensatory plan contracts or arrangements filed pursuant to Item 601(b)(10)(iii)(A) of Regulation S-K. All other documents listed are filed with this Annual Report on Form 10-K.\nNumber Description\n3.1 * Amended and Restated Certificate of Incorporation of Lee Enterprises, Incorporated effective as of January 30, 2012 (Exhibit 3.1 to Form 8-K filed on February 3, 2012)\n3.2 * Second Amended and Restated By-Laws of Lee Enterprises, Incorporated effective as of June 26, 2019 (Exhibit 3.1 to Form 8-K filed June 27, 2019)\n4.1 * Form of Indenture of Lee Enterprises, Incorporated (Exhibit 4.3 to Form S-3 Registration Statement filed on February 10, 2020)\n4.2 * Warrant Agreement dated as of March 31, 2014 between Lee Enterprises, Incorporated and Equiniti Trust Company (formerly Wells Fargo Bank, National Association) (Exhibit 4.2 to Form 8-K filed on April 4, 2014)\n4.3 * Registration Rights Agreement dated as of March 31, 2014 among Lee Enterprises, Incorporated, Mudrick Capital Management, LP, Hawkeye Capital Management, LLC, Cohanzick Management, LLC, Aristeia Capital, L.L.C., CVC Credit Partners, LLC, Franklin Mutual Advisors, LLC and Wingspan Master Fund, LP (Exhibit 4.3 to Form 8-K filed on April 4, 2014)\n4.4 * Rights Agreement dated as of November 24, 2021, between Lee Enterprises, Incorporated and Equiniti Trust Company, as Rights Agent (Exhibit 4.1 to Current Report on Form 8-K filed on November 24, 2021)\n10.1 * Asset and Stock Purchase Agreement dated January 29, 2020 by and among Lee Enterprises, Incorporated, Berkshire Hathaway Inc. and BH Media Group, Inc. (Exhibit 10.1 to Form 8-K filed on January 29, 2020)\n10.2 * Credit Agreement dated January 29, 2020 by and between Lee Enterprises, Incorporated and BH Finance LLC (Exhibit 10.2 to Form 8-K filed on January 29, 2020)\n10.3 * Form of Lease Agreement by and between Lee Enterprises, Incorporated and BH Media Group, Inc. (Exhibit 10.3 to Form 8-K filed on January 29, 2020)\n10.4 * Operating Agreement of St. Louis Post-Dispatch LLC, dated as of May 1, 2000, as amended by Amendment No. 1 to Operating Agreement of St. Louis Post-Dispatch LLC, dated as of June 1, 2001 (Exhibit 10.5 to Form 10-Q for the Fiscal Quarter Ended June 30, 2005)\n10.5 * Amendment Number Two to Operating Agreement of St. Louis Post-Dispatch LLC, effective February 18, 2009, between Pulitzer Inc. and Pulitzer Technologies, Inc. (Exhibit 10.13 to Form 10-Q for the Fiscal Quarter Ended March 29, 2009)\n10.6 * Amended and Restated Joint Operating Agreement, dated December 22, 1988, between Star Publishing Company and Citizen Publishing Company (Exhibit 10.2 to Form 10-Q for the Fiscal Quarter Ended June 30, 2005)\nNumber Description\n10.7 * Amended and Restated Partnership Agreement, dated as of November 30, 2009, between Star Publishing Company and Citizen Publishing Company (Exhibit 10.2 to Form 10-Q for the Fiscal Quarter Ended December 27, 2009)\n10.8 * Amended and Restated Management Agreement, dated as of November 30, 2009, between Star Publishing Company and Citizen Publishing Company (Exhibit 10.1 to Form 10-Q for the Fiscal Quarter Ended December 27, 2009)\n10.9 * License Agreement (Star), as amended and restated November 30, 2009, between Star Publishing Company and TNI Partners (Exhibit 10.3 to Form 10-Q for the Fiscal Quarter Ended December 27, 2009)\n10.10 * License Agreement (Citizen), as amended and restated November 30, 2009, between Citizen Publishing Company and TNI Partners (Exhibit 10.4 to Form 10-Q for the Fiscal Quarter Ended December 27, 2009)\n10.11 * License Agreement, dated as of May 1, 2000, by and between Pulitzer Inc. and St. Louis Post-Dispatch LLC (Exhibit 10.7 to Form 10-Q for the Fiscal Quarter Ended June 30, 2005)\n10.12 * Non-Confidentiality Agreement, dated as of May 1, 2000 (Exhibit 10.10 to Form 10-Q for the Fiscal Quarter Ended June 30, 2005)\n10.13.1+ * Lee Enterprises, Incorporated 2020 Long-Term Incentive Plan (effective February 19, 2020) (Exhibit 4.2 to Registration Statement on Form S-8 (Reference No. 333-237605) filed on April 8, 2020)\n10.13.2+* Form of Restricted Stock Agreement related to Lee Enterprises, Incorporated 2020 Long-Term Incentive Plan (Effective February 19, 2020) (Exhibit 10.2 to Form 8-K filed on February 23, 2016)\n10.13.3+ * Form of Incentive Stock Option Agreement related to Lee Enterprises, Incorporated 2020 Long-Term Incentive Plan (Effective February 19, 2020) (Exhibit 10.3 to Form 8-K filed on February 23, 2016)\n10.13.4+ * Form of Non-Qualified Stock Option Agreement related to Lee Enterprises, Incorporated 2020 Long-Term Incentive Plan (Effective February 19, 2020) (Exhibit 10.4 to Form 8-K filed on February 23, 2016)\n10.14 +* Lee Enterprises, Incorporated Supplementary Benefit Plan, Amended and Restated as of January 1, 2008 (Exhibit 10.25 to Form 10-K for the Fiscal Year Ended September 28, 2008)\n10.15+ * Lee Enterprises, Incorporated Outside Directors Deferral Plan, Amended and Restated as of January 1, 2008 (Exhibit 10.26 to Form 10-K for the Fiscal Year Ended September 28, 2008)\n10.16.1+* Form of Amended and Restated Employment Agreement between Lee Enterprises, Incorporated and its President and Chief Executive Officer (Exhibit 10.31.2 to Form 10-K for the Fiscal Year Ended September 30, 2018)\n10.16.2+* Form of Employment Agreement between Lee Enterprises, Incorporated and Certain of its Senior Executive Officers (Exhibit 10.31.3 to Form 10-K for the Fiscal Year Ended September 30, 2018)\nNumber Description\n10.17+* Form of Indemnification Agreement for Lee Enterprises, Incorporated Directors and Executive Officers Group (Exhibit 10.32 to Form 10-K for the Fiscal Year Ended September 30, 2018)\n10.18+* Lee Enterprises, Incorporated Amended and Restated Incentive Compensation Program (Effective February 22, 2017) (Appendix B to Schedule 14A Definitive Proxy Statement for 2017)\n19 Lee Enterprises, Incorporated Insider Trading Policy effective as of September 21, 2023\n21 Subsidiaries and associated companies\n23 Consent of KPMG LLP, Independent Registered Public Accounting Firm\n23.1 Consent of BDO USA, P.C., Independent Registered Public Accounting Firm\n24 Power of Attorney\n31.1 Certification of Chief Executive Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2 Certification of Chief Financial Officer Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32 Certification of Chief Executive Officer and Chief Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97 Lee Enterprises, Incorporated Recovery of Erroneously Awarded Executive Compensation Policy effective as of September 21, 2023\n101.INS Inline XBRL Instance Document (the Instance Document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized on the 8th day of December 2023.\nLEE ENTERPRISES, INCORPORATED\n/s/ Kevin D. Mowbray /s/ Timothy R. Millage\nKevin D. Mowbray Timothy R. Millage\nPresident and Chief Executive Officer Vice President, Chief Financial Officer and Treasurer\n(Principal Executive Officer) (Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in their respective capacities on the 8th day of December 2023.\nSignature\n/s/ Steven C. Fletcher Director\nSteven C. Fletcher\n/s/ Margaret R. Liberman Director\nMargaret R. Liberman\n/s/ Mary E. Junck Director\nMary E. Junck\n/s/ Brent M. Magid Director\nBrent M. Magid\n/s/ Shaun E. McAlmont Director\nShaun E. McAlmont\n/s/ Herbert W. Moloney III Director\nHerbert W. Moloney III\n/s/ David T. Pearson Director\nDavid T. Pearson\n/s/ Gregory P. Schermer Director\nGregory P. Schermer\n/s/ Kevin D. Mowbray President and Chief Executive Officer, and Director\nKevin D. Mowbray\n/s/ Timothy R. Millage Vice President, Chief Financial Officer and Treasurer\nTimothy R. Millage"
}