{
    "cik": "63296",
    "company": "MATTHEWS INTERNATIONAL CORP",
    "filing_type": "10-K",
    "filing_date": "2023-11-17",
    "period_of_report": "2023-09-30",
    "sic": "3360",
    "state_of_inc": "PA",
    "state_location": "PA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/63296/0000063296-23-000103-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/63296/000006329623000103/matw-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/63296/0000063296-23-000103.txt",
    "filename": "63296_10K_2023_0000063296-23-000103.htm",
    "content": "ITEM 1. BUSINESS.\nMatthews, founded in 1850 and incorporated in Pennsylvania in 1902, is a global provider of memorialization products, industrial technologies and brand solutions. Memorialization products consist primarily of bronze and granite memorials and other memorialization products, caskets, cremation-related products, and cremation and incineration equipment primarily for the cemetery and funeral home industries. Industrial Technologies includes the design, manufacturing, service and distribution of high-tech custom energy storage solutions; product identification and warehouse automation technologies and solutions, including order fulfillment systems for identifying, tracking, picking and conveying consumer and industrial products; and coating and converting lines for the packaging, pharma, foil, décor and tissue industries. SGK Brand Solutions consists of brand management, pre-media services, printing plates and cylinders, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries.\nITEM 1. BUSINESS, (continued)\nThe Company manages its business under three reporting segments, Memorialization, Industrial Technologies, and SGK Brand Solutions. The following table sets forth reported sales for the Company's business segments for the past three fiscal years. Detailed financial information relating to business segments and to domestic and international operations is presented in Note 20, \"Segment Information\" in Item 8 - \"Financial Statements and Supplemental Data.\"\nYears Ended September 30,\n2023 2022 2021\nSales to external customers: (Dollar amounts in thousands)\nMemorialization $ 842,997 $ 840,124 $ 769,016\nIndustrial Technologies 505,751 335,523 284,495\nSGK Brand Solutions 532,148 586,756 617,519\nConsolidated Sales $ 1,880,896 $ 1,762,403 $ 1,671,030\nIn fiscal 2023, approximately 65% of the Company's sales were made from North America, 30% were made from Europe, 3% were made from Asia, and 2% were made from other regions. For further information on segments, see Note 20, \"Segment Information\" in Item 8 - \"Financial Statements and Supplementary Data.\" Memorialization segment products are sold throughout the world, with the segment's principal operations located in North America, Europe, and Australia. The Industrial Technologies segment sells equipment and consumables directly to industrial consumers and distributors in North America and internationally through the Company's subsidiaries in Sweden, Germany and China, and other foreign distributors. Matthews owns a minority interest in Industrial Technologies product distributors in Asia, Australia and Europe. Products and services of the SGK Brand Solutions segment are sold throughout the world, with principal locations in North America, Europe and Asia.\nMemorialization:\nThe Memorialization segment manufactures and markets a full line of memorialization products used primarily in cemeteries, funeral homes and crematories. The segment's products, which are sold principally in North America, Europe and Australia, include cast bronze memorials, granite memorials, caskets, cremation-related products, cremation and incineration equipment and other memorialization products. The segment also manufactures and markets architectural products that are used to identify or commemorate people, places, events and accomplishments.\nMemorial products include flush bronze and granite memorials, upright granite memorials and monuments, concrete burial vaults, cremation memorialization products, granite benches, flower vases, crypt plates and letters, cremation urns, niche units, cemetery features and statues, along with other related products and services. Flush memorials are bronze plaques or granite memorials that contain personal information about a deceased individual (such as name, birth date and death date), photos and emblems. Flush bronze and granite memorials are even or \"flush\" with the ground and therefore are preferred by many cemeteries for easier lawn mowing and general maintenance. The segment's memorial products also include community and family mausoleums within North America. The segment's other memorial products include bronze plaques, letters, emblems, vases, lights and photo ceramics that can be affixed to granite monuments, mausoleums, crypts and flush memorials. Principal customers for memorial products are cemeteries and memorial parks, which in turn sell the Company's products to the consumer.\nThe Memorialization segment manufactures a full line of cremation-related products, including cremation urns in a variety of sizes, styles and shapes as well as standard and custom designed granite cremation pedestals and benches. Manufactured bronze and granite niche units are comprised of numerous compartments used to display cremation urns in mausoleums and churches. The Company also markets turnkey cremation gardens that include design and all related products for a cremation memorial garden.\nCustomers of the Memorialization segment can purchase memorials and vases on a \"pre-need\" basis. This concept permits families to arrange for these purchases in advance of their actual need. Upon request, the Company will manufacture the memorial to the customer's specifications (e.g., name and birth date) and place it in storage for future delivery. Memorials in storage have been paid in full with title conveyed to each pre-need purchaser.\nThe segment is a leading manufacturer and distributor of caskets and other funeral home products in North America, producing and marketing metal, wood and cremation caskets. Caskets are offered in a variety of colors, interior designs, handles and trim in order to accommodate specific religious, ethnic or other personal preferences and can also be personalized. Other specialized funeral home products such as urns, jewelry, interior panels, and stationery are also offered.\nITEM 1. BUSINESS, (continued)\nMetal caskets are made from various gauges of cold-rolled steel, stainless steel, copper and bronze. Metal caskets are generally categorized by whether the casket is non-gasketed or gasketed, and by material (i.e., bronze, copper, or steel) and in the case of steel, by the gauge (thickness) of the metal. Wood caskets are primarily manufactured from nine different species of wood. The species of wood used are poplar, pine, ash, oak, pecan, maple, cherry, walnut and mahogany. The Memorialization segment is a leading manufacturer of all-wood constructed caskets, which are manufactured using pegged and dowelled construction, and include no metal parts. Cremation caskets are made primarily from wood or cardboard covered with cloth or veneer. These caskets appeal primarily to cremation consumers, environmentally concerned consumers and value buyers.\nThe Memorialization segment produces casket components, which include stamped metal parts, metal locking mechanisms for gasketed metal caskets and adjustable beds. Metal casket parts are produced by stamping cold-rolled steel, stainless steel, copper and bronze sheets into casket component parts. Locking mechanisms and adjustable beds are produced by stamping and assembling a variety of steel parts. The segment purchases various species of uncured wood from sawmills and lumber distributors, which it dries and cures before being processed into casket components.\nThe segment provides product and service assortment planning, as well as merchandising and display products to funeral service businesses. The Memorialization segment develops and sells technology solutions that help funeral homes manage their businesses and serve families through these digital platforms. Solutions are delivered as software as a service and include funeral home management systems and web-based arrangement and presentation systems. These products assist funeral service professionals in providing information, value and satisfaction to their client families.\nThe segment offers cremation systems, crematory management, and cremation service and supplies to the pet and human sector, and standard and specialized incineration systems, including abated filtration systems to satisfy strict environmental requirements. The primary market areas for these products and services are North America and Europe, although the segment also sells into Latin America and the Caribbean, Australia, Africa, the Middle East and Asia.\nCremation systems include flame-based systems for cremation of humans and pets, as well as equipment for processing the cremated remains and other related equipment (ventilated workstations, loading systems, tables, cooler racks, vacuums). The principal markets for these products are funeral homes, cemeteries, crematories, pet crematories, animal disposers and veterinarians. These products primarily are marketed directly by segment personnel. Human crematory management/operations represent the actual operation and management of client-owned crematories. Currently the segment provides these services primarily to municipalities and private operators in Europe. Cremation service and supplies consist of operator training, preventative maintenance and on-demand service work performed on various makes and models of equipment. This work can be as simple as replacing defective bulbs or as complex as complete reconstruction and upgrading or retrofitting on site. Supplies are consumable items and replacement parts associated with normal crematory operations.\nWaste incineration systems encompass both batch load and continuous feed, static, stepped-hearth and rotary systems for incineration of many waste types, as well as equipment for in-loading waste, out-loading ash and energy recovery. The principal markets for these products are animal and medical waste disposal, oil and gas \"work camp\" wastes, industrial wastes and bio-mass generators, as well as destruction of low-volume, high-value waste types such as contraband and pharmaceutical products. Environmental and energy systems include emissions filtration units, waste heat recovery equipment, waste gas treatment products, as well as energy recovery. The segment also provides commissioning, training and user support for customers of incineration systems. The principal markets are municipalities or public/state agencies, the cremation industry and other industries that utilize incinerators for waste reduction and energy production.\nArchitectural products include cast bronze and aluminum plaques, etchings and letters that are used to recognize, commemorate and identify people, places, events and accomplishments. The Company's plaques are frequently used to identify the name of a building, or the names of companies or individuals located within a building. Such products are also used to commemorate events or accomplishments, such as military service or financial donations. The principal markets for the segment's architectural products are corporations, fraternal organizations, contractors, churches, hospitals, schools and government agencies. These products are sold to and distributed through a network of independent dealers including sign suppliers, awards and recognition companies, and trophy dealers.\nITEM 1. BUSINESS, (continued)\nRaw materials used by the Memorialization segment to manufacture memorials consist principally of bronze and aluminum ingot, granite, sheet metal, coating materials, photopolymers and construction materials and are generally available in adequate supply. Ingot is obtained from various North American, European and Australian smelters. The primary materials required for casket manufacturing are cold-rolled steel and lumber. The segment also purchases copper, bronze, stainless steel, particleboard, corrugated materials, paper veneer, cloth, ornamental hardware and coating materials. Purchase orders or supply agreements are typically negotiated with steel suppliers that have demonstrated timely delivery, high quality material and competitive prices. Lumber is purchased from a number of sawmills and lumber distributors. Raw materials used to manufacture cremation and incineration products consist principally of structural steel, sheet metal, electrical components, combustion devices and refractory materials. These are generally available in adequate supply from numerous suppliers.\nCompetition from other manufacturers of memorial products is based on reputation, product quality, delivery, price, and design availability. The Company believes that its superior quality, broad product lines, innovative designs, delivery capability, customer responsiveness, experienced personnel and consumer-oriented merchandising systems are competitive advantages in its markets. Competition in the mausoleum construction industry includes various construction companies throughout North America and is based on design, quality and price. Competitors in the architectural market are numerous and include companies that manufacture cast and painted signs, plastic materials, sand-blasted wood and other fabricated products.\nThe Memorialization segment markets its casket products in the United States through a combination of Company-owned and independent casket distribution facilities. The segment's casket products are primarily sold through Company-owned distribution centers throughout the United States. The casket business is highly competitive and the Company competes with other manufacturers based on product quality, price, service, design availability and breadth of product line. The Memorialization segment provides a line of casket products that it believes is as comprehensive as any of its major competitors. There are a large number of casket industry participants operating in North America, and a few foreign casket manufacturers, primarily from China, participating in the North American market.\nThe Company competes with several manufacturers in the cremation and accessory equipment market principally based on product design, quality and price. The Memorialization segment and its three largest global competitors account for a substantial portion of the United States and European cremation equipment market.\nThe Memorialization segment works to provide a total solution to customers that own and operate businesses in both the cemetery and funeral home markets. The Company's memorial and casket products serve the relatively stable casketed and in-ground burial death market, while its memorial products and cremation and incineration equipment also serve the growing cremation market.\nIndustrial Technologies:\nThe Industrial Technologies segment includes the design, manufacturing, service and distribution of high-tech custom energy storage solutions; product identification and warehouse automation technologies and solutions, including order fulfillment systems for identifying, tracking, picking and conveying consumer and industrial products; and coating and converting lines for the packaging, pharma, foil, décor and tissue industries.\nThe energy storage solutions business produces engineered calendering, laminating, and coating equipment used in the manufacturing of lithium-ion batteries and components of fuel cells. The segment currently delivers products to several major vehicle producers and is actively pursuing opportunities with several other electric vehicle and tier-one battery manufacturers. The segment also offers service, spare parts, calender- and coating-roller refurbishing and retrofits of complete production lines.\nThe coating and converting solutions business produces both complete production lines and individual units for drying, treating, coating, laminating and winding for the packaging, paper, labeling and foil industry as well as technical textiles and pharma industry but also for embossing, finishing, smoothing, perforating and calibrating web materials. The business supplies high-tech machines to large global customers and develops solutions collaboratively with them to make their processes more resource-efficient and their products more sustainable.\nProduction capabilities are available in Germany, the Czech Republic and the United States, with design and assembly in Germany, Switzerland, Czech Republic, Canada and the United States. The business is globally active with well-established customer relations.\nITEM 1. BUSINESS, (continued)\nThe energy storage solutions business has experienced significant growth primarily reflecting increasing demand for electric vehicles, as well as the expansion of renewable energy production globally. The segment has nearly a decade of experience in developing dry electrode battery solutions. Dry electrode technology makes producing lithium-ion batteries less expensive than the wet electrode process, and dry electrode manufacturing is also less impactful on the environment. These factors could contribute to increased utilization of dry electrode batteries in the electric vehicle market, and thus greater demand for this form of battery in the future.\nProduct identification systems range from stand-alone marking products to complex ink-jet printing systems that integrate into a customer's production process. The Company manufactures and markets products and systems that employ different marking technologies, including laser and ink-jet printing. These technologies apply product information required for identification and traceability, as well as to facilitate inventory and quality control, regulatory compliance and brand name communication. The segment also develops innovative, custom solutions to address specific customer requirements in a variety of industries, including oil field services and security scanning.\nWarehouse automation systems complement the tracking and distribution of a customer's products with automated order fulfillment technologies, and controls for material handling systems. Material handling customers include some of the largest retail, e-commerce, and third-party logistics companies in the United States.\nA significant portion of the revenue of the Industrial Technologies segment is attributable to the sale of consumables and replacement parts required by the marking, coding and tracking products sold by Matthews. The Company develops inks exclusively for the use with its marking equipment, which is critical to ensure ongoing equipment reliability and mark quality.\nThe principal customers for the Company's marking and fulfillment systems products are manufacturers, suppliers and distributors of durable goods, building products, consumer goods manufacturers (including food and beverage processors) and producers of pharmaceuticals. The Company also serves a wide variety of industrial markets, including metal fabricators, manufacturers of woven and non-woven fabrics, plastic, rubber and automotive products.\nA portion of this segment's sales are outside the United States, sourced through the Company's subsidiaries in Sweden, Germany, Malaysia and China in addition to other international distributors. The Company owns a minority interest in distributors in Asia, Australia and Europe.\nMajor raw materials for this segment's products include precision components, electronics, printing components, chemicals, steel, copper, and film all of which are presently available in adequate supply from various sources.\nCompetitors in the marking and fulfillment systems industries are diverse, with some companies offering limited product lines for well-defined specialty markets, while others operate similarly to the Company, offering a broad product line and competing in multiple product markets and countries. Competitive differentiation for marking and fulfillment systems products is based on product performance, ease of integration into the manufacturing and/or distribution process, service and price. The Company typically competes with specialty companies in specific brand marking solutions and traceability applications. In the energy storage solutions business, the Company has patents and pending patent applications on its dry electrode calendering equipment. The Company believes that, in general, its Industrial Technologies segment offers one of the broadest lines of products to address a wide variety of high-tech custom energy storage solutions, product identification and warehouse automation applications.\nSGK Brand Solutions:\nThe SGK Brand Solutions segment provides packaging and brand experience solutions that simplify marketing, amplify brands and deliver value. Matthews has more than 100 years in the packaging business, which is comprised of broad technical, engineering, and artistic expertise relating to the creation and production of graphics, their workflows and best practices for the commercial packaging and retail channels. This combination of knowledge, experience and skill helps the SGK Brand Solutions segment differentiate itself from competitors.\nThe SGK Brand Solutions segment helps companies to define, create, produce and transform their packaging and marketing supply chains and the brand assets that flow through them. By simplifying marketing, the segment helps deliver greater speed through workflow efficiency, enabling clients to get new product introductions and campaigns to market faster which can result in a competitive advantage for the brand. By amplifying brands, the segment helps brands create meaningful experiences online and offline that enable them to stand out in the marketplace which can result in a stronger connection between consumers and the brand. The SGK Brand Solutions segment also helps clients deliver improved marketing productivity and profitability through innovative technology solutions.\nITEM 1. BUSINESS, (continued)\nThe packaging solutions part of its business integrates all packaging-related services from the beginning to the end of the packaging development workflow process. Clients may purchase stand-alone services or a combination of services that are designed to fulfill larger, more strategic objectives. These services include design and adaptive packaging design, production art, photography, retouching, the creation of e-commerce assets, premedia, print technical services, cylinder and flexo printing plate production, workflow efficiency consulting, change management and technology workflow solutions. Historically a print media based business, the business leverages their 100+ years of packaging expertise to create packaging assets required for the e-commerce channel. The business has evolved from creating and delivering graphic brand assets for a single medium (package on shelf) which required output for printing, into one that is deeply entrenched in a brands journey across multiple mediums, requiring an almost infinite array of digital asset output across an ever-expanding multi-channel universe.\nThe brand experience part of the business integrates all marketing-related services from the beginning to the end of the marketing development workflow process. Clients may purchase stand-alone services or a combination of services that are designed to fulfill larger, more strategic objectives. These services include all the services that help create brand experiences: consumer insights, brand strategy, brand identity, content marketing strategy, marketing content creation, campaign strategy and development, online and in-store retail experiences and merchandising fabrication, creative process management and technology workflow solutions. Largely, an ideation and digital media-based business, the business leverages its branding expertise to drive the creation of digital experiences that stick with consumers.\nThe SGK Brand Solutions segments principal clients are global, multinational and regional companies in highly regulated industries such as food and beverage, pharmaceutical and healthcare, beauty and cosmetics, and alcohol and tobacco. The segment also serves clients in a diverse range of sectors that includes leaders in home improvement, personal care, technology and electronics, snack food and confections, telecommunications, and apparel, as well as a diverse range of shopping formats that include big-box stores, department stores, specialty stores, grocery stores, pharmacy chains and online retailers. These large, well-known companies represent a variety of brands across the marketplace covering both national and private label brands with numerous packaging and marketing requirements. The segment is also a leading international supplier of pre-press, rotogravure and embossing tooling, with principal clients representing brand manufacturers, printers and converters.\nThe segments products, services and solutions are purchased in part or whole by companies with operations in and/or across the North America, Europe and Asia regions. A large portion of these purchases result in annual or multi-year contracts; others are initiative-based. The segment generates new business opportunities through referrals and relationships, marketing and lead generation and select industry partnerships. The Company has many long-standing relationships among its client base that span decades and has new relationships with well-known global technology companies that are driving change in how consumers engage with brands and use devices like smartphones to shop and buy online and in-store.\nMajor raw materials for this segments products include photopolymers, steel, copper, film, wood, corrugated materials, structural steel, plastic, laminates, inks and graphic art supplies. All such materials are presently available in adequate supply from various industry sources. Competition is on the basis of product quality, timeliness of delivery and price, and increasingly, the ability to provide a holistic solution for brand content beyond its use for packaging, while at the same time elevating the role of packaging in the marketing mix. The segment's ability to offer consistent service on a global basis is a key differentiator.\nThe segment competes in an industry that is constantly challenged by emerging technologies that impact packaging and marketing. These challenges can create new opportunities for the segment to create, produce and manage large volumes of brand content. They also provide the segment with opportunities to advise its clients on how to plan for, manage and execute the digital transformation of their packaging and marketing operations. Increasingly, with the growing awareness and commitment by its clients to environmental sustainability, the SGK Brand Solutions segment is providing solutions that enable its clients to advance their own sustainability initiatives.\nPATENTS, TRADEMARKS AND LICENSES:\nThe Company holds a number of trademarks and in excess of 100 domestic and foreign patents for its products and related technologies. In addition, the Company maintains numerous trade secrets that further comprise its portfolio of intellectual property assets. The Company continues to assess, refine and expand its intellectual property portfolio, considering options to pursue additional patent filings and to further develop and continue to maintain processes to identify, inventory and safeguard evolving trade secrets and other intellectual property assets. The Company also enters into agreements with customers that authorizes the use of certain intellectual property through various licensing arrangements.\nITEM 1. BUSINESS, (continued)\nHUMAN CAPITAL RESOURCES:\nIntroduction:\nThe Companys culture of Inspired Possibilities empowers global teams to think creatively to inspire change that favorably impacts outcomes for the Company's customers, clients, and one another. Matthews human resource strategies align with the business strategies to enable and optimize internal talent to achieve business and financial performance. At every stage of the employee lifecycle, the Companys people programs are rooted in a set of organizational competencies and capabilities, aligned with the Company's core values, that collectively build talent, enhance employee engagement, sustain retention, inspire innovation and drive results.\nWorkforce Composition:\nAs of October 31, 2023, the Company and its majority-owned subsidiaries employed approximately 12,000 people globally in 6 continents and more than 300 locations and 30 countries around the world. Its diverse team of talented employees possess a vast array of skills including engineering, manufacturing, research and development, plant operations, production, logistics, creative design, photography and corporate functional services, including legal, information technology, human resources and finance. Many of Matthews employees have highly specialized skills and subject-matter expertise in their respective disciplines, enabling the Company to deliver industry leading products and services to its customers throughout the world.\nDiversity and Inclusion:\nMatthews views diversity and inclusion (D&I) as a priority to be valued and promoted throughout its business. The Company understands and firmly believes in the value that diverse experiences, perspectives, and ideas bring to the workforce and offer to clients. Matthews knows its employees deserve equal opportunities regardless of race, national origin, gender, gender expression, age, disability, religion, sexual orientation and more. Matthews has consistently advocated that mutual respect, valuing the worth of all people, doing what's right and celebrating diversity is essential to how the Company operates and the way it does business.\nMatthews D&I strategy focuses on priorities across seven key areas including: Talent Acquisition, Employee Engagement, Learning and Awareness, Supplier Diversity, Connection to Customers, Normalizing Courageous Conversations, and Community Engagement. A global council representative of a diverse workforce exists to help shape plans and program priorities, and seven additional councils across the organization support the program within local/regional markets to champion the work. A full time D&I leader is actively focused on driving the overarching program and building progress across all seven focus areas. Matthews is a unique organization, diverse in culture, talent and geography. The Company stands committed to a culture reflecting the people, clients, customers, and communities it serves.\nTalent Acquisition and Total Rewards:\nTo continue to grow and compete in a highly competitive labor market, Matthews works hard to attract and select top talent through a compelling employment value proposition. The Companys employment brand highlights its values including innovation, commitment to people culture, diversity, equity and inclusion, employee development, and wellbeing. The Company's selection process includes key behavioral questions that help select the right people for the right roles which helps to ensure cultural alignment.\nMatthews understands the highly competitive market for talent and believes that to attract and retain top talent, it must offer competitive pay and benefit programs. The Company evaluates roles to ensure pay is at market rate, and offers annual incentive pay and a competitive benefit package. As a global company, adjustments are made for global and regional market demands.\nITEM 1. BUSINESS, (continued)\nTalent Development/Management:\nFrom onboarding to leadership development, Matthews believes investing in its people leads to greater success. The Companys onboarding program reinforces its values and culture, supports its managers in creating a positive employee experience during the first 90 days and builds early commitment with all new hires.\nMatthews knows that when employees have opportunities to learn and grow, see how their goals and objectives lead to something greater and understand their part in the organizations success, it helps build a place where people want to stay. Matthews competency-based learning center helps employees select learning programs to continue their growth, and the Company facilitates both formal and informal mentoring that reinforces and supports its leaders during key developmental periods and beyond.\nThe Companys future success depends upon tomorrows leaders. Matthews has implemented a robust talent review process that identifies critical talent and serves as the basis for succession planning. Each year, at the conclusion of this review, the executive team selects a cohort of critical talent by level to participate in comprehensive leadership programs designed to prepare leaders for enterprise roles. The Company believes this investment, which includes classroom learning, external assessments, coaching/mentoring, and project application, both prepares and strengthens the organization for the future, while deepening the commitment of its top talent.\nPerformance Management:\nConnecting employees to the strategy ensures individual effort to a larger goal and strengthens commitment to the organization. The Company supports an annual leadership strategy cascade where each segment, division, group and team identify and align goals and objectives which serve as the basis for individual performance objectives, keeping employees firmly connected to the work and the Companys collective success. This process is rooted in ongoing coaching and feedback, and measures not just what was accomplished, but how it was accomplished because Matthews believes staying true to its values and key behaviors serves clients better, strengthens culture and keeps employees engaged.\nChange Management:\nMatthews is a constantly evolving multi-national company, leveraging new ways of working to improve its quality, service and delivery systems to better help customers and clients succeed. Building change capability to support employees through changes accelerates new ways of working, minimizes productivity loss, and accelerates improvement measures. The Company has a trained global change network embedded in the business to support transformational projects to help realize the goals and benefits of organizational changes.\nHealth and Safety:\nEmployee health and safety in the workplace remains the Companys highest priority and is one of the Companys core values. Safety efforts are led by the global health and safety team and supported by individuals at the local site level. Hazards in the workplace are timely identified and management actively tracks incidents so remedial actions may be implemented to improve workplace safety.\nBACKLOG:\nThe Company's current backlog is expected to be substantially filled in fiscal 2024. Cremation and incineration equipment sales backlogs vary in a range of four to six months of sales. Backlogs vary in a range of approximately twelve to eighteen months of sales for mausoleums. Backlogs are generally in excess of a year for purpose-built machinery projects. Backlogs for warehouse automation and fulfillment systems generally vary in a range of up to four weeks for standard products, and are currently in the range of ten to twelve months for custom systems.\nITEM 1. BUSINESS, (continued)\nREGULATORY MATTERS:\nThe Companys operations are subject to various federal, state and local laws and regulations requiring strict compliance, including, but not limited to, the protection of the environment. The Company has established numerous internal compliance programs to further ensure lawful satisfaction of the applicable regulations. In addition, the Company is party to specific environmental matters which include obligations to investigate and mitigate the effects on the environment of certain materials at operating and non-operating sites. The Company is currently performing environmental assessments and remediation at certain sites, as applicable.\nAVAILABLE INFORMATION:\nThe Company's principal executive offices are located at Two NorthShore Center, Pittsburgh, Pennsylvania 15212, its telephone number is (412) 442-8200 and its website is www.matw.com. The Company files or furnishes all required reports with the Securities and Exchange Commission (\"SEC\") in accordance with the Exchange Act. The Company's Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements and amendments to those reports are available free of charge on the Company's website as soon as reasonably practicable after being filed or furnished to the SEC. The Company's reports filed or furnished with the SEC, including exhibits attached to such reports, are also available on the SEC's website at www.sec.gov. ITEM 1A. RISK FACTORS.\nThere are inherent risks and uncertainties associated with the Company's businesses that could adversely affect its operating performance and financial condition. Set forth below are descriptions of those risks and uncertainties that the Company believes to be material as of the date of this Annual Report on Form 10-K. Additional risks not known to the Company as of such date or risks that the Company deemed immaterial may also result in adverse effects on the Company in the future.\nCompany-Specific Risk Factors:\nForeign Operations. The Company conducts business in more than 30 countries around the world, and in fiscal 2023 approximately 37% of the Company's sales to external customers were to customers outside the United States. In addition, the Company's manufacturing operations, suppliers and employees are located in many places around the world. As such, the Company's future success depends in part on its ability to grow sales in non-U.S. markets. Sales and operations outside of the United States are subject to certain inherent risks. The Company anticipates that future sales to international customers will continue to account for a significant percentage of its revenues. Risks associated with the Companys international sales and operations include, but are not limited to:\ncurrency exchange rate fluctuations;\nglobal political and economic instability and uncertainty;\ninternational terrorism;\nexport controls, including by the United States;\nfailure to comply with anti-bribery legislation, including the U.S. Foreign Corrupt Practices Act (the FCPA);\nchanges in legal and regulatory requirements;\npolicy changes by the United States and foreign governments affecting the markets for the Companys products;\nchanges in tax laws, quotas, tariffs and other market barrier;\ndifficulties in protection and enforcement of intellectual property rights;\nrestrictions on the export or import of technology;\nfailure to comply with the foreign data protection laws, including the European Unions General Data Protection Regulation (the GDPR);\ninadvertent transfers of export-controlled information due to increased cross-border technology transfers and the use of offshore computer servers;\ntransportation, including piracy in international waters; and\nchallenges relating to managing a global workforce with diverse cultures, backgrounds and labor laws.\nIt also is possible that certain international contracts may include industrial cooperation agreements requiring specific in-country purchases, investments, manufacturing agreements or other financial obligations (known as offset obligations) and may provide for penalties if the Company fails to meet such requirements.\nITEM 1A. RISK FACTORS, (continued)\nThe impact of these risks is difficult to predict, but the occurrence of one or more of them could have a material adverse effect on the Companys financial position, results of operations, or cash flows.\nChanges in Foreign Currency Exchange Rates. Production and sales of a significant portion of the Company's products are outside the United States, and accordingly, the Company holds assets, incurs liabilities, earns revenue and pays expenses in a variety of currencies. The Company's consolidated financial statements are presented in U.S. dollars, and therefore, the Company must translate the reported values of its foreign assets, liabilities, revenue and expenses into U.S. dollars. Increases or decreases in the value of the U.S. dollar compared to foreign currencies may negatively affect the value of these items in the Company's consolidated financial statements, even though their value has not changed in local currency.\nChanges in Interest Rates. Interest rate fluctuations could increase the Company's financing costs to the extent such interest rates are not hedged. In addition, increases in interest rates could limit the Company's ability to obtain additional indebtedness or debt refinancing on terms that the Company deems attractive, or at all, which could have a material and adverse effect on the Company's borrowing costs, profitability, liquidity and capital resources. Borrowings under the Companys credit facilities, including the domestic credit facility, are subject to variable rates of interest and expose the Company to interest rate risk. The Company enters into interest rate swaps in order to achieve a mix of fixed and variable rate debt that it deems appropriate. To the extent that some or all of the Companys variable interest rate debt is not subject to interest rate swaps, if interest rates were to increase, the Companys interest expense would increase, negatively affecting earnings and reducing cash flows available for working capital, capital expenditures and other investments.\nThe Company also has $299.6 million 5.25% senior unsecured notes due December 1, 2025 (the 2025 Senior Notes). In the event the Company seeks to refinance indebtedness under the domestic credit facility or the 2025 Senior Notes, or obtain additional financing, higher interest rates may limit the Companys ability to incur such indebtedness on terms that it deems attractive, if at all. If the Company is unable to incur indebtedness on terms that it deems attractive, it could have a material and adverse effect on the Companys borrowing costs, profitability, liquidity and capital resources.\nIncreased Prices for Raw Materials. The Company's profitability is affected by the prices of the raw materials used in the manufacture of its products. These prices may fluctuate based on a number of factors, including changes in supply and demand, domestic and global economic conditions, volatility in commodity markets, currency exchange rates, labor costs, tariffs and fuel-related costs. If suppliers increase the price of critical raw materials, alternative sources of supply, or alternative materials, may not exist or be readily available. In addition, disruptions in the global supply chain may cause prices for raw materials to increase. See \"Disruptions to the global supply chain.\"\nThe Company has standard selling price structures (i.e., list prices) in certain of its segments, which are reviewed for adjustment generally on an annual basis. In addition, the Company has established pricing terms with several of its customers through contracts or similar arrangements. Based on competitive market conditions and to the extent that the Company has established pricing terms with customers, the Company's ability to immediately increase the price of its products to offset the increased costs may be limited. Significant raw material price increases that cannot be mitigated by selling price increases or productivity improvements will negatively affect the Company's results of operations.\nImpairment of Goodwill and Intangible Assets. The Company has recorded a significant amount of goodwill and intangible assets in its consolidated financial statements resulting from acquisition activities and has in the past recorded, and may in the future record, significant charges for impairment of goodwill and intangible assets. The Company tests, at least annually, the carrying value of goodwill for impairment. The estimates and assumptions about future results of operations and cash flows made in connection with the impairment testing could differ from future actual results of operations and cash flows. For example, during the fiscal year ended September 30, 2022, Matthews recorded an $82.5 million goodwill write-down with respect to its SGK Brand Solutions reporting unit. See Note 22, \"Goodwill and Other Intangible Assets\" in Item 8 - Financial Statements and Supplementary Data for further details. If Matthews concludes that any further goodwill or intangible asset values are impaired, for reasons that may include, but are not limited to, underperformance in one or more reporting segments against forecast levels; changes in the Companys business strategy, structure, and/or the allocation of resources; the inability of acquisitions to achieve expected operating results; a decline in the Companys stock price for a sustained period; a potential recession or other disruption; or interest rate increases or other factors, any resulting non-cash impairment charge could have a material adverse effect on Matthews business, results of operations and financial condition.\nChanges in Mortality and Cremation Rates. Generally, life expectancy in the United States and other countries in which the Company's Memorialization segment operates has increased steadily for several decades and is expected to continue to do so in the future, absent events related to pandemics or similar outbreaks. The increase in life expectancy is also expected to impact the number of deaths in the future. Additionally, cremations have steadily grown as a percentage of total deaths in the United States since the 1960's, and are expected to continue to increase in the future. The Company expects that these trends will\nITEM 1A. RISK FACTORS, (continued)\ncontinue in the future and sales of the Company's Memorialization segment may benefit from the continued growth in the number of cremations; however, such trends may adversely affect the volume of bronze and granite memorialization products and burial caskets sold in the United States.\nChanges in Product Demand or Pricing. The Company's businesses have and will continue to operate in competitive markets. Changes in product demand or pricing are affected by domestic and foreign competition and an increase in consolidated purchasing by large customers operating in both domestic and global markets. The Memorialization businesses generally operate in markets with ample supply capacity and demand which is correlated to death rates. The SGK Brand Solutions businesses serve global customers that are requiring their suppliers to be global in scope and price-competitive. Additionally, in recent years the Company has witnessed an increase in products manufactured offshore, primarily in China, and imported into the Company's U.S. markets. It is expected that these trends will continue and may affect the Company's future results of operations.\nChanges in the Distribution of the Company's Products or the Loss of a Large Customer. Although the Company does not have any customer that is individually significant to consolidated sales, it does have contracts with several large customers in each of its business segments. While these contracts provide important access to large purchasers of the Company's products, they can obligate the Company to sell products at contracted prices for extended periods of time, or, in the event of a dispute with a large customer, cause disruptions to the units sold to such customer, if any. Additionally, any significant divestiture of business properties or operations by current customers could result in a loss of business if the Company is not able to maintain the business with the subsequent owners of the businesses.\nDisruptions to the global supply chain. The Company purchases components and materials to manufacture its products from a large number of suppliers, some of which may be critical to operations. The Companys product offerings are impacted by such suppliers' lead times, volume constraints and increasing costs. The Company has experienced and may continue to experience extended lead times and product unavailability due to manufacturing disruptions or closures as well as delays and unanticipated costs associated with the sourcing of materials. Matthews supply chain operations span several geographies globally and are heavily dependent upon third party logistics and transportation services to deliver the Companys products to customers. Extended lead times and shortages could impair the Companys ability to meet its customer requirements, require the Company to pay higher prices or incur expedite fees or cause its customers to delay or forgo projects, which would harm Matthews business and negatively impact the Companys gross margin and results of operations.\nPandemics or similar outbreaks. Pandemics or similar outbreaks could adversely affect the economies of developed and emerging markets, potentially resulting in an economic downturn that could affect customers demand for the Companys products and services, as well as the Company's ability to access capital at acceptable interest rates. The spread of pandemics or similar outbreaks may also disrupt the Companys manufacturing and production operations, as well as its distribution systems, which include import and export for delivery of the Companys products to its customers. These factors could materially and adversely affect the Companys business, financial condition and results of operations. See also \"Disruptions to the global supply chain.\"\nDue to the uncertainty relating to a pandemic or similar outbreak, the Company, its customers or its suppliers may be required, or believe that it is advantageous, to take precautionary measures intended to minimize the risk of a virus or disease spreading to employees, customers, and the communities in which they operate, and these measures could negatively impact the Companys business. Further, if the scope and severity of an outbreak worsens and the Companys contingency plans prove ineffective, its global operations could potentially experience disruptions, such as temporary closure of facilities or delays or suspensions in product offerings and services, which may materially and adversely affect the Companys business, financial condition and results of operations.\nGlobal conflicts may impact the business of the Company and the markets in which it operates. Global conflicts, such as the war in Ukraine, could impact the Company and its operations in a number of different ways, which are yet to be fully assessed and are therefore uncertain. The Companys principal concern is for the safety of its employees and other personnel, specifically those who are based in the affected region. The Company has employees who are based in Eastern Europe, including Russia and Ukraine, who may be affected by the ongoing hostilities. The Company additionally has property, plant and equipment in or around the affected region. The continuing impact of this war and the response of the United States and other countries to it by means of trade and economic sanctions, or other actions, is still evolving and unknown; however it could disrupt the Companys ability to work with certain parties. Similarly, the Company has employees based in the affected region and works with third-party providers from other parts of the world that may be affected by hostilities.\nDue to the uncertainty relating to war or similar conflicts, the current war between Russia and Ukraine may adversely affect the Company's business, of which could materially and adversely affect the Company's results of operations. Such risks include,\nITEM 1A. RISK FACTORS, (continued)\nbut are not limited to, adverse effects on macroeconomic conditions, including inflation and business and consumer spending; disruptions to the Company's global technology infrastructure, including through cyberattack, ransom attack, or cyber-intrusion; adverse changes in international trade policies and relations; disruptions in global supply chains; exposure to foreign currency fluctuations; and constraints, volatility, or disruption in the capital markets. Similar uncertainties may arise in connection with other ongoing hostilities or future hostilities.\nFor so long as the hostilities continue, and perhaps even thereafter as the situation unfolds, the Company may see increased volatility in financial markets, which may impact equity markets generally, including the Companys stock price, and make it more difficult for the Company to raise additional capital at a strategically advantageous time, or for financing to be available upon acceptable terms. All or any of these risks separately, or in combination could have a material adverse effect on the Company's business, financial condition, results of operations, and cash flows.\nRisks in Connection with Acquisitions and Divestitures. The Company has grown, in part, through acquisitions and continues to evaluate acquisition or divestiture opportunities that have the potential to support and strengthen its businesses. There is no assurance, however, that future acquisition opportunities will arise, or that if they do, that they will be consummated. In addition, acquisitions and divestitures involve inherent risks that the businesses acquired, or the remaining business, will not perform in accordance with expectations, or that synergies expected from the integration of an acquisition will not be achieved as rapidly as expected, or at all. The Company's pre-acquisition diligence review may not discover or accurately quantify certain undisclosed liabilities, and the Company may not be indemnified for such liabilities which could have an adverse effect on the acquired business. Failure to effectively integrate acquired businesses could prevent the realization of expected rates of return on the acquisition investment, including the achievement of cost-reduction objectives, and could have a negative effect on the Company's results of operations and financial condition.\nProtection of Intellectual Property. Certain of the Company's businesses rely on various intellectual property rights, including patents, copyrights, trademarks and trade secrets, as well as confidentiality provisions and licensing arrangements, to establish proprietary rights. If the Company does not enforce, or is unsuccessful in enforcing, its intellectual property rights successfully, its competitive position may suffer, which could harm the Company's operating results. In addition, the Company's patents, copyrights, trademarks and other intellectual property rights, including its trade secrets, may not provide a significant competitive advantage. The Company may need to spend significant resources monitoring its intellectual property rights and may or may not be able to detect infringement by third parties. The Company's competitive position may be harmed if it cannot detect infringement and enforce its intellectual property rights quickly or at all. In some circumstances, the Company may choose to not pursue enforcement because an infringer has a dominant intellectual property position or for other business reasons, such as the expense of litigation against a well-resourced adversary. In addition, competitors might avoid infringement by designing around the Company's intellectual property rights or by developing non-infringing competing technologies. Intellectual property rights and the Company's ability to enforce them may be unavailable or limited in some countries which could make it easier for competitors to capture market share and could result in lost revenues.\nIntellectual property infringement assertions by third parties could result in significant costs and adversely affect the Company's business, financial condition, operating results and reputation. The Company cannot guarantee that the operation of its business does not infringe, misappropriate or otherwise violate the intellectual property rights of third parties, nor can the Company assure that third parties will not assert claims, meritorious or otherwise. The Company cannot predict whether other assertions of third-party intellectual property rights or claims arising from such assertions would substantially adversely affect the Company's business, financial condition and operating results. The defense of these claims and any future infringement claims, whether they are with or without merit or are determined in the Company's favor, may result in costly litigation and diversion of technical and management personnel. Further, an adverse outcome of a dispute may require the Company to pay damages, cease making, licensing, or using products or offering services that are alleged to incorporate the intellectual property of others, expend additional development resources to redesign the Company's offerings, or enter into potentially unfavorable royalty or license agreements in order to obtain the right to use necessary intellectual property, which may be unavailable on terms acceptable to the Company, or at all. Even if these matters do not result in litigation or are resolved in the Company's favor or without significant cash settlements, the time and resources necessary to resolve them could adversely affect the Company's business, reputation, financial condition and operating results.\nITEM 1A. RISK FACTORS, (continued)\nEnvironmental Remediation and Compliance. The Company is subject to the risk of environmental liability and limitations on its operations due to environmental laws and regulations. The Company is subject to extensive federal, state, local and foreign environmental, health and safety laws and regulations concerning matters such as air emissions, wastewater discharges, solid and hazardous waste handling and disposal and the investigation and remediation of contamination. The risks of potentially substantial costs and liabilities related to compliance with these laws and regulations are an inherent part of the Company's business, and future conditions may develop, arise or be discovered that create substantial environmental compliance or remediation liabilities and costs. Compliance with environmental, health and safety legislation and regulatory requirements may prove to be more limiting and costly than the Company anticipates, and there is no assurance that significant expenditures related to such compliance may not be required in the future.\nFrom time to time, the Company may be subject to legal proceedings brought by private parties or governmental authorities with respect to environmental matters, including matters involving alleged noncompliance with or liability under environmental, health and safety laws, property damage or personal injury. New laws and regulations, including those which may relate to emissions of greenhouse gases, stricter enforcement of existing laws and regulations, the discovery of previously unknown contamination or the imposition of new clean-up requirements could require the Company to incur costs or become the basis for new or increased liabilities that could have a material adverse effect on the Company's business, financial condition or results of operations.\nReliance on Third-Party Service Providers. The Company has entered into agreements with a variety of third-party providers for information technology services, including telecommunications, network server maintenance, cloud computing and transaction processing services. In addition, Matthews has agreements through which it has outsourced certain activities related to the operations of the Companys business segments. A providers ability to provide services could be disrupted for a variety of reasons, including, among others, software errors or design faults, human error, security breaches, power loss, telecommunications failures, equipment failures, electrical disruptions, labor issues, vandalism, fire, flood, extreme weather, terrorism and other events beyond their control. If one or more of Matthews providers is unable to provide adequate or timely services, the Companys ability to deliver products and services to customers could be adversely affected. Matthews cannot completely eliminate the risk of such disruptions, many of which are impacted by events outside of the Companys control. Any significant disruption could harm the Companys business, including damage to brands and loss of customers. Additionally, although Matthews believes that most of these services are available from numerous sources, a failure to perform by one or more of the providers could cause a material disruption in the Companys business and an increase in expense while it works to obtain alternative services. Additionally, while the Company has policies and procedures for managing these relationships, they inherently involve a lesser degree of control over business operations, governance and compliance, thereby potentially increasing the profiles of Matthews financial, legal, reputational and operational risks.\nTechnological Factors Beyond the Company's Control. The Company operates in certain markets in which technological product development contributes to its ability to compete effectively. There can be no assurance that the Company will be able to develop new products, that new products can be manufactured and marketed profitably, or that new products will successfully meet the expectations of customers.\nChanges in Laws and Regulations Governing Data Privacy and Data Protection. The Company is subject to many data privacy, data protection, and data breach notification laws, including the GDPR, which became effective in May of 2018, and the California Consumer Privacy Act (the \"CCPA\"), which became effective in January 2020. The GDPR and the CCPA contain comprehensive data protection compliance requirements. Complying with the GDPR and the CCPA may continue to cause the Company to incur substantial operational costs or require the Company to change certain of its business practices in certain jurisdictions. The Companys measures to assess the requirements of, and to comply with, the GDPR and the CCPA, as well as new and existing data-related laws and regulations of other jurisdictions, could be challenged, including by authorities that regulate data-related compliance. The Companys ongoing compliance measures could result in the incurrence of significant expense in facilitating and responding to regulatory investigations, and if the measures initiated by the Company are deemed to be inadequate, the Company could be subject to litigation or enforcement actions that may require operational changes, fines, penalties or damages, which could have an adverse impact on the Companys business or results of operations.\nChanges in Tax Rules. Matthews is subject to domestic and international tax laws and cannot predict the scope or effect of future tax law changes. Domestically, the U.S. Department of Treasury has broad authority to issue regulations and interpretive guidance. The Company has applied available guidance to estimate its tax obligations, but new guidance may cause the Company to make adjustments to its tax estimates in future periods.\nITEM 1A. RISK FACTORS, (continued)\nCompliance with Foreign Laws and Regulations. Due to the international scope of the Company's operations, Matthews is subject to a complex system of commercial and trade regulations around the world, and the Company's foreign operations are governed by laws, rules and business practices that often differ from those of the United States. The Company cannot predict the nature, scope or effect of future regulatory requirements to which the Company's operations might be subject or the manner in which existing laws might be administered or interpreted, which could have a material and negative impact on the Company's business and results of operation. For example, recent years have seen an increase in the development and enforcement of laws and regulations regarding trade compliance, economic sanctions, anti-money laundering, and anti-corruption, such as the FCPA and similar laws in other countries. While Matthews maintains a variety of internal policies and controls and takes steps, including periodic training and internal audits, that the Company believes are reasonably calculated to discourage, prevent and detect violations of such laws, the Company cannot guarantee that such actions will be effective or that individual employees will not engage in inappropriate behavior in contravention of the Company's policies and instructions. Such conduct, or even the allegation thereof, could result in costly investigations and the imposition of severe criminal or civil sanctions, could disrupt the Company's business, and could materially and adversely affect the Company's reputation, business and results of operations or financial condition.\nFurther, the Company is subject to laws and regulations worldwide affecting its operations outside the United States in areas including, but not limited to, intellectual property ownership and infringement, tax, customs, import and export requirements, economic sanctions, anti-money laundering, anti-corruption and anti-bribery, foreign exchange controls and cash repatriation restrictions, foreign investment, data privacy requirements, anti-competition, pensions and social insurance, employment, and environment, health, and safety. Compliance with these laws and regulations may be onerous and expensive and requirements may differ among jurisdictions. Further, the promulgation of new laws, changes in existing laws and abrogation of local regulations by national laws may have a negative impact on the Company's business and prospects. In addition, certain laws and regulations are relatively new and their interpretation and enforcement involve significant uncertainties. There can be no assurance that any of these factors will not have a material adverse effect on the Company's business, results of operations or financial condition.\nGeneral Risk Factors:\nChanges in Economic Conditions. Generally, changes in domestic and international economic conditions affect the industries in which the Company and its customers and suppliers operate. These changes include changes in the rate of consumption or use of the Company's products due to economic downturns, volatility in currency exchange rates, and changes in raw material prices resulting from supply and/or demand conditions.\nUncertainty about current global economic conditions poses a risk, as consumers and businesses may continue to postpone or cancel spending. Other factors that could influence customer spending include energy costs, conditions in the credit markets, consumer confidence, global pandemics, and other factors affecting consumer spending behavior. These and other economic factors could have an effect on demand for the Company's products and services and negatively impact the Company's financial condition and results of operations.\nLabor shortages, turnover and labor cost increases. Labor is a significant component of the Company's operations. Several factors may adversely affect the labor force available to Matthews or increase labor costs (i.e., labor rates and overtime levels), including high employment levels, unemployment subsidies, increased wages offered by other employers, vaccine mandates and other government regulations and the Companys responses thereto. An overall labor shortage, lack of skilled labor, increased turnover, or labor inflation, caused by pandemics or as a result of general macroeconomic factors, could have a material adverse impact on the Companys business and operating results.\nCybersecurity and Data Breaches. In the course of business, the Company collects and stores sensitive data and proprietary business information. The Company could be subject to service outages or breaches of security systems which may result in disruption, unauthorized access, misappropriation, or corruption of this information. Security breaches of the Company's network or data including physical or electronic break-ins, vendor service outages, computer viruses, attacks by hackers or similar breaches can create system disruptions, shutdowns, or unauthorized disclosure of confidential information. Although the Company is not aware of any significant incidents to date, if it is unable to prevent, detect and timely remediate such security or privacy breaches, its operations could be disrupted or the Company may suffer legal claims, loss of reputation, financial loss, property damage, or regulatory penalties because of lost or misappropriated information.\nThe Company expects that compliance with laws governing data privacy and data protection will require ongoing investment in systems, policies and personnel and will continue to impact Matthews business in the future by increasing legal, operational and compliance costs. There can be no assurance that the Companys efforts will meet the evolving standards imposed by governmental and regulatory agencies, including data protection authorities, with respect to standards that may be adopted in\nITEM 1A. RISK FACTORS, (continued)\nthe future. If the Company is found or suspected to have violated data privacy or data protection laws, it may be subject to potential private consumer, business partner or securities litigation, regulatory inquiries, governmental investigations and proceedings, and may incur damage to its reputation. Any such developments may subject Matthews to material fines and other monetary penalties and damages, divert managements time and attention, and lead to enhanced regulatory oversight, all of which could have a material adverse effect on the Companys business and results of operations.\nEffectiveness of Internal Controls. Section 404 of the Sarbanes-Oxley Act of 2002 requires a comprehensive evaluation of the Company's internal control over financial reporting. To comply with this statute, the Company is required to document and test its internal control over financial reporting, management is required to assess and issue a report concerning internal control over financial reporting, and the Company's independent registered public accounting firm is required to attest to and report on the Company's assessment of the effectiveness of internal control over financial reporting. Any failure to maintain or implement required new or improved controls could cause the Company to fail to meet its periodic reporting obligations or result in material misstatements in the consolidated financial statements, and substantial costs and resources may be required to rectify these or other internal control deficiencies. If the Company cannot produce reliable financial reports, investors could lose confidence in the Company's reported financial information, the market price of the Company's common stock could decline significantly, and its business, financial condition, and reputation could be harmed.\nCompliance with Securities Laws and Regulations; Conflict Minerals Reporting. The Company is required to comply with various securities laws and regulations, including but not limited to the Sarbanes-Oxley Act of 2002 and the Dodd-Frank Wall Street Reform and Consumer Protection Act (\"Dodd-Frank\"). Dodd-Frank contains provisions, among others, designed to improve transparency and accountability concerning the supply chains of certain minerals originating from the Democratic Republic of Congo and adjoining countries that are believed to be benefiting armed groups (\"Conflict Minerals\"). While Dodd-Frank does not prohibit companies from using Conflict Minerals, the SEC mandates due diligence, disclosure and reporting requirements for companies for which Conflict Minerals are necessary to the functionality or production of a product. The Company's efforts to comply with Dodd-Frank and other evolving laws, regulations and standards could result in increased costs and expenses related to compliance and potential violations. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot applicable. ITEM 2. PROPERTIES.\nThe Company's facilities provide adequate space for meeting its near-term production requirements. Significant principal properties of the Company and its majority-owned subsidiaries as of October 31, 2023 were as follows (properties, which are unencumbered, are owned by the Company except as noted):\nLocation Description of Property\nMemorialization:\nPittsburgh, PA Manufacturing / Division Offices\nApopka, FL Manufacturing / Division Offices\nAurora, IN Manufacturing\nColorno, Italy Manufacturing\nDallas, TX Distribution Hub (1)\nDandenong, Australia Manufacturing (1)\nElberton, GA Manufacturing\nFontana, CA Distribution Hub (1)\nHarrisburg, PA Distribution Hub (1)\nIndianapolis, IN Distribution Hub (1)\nMonterrey, Mexico Manufacturing (1)\nRichmond, IN Manufacturing\nSearcy, AR Manufacturing\nStone Mountain, GA Distribution Hub (1)\nYork, PA Manufacturing\nIndustrial Technologies:\nBocholt, Germany Manufacturing / Division Offices\nCincinnati, OH Manufacturing / Distribution\nFribourg, Switzerland Manufacturing (1)\nGothenburg, Sweden Manufacturing / Distribution (1)\nHoloubkov, Czech Republic Manufacturing\nLima, Costa Rica Manufacturing (1)\nMönchengladbach, Germany Manufacturing (1)\nPewaukee, WI Manufacturing (1)\nPittsburgh, PA Division Offices\nSan Antonio, TX Manufacturing\nWilsonville, OR Manufacturing\nVreden, Germany Manufacturing (2)\nSGK Brand Solutions:\nBattle Creek, MI Production Facility (1)\nChennai, India Production Facility (1)\nDachnow, Poland Manufacturing (1)\nEast Butler, PA Production Facility (1)\nEast Java, Indonesia Production Facility (1)\nGoslar, Germany Production Facility (1)\nIzmir, Turkey Manufacturing\nJülich, Germany Production Facility (1)\nManchester, England Production Facility (1)\nMinneapolis, MN Production Facility\nMississauga, Canada Production Facility (1)\nPenang, Malaysia Production Facility\nTigard, OR Production Facility (1)\nCorporate and Administrative Offices:\nPittsburgh, PA General Offices\n(1)These properties are leased by the Company under operating lease arrangements.\n(2)The Vreden, Germany location represents a shared facility for both the Industrial Technologies and SGK Brand Solutions segments. ITEM 3. LEGAL PROCEEDINGS.\nMatthews is subject to various legal proceedings and claims arising in the ordinary course of business. Management does not expect that the results of any of these legal proceedings will have a material adverse effect on Matthews' financial condition, results of operations or cash flows. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nOFFICERS AND EXECUTIVE MANAGEMENT OF THE REGISTRANT\nThe following information is furnished with respect to officers and executive management as of October 31, 2023:\nName Age Positions with Registrant\nJoseph C. Bartolacci 63 President and Chief Executive Officer\nRonald C. Awenowicz 54 Senior Vice President, Global Compliance, Operations and N.A. Human Resources\nGregory S. Babe 66 Chief Technology Officer and Group President, Industrial Technologies\nDavor Brkovich 55 Head of IT and Chief Information Officer\nSteven D. Gackenbach 60 Group President, Memorialization\nReena Gurtner 49 Senior Vice President, Human Resources\nGary R. Kohl 60 President, SGK Brand Solutions\nLee Lane 55 Group President, Matthews Industrial Automation and Matthews Environmental Solutions\nSteven F. Nicola 63 Chief Financial Officer and Secretary\nBrian D. Walters 54 Executive Vice President and General Counsel\nJoseph C. Bartolacci was appointed President and Chief Executive Officer effective October 2006.\nRonald C. Awenowicz was appointed Senior Vice President, Global Compliance, Operations and North America Human Resources effective July 2021. Prior thereto, he served as Vice President of Americas Human Resources since May 2020 and prior thereto he served as Global Head of Human Resources Operations since February 2015, when he joined the Company.\nGregory S. Babe was appointed Chief Technology Officer and Group President, Industrial Technologies effective October 2022. Prior thereto, he served as Chief Technology Officer since November 2015.\nDavor Brkovich was appointed Head of IT and Chief Information Officer effective November 2019. Prior thereto, he had been interim Head of IT and Chief Information Officer since February 2019 and prior thereto he served as Director, Global IT Infrastructure since January 2017, when he joined the Company.\nSteven D. Gackenbach was appointed Group President, Memorialization effective October 31, 2011.\nReena Gurtner was appointed Senior Vice President, Human Resources effective July 2021. Prior thereto, she served as Vice President, Human Resources APAC, Middle East and Africa since May 2020 and prior thereto she served as Regional Director of Human Resources APAC since January 2013.\nGary R. Kohl was appointed President, SGK Brand Solutions effective May 2017.\nLee Lane was appointed Group President for Matthews Product Identification and Warehouse Automation businesses as well as Matthews Environmental Solutions effective October 2022. Prior thereto, he served as Senior Vice President of Matthews Automation since June 2022. Prior to joining the Company, he served as Vice President General Manager Sensing, Safety & Industrial Components Business at Rockwell Automation, Inc. since October 2020, and prior thereto he served as Vice President / General Manager Safety, Sensing & Connectivity Business at Rockwell Automation, Inc. since March 2017.\nSteven F. Nicola was appointed Chief Financial Officer and Secretary effective December 2003.\nBrian D. Walters was appointed Executive Vice President and General Counsel effective February 2023. Prior thereto, he served as Senior Vice President and General Counsel since February 2018.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY AND RELATED STOCKHOLDER MATTERS.\nMarket Information:\nThe authorized common stock of the Company consists of 70,000,000 shares of Class A Common Stock, $1.00 par value. At September 30, 2023, 30,469,213 shares were outstanding. The Company's Class A Common Stock is traded on the Nasdaq Global Select Market under the symbol \"MATW\".\nThe Company has a stock repurchase program. The buy-back program is designed to increase shareholder value, enlarge the Company's holdings of its common stock, and add to earnings per share. Repurchased shares may be retained in treasury, utilized for acquisitions, or reissued to employees or other purchasers, subject to the restrictions set forth in the Company's Restated Articles of Incorporation. Under the current authorization, 1,195,013 shares remain available for repurchase as of September 30, 2023. All purchases of the Company's common stock during fiscal 2023 were part of this repurchase program.\nThe following table shows the monthly fiscal 2023 stock repurchase activity:\nPeriod Total number of shares purchased Weighted-average price paid per share Total number of shares purchased as part of a publicly announced plan Maximum number of shares that may yet be purchased under the plan\nOctober 2022\n- $ - - 1,294,842\nNovember 2022\n88,042 27.54 88,042 1,206,800\nDecember 2022\n983 27.54 983 1,205,817\nJanuary 2023\n- - - 1,205,817\nFebruary 2023\n549 37.09 549 1,205,268\nMarch 2023\n7,057 37.79 7,057 1,198,211\nApril 2023\n- - - 1,198,211\nMay 2023\n- - - 1,198,211\nJune 2023\n2,068 38.86 2,068 1,196,143\nJuly 2023\n- - - 1,196,143\nAugust 2023\n1,130 32.79 1,130 1,195,013\nSeptember 2023\n- - - 1,195,013\nTotal 99,829 $ 28.61 99,829\nHolders:\nBased on records available to the Company, the number of record holders of the Company's common stock was 473 at October 31, 2023.\nSecurities Authorized for Issuance Under Equity Compensation Plans:\nSee Equity Compensation Plans in Item 12 \"Security Ownership of Certain Beneficial Owners and Management.\"\nITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY AND RELATED STOCKHOLDER MATTERS, (continued)\nPERFORMANCE GRAPH\nCOMPARISON OF FIVE-YEAR CUMULATIVE RETURN *\nAMONG MATTHEWS INTERNATIONAL CORPORATION,\nS&P 500 INDEX AND RUSSELL 2000 VALUE INDEX\nThis graph compares the return on Matthews common stock with that of the Standard & Poors 500 Index and Russell 2000 Value Index for the period from October 1, 2018 through September 30, 2023. The graph assumes that on October 1, 2018, $100 was invested in each of the Companys common stock, Standard & Poors 500 Index and Russell 2000 Value Index. The graph measures total stockholder return, which takes into account both changes in stock price and dividends. It assumes that dividends paid are invested in like securities.\nThe following graph compares the total return on the Companys common stock with that of the Standard & Poors 500 Index and the Russell 2000 Value Index. The results are not necessarily indicative of future performance.\n* Total return assumes dividend reinvestment ITEM 6. [Reserved]. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion should be read in conjunction with the consolidated financial statements of Matthews and related notes thereto. In addition, see \"Cautionary Statement Regarding Forward-Looking Information\" included in Part I of this Annual Report on Form 10-K.\nRESULTS OF OPERATIONS:\nThe Company manages its businesses under three segments: Memorialization, Industrial Technologies and SGK Brand Solutions. The Memorialization segment consists primarily of bronze and granite memorials and other memorialization products, caskets, cremation-related products, and cremation and incineration equipment primarily for the cemetery and funeral home industries. The Industrial Technologies segment includes the design, manufacturing, service and distribution of high-tech custom energy storage solutions; product identification and warehouse automation technologies and solutions, including order fulfillment systems for identifying, tracking, picking and conveying consumer and industrial products; and coating and converting lines for the packaging, pharma, foil, décor and tissue industries. The SGK Brand Solutions segment consists of brand management, pre-media services, printing plates and cylinders, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries.\nThe Company's primary measure of segment profitability is adjusted earnings before interest, income taxes, depreciation and amortization (\"adjusted EBITDA\"). Adjusted EBITDA is defined by the Company as earnings before interest, income taxes, depreciation, amortization and certain non-cash and/or non-recurring items that do not contribute directly to managements evaluation of its operating results. These items include stock-based compensation, the non-service portion of pension and postretirement expense, acquisition and divestiture costs, ERP integration costs, and strategic initiatives and other charges. This presentation is consistent with how the Company's chief operating decision maker (the CODM) evaluates the results of operations and makes strategic decisions about the business. For these reasons, the Company believes that adjusted EBITDA represents the most relevant measure of segment profit and loss.\nIn addition, the CODM manages and evaluates the operating performance of the segments, as described above, on a pre-corporate cost allocation basis. Accordingly, for segment reporting purposes, the Company does not allocate corporate costs to its reportable segments. Corporate costs include management and administrative support to the Company, which consists of certain aspects of the Companys executive management, legal, compliance, human resources, information technology (including operational support) and finance departments. These costs are included within \"Corporate and Non-Operating\" in the following table to reconcile to consolidated adjusted EBITDA and are not considered a separate reportable segment. Management does not allocate non-operating items such as investment income, other income (deductions), net and noncontrolling interest to the segments.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nThe following table sets forth sales and adjusted EBITDA for the Company's Memorialization, Industrial Technologies and SGK Brand Solutions segments for each of the last three fiscal years. Refer to Note 20, \"Segment Information\" in Item 8 - \"Financial Statements and Supplemental Data\" for the Company's financial information by segment.\nYears Ended September 30,\n2023 2022 2021\n(Dollar amounts in thousands)\nSales to external customers:\nMemorialization $ 842,997 $ 840,124 $ 769,016\nIndustrial Technologies 505,751 335,523 284,495\nSGK Brand Solutions 532,148 586,756 617,519\nConsolidated Sales $ 1,880,896 $ 1,762,403 $ 1,671,030\nAdjusted EBITDA:\nMemorialization $ 163,986 $ 151,849 $ 165,653\nIndustrial Technologies 66,278 56,762 34,889\nSGK Brand Solutions 57,128 60,120 91,435\nCorporate and Non-Operating (61,583) (58,323) (64,227)\nTotal Adjusted EBITDA(1)\n$ 225,809 $ 210,408 $ 227,750\n(1) Total Adjusted EBITDA is a non-GAAP financial measure. See the \"Non-GAAP Financial Measures\" section below.\nComparison of Fiscal 2023 and Fiscal 2022:\nSales for the year ended September 30, 2023 were $1.88 billion, compared to $1.76 billion for the year ended September 30, 2022, representing an increase of $118.5 million. The increase in fiscal 2023 sales reflected higher sales in the Industrial Technologies and Memorialization segments, partially offset by lower sales in the SGK Brand Solutions segment. On a consolidated basis, changes in foreign currency exchange rates were estimated to have an unfavorable impact of $23.6 million on fiscal 2023 sales compared to the prior year.\nMemorialization segment sales for fiscal 2023 were $843.0 million, compared to $840.1 million for fiscal 2022. The sales increase reflected improved price realization, higher sales of mausoleums and cremation equipment in the U.S., and benefits from the acquisition of Eagle Granite Company (see Acquisitions and Divestitures below). These increases were partially offset by lower unit sales of caskets and bronze memorial products, reflecting a decrease in coronavirus disease 2019 (\"COVID-19\") related deaths in fiscal 2023, and lower sales of cremation and incineration products in Europe. Changes in foreign currency exchange rates had an unfavorable impact of $1.8 million on the segment's sales compared to the prior year. Industrial Technologies segment sales for fiscal 2023 were $505.8 million, compared to $335.5 million for fiscal 2022. The sales increase primarily reflected the impact of the fiscal 2022 acquisitions of OLBRICH GmbH (OLBRICH) and R+S Automotive GmbH (R+S Automotive) (see Acquisitions and Divestitures below). The increase in sales also reflected higher sales of purpose-built engineered products (primarily energy storage solutions for the electric vehicle market) and higher product identification sales. These increases were partially offset by lower sales of warehouse automation solutions. Changes in foreign currency exchange rates had an unfavorable impact of $5.7 million on the segment's sales compared to the prior year. In the SGK Brand Solutions segment, sales for fiscal 2023 were $532.1 million, compared to $586.8 million in fiscal 2022. Changes in foreign currency exchange rates had an unfavorable impact of $16.1 million on the segment's sales compared to the prior year. The decrease in sales also reflected lower brand sales in the U.S. and Europe (including lower retail-based sales) and a decline in sales of cylinder (packaging) products in Europe. These decreases were partially offset by higher brand sales in the Asia-Pacific market and improved price realization.\nGross profit for the year ended September 30, 2023 was $577.7 million, compared to $522.3 million for fiscal 2022. Consolidated gross profit as a percent of sales was 30.7% and 29.6% in fiscal 2023 and fiscal 2022, respectively. The increase in gross profit primarily reflected the impact of higher sales (including benefits from recent acquisitions), lower transportation costs, and benefits from the realization of productivity improvements and other cost-reduction initiatives. These increases in gross profit were partially offset by the impact of higher material and labor costs, and lower margins on purpose-built engineered products. Gross profit also included acquisition integration costs and other charges primarily in connection with cost-reduction initiatives totaling $12.2 million and $12.6 million in fiscal 2023 and 2022, respectively. Fiscal 2022 gross\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nprofit included $9.7 million of asset write-downs related to the war between Russia and Ukraine (see Note 23, \"Asset Write-downs\" in Item 8 - \"Financial Statements and Supplementary Data\" for further details).\nSelling and administrative expenses for the year ended September 30, 2023 were $447.5 million, compared to $426.7 million for fiscal 2022. Consolidated selling and administrative expenses, as a percent of sales, were 23.8% for fiscal 2023, compared to 24.2% in fiscal 2022. Fiscal 2023 selling and administrative expenses reflected the impact of higher salaries and wage rates, higher travel and entertainment (\"T&E\") costs, increased performance-based compensation compared to fiscal 2022, additional expenses from recently completed acquisitions, and fees associated with a receivables purchase agreement and factoring arrangement (see Liquidity and Capital Resources below). These increases in selling and administrative expenses were partially offset by benefits from ongoing cost-reduction initiatives. Selling and administrative expenses also included acquisition integration and related systems-integration costs, and other charges primarily in connection with cost-reduction initiatives totaling $12.5 million in fiscal 2023, compared to $27.1 million in fiscal 2022. Intangible amortization for the year ended September 30, 2023 was $42.1 million, compared to $57.1 million for fiscal 2022. Fiscal 2022 intangible amortization included $9.5 million of amortization related to certain trade names that have been discontinued. In the fiscal 2022 fourth quarter, the Company recorded a goodwill write-down of $82.5 million related to the SGK Brand Solutions reporting unit (formerly the Graphics Imaging reporting unit). Refer to Note 22, \"Goodwill and Other Intangible Assets\" in Item 8 - \"Financial Statements and Supplementary Data\" for further details.\nAdjusted EBITDA for fiscal 2023 was $225.8 million, compared to $210.4 million for fiscal 2022. Memorialization segment adjusted EBITDA for fiscal 2023 was $164.0 million, compared to $151.8 million for fiscal 2022. The increase in segment adjusted EBITDA reflected the impact of higher sales, lower transportation costs, benefits from the acquisition of Eagle Granite Company, and benefits from productivity initiatives. These increases were partially offset by the impact of higher material, labor and T&E costs, and increased performance-based compensation compared to fiscal 2022. Adjusted EBITDA for the Industrial Technologies segment for fiscal 2023 was $66.3 million, compared to $56.8 million in fiscal 2022. The increase in segment adjusted EBITDA primarily reflected the impact of higher sales, partially offset by the impact of higher labor and T&E costs, increased performance-based compensation compared to fiscal 2022, and unfavorable contributions from recent acquisitions. Changes in foreign currency exchange rates had an unfavorable impact of $1.3 million on the segment's adjusted EBITDA compared to the prior year. Adjusted EBITDA for the SGK Brand Solutions segment for fiscal 2023 was $57.1 million, compared to $60.1 million for fiscal 2022. The decrease in segment adjusted EBITDA primarily reflected the impact of lower sales and higher material, labor and T&E costs, partially offset by benefits from cost reduction initiatives. Changes in foreign currency exchange rates had an unfavorable impact of $2.0 million on the segment's adjusted EBITDA compared to the prior year.\nInterest expense for fiscal 2023 was $44.6 million, compared to $27.7 million in fiscal 2022. The increase in interest expense primarily reflected higher average interest rates in the current fiscal year. Other income (deductions), net for the year ended September 30, 2023 represented a decrease in pre-tax income of $2.6 million, compared to a decrease in pre-tax income of $32.6 million in fiscal 2022. Other income (deductions), net includes the non-service components of pension and postretirement expense, which totaled $1.6 million and $31.8 million in fiscal years 2023 and 2022, respectively. Fiscal 2023 non-service pension expense included a $1.3 million non-cash charge resulting from the settlement of the Company's supplemental retirement plan (\"SERP\") and defined benefit portion of the officers retirement restoration plan (\"ORRP\") obligations. Fiscal 2022 non-service pension expense included a $30.9 million non-cash charge resulting from the full settlement of the Company's principal defined benefit retirement plan (\"DB Plan\") obligations. Refer to Note 15, \"Pension and Other Postretirement Plans\" in Item 8 - \"Financial Statements and Supplementary Data\" for further details. Other income (deductions), net also includes investment income, banking-related fees and the impact of currency gains and losses on certain intercompany debt and foreign denominated cash balances. Other income (deductions), net included currency losses associated with highly inflationary accounting for the Company's subsidiaries in Turkey totaling $1.4 million and $1.5 million in fiscal years 2023 and 2022, respectively (see Note 2, \"Summary of Significant Accounting Policies\" in Item 8 - \"Financial Statements and Supplementary Data\" for further details).\nThe Company's consolidated income taxes for the year ended September 30, 2023 were an expense of $1.8 million, compared to a benefit of $4.4 million for fiscal 2022. The difference between the Company's consolidated income taxes for fiscal 2023 compared to fiscal 2022 partially resulted from fiscal 2023 having consolidated income before income taxes compared to fiscal 2022 having a consolidated loss before income taxes. The fiscal 2023 tax rate was negatively impacted by share-based compensation. Additionally, the fiscal 2023 tax rate benefited from research and development and foreign tax credits and the utilization of foreign tax net operating losses with a valuation allowance. The fiscal 2022 consolidated loss reflected a goodwill write-down recorded in the fourth quarter of fiscal 2022 that was primarily non-deductible. The fiscal 2022 effective tax rate also benefited from research and development and foreign tax credits. The fiscal 2022 effective tax rate was negatively impacted by foreign net operating losses requiring a full valuation allowance.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nNet losses attributable to noncontrolling interests were $155,000 in fiscal 2023, compared to $54,000 in fiscal 2022. The net losses attributable to noncontrolling interests primarily reflected losses in less than wholly-owned businesses.\nComparison of Fiscal 2022 and Fiscal 2021:\nFor a comparison of the Company's results of operations for the fiscal years ended September 30, 2022 and September 30, 2021, see \"Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operation\" of the Company's annual report on Form 10-K for the fiscal year ended September 30, 2022 filed with the SEC on November 18, 2022.\nNON-GAAP FINANCIAL MEASURES:\nIncluded in this report are measures of financial performance that are not defined by GAAP. The Company uses non-GAAP financial measures to assist in comparing its performance on a consistent basis for purposes of business decision-making by removing the impact of certain items that management believes do not directly reflect the Companys core operations including acquisition and divestiture costs, ERP integration costs, strategic initiative and other charges (which includes non-recurring charges related to operational initiatives and exit activities), stock-based compensation and the non-service portion of pension and postretirement expense. Management believes that presenting non-GAAP financial measures is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items that management believes do not directly reflect the Company's core operations, (ii) permits investors to view performance using the same tools that management uses to budget, forecast, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating the Companys results. The Company believes that the presentation of these non-GAAP financial measures, when considered together with the corresponding GAAP financial measures and the reconciliations to those measures, provided herein, provides investors with an additional understanding of the factors and trends affecting the Companys business that could not be obtained absent these disclosures.\nThe Company believes that adjusted EBITDA provides relevant and useful information, which is used by the Companys management in assessing the performance of its business. Adjusted EBITDA is defined by the Company as earnings before interest, income taxes, depreciation, amortization and certain non-cash and/or non-recurring items that do not contribute directly to managements evaluation of its operating results. These items include stock-based compensation, the non-service portion of pension and postretirement expense, acquisition and divestiture costs, ERP integration costs, and strategic initiatives and other charges. Adjusted EBITDA provides the Company with an understanding of earnings before the impact of investing and financing charges and income taxes, and the effects of certain acquisition and divestiture costs, and ERP integration costs, and items that do not reflect the ordinary earnings of the Companys operations. This measure may be useful to an investor in evaluating operating performance. It is also useful as a financial measure for lenders and is used by the Companys management to measure business performance. Adjusted EBITDA is not a measure of the Company's financial performance under GAAP and should not be considered as an alternative to net income or other performance measures derived in accordance with GAAP, or as an alternative to cash flow from operating activities as a measure of the Company's liquidity. The Company's definition of adjusted EBITDA may not be comparable to similarly titled measures used by other companies.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nThe reconciliation of net income to adjusted EBITDA is as follows:\nYears Ended September 30,\n2023 2022 2021\n(Dollar amounts in thousands)\nNet income (loss) $ 39,136 $ (99,828) $ 2,858\nIncome tax provision (benefit) 1,774 (4,391) 6,375\nIncome (loss) before income taxes 40,910 (104,219) 9,233\nNet loss attributable to noncontrolling interests 155 54 52\nInterest expense, including Receivables Purchase Agreement (\"RPA\") and factoring financing fees (1)\n48,690 28,771 28,684\nDepreciation and amortization *\n96,530 104,056 133,512\nAcquisition and divestiture related items (2)**\n5,293 7,898 541\nStrategic initiatives and other charges (3)**\n13,923 28,060 28,998\nNon-recurring / incremental COVID-19 costs (4)***\n- 2,985 5,312\nHighly inflationary accounting losses (primarily non-cash) (5)\n1,360 1,473 -\nDefined benefit plan termination related items (6)\n- (429) -\nAsset write-downs, net (7)\n- 10,050 -\nGoodwill write-downs (8)\n- 82,454 -\nStock-based compensation 17,308 17,432 15,581\nNon-service pension and postretirement expense (9)\n1,640 31,823 5,837\nTotal Adjusted EBITDA $ 225,809 $ 210,408 $ 227,750\n(1) Includes fees for receivables sold under the RPA and factoring arrangements totaling $4.0 million and $1.0 million for the fiscal years ended September 30, 2023 and 2022, respectively.\n(2) Includes certain non-recurring costs associated with recent acquisition and divestiture activities, and also includes a gain of $1.8 million in fiscal year 2023 related to the divestiture of a business in the Industrial Technologies segment.\n(3) Includes certain non-recurring costs associated with productivity and cost-reduction initiatives intended to result in improved operating performance, profitability and working capital levels and costs associated with global ERP system integration efforts, net of loss recoveries of $2.2 million in fiscal year 2023 related to a previously disclosed theft of funds by a former employee initially identified in fiscal 2015.\n(4) Includes certain non-recurring direct incremental costs (such as costs for purchases of computer peripherals and devices to facilitate working-from-home, additional personal protective equipment and cleaning supplies and services, etc.) incurred in response to COVID-19. This amount does not include the impact of any lost sales or underutilization due to COVID-19.\n(5) Represents exchange losses associated with highly inflationary accounting related to the Company's Turkish subsidiaries (see Note 2, \"Summary of Significant Accounting Policies\" in Item 8 - Financial Statements and Supplementary Data).\n(6) Represents items associated with the termination of the Company's DB Plan, supplemental retirement plan and the defined benefit portion of the officers retirement restoration plan.\n(7) Represents asset write-downs, net of recoveries within the SGK Brand Solutions segment (see Note 23, \"Asset Write-Downs\" in Item 8 - Financial Statements and Supplementary Data).\n(8) Represents goodwill write-downs within the SGK Brand Solutions segment (see Note 22, \"Goodwill and Other Intangible Assets\" in Item 8 - Financial Statements and Supplementary Data).\n(9) Non-service pension and postretirement expense includes interest cost, expected return on plan assets, amortization of actuarial gains and losses, curtailment gains and losses, and settlement gains and losses. These benefit cost components are excluded from adjusted EBITDA since they are primarily influenced by external market conditions that impact investment returns and interest (discount) rates. Curtailment gains and losses and settlement gains and losses are excluded from adjusted EBITDA since they generally result from certain non-recurring events, such as plan amendments to modify future benefits or settlements of plan obligations. The service cost and prior service cost components of pension and postretirement expense are included in the calculation of adjusted EBITDA, since they are considered to be a better reflection of the ongoing service-related costs of providing these benefits. Please note that GAAP pension and postretirement expense or the adjustment above are not necessarily indicative of the current or future cash flow requirements related to these employee benefit plans.\n* Depreciation and amortization was $23.7 million, $23.2 million, and $23.0 million, for the Memorialization segment, $23.2 million, $11.4 million, and $11.4 million for the Industrial Technologies segment, $44.8 million, $64.2 million, and $93.7 million for the SGK Brand Solutions segment, and $4.8 million, $5.3 million, and $5.4 million for Corporate and Non-Operating, for the fiscal years ended September 30, 2023, 2022, and 2021, respectively.\n** Acquisition and divestiture costs, ERP integration costs, and strategic initiatives and other charges were $1.0 million, $3.5 million, and $1.9 million for the Memorialization segment, $4.1 million, $5.6 million, and $4.0 million for the Industrial Technologies segment, $10.9 million, $19.4 million, and $12.3 million for the SGK Brand Solutions segment, and $3.2 million, $7.5 million, and $11.3 million for Corporate and Non-Operating, for the fiscal years ended September 30, 2023, 2022, and 2021, respectively.\n*** Non-recurring/incremental COVID-19 costs were $1.3 million. and $3.6 million for the Memorialization segment, $6,000, and $38,000 for the Industrial Technologies segment, $1.2 million, and $1.5 million for the SGK Brand Solutions segment, $466,000, and $89,000 for Corporate and Non-Operating, for the fiscal years ended September 30, 2022, and 2021, respectively.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nLIQUIDITY AND CAPITAL RESOURCES:\nNet cash provided by operating activities was $79.5 million for the year ended September 30, 2023, compared to $126.9 million and $162.8 million for fiscal years 2022 and 2021, respectively. Operating cash flow for fiscal 2023 principally included net income (loss) adjusted for deferred taxes, depreciation and amortization, stock-based compensation expense, non-cash pension expense, gain on divestitures and sale of assets, and other non-cash adjustments, and changes in working capital items. Fiscal 2023 operating cash flow also reflected $24.2 million of contributions to fund the settlement of the Company's SERP and ORRP obligations, and $10.5 million of proceeds from the settlement of cash flow hedges. The change in working capital in fiscal 2023 primarily reflected higher inventory levels, lower trade accounts payable, and changes in contract assets and liabilities related to products and services provided to customers over time, partially offset by proceeds from the sale of receivables under a receivables purchase agreement and a non-recourse factoring arrangement (see below for further discussion). Operating cash flow for fiscal 2022 principally included net income (loss) adjusted for deferred taxes, depreciation and amortization, stock-based compensation expense, goodwill and other asset write-downs, non-cash pension expense, gain on divestitures and sale of assets, and other non-cash adjustments, and changes in working capital items. Fiscal 2022 operating cash flow also reflected $35.7 million of contributions to fully fund the settlement of the Company's DB Plan obligations. The favorable movements in working capital in fiscal 2022 primarily reflected proceeds from the sale of receivables under a receivables purchase agreement, partially offset by higher inventory levels reflecting increased commodity costs, lower performance-based compensation accruals, and changes in other accounts. Operating cash flow for fiscal 2021 principally included net income (loss) adjusted for deferred taxes, depreciation and amortization, stock-based compensation expense, net gains related to investments, and non-cash pension expense, and changes in working capital items. Fiscal 2021 operating cash flow also reflected a $15.0 million discretionary contribution to fund the DB Plan. The favorable movements in working capital in fiscal 2021 primarily reflected increased trade accounts payable.\nCash used in investing activities was $58.7 million for the year ended September 30, 2023, compared to $80.9 million and $13.0 million for fiscal years 2022 and 2021, respectively. Investing activities for fiscal 2023 primarily reflected capital expenditures of $50.6 million, acquisition payments (net of cash acquired or received from sellers) of $15.3 million, purchases of investments of $1.6 million, proceeds from the sale of assets of $2.1 million, and proceeds from divestitures of $6.7 million. Investing activities for fiscal 2022 primarily reflected capital expenditures of $61.3 million, acquisition payments (net of cash acquired or received from sellers) of $44.5 million, purchases of investments of $2.2 million, proceeds from the sale of assets of $5.0 million, proceeds from the sale of investments of $8.8 million, and proceeds from the settlement of net investment hedges of $13.1 million. Investing activities for fiscal 2021 primarily reflected capital expenditures of $34.3 million, acquisition payments (net of cash acquired or received from sellers) of $15.6 million, proceeds from the sale of assets of $2.8 million, and proceeds from the sale of investments of $34.2 million.\nCapital expenditures were $50.6 million for the year ended September 30, 2023, compared to $61.3 million and $34.3 million for fiscal years 2022 and 2021, respectively. Capital expenditures in each of the last three fiscal years reflected reinvestments in the Company's business segments and were made primarily for the purchase of new production machinery, equipment, software and systems, and facilities designed to improve product quality, increase manufacturing efficiency, lower production costs and meet regulatory requirements. Capital spending for property, plant and equipment has averaged $48.7 million for the last three fiscal years. Capital expenditures for the last three fiscal years were primarily financed through operating cash. Capital spending for fiscal 2024 is currently estimated to be approximately $75 million. Capital spending in fiscal years 2022 through 2024 reflects additional capital projects to support new production capabilities and increased efficiencies within the Memorialization and Industrial Technologies segments. The Company expects to generate sufficient cash from operations to fund all anticipated capital spending projects.\nCash used in financing activities for the year ended September 30, 2023 was $50.2 million, and principally reflected repayments, net of proceeds, on long-term debt of $18.2 million, purchases of treasury stock of $2.9 million, and payment of dividends to the Company's shareholders of $28.2 million ($0.92 per share). Cash used in financing activities for the year ended September 30, 2022 was $37.2 million, and principally reflected proceeds, net of repayments, on long-term debt of $35.7 million, purchases of treasury stock of $41.7 million, payment of dividends to the Company's shareholders of $27.7 million ($0.88 per share), and $725,000 of holdback and contingent consideration payments related to acquisitions from prior years. Cash used in financing activities for the year ended September 30, 2021 was $122.9 million, and principally reflected repayments, net of proceeds, on long-term debt of $76.8 million, purchases of treasury stock of $11.9 million, payment of dividends to the Company's shareholders of $27.7 million ($0.86 per share), $1.8 million of holdback and contingent consideration payments related to acquisitions from prior years, and $1.8 million of payments for the acquisition of noncontrolling interests.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nThe Company has a domestic credit facility with a syndicate of financial institutions that includes a $750.0 million senior secured revolving credit facility, which matures in March 2025. A portion of the revolving credit facility (not to exceed $350.0 million ) can be drawn in foreign currencies. In March 2023, an amendment to the domestic credit facility implemented SOFR as the replacement of LIBOR as the benchmark interest rate under the facility. The Company accounted for the change in reference rate as a non-substantial modification. Borrowings under the revolving credit facility now bear interest at SOFR, plus a 0.10% per annum rate spread adjustment, plus a factor ranging from 0.75% to 2.00% (1.25% at September 30, 2023) based on the Company's secured leverage ratio. Previously, borrowings under the revolving credit facility bore interest at LIBOR plus a factor ranging from 0.75% to 2.00% based on the Company's secured leverage ratio. The secured leverage ratio is defined as net secured indebtedness divided by EBITDA (earnings before interest, income taxes, depreciation and amortization) as defined within the domestic credit facility agreement. The Company is required to pay an annual commitment fee ranging from 0.15% to 0.30% (based on the Company's leverage ratio) of the unused portion of the revolving credit facility. The Company incurred debt issuance costs in connection with the domestic credit facility. Unamortized costs were $949,000 and $1.5 million at September 30, 2023 and September 30, 2022, respectively.\nThe domestic credit facility requires the Company to maintain certain leverage and interest coverage ratios. A portion of the facility (not to exceed $55.0 million) is available for the issuance of trade and standby letters of credit. Outstanding U.S. dollar denominated borrowings on the revolving credit facility at September 30, 2023 and 2022 were $405.0 million and $428.0 million, respectively. Outstanding Euro denominated borrowings on the revolving credit facility at September 30, 2023 and 2022 were €55.0 million ($58.2 million) and €45.0 million ($44.1 million), respectively. The weighted-average interest rate on outstanding borrowings for the domestic credit facility (including the effects of interest rate swaps and Euro denominated borrowings) at September 30, 2023 and 2022 was 5.95% and 3.13%, respectively.\nThe Company has $299.6 million of 5.25% senior unsecured notes due December 1, 2025 (the \"2025 Senior Notes\"). The 2025 Senior Notes bear interest at a rate of 5.25% per annum with interest payable semi-annually in arrears on June 1 and December 1 of each year. The Company's obligations under the 2025 Senior Notes are guaranteed by certain of the Company's direct and indirect wholly-owned domestic subsidiaries. The Company is subject to certain covenants and other restrictions in connection with the 2025 Senior Notes. The Company incurred direct financing fees and costs in connection with 2025 Senior Notes. Unamortized costs were $1.1 million and $1.7 million at September 30, 2023 and 2022, respectively.\nThe Company and certain of its domestic subsidiaries sell, on a continuous basis without recourse, their trade receivables to Matthews Receivables Funding Corporation, LLC (Matthews RFC), a wholly-owned bankruptcy-remote subsidiary of the Company. In March 2022, Matthews RFC entered into a receivables purchase agreement (RPA) to sell up to $125.0 million of receivables to certain purchasers (the Purchasers) on a recurring basis in exchange for cash (referred to as capital within the RPA) equal to the gross receivables transferred. The parties intend that the transfers of receivables to the Purchasers constitute purchases and sales of receivables. Matthews RFC has guaranteed to each Purchaser the prompt payment of sold receivables, and has granted a security interest in its assets for the benefit of the Purchasers. Under the RPA, which matures in March 2024, each Purchasers share of capital accrues yield at a floating rate plus an applicable margin. The Company is the master servicer under the RPA, and is responsible for administering and collecting receivables.\nThe proceeds of the RPA are classified as operating activities in the Companys Consolidated Statements of Cash Flows. Cash received from collections of sold receivables may be used to fund additional purchases of receivables on a revolving basis, or to reduce all or any portion of the outstanding capital of the Purchasers. The fair value of the sold receivables approximated book value due to their credit quality and short-term nature, and as a result, no gain or loss on sale of receivables was recorded. As of September 30, 2023, and 2022, the amount sold to the Purchasers was $101.8 million and $96.6 million, respectively which was derecognized from the Consolidated Balance Sheets. As collateral against sold receivables, Matthews RFC maintains a certain level of unsold receivables, which was $57.9 million and $44.3 million as of September 30, 2023 and 2022, respectively.\nThe following table sets forth a summary of receivables sold as part of the RPA:\nFor the Year Ended September 30,\n2023 2022\nGross receivables sold\n$ 393,493 $ 424,789\nCash collections reinvested\n(388,283) (328,199)\nNet cash proceeds received $ 5,210 $ 96,590\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nIn March 2023, the Company, through its U.K. subsidiary, entered into a non-recourse factoring arrangement. In connection with this arrangement, the Company periodically sells trade receivables to a third-party purchaser in exchange for cash. These transfers of financial assets are recorded at the time the Company surrenders control of the assets. As these transfers qualify as true sales under the applicable accounting guidance, the receivables are de-recognized from the Company's Consolidated Balance Sheets upon transfer. The principal amount of receivables sold under this arrangement was $55.2 million during the fiscal year ended September 30, 2023. The discounts on the trade receivables sold are included within administrative expense in the Consolidated Statements of Income. The proceeds from the sale of receivables are classified as operating activities in the Company's Consolidated Statements of Cash Flows. As of September 30, 2023, the amount of factored receivables that remained outstanding was $18.0 million.\nThe Company, through certain of its European subsidiaries, has a credit facility with a European bank, which is guaranteed by Matthews. The maximum amount of borrowings available under this facility is €10.0 million ($10.6 million). This facility also provides €18.5 million ($19.6 million) for bank guarantees. This facility has no stated maturity date and is available until terminated. There were no outstanding borrowings under the credit facility at September 30, 2023. Outstanding borrowings under the credit facility totaled €8.2 million ($8,050) at September 30, 2022. The weighted-average interest rate on outstanding borrowings under this facility was 2.25% at September 30, 2022.\nOther borrowings totaled $19.2 million and $13.4 million at September 30, 2023 and 2022, respectively. The weighted-average interest rate on these borrowings was 2.95% and 1.85% at September 30, 2023 and 2022, respectively.\nThe Company operates internationally and utilizes certain derivative financial instruments to manage its foreign currency, debt and interest rate exposures. The following table presents information related to interest rate swaps entered into by the Company and designated as cash flow hedges:\nSeptember 30, 2023 September 30, 2022\n(Dollar amounts in thousands)\nNotional amount $ 175,000 $ 125,000\nWeighted-average maturity period (years) 4.1 3.1\nWeighted-average received rate 5.32 % 3.14 %\nWeighted-average pay rate 3.83 % 1.04 %\nThe Company enters into interest rate swaps in order to achieve a mix of fixed and variable rate debt that it deems appropriate. In order to transition the Company's swaps from LIBOR-based to SOFR-based rates, the LIBOR-based swaps were settled during the second quarter of fiscal 2023, resulting in cash proceeds of $10.5 million. Concurrently, the Company entered into new interest rate swaps with SOFR-based rates with a notional amount of $175.0 million. The interest rate swaps have been designated as cash flow hedges of future variable interest payments, which are considered probable of occurring. Based on the Company's assessment, all of the critical terms of each of the hedges matched the underlying terms of the hedged debt and related forecasted interest payments, and as such, these hedges were considered highly effective.\nThe fair value of the interest rate swaps reflected a net unrealized gain of $4.0 million ($3.0 million after tax) and $10.7 million ($7.9 million after tax) at September 30, 2023 and 2022, respectively, that is included in shareholders' equity as part of accumulated other comprehensive income (\"AOCI\"). Unrecognized gains of $8.1 million ($6.0 million after tax) related to the terminated LIBOR-based swaps were also included in AOCI as of September 30, 2023. Assuming market rates remain constant with the rates at September 30, 2023, a gain (net of tax) of approximately $3.9 million included in AOCI is expected to be recognized in earnings over the next twelve months.\nThe Company has a U.S. Dollar/Euro cross currency swap with a notional amount of $81.4 million as of September 30, 2023 and 2022, which has been designated as a net investment hedge of foreign operations. The swap contract matures in September 2027. The Company assesses hedge effectiveness for this contract based on changes in fair value attributable to changes in spot prices. A loss of $2.1 million (net of income taxes of $701,000) and a gain of $2.8 million (net of income taxes of $940,000), which represented effective hedges of net investments, were reported as a component of AOCI within currency translation adjustment at September 30, 2023 and 2022, respectively. Income of $1.2 million and $1.6 million, which represented the recognized portion of the fair value of cross currency swaps excluded from the assessment of hedge effectiveness, was included in current period earnings as a component of interest expense for fiscal 2023 and fiscal 2022, respectively. At September 30,\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\n2023 and 2022, the swap totaled $2.8 million and $3.7 million, respectively, and was included in other accrued liabilities and other assets in the Consolidated Balance Sheets, respectively.\nThe Company previously used certain foreign currency debt instruments as net investment hedges of foreign operations. Currency losses of $5.4 million (net of income taxes of $1.7 million), which represent effective hedges of net investments, were reported as a component of AOCI within currency translation adjustment at September 30, 2021.\nThe Company enters into certain derivative contracts in accordance with its risk management strategy that do not meet the criteria for hedge accounting but which have the economic impact of largely mitigating foreign currency exposure. Changes in the fair value of these economic hedges are recorded in current period earnings as a component of other income (deductions), net. During fiscal 2022, net gains from economic hedges (which largely offset losses from underlying foreign currency exposures) totaled $4.7 million. No such economic hedge contracts were outstanding as of September 30, 2023 or 2022.\nThe Company has a stock repurchase program. The buy-back program is designed to increase shareholder value, enlarge the Company's holdings of its common stock, and add to earnings per share. Repurchased shares may be retained in treasury, utilized for acquisitions, or reissued to employees or other purchasers, subject to the restrictions set forth in the Company's Restated Articles of Incorporation. Under the current authorization, 1,195,013 shares remain available for repurchase as of September 30, 2023.\nConsolidated working capital was $253.7 million at September 30, 2023, compared to $217.2 million at September 30, 2022. Cash and cash equivalents were $42.1 million at September 30, 2023, compared to $69.0 million at September 30, 2022. The Company's current ratio was 1.6 and 1.5 at September 30, 2023 and 2022, respectively.\nLong-Term Contractual Obligations:\nThe following table summarizes the Company's contractual obligations at September 30, 2023, and the effect such obligations are expected to have on its liquidity and cash flows in future periods.\nPayments due in fiscal year:\nTotal 2024 2025 to 2026 2027 to 2028 After\nContractual Cash Obligations: (Dollar amounts in thousands)\nRevolving credit facilities $ 463,168 $ - $ 405,000 $ - $ 58,168\n2025 Senior Notes 337,875 15,750 322,125 - -\nFinance lease obligations (1)\n10,307 3,034 3,840 2,170 1,263\nNon-cancelable operating leases (1)\n79,413 26,123 36,646 13,169 3,475\nOther 28,380 1,037 17,624 2,299 7,420\nTotal contractual cash obligations $ 919,143 $ 45,944 $ 785,235 $ 17,638 $ 70,326\n(1)Lease obligations have not been discounted to their present value.\nIn the first quarter of fiscal 2023, the Company made lump sum payments totaling $24.2 million to fully settle the Company's non-qualified Supplemental Retirement Plan (\"SERP\") and defined benefit portion of the Company's Officers Retirement Restoration Plan (\"ORRP\") obligations. The settlement of these plan obligations resulted in the recognition of a non-cash charge of $1.3 million, which has been presented as a component of other income (deductions), net for the year ended September 30, 2023. This amount represents the immediate recognition of the deferred AOCI balances related to the SERP and ORRP. During fiscal 2023, the remaining funds held in a rabbi trust associated with the SERP were transferred to the Company. Consequently, these amounts are no longer classified as restricted cash.\nUnrecognized tax benefits are positions taken, or expected to be taken, on an income tax return that may result in additional payments to tax authorities. If a tax authority agrees with the tax position taken, or expected to be taken, or the applicable statute of limitations expires, then additional payments will not be necessary. As of September 30, 2023, the Company had unrecognized tax benefits, excluding penalties and interest, of approximately $3.8 million. The timing of potential future payments related to the unrecognized tax benefits is not presently determinable. The Company believes that its current liquidity sources, combined with its operating cash flow and borrowing capacity, will be sufficient to meet its capital needs for the foreseeable future.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nACQUISITIONS AND DIVESTITURES:\nRefer to Note 21, \"Acquisitions and Divestitures\" in Item 8 - \"Financial Statements and Supplementary Data,\" for further details on the Company's acquisitions and divestitures.\nFORWARD-LOOKING INFORMATION:\nManagement routinely develops and reviews with the Companys Board of Directors strategic plans with the primary objective of continuous improvement in the Companys consolidated sales and operating results. Strategic plans are developed at the business segment level and generally contain strategies for organic growth and acquisitions. Organic growth primarily reflects the Companys internal efforts to grow its businesses including commercial activities, cost structure and productivity improvements, new product development, and the expansion into new markets with existing products. Growth through acquisitions reflects the benefits from acquired businesses and also includes related integration activities to achieve commercial and cost synergy benefits.\nThe significant factors influencing organic sales growth in the Industrial Technologies segment include economic/industrial market conditions, new product development, and the electric vehicles (\"EV\") and e-commerce trends. The Industrial Technologies segment received over $200 million of new orders during the fiscal 2023 first quarter for its energy storage solutions business. The orders have been received from multiple EV, fuel cell, and battery manufacturers and are expected to impact the segments sales through mid-fiscal 2024. For the Memorialization segment, the Company expects that sales growth will be influenced by North America death rates and the impact of the increasing trend toward cremation on the segment's product offerings, including caskets, cemetery memorial products and cremation-related products. For the SGK Brand Solutions segment, the Company expects that sales growth will be influenced by global economic conditions, brand innovation, the level of marketing spending by the Company's clients, and government regulation. Due to the global footprint of the Companys businesses, particularly the Industrial Technologies and SGK Brand Solutions segments, currency fluctuations can also be a significant factor on Companys U.S. dollar reported results.\nRecent labor cost increases, supply chain challenges, and other inflation-related impacts are expected to impact the Company's results for the near future. The Company expects to partially mitigate these cost increases through price realization and cost-reduction initiatives.\nCRITICAL ACCOUNTING POLICIES:\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Therefore, the determination of estimates requires the exercise of judgment based on various assumptions and other factors such as historical experience, economic conditions, and in some cases, actuarial techniques. Actual results may differ from those estimates. A discussion of market risks affecting the Company can be found in Item 7A, \"Quantitative and Qualitative Disclosures about Market Risk,\" of this Annual Report on Form 10-K.\nThe Company's significant accounting policies are included in the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K. Management believes that the application of these policies on a consistent basis enables the Company to provide useful and reliable financial information about the Company's operating results and financial condition. The following accounting policies involve significant estimates, which were considered critical to the preparation of the Company's consolidated financial statements for the year ended September 30, 2023.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nLong-Lived Assets, including Property, Plant and Equipment:\nLong-lived assets are recorded at their respective cost basis on the date of acquisition. Depreciation on property, plant and equipment is computed primarily on the straight-line method over the estimated useful lives of the assets. Intangible assets with finite useful lives are amortized over their estimated useful lives. The Company reviews long-lived assets, including property, plant and equipment, and intangibles with finite useful lives, whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. Recoverability of assets is determined by evaluating the estimated undiscounted net cash flows of the operations to which the assets relate. An impairment loss would be recognized when the carrying amount of the assets exceeds the fair value, which is based on a discounted cash flow analysis. No such charges were recognized during the years presented, except as disclosed in Note 23, Asset Write-Downs\" in Item 8 - \"Financial Statements and Supplementary Data.\"\nGoodwill and Indefinite-Lived Intangibles:\nGoodwill and intangible assets with indefinite useful lives are not amortized, but are tested annually for impairment, or when circumstances indicate that a possible impairment may exist. In general, when the carrying value of these assets exceeds the implied fair value, an impairment loss must be recognized. A significant decline in cash flows generated from these assets may result in a write-down of the carrying values of the related assets. For purposes of testing goodwill for impairment, the Company uses a combination of valuation techniques, including discounted cash flows and other market indicators. A number of assumptions and estimates are involved in the application of the discounted cash flow model to forecast operating cash flows, including sales volumes and pricing, costs to produce, tax rates, capital spending, working capital changes, and discount rates. The Company estimates future cash flows using volume and pricing assumptions based largely on existing customer relationships and contracts, and operating cost assumptions management believes are reasonable based on historical performance and projected future performance as reflected in its most recent operating plans and projections. The discount rates used in the discounted cash flow analyses are developed with the assistance of valuation experts and management believes the discount rates appropriately reflect the risks associated with the Company's operating cash flows. In order to further validate the reasonableness of the estimated fair values of the reporting units as of the valuation date, a reconciliation of the aggregate fair values of all reporting units to market capitalization is performed using a reasonable control premium.\nThe Company performed its annual impairment review of goodwill and indefinite-lived intangible assets in the second quarter of fiscal 2023 (January 1, 2023) and determined that the estimated fair values for all goodwill reporting units exceeded their carrying values, therefore no impairment charges were necessary. The estimated fair value of the Company's SGK Brand Solutions reporting unit exceeded the carrying value (expressed as a percentage of carrying value) by approximately 9% as of January 1, 2023. In light of the limited excess fair value over carrying value and further declines experienced by the SGK Brand Solutions reporting unit, management determined that a triggering event occurred during the fourth quarter of fiscal 2023, resulting in an interim assessment of goodwill for the reporting unit, as of September 1, 2023. The results of this review indicated that the estimated fair value of the Company's SGK Brand Solutions reporting unit exceeded the carrying value (expressed as a percentage of carrying value) by approximately 4%. The fair value for the reporting unit was determined using level 3 inputs (including estimates of revenue growth, EBITDA contribution and the discount rates) and a combination of the income approach using the estimated discounted cash flows and a market-based valuation methodology. If current projections are not achieved or specific valuation factors outside the Company's control (such as discount rates and continued economic and industry challenges) significantly change, additional goodwill write-downs may be necessary in future periods.\nIn fiscal 2022, in its assessment of the potential impacts of weakened economic conditions (particularly in Europe), increases in the cost of certain materials, labor, and other inflation-related pressures, and unfavorable changes in foreign exchange rates on the estimated future earnings and cash flows for the SGK Brand Solutions reporting unit, and in light of the limited excess fair value over carrying value for this reporting unit, management determined a triggering event occurred, resulting in a re-evaluation of goodwill for the reporting unit, as of September 1, 2022. As a result of this interim assessment, the Company recorded a goodwill write-down totaling $82.5 million during the fiscal 2022 fourth quarter. Subsequent to this write-down, the fair value of the SGK Brand Solutions reporting unit approximated its carrying value at September 1, 2022. The fair value for the reporting unit was determined using level 3 inputs (including estimates of revenue growth, EBITDA contribution and the discount rates) and a combination of the income approach using the estimated discounted cash flows and a market-based valuation methodology.\nIncome Taxes:\nDeferred tax assets and liabilities are provided for the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the years in which the differences are expected to reverse. Valuation allowances are recorded to reduce deferred tax assets when it is more likely than not that a tax benefit will not be realized. Deferred\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS, (continued)\nincome taxes have not been provided on undistributed earnings of foreign subsidiaries since they have either been previously taxed, or are exempt from tax, or such earnings are considered to be reinvested indefinitely in foreign operations.\nINFLATION:\nRecent labor cost increases and other inflation-related pressures have had an unfavorable impact on the Company's results of operations (see \"Results of Operations\"). Although recent economic conditions increase the level of uncertainty in the Company's near-term outlook, inflation is not currently anticipated to have a material impact on a long-term basis.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS:\nRefer to Note 3, \"Accounting Pronouncements\" in Item 8 - \"Financial Statements and Supplementary Data,\" for further details on recently issued accounting pronouncements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK:\nThe following discussion about the Company's market risk involves forward-looking statements. Actual results could differ materially from those projected in the forward-looking statements. The Company has market risk related to changes in interest rates, commodity prices and foreign currency exchange rates. The Company does not generally use derivative financial instruments in connection with these market risks, except as noted below.\nInterest Rates - The Company's most significant long-term instrument is the domestic credit facility. U.S. dollar denominated debt under the domestic credit facility bears interest at variable rates based on SOFR (LIBOR for periods prior to March 2023).\nThe following table presents information related to interest rate contracts entered into by the Company and designated as cash flow hedges:\nSeptember 30, 2023 September 30, 2022\n(Dollar amounts in thousands)\nPay fixed swaps - notional amount $ 175,000 $ 125,000\nWeighted-average maturity period (years) 4.1 3.1\nWeighted-average received rate 5.32 % 3.14 %\nWeighted-average pay rate 3.83 % 1.04 %\nThe interest rate swaps have been designated as cash flow hedges of the future variable interest payments which are considered probable of occurring. Based on the Company's assessment, all the critical terms of each of the hedges matched the underlying terms of the hedged debt and related forecasted interest payments, and as such, these hedges were considered highly effective.\nThe fair value of the interest rate swaps reflected a net unrealized gain of $4.0 million ($3.0 million after-tax) at September 30, 2023 that is included in equity as part of AOCI. A hypothetical decrease of 10% in market interest rates (e.g., a decrease from 5.0% to 4.5%) would result in a decrease of approximately $502,000 in the fair value of the interest rate swaps.\nForeign Currency Exchange Rates - The Company is subject to changes in various foreign currency exchange rates, primarily including the Euro, British Pound, Canadian Dollar, and Australian Dollar in the conversion from local currencies to the U.S. dollar of the reported financial position and operating results of its non-U.S. based subsidiaries. An adverse change (strengthening U.S. dollar) of 10% in exchange rates would have resulted in a decrease in reported sales of $69.5 million and a decrease in reported operating income of $3.4 million for the year ended September 30, 2023.\nAs of September 30, 2023, the Company had a foreign currency derivative contract (U.S. Dollar/Euro cross currency swap) with a notional amount of $81.4 million designated as a net investment hedge of foreign operations. The net unrealized loss for this swap contract at September 30, 2023 was of $2.1 million (net of income taxes of $701,000). As of September 30, 2023, the potential gain or loss in the fair value of the swap contract assuming a hypothetical 10% fluctuation in the market rates would be approximately $9.0 million.\nITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK, (continued)\nCommodity Price Risks - In the normal course of business, the Company is exposed to commodity price fluctuations related to the purchases of certain materials and supplies (such as bronze ingot, steel, granite, fuel and wood) used in its manufacturing operations. The Company obtains competitive prices for materials and supplies when available. In addition, based on competitive market conditions and to the extent that the Company has established pricing terms with customers through contracts or similar arrangements, the Company's ability to immediately increase the price of its products to offset the increased costs may be limited.\nActuarial Assumptions - As of September 30, 2023, all of the Company's defined benefit plans are unfunded. The most significant actuarial assumption affecting pension expense and pension obligations is discount rates. A hypothetical decrease of 1% in discount rates would result in an increase of approximately $2.1 million in the projected benefit obligation. Refer to Note 15, \"Pension and Other Postretirement Plans\" in ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nDescription Pages\nManagement's Report to Shareholders 36\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nReport of Independent Registered Public Accounting Firm 38\nFinancial Statements:\nConsolidated Balance Sheets as of September 30, 2023 and 2022 40\nConsolidated Statements of Income (Loss) for the years ended September 30, 2023, 2022 and 2021 42\nConsolidated Statements of Comprehensive Income (Loss) for the years ended September 30, 2023, 2022 and 2021 43\nConsolidated Statements of Shareholders' Equity for the years ended September 30, 2023, 2022 and 2021 44\nConsolidated Statements of Cash Flows for the years ended September 30, 2023, 2022 and 2021 45\nNotes to Consolidated Financial Statements 46\nFinancial Statement Schedule - Schedule II-Valuation and Qualifying\nAccounts for the years ended September 30, 2023, 2022 and 2021 75\nMANAGEMENT'S REPORT TO SHAREHOLDERS\nTo the Shareholders and the Board of Directors of\nMatthews International Corporation\nManagement's Report on Financial Statements\nThe accompanying consolidated financial statements of Matthews International Corporation and its subsidiaries (collectively, the \"Company\") were prepared by management, which is responsible for their integrity and objectivity. The statements were prepared in accordance with generally accepted accounting principles and include amounts that are based on management's best judgments and estimates. The other financial information included in this Annual Report on Form 10-K is consistent with that in the financial statements.\nManagement's Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company, as such term is defined in Exchange Act Rule 13a-15f. In order to evaluate the effectiveness of internal control over financial reporting management has conducted an assessment using the criteria in Internal Control - Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\"). Internal controls over financial reporting is a process under the supervision of, our Chief Executive Officer and Chief Financial Officer, and effected by the Company's board of directors, management and other personnel to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Company's assets that could have a material effect on the financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the Company's internal control over financial reporting based on criteria in Internal Control - Integrated Framework (2013) issued by the COSO, and has concluded that the Company maintained effective internal control over financial reporting as of September 30, 2023. The effectiveness of the Company's internal control over financial reporting as of September 30, 2023 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which is included herein.\nManagement's Certifications\nThe certifications of the Company's Chief Executive Officer and Chief Financial Officer required by the Sarbanes-Oxley Act have been included as Exhibits 31 and 32 in this Annual Report on Form 10-K.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of\nMatthews International Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Matthews International Corporation and Subsidiaries internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Matthews International Corporation and Subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2023 and 2022, the related consolidated statements of income (loss), comprehensive income (loss), shareholders' equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and the financial statement schedule listed in the Index at Item 15(a)2 and our report dated November 17, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nPittsburgh, Pennsylvania\nNovember 17, 2023\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of\nMatthews International Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Matthews International Corporation and Subsidiaries (the Company) as of September 30, 2023 and 2022, the related consolidated statements of income (loss), comprehensive income (loss), shareholders' equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and financial statement schedule listed in the Index at Item 15(a)2 (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 17, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nValuation of SGK Brand Solutions Reporting Unit Goodwill\nDescription of the Matter As more fully described in Note 22 to the consolidated financial statements, during 2023, the Company performed its annual goodwill impairment test as of January 1, 2023 and determined that the estimated fair value of the SGK Brand Solutions reporting unit, within the SGK Brand Solutions segment, exceeded the carrying value (expressed as a percentage of carrying value) by approximately 9%. Because of the limited excess fair value over carrying value and further declines experienced by the SGK Brand Solutions reporting unit, the Company determined that a triggering event occurred during the fourth quarter of fiscal 2023, resulting in an interim assessment of goodwill for the reporting unit as of September 1, 2023. The results of this review indicated that the estimated fair value of the Company's SGK Brand Solutions reporting unit exceeded the carrying value (expressed as a percentage of carrying value) by approximately 4%. The Company utilized a combination of the income approach using the estimated discounted cash flows and a market-based valuation methodology. Significant assumptions used in the Companys fair value estimate included estimates of revenue growth, EBITDA contribution and the discount rates.\nAuditing the annual and interim goodwill impairment analyses was complex, as it included estimating the fair value of the reporting unit. In particular, the fair value estimates are sensitive to the significant assumptions named above, which are affected by expected future market or economic conditions.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design, and tested the operating effectiveness of internal controls over the Companys goodwill impairment review process. These controls include managements assessment of indicators of impairment, management's review of the assumptions utilized to develop the estimate, and managements verification of the completeness and accuracy of the underlying data utilized to project future operating results for the reporting unit.\nTo test the fair value of the reporting unit, our audit procedures included, among others, involving our valuation specialists to assist in assessing the valuation methodologies utilized by the Company and its valuation expert and testing the significant assumptions and underlying data used by the Company. We compared the significant assumptions used by management to current industry and economic trends, changes in the Companys business model, and other relevant factors. We also assessed the historical accuracy of managements estimates. We performed sensitivity analyses of significant assumptions to evaluate the sensitivity of the fair value of the reporting unit resulting from changes in key assumptions. We reviewed the reconciliation of the fair value of the reporting units to the market capitalization of the Company and assessed the resulting control premium.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2016.\nPittsburgh, Pennsylvania\nNovember 17, 2023\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nSeptember 30, 2023 and 2022\n(Dollar amounts in thousands, except per share data)\nASSETS 2023 2022\nCurrent assets:\nCash and cash equivalents $ 42,101 $ 69,016\nAccounts receivable, net of allowance for doubtful\naccounts of $10,784 and $10,138, respectively\n207,526 221,015\nInventories 260,409 225,440\nRestricted cash, current - 2,398\nContract assets 74,646 48,210\nOther current assets 63,575 62,537\nTotal current assets 648,257 628,616\nInvestments 24,988 25,976\nProperty, plant and equipment, net 270,326 256,065\nOperating lease right-of-use-assets 71,629 71,974\nDeferred income taxes 2,269 3,610\nGoodwill 698,109 675,421\nOther intangible assets, net 160,478 202,154\nOther assets 11,325 18,955\nTotal assets $ 1,887,381 $ 1,882,771\nThe accompanying notes are an integral part of these consolidated financial statements.\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS, continued\nSeptember 30, 2023 and 2022\n(Dollar amounts in thousands, except per share data)\nLIABILITIES AND SHAREHOLDERS' EQUITY 2023 2022\nCurrent liabilities:\nLong-term debt, current maturities $ 3,696 $ 3,277\nCurrent portion of operating lease liabilities 23,983 22,869\nTrade accounts payable 114,316 121,359\nAccrued compensation 58,872 58,272\nAccrued income taxes 12,561 9,277\nContract liabilities 36,935 31,871\nOther current liabilities 144,237 164,450\nTotal current liabilities 394,600 411,375\nLong-term debt 786,484 795,291\nOperating lease liabilities 50,189 51,445\nDeferred income taxes 71,255 92,589\nOther liabilities 59,572 44,995\nTotal liabilities 1,362,100 1,395,695\nShareholders' equity-Matthews:\nClass A common stock, $1.00 par value; authorized\n70,000,000 shares; 36,333,992 shares issued\n36,334 36,334\nPreferred stock, $100 par value, authorized 10,000 shares, none issued\n- -\nAdditional paid-in capital 168,211 160,255\nRetained earnings 714,727 706,749\nAccumulated other comprehensive loss (174,404) (190,191)\nTreasury stock, 5,864,778 and 6,035,940 shares, respectively, at cost\n(219,200) (225,795)\nTotal shareholders' equity-Matthews 525,668 487,352\nNoncontrolling interests (387) (276)\nTotal shareholders' equity 525,281 487,076\nTotal liabilities and shareholders' equity $ 1,887,381 $ 1,882,771\nThe accompanying notes are an integral part of these consolidated financial statements.\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME (LOSS)\nfor the years ended September 30, 2023, 2022 and 2021\n(Dollar amounts in thousands, except per share data)\n2023 2022 2021\nSales $ 1,880,896 $ 1,762,403 $ 1,671,030\nCost of sales (1,303,224) (1,240,125) (1,129,198)\nGross profit 577,672 522,278 541,832\nSelling expense (140,119) (128,362) (130,199)\nAdministrative expense (307,368) (298,315) (285,366)\nIntangible amortization (42,068) (57,084) (84,233)\nGoodwill write-downs - (82,454) -\nOperating profit (loss) 88,117 (43,937) 42,034\nInterest expense (44,648) (27,725) (28,684)\nOther income (deductions), net (2,559) (32,557) (4,117)\nIncome (loss) before income taxes 40,910 (104,219) 9,233\nIncome tax (provision) benefit (1,774) 4,391 (6,375)\nNet income (loss) 39,136 (99,828) 2,858\nNet loss attributable to noncontrolling interests 155 54 52\nNet income (loss) attributable to Matthews shareholders $ 39,291 $ (99,774) $ 2,910\nEarnings (loss) per share attributable to Matthews shareholders:\nBasic $ 1.28 $ (3.18) $ 0.09\nDiluted $ 1.26 $ (3.18) $ 0.09\nThe accompanying notes are an integral part of these consolidated financial statements.\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\nfor the years ended September 30, 2023, 2022 and 2021\n(Dollar amounts in thousands)\nYear Ended September 30, 2023\nMatthews Noncontrolling Interest Total\nNet income (loss) $ 39,291 $ (155) $ 39,136\nOther comprehensive income (loss), net of tax:\nForeign currency translation adjustment 13,114 11 13,125\nPension plans and other postretirement benefits 1,578 - 1,578\nUnrecognized gain (loss) on cash flow hedges:\nNet change from periodic revaluation 3,056 - 3,056\nNet amount reclassified to earnings (1,961) - (1,961)\nNet change in unrecognized gain on cash flow hedges 1,095 - 1,095\nOther comprehensive income, net of tax 15,787 11 15,798\nComprehensive income (loss) $ 55,078 $ (144) $ 54,934\nYear Ended September 30, 2022\nMatthews Noncontrolling Interest Total\nNet loss $ (99,774) $ (54) $ (99,828)\nOther comprehensive (loss) income, net of tax:\nForeign currency translation adjustment (48,059) 14 (48,045)\nPension plans and other postretirement benefits 41,112 - 41,112\nUnrecognized gain on cash flow hedges:\nNet change from periodic revaluation 8,148 - 8,148\nNet amount reclassified to earnings 1,347 - 1,347\nNet change in unrecognized gain on cash flow hedges 9,495 - 9,495\nOther comprehensive income, net of tax 2,548 14 2,562\nComprehensive loss $ (97,226) $ (40) $ (97,266)\nYear Ended September 30, 2021\nMatthews Noncontrolling Interest Total\nNet income (loss) $ 2,910 $ (52) $ 2,858\nOther comprehensive (loss) income, net of tax:\nForeign currency translation adjustment (3,370) (127) (3,497)\nPension plans and other postretirement benefits 47,024 - 47,024\nUnrecognized gain on cash flow hedges:\nNet change from periodic revaluation 1,873 - 1,873\nNet amount reclassified to earnings 2,453 - 2,453\nNet change in unrecognized gain on cash flow hedges 4,326 - 4,326\nOther comprehensive income (loss), net of tax 47,980 (127) 47,853\nComprehensive income (loss) $ 50,890 $ (179) $ 50,711\nThe accompanying notes are an integral part of these consolidated financial statements.\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nfor the years ended September 30, 2023, 2022 and 2021\n(Dollar amounts in thousands, except per share data)\nCommon\nStock Additional\nPaid-in\nCapital Retained\nEarnings Accumulated Other\nComprehensive\n(Loss) Income\n(net of tax) Treasury\nStock Non-\ncontrolling\nInterests Total\nBalance, September 30, 2020 $ 36,334 $ 135,187 $ 859,002 $ (240,719) $ (178,997) $ 626 $ 611,433\nNet income (loss) - - 2,910 - - (52) 2,858\nPension plans and other\npostretirement benefits - - - 47,024 - - 47,024\nTranslation adjustment - - - (3,370) - (127) (3,497)\nFair value of cash flow hedges - - - 4,326 - - 4,326\nTotal comprehensive income 50,711\nStock-based compensation - 15,581 - - - - 15,581\nPurchase of 380,109 shares\nof treasury stock\n- - - - (11,858) - (11,858)\nIssuance of 53,377 shares\nof treasury stock\n- (2,097) - - 2,097 - -\nCancellation of 34,727 shares of\ntreasury stock\n- 1,981 - - (1,981) - -\nDividends - - (27,704) - - - (27,704)\nTransactions with noncontrolling\ninterests - (1,168) - - - (592) (1,760)\nBalance, September 30, 2021 $ 36,334 $ 149,484 $ 834,208 $ (192,739) $ (190,739) $ (145) $ 636,403\nNet loss - - (99,774) - - (54) (99,828)\nPension plans and other\npostretirement benefits - - - 41,112 - - 41,112\nTranslation adjustment - - - (48,059) - 14 (48,045)\nFair value of cash flow hedges - - - 9,495 - - 9,495\nTotal comprehensive loss (97,266)\nStock-based compensation - 17,432 - - - - 17,432\nPurchase of 1,363,785 shares\nof treasury stock\n- - - - (41,717) - (41,717)\nIssuance of 223,033 shares\nof treasury stock\n- (8,767) - - 8,767 - -\nCancellation of 31,309 shares of\ntreasury stock\n- 2,106 - - (2,106) - -\nDividends - - (27,685) - - - (27,685)\nDivestiture - - - - - (91) (91)\nBalance, September 30, 2022 $ 36,334 $ 160,255 $ 706,749 $ (190,191) $ (225,795) $ (276) $ 487,076\nNet income (loss) - - 39,291 - - (155) 39,136\nPension plans and other\npostretirement benefits - - - 1,578 - - 1,578\nTranslation adjustment - - - 13,114 - 11 13,125\nFair value of cash flow hedges - - - 1,095 - - 1,095\nTotal comprehensive income 54,934\nStock-based compensation - 17,308 - - - - 17,308\nPurchase of 99,829 shares\nof treasury stock\n- - - - (2,857) - (2,857)\nIssuance of 305,318 shares\nof treasury stock\n- (11,310) - - 11,410 - 100\nCancellation of 34,327 shares of\ntreasury stock\n- 1,958 - - (1,958) - -\nDividends - - (31,313) - - - (31,313)\nTransactions with noncontrolling\ninterests - - - - - 33 33\nBalance, September 30, 2023 $ 36,334 $ 168,211 $ 714,727 $ (174,404) $ (219,200) $ (387) $ 525,281\nThe accompanying notes are an integral part of these consolidated financial statements.\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nfor the years ended September 30, 2023, 2022 and 2021\n(Dollar amounts in thousands)\n2023 2022 2021\nCash flows from operating activities:\nNet income (loss) $ 39,136 $ (99,828) $ 2,858\nAdjustments to reconcile net income (loss) to net cash flows from operating activities:\nDepreciation and amortization 96,530 104,056 133,512\nStock-based compensation expense 17,308 17,432 15,581\nDeferred tax (benefit) provision (21,626) (32,962) 4,158\nGain on divestitures and sale of assets, net (2,980) (3,390) (412)\nAsset write-downs - 10,050 -\nGoodwill write-downs - 82,454 -\nDefined benefit plan settlement losses 1,271 30,856 -\nDefined benefit plan settlement payments (24,242) (35,706) -\nProceeds from the settlement of cash flow hedges 10,474 - -\nChanges in working capital items (35,503) 29,590 12,982\nDecrease in other assets 9,339 20,093 15,115\nDecrease in other liabilities (8,863) (9,699) (16,346)\nOther operating activities, net (1,320) 13,914 (4,637)\nNet cash provided by operating activities 79,524 126,860 162,811\nCash flows from investing activities:\nCapital expenditures (50,598) (61,321) (34,313)\nAcquisitions, net of cash acquired (15,341) (44,469) (15,623)\nPurchases of investments (1,606) (2,198) -\nProceeds from sale of assets 2,120 4,955 2,776\nProceeds from divestitures 6,700 344 -\nProceeds from sale of investments - 8,771 34,167\nProceeds from the settlement of net investment hedges - 13,066 -\nNet cash used in investing activities (58,725) (80,852) (12,993)\nCash flows from financing activities:\nProceeds from long-term debt 865,747 777,809 625,628\nPayments on long-term debt (883,971) (742,121) (702,395)\nPurchases of treasury stock (2,857) (41,717) (11,858)\nDividends (28,202) (27,685) (27,704)\nAcquisition holdback and contingent consideration payments - (725) (1,781)\nTransactions with noncontrolling interests - - (1,760)\nOther financing activities (912) (2,774) (2,982)\nNet cash used in financing activities (50,195) (37,213) (122,852)\nEffect of exchange rate changes on cash 83 (5,724) 43\nNet change in cash, cash equivalents and restricted cash (29,313) 3,071 27,009\nCash, cash equivalents and restricted cash at beginning of year 71,414 68,343 41,334\nCash, cash equivalents and restricted cash at end of year $ 42,101 $ 71,414 $ 68,343\nCash paid during the year for:\nInterest $ 43,525 $ 27,411 $ 28,824\nIncome taxes 18,014 13,647 9,166\nThe accompanying notes are an integral part of these consolidated financial statements.\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(Dollar amounts in thousands, except per share data)\n1. NATURE OF OPERATIONS:\nMatthews International Corporation (\"Matthews\" or the \"Company\"), founded in 1850 and incorporated in Pennsylvania in 1902, is a global provider of memorialization products, industrial technologies and brand solutions. The Company manages its businesses under three segments: Memorialization, Industrial Technologies and SGK Brand Solutions. Memorialization products consist primarily of bronze and granite memorials and other memorialization products, caskets, cremation-related products, and cremation and incineration equipment primarily for the cemetery and funeral home industries. Industrial Technologies includes the design, manufacturing, service and distribution of high-tech custom energy storage solutions; product identification and warehouse automation technologies and solutions, including order fulfillment systems for identifying, tracking, picking and conveying consumer and industrial products; and coating and converting lines for the packaging, pharma, foil, décor and tissue industries. SGK Brand Solutions consists of brand management, pre-media services, printing plates and cylinders, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries.\nThe Company has facilities in North America, Europe, Asia, Australia, and Central and South America.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES:\nPrinciples of Consolidation:\nThe consolidated financial statements include all domestic and foreign subsidiaries in which the Company maintains an ownership interest and has operating control and any variable interest entities for which the Company is the primary beneficiary. Investments in certain companies over which the Company exerts significant influence, but does not control the financial and operating decisions, are accounted for as equity method investments. Investments in certain companies over which the Company does not exert significant influence are accounted for as cost-method investments. All intercompany accounts and transactions have been eliminated.\nUse of Estimates:\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash, Cash Equivalents and Restricted Cash:\nThe Company considers all investments purchased with a remaining maturity of three months or less to be cash equivalents. Restricted cash represents amounts held for specific purposes, which are not available for general business use. The carrying amount of cash, cash equivalents and restricted cash approximates fair value due to the short-term maturities of these instruments.\nTrade Receivables and Allowance for Doubtful Accounts:\nTrade receivables are carried at their estimated collectible amounts. Trade credit is generally extended on a short-term basis; thus trade receivables do not bear interest, although a finance charge may be applied to such receivables that are more than 30 days past due. The allowance for doubtful accounts is based on an evaluation of historical collection experience, the aging of accounts receivable, and economic trends and forecasts, and also reflects adjustments for specific customer accounts for which available facts and circumstances indicate collectability may be uncertain.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, (continued)\nInventories:\nInventories are stated at the lower of cost or net realizable value with cost generally determined under the average cost method. Inventory costs include material, labor, and applicable manufacturing overhead (including depreciation) and other direct costs. Net realizable value is the estimated selling price in the ordinary course of business, less reasonably predictable costs of completion, disposal, and transportation.\nProperty, Plant and Equipment:\nProperty, plant and equipment are carried at cost. Depreciation is computed primarily on the straight-line method over the estimated useful lives of the assets, which generally range from 10 to 45 years for buildings and 3 to 12 years for machinery and equipment. Gains or losses from the disposition of assets are reflected in operating profit. The cost of maintenance and repairs is charged to expense as incurred. Renewals and betterments of a nature considered to extend the useful lives of the assets are capitalized. Property, plant and equipment are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. Recoverability of assets is determined by evaluating the estimated undiscounted net cash flows of the operations to which the assets relate. An impairment loss would be recognized when the carrying amount of the assets exceeds the fair value, which is based on a discounted cash flow analysis. No such charges were recognized during the years presented, except as disclosed in Note 23, Asset Write-Downs.\"\nLeases:\nA lease exists at contract inception if the contract conveys the right to control an identified asset for a period of time in exchange for consideration. Control is considered to exist when the lessee has the right to obtain substantially all of the economic benefits from the use of an identified asset, as well as the right to direct the use of that asset. If a contract is considered to be a lease, the Company recognizes a lease liability based on the present value of the future lease payments, and a corresponding right-of-use (\"ROU\") asset. As a majority of the Companys leases do not provide an implicit interest rate within the lease, an incremental borrowing rate is used to determine the ROU asset and lease liability which is based on information available at the commencement date. Options to purchase, extend or terminate a lease are included in the ROU asset and lease liability when it is reasonably certain an option will be exercised. Renewal options are most prevalent in the Companys real estate leases. In general, the Company has not included renewal options for leases in the ROU asset and lease liability because the likelihood of renewal is not considered to be reasonably certain. In addition, leases may include variable lease payments, for items such as maintenance and utilities, which are expensed as incurred as variable lease expense.\nThe Company applies the practical expedient to not separate lease components from non-lease components for all asset classes. In addition, the Company applies the practical expedient to utilize a portfolio approach for certain equipment asset classes, primarily information technology, as the application of the lease model to the portfolio would not differ materially from the application of the lease model to the individual leases within the portfolio.\nThere are two types of leases, operating leases and finance leases. Lease classification is determined at lease commencement. Leases not meeting the finance lease criteria are classified as operating leases. ROU assets and corresponding lease liabilities are recorded on the Consolidated Balance Sheet. ROU assets for operating leases are classified in other assets, and ROU assets for finance leases are classified in property, plant and equipment, net on the Consolidated Balance Sheet. For operating leases, short-term lease liabilities are classified in other current liabilities, and long-term lease liabilities are classified in other liabilities on the Consolidated Balance Sheet. For finance leases, short-term lease liabilities are classified in long-term debt, current maturities, and long-term lease liabilities are classified in long-term debt on the Consolidated Balance Sheet. Leases with an initial lease term of twelve months or less have not been recognized on the Consolidated Balance Sheet.\nLease expense for operating leases is recognized on a straight-line basis over the lease term as an operating expense, while the expense for finance leases is recognized as depreciation expense and interest expense using the interest method of recognition. On the cash flow statement, payments for operating leases are classified as operating activities. Payments for finance leases are classified as a financing activity, with the exception of the interest component of the payment which is classified as an operating activity.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, (continued)\nGoodwill and Other Intangible Assets:\nIntangible assets with finite useful lives are amortized over their estimated useful lives, ranging from 2 to 15 years, and are reviewed when appropriate for possible impairment, similar to property, plant and equipment. Goodwill and intangible assets with indefinite lives are not amortized, but are tested annually for impairment, or when circumstances indicate that a possible impairment may exist. In general, when the carrying value of these assets exceeds the implied fair value, an impairment loss must be recognized. A significant decline in cash flows generated from these assets may result in a write-down of the carrying values of the related assets. For purposes of testing goodwill for impairment, the Company uses a combination of valuation techniques, including discounted cash flows and other market indicators. For purposes of testing indefinite-lived intangible assets, the Company generally uses a relief from royalty method.\nPension and Other Postretirement Plans:\nPension liabilities are determined on an actuarial basis and are affected by the discount rate used to determine the present value of benefit obligations which will affect the amount of pension cost. Differences between actual and expected results or changes in the value of the obligations are initially recognized through other comprehensive income and subsequently amortized to the Consolidated Statement of Income.\nEnvironmental:\nCosts that mitigate or prevent future environmental issues or extend the life or improve equipment utilized in current operations are capitalized and depreciated on a straight-line basis over the estimated useful lives of the related assets. Costs that relate to current operations or an existing condition caused by past operations are expensed. Environmental liabilities are recorded when the Company's obligation is probable and reasonably estimable. Accruals for losses from environmental remediation obligations do not consider the effects of inflation, and anticipated expenditures are not discounted to their present value.\nDerivatives and Hedging:\nDerivatives are generally held as part of a formal documented hedging program. All derivatives are held for purposes other than trading. Matthews measures effectiveness by formally assessing, at least quarterly, the historical and probable future high correlation of changes in the fair value or future cash flows of the hedged item. If the hedging relationship ceases to be highly effective or it becomes probable that an expected transaction will no longer occur, gains and losses on the derivative will be recorded in other income (deductions) at that time.\nChanges in the fair value of derivatives designated as cash flow hedges are recorded in other comprehensive income (loss) (\"OCI\"), net of tax, and are reclassified to earnings in a manner consistent with the underlying hedged item. The cash flows from hedging activities are recognized in the statement of cash flows in a manner consistent with the underlying hedged item.\nForeign Currency:\nThe functional currency of the Company's foreign subsidiaries is generally the local currency. Balance sheet accounts for foreign subsidiaries are translated into U.S. dollars at exchange rates in effect at the consolidated balance sheet date. Gains or losses that result from this process are recorded in accumulated other comprehensive income (loss). The revenue and expense accounts of foreign subsidiaries are translated into U.S. dollars at the average exchange rates that prevailed during the period. Realized gains and losses from foreign currency transactions are presented in the Statement of Income in a consistent manner with the underlying transaction based upon the provisions of Accounting Standards Codification (\"ASC\") 830 \"Foreign Currency Matters.\"\nThe Company applies highly inflationary accounting for subsidiaries when the cumulative inflation rate for a three-year period meets or exceeds 100 percent. Under highly inflationary accounting, the financial statements of these subsidiaries are remeasured into the Company's reporting currency (U.S. dollar) and exchange gains and losses from the remeasurement of monetary assets and liabilities are reflected in current earnings, rather than accumulated other comprehensive loss on the Consolidated Balance Sheets, until such time as the applicable economy is no longer considered highly inflationary.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, (continued)\nEffective April 1, 2022, the Company applies highly inflationary accounting to its Turkish subsidiaries. As of September 30, 2023 and 2022, the Company had net monetary assets related to its Turkish subsidiaries of $4,271 and $5,022, respectively. Exchange losses related to highly inflationary accounting totaled $1,360 and $1,473 in fiscal 2023 and 2022, respectively, and were included in the Consolidated Statements of Income within other income (deductions), net.\nComprehensive Income (Loss):\nComprehensive income (loss) consists of net income adjusted for changes, net of any related income tax effect, in cumulative foreign currency translation, the fair value of cash flow hedges, unrealized investment gains and losses and remeasurement of pension and other postretirement liabilities.\nTreasury Stock:\nTreasury stock is carried at cost. The cost of treasury shares sold is determined under the average cost method.\nRevenue Recognition:\nRevenue is recognized when control of a good or service promised in a contract (i.e., performance obligation) is transferred to a customer. Control is obtained when a customer has the ability to direct the use of and obtain substantially all of the remaining benefits from that good or service. For substantially all transactions, control passes in accordance with agreed upon delivery terms, including in certain circumstances, customer acceptance. Transaction price, for revenue recognition, is allocated to each performance obligation consisting of the stand alone selling price for goods and services, as well as warranties. Transaction price also reflects estimates of rebates, other sales or contract renewal incentives, cash discounts and sales returns (\"Variable Consideration\"). Estimates are made for Variable Consideration based on contract terms and historical experience of actual results and are applied to the performance obligations as they are satisfied. The Company elected to apply the practical expedient under Accounting Standards Codification (\"ASC\") Topic 606, Revenue from Contracts with Customers which exempts the adjustment of the consideration for the existence of a significant financing component when the period between the transfer of the services and the payment for such services is one year or less. Each product or service delivered to a third-party customer is considered to satisfy a performance obligation. Performance obligations generally occur at a point in time and are satisfied when control of the goods passes to the customer. Certain revenue related to mausoleum construction and significant engineering projects, including purpose-built engineered products (primarily in support of the electric vehicle and energy storage solutions industries), cremation and incineration projects, and product identification and warehouse automation projects, are recognized over time using the input method measuring progress toward completion of such projects. Contract assets include unbilled amounts resulting from sales under contracts where revenue is recognized over time and revenue exceeds the amount that can be billed to the customer based on the terms of the contract. Contract liabilities include customer deposits that are made prior to the satisfaction of performance obligations for a contract. The Company is entitled to collection of the sales price under normal credit terms in the regions in which it operates. Refer to Note 4, Revenue Recognition, for a further discussion.\nShipping and Handling Fees and Costs:\nAll fees billed to the customer for shipping and handling are classified as a component of net revenues. All costs associated with shipping and handling are classified as a component of cost of sales or selling expense.\nResearch and Development Expenses:\nResearch and development costs are expensed as incurred and were approximately $15,560, $15,536 and $13,206 for the years ended September 30, 2023, 2022 and 2021, respectively.\nStock-Based Compensation:\nStock-based compensation cost is measured at grant date, based on the fair value of the award, and is recognized as expense over the employee requisite service period.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES, (continued)\nIncome Taxes:\nDeferred tax assets and liabilities are provided for the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the years in which the differences are expected to reverse. Valuation allowances are recorded to reduce deferred tax assets when it is more likely than not that a tax benefit will not be realized. Deferred income taxes have not been provided on undistributed earnings of foreign subsidiaries since they have either been previously taxed, or are exempt from tax, or such earnings are considered to be reinvested indefinitely in foreign operations.\nEarnings Per Share:\nBasic earnings per share is computed by dividing net income by the average number of common shares outstanding. Diluted earnings per share is computed using the treasury stock method, which assumes the issuance of common stock for all dilutive securities.\n3. ACCOUNTING PRONOUNCEMENTS:\nIssued\nIn October 2021, the Financial Accounting Standards Board (the \"FASB\") issued Accounting Standards Update (\"ASU\") No. 2021-08, Business Combinations (Topic 805) which improves the accounting for acquired revenue contracts with customers in a business combination by addressing diversity in practice and inconsistency related to recognition of an acquired contract asset/liability, and payment terms and their effect on subsequent revenue recognized by the acquirer. This ASU is effective for the Company beginning in interim periods starting in fiscal 2024. While the impact of this ASU is dependent on the nature of any future transactions, the Company currently does not expect this ASU to have a significant impact on its consolidated financial statements.\nIn September 2022, the FASB issued ASU No. 2022-04, Liabilities - Supplier Finance Programs (Subtopic 405-50) which enhances the transparency of supplier finance programs by addressing disclosure requirements. Specifically, the amendment requires disclosure of key program terms, amounts outstanding, balance sheet presentation, and a rollforward of amounts outstanding during the annual period. The ASU will be effective beginning in the first quarter of fiscal 2024, except for the rollforward requirement, which is effective in fiscal year 2025. The adoption of this ASU is not expected to have a material impact on the Company's consolidated financial statements.\nAdopted\nIn July 2023, the FASB issued ASU No. 2023-03, Presentation of Financial Statements (Topic 205), Income Statement-Reporting Comprehensive Income (Topic 220), Distinguishing Liabilities from Equity (Topic 480), Equity (Topic 505), and Compensation-Stock Compensation (Topic 718): Amendments to SEC Paragraphs Pursuant to SEC Staff Accounting Bulletin No. 120, SEC Staff Announcement at the March 24, 2022 EITF Meeting, and Staff Accounting Bulletin Topic 6.B, Accounting Series Release 280-General Revision of Regulation S-X: Income or Loss Applicable to Common Stock (SEC Update) which enhances the transparency of stock based compensation and material nonpublic information at the time of a grant. The adoption of this ASU in the fourth quarter of fiscal 2023 had no material impact on the Company's consolidated financial statements.\nIn August 2018, the FASB issued ASU No. 2018-14, Compensation - Retirement Benefits - Defined Benefit Plans - General (Subtopic 715-20), which modifies the disclosure requirements for employers that sponsor defined benefit pension or other postretirement plans. The adoption of this ASU in the first quarter ended December 31, 2020 had no material impact on the Company's consolidated financial statements.\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326), which provides financial statement users with more decision-useful information about the expected credit losses on financial instruments and other commitments to extend credit held by a reporting entity at each report date. Subsequently, the FASB issued ASU No. 2019-11, Codification Improvements to Topic 326, Financial Instruments-Credit Losses and ASU No. 2020-02, Financial Instruments-Credit Losses (Topic 326) and Leases (Topic 842), that provide certain amendments to the new guidance. The adoption of these ASUs in the first quarter ended December 31, 2020 had no material impact on the Company's consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n3. ACCOUNTING PRONOUNCEMENTS, (continued)\nThe following table summarizes the activity for the accounts receivable allowance for doubtful accounts for the years ended September 30, 2023, 2022 and 2021.\nDescription Balance at Beginning of Period Charged to Expense Charged to other Accounts Deductions (1)\nBalance at\nEnd of Period\nAllowance for Doubtful Accounts:\nFiscal Year Ended:\nSeptember 30, 2023 $ 10,138 $ 1,625 $ - $ (979) $ 10,784\nSeptember 30, 2022 10,654 1,368 - (1,884) 10,138\nSeptember 30, 2021 9,618 2,182 - (1,146) 10,654\n(1) Amounts determined not to be collectible (including direct write-offs), net of recoveries.\n4. REVENUE RECOGNITION:\nThe Company disaggregates revenue from contracts with customers by geography, as it believes geographic regions best depict how the nature, amount, timing and uncertainty of revenue and cash flows are affected by economic factors. Disaggregated sales by segment and region for the years ended September 30, 2023, 2022 and 2021 were as follows:\nNorth America Central and South America Europe Australia Asia Consolidated\nMemorialization:\n2023 $ 799,153 $ - $ 32,745 $ 11,099 $ - $ 842,997\n2022 788,791 - 41,184 10,149 - 840,124\n2021 710,926 - 47,858 10,232 - 769,016\nIndustrial Technologies:\n2023 $ 164,334 $ - $ 333,759 $ - $ 7,658 $ 505,751\n2022 155,977 - 172,985 - 6,561 335,523\n2021 142,516 - 135,612 - 6,367 284,495\nSGK Brand Solutions:\n2023 $ 255,751 $ 5,260 $ 206,232 $ 8,814 $ 56,091 $ 532,148\n2022 285,499 4,729 230,437 11,057 55,034 586,756\n2021 287,954 5,036 262,804 13,336 48,389 617,519\nConsolidated:\n2023 $ 1,219,238 $ 5,260 $ 572,736 $ 19,913 $ 63,749 $ 1,880,896\n2022 1,230,267 4,729 444,606 21,206 61,595 1,762,403\n2021 1,141,396 5,036 446,274 23,568 54,756 1,671,030\nRevenue from products or services provided to customers over time accounted for approximately 15%, 12%, and 11% of revenue for the years ended September 30, 2023, 2022, and 2021, respectively.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n5. FAIR VALUE MEASUREMENTS:\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. A three level fair value hierarchy is used to prioritize the inputs used in valuations, as defined below:\nLevel 1: Observable inputs that reflect unadjusted quoted prices for identical assets or liabilities in active markets.\nLevel 2: Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly.\nLevel 3: Unobservable inputs for the asset or liability.\nAs of September 30, 2023 and 2022, the fair values of the Company's assets and liabilities measured on a recurring basis were categorized as follows:\nSeptember 30, 2023\nLevel 1 Level 2 Level 3 Total\nAssets:\nDerivatives (1)\n$ - $ 4,006 $ - $ 4,006\nEquity and fixed income mutual funds - 699 - 699\nLife insurance policies - 4,926 - 4,926\nTotal assets at fair value $ - $ 9,631 $ - $ 9,631\nLiabilities:\nDerivatives (1)\n$ - $ 2,766 $ - $ 2,766\nTotal liabilities at fair value $ - $ 2,766 $ - $ 2,766\nSeptember 30, 2022\nLevel 1 Level 2 Level 3 Total\nAssets:\nDerivatives (1)\n$ - $ 14,421 $ - $ 14,421\nEquity and fixed income mutual funds - - - -\nLife insurance policies - 4,439 - 4,439\nTotal assets at fair value $ - $ 18,860 $ - $ 18,860\n(1) Interest rate swaps and cross currency swaps are valued based on observable market swap rates and are classified within Level 2 of the fair value hierarchy.\nThe carrying values for other financial assets and liabilities approximated fair value for the years ended September 30, 2023 and 2022.\n6. INVENTORIES:\nInventories at September 30, 2023 and 2022 consisted of the following:\n2023 2022\nRaw materials $ 70,451 $ 52,586\nWork in process 108,400 94,804\nFinished goods 81,558 78,050\n$ 260,409 $ 225,440\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n7. INVESTMENTS:\nAt September 30, 2023 and 2022, non-current investments were as follows:\n2023 2022\nEquity and fixed income mutual funds $ 699 $ -\nLife insurance policies 4,926 4,439\nEquity-method investments 323 2,729\nOther (primarily cost-method) investments 19,040 18,808\n$ 24,988 $ 25,976\nDuring fiscal 2023, the Company purchased the remaining ownership interest in a small Industrial Technologies business, which was previously held as an equity-method investment. See Note 21, \"Acquisitions and Divestitures.\"\n8. PROPERTY, PLANT AND EQUIPMENT:\nProperty, plant and equipment and the related accumulated depreciation at September 30, 2023 and 2022 were as follows:\n2023 2022\nBuildings $ 144,585 $ 137,827\nMachinery, equipment and other 493,313 477,004\n637,898 614,831\nLess accumulated depreciation (416,663) (404,548)\n221,235 210,283\nLand 20,943 20,209\nConstruction in progress 28,148 25,573\n$ 270,326 $ 256,065\nDepreciation expense, including amortization of assets under finance lease, was $54,462, $46,972 and $49,279 for each of the three years ended September 30, 2023, 2022 and 2021, respectively.\n9. DEBT AND FINANCING ARRANGEMENTS:\nLong-term debt at September 30, 2023 and 2022 consisted of the following:\n2023 2022\nRevolving credit facilities $ 463,168 $ 480,107\n2025 Senior Notes 298,500 297,961\nOther borrowings 19,241 13,434\nFinance lease obligations 9,271 7,066\nTotal debt 790,180 798,568\nLess current maturities (3,696) (3,277)\nLong-term debt $ 786,484 $ 795,291\nThe Company has a domestic credit facility with a syndicate of financial institutions that includes a $750,000 senior secured revolving credit facility, which matures in March 2025. A portion of the revolving credit facility (not to exceed $350,000) can be drawn in foreign currencies. In March 2023, an amendment to the domestic credit facility implemented SOFR as the replacement of LIBOR as the benchmark interest rate under the facility. The Company accounted for the change in reference rate as a non-substantial modification. Borrowings under the revolving credit facility now bear interest at SOFR, plus a 0.10% per annum rate spread adjustment, plus a factor ranging from 0.75% to 2.00% (1.25% at September 30, 2023) based on the Company's secured leverage ratio. Previously, borrowings under the revolving credit facility bore interest at LIBOR plus a factor ranging from 0.75% to 2.00% based on the Company's secured leverage ratio. The secured leverage ratio is defined as net secured indebtedness divided by EBITDA (earnings before interest, income taxes, depreciation and amortization) as defined within the domestic credit facility agreement. The Company is required to pay an annual commitment fee ranging from 0.15%\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n9. DEBT AND FINANCING ARRANGEMENTS, (continued)\nto 0.30% (based on the Company's leverage ratio) of the unused portion of the revolving credit facility. The Company incurred debt issuance costs in connection with the domestic credit facility. Unamortized costs were $949 and $1,522 at September 30, 2023 and September 30, 2022, respectively.\nThe domestic credit facility requires the Company to maintain certain leverage and interest coverage ratios. A portion of the facility (not to exceed $55,000) is available for the issuance of trade and standby letters of credit. Outstanding U.S. dollar denominated borrowings on the revolving credit facility at September 30, 2023 and 2022 were $405,000 and $427,960, respectively. Outstanding Euro denominated borrowings on the revolving credit facility at September 30, 2023 and 2022 were €55.0 million ($58,168) and €45.0 million ($44,097), respectively. The weighted-average interest rate on outstanding borrowings for the domestic credit facility (including the effects of interest rate swaps and Euro denominated borrowings) at September 30, 2023 and 2022 was 5.95% and 3.13%, respectively.\nThe Company has $299,625 of 5.25% senior unsecured notes due December 1, 2025 (the \"2025 Senior Notes\"). The 2025 Senior Notes bear interest at a rate of 5.25% per annum with interest payable semi-annually in arrears on June 1 and December 1 of each year. The Company's obligations under the 2025 Senior Notes are guaranteed by certain of the Company's direct and indirect wholly-owned domestic subsidiaries. The Company is subject to certain covenants and other restrictions in connection with the 2025 Senior Notes. The Company incurred direct financing fees and costs in connection with 2025 Senior Notes. Unamortized costs were $1,125 and $1,664 at September 30, 2023 and 2022, respectively.\nThe Company and certain of its domestic subsidiaries sell, on a continuous basis without recourse, their trade receivables to Matthews Receivables Funding Corporation, LLC (Matthews RFC), a wholly-owned bankruptcy-remote subsidiary of the Company. In March 2022, Matthews RFC entered into a receivables purchase agreement (RPA) to sell up to $125,000 of receivables to certain purchasers (the Purchasers) on a recurring basis in exchange for cash (referred to as capital within the RPA) equal to the gross receivables transferred. The parties intend that the transfers of receivables to the Purchasers constitute purchases and sales of receivables. Matthews RFC has guaranteed to each Purchaser the prompt payment of sold receivables, and has granted a security interest in its assets for the benefit of the Purchasers. Under the RPA, which matures in March 2024, each Purchasers share of capital accrues yield at a floating rate plus an applicable margin. The Company is the master servicer under the RPA, and is responsible for administering and collecting receivables.\nThe proceeds of the RPA are classified as operating activities in the Companys Consolidated Statements of Cash Flows. Cash received from collections of sold receivables may be used to fund additional purchases of receivables on a revolving basis, or to reduce all or any portion of the outstanding capital of the Purchasers. The fair value of the sold receivables approximated book value due to their credit quality and short-term nature, and as a result, no gain or loss on sale of receivables was recorded. As of September 30, 2023 and 2022, the amount sold to the Purchasers was $101,800 and $96,590, respectively, which was derecognized from the Consolidated Balance Sheets. As collateral against sold receivables, Matthews RFC maintains a certain level of unsold receivables, which was $57,897 and $44,262 as of September 30, 2023 and 2022, respectively.\nThe following table sets forth a summary of receivables sold as part of the RPA:\nFor the Year Ended September 30,\n2023 2022\nGross receivables sold\n$ 393,493 $ 424,789\nCash collections reinvested\n(388,283) (328,199)\nNet cash proceeds received $ 5,210 $ 96,590\nIn March 2023, the Company, through its U.K. subsidiary, entered into a non-recourse factoring arrangement. In connection with this arrangement, the Company periodically sells trade receivables to a third-party purchaser in exchange for cash. These transfers of financial assets are recorded at the time the Company surrenders control of the assets. As these transfers qualify as true sales under the applicable accounting guidance, the receivables are de-recognized from the Company's Consolidated Balance Sheets upon transfer. The principal amount of receivables sold under this arrangement was $55,159 during the fiscal year ended September 30, 2023. The discounts on the trade receivables sold are included within administrative expense in the Consolidated Statements of Income. The proceeds from the sale of receivables are classified as operating activities in the Company's Consolidated Statements of Cash Flows. As of September 30, 2023, the amount of factored receivables that remained outstanding was $18,045.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n9. DEBT AND FINANCING ARRANGEMENTS, (continued)\nThe Company, through certain of its European subsidiaries, has a credit facility with a European bank, which is guaranteed by Matthews. The maximum amount of borrowings available under this facility is €10.0 million ($10,576). The facility also provides €18.5 million ($19,566) for bank guarantees. This facility has no stated maturity date and is available until terminated. There were no outstanding borrowings under the credit facility at September 30, 2023. Outstanding borrowings under the credit facility totaled €8.2 million ($8,050) at September 30, 2022. The weighted-average interest rate on outstanding borrowings under this facility was 2.25% at September 30, 2022.\nOther borrowings totaled $19,241 and $13,434 at September 30, 2023 and 2022, respectively. The weighted-average interest rate on these borrowings was 2.95% and 1.85% at September 30, 2023 and 2022, respectively.\nAs of September 30, 2023 and 2022, the fair value of the Company's long-term debt, including current maturities, which is classified as Level 2 in the fair value hierarchy, approximated the carrying value included in the Consolidated Balance Sheets. The Company was in compliance with all of its debt covenants as of September 30, 2023.\nAggregate maturities by fiscal year of long-term debt, including other borrowings, is as follows:\n2024 $ 3,696\n2025 406,032\n2026 303,256\n2027 1,101\n2028 1,198\nThereafter 65,626\n780,909\nFinance lease obligations 9,271 (a)\n$ 790,180\n(a) Aggregate maturities of finance lease obligations can be found in Note 10, \"Leases.\"\n10. LEASES:\nThe Companys lease portfolio includes various contracts for real estate, vehicles, information technology and other equipment. The following table presents the balance sheet and lease classification for the Company's lease portfolio as of September 30, 2023 and 2022, respectively:\nBalance Sheet Classification Lease Classification 2023 2022\nNon-current assets:\nProperty, plant and equipment, net Finance $ 10,804 $ 10,727\nOperating lease right-of-use-assets Operating 71,629 71,974\nTotal lease assets $ 82,433 $ 82,701\nCurrent liabilities:\nLong-term debt, current maturities Finance $ 2,683 $ 2,284\nOther current liabilities Operating 23,983 22,869\nNon-current liabilities:\nLong-term debt Finance 6,588 4,782\nOperating lease liabilities Operating 50,189 51,445\nTotal lease liabilities $ 83,443 $ 81,380\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n10. LEASES, (continued)\nThe following table presents the components of lease cost for the years ended September 30, 2023, 2022 and 2021, respectively:\n2023 2022 2021\nFinance lease cost:\nAmortization of ROU assets $ 2,791 $ 3,816 $ 4,016\nInterest on lease liabilities 248 205 248\nOperating lease cost 21,546 21,675 21,716\nVariable lease cost 10,601 10,486 6,752\nSublease income (89) (279) (83)\nTotal lease cost $ 35,097 $ 35,903 $ 32,649\nSupplemental information regarding the Company's leases follows:\nFor the Year Ended September 30,\n2023 2022 2021\nCash paid for finance and operating lease liabilities:\nOperating cash flows from finance leases $ 259 $ 211 $ 255\nOperating cash flows from operating leases 27,194 27,648 28,246\nFinancing cash flows from finance leases 2,642 3,691 4,134\nROU assets obtained in exchange for new finance lease liabilities 4,745 1,516 3,687\nROU assets obtained in exchange for new operating lease liabilities 8,294 10,365 16,341\nSeptember 30,\n2023 2022 2021\nWeighted-average remaining lease term - finance leases (years) 4.47 4.28 3.85\nWeighted-average remaining lease term - operating leases (years) 3.52 3.62 3.82\nWeighted-discount rate - finance leases 4.48 % 3.08 % 2.70 %\nWeighted-discount rate - operating leases 3.47 % 2.45 % 2.28 %\nMaturities of lease obligations by fiscal year were as follows as of September 30, 2023:\nOperating Leases Finance Leases\n2024 $ 26,123 $ 3,034\n2025 20,619 2,145\n2026 16,027 1,695\n2027 8,381 1,293\n2028 4,788 877\nThereafter 3,475 1,263\nTotal future minimum lease payments 79,413 10,307\nLess: Interest 5,241 1,036\nPresent value of lease liabilities: $ 74,172 $ 9,271\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n11. DERIVATIVES AND HEDGING ACTIVITIES:\nThe Company operates internationally and utilizes certain derivative financial instruments to manage its foreign currency, debt and interest rate exposures. At September 30, 2023 and 2022, derivative instruments were reflected on a gross-basis in the consolidated balance sheets as follows:\nDerivatives: September 30, 2023 September 30, 2022\nInterest Rate Swaps Cross-Currency Swaps Interest Rate Swaps Cross-Currency Swaps\nCurrent assets:\nOther current assets $ 920 $ - $ 3,358 $ -\nLong-term assets:\nOther assets 3,086 - 7,341 3,722\nLong-term liabilities:\nOther liabilities - (2,766) - -\nTotal derivatives $ 4,006 $ (2,766) $ 10,699 $ 3,722\nThe following table presents information related to interest rate swaps entered into by the Company and designated as cash flow hedges:\nSeptember 30, 2023 September 30, 2022\nNotional amount $ 175,000 $ 125,000\nWeighted-average maturity period (years) 4.1 3.1\nWeighted-average received rate 5.32 % 3.14 %\nWeighted-average pay rate 3.83 % 1.04 %\nThe Company enters into interest rate swaps in order to achieve a mix of fixed and variable rate debt that it deems appropriate. In order to transition the Company's swaps from LIBOR-based to SOFR-based rates, the LIBOR-based swaps were settled during the second quarter of fiscal 2023, resulting in cash proceeds of $10,474. Concurrently, the Company entered into new interest rate swaps with SOFR-based rates with a notional amount of $175,000. The interest rate swaps have been designated as cash flow hedges of future variable interest payments which are considered probable of occurring. Based on the Company's assessment, all of the critical terms of each of the hedges matched the underlying terms of the hedged debt and related forecasted interest payments, and as such, these hedges were considered highly effective.\nThe fair value of the interest rate swaps reflected a net unrealized gain of $4,006 ($2,991 after tax) and $10,699 ($7,937 after tax) at September 30, 2023 and 2022, respectively, that is included in shareholders' equity as part of accumulated other comprehensive income (\"AOCI\"). Unrecognized gains of $8,084 ($6,041 after tax) related to the terminated LIBOR-based swaps were also included in AOCI as of September 30, 2023. Assuming market rates remain constant with the rates at September 30, 2023, a gain (net of tax) of approximately $3,850 included in AOCI is expected to be recognized in earnings over the next twelve months.\nThe Company has a U.S. Dollar/Euro cross currency swap with a notional amount of $81,392 as of September 30, 2023 and 2022, which has been designated as a net investment hedge of foreign operations. The swap contract matures in September 2027. The Company assesses hedge effectiveness for this contract based on changes in fair value attributable to changes in spot prices. A loss of $2,065 (net of income taxes of $701) and a gain of $2,782 (net of income taxes of $940), which represented effective hedges of net investments, were reported as a component of AOCI within currency translation adjustment at September 30, 2023 and 2022, respectively. Income of $1,159 and $1,645, which represented the recognized portion of the fair value of cross currency swaps excluded from the assessment of hedge effectiveness, was included in current period earnings as a component of interest expense for fiscal 2023 and fiscal 2022, respectively. At September 30, 2023 and 2022, the swap totaled $2,766 and $3,722, respectively, and was included in other accrued liabilities and other assets in the Consolidated Balance Sheets, respectively.\nThe Company previously used certain foreign currency debt instruments as net investment hedges of foreign operations. Currency losses of $5,370 (net of income taxes of $1,743), which represent effective hedges of net investments, were reported as a component of AOCI within currency translation adjustment at September 30, 2021.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n11. DERIVATIVES AND HEDGING ACTIVITIES, (continued)\nThe Company enters into certain derivative contracts in accordance with its risk management strategy that do not meet the criteria for hedge accounting but which have the economic impact of largely mitigating foreign currency exposure. Changes in the fair value of these economic hedges are recorded in current period earnings as a component of other income (deductions), net. During fiscal 2022, net gains from economic hedges (which largely offset losses from underlying foreign currency exposures) totaled $4,677. No such economic hedge contracts were outstanding as of September 30, 2023 or 2022.\nRefer to Note 16, \"Accumulated Other Comprehensive Income\" for further details regarding amounts recorded in AOCI and the Consolidated Statements of Income (Loss) related to derivatives.\n12. SHAREHOLDERS' EQUITY:\nThe authorized common stock of the Company consists of 70,000,000 shares of Class A Common Stock, $1.00 par value.\nThe Company has a stock repurchase program. The buy-back program is designed to increase shareholder value, enlarge the Company's holdings of its common stock, and add to earnings per share. Repurchased shares may be retained in treasury, utilized for acquisitions, or reissued to employees or other purchasers, subject to the restrictions set forth in the Company's Restated Articles of Incorporation. Under the current authorization, 1,195,013 shares remain available for repurchase as of September 30, 2023.\n13. SHARE-BASED PAYMENTS:\nThe Company maintains an equity incentive plan (as amended and restated, the \"2017 Equity Incentive Plan\") that provides for grants of stock options, restricted shares, restricted share units, stock-based performance units and certain other types of stock-based awards. Under the 2017 Equity Incentive Plan, which has a ten-year term from the date the Company's Board of Directors approved of the amendment and restatement of the 2017 Equity Incentive Plan, the maximum number of shares available for grants or awards is an aggregate of 3,450,000 (subject to adjustment upon certain events such as stock dividends or stock splits), following the amendment and restatement of the 2017 Equity Incentive Plan at the Company's 2022 Annual Shareholder Meeting. At September 30, 2023, 496,508 shares have been issued under the 2017 Equity Incentive Plan. 1,041,615 time-based restricted share units, 1,313,162 performance-based restricted share units, and 75,000 stock options have been granted under the 2017 Equity Incentive Plan. 1,803,697 of these share-based awards are outstanding as of September 30, 2023. The 2017 Equity Incentive Plan is administered by the Compensation Committee of the Board of Directors (the \"Committee\"). The number of shares issued under performance-based restricted share units may be up to 200% of the number of performance-based restricted share units, based on the satisfaction of specific criteria established by the plan administrator.\nFor the years ended September 30, 2023, 2022 and 2021, stock-based compensation cost totaled $17,308, $17,432 and $15,581, respectively. The associated future income tax benefit recognized was $3,821, $3,821 and $3,247 for the years ended September 30, 2023, 2022 and 2021, respectively.\nWith respect to the restricted share unit grants, units generally vest on the third anniversary of the grant date. The number of units that vest depend on certain time and performance thresholds. Such performance thresholds include adjusted earnings per share, return on invested capital, appreciation in the market value of the Company's Class A Common Stock, or other targets established by the Committee. Approximately 43% of the outstanding share units vest based on time, while the remaining vest based on pre-defined performance thresholds. The Company issues common stock from treasury shares once vested.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n13. SHARE-BASED PAYMENTS, (continued)\nThe transactions for restricted shares and restricted share units for the year ended September 30, 2023 were as follows:\nShares Weighted-\naverage\nGrant-date\nFair Value\nNon-vested at September 30, 2022 1,459,233 $ 33.78\nGranted 618,050 27.69\nVested (211,158) 34.94\nExpired or forfeited (137,428) 40.89\nNon-vested at September 30, 2023 1,728,697 $ 30.90\nDuring fiscal 2021, 75,000 stock options were granted under the 2017 Equity Incentive Plan. The option price for each stock option granted was $41.70, which was equal to the fair market value of the Company's Class A Common Stock on the date of grant. These options vest in one-third increments annually over three years from the grant date. Unvested stock options expire on the earlier of five years from the date of grant, or upon employment termination, retirement or death. The Company generally settles employee stock option exercises with treasury shares.\nAs of September 30, 2023, the total unrecognized compensation cost related to all unvested stock-based awards was $18,305 which is expected to be recognized over a weighted-average period of 1.9 years.\nThe fair value of certain restricted share units that are subject to performance conditions and the fair value of stock options are estimated on the date of grant using a binomial lattice valuation model. The following table indicates the assumptions used in estimating the fair value of certain stock-based awards granted during the year ended September 30, 2021.\nRestricted\nShare Units Stock\nOptions\nExpected volatility 42.9 % 41.9 %\nDividend yield 3.2 % 3.1 %\nAverage risk-free interest rate 0.2 % 0.5 %\nAverage expected term (years) 3.0 5.0\nThe risk-free interest rate is based on United States Treasury yields at the date of grant. The dividend yield is based on the most recent dividend payment and average stock price over the 12 months prior to the grant date. Expected volatilities are based on the historical volatility of the Company's stock price. The expected term for grants in the year ended September 30, 2021 represents an estimate of the average period of time for restricted share units and stock options to vest.\nThe Company maintains the Amended and Restated 2019 Director Fee Plan, the Amended and Restated 2014 Director Fee Plan and the 1994 Director Fee Plan (collectively, the \"Director Fee Plans\"). There will be no further fees or share-based awards granted under the Amended and Restated 2014 Director Fee Plan and the 1994 Director Fee Plan. Under the Amended and Restated 2019 Director Fee Plan, non-employee directors (except for the Chairman of the Board) each receive, as an annual retainer fee for fiscal 2023, either cash or shares of the Company's Class A Common Stock with a value equal to $90. The annual retainer fee for fiscal 2023 paid to the non-employee Chairman of the Board is $210. Where the annual retainer fee is provided in shares, each director may elect to be paid these shares on a current basis or have such shares credited to a deferred stock account as phantom stock, with such shares to be paid to the director subsequent to leaving the Board. The total number of shares of stock that have been authorized to be issued under the Amended and Restated 2019 Director Fee Plan or credited to a deferred stock compensation account for subsequent issuance is 300,000 shares of Common Stock (subject to adjustment upon certain events such as stock dividends or stock splits), following the amendment and restatement of the 2019 Director Fee Plan at the Company's 2023 Annual Shareholder Meeting. The value of deferred shares is recorded in other liabilities. A total of 45,218 shares and share units had been deferred under the Director Fee Plans at September 30, 2023. Additionally, non-employee directors each receive an annual stock-based grant (non-statutory stock options, stock appreciation rights and/or restricted shares or units) with a value of $140 for fiscal 2023. As of September 30, 2023, 336,127 restricted shares and restricted share units have been granted under the Director Fee Plans, 162,898 of which were issued under the 2019 Director Fee Plan. 60,057 restricted share units are unvested at September 30, 2023 under the Director Fee Plans.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n14. EARNINGS PER SHARE:\nThe information used to compute earnings (loss) per share attributable to Matthews' common shareholders was as follows:\n2023 2022 2021\nNet income (loss) attributable to Matthews shareholders $ 39,291 $ (99,774) $ 2,910\nWeighted-average shares outstanding (in thousands):\nBasic shares 30,795 31,367 31,696\nEffect of dilutive securities 494 - 291\nDiluted shares 31,289 31,367 31,987\nDividends declared per common share $ 0.92 $ 0.88 $ 0.86\nAnti-dilutive securities excluded from the dilutive calculation were insignificant for the fiscal years ended September 30, 2023 and 2021. During periods in which the Company incurs a net loss, diluted weighted-average shares outstanding are equal to basic weighted-average shares outstanding because the effect of all equity awards is anti-dilutive.\n15. PENSION AND OTHER POSTRETIREMENT PLANS:\nThe Company provides defined benefit pension and other postretirement plans to certain employees. Effective January 1, 2014, the Company's principal defined benefit retirement plan (\"DB Plan\") was closed to new participants. As of September 30, 2023 and 2022, all of the Company's defined benefit plans are unfunded.\nIn April 2021, the Committee approved resolutions to freeze all future benefit accruals for all participants in the Company's non-qualified Supplemental Retirement Plan (\"SERP\") and the defined benefit portion of the Officers Retirement Restoration Plan (ORRP), effective April 30, 2021. In August 2021, the Committee approved the termination of the SERP and the defined benefit portion of the ORRP. In September 2021, the Company notified SERP and ORRP participants of its intention to fully settle the obligations of the SERP and ORRP in early fiscal 2023.\nIn August 2021, the Company's Board of Directors approved the freeze of all future benefit accruals for the Company's DB Plan, effective September 30, 2021, and the planned termination of the DB Plan in early fiscal 2022. At such time, the Company notified all plan participants of the Company's intentions to terminate and fully settle the obligations of the DB Plan early in fiscal 2022.\nThe freezing of the DB Plan, SERP, and ORRP triggered curtailments, which resulted in the remeasurement of the projected benefit obligations and the immediate recognition of prior service costs in earnings in fiscal 2021, which were previously included within AOCI.\nIn the first quarter of fiscal 2022, the Company terminated its DB Plan and made plan contributions totaling $35,706 to fully fund the planned settlement of the DB Plan obligations. Also during the first quarter of fiscal 2022, lump sum distributions of $185,958 were made from the DB Plan to plan participants, and non-participating annuity contracts totaling $56,274 were purchased by the DB Plan for plan participants, resulting in the full settlement of the DB Plan obligations. The settlement of the DB Plan obligations resulted in the recognition of a non-cash charge of $30,856, which has been presented as a component of other income (deductions), net for the year ended September 30, 2022. This amount represents the immediate recognition of the remaining portion of the deferred AOCI balances related to the DB Plan.\nIn the first quarter of fiscal 2023, the Company made lump sum payments totaling $24,242 to fully settle the SERP and defined benefit portion of the ORRP obligations. The settlement of these plan obligations resulted in the recognition of a non-cash charge of $1,271, which has been presented as a component of other income (deductions), net for the year ended September 30, 2023. This amount represents the immediate recognition of the deferred AOCI balances related to the SERP and ORRP. During fiscal 2023, the remaining funds held in a rabbi trust associated with the SERP were transferred to the Company. Consequently, these amounts are no longer classified as restricted cash.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n15. PENSION AND OTHER POSTRETIREMENT PLANS, (continued)\nThe following provides a reconciliation of benefit obligations, plan assets and funded status of the plans as of the Company's actuarial valuation as of September 30, 2023 and 2022:\nPension Other Postretirement\n2023 2022 2023 2022\nChange in benefit obligation:\nBenefit obligation, beginning of year $ 36,609 $ 293,926 $ 12,813 $ 18,841\nAcquisitions (1)\n- 9,829 - -\nService cost 163 392 76 165\nInterest cost 497 1,127 644 411\nActuarial gain (512) (19,978) (641) (5,989)\nSettlement (24,242) (242,232) - -\nExchange loss (gain) 979 (3,093) - -\nBenefit payments (598) (3,362) (517) (615)\nBenefit obligation, end of year (2)\n12,896 36,609 12,375 12,813\nChange in plan assets:\nFair value, beginning of year - 208,344 - -\nActual return - 368 - -\nBenefit payments (598) (3,362) (517) (615)\nEmployer contributions 24,840 36,882 517 615\nSettlement (24,242) (242,232) - -\nFair value, end of year - - - -\nFunded status (12,896) (36,609) (12,375) (12,813)\nUnrecognized actuarial (gain) loss (1,518) 5,140 (5,906) (5,973)\nUnrecognized prior service (credit) cost - (4,815) (956) (1,320)\nNet amount recognized $ (14,414) $ (36,284) $ (19,237) $ (20,106)\nAmounts recognized in the consolidated balance sheet:\nCurrent liability $ (68) $ (24,172) $ (876) $ (830)\nNoncurrent benefit liability (12,828) (12,437) (11,499) (11,983)\nAccumulated other comprehensive (income) loss (1,518) 325 (6,862) (7,293)\nNet amount recognized $ (14,414) $ (36,284) $ (19,237) $ (20,106)\nAmounts recognized in accumulated\nother comprehensive (income) loss:\nNet actuarial (gain) loss $ (1,518) $ 5,140 $ (5,906) $ (5,973)\nPrior service (credit) cost - (4,815) (956) (1,320)\nNet amount recognized $ (1,518) $ 325 $ (6,862) $ (7,293)\n(1) Fiscal 2022 reflects benefit obligations assumed in connection with the acquisition of OLBRICH and R+S Automotive. For additional information, see Note 21.\n(2) Gains and losses related to changes in assumptions (e.g., discount rate, mortality, etc.), asset, salary and other experience, and curtailments impacted benefit obligations.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n15. PENSION AND OTHER POSTRETIREMENT PLANS, (continued)\nBased upon actuarial valuations performed as of September 30, 2023 and 2022, the accumulated benefit obligation for the Company's defined benefit pension plans was $12,896 and $36,609 at September 30, 2023 and 2022, respectively, and the projected benefit obligation for the Company's defined benefit pension plans was $12,896 and $36,609 at September 30, 2023 and 2022, respectively.\nNet periodic pension and other postretirement benefit cost for the plans included the following:\nPension Other Postretirement\n2023 2022 2021 2023 2022 2021\nService cost $ 163 $ 392 $ 7,919 $ 76 $ 165 $ 201\nInterest cost * 497 1,127 6,145 644 411 376\nExpected return on plan assets * - (1,040) (10,809) - - -\nAmortization:\nPrior service cost - (152) (127) (364) (364) (364)\nNet actuarial (gain) loss * (64) 469 9,769 (708) - -\nCurtailment gain * - - (220) - - -\nSpecial termination benefits * - - 315 - - -\nPrior-service cost write-offs * - - 261 - - -\nSettlement* 1,271 30,856 - - - -\nNet benefit cost $ 1,867 $ 31,652 $ 13,253 $ (352) $ 212 $ 213\n* Non-service components of pension and postretirement expense are included in other income (deductions), net.\nMatthews has elected to utilize a full yield curve approach in the estimation of the service and interest cost components of net periodic benefit cost by applying the specific spot rates along the yield curve used in the determination of the benefit obligation to the relevant projected cash flows.\nBenefit payments under the Company's DB Plan were made from plan assets, while benefit payments under the SERP were made from the Company's operating funds. Benefit payments under the Company's postretirement benefit plan are made from the Company's operating funds.\nContributions made in fiscal 2023 are as follows:\nContributions Pension Other Postretirement\nSupplemental retirement plan $ 23,469 $ -\nOther retirement plans 1,371 -\nOther postretirement plan - 517\nThe weighted-average assumptions in the following table represent the rates used to develop the actuarial present value of the projected benefit obligation for the year listed and also the net periodic benefit cost for the following year. The measurement date of annual actuarial valuations for the Company's pension and other postretirement benefit plans was September 30, for fiscal 2023, 2022 and 2021. The weighted-average assumptions for those plans were:\nPension\nOther Postretirement\n2023 2022 2021 2023 2022 2021\nDiscount rate 4.13 % 4.01 % 2.79 % 5.86 % 5.37 % 2.83 %\nReturn on plan assets - % - % 3.10 % - - -\nCompensation increase - % - % 3.50 % - - -\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n15. PENSION AND OTHER POSTRETIREMENT PLANS, (continued)\nIn October 2014, the Society of Actuaries' Retirement Plans Experience Committee (\"RPEC\") released new mortality tables known as RP-2014. Each year, RPEC releases an update to the mortality improvement assumption that was released with the RP 2014 tables. The Company considered the RPEC mortality and mortality improvement tables and performed a review of its own mortality history to assess the appropriateness of the RPEC tables for use in generating financial results. In October 2019, the Society of Actuaries released updated base mortality tables denoted PRI-2012, replacing the RP-2014 base tables. In fiscal years 2023, 2022 and 2021, the Company elected to value its pension and other postretirement benefit plan liabilities using the base PRI-2012 mortality table and a slightly modified fully generational mortality improvement assumption. The revised assumption uses the most recent RPEC Scale MP mortality improvement table for all years where the RPEC tables are based on finalized data, and the most recently published Social Security Administration Intermediate mortality improvement for subsequent years.\nBenefit payments expected to be paid are as follows:\nYears ending September 30: Pension Benefits Other Postretirement Benefits\n2024 $ 616 $ 876\n2025 623 896\n2026 628 910\n2027 637 893\n2028 650 893\n2029-2033 3,499 4,287\n$ 6,653 $ 8,755\nFor measurement purposes, a rate of increase of 7.0% in the per capita cost of health care benefits was assumed for 2024; the rate was assumed to decrease gradually to 4.0% for 2073 and remain at that level thereafter. Assumed health care cost trend rates have a significant effect on the amounts reported.\nThe Company sponsors defined contribution plans for hourly and salary employees. The expense associated with the contributions made to these plans was $13,297, $12,442, and $9,186 for the fiscal years ended September 30, 2023, 2022 and 2021, respectively. The Company also provides a non-qualified deferred compensation plan for certain executives that permits participants to defer an amount of income into the plan during each calendar year. The expense associated with the contributions made to this plan was $1,385 for the fiscal year ended September 30, 2023.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n16. ACCUMULATED OTHER COMPREHENSIVE INCOME:\nThe changes in AOCI by component, net of tax, for the years ended September 30, 2023, 2022, and 2021 were as follows:\nPostretirement Benefit Plans Currency Translation Adjustment Cash Flow Hedges Total\nAttributable to Matthews:\nBalance, September 30, 2020 $ (82,954) $ (151,881) $ (5,884) $ (240,719)\nOCI before reclassification 39,822 (3,322) 1,873 38,373\nAmounts reclassified from AOCI 7,202 (a)\n(48) (b)\n2,453 (b)\n9,607\nNet current-period OCI 47,024 (3,370) 4,326\n47,980\nBalance, September 30, 2021 $ (35,930) $ (155,251) $ (1,558)\n$ (192,739)\nOCI before reclassification 17,851 (46,817) 8,148\n(20,818)\nAmounts reclassified from AOCI 23,261 (a)\n(1,242) (b)\n1,347 (b)\n23,366\nNet current-period OCI 41,112 (48,059)\n9,495\n2,548\nBalance, September 30, 2022 $ 5,182\n$ (203,310)\n$ 7,937\n$ (190,191)\nOCI before reclassification 1,476\n13,979\n3,056\n18,511\nAmounts reclassified from AOCI 102 (a)\n(865) (b)\n(1,961) (b)\n(2,724)\nNet current-period OCI 1,578\n13,114\n1,095 15,787\nBalance, September 30, 2023 $ 6,760 $ (190,196)\n$ 9,032 $ (174,404)\nAttributable to noncontrolling interest:\nBalance, September 30, 2020 $ - $ 368 $ - $ 368\nOCI before reclassification - (127) - (127)\nNet current-period OCI - (127) - (127)\nBalance, September 30, 2021 $ - $ 241 $ - $ 241\nOCI before reclassification - 14 - 14\nNet current-period OCI - 14 - 14\nBalance, September 30, 2022 $ - $ 255 $ - $ 255\nOCI before reclassification - 11 - 11\nNet current-period OCI - 11 - 11\nBalance, September 30, 2023 $ - $ 266 $ - $ 266\n(a)Amounts were included in net periodic benefit cost for pension and other postretirement benefit plans (see Note 15).\n(b)Amounts were included in interest expense in the periods the hedged item affected earnings (see Note 11).\nAccumulated other comprehensive loss at September 30, 2023 and 2022 consisted of the following:\n2023 2022\nCumulative foreign currency translation $ (190,196) $ (203,310)\nFair value of cash flow hedges, net of tax of $1,015 and $2,762, respectively\n9,032 7,937\nMinimum pension liabilities, net of tax of $1,620 and $1,786, respectively\n6,760 5,182\n$ (174,404) $ (190,191)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n16. ACCUMULATED OTHER COMPREHENSIVE INCOME, (continued)\nReclassifications out of AOCI for the years ended September 30, 2023, 2022 and 2021 were as follows:\nDetails about AOCI Components\nSeptember 30, 2023 September 30, 2022 September 30, 2021 Affected line item in the Statement of Income\nPostretirement benefit plans\nPrior service (cost) credit (a)\n$ 364 $ 516 $ 491\nActuarial gains (losses) 772 (469) (9,769) Other income (deductions), net\nPrior service cost write-off - - (261) Other income (deductions), net\nSettlement losses (1,271) (30,856) - Other income (deductions), net\n(135) (30,809) (9,539) Income before income tax (b)\n33 7,548 2,337 Income taxes\n$ (102) $ (23,261) $ (7,202) Net income\nDerivatives\nCash flow hedges $ 2,626 $ (1,786) $ (3,249) Interest expense\nNet investment hedges 1,159 1,645 63 Interest expense\n3,785 (141) (3,186) Income before income tax (b)\n(959) 36 781 Income taxes\n$ 2,826 $ (105) $ (2,405) Net income\n(a)Prior service cost amounts are included in the computation of pension and other postretirement benefit expense, which is reported in both cost of goods sold and selling and administrative expenses. For additional information, see Note 15.\n(b)For pre-tax items, positive amounts represent income and negative amounts represent expense.\n17. INCOME TAXES:\nThe income tax provision (benefit) consisted of the following:\n2023 2022 2021\nCurrent:\nFederal $ 13,967 $ 13,481 $ (3,741)\nState 4,381 4,676 3,579\nForeign 5,052 10,414 2,379\n23,400 28,571 2,217\nDeferred:\nFederal (14,466) (24,239) 5,829\nState (1,887) (3,895) 169\nForeign (5,273) (4,828) (1,840)\n(21,626) (32,962) 4,158\nTotal $ 1,774 $ (4,391) $ 6,375\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n17. INCOME TAXES, (continued)\nThe reconciliation of the federal statutory tax rate to the consolidated effective tax rate was as follows:\n2023 2022 2021\nFederal statutory tax rate 21.0 % 21.0 % 21.0 %\nEffect of state income taxes, net of federal deduction 3.8 % 0.2 % 37.5 %\nForeign statutory taxes compared to federal statutory rate (0.7) % 1.6 % (18.6) %\nShare-based compensation 3.6 % (1.1) % 24.5 %\nTermination of SERP - % - % 28.6 %\nTax credits (7.0) % 1.2 % (26.6) %\nSale of SERP-related investments - % - % 23.8 %\nGoodwill write-down - % (11.2) % - %\nTax rate differential on net operating loss carryback - % - % (21.4) %\nNontaxable income (7.5) % 0.8 % (9.9) %\nUtilization of foreign losses with valuation allowance (5.6) % - % - %\nOther *\n(3.3) % (8.3) % 10.1 %\nEffective tax rate 4.3 % 4.2 % 69.0 %\n* In Fiscal 2022, \"Other\" primarily consists of foreign net operating losses that had a full valuation allowance.\nThe Company's consolidated income taxes for the year ended September 30, 2023 were an expense of $1,774, compared to a benefit of $4,391 for fiscal 2022, and an expense of $6,375 for fiscal 2021. The difference between the Company's consolidated income taxes for fiscal 2023 compared to fiscal 2022 partially resulted from fiscal 2023 having consolidated income before income taxes compared to fiscal 2022 having a consolidated loss before income taxes. The fiscal 2023 tax rate was negatively impacted by share-based compensation. Additionally, the fiscal 2023 tax rate benefited from research and development and foreign tax credits and the utilization of foreign tax net operating losses with a valuation allowance. The fiscal 2022 consolidated loss reflected a goodwill write-down recorded in the fourth quarter of fiscal 2022 that was primarily non-deductible. The fiscal 2022 effective tax rate also benefited from research and development and foreign tax credits. The fiscal 2022 effective tax rate was negatively impacted by foreign net operating losses requiring a full valuation allowance.\nThe difference between the Company's consolidated income taxes for fiscal 2022 compared to fiscal 2021 partially resulted from fiscal 2022 having a consolidated loss before income taxes compared to fiscal 2021 having consolidated income before income taxes. The fiscal 2022 consolidated loss reflected a goodwill write-down recorded in the fourth quarter of fiscal 2022 that was primarily non-deductible. The Companys fiscal 2021 effective tax rate benefited from research and development and foreign tax credits as well as the reduction of uncertain tax positions due to the expiration of the statute of limitations in certain jurisdictions, the completion of a state tax audit, and the tax benefit of the NOL carryback. The fiscal 2021 effective tax rate was negatively affected by the termination of the Companys SERP, which resulted in certain expenses that are nondeductible for tax purposes.\nThe Company's foreign subsidiaries had income before income taxes for the year ended September 30, 2023 of approximately $43,090, loss before income taxes for the year ended September 30, 2022 of approximately $47,653 and income before income taxes for the year ended September 30, 2021 of approximately $6,685. Deferred income taxes have not been provided on undistributed earnings of foreign subsidiaries since they have either been previously taxed, or are now exempt from tax, under the U.S. Tax Cuts and Jobs Act, or such earnings are considered to be reinvested indefinitely in foreign operations. At September 30, 2023, undistributed earnings of foreign subsidiaries for which deferred income taxes have not been provided approximated $368,306.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n17. INCOME TAXES, (continued)\nThe components of deferred tax assets and liabilities at September 30, 2023 and 2022 are as follows:\n2023 2022\nDeferred tax assets:\nPension and postretirement benefits $ 5,544 $ 9,051\nAccruals and reserves not currently deductible 11,158 10,909\nIncome tax credit carryforward 4,970 5,796\nOperating and capital loss carryforwards 59,956 54,875\nStock options 8,007 7,103\nResearch and development capitalization 11,028 -\nOther 3,016 50\nTotal deferred tax assets 103,679 87,784\nValuation allowances (22,506) (27,552)\nNet deferred tax assets 81,173 60,232\nDeferred tax liabilities:\nDepreciation (23,547) (27,317)\nUnrealized gains and losses (2,969) (2,793)\nGoodwill and intangible assets (97,415) (98,715)\nRevenue recognized over time (21,226) (10,847)\nOther (5,002) (9,539)\nTotal deferred tax liabilities (150,159) (149,211)\nNet deferred tax liability $ (68,986) $ (88,979)\nAt September 30, 2023, the Company had foreign net operating loss carryforwards of $292,206. The majority of the Company's foreign net operating losses have no expiration period. Certain of these carryforwards are subject to limitations on use due to tax rules affecting acquired tax attributes, loss sharing between group members, and business continuation. Therefore, the Company has established tax-effected valuation allowances against these tax benefits in the amount of $22,506 at September 30, 2023. The Company has recorded deferred tax assets of $2,756 for state net operating loss carryforwards, which will be available to offset future income tax liabilities.\nChanges in the total amount of gross unrecognized tax benefits (excluding penalties and interest) are as follows:\n2023 2022 2021\nBalance, beginning of year $ 4,123 $ 2,807 $ 10,483\nIncreases for tax positions of prior years 100 1,393 -\nDecreases for tax positions of prior years - (200) (288)\nIncreases based on tax positions related to the current year 769 551 628\nDecreases due to lapse of statute of limitation (1,213) (428) (8,016)\nBalance, end of year $ 3,779 $ 4,123 $ 2,807\nThe Company had unrecognized tax benefits of $3,779 at September 30, 2023, which would impact the annual effective tax rate. It is reasonably possible that the amount of unrecognized tax benefits could decrease by approximately $2,648 in the next 12 months primarily due to the completion of audits and the expiration of the statute of limitation related to specific tax positions.\nThe Company classifies interest and penalties on tax uncertainties as a component of the provision for income taxes. Total penalties and interest accrued were $730 and $876 at September 30, 2023 and 2022, respectively. These accruals may potentially be applicable in the event of an unfavorable outcome of uncertain tax positions.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n17. INCOME TAXES, (continued)\nThe Company is currently under examination in several tax jurisdictions and remains subject to examination until the statute of limitation expires for those tax jurisdictions.\nAs of September 30, 2023, the tax years that remain subject to examination by major jurisdiction generally are:\nUnited States - Federal 2020 and forward\nUnited States - State 2019 and forward\nCanada 2019 and forward\nGermany 2019 and forward\nUnited Kingdom 2022 and forward\nAustralia 2018 and forward\nSingapore 2019 and forward\n18. COMMITMENTS AND CONTINGENT LIABILITIES:\nThe Company is party to various legal proceedings, the eventual outcome of which are not predictable. Although the ultimate disposition of these proceedings is not presently determinable, management is of the opinion that they should not result in liabilities in an amount which would materially affect the Company's consolidated financial position, results of operations or cash flows.\nIn the normal course of business, the Company may provide certain customers with performance guarantees, and at times letters of credit or surety bonds. The terms of these agreements expire at various dates between fiscal 2024 and 2026. In general, the Company would only be liable for the amounts of these guarantees in the event that non-performance by the Company permits termination of the related contract by the Company's customer. The Company maintains it is in compliance with its performance obligations under all contracts for which there is a performance guarantee, and the ultimate liability, if any, incurred in connection with these guarantees will not have a material adverse effect on the Company's consolidated financial position, results of operations or cash flows.\nThe Company has employment agreements with certain employees, the terms of which expire at various dates between fiscal 2024 and 2027. The agreements generally provide for base salary and bonus levels and include non-compete provisions. The aggregate commitment for salaries under these agreements at September 30, 2023 was $5,838.\n19. SUPPLEMENTAL CASH FLOW INFORMATION:\nChanges in working capital items as presented in the Consolidated Statements of Cash Flows consisted of the following:\n2023 2022 2021\nCurrent assets:\nAccounts receivable $ 26,457 $ 74,013 $ (13,423)\nInventories (23,990) (23,459) (12,839)\nOther current assets (26,724) (15,770) (15,618)\n(24,257) 34,784 (41,880)\nCurrent liabilities:\nTrade accounts payable (9,215) 7,437 29,621\nAccrued compensation (648) (10,760) 10,791\nAccrued income taxes 3,343 5,745 601\nOther current liabilities (4,726) (7,616) 13,849\n(11,246) (5,194) 54,862\nNet change $ (35,503) $ 29,590 $ 12,982\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n20. SEGMENT INFORMATION:\nThe Company manages its businesses under three segments: Memorialization, Industrial Technologies and SGK Brand Solutions. The Memorialization segment consists primarily of bronze and granite memorials and other memorialization products, caskets, cremation-related products, and cremation and incineration equipment primarily for the cemetery and funeral home industries. The Industrial Technologies segment includes the design, manufacturing, service and distribution of high-tech custom energy storage solutions; product identification and warehouse automation technologies and solutions, including order fulfillment systems for identifying, tracking, picking and conveying consumer and industrial products; and coating and converting lines for the packaging, pharma, foil, décor and tissue industries. The SGK Brand Solutions segment consists of brand management, pre-media services, printing plates and cylinders, imaging services, digital asset management, merchandising display systems, and marketing and design services primarily for the consumer goods and retail industries.\nThe Company's primary measure of segment profitability is adjusted earnings before interest, income taxes, depreciation and amortization (\"adjusted EBITDA\"). Adjusted EBITDA is defined by the Company as earnings before interest, income taxes, depreciation, amortization and certain non-cash and/or non-recurring items that do not contribute directly to managements evaluation of its operating results. These items include stock-based compensation, the non-service portion of pension and postretirement expense, acquisition and divestiture costs, ERP integration costs, and strategic initiatives and other charges. This presentation is consistent with how the Company's chief operating decision maker (the CODM) evaluates the results of operations and makes strategic decisions about the business. For these reasons, the Company believes that adjusted EBITDA represents the most relevant measure of segment profit and loss.\nIn addition, the CODM manages and evaluates the operating performance of the segments, as described above, on a pre-corporate cost allocation basis. Accordingly, for segment reporting purposes, the Company does not allocate corporate costs to its reportable segments. Corporate costs include management and administrative support to the Company, which consists of certain aspects of the Companys executive management, legal, compliance, human resources, information technology (including operational support) and finance departments. These costs are included within \"Corporate and Non-Operating\" in the following table to reconcile to consolidated adjusted EBITDA and are not considered a separate reportable segment. Management does not allocate non-operating items such as investment income, other income (deductions), net and noncontrolling interest to the segments. The accounting policies of the segments are the same as those described in Note 2 \"Summary of Significant Accounting Policies\". Intersegment sales are accounted for at negotiated prices. Segment assets include those assets that are used in the Company's operations within each segment. Assets classified under \"Corporate and Non-Operating\" principally consist of cash and cash equivalents, investments, deferred income taxes and corporate headquarters' assets. Long-lived assets include property, plant and equipment (net of accumulated depreciation), goodwill, and other intangible assets (net of accumulated amortization).\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n20. SEGMENT INFORMATION, (continued)\nInformation about the Company's segments follows:\nMemorialization Industrial Technologies SGK Brand Solutions Corporate and Non-Operating Consolidated\nSales to external customers:\n2023 $ 842,997 $ 505,751 $ 532,148 $ - $ 1,880,896\n2022 840,124 335,523 586,756 - 1,762,403\n2021 769,016 284,495 617,519 - 1,671,030\nIntersegment sales:\n2023 - 1,829 1,073 - 2,902\n2022 - 1,057 1,295 - 2,352\n2021 - 2,146 2,376 - 4,522\nDepreciation and amortization:\n2023 23,738 23,184 44,842 4,766 96,530\n2022 23,228 11,387 64,173 5,268 104,056\n2021 23,043 11,427 93,665 5,377 133,512\nAdjusted EBITDA:\n2023 163,986 66,278 57,128 (61,583) 225,809\n2022 151,849 56,762 60,120 (58,323) 210,408\n2021 165,653 34,889 91,435 (64,227) 227,750\nTotal assets:\n2023 794,129 482,444 572,601 38,207 1,887,381\n2022 800,666 414,019 631,291 36,795 1,882,771\n2021 807,215 285,710 874,001 65,152 2,032,078\nCapital expenditures:\n2023 16,868 16,253 14,589 2,888 50,598\n2022 28,899 13,646 14,287 4,489 61,321\n2021 11,969 8,620 11,775 1,949 34,313\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n20. SEGMENT INFORMATION, (continued)\nA reconciliation of adjusted EBITDA to net income follows:\n2023 2022 2021\nTotal Adjusted EBITDA $ 225,809 $ 210,408 $ 227,750\nAcquisition and divestiture related items (1)**\n(5,293) (7,898) (541)\nStrategic initiatives and other charges (2)**\n(13,923) (28,060) (28,998)\nNon-recurring / incremental COVID-19 costs (3)***\n- (2,985) (5,312)\nHighly inflationary accounting losses (primarily non-cash) (4)\n(1,360) (1,473) -\nDefined benefit plan termination related items (5)\n- 429 -\nAsset write-downs, net (6)\n- (10,050) -\nGoodwill write-downs (7)\n- (82,454) -\nStock-based compensation (17,308) (17,432) (15,581)\nNon-service pension and postretirement expense (8)\n(1,640) (31,823) (5,837)\nDepreciation and amortization *\n(96,530) (104,056) (133,512)\nInterest expense, including RPA and factoring financing fees (9)\n(48,690) (28,771) (28,684)\nNet loss attributable to noncontrolling interests (155) (54) (52)\nIncome (loss) before income taxes 40,910 (104,219) 9,233\nIncome tax (provision) benefit (1,774) 4,391 (6,375)\nNet income (loss) $ 39,136 $ (99,828) $ 2,858\n(1) Includes certain non-recurring costs associated with recent acquisition and divestiture activity, and also includes a gain of $1,827 in fiscal year 2023 related to the divestiture of a business in the Industrial Technologies segment.\n(2) Includes certain non-recurring costs associated with productivity and cost-reduction initiatives intended to result in improved operating performance, profitability and working capital levels and costs associated with global ERP system integration efforts, net of loss recoveries of $2,154 in fiscal year 2023 related to a previously disclosed theft of funds by a former employee initially identified in fiscal 2015.\n(3) Includes certain non-recurring direct incremental costs (such as costs for purchases of computer peripherals and devices to facilitate working-from-home, additional personal protective equipment and cleaning supplies and services, etc.) incurred in response to COVID-19. This amount does not include the impact of any lost sales or underutilization due to COVID-19.\n(4) Represents exchange losses associated with highly inflationary accounting related to the Company's Turkish subsidiaries.\n(5) Represents items associated with the termination of the Company's DB Plan, supplemental retirement plan and the defined benefit portion of the officers retirement restoration plan.\n(6) Represents asset write-downs, net of recoveries within the SGK Brand Solutions segment (see Note 23, \"Asset Write-Downs\").\n(7) Represents goodwill write-downs within the SGK Brand Solutions segment (see Note 22, \"Goodwill and Other Intangible Assets\").\n(8) Non-service pension and postretirement expense includes interest cost, expected return on plan assets, amortization of actuarial gains and losses, curtailment gains and losses, and settlement gains and losses. These benefit cost components are excluded from adjusted EBITDA since they are primarily influenced by external market conditions that impact investment returns and interest (discount) rates. Curtailment gains and losses and settlement gains and losses are excluded from adjusted EBITDA since they generally result from certain non-recurring events, such as plan amendments to modify future benefits or settlements of plan obligations. The service cost and prior service cost components of pension and postretirement expense are included in the calculation of adjusted EBITDA, since they are considered to be a better reflection of the ongoing service-related costs of providing these benefits. Please note that GAAP pension and postretirement expense or the adjustment above are not necessarily indicative of the current or future cash flow requirements related to these employee benefit plans.\n(9) Includes fees for receivables sold under the RPA and factoring arrangements totaling $4,042 and $1,046 for the fiscal years ended September 30, 2023 and 2022, respectively.\n* Depreciation and amortization was $23,738, $23,228, and $23,043 for the Memorialization segment, $23,184, $11,387, and $11,427 for the Industrial Technologies segment, $44,842, $64,173, and $93,665 for the SGK Brand Solutions segment, and $4,766, $5,268, and $5,377 for Corporate and Non-Operating, for the fiscal years ended September 30, 2023, 2022, and 2021, respectively.\n** Acquisition and divestiture costs, ERP integration costs, and strategic initiatives and other charges were $1,002, $3,517, and $1,923 for the Memorialization segment, $4,108, $5,631, and $4,026 for the Industrial Technologies segment, $10,905, $19,359, and $12,323 for the SGK Brand Solutions segment, and $3,201, $7,451, and $11,267 for Corporate and Non-Operating, for the fiscal years ended September 30, 2023, 2022, and 2021, respectively.\n*** Non-recurring/incremental COVID-19 costs were $1,314, and $3,646 for the Memorialization segment, $6, and $38 for the Industrial Technologies segment, $1,199, and $1,539 for the SGK Brand Solutions segment, and $466, and $89 for Corporate and Non-Operating, for the fiscal years ended September 30, 2022, and 2021 respectively.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n20. SEGMENT INFORMATION, (continued)\nInformation about the Company's operations by geographic area follows:\nNorth America Central and South America Europe Australia Asia Consolidated\nSales to external customers:\n2023 $ 1,219,238 $ 5,260 $ 572,736 $ 19,913 $ 63,749 $ 1,880,896\n2022 1,230,267 4,729 444,606 21,206 61,595 1,762,403\n2021 1,141,396 5,036 446,274 23,568 54,756 1,671,030\nLong-lived assets:\n2023 806,182 11,690 255,748 14,099 41,194 1,128,913\n2022 822,566 10,787 242,614 14,895 42,778 1,133,640\n2021 890,545 14,226 277,655 21,012 55,598 1,259,036\n21. ACQUISITIONS AND DIVESTITURES:\nFiscal 2023:\nIn September 2023, the Company completed a small divestiture within the Industrial Technologies segment. Net proceeds from the divestiture totaled approximately $6,700, and the transaction resulted in a pre-tax gain of $1,827, which was recorded as a component of administrative expenses for the year ended September 30, 2023. The transaction also included $2,250 of contingent consideration, which represents the maximum amount the Company could potentially recognize at the resolution of the two-year contingency period.\nIn March 2023, the Company purchased the remaining ownership interest in a non-consolidated Industrial Technologies subsidiary for $4,759 (net of cash acquired and holdbacks). The preliminary purchase price allocation was not finalized as of September 30, 2023 and remains subject to change as the Company obtains additional information related to working capital and other assets and liabilities.\nIn February 2023, the Company acquired Eagle Granite Company (\"Eagle\") within the Memorialization segment for a total purchase price of $18,384, consisting of cash of $8,650 (net of cash acquired) and a deferred purchase price amount of $9,734, which is scheduled to be paid to the seller two years from the acquisition date. In addition, the Company recorded a liability of approximately $1,030 for potential future contingent consideration related to certain earnout provisions, which, if owed, is scheduled to be paid to the seller four years from the acquisition date. Eagle serves cemeteries and monument companies with a full complement of granite memorialization products. The Company finalized the allocation of the purchase price in the fourth quarter of fiscal 2023, resulting in an immaterial adjustment to certain working capital accounts.\nDuring the first fiscal quarter of 2023, the Company completed small acquisitions within the SGK Brand Solutions segment for a combined purchase price of $1,932 (net of cash acquired and holdbacks). The Company finalized the purchase price allocations in the fourth quarter of fiscal 2023, resulting in an immaterial adjustment to certain tax accounts.\nFiscal 2022:\nIn August 2022, the Company acquired German-based engineering firms OLBRICH and R+S Automotive for a purchase price of approximately €43,700 ($44,469) (net of cash acquired) within the Industrial Technologies segment. OLBRICH is a production and intelligent equipment manufacturer, specializing in purpose-built rotary processing equipment, including equipment used in the manufacturing of dry and wet electrodes for lithium-ion batteries used in electric vehicles and components for hydrogen fuel cells and electrolyzers, with additional strong positions in Specialty & Pharma, Packaging and Home & Décor. R+S Automotive is a specialty engineering services provider of automation, plant and tooling concepts for automotive manufacturing companies around the world. Annual sales for these businesses were approximately $140,000 prior to the acquisition. The Company finalized the allocation of the purchase price in the fourth quarter of fiscal 2023, resulting in an immaterial adjustment to certain working capital, tax, and other accounts.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n21. ACQUISITIONS AND DIVESTITURES, (continued)\nFiscal 2021:\nIn April 2021, the Company completed a small acquisition in the hydrogen fuel cell industry within the Industrial Technologies segment for a purchase price of $2,523 (net of cash acquired and holdback amounts). The Company finalized the allocation of the purchase price in the first quarter of fiscal 2022, resulting in an immaterial adjustment to certain working capital accounts.\nIn January 2021, the Company acquired a memorialization business that produces and distributes cemetery products for a purchase price of $13,100. The Company finalized the allocation of the purchase price in the fourth quarter of fiscal 2021, resulting in an immaterial adjustment to certain working capital accounts.\n22. GOODWILL AND OTHER INTANGIBLE ASSETS:\nChanges to goodwill during the years ended September 30, 2023 and 2022, follow.\nMemorialization Industrial Technologies SGK Brand Solutions Consolidated\nNet goodwill at September 30, 2021 $ 366,360 $ 92,577 $ 314,850 $ 773,787\nAdditions during period - 17,013 - 17,013\nTranslation and other adjustments (4,578) (2,568) (25,779) (32,925)\nGoodwill write-down - - (82,454) (82,454)\nNet goodwill at September 30, 2022 361,782 107,022 206,617 675,421\nAdditions during period 2,322 6,757 2,100 11,179\nDivestiture during period - (2,525) - (2,525)\nTranslation and other adjustments 1,911 3,819 8,304 14,034\nNet goodwill at September 30, 2023 $ 366,015 $ 115,073 $ 217,021 $ 698,109\nThe net goodwill balances at September 30, 2023 and 2022 included $261,186 of accumulated impairment losses. Accumulated impairment losses at September 30, 2023 and 2022 were $5,000, $23,946, and $232,240 for the Memorialization, Industrial Technologies and SGK Brand Solutions segments, respectively.\nFiscal 2023:\nIn fiscal 2023, the additions reflect the acquisition of Eagle Granite Company within the Memorialization segment, the purchase of the remaining ownership interest in an Industrial Technologies subsidiary, and small acquisitions within the SGK Brand Solutions segment.\nThe Company performed its annual impairment review of goodwill and indefinite-lived intangible assets in the second quarter of fiscal 2023 (January 1, 2023) and determined that the estimated fair values for all goodwill reporting units exceeded their carrying values, therefore no impairment charges were necessary. The estimated fair value of the Company's SGK Brand Solutions reporting unit exceeded the carrying value (expressed as a percentage of carrying value) by approximately 9% as of January 1, 2023. In light of the limited excess fair value over carrying value and further declines experienced by the SGK Brand Solutions reporting unit, management determined that a triggering event occurred during the fourth quarter of fiscal 2023, resulting in an interim assessment of goodwill for the reporting unit, as of September 1, 2023. The results of this review indicated that the estimated fair value of the Company's SGK Brand Solutions reporting unit exceeded the carrying value (expressed as a percentage of carrying value) by approximately 4%. The fair value for the reporting unit was determined using level 3 inputs (including estimates of revenue growth, EBITDA contribution and the discount rates) and a combination of the income approach using the estimated discounted cash flows and a market-based valuation methodology. If current projections are not achieved or specific valuation factors outside the Company's control (such as discount rates and continued economic and industry challenges) significantly change, additional goodwill write-downs may be necessary in future periods.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS (continued)\n(Dollar amounts in thousands, except per share data)\n22. GOODWILL AND OTHER INTANGIBLE ASSETS, (continued)\nFiscal 2022:\nIn fiscal 2022, the additions to Industrial Technologies goodwill reflects the acquisition of OLBRICH and R+S Automotive.\nIn fiscal 2022, in its assessment of the potential impacts of weakened economic conditions (particularly in Europe), increases in the cost of certain materials, labor, and other inflation-related pressures, and unfavorable changes in foreign exchange rates on the estimated future earnings and cash flows for the SGK Brand Solutions reporting unit, and in light of the limited excess fair value over carrying value for this reporting unit, management determined a triggering event occurred, resulting in a re-evaluation of goodwill for the reporting unit, as of September 1, 2022. As a result of this interim assessment, the Company recorded a goodwill write-down totaling $82,454 during the fiscal 2022 fourth quarter. Subsequent to this write-down, the fair value of the SGK Brand Solutions reporting unit approximated its carrying value at September 1, 2022. The fair value for the reporting unit was determined using level 3 inputs (including estimates of revenue growth, EBITDA contribution and the discount rates) and a combination of the income approach using the estimated discounted cash flows and a market-based valuation methodology.\nThe following tables summarize the carrying amounts and related accumulated amortization for intangible assets as of September 30, 2023 and 2022, respectively.\nCarrying\nAmount Accumulated\nAmortization Net\nSeptember 30, 2023\nIndefinite-lived trade names $ 30,540 $ - $ 30,540\nDefinite-lived trade names 151,185 (122,474) 28,711\nCustomer relationships 378,161 (280,910) 97,251\nCopyrights/patents/other 19,375 (15,399) 3,976\n$ 579,261 $ (418,783) $ 160,478\nSeptember 30, 2022\nIndefinite-lived trade names $ 30,540 $ - $ 30,540\nDefinite-lived trade names 150,528 (117,572) 32,956\nCustomer relationships 380,593 (248,464) 132,129\nCopyrights/patents/other 20,878 (14,349) 6,529\n$ 582,539 $ (380,385) $ 202,154\nThe net change in intangible assets during fiscal 2023 included the impact of foreign currency fluctuations during the period, additional amortization, additions related to the Eagle acquisition, and disposals related to a small divestiture within the Industrial Technologies segment.\nAmortization expense on intangible assets was $42,068, $57,084, and $84,233 in fiscal 2023, 2022 and 2021, respectively. Fiscal year amortization expense is estimated to be approximately $35,380 in 2024, $20,394 in 2025, $14,158 in 2026, $13,081 in 2027 and $11,030 in 2028.\n23. ASSET WRITE-DOWNS:\nThe Company has certain operations in Russia within its SGK Brand Solutions segment. During fiscal 2022, in light of the war between Russia and Ukraine, and the resulting regional instability and evolving political and economic conditions within the region, the Company evaluated certain of its assets for recoverability and impairment. As a result of this assessment, and due to the uncertainty in projecting future cash flows for the Company's operations in Russia, the Company recorded asset write-downs totaling $10,050 (net of recoveries) during fiscal 2022 to reduce the carrying value of these assets to zero. Asset write-downs (primarily related to property, plant and equipment) totaling $9,686 and $364 were reported within cost of sales and administrative expense, respectively, for the year ended September 30, 2022.\nFINANCIAL STATEMENT SCHEDULE\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS\nAdditions\nDescription Balance at Beginning of Period Charged to Expense Charged to other Accounts Deductions (1)\nBalance at End of Period\n(Dollar amounts in thousands)\nAllowance for Doubtful Accounts:\nFiscal Year Ended:\nSeptember 30, 2023 $ 10,138 $ 1,625 $ - $ (979) $ 10,784\nSeptember 30, 2022 10,654 1,368 - (1,884) 10,138\nSeptember 30, 2021 9,618 2,182 - (1,146) 10,654\n(1)Amounts determined not to be collectible (including direct write-offs), net of recoveries.\nDescription Balance at Beginning of Period Provision (Credited) Charged To Expense (1, 3)\nAllowance Changes Other (Deductions) Additions (2)\nBalance at End of Period\n(Dollar amounts in thousands)\nDeferred Tax Asset Valuation Allowance:\nFiscal Year Ended:\nSeptember 30, 2023 $ 27,552 $ (4,709) $ - $ (337) $ 22,506\nSeptember 30, 2022 28,619 (1,300) - 233 27,552\nSeptember 30, 2021 22,527 5,709 - 383 28,619\n(1)Amounts relate primarily to adjustments in net operating loss carryforwards which are precluded from use.\n(2)Consists principally of adjustments related to foreign exchange.\n(3)Fiscal 2022 amount is comprised of a $5,004 benefit related to non-survivability of deferred tax assets with full valuation allowance due to entity dissolution and a $3,704 expense primarily related to adjustments in net operating loss carryforwards which are precluded from use. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\n(a) Evaluation of Disclosure Controls and Procedures.\nThe Company's disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\")) are designed to provide reasonable assurance that information required to be disclosed in the Company's reports filed under the Exchange Act, such as this Annual Report on Form 10-K, are recorded, processed, summarized and reported within the time periods specified in the rules of the Securities and Exchange Commission (\"SEC\"). These disclosure controls and procedures also are designed to provide reasonable assurance that such information is accumulated and communicated to management, including the Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosures.\nManagement, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the Company's disclosure controls and procedures in effect as of September 30, 2023. Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that, as of September 30, 2023, the Company's disclosure controls and procedures were effective to provide reasonable assurance that material information is accumulated and communicated to management, including the Chief Executive Officer and Chief Financial Officer, and that such information is recorded, processed, summarized and properly reported within the appropriate time period, relating to the Company and its consolidated subsidiaries, required to be included in the Exchange Act reports, including this Annual Report on Form 10-K.\n(b) Management's Report on Internal Control over Financial Reporting.\nManagement's Report on Internal Control over Financial Reporting is included in Management's Report to Shareholders in Item 8 of this Annual Report on Form 10-K.\n(c) Report of Independent Registered Public Accounting Firm.\nThe Company's internal control over financial reporting as of September 30, 2023 has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which is included in Item 8 of this Annual Report on Form 10-K.\n(d) Changes in Internal Control over Financial Reporting.\nThere have been no changes in the Company's internal controls over financial reporting that occurred during the fourth fiscal quarter ended September 30, 2023 that have materially affected, or are reasonably likely to materially affect, the Company's internal controls over financial reporting. ITEM 9B. OTHER INFORMATION.\n(a)\nNone.\n(b) Securities Trading Plans of Directors and Executive Officers.\nNone of the Companys directors or officers adopted or terminated any Rule 10b5-1 trading arrangement or any non-Rule 10b5-1 trading arrangement during the Companys fiscal quarter ended September 30, 2023. In addition, the Company did not adopt or terminate any Rule 10b5-1 trading arrangement during the Companys fiscal quarter ended September 30, 2023.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nIn addition to the information reported in Part I of this Annual Report on Form 10-K, under the caption \"Officers and Executive Management of the Registrant,\" the information required by this item as to the directors of the Company is hereby incorporated by reference from the information appearing under the captions \"General Information Regarding Corporate Governance - Audit Committee,\" \"Proposal No. 1 - Elections of Directors\" and \"Delinquent Section 16(a) Reports\" (if applicable) in the Company's definitive proxy statement, which involves the election of the directors and is to be filed with the Securities and Exchange Commission (the \"SEC\") pursuant to the Exchange Act, within 120 days of the end of the Company's fiscal year ended September 30, 2023.\nThe Company's Code of Ethics Applicable to Executive Management is set forth in Exhibit 14.1 hereto. Any amendment to the Company's Code of Ethics or waiver of the Company's Code of Ethics for senior financial officers, executive officers or directors will be posted on the Company's website within four business days following the date of the amendment or waiver, and such information will remain available on the website for at least a twelve-month period. ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this item as to the compensation of directors and executive management of the Company is hereby incorporated by reference from the information appearing under the captions \"Compensation of Directors\" and \"Executive Compensation and Retirement Benefits\" in the Company's definitive proxy statement which involves the election of directors and is to be filed with the SEC pursuant to the Exchange Act, within 120 days of the end of the Company's fiscal year ended September 30, 2023. The information contained in the \"Compensation Committee Report\" is specifically not incorporated herein by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT.\nThe information required by this item as to the ownership by management and others of securities of the Company is hereby incorporated by reference from the information appearing under the caption \"Stock Ownership\" in the Company's definitive proxy statement, which involves the election of directors and is to be filed with the SEC pursuant to the Exchange Act, within 120 days of the end of the Company's fiscal year ended September 30, 2023.\nEquity Compensation Plans:\nThe Company maintains an equity incentive plan (as amended and restated, the \"2017 Equity Incentive Plan\") that provides for grants of stock options, restricted shares, restricted share units, stock-based performance units and certain other types of stock-based awards. The Company also maintains equity incentive plans (the \"2012 Equity Incentive Plan\" and \"2007 Equity Incentive Plan\") and a stock incentive plan (the \"1992 Incentive Stock Plan\") that previously provided for grants of stock options, restricted shares, stock-based performance units and certain other types of stock-based awards. Under the 2017 Equity Incentive Plan, which has a ten-year term from the date the Company's Board of Directors approved of the amendment and restatement of the 2017 Equity Incentive Plan, the maximum number of shares available for grants or awards is an aggregate of 3,450,000 (subject to adjustment upon certain events such as stock dividends or stock splits), following the amendment and restatement of the 2017 Equity Incentive Plan at the Company's 2022 Annual Shareholder Meeting. There will be no further grants under the 2012 Equity Incentive Plan, the 2007 Equity Incentive Plan, or the 1992 Incentive Stock Plan. At September 30, 2023, 496,508 shares have been issued under the 2017 Equity Incentive Plan. 1,041,615 time-based restricted share units, 1,313,162 performance-based restricted share units, and 75,000 stock options have been granted under the 2017 Equity Incentive Plan. 1,803,697 of these share-based awards are outstanding as of September 30, 2023. All plans are administered by the Compensation Committee of the Board of Directors. The number of shares issued under performance-based restricted share units may be up to 200% of the number of performance-based restricted share units, based on the satisfaction of specific criteria established by the plan administrator.\nWith respect to the restricted share unit grants, units generally vest on the third anniversary of the grant date. The number of units that vest depend on certain time and performance thresholds. Such performance thresholds include adjusted earnings per share, return on invested capital, appreciation in the market value of the Company's Class A Common Stock, or other targets established by the Compensation Committee of the Board of Directors. Approximately 43% of the outstanding share units vest based on time, while the remaining vest based on pre-defined performance thresholds. The Company issues common stock from treasury shares once vested.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT, continued\nWith respect to outstanding stock option grants, options vest in one-third increments annually over three years from the grant date. Unvested stock options expire on the earlier of five years from the date of grant, or upon employment termination, retirement or death. The Company generally settles employee stock option exercises with treasury shares.\nThe Company maintains the Amended and Restated 2019 Director Fee Plan, the Amended and Restated 2014 Director Fee Plan and the 1994 Director Fee Plan (collectively, the \"Director Fee Plans\"). There will be no further fees or share-based awards granted under the Amended and Restated 2014 Director Fee Plan and the 1994 Director Fee Plan. Under the Amended and Restated 2019 Director Fee Plan, non-employee directors (except for the Chairman of the Board) each receive, as an annual retainer fee for fiscal 2023, either cash or shares of the Company's Class A Common Stock with a value equal to $90,000. The annual retainer fee for fiscal 2023 paid to the non-employee Chairman of the Board is $210,000. Where the annual retainer fee is provided in shares, each director may elect to be paid these shares on a current basis or have such shares credited to a deferred stock account as phantom stock, with such shares to be paid to the director subsequent to leaving the Board. The total number of shares of stock that have been authorized to be issued under the Amended and Restated 2019 Director Fee Plan or credited to a deferred stock compensation account for subsequent issuance is 300,000 shares of Common Stock (subject to adjustment upon certain events such as stock dividends or stock splits), following the amendment and restatement of the 2019 Director Fee Plans at the Company's 2023 Annual Shareholder Meeting. The value of deferred shares is recorded in other liabilities. A total of 45,218 shares and share units had been deferred under the Director Fee Plans at September 30, 2023. Additionally, non-employee directors each receive an annual stock-based grant (non-statutory stock options, stock appreciation rights and/or restricted shares or units) with a value of $140,000 for fiscal 2023. As of September 30, 2023, 336,127 restricted shares and restricted share units have been granted under the Director Fee Plans, 162,898 of which were issued under the 2019 Director Fee Plan. 60,057 restricted share units are unvested at September 30, 2023 under the Director Fee Plans.\nThe following table provides information about grants under the Company's equity compensation plans as of September 30, 2023:\nEquity Compensation Plan Information\nPlan category Number of securities\nto be issued upon\nexercise of\noutstanding options,\nwarrants and rights Weighted-average\nexercise price\nof outstanding\noptions, warrants\nand rights Number of securities\nremaining available\nfor future issuance\nunder equity\ncompensation plans\n(excluding\nsecurities reflected\nin column (a))\n(a) (b) (c)\nEquity compensation plans approved by security holders 120,218 (1)\n$ 41.70 (2)\n4,548,853 (3)\nEquity compensation plans not approved by security holders None None None\nTotal 120,218 $ 41.70 4,548,853\n(1) Includes (1) deferred awards under Director Fee Plans; and (2) outstanding stock options.\n(2) Weighted-average exercise price of outstanding stock options included in column (a).\n(3) Includes (1) shares reserved under the 2017 Equity Incentive Plan, which provides for the grant or award of stock options, restricted shares, stock-based performance units and certain other types of stock based awards; (2) shares reserved under the 2019 Amended and Restated Director Fee Plan, which provides for the grant, award or deferral of stock options, restricted shares, stock-based performance units and certain other types of stock based awards and compensation; and (3) the shares purchased under the Employee Stock Purchase Plan which are purchased in the open market by employees at the fair market value of the Company's stock. The Company provides a matching contribution of 10% of such purchases subject to certain limitations under the Employee Stock Purchase Plan. As the Employee Stock Purchase Plan is an open market purchase plan, it does not have a dilutive effect. ITEM 13. CERTAIN RELATIONSHIPS, RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe information required by this item as to certain relationships and transactions with management and other related parties of the Company is hereby incorporated by reference from the information appearing under the captions \"Proposal No. 1 - Election of Directors\" and \"Certain Transactions with Related Persons\" in the Company's definitive proxy statement, which involves the election of directors and is to be filed with the SEC pursuant to the Exchange Act, within 120 days of the end of the Company's fiscal year ended September 30, 2023. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required by this item as to the fees billed and the services provided by the principal accounting firm of the Company is hereby incorporated by reference from the information appearing under the caption \"Relationship with Independent Registered Public Accounting Firm\" in the Company's definitive proxy statement, which involves the election of directors and is to be filed with the SEC pursuant to the Exchange Act within 120 days of the end of the Company's fiscal year ended September 30, 2023.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES, AND REPORTS ON FORM 8-K.\n(a) 1. Financial Statements:\nThe following items are included in Part II, Item 8:\nPages\nManagement's Report to Shareholders 36\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42) 37\nReport of Independent Registered Public Accounting Firm 38\nConsolidated Balance Sheets as of September 30, 2023 and 2022 40\nConsolidated Statements of Income (Loss) for the years ended September 30, 2023, 2022 and 2021 42\nConsolidated Statements of Comprehensive Income (Loss) for the years ended September 30, 2023, 2022 and 2021 43\nConsolidated Statements of Shareholders' Equity for the years ended September 30, 2023, 2022 and 2021 44\nConsolidated Statements of Cash Flows for the years ended September 30, 2023, 2022 and 2021 45\nNotes to Consolidated Financial Statements 46\n2. Financial Statement Schedules:\nThe following item is included in Part II, Item 8:\nSchedule II - Valuation and Qualifying Accounts 75\n3. Exhibits Filed:\nExhibits Index 82\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nEXHIBITS INDEX\nThe following Exhibits to this report are filed herewith or, if marked with an asterisk (*), are incorporated by reference. Exhibits marked with an \"a\" represent a management contract or compensatory plan, contract or arrangement required to be filed by Item 601(b)(10)(iii) of Regulation S-K.\nExhibit No. Description Prior Filing or Sequential Page Numbers Herein\n3.1 Restated Articles of Incorporation* Exhibit Number 3.1 to the Annual Report on Form 10-K for the year ended September 30, 1994\n3.2 Amended and Restated By-laws of Matthews International Corporation\nFiled Herewith\n4.1 Form of Share Certificate for Class A Common Stock* Exhibit Number 4.9 to the Annual Report on Form 10-K for the year ended September 30, 1994\n4.2 Indenture, dated as of December 6, 2017, by and among Matthews, the Guarantors, and the Bank of New York Mellon Trust Company, as trustee*\nExhibit Number 4.1 to the Current Report on Form 8-K filed on December 7, 2017\n4.3 5.25% Senior Notes due December 1, 2025*\nExhibit Number 4.2 to the Current Report on Form 8-K filed on December 7, 2017\n4.4 Description of Securities\nFiled Herewith\n10.1 Shareholder's Agreement, dated as of March 16, 2014, by and among Matthews International Corporation, the Shareholders named therein and David A. Schawk, in his capacity as the Family Representative*\nExhibit Number 10.2 to the Current Report on Form 8-K filed on March 19, 2014\n10.2 a Form of Schawk Family Share Purchase Agreement*\nExhibit Number 10.1 to the Current Report on Form 8-K filed on May 16, 2016\n10.3 a Supplemental Retirement Plan (as amended through April 23, 2009)*\nExhibit Number 10.5 to the Annual Report on Form 10-K for the year ended September 30, 2010\n10.4 a Amendment to the Supplemental Retirement Plan\nExhibit Number 10.4 to the Annual Report on Form 10-K for the year ended September 30, 2021\n10.5 a Officers Retirement Restoration Plan (effective\nApril 23, 2009)*\nExhibit Number 10.6 to the Annual Report on Form 10-K for the year ended September 30, 2009\n10.6 a Amendment to the Officers Retirement Restoration Plan\nExhibit Number 10.6 to the Annual Report on Form 10-K for the year ended September 30, 2021\n10.7 a 1994 Director Fee Plan (as amended through\nApril 22, 2010)*\nExhibit Number 10.7 to the Annual Report on Form 10-K for the year ended September 30, 2013\n10.8 a Amended and Restated 2014 Director Fee Plan*\nExhibit Number 10.1 to the Quarterly Report on Form 10-Q for the quarter ended March 31, 2017\n10.9 a 1994 Employee Stock Purchase Plan*\nExhibit Number 10.2 to the Quarterly Report on Form 10-Q for the quarter ended March 31, 1995\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nEXHIBITS INDEX, Continued\nExhibit No. Description Prior Filing or Sequential Page Numbers Herein\n10.10 a 2012 Equity Incentive Plan*\nExhibit A to the Definitive Proxy Statement on Schedule 14A filed on January 22, 2013\n10.11 a 2015 Incentive Compensation Plan*\nExhibit A to the Definitive Proxy Statement on Schedule 14A filed on January 19, 2016\n10.12 a Amended and Restated 2017 Equity Incentive Plan*\nExhibit Number 99.1 to the Registration Statement on Form S-8 filed on April 29, 2022\n10.13 a Form of Restricted Stock Unit Agreement under the 2017 Equity Incentive Plan*\nExhibit Number 99.2 to the Registration Statement on Form S-8 filed on May 3, 2019\n10.14 a Matthews International Corporation Amended and Restated 2019 Director Fee Plan*\nExhibit Number 10.1 to the Current Report on Form 8-K filed on February 17, 2023\n10.15 a Form of Restricted Stock Unit Agreement under the 2019 Director Fee Plan*\nExhibit Number 99.4 to the Registration Statement on Form S-8 filed on May 3, 2019\n10.16 a Form of Change in Control Agreement*\nExhibit Number 10.1 to Current Report on Form 8-K filed on October 3, 2019\n10.17 Third Amended and Restated Loan Agreement*\nExhibit Number 10.1 to the Current Report on Form 8-K filed on March 30, 2020\n10.18 First Amendment to Third Amended and Restated Loan Agreement*\nExhibit Number 10.1 to the Quarterly Report on Form 10-Q filed on April 30, 2021\n10.19 Second Amendment to Third Amended and Restated Loan Agreement*\nExhibit Number 10.1 to the Quarterly Report on Form 10-Q filed on July 29, 2022\n10.20 Third Amendment to Third Amended and Restated Loan Agreement*\nExhibit Number 10.20 to the Annual Report on Form 10-K for the year ended September 30, 2022\n10.21 Agreement, dated as of December 30, 2022, by and among Matthews International Corporation, Barington Companies Equity Partners, L.P., Barington Capital Group, L.P. and Barington Companies Management, LLC*\nExhibit Number 10.1 to the Current Report on Form 8-K filed on December 30, 2022\n10.22 a Matthews International Corporation Management Deferred Compensation Plan*\nExhibit Number 10.1 to the Quarterly Report on Form 10-Q filed on January 27, 2023\n10.23 Fourth Amendment to Third Amended and Restated Loan Agreement*\nExhibit Number 10.2 to the Quarterly Report on Form 10-Q filed on April 28, 2023\n14.1 Form of Code of Ethics Applicable to Executive Management*\nExhibit Number 14.1 to the Annual Report on Form 10-K for the year ended September 30, 2004\n21 Subsidiaries of the Registrant\nFiled Herewith\nMATTHEWS INTERNATIONAL CORPORATION AND SUBSIDIARIES\nEXHIBITS INDEX, Continued\nExhibit No. Description Prior Filing or Sequential Page Numbers Herein\n23.1 Consent of Independent Registered Public Accounting Firm\nFiled Herewith\n31.1 Certification of Principal Executive Officer for Joseph C. Bartolacci\nFiled Herewith\n31.2 Certification of Principal Financial Officer for Steven F. Nicola\nFiled Herewith\n32.1 Certification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, of Joseph C. Bartolacci\nFurnished Herewith\n32.2 Certification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, of Steven F. Nicola\nFurnished Herewith\n97 Matthews International Corporation Clawback Policy\nFiled Herewith\n101.INS XBRL Instance Document- the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document Filed Herewith\n101.SCH XBRL Taxonomy Extension Schema Filed Herewith\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Filed Herewith\n101.DEF XBRL Taxonomy Extension Definition Linkbase Filed Herewith\n101.LAB XBRL Taxonomy Extension Label Linkbase Filed Herewith\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Filed Herewith\n104. Cover Page Interactive Data File (Embedded within the Inline XBRL document and included in Exhibit 101) Filed Herewith\nCopies of any Exhibits will be furnished to shareholders upon written request. Requests should be directed to Mr. Steven F. Nicola, Chief Financial Officer and Secretary of the Registrant.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on November 17, 2023.\nMATTHEWS INTERNATIONAL CORPORATION\n(Registrant)\nBy /s/ Joseph C. Bartolacci\nJoseph C. Bartolacci\nPresident and Chief Executive Officer\nEach person whose individual signature appears below hereby authorizes and appoints Joseph C. Bartolacci, Steven F. Nicola and Brian D. Walters, and each of them, with full power of substitution and resubstitution and full power to act without the other, as his or her true and lawful attorney-in-fact and agent to act in his or her name, place and stead and to execute in the name and on behalf of each person, individually and in each capacity stated below, and to file any and all amendments to this annual report on Form 10-K and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing, ratifying and confirming all that said attorneys-in-fact and agents or any of them or their or his or her substitute or substitutes may lawfully do or cause to be done by virtue thereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities indicated on November 17, 2023:\n/s/ Joseph C. Bartolacci /s/ Steven F. Nicola\nJoseph C. Bartolacci Steven F. Nicola\nPresident and Chief Executive Officer Chief Financial Officer and Secretary\n(Principal Executive Officer) (Principal Financial and Accounting Officer)\n/s/ Alvaro Garcia-Tunon /s/ Morgan K. O'Brien\nAlvaro Garcia-Tunon, Chairman of the Board Morgan K. O'Brien, Director\n/s/ Gregory S. Babe /s/ Aleta W. Richards\nGregory S. Babe, Director Aleta W. Richards, Director\n/s/ Katherine E. Dietze /s/ David A. Schawk\nKatherine E. Dietze, Director David A. Schawk, Director\n/s/ Terry L. Dunlap /s/ Jerry R. Whitaker\nTerry L. Dunlap, Director Jerry R. Whitaker, Director\n/s/ Lillian D. Etzkorn\nLillian D. Etzkorn, Director"
}