{
    "cik": "64472",
    "company": "GENCOR INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-16",
    "period_of_report": "2022-09-30",
    "sic": "3531",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/64472/0001193125-22-306498-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/64472/000119312522306498/d386341d10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/64472/0001193125-22-306498.txt",
    "filename": "64472_10K_2022_0001193125-22-306498.htm",
    "content": "ITEM 1 BUSINESS\nGeneral\nGencor Industries, Inc. and its subsidiaries (the Company, Gencor, we, us or our) is a leading manufacturer of heavy machinery used in the production of highway construction equipment and materials and environmental control equipment. The Companys products are manufactured in the United States and sold through a combination of Company sales representatives and independent dealers and agents located throughout the world.\nThe Company designs, manufactures and sells machinery and related equipment used primarily for the production of asphalt and highway construction equipment and materials. The Companys principal core products include asphalt pavers, hot mix asphalt plants, combustion systems, and fluid heat transfer systems. The Company believes that its technical and design capabilities and environmentally friendly process technology have enabled it to become a leading producer of hot mix asphalt plants and related components in North America. The Company believes it has the largest installed base of asphalt plants in the United States.\nBecause the Companys products are sold primarily to companies in the highway construction industry, its business has historically been seasonal. Traditionally, the Companys customers do not purchase new equipment during the summer and fall months to avoid disrupting their peak season for highway construction and repair work. The majority of orders for the Companys asphalt plants and pavers are typically received between October and February, with a significant volume of shipments occurring prior to June. The principal factors driving demand for the Companys products are the level of federal and state funding for domestic highway construction and repair, the replacement of existing plants, and a trend towards efficient, larger plants.\nIn 1968, the Company was formed by the merger of Mechtron Corporation with General Combustion, Inc. (General Combustion) and Genco Manufacturing, Inc. The new entity reincorporated in Delaware in 1969 and adopted the name Mechtron International Corporation in 1970. In 1985, the Company began a series of acquisitions into related fields starting with the Beverley Group Ltd. (Beverley) in the United Kingdom. Hy-Way Heat Company, Inc. (Hy-Way Heat) and the Bituma Group were acquired in 1986. In 1987, the Company changed its name to Gencor Industries, Inc. and acquired Davis Line Inc. and its subsidiaries in 1988.\nIn 1998, the Company entered into agreements with Carbontronics, LLC, pursuant to which the Company designed, manufactured, sold and installed four synthetic fuel production plants. In addition to payment for the plants, the Company received membership interests in two synthetic fuel entities. These derived significant cash flows from the sale of synthetic fuel and tax credits (Internal Revenue Code, Section 29) and, consequently, distributed significant cash to the Company from 2001 to 2010.\nThe tax credit legislation expired at the end of calendar year 2007. Consequently, the four synthetic fuel plants were decommissioned. The plants were sold or transferred to site owners in exchange for a release of all contracted liabilities related to the removal of plants from the sites. Gencors ownership in the two synthetic fuel entities ended in 2013.\nOn October 1, 2020, the Company acquired the Blaw-Knox assets from Volvo Construction Equipment North America, LLC (Volvo CE). The acquisition expanded the Companys product offerings by adding highway class asphalt pavers to its asphalt plant and related equipment products.\nProducts\nAsphalt Plants. The Company manufactures and produces hot-mix asphalt plants used in the production of asphalt paving materials. The Company also manufactures related asphalt plant equipment, including hot-mix storage silos, fabric filtration systems, cold feed bins and other plant components. The Companys H&B (Hetherington and Berner) product line is the worlds oldest asphalt plant line, first manufactured in 1894. The Companys subsidiary, Bituma Corporation, formerly known as Boeing Construction Company, developed the first continuous process for asphalt production. Gencor developed and patented the first counter flow drum mix technology, several adaptations of which have become the industry standard, which recaptures and burns emissions and vapors, resulting in a cleaner and more efficient process. The Company also manufactures a very comprehensive range of fully mobile batch plants.\nCombustion Systems and Industrial Incinerators. The Company manufactures combustion systems, which are large burners that can transform most solid, liquid or gaseous fuels into usable energy, or burn multiple fuels, alternately or simultaneously. Through its subsidiary General Combustion, the Company has been a significant source of combustion systems for the asphalt and aggregate drying industries since the 1950s. The Company also manufactures combustion systems for rotary dryers, kilns, fume and liquid incinerators and fuel heaters. The Company believes maintenance and fuel costs are lower for its burners because of their superior design.\nFluid Heat Transfer Systems. The Companys General Combustion subsidiary manufactures the Hy-Way Heat and Beverley lines of thermal fluid heat transfer systems and specialty storage tanks for a wide array of industry uses. Thermal fluid heat transfer systems are similar to boilers, but use high temperature oil instead of water. Thermal fluid heaters have been replacing steam pressure boilers as the best method of heat transfer for storage, heating and pumping viscous materials (i.e., asphalt, chemicals, heavy oils, etc.) in many industrial and petrochemical applications worldwide. The Company believes the high-efficiency design of its thermal fluid heaters can outperform competitive units in many types of process applications.\nAsphalt Pavers. The Company manufactures asphalt pavers under the Blaw-Knox brand. The Blaw-Knox brand dates back over a century, when in 1917 Blaw Collapsible Steel Centering Company merged with the Knox Pressed and Welded Steel Company. Blaw-Knox made its first road paving equipment in 1929. Blaw-Knox pavers are the industry leading, highway class pavers that deliver outstanding reliability and produce the highest quality rideable surfaces in the industry. Projects paved with Blaw-Knox pavers continually win industry awards for the highest quality highway pavements.\nProduct Engineering and Development\nThe Company is engaged in product engineering and development efforts to expand its product lines and to further develop more energy-efficient and environmentally friendly equipment.\nProduct engineering and development activities are directed toward more efficient methods of producing asphalt and lower cost fluid heat transfer systems. In addition, efforts are also focused on developing combustion systems that operate at higher efficiency and offer a higher level of environmental compatibility.\nSources of Supply and Manufacturing\nSubstantially all products and components sold by the Company and its subsidiaries are manufactured and assembled by the Company. The Company purchases steel, other raw materials and hardware used to manufacture its products from numerous suppliers. The Company may augment internal production by outsourcing some of its production when demand for its products exceeds its manufacturing capacity.\nSeasonality\nThe Company is concentrated in the manufacturing of asphalt pavers, asphalt plants and related components, which is typically subject to a seasonal slow-down during the third and fourth quarters of the calendar year.\nCompetition\nThe markets for the Companys products are highly competitive. The industry remains fairly concentrated, with a small number of companies competing for the majority of the Companys product lines. The principal competitive factors include quality, price, delivery, availability, and technology. The Company believes it manufactures the highest quality equipment in the industry. Its products performance reliability, brand recognition, pricing, and after-the-sale technical support are other important factors.\nSales and Marketing\nThe Companys products and services are marketed through Company-employed sales representatives and independent dealers.\nSales Backlog\nThe size of the Companys backlog should not be viewed as an indicator of the Companys quarterly or annualized revenues, due to the timing of order fulfillment of asphalt plants. The Companys backlog was $43.2 million and $53.1 million as of December 1, 2022 and December 1, 2021, respectively.\nFinancial Information about Geographic Areas Reporting Segments\nSee Reporting Segments and Geographic Areas in Note 1 to the Consolidated Financial Statements.\nLicenses, Patents and Trademarks\nThe Company holds numerous patents covering technology and applications related to various products, equipment and systems, and numerous trademarks and trade names registered with the U.S. Patent and Trademark Office and in various foreign countries. In general, the Company depends upon technological capabilities, manufacturing quality control and application know-how, rather than patents or other proprietary rights in the conduct of its business.\nGovernment Regulations\nThe Company believes its design and manufacturing processes meet all industry and governmental agency standards that may apply to its entire line of products, including all domestic and foreign environmental, structural, electrical and safety codes. The Companys products are designed and manufactured to comply with U.S. Environmental Protection Agency regulations. Certain state and local regulatory authorities have strong environmental impact regulations. While the Company believes that such regulations have helped, rather than restricted its marketing efforts and sales results, there is no assurance that changes to federal, state, local, or foreign laws and regulations will not have a material adverse effect on the Companys products and earnings in the future.\nEnvironmental Matters\nThe Company is subject to various federal, state, local and foreign laws and regulations relating to the protection of the environment. The Company believes it is in compliance with all applicable environmental laws and regulations. The Company does not expect any material impact on future operating costs as a result of compliance with currently enacted environmental regulations.\nEmployees\nAs of September 30, 2022, the Company had 367 full-time employees. The Company has a collective bargaining agreement covering employees at its Marquette, Iowa facility. No other employees are represented by a labor union or collective bargaining agreement.\nAvailable Information\nFor further discussion concerning the Companys business, see the information included in Item 7 (Managements Discussion and Analysis of Financial Condition and Results of Operations) and Item 8 (Financial Statements and Supplementary Data) of this Annual Report.\nThe Company makes available free of charge through its website at www.gencor.com the Companys Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all amendments to those reports, if applicable, filed or furnished pursuant to Sections 13(a) and 15(d) of the Exchange Act, as soon as reasonably practicable after the material is electronically filed with or furnished to the Securities and Exchange Commission (SEC). The information posted on the website is not incorporated into this Annual Report. ITEM 1A RISK FACTORS\nThe following risk factors and other information included in this Annual Report should be carefully considered. The risks and uncertainties described below are not the only ones the Company faces. Additional risks and uncertainties not presently known to the Company, or that the Company presently deems less significant, may also impair the Companys operations. If any of the following risks actually occur, the Companys business operating results and financial condition could be materially adversely affected. The order of these risk factors does not reflect their relative importance or likelihood of occurrence.\nThe business is affected by the cyclical nature of the markets it serves.\nThe demand for the Companys products is dependent on general economic conditions and more specifically, Federal and state funding for highways and roads. Adverse economic conditions may cause customers to forego or delay new purchases and rely more on repairing existing equipment thus negatively impacting the Companys sales and profits.\nThe business is affected by the level of government funding for highway construction in the United States and Canada.\nMost highway contractors in the U.S. and Canada depend on funding by federal, provincial, state and local agencies for highway, transit and infrastructure programs. Future legislation may increase or decrease government spending, which, if decreased, could have a negative effect on the Companys financial condition or results of operations. Federal and/or state funding allocated to infrastructure may decrease in the future.\nPreviously, the Company depended on one customer for a significant portion of its revenue. The loss of any relationship with a large customer, or a significant downturn in the business or financial condition of any such customer, could have adverse consequences on the Companys future business.\nNo customer accounted for 10% or more of fiscal 2022 or 2021 revenues. If the Company had customers that accounted for a significant portion of its net revenues, then the loss of any of those customers, or a significant reduction in sales to any such customer, could adversely affect the Companys revenues and, consequently, its business.\nIf the Company fails to comply with requirements relating to internal control over financial reporting under Section 404 of the Sarbanes-Oxley Act, the business could be harmed and its stock price could decline.\nRules adopted by the SEC pursuant to Section 404 of the Sarbanes-Oxley Act of 2002 require the Company to assess its internal control over financial reporting annually. The rules governing the standards that must be met for management to assess its internal control over financial reporting are complex. They require significant documentation, testing, and possible remediation of any significant deficiencies in and/or material weaknesses of internal controls in order to meet the detailed standards under these rules. The Company has evaluated its internal control over financial reporting as effective as of September 30, 2022. See Item 9A - Controls and Procedures - Managements Annual Report on Internal Control over Financial Reporting. Although the Company concluded that its internal control over financial reporting was effective as of September 30, 2022, in future fiscal years, the Company may encounter unanticipated delays or problems in assessing its internal control over financial reporting as effective or in completing its assessments by the required dates. In addition, the Company cannot be assured that, if required, its independent registered public accountants will attest that internal control over financial reporting is effective in future fiscal years. If the Company cannot assess its internal control over financial reporting as effective, investor confidence and share value may be negatively impacted.\nThe Company may be required to reduce its profit margins on contracts where revenues are recognized over time.\nRevenues from contracts with customers for the design, manufacture and sale of custom equipment are recognized over time when the performance obligation is satisfied by transferring control of the equipment. Control of the equipment transfers over time as the equipment is unique to the specific contract and thus does not create an asset with an alternative use. Revenues and costs are recognized in proportion to actual labor costs incurred, as compared with total\nestimated labor costs expected to be incurred during the entire contract. As a result, revisions made to the estimates of revenues and profits are recorded in the period in which the conditions that require such revisions become known and can be estimated. Although the Company believes that its profit margins are fairly stated and that adequate provisions for losses for its fixed-price contracts are recorded in the financial statements, as required by accounting principles generally accepted in the United States of America (GAAP), the Company cannot assure that its estimated contract profit margins will not decrease or its estimated loss provisions will not increase materially in the future.\nThe Company may encounter difficulties with acquisitions.\nAs part of its growth strategy, the Company intends to evaluate the acquisition of other companies, assets or product lines that would complement or expand the Companys existing business or broaden its customer base. Although the Company conducts due diligence reviews of potential acquisition candidates, it may not be able to identify all material liabilities or risks related to potential acquisition candidates. There can be no assurance that the Company will be able to locate and acquire any business, retain key personnel and customers of an acquired business or integrate any acquired business successfully. Additionally, there can be no assurance that financing for any acquisition, if necessary, will be available on acceptable terms, if at all, or that the Company will be able to accomplish its strategic objectives in connection with any acquisition.\nThe Companys marketable securities are comprised of cash and money funds, equities, corporate bonds, mutual funds, exchange-traded funds, and government securities invested through professional investment management firms and are subject to various risks, such as interest rates, markets, and credit.\nThe Companys marketable securities are comprised of cash and money funds, equities, corporate bonds, mutual funds, exchange-traded funds, and government securities invested through professional investment management firms and are subject to various risks, such as interest rate risk, market risk, and credit risk. Due to the level of risk associated with certain investment securities and the level of uncertainty related to changes in the value of securities, adverse developments with respect to interest rates, the capital markets or the credit markets could have a material adverse impact on the value of these investment securities and ultimately, the Companys results of operations.\nThere are and will continue to be quarterly fluctuations of the Companys operating results.\nThe Companys operating results historically have fluctuated from quarter to quarter as a result of a number of factors, including the value, timing and shipment of individual orders and the mix of products sold. Revenues from contracts with customers for the design, manufacture and sale of custom equipment are recognized over time when the performance obligation is satisfied by transferring control of the equipment. Revenues from all other contracts for the design and manufacture of equipment, for service and for parts sales, net of any discounts and return allowances, are recorded at a point in time when control of the goods or services has been transferred. The Companys asphalt production equipment operations are subject to seasonal fluctuations, which may lower revenues and result in possible quarterly operating losses.\nIf the Company is unable to attract and retain key personnel, its business could be adversely affected.\nThe success of the Company will continue to depend substantially upon the efforts, abilities and services of its management team and certain other key employees. The loss of one or more key employees could adversely affect the Companys operations. The Companys ability to attract and retain qualified personnel, either through direct hiring, or acquisition of other businesses employing such persons, will also be an important factor in determining its future success.\nThe Company may be required to defend its intellectual property against infringement or against infringement claims of others.\nThe Company holds numerous patents covering technology and applications related to various products, equipment and systems, and numerous trademarks and trade names registered with the U.S. Patent and Trademark Office and in various foreign countries. There can be no assurance as to the breadth or degree of protection that future patents or trademarks may afford the Company, or that any pending patent or trademark applications will result in issued patents or trademarks, or that the Companys patents, registered trademarks or patent applications, if any, will be upheld if challenged, or that competitors will not develop similar or superior methods or products outside the protection of any patents issued, licensed or sublicensed to the Company. Although the Company believes that none of its technologies, products or trademarks infringe upon the patents, technologies, products or trademarks of others, it is possible that the Companys trademarks or other rights may not be valid or that infringement of future patents, trademarks or proprietary rights may occur. In the event that the Companys products are deemed to infringe upon the patent or proprietary rights of others, the Company could be required to modify the design of its products, change the name of its products or obtain a license for the use of certain technologies incorporated into its products. There can be no assurance that the Company would be able to do any of the foregoing in a timely manner, upon acceptable terms and conditions, or at all, and the failure to do so could have a material adverse effect on the Company. In addition, there can be no assurance that the Company will have the financial or other resources necessary to enforce or defend a patent, registered trademark or other proprietary right, and, if the Companys products are deemed to infringe upon the patents, trademarks or other proprietary rights of others, the Company could become liable for damages, which could also have a material adverse effect on the Company.\nThe Company may be subject to substantial liability for its products.\nThe Company is engaged in a business that could expose it to possible liability claims for personal injury or property damage due to alleged design or manufacturing defects in its products. The Company believes that it meets existing professional specification standards recognized or required in the industries in which it operates, and there are no material product liability claims pending against the Company as of the date hereof. Although the Company currently maintains product liability coverage, which it believes is adequate for the continued operation of its business, such insurance may prove inadequate or become difficult to obtain or unobtainable in the future on terms acceptable to the Company.\nThe Company is subject to extensive environmental laws and regulations, and the costs related to compliance with, or the Companys failure to comply with, existing or future laws and regulations, could adversely affect the business and results of operations.\nThe Companys operations are subject to federal, state, local and foreign laws and regulations relating to the protection of the environment. Sanctions for noncompliance may include revocation of permits, corrective action orders, significant administrative or civil penalties and criminal prosecution. The Companys business involves environmental management and issues typically associated with historical manufacturing operations. To date, the Companys cost of complying with environmental laws and regulations has not been material, but the fact that such laws or regulations are changed frequently makes predicting the cost or impact of such laws and regulations on the Companys future operations uncertain.\nThe Company is dependent upon third-party suppliers, making it vulnerable to supply shortages and price increases.\nThe principal raw material the Company uses is carbon steel which is sourced through numerous suppliers. The Company also uses select suppliers to provide proprietary components to its finished products. Although the Company believes that raw materials are available from alternate sources, an interruption in the supply of steel or related products or a substantial increase in the price of steel or related products could have a material adverse effect on the Companys production and its results of operations.\nIn addition, the cost of parts or materials may increase significantly for reasons other than changes in commodity prices. Factors such as supply and demand, freight costs, availability of transportation, availability of labor, inventory levels, the level of imports, the imposition of duties and tariffs and other trade barriers and general economic conditions may affect the price of our parts or materials. Market conditions could limit the Companys ability to raise selling prices to offset increases in material and/or labor costs.\nIn the future, we could experience some disruption in the supply of some of our parts or materials that we purchase from suppliers. Delays in obtaining parts or materials may result from a number of factors affecting our suppliers including capacity constraints, labor shortages or supplier product quality issues. These risks are increased in a weak economic environment or when demand increases coming out of an economic downturn. Such disruptions could result in manufacturing inefficiencies caused by the Company having to wait for parts to arrive on production lines, could delay sales and could result in a material adverse effect on the Companys results of operations, financial condition, and/or cash flows.\nThe Company is subject to government regulations.\nThe Company is committed to responsible environmental, social and governance (ESG) practices. The Company strives to be recognized as a company that achieves customer expectations safely and in a manner that rewards both its customers and its employees. The Company strives to achieve these goals through an organizational structure that provides excellent service and a reputation of integrity with the communities where it operates while providing its employees with growth opportunities in an injury-free environment.\nThe Company is subject to a variety of governmental regulations relating to the manufacturing of its products. Failure by the Company to comply with regulations could subject it to liabilities, or suspension of production that could have a material adverse effect on the Companys results. Such regulations could also restrict the Companys ability to expand its facilities, or to incur other expenses to comply with such regulations. Although the Company believes it has the design and manufacturing capability to meet all industry or governmental agency standards that may apply to its product lines, including all domestic and foreign environmental, structural, electrical and safety codes, there can be no assurance that governmental laws and regulations will not become more stringent over time, imposing greater compliance costs and increasing risks and penalties associated with a violation. The cost to the Company of such compliance to date has not materially affected its business, financial condition or results of operations. There can be no assurance, however, that violations will not occur in the future as a result of human error, equipment failure or other causes. The Companys customers are also subject to extensive regulations, including those related to the workplace. The Company cannot predict the nature, scope or effect of governmental legislation, or regulatory requirements that could be imposed or how existing or future laws or regulations will be administered, or interpreted. Compliance with more stringent laws or regulations, as well as more vigorous enforcement policies of regulatory agencies, could require substantial expenditures by the Company and could adversely affect its business, financial condition and results of operations.\nIncreasing scrutiny and changing expectations from stakeholders with respect to the Companys ESG practices may expose us to new or additional risks.\nCompanies across many industries are facing increasing scrutiny from stakeholders related to their ESG practices. Investor advocacy groups, certain institutional investors, investment funds and other influential investors are also increasingly focused on ESG practices and in recent years have placed increasing importance on the implications and social cost of their investments. Regardless of the industry, investors and stakeholders increased focus related to stakeholder ESG expectations and standards, which are evolving, may cause the Company to suffer from reputational damage and its business or financial condition could be adversely affected.\nThe Companys management has effective voting control.\nThe Companys officers beneficially own 100% of the outstanding shares of the Companys Class B stock. The holders of the Class B stock are entitled to elect 75% (calculated to the nearest whole number, rounding five-tenths to next highest whole number) of the members of the Companys Board of Directors. Further, approval of a majority of the holders of the Class B stock is generally required to affect a sale of the Company and certain other corporate transactions. As a result, the Class B shareholders can elect more than a majority of the Board of Directors and exercise significant influence over most matters requiring approval by the Companys shareholders. This concentration of control may also have the effect of delaying or preventing a change in control.\nThe issuance of preferred stock may impede a change of control or may be dilutive to existing shareholders.\nThe Companys Certificate of Incorporation, as amended, authorizes the Companys Board of Directors, without shareholder vote, to issue up to 300,000 shares of preferred stock in one or more series and to determine for any series the dividend, liquidation, conversion, voting or other preferences, rights and terms that are senior, and not available, to the holders of the Companys common stock. Thus, issuances of series of preferred stock could adversely affect the relative voting power, distributions and other rights of the common stock. The issuance of preferred stock could deter or impede a merger, tender offer or other transaction that some, or a majority of the Companys common shareholders might believe to be in their best interest or in which the Companys common shareholders might receive a premium for their shares over the then current market price of such shares.\nThe Company may be required to indemnify its directors and executive officers.\nThe Company has authority under Section 145 of the Delaware General Corporation Law to indemnify its directors and officers to the extent provided in that statute. The Companys Certificate of Incorporation, as amended, provides that a director shall not be personally liable to the Company for breach of fiduciary duty as a director, except to the extent such exemption from liability or limitation thereof is not permitted under the Delaware General Corporation Law. The Companys Bylaws provide, in part, that it indemnify each of its directors and officers against liabilities imposed upon them (including reasonable amounts paid in settlement) and expenses incurred by them in connection with any claim made against them or any action, suit or proceeding to which they may be a party by reason of their being or having been a director or officer. The Company maintains officers and directors liability insurance coverage. There can be no assurance that such insurance will be available in the future, or that if available, it will be available on terms that are acceptable to the Company. Furthermore, there can be no assurance that the insurance coverage provided will be sufficient to cover the amount of any judgment awarded against an officer or director (either individually or in the aggregate). Consequently, if such judgment exceeds the coverage under the policy, the Company may be forced to pay such difference.\nThe Company enters into indemnification agreements with each of its executive officers and directors containing provisions that may require the Company, among other things, to indemnify them against certain liabilities that may arise by reason of their status or service as officers or directors (other than liabilities arising from willful misconduct of a culpable nature) and to advance their expenses incurred as a result of any proceeding against them as to which they could be indemnified. Management believes that such indemnification provisions and agreements are necessary to attract and retain qualified persons as directors and executive officers.\nThe Company does not expect to pay cash dividends for the foreseeable future.\nThe Company intends to retain its cash to fund its business requirements. It does not anticipate paying cash dividends on its common stock or Class B stock. Any future determination to pay cash dividends will be at the discretion of the Companys Board of Directors and will be dependent upon existing conditions, including the financial condition and results of operations, capital requirements, contractual restrictions, business prospects, and other factors that the Board of Directors considers relevant.\nCompetition could reduce revenue from the Companys products and services and cause it to lose market share.\nThe Company currently faces strong competition in product performance, price and service. Some of the Companys competitors have greater financial, product development and marketing resources than the Company. If competition in the Companys industry intensifies or if the current competitors enhance their products or lower their prices for competing products, the Company may lose sales or be required to lower the prices it charges for its products. This may reduce revenues from the Companys products and services, lower its gross margins, or cause a loss in market share.\nThe Companys quarterly operating results are likely to fluctuate, which may decrease its stock price.\nThe Companys quarterly operating results have varied significantly in the past and are likely to vary significantly from quarter to quarter in the future. As a result, the Companys operating results may fall below the expectations of securities analysts and investors in some quarters, which could result in a decrease in the market price of its common stock. The reasons the Companys quarterly results may fluctuate include:\nGeneral competitive and economic conditions;\nDelays in, or uneven timing in, delivery of customer orders;\nThe seasonal nature of the industry;\nThe fluctuations in the market value of its securities portfolio;\nThe introduction of new products by the Company or its competitors;\nProduct supply shortages;\nReduced demand due to adverse weather conditions;\nExpiration or renewal of Federal highway programs; and\nChanges to federal, state or Canadian provincial programs.\nPeriod-to-period comparisons of such items should not be relied on as indications of future performance.\nThe Companys common stock has been, and likely will continue to be, subject to substantial price and volume fluctuations due to a number of factors, many of which will be beyond the Companys control.\nThe market price of the Companys common stock may be significantly affected by various factors, such as:\nQuarterly variations in operating results;\nChanges in revenue growth rates as a whole or for specific geographic areas or products;\nChanges in earnings estimates by market analysts;\nThe announcement of new products or product enhancements by the Company or its competitors;\nSpeculation in the press or analyst community of potential acquisitions by the Company; and\nGeneral market conditions or market conditions specific to particular industries.\nThe Companys business, results of operations, financial condition, cash flows, and the stock price of its common stock could be adversely affected by the COVID-19 pandemic.\nThe Companys business, results of operations financial condition, cash flows, and the stock price of its common stock can be adversely affected by pandemics or other public health emergencies, such as the recent outbreak of COVID-19 and its variants. In March 2020, the World Health Organization (WHO) declared COVID-19 as a pandemic. The COVID-19 pandemic has resulted in governments around the world implementing increasingly stringent measures to help control the spread of the virus, including stay at home orders, travel restrictions, business curtailments, school closures, and other measures.\nThe outbreak of COVID-19 (including any variants) and any preventive or protective actions taken by governmental authorities may have a material adverse effect on the Companys operations, supply chain, customers, and transportation networks, including business shutdown or disruptions. The extent to which COVID-19 and its variants may adversely impact the Companys business depends on future developments, which are highly uncertain and unpredictable, depends upon the severity and duration of the outbreak and the effectiveness of actions taken globally to contain or mitigate its effect. Any resulting financial impact cannot be estimated reasonably at this time, but may materially adversely affect the Companys business, results of operations, financial condition, and cash flows. Even after the COVID-19 pandemic has subsided, the Company may experience materially adverse impacts to its business due to any resulting economic downturn. Additionally, concerns over the economic impact of COVID-19 and its variants have caused volatility in financial and other capital markets, which has and may continue to adversely impact the Companys stock price, its ability to access capital markets, and the value of its investment portfolio. To the extent the COVID-19 pandemic adversely affects the Companys business and financial results it may also have the effect of heightening many of the other risks described in this Annual Report, such as those relating to the Companys products and financial performance.\nGlobal, market and economic conditions may negatively impact our business, financial condition and share price.\nConcerns over inflation, geopolitical issues, global financial markets and the COVID-19 pandemic have led to increased economic instability and expectations of slower global economic growth. Our business may be adversely affected by any such economic instability or unpredictability. Russias invasion of Ukraine and related sanctions has led to increased oil and natural gas prices. Such sanctions and disruptions to the global economy may lead to additional inflation and may disrupt the global supply chain and could have a material adverse effect on our ability to secure supplies. The increased cost of oil, along with increased or prolonged periods of inflation, would likely increase our costs in the form of higher wages, further inflation on supplies and equipment necessary to operate our business. There is a risk that one or more of our suppliers could be negatively affected by global economic instability, which could adversely affect our ability to operate efficiently and timely complete our operational goals.\nThe Company may suffer adverse consequences if it is deemed an investment company under the Investment Company Act of 1940, as amended (the Investment Company Act).\nUnder Section 3(a)(1)(A) of the Investment Company Act, a company is deemed to be an investment company if it is, or holds itself out as being, engaged primarily, or proposes to engage primarily, in the business of investing, reinvesting, or trading in securities. The Company believes that it is not an investment company under Section 3(a)(1)(A) of the Investment Company Act because it does not hold itself out as being engaged primarily in the business of investing, reinvesting, or trading in securities. Rather, the Company has been a manufacturer of heavy equipment used in the production of asphalt for highway construction and environmental control equipment for over 50 years. The Companys core products include asphalt plants, combustion systems, and fluid heat transfer systems. The Company is expanding its product offerings through new product introductions and its 2020 acquisition of an asphalt paver product line.\nUnder Section 3(a)(1)(C) of the Investment Company Act, a company is deemed to be an investment company if it is engaged, or proposes to engage in the business of investing, reinvesting, owning, holding, or trading in securities and owns or proposes to acquire investment securities having a value exceeding 40% of the value of its total assets (exclusive of U.S. Government securities and cash items) on an unconsolidated basis. As reflected on the Companys balance sheet at September 30, 2022, the Company owns a significant amount of marketable securities, which include cash, cash equivalents, government and corporate bonds, mutual funds, exchange-traded funds and equities. Section 3(a)(2) defines the term investment securities, as used in Section 3(a)(1)(C) to include all marketable securities except government securities and cash and cash equivalents. The value of the Companys investment securities exceeded 40% of the value of its total assets (excluding government securities and cash items) at September 30, 2022. Because of the value of its investment securities, the Company may be deemed an investment company. The Company believes that it is not an investment company under Section 3(a)(1)(C) of the Investment Company Act because it does not propose to engage in the business of investing, reinvesting, owning, holding, or trading in securities. In addition, if the Company was deemed an investment company under Section 3(a)(1)(C), it believes that it will qualify for an exemption from the definition of an investment company as it is primarily engaged in a business other than that of investing, reinvesting, owning, holding, or trading in securities. As noted above, the Company is primarily engaged in the manufacturing of heavy equipment. If the SEC or a court challenged the Companys status as an operating company, it could incur significant legal expenses.\nIf the Company was deemed to be, and was required to register as an investment company, the Company would be forced to comply with the legal requirements of the Investment Company Act that would regulate the manner in which the Company would be permitted to conduct its business activities. As an investment company, the Company would be (i) subjected to disclosure and accounting guidance geared toward investment, rather than operating, companies; (ii) significantly limited in its ability to borrow money, issue options, issue multiple classes of stock and debt, and engage in transactions with affiliates; and (iii) required to undertake significant costs and expenses to meet other disclosure, reporting, and regulatory requirements to which it would be subject as a registered investment company.\nThe Company faces risks with the acquisition of Blaw-Knox and any future acquisitions.\nThe Company acquired the Blaw-Knox assets on October 1, 2020. The success of this acquisition depends, in part, on the Companys ability to successfully grow the business and realize anticipated benefits, including any synergies. It may take longer than expected to realize growth in the business or realize anticipated benefits, which may be smaller than the Company expected. Also, there are a number of challenges and risks involved in the Companys ability to successfully integrate Blaw-Knox with its current business. Any of these factors could have a material adverse effect on the Companys business, financial condition, results of operations, or cash flows.\nAcquiring businesses or products that expand and/or complement the Companys operations has been an element of its business strategy. The Company continues to evaluate potential acquisitions that may expand and/or complement its business. The Company may not be able to successfully identify attractive acquisition candidates or negotiate favorable terms in the future. Furthermore, the Companys ability to effectively integrate any future acquisitions will depend on, among other things, the adequacy of its implementation plans, the ability of its management to oversee and operate effectively the combined operations, and the Companys ability to achieve desired operational efficiencies. The Companys failure to successfully integrate the operations of any business that it may acquire in the future may adversely affect our business, financial position, results of operations, or cash flows.\nThere can be a shortage of skilled production workers, especially those with welding and/or fabricating capabilities. The Company could experience difficulty hiring or replacing those individuals, which could adversely affect its business.\nOur fabrication process requires skilled production workers. If we are unable to retain and hire an adequate number of individuals with welding and fabrication capabilities, this could adversely impact our ability to achieve our financial objectives. In addition, if demand for skilled production workers were to significantly outstrip supply, wages for these workers could dramatically increase and could affect our financial performance. ITEM 1B UNRESOLVED STAFF COMMENTS\nNone ITEM 2 PROPERTIES\nThe following table lists the operating properties owned or leased by the Company as of September 30, 2022:\nLocation\nAcreage\nBuilding\nSquare\nFootage\nPrincipal Function\nMarquette, Iowa\n72.0\n137,000\nOwned offices and manufacturing\nOrlando, Florida\n27.0\n215,000\nOwned corporate offices and manufacturing\nChambersburg, Pennsylvania\n7.4\n104,000\nLeased offices and manufacturing ITEM 3 LEGAL PROCEEDINGS\nThe Company has various litigation and claims, either as a plaintiff or defendant, pending as of the date of this Annual Report, which have occurred in the ordinary course of business, and which may be covered in whole, or in part, by insurance. Management has reviewed all litigation matters arising in the ordinary course of business and, upon advice of legal counsel, has made provisions, not deemed material, for any probable losses and expenses of litigation. ITEM 4 MINE SAFETY DISCLOSURES\nNone\nPART II ITEM 5 MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nThe Companys common stock is traded on the NYSE American LLC under the symbol GENC.\nThe Company has not issued any securities during the prior two years that were not already registered under the Exchange Act.\nAs of September 30, 2022, there were 187 holders of common stock of record and 6 holders of Class B stock of record. The Company has not paid cash dividends during the last two fiscal years and has no intention to pay cash dividends in the foreseeable future.\nEQUITY COMPENSATION PLANS\nThe Companys 2009 Incentive Compensation Plan expired on October 1, 2021. There are no other existing equity compensation plans and arrangements previously approved by security holders as of September 30, 2022. ITEM 6 [RESERVED] ITEM 7 MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Information\nThis Annual Report contains certain forward-looking statements within the meaning of the Exchange Act, which represent the Companys expectations and beliefs, including, but not limited to, statements concerning gross margins, sales of the Companys products and future financing plans, income from investees and litigation. These statements by their nature involve substantial risks and uncertainties, certain of which are beyond the Companys control. Actual results may differ materially depending on a variety of important factors, including the financial condition of the Companys customers, changes in the economic and competitive environments, the performance of the investment portfolio and the demand for the Companys products.\nFor information concerning these factors and related matters, see Risk Factors in Part I, Item 1A in this Annual Report. However, other factors besides those referenced could adversely affect the Companys results, and you should not consider any such list of factors to be a complete set of all potential risks or uncertainties. Any forward-looking statements made by the Company herein speak as of the date of this Annual Report. The Company does not undertake to update any forward-looking statements, except as required by law.\nOverview\nGencor is a leading manufacturer of heavy machinery used in the production of highway construction equipment and materials and environmental control equipment. The Companys core products include asphalt pavers, hot mix asphalt plants, combustion systems, fluid heat transfer systems and asphalt pavers. The Companys products are manufactured at three facilities in the United States.\nBecause the Companys products are sold primarily to the highway construction industry, the business is seasonal in nature. Traditionally, the Companys customers reduce their purchases of new equipment for shipment during the summer and fall months to avoid disrupting their peak season for highway construction and related repair work. The majority of orders for the Companys products are thus received between October and February, with a significant volume of shipments occurring in the late winter and spring. The principal factors driving demand for the Companys products are the overall economic conditions, the level of government funding for domestic highway construction and repair, Canadian infrastructure spending, the need for spare parts, fluctuations in the price of liquid asphalt, and a trend towards larger more efficient asphalt plants.\nOn November 15, 2021, President Biden signed into law a five-year, $1.2 trillion infrastructure bill, the Infrastructure Investment and Jobs Act (the IIJ Act), including $550 billion in new spending and reauthorization of $650 billion in previously allocated funds. The IIJ Act provides $110 billion for the nations highways, bridges and roads.\nFluctuations in the price of carbon steel, which is a significant cost and material used in the manufacturing of the Companys equipment, may affect the Companys financial performance. The Company is subject to fluctuations in market prices for raw materials, such as steel. If the Company is unable to purchase materials it requires or is unable to pass on price increases to its customers or otherwise reduce its cost of goods sold, its business results of operations and financial condition may be adversely affected.\nAlso, a significant increase in the price of liquid asphalt could decrease demand for hot mix asphalt paving materials and certain of the Companys products. Increases in oil prices also drive up the cost of gasoline and diesel, which results in increased freight costs. Where possible, the Company will pass increased freight costs on to its customers. However, the Company may not be able to recapture all of the higher costs and thus could have a negative impact on the Companys financial performance.\nThe Company believes its strategy of continuing to invest in product engineering and development and its focus on delivering the highest quality products and superior service will strengthen the Companys market position. The Company continues to review its internal processes to identify inefficiencies and cost-reduction opportunities. The Company will continue to scrutinize its relationships with suppliers to ensure it is achieving the highest quality materials and services at the most competitive cost.\nOn July 19, 2022, the Company announced that it was transferring the listing of its common stock, $0.10 per share par value (Common Stock), to the NYSE American LLC (NYSE American) from the NASDAQ Global Market (NASDAQ). Listing and trading of the Companys Common Stock on NASDAQ ended at market close on July 29, 2022 and listing and trading of its Common Stock on the NYSE American commenced at market open on August 1, 2022 under its current ticker symbol ‘GENC.\nCOVID-19 Pandemic\nThe Company continues to monitor and evaluate the risks to public health and the overall business activity related to the COVID-19 pandemic, including impacts on its employees, customers, suppliers and financial results. As of the date of issuance of this Annual Report, the Companys operations have not been significantly impacted. However, the full impact of the COVID-19 pandemic continues to evolve subsequent to the year ended September 30, 2022 and as of the date this Annual Report is issued. As such, the full magnitude that the COVID-19 pandemic will have on the Companys financial condition and future results of operations is uncertain. Management continues to monitor the Companys financial condition, operations, suppliers, industry, customers, and workforce. As the spread of COVID-19 and its variants continues, the Companys ability to meet customer demands for products may be impacted or its customers may experience adverse business consequences due to COVID-19 and its variants. Reduced demand for products or ability to meet customer demand (including as a result of disruptions at the Companys suppliers) could have a material adverse effect on its business operations and financial performance.\nResults of Operations\nYear ended September 30, 2022 compared with the year ended September 30, 2021\nNet revenue for the year ended September 30, 2022 increased 21.3% to $103,479,000 from $85,278,000 for the year ended September 30, 2021. Net revenue for the fourth quarter of fiscal 2022 increased 15.5% to $23,072,000 compared to $20,043,000 for the quarter ended September 30, 2021. The higher revenues in fiscal 2022 reflect increased shipments and progress on large contract orders where revenue is recognized over time.\nGross profit margins decreased to 19.9% in fiscal 2022 from 21.3% in fiscal 2021. Higher manufacturing costs associated with wages, steel, and OEM (Original Equipment Manufacturer) purchased parts had a negative impact on the Companys operating results in fiscal 2022.\nProduct engineering and development (PED) expense in fiscal 2022 increased by $47,000 to $4,325,000 from $4,278,000 in fiscal 2021. Higher payroll costs in PED expenses in fiscal 2022 were mostly offset by reduced headcount. Selling, general and administrative (SG&A) expenses in fiscal 2022 decreased $1,147,000 to $12,052,000 from $13,199,000 in fiscal 2021. The higher SG&A expenses in fiscal 2021 were primarily related to the acquisition of the paver line and professional fees to support business development efforts. Higher payroll costs in SG&A expenses in fiscal 2022 were also mostly offset by reduced headcount.\nFiscal 2022 had operating income of $4,167,000 versus $701,000 in fiscal 2021. The increase in operating income was due to the higher sales and reduced SG&A expenses.\nOn October 1, 2020, the Company acquired the Blaw-Knox assets, including inventory, fixed assets and related intellectual property, from Volvo Construction Equipment North America, LLC (Volvo CE). The acquisition provided the Company entry into the asphalt paver sector of the asphalt industry. The acquisition was accounted for as a business combination under ASC 805, Business Combinations. The initial purchase price of approximately $14.4 million, which was subject to post-closing adjustments, was funded by cash on hand. After post-closing adjustments transacted during quarter ended March 31, 2021, the final purchase price was $13.8 million, including $10.4 million in inventory and $3.4 million in fixed assets. There were no liabilities assumed. The accompanying consolidated financial statements as of and for the years ended September 30, 2022 and September 30, 2021, include the assets, liabilities and operating results of the paver line. There was no paver equipment revenue during the quarter ended December 31, 2020, as the facility was being readied for production which began in the quarter ended March 31, 2021.\nAs of September 30, 2022 and 2021, the cost basis of the investment portfolio was $94,879,000 and $93,690,000, respectively. For the year ended September 30, 2022, interest and dividend income, net of fees, from the investment portfolio was $1,305,000, as compared to $1,306,000 for year ended September 30, 2021. Interest income for the year ended September 30, 2021, also included $456,000 of interest collected from a customer. Net realized and unrealized losses on marketable securities were $(7,009,000) for the year ended September 30, 2022 versus net realized and unrealized gains of $4,171,000 for the year ended September 30, 2021. The fiscal 2022 investment losses reflect the general decline in global equity and bond markets. The total cash, cash equivalents and investments balance at September 30, 2022 was $98,881,000, compared to $118,208,000 at September 30, 2021, a decrease of $19,327,000, reflecting the investment losses and increased inventory.\nThe effective income tax rate for fiscal 2022 was a benefit of (78.0%) versus expense of 12.5% in fiscal 2021. The income tax benefit for fiscal 2022 reflects the impact of book to tax timing differences in the deductibility of certain items, the benefit from research and development tax refunds and credits, and other adjustments.\nIn fiscal 2022, the Company generated $475,000 of federal research and development tax credits (R&D Credits), all of which were used in fiscal 2022. In fiscal 2021, the Company generated $335,000 of R&D Credits, all of which were used in fiscal 2021. There were no R&D Credits carryforwards as of September 30, 2022 or September 30, 2021.\nNet loss for the year ended September 30, 2022 was $(372,000) or $(0.03) per diluted share versus net income of $5,805,000 or $0.39 per diluted share for the year ended September 30, 2021.\nLiquidity and Capital Resources\nThe Company generates capital resources through operations and returns from its investments.\nThe Company had no long-term debt outstanding at September 30, 2022 or 2021. As of September 30, 2022, the Company has funded $85,000 in cash deposits at insurance companies to cover collateral needs. In April 2020, a financial institution issued an irrevocable standby letter of credit (letter of credit) on behalf of the Company for the benefit of one of the Companys insurance carriers. The maximum amount that can be drawn by the beneficiary under the letter of credit is $150,000. The letter of credit expires in April 2023, unless terminated earlier, and can be extended, as provided by the agreement. The Company intends to renew the letter of credit for as long as the Company does business with the beneficiary insurance carrier. The letter is collateralized by restricted cash of the same amount on any outstanding drawings. To date, no amounts have been drawn under the letter of credit.\nAs of September 30, 2022, the Company had $9,581,000 in cash and cash equivalents, and $89,300,000 in marketable securities. The marketable securities are invested through a professional investment management firm. The securities may be liquidated at any time into cash and cash equivalents.\nThe Companys backlog, which includes orders received through the filing date of this Annual Report, was $60.2 million at September 30, 2022 versus $64.1 million at September 30, 2021. The Companys working capital was $150.1 million at September 30, 2022 versus $155.4 million at September 30, 2021.\nThe significant purchases, sales and maturities of marketable securities shown on the consolidated statements of cash flows typically reflect the frequent purchase and sale of United States treasury bills. In the fourth quarter of fiscal 2020, the Company liquidated approximately $17.0 million of its investments. The cash was primarily used to fund the October 2020 acquisition of the Blaw-Knox assets.\nYear ended September 30, 2022 compared with the year ended September 30, 2021\nCash flows used in operations in fiscal 2022 was $9,135,000 primarily resulting from increased inventory. The significant purchases, sales and maturities of marketable securities shown on the consolidated statements of cash flows reflect the recurring purchases and sales of United States treasury bills. Inventories increased by $13,927,000 primarily due to progress on several large contract orders where revenue is recognized at a point in time, the impact of the inflationary environment on raw material and wage price increases, and some stock build to adjust for the increasing lead times from suppliers. Accounts payable increased by $1,146,000 due primarily to the additional payables related to the increase in inventory.\nCash provided by operations in fiscal 2021 was $3,820,000, primarily resulting from net income. The significant purchases, sales and maturities of marketable securities shown on the consolidated statements of cash flows reflect the recurring purchases and sales of United States treasury bills. The decrease in costs and estimated earnings in excess of billings of $4,502,000 reflects the completion and shipment of several large contracts with revenues recognized over time during the year ended September 30, 2021. Excluding the impact of the Blaw-Knox acquisition, inventories increased by $4,413,000 primarily due to progress on several large contract orders where revenue is recognized at a point in time and some stock build to compensate for the longer lead times from suppliers. Accounts payable increased by $1,377,000 due to the additional payables related to the Blaw-Knox business along with the increase in inventory. Customer deposits increased $1,391,000, reflecting the down payments on contract jobs, including several recent orders where revenues are recognized over time but work is yet to begin.\nCash flows used in investing activities for the year ended September 30, 2022 of $4,516,000 were related to the capital expenditures primarily for manufacturing processing and finishing equipment.\nCash flows used in investing activities for the year ended September 30, 2021 of $16,436,000 were primarily related to the acquisition of the Blaw-Knox paver line and subsequent capital expenditures, primarily for systems software and leasehold improvements for the paver lines manufacturing facility. Cash provided by financing activities of $264,000 for the year ended September 30, 2021, related to proceeds from the exercise of stock options.\nCritical Accounting Policies, Estimates and Assumptions\nThe Company believes the following discussion addresses its most critical accounting policies, which are those that are most important to the portrayal of the Companys financial condition and results of operations and require managements most difficult, subjective, or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain. Accounting policies, in addition to the critical accounting policies referenced below, are presented in Note 1 to the Consolidated Financial Statements, Accounting Policies.\nEstimates and Assumptions\nIn preparing the Consolidated Financial Statements, the Company uses certain estimates and assumptions that may affect reported amounts and disclosures. Estimates and assumptions are used, among other places, when accounting for certain revenue (e.g., contract accounting), expense, and asset and liability valuations. The Company believes that the estimates and assumptions made in preparing the Consolidated Financial Statements are reasonable, but are inherently uncertain. Assumptions may be incomplete or inaccurate and unanticipated events may occur. The Company is subject to risks and uncertainties that may cause actual results to differ from estimated results.\nRevenues & Expenses\nThe Company accounts for revenues and related expenses under the provisions of ASU No. 2014-09, Revenue from Contracts with Customers (Topic 606), as amended (ASU No. 2014-09).\nRevenues from contracts with customers for the design, manufacture and sale of custom equipment are recognized over time when the performance obligation is satisfied by transferring control of the equipment. Control of the equipment transfers over time as the equipment is unique to the specific contract and thus does not create an asset with an alternative use to the Company. Revenues and related costs are recognized in proportion to actual labor costs incurred, as compared with total estimated labor costs expected to be incurred during the entire contract. All incremental costs related to obtaining a contract are expensed as incurred as the amortization period is less than one year. Changes to total estimated contract costs or losses, if any, are recognized in the period in which they are determined.\nContract assets (excluding accounts receivable) under contracts with customers represent revenue recognized in excess of amounts billed on equipment sales recognized over time. These contract assets were $2,118,000 and $1,903,000 at September 30, 2022 and 2021, respectively, and are included in current assets as costs and estimated earnings in excess of billings on the Companys consolidated balance sheets. The Company anticipates that all of the contract assets at September 30, 2022, will be billed and collected within one year.\nRevenues from all other contracts for the design and manufacture of equipment, for service and for parts sales, net of any discounts and return allowances, are recorded at a point in time when control of the goods or services has been transferred. Control of the goods or service typically transfers at time of shipment or upon completion of the service.\nPayment for equipment under contract with customers is typically due prior to shipment. Payment for services under contract with customers is due as services are completed. Accounts receivable related to contracts with customers at September 30, 2022 and September 30, 2021 were $142,000 and $210,000, respectively.\nProduct warranty costs are estimated using historical experience and known issues and are charged to production costs as revenue is recognized.\nUnder certain contracts with customers, recognition of a portion of the consideration received may be deferred and recorded as a contract liability if the Company has to satisfy a future obligation, such as to provide installation assistance. There were no contract liabilities other than customer deposits at September 30, 2022 and September 30, 2021. Customer deposits related to contracts with customers were $5,864,000 and $5,244,000 at September 30, 2022 and 2021, respectively, and are included in current liabilities on the Companys consolidated balance sheets.\nThe Company records revenues earned for shipping and handling as freight revenue at the time of shipment, regardless of whether or not it is identified as a separate performance obligation. The cost of shipping and handling is classified as cost of goods sold concurrently.\nProvisions for estimated returns and allowances and other adjustments are provided for in the same period the related sales are recorded. Returns and allowances, which reduce product revenue, are estimated using historical experience. All product engineering and development costs, and selling, general and administrative expenses are charged to operations as incurred. Provision is made for any anticipated contract losses in the period that the loss becomes evident. The allowance for doubtful accounts is determined by performing a specific review of all account balances greater than 90 days past due and other higher risk amounts to determine collectability and also adjusting for any known customer payment issues with account balances in the less-than-90-day past due aging buckets. Account balances are charged off against the allowance for doubtful accounts when they are determined to be uncollectable. Any recoveries of account balances previously considered in the allowance for doubtful accounts reduce future additions to the allowance for doubtful accounts.\nInventories\nInventories are valued at the lower of cost or net realizable value, with cost being determined under the first-in, first-out (FIFO) method and net realizable value defined as the estimated selling price of goods less reasonable costs of completion and delivery (see Note 2 to Consolidated Financial Statements). Appropriate consideration is given to obsolescence, excessive levels, deterioration, possible alternative uses and other factors in determining net realizable value. The cost of work in process and finished goods includes materials, direct labor, variable costs and overhead. The Company evaluates the need to record inventory adjustments on all inventories, including raw materials, work in process, finished goods, spare parts and used equipment. Used equipment acquired by the Company on trade-in from\ncustomers is carried at estimated net realizable value. Unless specific circumstances warrant different treatment regarding inventory obsolescence, an allowance is established to reduce the cost basis of inventories three to four years old by 50%, the cost basis of inventories four to five years old by 75%, and the cost basis of inventories greater than five years old to zero. Inventory is typically reviewed for obsolescence on an annual basis computed as of September 30, the Companys fiscal year end. If significant known changes in trends, technology or other specific circumstances that warrant consideration occur during the year, then the impact on obsolescence is considered at that time.\nInvestments\nMarketable debt and equity securities are categorized as trading securities and are thus marked to market and stated at fair value. Fair value is determined using the quoted closing or latest bid prices for Level 1 investments and market standard valuation methodologies for Level 2 investments. Realized gains and losses on investment transactions are determined by specific identification and are recognized as incurred in the consolidated statements of operations. Net unrealized gains and losses are reported in the consolidated statements of operations and represent the change in the fair value of investment holdings during the period.\nLong Lived Asset Impairment\nProperty and equipment, and intangible assets subject to amortization are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset (or asset group) may not be recoverable. An impairment loss would be recognized when the carrying amount of an asset exceeds the estimated undiscounted cash flows expected to result from the use of the asset and its eventual disposition. The amount of the impairment loss to be recorded is calculated by the excess over its fair value of the assets carrying value. Fair value is generally determined using a discounted cash flow analysis.\nInflation\nThe overall effects of inflation on the Companys business during fiscal 2022 and 2021 have been significant relative to prior years. The Company monitors the prices it charges for its products and services on an ongoing basis and has been able to adjust its prices to take into account future changes in the rate of inflation.\nContractual Obligations\nThe Company had no long-term or short-term debt as of September 30, 2022 and there was no long-term debt facility in place at September 30, 2022.\nIn April 2020, a financial institution issued an irrevocable standby letter of credit (letter of credit) on behalf of the Company for the benefit of one of the Companys insurance carriers. The maximum amount that can be drawn by the beneficiary under the letter of credit is $150,000. The letter of credit expires in April 2023, unless terminated earlier, and can be extended, as provided by the agreement. The Company intends to renew the letter of credit for as long as the Company does business with the beneficiary insurance carrier. The letter is collateralized by restricted cash of the same amount on any outstanding drawings. To date, no amounts have been drawn under the letter of credit.\nOn August 28, 2020, the Company entered into a three year operating lease for property related to the manufacturing and warehousing of the Blaw-Knox paver business. The lease term is for the period September 1, 2020 through August 31, 2023. On October 9, 2020, the Company entered into an operating lease for additional warehousing space for paver inventory. The lease term is for one year beginning November 2020 with automatic one-year renewals.\nOff-Balance Sheet Arrangements\nNone ITEM 7A QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable.\nP3YP4Y ITEM 8\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO FINANCIAL STATEMENTS AND FINANCIAL STATEMENT SCHEDULES\nGENCOR\nINDUSTRIES\n, INC\n.\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended September 30, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the years ended September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended September 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nAll other schedules are omitted because they are not applicable or the required information is shown in the consolidated financial statements or notes thereto.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of Gencor Industries, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Gencor Industries, Inc. (the Company) as of September 30, 2022 and 2021, and the related consolidated statements of operations, shareholders equity, and cash flows for each of the years ended September 30, 2022 and 2021, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years ended September 30, 2022 and 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nAllowance for Slow-moving and Obsolete Inventories\nAs disclosed in Note 1 of the notes to the Companys consolidated financial statements, the Company records an estimated allowance for slow-moving and obsolete inventories to state the Companys inventories at the lower of cost or net realizable value. The Company relies on, among other things, past usage, sales experience, recent order and quote activity, possible alternative uses, future sales forecasts, and its strategic business plan to develop the estimate. As a result of managements assessment, the Company recorded an allowance for slow-moving and obsolete inventories of approximately $8,192,000 as of September 30, 2022.\nAuditing managements estimate of the allowance for slow-moving and obsolete inventories involved subjective evaluation and high degree of auditor judgement due to significant assumptions involved in estimating future inventory turnover and sales.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. We obtained an understanding of the design of internal controls that address the risks of material misstatement relating to recording inventory at the lower of cost or net realizable value. We tested the accuracy and completeness of the underlying data used in calculating the inventory allowance, including testing of a sample of inventory usage transactions, and recomputed the allowance calculation. We also evaluated the Companys ability to accurately estimate the assumptions used to develop the estimate by comparing historical allowance amounts to the history of actual inventory write-offs. Furthermore, we reviewed managements business plan and forecasts of future sales.\nRevenue from Contracts with Customers where Revenue is Recognized over Time\nAs disclosed in Note 1 of the notes to the Companys consolidated financial statements, the Company recognizes revenues from contracts with customers for the design, manufacture and sale of custom equipment over time when the performance obligation is satisfied by transferring control of the equipment. Control of the equipment transfers over time, as the equipment is unique to the specific contract and thus does not create an asset with an alternative use to the Company. Revenues and costs are recognized in proportion to actual labor costs incurred, as compared with total estimated labor costs expected to be incurred, during the entire contract. Changes to total estimated contract costs or losses, if any, are recognized in the period in which they are determined. The Company recorded approximately $37,572,000 in revenue from custom equipment sales contracts during the year ended September 30, 2022.\nAuditing managements estimate of total estimated labor costs expected to be incurred for the entire contract with respect to incomplete contracts, and the percentage of completion on those contracts as of the end of the year involved subjective evaluation and high degree of auditor judgement due to significant assumptions involved in estimating total labor costs to complete.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. We obtained an understanding of the design of internal controls that address the risks of material misstatement relating to recording revenue from contracts with customers where revenue is recognized over time. We tested the accuracy and completeness of the underlying data used in calculating the percentage of completion on incomplete contracts, including review of contracts, change orders, and underlying labor and material costs, and recomputed the percentage of completion on individual contracts. We also evaluated the Companys ability to accurately estimate the assumptions used to develop the estimate by comparing historical cost estimates to actual costs on completed contracts.\nWe have served as the Companys auditor since 2001.\n/s/ MSL, P.A.\nMSL, P.A.\nCertified Public Accountants\nPCAOB ID Number: 569\nOrlando, Florida\nDecember 16, 2022\nPart I. Financial Information\nGENCOR INDUSTRIES, INC.\nConsolidated Balance Sheets\nAs of September 30, 2022 and 2021\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 9,581,000\n$ 23,232,000\nMarketable securities at fair value (cost of $94,879,000 at September 30, 2022 and $93,690,000 at September 30, 2021)\n89,300,000\n94,976,000\nAccounts receivable, less allowance for doubtful accounts of $370,000 at September 30, 2022 and $321,000 at September 30, 2021\n2,996,000\n2,622,000\nCosts and estimated earnings in excess of billings\n2,118,000\n1,903,000\nInventories, net\n55,815,000\n41,888,000\nPrepaid expenses\n2,669,000\n2,202,000\nTotal current assets\n162,479,000\n166,823,000\nProperty and equipment, net\n13,491,000\n11,801,000\nDeferred and other income taxes\n2,893,000\n-\nOther long-term assets\n450,000\n838,000\nTotal Assets\n$ 179,313,000\n$ 179,462,000\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable\n$ 4,251,000\n$ 3,105,000\nCustomer deposits\n5,864,000\n5,244,000\nAccrued expenses\n1,885,000\n2,645,000\nCurrent operating lease liabilities\n390,000\n393,000\nTotal current liabilities\n12,390,000\n11,387,000\nDeferred and other income taxes\n-\n394,000\nNon-current\noperating lease liabilities\n6,000\n392,000\nTotal liabilities\n12,396,000\n12,173,000\nCommitments and contingencies\nShareholders equity:\nPreferred stock, par value $.10 per share; 300,000 shares authorized; none\nissued\n-\n-\nCommon stock, par value $.10 per share; 15,000,000 shares authorized; 12,338,845 shares issued and outstanding at September 30, 2022 and 2021\n1,234,000\n1,234,000\nClass B Stock, par value $.10 per share; 6,000,000 shares authorized; 2,318,857 shares issued and outstanding at September 30, 2022 and 2021\n232,000\n232,000\nCapital in excess of par value\n12,590,000\n12,590,000\nRetained earnings\n152,861,000\n153,233,000\nTotal shareholders equity\n166,917,000\n167,289,000\nTotal Liabilities and Shareholders Equity\n$ 179,313,000\n$ 179,462,000\nSee accompanying Notes to Consolidated Financial Statements\nGENCOR INDUSTRIES, INC.\nConsolidated Statements of Operations\nFor the Years Ended September 30, 2022 and 2021\nNet revenue\n$ 103,479,000\n$ 85,278,000\nCost of goods sold\n82,935,000\n67,100,000\nGross profit\n20,544,000\n18,178,000\nOperating expenses:\nProduct engineering and development\n4,325,000\n4,278,000\nSelling, general and administrative\n12,052,000\n13,199,000\nTotal operating expenses\n16,377,000\n17,477,000\nOperating income\n4,167,000\n701,000\nOther income (expense), net:\nInterest and dividend income, net of fees\n1,305,000\n1,762,000\nRealized and unrealized gains (losses) on marketable securities, net\n(7,009,000 )\n4,171,000\nOther\n(156,000 )\n-\n(5,860,000 )\n5,933,000\nIncome (loss) before income tax expense (benefit)\n(1,693,000 )\n6,634,000\nIncome tax expense (benefit)\n(1,321,000 )\n829,000\nNet income (loss)\n$ (372,000 )\n$ 5,805,000\nBasic earnings (loss) per common share\n$ (0.03 )\n$ 0.40\nDiluted earnings (loss) per common share\n$ (0.03 )\n$ 0.39\nSee accompanying Notes to Consolidated Financial Statements\nGENCOR INDUSTRIES, INC.\nConsolidated Statements of Shareholders Equity\nFor the Years Ended September 30, 2022 and 2021\nCommon Stock\nClass B Stock\nCapital in\nExcess of\nRetained\nTotal\nShareholders\nShares\nAmount\nShares\nAmount\nPar Value\nEarnings\nEquity\nSeptember 30, 2020\n12,287,337\n$ 1,229,000\n2,318,857\n$ 232,000\n$ 12,331,000\n$ 147,428,000\n$ 161,220,000\nNet income\n-\n-\n-\n-\n-\n5,805,000\n5,805,000\nStock options exercised\n51,508\n5,000\n-\n-\n259,000\n-\n264,000\nSeptember 30, 2021\n12,338,845\n$ 1,234,000\n2,318,857\n$ 232,000\n$ 12,590,000\n$ 153,233,000\n$ 167,289,000\nNet loss\n-\n-\n-\n-\n-\n(372,000 )\n(372,000 )\nSeptember 30, 2022\n12,338,845\n$ 1,234,000\n2,318,857\n$ 232,000\n$ 12,590,000\n$ 152,861,000\n$ 166,917,000\nSee accompanying Notes to Consolidated Financial Statements\nGENCOR INDUSTRIES, INC.\nConsolidated Statements of Cash Flows\nFor the Years Ended September 30, 2022 and 2021\nCash flows from operating activities:\nNet income (loss)\n$ (372,000 )\n$ 5,805,000\nAdjustments to reconcile net income (loss) to cash (used in) provided by operating activities:\nPurchase of marketable securities\n(135,551,000 )\n(136,651,000 )\nProceeds from sale and maturity of marketable securities\n133,966,000\n134,866,000\nChange in value of marketable securities\n7,261,000\n(3,693,000 )\nDeferred and other income taxes\n(3,287,000 )\n(451,000 )\nDepreciation and amortization\n2,823,000\n2,591,000\nProvision for doubtful accounts\n194,000\n50,000\nChanges in assets and liabilities, excluding the initial effects of business combinations:\nAccounts receivable\n(568,000 )\n(680,000 )\nCosts and estimated earnings in excess of billings\n(215,000 )\n4,502,000\nInventories\n(13,927,000 )\n(4,413,000 )\nPrepaid expenses\n(467,000 )\n(1,013,000 )\nAccounts payable\n1,146,000\n1,377,000\nCustomer deposits\n620,000\n1,391,000\nAccrued expenses and other\n(758,000 )\n139,000\nTotal adjustments\n(8,763,000 )\n(1,985,000 )\nCash flows (used in) provided by operating activities\n(9,135,000 )\n3,820,000\nCash flows used in investing activities:\nAcquisition of Blaw-Knox assets\n-\n(13,777,000 )\nCapital expenditures\n(4,516,000 )\n(2,659,000 )\nCash flows used in investing activities\n(4,516,000 )\n(16,436,000 )\nCash flows from financing activities:\nProceeds from stock option exercises\n-\n264,000\nCash flows provided by financing activities\n-\n264,000\nNet decrease in cash and cash equivalents\n(13,651,000 )\n(12,352,000 )\nCash and cash equivalents at:\nBeginning of year\n23,232,000\n35,584,000\nEnd of year\n$ 9,581,000\n$ 23,232,000\nNon-cash\ninvesting and financing activities:\nOperating lease right-of-use\nassets\n$ -\n$ 248,000\nOperating lease liabilities\n$ -\n$ 248,000\nSee accompanying Notes to Consolidated Financial Statements\nGENCOR INDUSTRIES, INC.\nNotes to Consolidated Financial Statements\nFor the Years Ended September 30, 2022 and 2021\nNOTE 1 - NATURE OF OPERATIONS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nGencor Industries, Inc. and its subsidiaries (collectively, the Company) is a diversified, heavy machinery manufacturer for the production of highway construction materials and environmental control machinery and equipment. The Companys core products include asphalt plants, combustion systems, fluid heat transfer systems and asphalt pavers. The Companys products are manufactured at three facilities in the United States.\nThese consolidated financial statements include the accounts of Gencor Industries, Inc. and its subsidiaries. All significant intercompany accounts and transactions have been eliminated in consolidation.\nOn October 1, 2020, the Company acquired the Blaw-Knox paver line and associated assets, including inventory, fixed assets and related intellectual property, from Volvo CE. The acquisition provided the Company entry into the asphalt paver sector of the asphalt industry. The acquisition was accounted for as a business combination under ASC 805, Business Combinations. The initial purchase price of approximately $14.4 million, which was subject to post-closing adjustments, was funded by cash on hand. After post-closing adjustments transacted during quarter ended March 31, 2021, the final purchase price was $13.8 million, including $10.4 million in inventory and $3.4 million in fixed assets. There were no liabilities assumed. The accompanying consolidated financial statements as of September 30, 2022 and September 30, 2021, and for the years then ended, include the assets, liabilities and operating results of the paver line.\nAccounting Pronouncements and Policies\nIn August 2018, the FASB issued ASU 2018-13,\nFair Value Measurement - Disclosure Framework (Topic 820) (ASU 2018-13).\nThe updated guidance improves the disclosure requirements on fair value measurements, including, among other things, addition of certain disclosures related to level 3 fair value measurements, and removal of disclosure requirements for (i) the amount and reasons for transfers between level 1 and level 2 of the fair value hierarchy, and (ii) policy and timing of transfers between fair value hierarchy levels. The updated guidance is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2019. The Company adopted ASU 2018-13\nin the first quarter of fiscal 2021. The application of this guidance did not have a material effect on our disclosures.\nNo other accounting pronouncements recently issued or newly effective have had, or are expected to have, a material impact on the Companys consolidated financial statements.\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nEarnings per Share\nThe consolidated financial statements include basic and diluted earnings (loss) per share (EPS) information. Basic EPS is based on the weighted-average number of shares outstanding. Diluted EPS is based on the sum of the weighted-average number of shares outstanding plus common stock equivalents.\nThere were no weighted-average shares issuable upon the exercise of stock options included in the diluted EPS calculation at September 30, 2022. For the year ended September 30, 2021, the weighted-average shares issuable upon the exercise of stock options included in the diluted EPS calculation were 236,000, which equates to 116,000 dilutive common stock equivalents. Weighted-average shares issuable upon the exercise of stock options, which were not included in the diluted EPS calculation because they were anti-dilutive, were zero in 2022 and 2021.\nThe following presents the calculation of the basic and diluted EPS for the years ended September 30, 2022 and 2021:\nNet Loss\nShares\nEPS\nNet Income\nShares\nEPS\nBasic EPS\n$ (372,000 )\n14,658,000\n$ (0.03 )\n$ 5,805,000\n14,614,000\n$ 0.40\nCommon stock equivalents\n-\n116,000\nDiluted EPS\n$ (372,000 )\n14,658,000\n$ (0.03 )\n$ 5,805,000\n14,730,000\n$ 0.39\nCash Equivalents\nCash equivalents consist of short-term certificates of deposit and deposits in money market accounts with original maturities of three months or less.\nMarketable Securities and Fair Value Measurements\nMarketable debt and equity securities are categorized as trading securities and are thus marked to market and stated at fair value. Fair value is determined using the quoted closing or latest bid prices for Level 1 investments and market standard valuation methodologies for Level 2 investments. Realized gains and losses on investment transactions are determined by specific identification and are recognized as incurred in the consolidated statements of operations. Net changes in unrealized gains and losses are reported in the consolidated statements of operations in the current period.\nFair Value Measurements\nThe fair value of financial instruments is presented based upon a hierarchy of levels that prioritizes the inputs of valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements). A financial instruments level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement.\nThe fair value of marketable equity securities (stocks), mutual funds, exchange-traded funds, government securities, and cash and money funds, are substantially based on quoted market prices (Level 1). Corporate bonds are valued using market standard valuation methodologies, including: discounted cash flow methodologies, and matrix pricing or other similar techniques. The inputs to these market standard valuation methodologies include, but are not limited to: interest rates, credit standing of the issuer or counterparty, industry sector of the issuer, coupon rate, call provisions, maturity, estimated duration and assumptions regarding liquidity and estimated future cash flows. In addition to bond characteristics, the valuation methodologies incorporate market data, such as actual trades completed, bids and actual dealer quotes, where such information is available. Accordingly, the estimated fair values are based on available market information and judgments about financial instruments (Level 2). Fair values of the Level 2 investments are provided by the Companys professional investment management firms. From time to time the Company may transfer cash between its marketable securities portfolio and operating cash and cash equivalents.\nThe following table sets forth by level, within the fair value hierarchy, the Companys assets measured at fair value as of September 30, 2022:\nFair Value Measurements\nLevel 1\nLevel 2\nLevel 3\nTotal\nEquities\n$ 12,149,000\n$ -\n$ -\n$ 12,149,000\nMutual Funds\n5,337,000\n-\n-\n5,337,000\nExchange-Traded Funds\n4,794,000\n-\n-\n4,794,000\nCorporate Bonds\n-\n37,339,000\n-\n37,339,000\nGovernment Securities\n29,327,000\n-\n-\n29,327,000\nCash and Money Funds\n354,000\n-\n-\n354,000\nTotal\n$ 51,961,000\n$ 37,339,000\n$ -\n$ 89,300,000\nNet unrealized losses reported during fiscal 2022 on trading securities still held as of September 30, 2022, were $(6,864,000). There were no transfers of investments between Level 1 and Level 2 during the year ended September 30, 2022.\nThe following table sets forth by level, within the fair value hierarchy, the Companys assets measured at fair value as of September 30, 2021:\nFair Value Measurements\nLevel 1\nLevel 2\nLevel 3\nTotal\nEquities\n$ 14,734,000\n$ -\n$ -\n$ 14,734,000\nMutual Funds\n10,357,000\n-\n-\n10,357,000\nExchange-Traded Funds\n9,458,000\n-\n-\n9,458,000\nCorporate Bonds\n-\n24,853,000\n-\n24,853,000\nGovernment Securities\n30,999,000\n-\n-\n30,999,000\nCash and Money Funds\n4,575,000\n-\n-\n4,575,000\nTotal\n$ 70,123,000\n$ 24,853,000\n$ -\n$ 94,976,000\nNet unrealized gains reported during fiscal 2021 on trading securities still held as of September 30, 2021, were $1,302,000. There were no transfers of investments between Level 1 and Level 2 during the year ended September 30, 2021.\nThe carrying amounts of cash and cash equivalents, accounts receivable, accounts payable, customer deposits and accrued expenses approximate fair value because of the short-term nature of these items.\nForeign Currency Transactions\nGains and losses resulting from foreign currency transactions are included in income and were not significant during the years ended September 30, 2022 and 2021.\nRisk Management\nFinancial instruments that potentially subject the Company to concentrations of credit risk primarily consist of cash and cash equivalents, marketable securities, and accounts receivable. The Company maintains its cash accounts in various domestic financial institutions which may from time to time exceed federally insured limits. Operating cash is retained in overnight sweep accounts which allow for offsets to treasury service charges. The marketable securities include investments in cash and money funds, mutual funds, exchange traded funds (ETFs), corporate bonds, government securities and stocks through professional investment management firms. Investment securities are exposed to various risks, such as interest rate, market and credit risks.\nThe Companys customers are not concentrated in any specific geographic region, but are concentrated in the road and highway construction industry. The Company extends limited credit on parts sales to its customers based upon their credit-worthiness. Generally, the Company requires a significant up-front\ndeposit before beginning manufacturing on complete asphalt plant and component orders, and requires full payment subject to hold-back provisions prior to shipment. The Company establishes an allowance for doubtful accounts based upon the credit risk of specific customers, historical trends and other pertinent information.\nInventories\nInventories are valued at the lower of cost or net realizable value, with cost being determined under the FIFO method and net realizable value defined as the estimated selling price of goods less reasonable costs of completion and delivery. Appropriate consideration is given to obsolescence, excessive levels, deterioration, possible alternative uses and other factors in determining net realizable value. The cost of work in process and finished goods includes materials, direct labor, variable costs and overhead. The Company evaluates the need to record inventory adjustments on all inventories, including raw material, work in process, finished goods, spare parts and used equipment. Used equipment acquired by the Company on trade-in\nfrom customers is carried at estimated net realizable value. Unless\nspecific circumstances warrant different treatment regarding inventory obsolescence, an allowance is established to reduce the cost basis of inventories three to four years old by 50%, the cost basis of inventories four to five years old by 75%, and the cost basis of inventories greater than five years old to zero. Inventory is typically reviewed for obsolescence on an annual basis computed as of September 30, the Companys fiscal year end. If significant known changes in trends, technology or other specific circumstances that warrant consideration occur during the year, then the impact on obsolescence is considered at that time.\nChanges in the allowance for slow-moving and obsolete inventories are as follows:\nBalance, beginning of year\n$ 5,397,000\n$ 4,617,000\nCharged to cost of sales\n2,966,000\n1,355,000\nDisposal of inventory, net of recoveries\n(171,000 )\n(575,000 )\nBalance, end of year\n$ 8,192,000\n$ 5,397,000\nProperty and Equipment\nProperty and equipment are stated at cost (see Note 4). Depreciation of property and equipment is computed using the straight-line method over the estimated useful lives of the related assets, as follows:\nYears\nLand improvements\nBuildings & improvements\n6-40\nEquipment\n2-10\nImpairments\nProperty and equipment, and intangible assets subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset (or asset group) may not be recoverable. An impairment loss would be recognized when the carrying amount of an asset exceeds the estimated undiscounted cash flows expected to result from the use of the asset and its eventual disposition. The amount of the impairment loss to be recorded is calculated by the excess of the assets carrying value over its fair value. Fair value is generally determined using a discounted cash flow analysis. No such impairment losses were recorded during the years ended September 30, 2022 and 2021.\nRevenues and Expenses\nThe Company accounts for revenues and related expenses under the provisions of ASU No. 2014-09.\nThe following table disaggregates the Companys net revenue by major source for the years ended September 30, 2022 and 2021:\nEquipment sales recognized over time\n$ 37,572,000\n$ 24,093,000\nEquipment sales recognized at a point in time\n36,898,000\n36,671,000\nParts and component sales\n23,856,000\n21,017,000\nFreight revenue\n4,709,000\n3,497,000\nOther\n444,000\n-\nNet revenue\n$ 103,479,000\n$ 85,278,000\nRevenues from contracts with customers for the design, manufacture and sale of custom equipment are recognized over time when the performance obligation is satisfied by transferring control of the equipment. Control of the equipment transfers over time, as the equipment is unique to the specific contract and thus does not create an asset with an alternative use to the Company. Revenues and costs are recognized in proportion to actual labor costs incurred, as compared with total estimated labor costs expected to be incurred, during the entire contract. All incremental costs related to obtaining a contract are expensed as incurred, as the amortization period is less than one year. Changes to total estimated contract costs or losses, if any, are recognized in the period in which they are determined.\nContract assets (excluding accounts receivable) under contracts with customers represent revenue recognized in excess of amounts billed on equipment sales recognized over time. These contract assets were $2,118,000 and $1,903,000 at September 30, 2022 and 2021, respectively, and are included in current assets as costs and estimated earnings in excess of billings on the Companys consolidated balance sheets. The Company anticipates that all of the contract assets at September 30, 2022, will be billed and collected within one year.\nRevenues from all other contracts for the design and manufacture of equipment, for service and for parts sales, net of any discounts and return allowances, are recorded at a point in time when control of the goods or services has been transferred. Control of the goods or service typically transfers at time of shipment or upon completion of the service.\nPayment for equipment under contract with customers is typically due prior to shipment. Payment for services under contract with customers is due as services are completed. Accounts receivable related to contracts with customers for equipment sales were $142,000 and $210,000 at September 30, 2022 and September 30, 2021, respectively.\nProduct warranty costs are estimated using historical experience and known issues and are charged to production costs as revenue is recognized.\nChanges in the accrual for warranty and related costs are composed of the following:\nBalance, beginning of year\n$ 291,000\n$ 299,000\nWarranties issued\n110,000\n280,000\nWarranties settled\n(157,000 )\n(288,000 )\nBalance, end of year\n$ 244,000\n$ 291,000\nProvisions for estimated returns and allowances, and other adjustments are provided for in the same period the related sales are recorded. Returns and allowances, which reduce product revenue, are estimated using historical experience.\nUnder certain contracts with customers, recognition of a portion of the consideration received may be deferred and recorded as a contract liability if the Company has to satisfy a future obligation, such as to provide installation assistance. There were no contract liabilities other than customer deposits at September 30, 2022 and September 30, 2021. Customer deposits related to contracts with customers were $5,864,000 and $5,244,000 at September 30, 2022 and 2021, respectively, and are included in current liabilities on the Companys consolidated balance sheets.\nThe Company records revenues earned for shipping and handling as freight revenue at the time of shipment, regardless of whether or not it is identified as a separate performance obligation. The cost of shipping and handling is classified as production costs concurrently with the revenue recognition.\nAll product engineering and development costs, and selling, general and administrative expenses are charged to operations as incurred. Provision is made for any anticipated contract losses in the period that the loss becomes evident.\nThe allowance for doubtful accounts is determined by performing a specific review of all account balances greater than 90 days past due and other higher risk amounts to determine collectability, and also adjusting for any known customer payment issues with account balances in the less-than-90-day\npast due aging category. Account balances are charged off against the allowance for doubtful accounts when they are determined to be uncollectible. Any recoveries of account balances previously considered in the allowance for doubtful accounts reduce future additions to the allowance for doubtful accounts. The allowance for doubtful accounts also includes an estimate for returns and allowances. Provisions for estimated returns and allowances and other adjustments, are provided for in the same period the related sales are recorded. Returns and allowances, which reduce product revenue, are estimated using known issues and historical experience.\nChanges in the allowance for doubtful accou\nnts are composed of the following:\nBalance, beginning of year\n$ 321,000\n$ 442,000\nProvision for doubtful accounts\n194,000\n50,000\nProvision for estimated returns and allowances\n267,000\n175,000\nUncollectible accounts written off\n(81,000 )\n(60,000 )\nReturns and allowances issued\n(331,000 )\n(286,000 )\nBalance, end of year\n$ 370,000\n$ 321,000\nShipping and Handling Costs\nShipping and handling costs are included in production costs in the consolidated statements of operations.\nIncome Taxes\nIncome taxes are provided for the tax effects of transactions reported in the consolidated financial statements and primarily consist of taxes currently due, plus deferred taxes (see Note 6 - Income Taxes).\nThe Company recognizes deferred tax liabilities and assets for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns using current tax rates. The Company and its domestic subsidiaries file a consolidated federal income tax return.\nDeferred tax assets and liabilities are measured using the rates expected to apply to taxable income in the years in which the temporary differences are expected to reverse and the credits are expected to be used. The effect on deferred tax assets and liabilities of the change in tax rates is recognized in income in the period that includes the enactment date. All available evidence, both positive and negative, is considered to determine whether, based on the weight of that evidence, the Company is more likely than not to realize the benefit of a deferred tax asset and whether a valuation allowance is needed for some portion or all of a deferred tax asset. No such valuation allowances were recorded as of September 30, 2022 and 2021.\nThe Companys income tax provision is based on managements estimate of the effective tax rate for the full year. The tax provision in any period will be affected by, among other things, permanent, as well as temporary differences in the deductibility of certain items, in addition to changes in tax legislation. As a result, the Company may experience significant fluctuations in the effective book tax rate (that is, its tax expense divided by pre-tax\nbook income) from period to period. The Companys effective tax rates for fiscal 2022 and 2021 reflect the impact of the reduced rates under the U.S. Tax Cuts and Jobs Act (the Tax Reform Act) which was signed into law on December 22, 2017.\nComprehensive Income\nFor the years ended September 30, 2022 and 2021, other comprehensive income is equal to net income.\nReporting Segments and Geographic Areas\nThe Company has one reporting segment, equipment for the highway construction industry. Based on evaluation of the criteria of ASC 280 - Segment Reporting, including the nature of products and services, the nature of the production processes, the type of customers and the methods used to distribute products and services, the Company determined that its operating segments meet the requirements for aggregation. The Company designs, manufactures and sells asphalt plants and pavers, combustion systems and fluid heat transfer systems, for the highway construction industry and environmental and petrochemical markets. The Companys products are manufactured at three facilities in the United States. The Company also services and sells spare parts for its equipment.\nFor fiscal 2022 and 2021, total revenues of $103,479,000 and $85,278,000, and total long-term assets of $16,834,000 and $12,639,000, respectively, were attributed to the United States. Revenues are attributed to geographic areas based on the location of the assets producing the revenues.\nCustomers with 10% (or greater) of Net Revenues\nNo customer accounted for 10% or more of fiscal 2022 or 2021 net revenues.\nSubsequent Events\nManagement has evaluated events occurring from September 30, 2022 through the date these consolidated financial statements were filed with the Securities and Exchange Commission for proper recording and disclosure herein.\nNOTE 2 - INVENTORIES\nInventories are valued at the lower of cost or net realizable value.\nNet inventories consist of the following:\nSeptember 30,\nRaw materials\n$ 31,975,000\n$ 25,858,000\nWork in process\n13,903,000\n6,280,000\nFinished goods\n9,937,000\n9,730,000\nUsed equipment\n-\n20,000\nInventories, net\n$ 55,815,000\n$ 41,888,000\nSlow-moving and obsolete inventory reserves were $8,192,000 and $5,397,000 at September 30, 2022 and 2021, respectively.\nNOTE 3 - COSTS AND ESTIMATED EARNINGS IN EXCESS OF BILLINGS\nCosts and estimated earnings in excess of billings on uncompleted contracts as of September 30, 2022 and 2021 consisted of the following:\nSeptember 30,\nCosts incurred on uncompleted contracts\n$ 12,660,000\n$ 11,483,000\nEstimated earnings\n4,780,000\n4,395,000\n17,440,000\n15,878,000\nBillings to date\n15,322,000\n13,975,000\nCosts and estimated earnings in excess of billings\n$ 2,118,000\n$ 1,903,000\nNOTE 4 - PROPERTY AND EQUIPMENT\nProperty and equipment consist of the following as of September 30, 2022 and 2021:\nSeptember 30,\nLand and improvements\n$ 3,329,000\n$ 3,329,000\nBuildings and improvements\n13,578,000\n13,830,000\nEquipment\n26,521,000\n21,765,000\n43,428,000\n38,924,000\nLess: Accumulated depreciation and amortization\n(29,937,000 )\n(27,123,000 )\nProperty and equipment, net\n$ 13,491,000\n$ 11,801,000\nProperty and equipment includes approximately $20,467,000 and $19,374,000\nof fully depreciated assets, which remained in service during fiscal 2022 and 2021, respectively. Included in equipment as of September 30, 2022 and 2021 is approximately $1,702,000 and $458,000, respectively, of assets not yet placed in operation and, therefore, not subject to depreciation during the years ended September 30, 2022 and 2021, respectively.\nNOTE 5 - ACCRUED EXPENSES\nAccrued expenses consist of the following as of September 30, 2022 and 2021:\nSeptember 30,\nPayroll and related accruals\n$ 1,083,000\n$ 1,735,000\nWarranty and related accruals\n244,000\n291,000\nProperty tax accruals\n233,000\n223,000\nIncome tax accruals\n-\n224,000\nProfessional fees\n243,000\n105,000\nOther\n82,000\n67,000\nAccrued expenses\n$ 1,885,000\n$ 2,645,000\nNOTE 6 - INCOME TAXES\nThe provision for income tax expense (benefit) consists of:\nYear Ended September 30,\nCurrent:\nFederal\n$ 1,680,000\n$ 992,000\nState\n317,000\n189,000\nTotal current\n1,997,000\n1,181,000\nDeferred:\nFederal\n(2,701,000 )\n(269,000 )\nState\n(617,000 )\n(83,000 )\nTotal deferred\n(3,318,000 )\n(352,000 )\nIncome tax expense\n(benefit)\n$ (1,321,000 )\n$ 829,000\nA reconciliation of the federal statutory tax rate to the total tax provision (benefit) is as follows:\nYear Ended September 30,\nFederal income taxes computed at the statutory rate\n(21.0\n%)\n21.0 %\nState income taxes, net of federal benefit\n(11.8\n%)\n1.6 %\nResearch & development tax refunds & credits\n(28.8\n%)\n(5.1 %)\nDividend received deduction\n(6.4\n%)\n(1.9 %)\nOther, net\n(10.0\n%)\n(3.1 %)\nEffective income tax rate\n(78.0\n%)\n12.5 %\nDeferred income tax assets and liabilities consist of the following:\nSeptember 30,\nDeferred Tax Assets:\nAccrued liabilities and reserves\n$ 155,000\n$\n276,000\nAllowance for doubtful accounts\n83,000\n72,000\nInventory\n3,197,000\n1,783,000\nStock-based compensation\n-\n79,000\nUnrealized loss on investments\n1,272,000\n-\nNet operating losses carryforwards\n352,000\n20,000\nGross Deferred Income Tax Assets\n5,059,000\n2,230,000\nDeferred and Other Tax Liabilities:\nDomestic international sales corporation\n(136,000\n)\n(236,000 )\nProperty and equipment\n(1,868,000 )\n(1,943,000 )\nUnrealized gain on investments\n-\n(295,000 )\nUnrecognized tax benefits\n(131,000 )\n(150,000 )\nGross Deferred and Other Income Tax Liabilities\n(2,135,000 )\n(2,624,000 )\nNet Deferred and Other Income Tax Assets (Liabilities)\n$ 2,924,000\n$\n(394,000 )\nTotal income taxes paid in fiscal 2022 and 2021 were $2,839,000 and $1,963,000, respectively.\nGAAP prescribes a comprehensive model for the financial recognition, measurement, classification, and disclosure of\nuncertain tax positions. GAAP contains a two-step\napproach to recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, based on the technical merits of the position. The second step is to measure the tax benefit as the largest amount that is more than 50% likely of being realized upon settlement.\nSignificant judgment is required in evaluating the Companys uncertain tax position and determining the Companys provision for taxes. Although the Company believes the reserves of unrecognized tax benefits (UTBs) are reasonable, no assurance can be given that the final outcome of these matters will not be different from that which is reflected in the Companys historical income tax provision and accruals. The Company adjusts these reserves in light of changing facts and circumstances. As of September 30, 2022 and 2021, the Company had UTBs of $\n131,000 and $\n150,000, respectively. In the fiscal year ended September 30, 2022, the Company used all $150,000 of accrued UTBs and accrued an additional $131,000 of UTBs.\nThere were no\nadditional accruals of UTBs during the fiscal year ended September 30, 2021.\nThe Company recognizes interest and penalties accrued related to UTBs as a component of income tax expense. There were no additional accruals of interest expense nor penalties of significance during fiscal years ended September 30, 2022 and 2021. It is reasonably possible that the amount of the UTBs with respect to certain unrecognized tax positions will increase or decrease during the next 12 months. The Company does not expect the change to have a material effect on its results of operations or its financial position. The only expected potential reason for change would be the ultimate results stemming from any examinations by taxing authorities. If recognized, the entire amount of UTBs would have an impact on the Companys effective income tax rate.\nThe effective income tax rate for fiscal 2022 was a benefit of (\n78.0%)\nversus expense of 12.5% in fiscal 2021.\nIn fiscal 2022, the Company generated $475,000 of federal research and development tax credits (R&D Credits), all of which were used in fiscal 2022. In fiscal 2021, the Company generated $335,000 of R&D Credits, all of which were used in fiscal 2021. There were no R&D Credits carryforwards as of September\n30, 2022 or September\n30, 2021.\nThe Company files U.S. federal income tax returns, as well as Florida and Iowa income tax returns. The Companys U.S. federal income tax returns filed for tax years prior to fiscal year ended September 30, 2019 are generally no longer subject to examination by taxing authorities due to the expiration of the statute of limitations.\nNOTE 7 - RETIREMENT BENEFITS\nThe Company has a voluntary 401(k) employee benefit plan, which covers all eligible, domestic employees. The Company makes discretionary matching contributions subject to a maximum level, in accordance with the terms of the plan. The Company charged approximately $425,000 and $365,000 to expense under the provisions of the plan during the years ended September 30, 2022 and 2021, respectively.\nNOTE 8 - LONG-TERM DEBT AND ARRANGEMENTS WITH FINANCIAL INSTITUTIONS\nThe Company had no long-term debt outstanding at September 30, 2022 or 2021. The Company does not currently require a credit facility.\nAs of September 30, 2022, total cash deposits with insurance companies covering collateral needs were $85,000.\nIn April 2020, a financial institution issued an irrevocable standby letter of credit (letter of credit) on behalf of the Company for the benefit of one of the Companys insurance carriers. The maximum amount that can be drawn by the beneficiary under the letter of credit is $150,000. The letter of credit expires in April 2023, unless terminated earlier, and can be extended, as provided by the agreement. The Company intends to renew the letter of credit for as long as the Company does business with the beneficiary insurance carrier. The letter is collateralized by restricted cash of the same amount on any outstanding drawings. To date, no amounts have been drawn under the letter of credit.\nNOTE 9 - LEASES\nThe Company leases certain equipment under non-cancelable\noperating leases. Future minimum rental payments under these leases at September 30, 2022 are immaterial. Total rental expense for the fiscal years ended September 30, 2022 and 2021 was $57,000 and $78,000, respectively.\nOn August 28, 2020, the Company entered into a three-year operating lease for property related to the manufacturing and warehousing of the Blaw-Knox assets. The lease term is for the period beginning on September 1, 2020 through August 31, 2023. In accordance with ASU 2016-02,\nthe Company recorded a ROU asset totaling $970,000 and related lease liabilities at inception. On October 9, 2020, the Company entered into an operating lease for additional warehousing space for paver inventory. The lease term is for one year beginning November 2020 with automatic one-year\nrenewals. In accordance with ASU 2016-02,\nthe Company recorded a ROU asset totaling $254,000 and related lease liabilities at inception.\nFor the year ended September 30, 2022, operating lease costs were $425,000 and cash payments related to these operating leases were $396,000. For the year ended September 30, 2021, operating lease costs were $440,000 and cash payments related to these operating leases were $468,000.\nOther information concerning the Companys operating lease accounted for under ASC 842 guidelines as of September 30, 2022 and September 30, 2021, is as follows:\nSeptember 30, 2022\nSeptember 30, 2021\nOperating lease ROU asset included in other long-term assets\n$ 396,000\n$ 785,000\nCurrent operating lease liability\n390,000\n393,000\nNon-current\noperating lease liability\n6,000\n392,000\nWeighted average remaining lease term (in years)\n1.00\n2.00\nWeighted average discount rate used in calculating ROU asset\n4.0 %\n4.0 %\nFuture annual minimum lease payments as of September 30, 2022 are as follows:\nFiscal Year\nAnnual Lease Payments\n$ 398,000\n6,000\nTotal\n404,000\nLess interest\n(8,000 )\nPresent value of lease liabilities\n$ 396,000\nNOTE 10 - COMMITMENTS AND CONTINGENCIES\nLitigation\nThe Company is involved in legal proceedings arising out of the normal course of business, none of which we believe will have a material adverse effect on our business, financial condition or results of operations. Claims made in the ordinary course of business may be covered in whole or in part by insurance.\nCOVID-19\nPandemic\nThe Company continues to monitor and evaluate the risks to public health and the slowdown in overall business activity related to the novel coronavirus (COVID-19)\npandemic, including impacts on its employees, customers, suppliers and financial results. As of the date of issuance of these Consolidated Financial Statements, the Companys operations have not been significantly impacted. However, the full impact of the COVID-19\npandemic continues to evolve subsequent to the quarter and year ended September 30, 2022 and as of the date these Consolidated Financial Statements are issued. As such, the full magnitude that the COVID-19\npandemic will have on the Companys financial condition and future results of operations is uncertain. Management continues to monitor the Companys financial condition, operations, suppliers, industry, customers, and workforce. If the spread of COVID-19\ncontinues, the Companys ability to meet customer demands for products may be impacted or its customers may experience adverse business consequences due to COVID-19.\nReduced demand for products or ability to meet customer demand (including as a result of disruptions at the Companys suppliers) could have a material adverse effect on its business operations and financial performance.\nNOTE 11 - SHAREHOLDERS EQUITY AND STOCK-BASED COMPENSATION\nShareholders Equity\nUnder the Companys Certificate of Incorporation, as amended, certain rights of the holders of the Companys common stock are modified by shares of Class B stock for as long as such shares shall remain outstanding. During that period, holders of common stock will have the right to elect approximately 25% of the Companys Board of Directors, and conversely, holders of Class B stock will be entitled to elect approximately 75% of the Companys Board of Directors. During the period when shares of common stock and Class B stock are outstanding, certain matters submitted to a vote of shareholders will also require approval of the holders of common stock and Class B stock, each voting separately as a class. Common stock and Class B shareholders have equal rights with respect to dividends, preferences, and rights, including rights in liquidation.\nStock-Based Compensation\nOn March 17, 2009, the shareholders of the Company approved the 2009 Incentive Compensation Plan (the 2009 Plan). On September 30, 2021, 125,984\nfully\nvested common stock options issued under the 2009 Plan expired.\nOn September 30, 2021,\n45,000 fully vested Class B stock options issued under the 2009 Plan also expired. An additional 30,000\nfully\nvested Class B stock options issued under the 2009 Plan expire on\nSeptember 26, 2026.\nAs of September 30, 2022 and 2021, no options\nwere available for granting of Awards under the 2009 Plan. The Companys 2009 Incentive Compensation Plan expired on October 1, 2021. There are no other existing equity compensation plans and arrangements previously approved by security holders as of September 30, 2022.\nThe following table summarizes option activity under the 2009 Plan:\nNumber of\nShares\nAverage\nExercise Price\nPer Share\nOptions outstanding at September 30, 2020\n252,492\n$ 6.205\nOptions exercised during fiscal 2021\n(51,508 )\n$ 5.126\nOptions expired on September 30, 2021\n(170,984 )\n$ 5.623\nOptions outstanding at September 30, 2021\n30,000\n$ 11.380\nOptions cancelled on November 1, 2021\n(30,000 )\n$ 11.380\nOptions outstanding at September 30, 2022\n-\n$ -\nNo options were granted or forfeited during the year ended September 30, 2022. On November 1, 2021, by unanimous vote of the Board of Directors of the Company and pursuant to the Companys By-Laws, John\nE. Elliott was removed as CEO of the Company. As a result, the 30,000 fully vested, outstanding Class B stock options issued under the 2009 Plan were cancelled. No options were granted, forfeited or cancelled during the year ended September 30, 2021. The weighted average remaining contractual life on the options outstanding as of September 30, 2021 was 5.0 years under the 2009 Plan. ITEM 9 CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nThe Companys President (who is currently serving as the Companys Principal Executive Officer) and Chief Financial Officer evaluated the effectiveness of the design and operation of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) as of the end of the period covered by this Annual Report. Based upon that evaluation, the President and the Chief Financial Officer concluded that, as of the end of the period covered by this Annual Report, the Companys disclosure controls and procedures are effective.\nBecause of inherent limitations, the Companys disclosure controls and procedures, no matter how well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of such disclosure controls and procedures are met and no evaluation can provide absolute assurance that all control issues and instances of fraud, if any, within the Company has been detected.\nAs of the end of the period covered by this Annual Report, the Company conducted an evaluation, under the supervision and with the participation of the Companys management, including the Companys President and Chief Financial Officer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures pursuant to Exchange Act Rules 13a-15(b). Based on this evaluation, the Companys President and Chief Financial Officer concluded that the Companys disclosure controls and procedures were effective as of September 30, 2022.\nManagements Annual Report on Internal Control over Financial Reporting\nThis Annual Report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only managements report in this Annual Report.\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) for the Company. The Companys internal control system is designed to provide reasonable assurance to the Companys management and Board of Directors regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. There are inherent limitations in the effectiveness of all internal control systems no matter how well designed. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to the preparation and presentation of financial statements. Furthermore, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of a change in circumstances or conditions.\nIn order to ensure that the Companys internal control over financial reporting is effective, management regularly assesses such controls and did so most recently as of September 30, 2022. This assessment was based on criteria for effective internal control over financial reporting described in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management believes the Company maintained effective internal control over financial reporting as of September 30, 2022.\nChanges in Internal Control over Financial Reporting\nThe Companys management, including the President and Chief Financial Officer, has reviewed the Companys internal control over financial reporting. There were no changes in the Companys internal control over financial reporting during the year ended September 30, 2022 that materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. ITEM 9B OTHER INFORMATION\nNone\nITEM 9C DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable\nPART III ITEM 10 DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item 10 is incorporated herein by reference to the Companys Definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. ITEM 11 EXECUTIVE COMPENSATION\nThe information required by this Item 11 is incorporated herein by reference to the Companys Definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. ITEM 12 SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item 12 is incorporated herein by reference to the Companys Definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. ITEM 13 CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item 13 is incorporated herein by reference to the Companys Definitive Proxy Statement for the 2023 Annual Meeting of Stockholders. ITEM 14 PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this Item 14 is incorporated herein by reference to the Companys Definitive Proxy Statement for the 2023 Annual Meeting of Stockholders.\nPART IV ITEM 15 EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) A listing of financial statements and financial statement schedules filed as part of this Annual Report and which financial statements and schedules are incorporated into this report by reference, is set forth in the Index to Financial Statements and Financial Statement Schedules in Item 8 hereof.\n(b) Exhibit Index\nEXHIBIT\nNUMBER\nDESCRIPTION\nFILED\nHEREWITH\n3.1\nRestated Certificate of Incorporation of Company, incorporated by reference to Exhibit 3.1 to Registration No. 33-627(P)\n3.2\nAmended and Restated By-Laws of Gencor Industries, Inc., incorporated by reference to Exhibit 3.2 to the Companys Annual Report on Form 10-K for the year ended September 30, 2007\n3.3\nCertificate of Amendment, changing name of Mechtron International Corporation to Gencor Industries, Inc. and adding a twelfth article regarding director liability limitation, incorporated by reference to the Companys Annual Report on Form 10-K for the year ended December 31, 1987(P)\n4.1\nForm of Common Stock certificate, incorporated by reference to Exhibit 4.1 to Registration No. 33-627(P)\n4.2\nDescription of Securities Registered under Section 12 of the Securities Exchange Act of 1934, as amended\nX\n10.1\nThe Companys 2009 Incentive Compensation Plan, as incorporated by reference to the Companys 2009 Proxy Statement filed with the Securities and Exchange Commission on Schedule 14A on January 28, 2009\n10.2\nForm of Agreement for Nonqualified Stock Options granted in 1986, incorporated by reference to the Annual Report on Form 10-K for the year ended December 31, 1986(P)\n10.3\n1997 Stock Option Plan incorporated by reference to Exhibit A to the Companys Proxy Statement on 14A, filed March 3, 1997\n10.4\nFirst Amendment to the Stock Option Plan Agreement incorporated by reference to Exhibit 10.12 to the Companys Quarterly Report on Form 10-Q for the quarter ended June 30, 2005\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of Independent Registered Public Accountants\nX\n31.1\nCertification of Principal Executive Officer Pursuant to Rule 13a - 14(a) of the Securities Exchange Act of 1934, as amended\nX\n31.2\nCertification of Chief Financial Officer Pursuant to Rule 13a - 14(a) of the Securities Exchange Act of 1934, as amended\nX\n32.1\nCertifications of Principal Executive Officer and Chief Financial Officer Pursuant to 18 U. S. C. Section 1350\nX\nEXHIBIT\nNUMBER\nDESCRIPTION\nFILED\nHEREWITH\nInteractive Data File\n101.INS\nXBRL Instance Document\nX\n101.SCH\nXBRL Taxonomy Extension Schema\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase\nX\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase\nX\n101.LAB\nXBRL Taxonomy Extension Label Linkbase\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase\nX\nThe cover page from the Companys Annual Report on Form 10-K for the year ended September 30, 2022, formatted in Inline XBRL (included in Exhibit 101)\nX\nITEM 16 FORM 10-K SUMMARY\nNone\nSIGNATURES\nPursuant to the requirements of Sections 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Annual Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDated: December 16, 2022\nGENCOR INDUSTRIES, INC.\n(Registrant)\n/s/ Marc G. Elliott\nMarc G. Elliott\nPresident & Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated. The signatures of Directors constitute a majority of Directors.\n/s/ E.J. Elliott\n/s/ Marc G. Elliott\nE.J. Elliott\nDecember 16, 2022\nMarc G. Elliott\nDecember 16, 2022\nChairman\nPresident & Director\n(Principal Executive Officer)\n/s/ Eric E Mellen\nEric E. Mellen\nDecember 16, 2022\nChief Financial Officer\n(Principal Financial and Accounting Officer)\n/s/ General John G. Coburn\n/s/ Walter A. Ketcham\nGen. John G. Coburn\nDecember 16, 2022\nWalter A. Ketcham\nDecember 16, 2022\nDirector\nDirector\n/s/ Thomas A. Vecchiolla\nThomas A. Vecchiolla\nDecember 16, 2022\nDirector"
}