{
    "cik": "65312",
    "company": "EVI INDUSTRIES, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-05",
    "period_of_report": "2023-06-30",
    "sic": "7200",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/65312/0001174947-23-001191-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/65312/000117494723001191/evi-20230630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/65312/0001174947-23-001191.txt",
    "filename": "65312_10K_2023_0001174947-23-001191.htm",
    "content": "Item 1. Business.\nGeneral\nThe Company was incorporated under the laws of the State of Delaware on June 13, 1963. On December 21, 2018, the Company changed its name from EnviroStar, Inc. to EVI Industries, Inc.\nThe Company, through its wholly-owned subsidiaries, is a value-added distributor, and provides advisory and technical services. Through its vast sales organization, the Company provides its customers with planning, designing, and consulting services related to their commercial laundry operations. The Company sells and/or leases its customers commercial laundry equipment, specializing in washing, drying, finishing, material handling, water heating, power generation, and water reuse applications. In support of the suite of products it offers, the Company sells related parts and accessories. Additionally, through the Companys robust network of commercial laundry technicians, the Company provides its customers with installation, maintenance, and repair services.\nThe Companys customers include government, institutional, industrial, commercial and retail customers. Product purchases made by customers range from parts and accessories, to single or multiple units of equipment, to large complex systems. The Company also provides its customers with the services described above.\nBeginning in 2015, the Company implemented a buy-and-build growth strategy which includes (i) the consideration and pursuit of acquisitions and other strategic transactions which management believes may complement the Companys existing business or otherwise offer growth opportunities for, or benefit, the Company and (ii) the implementation of a growth culture at acquired businesses based on the exchange of ideas and business concepts among the management teams of the Company and the acquired businesses as well as through certain additional initiatives, which may include investments in additional sales and service personnel, new product lines, enhanced service operations and capabilities, new and improved facilities, and advanced technologies. See Buy-and-Build Growth Strategy below for additional information regarding the Companys buy-and-build growth strategy, including information regarding certain acquisitions consummated by the Company since its implementation of the buy-and-build growth strategy.\nThe Company seeks to maintain a culture designed to reward performance through a variety of performance-based pay, commission programs, cash incentives, and stock-based equity programs. Stock-based plans include a voluntary employee stock purchase plan and an equity compensation plan under which restricted stock and other equity awards may be granted. The Companys equity compensation plan is designed to promote long-term performance, as well as to create long-term employee retention and continuity of leadership, and align the interests of management and employees with the long-term success of the Company. The Company believes that its restricted stock program promotes this culture and long-term performance because restricted stock grants generally provide for long-term vesting, including in certain cases entirely at the end of the recipients career (age 62 or later).\nThe Company reports its results of operations through a single operating and reportable segment.\nAvailable Information\nThe Company files Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q, files or furnishes Current Reports on Form 8-K, files or furnishes amendments to those reports, and files proxy and information statements with the SEC. These reports and statements, as well as beneficial ownership reports filed by the Companys officers and directors and beneficial owners of 10% or more of the Companys common stock, may be accessed free of charge on the SECs website at http://www.sec.gov and, as soon as reasonably practicable after such materials are electronically filed with, or furnished to, the SEC, on the Companys website at http://www.evi-ind.com. The information contained on or connected to the Companys website is not incorporated by reference into, or otherwise a part of, this Report. Further, references to the website URL of the Company in this Report are intended to be inactive textual references only.\nProducts and Services\nThe Company sells and/or leases its customers commercial laundry equipment, specializing in washing, drying, finishing, material handling, water heating, power generation, and water reuse applications. In support of the suite of products it offers, the Company sells related parts and accessories. Additionally, through the Companys robust network of commercial laundry technicians, the Company provides its customers with installation, maintenance, and repair services.\nThe commercial and industrial laundry equipment distributed by the Company includes washroom, finishing, material handling, and mechanical equipment such as washers and dryers, tunnel systems and vended machines, many of which are designed to reduce utility and water consumption. Finishing equipment distributed by the Company includes sheet feeders, flatwork ironers, automatic sheet folders, and stackers. Material handling equipment distributed by the Company includes conveyor and rail systems. Mechanical equipment distributed by the Company includes boilers, hot water/steam systems, power generation products, water purification, reuse and recycling systems and air compressors. Boiler products distributed by the Company include high efficiency, low emission steam boilers, steam systems and hot water systems that are used in the laundry and dry cleaning industry for temperature control, heating, pressing and de-wrinkling, and in the healthcare industry, food and beverage industry, and other industrial markets, for sterilization, product sealing and other purposes. The Company also sells replacement parts and accessories for the products it distributes.\nThe Company seeks to position and price its products to appeal to customers in each of the high-end, mid-range and value-priced markets, as the products are generally offered in a wide range of price points to address the needs of a diverse customer base. The Company believes that its portfolio of products affords the Companys customers a one-stop shop for commercial, industrial and vended laundry and dry cleaning machines, boilers and accessories and that, as a result, the Company is able to attract and support potential customers who can choose from the Companys broad product line.\nIn addition to its distribution of products, the Company also provides installation, maintenance and repair services to its customers. The Company believes its services are competitively priced.\nBuy-and-Build Growth Strategy\nAs described above, in addition to its pursuit of organic growth initiatives, the Company implemented a buy-and-build growth strategy in 2015. The buy component of the strategy includes the consideration and pursuit of acquisitions and other strategic transactions which management believes would complement the Companys existing business or otherwise offer growth opportunities for, or benefit, the Company. The Company is disciplined and conservative in its consideration of acquisitions and generally seeks to identify opportunities that fit certain financial and strategic criteria. The build component of the strategy involves implementing a growth culture at acquired businesses based on the exchange of ideas and business concepts among the management teams of the Company and the acquired businesses as well as through certain initiatives, which may include investments in additional sales and service personnel, new product lines, enhanced service operations and capabilities, new and improved facilities, and advanced technologies. The Company generally seeks to structure acquisitions to include both cash and stock consideration. The Company believes the issuance of stock consideration aligns the interests of the sellers of the acquired businesses, who the Company generally seeks to maintain to continue to operate the acquired businesses, with the interests of the Companys other stockholders. The sellers as well as other key individuals at the acquired businesses may also be provided with the opportunity to own shares of the Companys common stock through equity-based plans of the Company.\nThe Companys acquisitions under its buy-and-build growth strategy since its implementation in 2015 include, without limitation, those described below. The acquired companies generally distribute commercial, industrial, and vended laundry products and provide installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry.\n● On October 10, 2016, the Company purchased substantially all of the assets of Western State Design, LLC, a California-based company, for a purchase price consisting of $18.5 million in cash and 2,044,990 shares of the Companys common stock.\n● On October 31, 2017, the Company purchased substantially all of the assets of Tri-State Technical Services, Inc., a Georgia-based company, for a purchase price consisting of approximately $7.95 million in cash and 338,115 shares of the Companys common stock.\n● On February 9, 2018, the Company purchased substantially all of the assets of Dallas-based companies, Zuf Acquisitions I LLC (d/b/a/ AAdvantage Laundry Systems) and Sky-Rent LP, for total consideration of approximately $20.4 million, consisting of approximately $8.1 million in cash and 348,360 shares of the Companys common stock.\n● On September 12, 2018, the Company purchased substantially all of the assets of Scott Equipment, Inc., a Houston-based company, for approximately $6.5 million in cash and 209,678 shares of the Companys common stock.\n● On February 5, 2019, the Company acquired PAC Industries Inc., a Pennsylvania-based company, for approximately $6.4 million in cash and 179,847 shares of the Companys common stock.\n● On November 3, 2020, the Company acquired Yankee Equipment Systems, LLC, a New Hampshire-based company, for approximately $4.6 million in cash and 278,385 shares of the Companys common stock.\n● On February 7, 2022, the Company acquired Consolidated Laundry Equipment, Inc. and Central Equipment Company, LLC (collectively CLK), a North Carolina-based company, for approximately $3.3 million in cash, net of cash acquired, and 179,087 shares of the Companys common stock.\n● On June 1, 2022, the Company acquired Clean Designs, Inc. and Clean Route, LLC (collectively CDL), a Colorado-based company, for approximately $5.4 million in cash.\nSee Managements Discussion and Analysis of Financial Condition and Results of Operations included as Part II, Item 7 of this Report and Note 3 to the Consolidated Financial Statements included in Item 8 of this Report for additional information about the acquisitions of CLK and CDL as well as other acquisitions consummated by the Company during fiscal 2022 and fiscal 2023.\nAcquisitions are generally effected by the Company through a separate wholly-owned subsidiary formed for the purpose of effecting the transaction, whether by an asset purchase or merger, and operating the acquired business following the transaction. In connection with each transaction, the Company, indirectly through its applicable wholly-owned subsidiary, also assumed certain of the liabilities of the acquired business. The financial position, including assets and liabilities, and results of operations of the acquired businesses following the respective closing dates of the acquisitions are included in the Companys consolidated financial statements.\nCustomers and Markets\nThe Companys customer base consists of approximately 65,000 customers located primarily in the United States of America (United States or U.S.), Canada, the Caribbean, and Latin America. No single customer accounted for more than 10% of the Companys revenues for fiscal 2023 or fiscal 2022.\nThe Companys commercial and industrial laundry equipment and boilers are sold or leased to a wide range of customers, including, but not limited to, vended laundry facilities, industrial laundry facilities, government institutions, correctional facilities, hospitals, hospital combines, nursing homes, veterinary clinics, professional sports franchises, educational institutions, hotels, motels, food and beverage establishments, cruise lines, and specialized users.\nHistorically, the Company has not noted any significant seasonality.\nSales, Marketing and Customer Support\nThe Company employs sales personnel to market its products in the United States, Canada, the Caribbean, and Latin America. The Company has exclusive and nonexclusive distribution rights to market its products. Orders for equipment and replacement parts and accessories are generally obtained by telephone, and e-mail inquiries originated by the customer or by the Company, from existing customer relationships and from newly formed customer relationships. The Company supports its sales and leasing activities through its websites and by advertising in trade publications, participating in trade shows and engaging in regional promotions and incentive programs.\nThe Company seeks to establish customer satisfaction by offering:\n● an experienced sales and service organization;\n● comprehensive product offerings;\n● competitive pricing;\n● maintenance of comprehensive and well-stocked inventories of equipment, replacement parts and accessories, often with same day or overnight availability;\n● design and layout services;\n● installation, maintenance and repair services;\n● on-site training performed by factory trained technicians; and\n● toll-free support lines and technical websites to address customer service problems.\nThe Company trains its employees to provide service and customer support. The Company uses in-person classroom training, instructional videos and vendor sponsored seminars to educate employees about product information. In addition, the Companys technical staff has prepared training manuals, written in English and Spanish, relating to specific training procedures. The Companys technical personnel are retrained as the Company believes to be necessary, including in connection with the development of new technology.\nForeign Sales\nSubstantially all of the Companys revenues from foreign activities relate to the sale of commercial and industrial laundry and dry cleaning equipment and boilers to customers in Canada, the Caribbean, and Latin America.\nAll of the Companys foreign sales require the customer to make payment in United States dollars. Foreign sales may be affected by the strength of the United States dollar relative to the currencies of the countries in which the Companys customers are located, as well as the strength of the economies of the countries in which the Companys customers are located.\nSources of Supply\nThe Company purchases commercial and industrial laundry products, dry cleaning machines, boilers and other products for distribution from a number of manufacturers and suppliers. The major manufacturers of the products sold by the Company are American Dryer Corporation, Chicago Dryer Company, Cleaver Brooks Inc., Continental Girbau, Inc., Dexter Laundry, Inc., FMB Group, Fulton Thermal Corp., Kannegiesser ETECH, Maytag Corporation, Pellerin Milnor Corporation, Unipress Corporation and Whirlpool Corporation. Purchases from three manufacturers accounted for a total of approximately 61% and 56% of the Companys product purchases for fiscal 2023 and fiscal 2022, respectively. No other manufacturers accounted for more than 10% of product purchases during fiscal 2023 or fiscal 2022. The Company believes that it has good working relationships with its current manufacturers and suppliers. The Company has contracts with several of the manufacturers and suppliers of the products which the Company sells and has established, long-standing relationships with most of its manufacturers and suppliers. The Company believes that such relationships provide the Company with certain competitive advantages, including exclusivity for certain products in certain areas and, in certain cases, favorable prices and terms. While the Company has generally not experienced difficulty in purchasing products it distributes, supply chain constraints in recent years have resulted in extended inventory lead times and resulting delays in fulfilling certain orders, as well as increases in product costs.\nIn connection with certain business acquisitions, the business relationship between the acquired business and its principal supplier ceased. As a result, the businesses distributed other brands from one or more of the Companys other suppliers. The Company does not believe that any such brand switches have had a material adverse impact on the Company as a whole. However, there is no assurance that the Company or any of its acquired businesses will maintain its relationships with any of its suppliers, and the loss of certain of these relationships, including the loss of a relationship with a principal supplier and any inability to successfully mitigate the effect of the loss of such supplier, could adversely affect the Companys business and results. See also The Companys business and results may be adversely affected if the Company does not maintain its relationships with its significant suppliers or customers under Item 1A. Risk Factors.\nThe Company is subject to various risks and uncertainties, including those described below, which could adversely affect the Companys business, financial condition, results of operations and cash flows, and the value of the Companys common stock. The risks described below are not the only risks faced by the Company. Additional risks not presently known to the Company or other factors that the Company does not presently perceive to present significant risks to the Company at this time may also impair the Companys business, financial condition, results of operations or cash flows, or the value of the Companys common stock. The risks discussed below also include forward looking statements, and actual results and events may differ substantially from those expressed in, or implied by, the forward looking statements. See Cautionary Note Regarding Forward Looking Statements preceding Part I, Item 1 of this Report.\nRisks Related to the Companys Business and Operations\nAcquisitions and the Companys pursuit of acquisitions and other strategic transactions subject the Company to a number of risks.\nAcquisitions are an important element of the Companys growth strategy. Acquisitions and the Companys efforts with respect thereto involve a number of risks, including, but not limited to:\n● the ability to identify and consummate transactions with acquisition targets;\n● the successful operation and integration of acquired companies;\n● diversion of managements attention from other business functions and operations;\n● strain on managerial and operational resources as management tries to oversee larger operations;\n● difficulty implementing and maintaining effective internal control over financial reporting at the acquired businesses;\n● possible loss of key employees and/or customer or supplier relationships of the acquired business (See The Companys business and results may be adversely impacted if the Company does not maintain its relationships with its significant suppliers or customers below); and\n● exposure to liabilities of the acquired businesses.\nAs a result of these or other problems and risks, acquired businesses may not produce the revenues, earnings, cash flows or business synergies anticipated, and the acquired businesses may not perform as expected. As a result, the Company may incur higher costs and realize lower revenues and earnings than anticipated. The Company may not be able to successfully address these problems, integrate any acquired businesses or generate sufficient revenue to offset the associated costs or other negative effects on its business.\nIn addition, acquisitions may result in dilutive issuances of the Companys equity securities and the incurrence of debt. See Risks Related to the Companys Indebtedness - The Companys indebtedness may impact its financial condition and results of operations, and the terms of the Companys indebtedness may place restrictions on the Company below. Acquisitions may also result in contingent liabilities, or amortization expenses, or impairment of goodwill and/or purchased long-lived assets, and restructuring charges, any of which could adversely impact the Companys financial condition or results. Further, there are risks related to the accounting for acquisitions, including that preliminary valuations are subject to change and any such change may impact the Companys results.\nGrowth of the Companys business through acquisitions or otherwise may place significant demands on management, as well as on the Companys accounting, financial, information and other systems and on the Companys business. Further, management may not be able to manage the Companys growth effectively or successfully, and the Companys financial, accounting, information and other systems may not be able to successfully accommodate the Companys growth. In addition, the Companys accounting expenses and other professional expenses associated with being a public company have increased as a result of the Companys growth, and such expenses may continue to increase in the future.\nFurther, the Company may not be successful in consummating acquisitions or other strategic transactions. Expenses related to the Companys pursuit of acquisitions and other strategic transactions may be significant and will be incurred by the Company regardless of whether the underlying acquisition or other strategic transaction is ultimately consummated.\nConditions beyond the Companys control can interrupt the Companys supplies, increase its product costs and impair its ability to deliver products and services to its customers.\nThe Company obtains its products from third-party suppliers. Although purchasing volume can provide benefits when dealing with suppliers, suppliers may not be able to provide the products and supplies that the Company needs in the quantities and at the prices requested, including due to conditions outside of the suppliers control. The Company is also subject to delays caused by interruptions in production and increases in product costs based on conditions outside of the Companys control. These conditions include shortages of qualified labor for suppliers, work slowdowns, work interruptions, strikes or other job actions by employees of suppliers, weather conditions, transportation interruptions, unavailability of fuel or increases in fuel costs, product recalls, competitive demands, civil insurrection or social unrest, terrorist attacks, natural disasters, epidemics, pandemics (such as the COVID-19 pandemic) or other disease outbreaks or other catastrophic events. Many of these conditions are outside of the Companys control and could also impair the Companys ability to provide its products and services to its customers or increase the cost of doing so. In recent years, customer demand has outpaced available supply, which has resulted in, and may continue to result in, delays in delivering products or services to the Companys customers, as well as increases in product costs. The inability to obtain adequate supplies of products and/or to timely provide products and services and fulfill the Companys other obligations to its customers, whether as a result of any of the foregoing factors or otherwise, could have an adverse effect on the Companys business, results of operations and financial condition, including, without limitation, if the Companys customers turn to other distributors.\nIn addition to the foregoing, delays in construction of customers facilities, whether due to supply or labor shortages or any other factors, have resulted, and may continue to result in, delays in the Companys fulfillment of orders to such facilities, which may adversely impact the Companys operating results and financial condition.\nLabor shortages and increases in labor costs may have a material adverse impact on the Companys business and results of operations.\nThe market for qualified employees is highly competitive, particularly in light of recent labor shortages. The Company may be unable to continue to attract and retain qualified personnel. In addition, increases in labor costs have resulted in, and may continue to result in, increases in the Companys operating expenses. If labor market disruptions and/or labor cost increases continue, the Companys sales or service team could be short staffed and would be more costly to retain, and the Companys ability to meet its customers demands or expectations could be adversely impacted, any of which could materially adversely affect the Companys business and results of operations.\nThe Companys business and results may be adversely affected if the Company does not maintain its relationships with its significant suppliers or customers.\nWhile the Company purchases the products it distributes from a number of manufacturers and suppliers, purchases from three manufacturers accounted for a total of approximately 61% and 56% of the Companys product purchases for fiscal 2023 and fiscal 2022, respectively. The Company believes it has good working relationships with the manufacturers or suppliers from which the Company purchases its products. However, if such relationships deteriorate or the Company is unable to maintain such relationships, including with any of its or its acquired businesses principal manufacturers or suppliers, the Companys business and results could be materially and adversely impacted. In addition, efforts of the Company and its acquired businesses to mitigate any loss, including brand shifts, may not be successful. Further, the Company does not have contracts with all of its manufacturers, and certain contracts the Company does have are short term agreements and can be terminated on short notice. In addition, suppliers may not comply with the terms of any agreements or may choose to terminate such agreements, allow such agreements to expire without renewal, or seek to revise the agreements on terms which are less favorable to the Company than the prevailing terms, any of which could materially and adversely impact the Companys business and results.\nIn addition, while the Company distributes its products to various users, including, but not limited to, vended laundry facilities, industrial laundry facilities, government institutions, correctional facilities, hospitals, hospital combines, nursing homes, veterinary clinics, professional sports franchises, educational institutions, hotels, motels, food and beverage establishments, cruise lines, and specialized users, the Companys operating results and financial condition could be materially adversely impacted if the Company loses a significant customer or fails to meet its customers expectations.\nThe products the Company distributes could fail to perform according to specifications or prove to be unreliable, which could damage the Companys customer relationships and industry reputation and result in lawsuits and loss of sales.\nThe Companys customers require demanding specifications for product performance and reliability. Product defects or other failures to perform to specifications or as expected could result in higher service costs and may damage the Companys customer relationships and industry reputation and/or otherwise negatively impact the Companys business, operations and results. Further, the Company may be subject to lawsuits if, among other things, any of the products it distributes fails to operate properly or causes property or other physical damage.\nThe Company faces substantial competition.\nThe commercial and industrial laundry distribution and service business is highly competitive and fragmented, with over 500 full-line or partial-line equipment distributors and service providers in the United States. The Companys management believes that no single competitor of the Company has a major share of the market, substantially all competitors are independently owned, and, with the exception of several regional distributors, distributors operate primarily in local markets. In the United States, the Companys primary competition is from a number of independently owned distributors and certain manufacturers which own distribution businesses operating in North America. In foreign markets, the Company also competes with independently owned distributors and manufacturer-owned distribution businesses. Certain of the Companys competitors may have greater financial and other resources than the Company. In addition, some of the Companys competitors may have less indebtedness than the Company, and therefore may have more cash and working capital available for business purposes other than debt service. The Companys results and financial condition would be materially and adversely impacted if the Company is unable to compete effectively. Further, the Company may not be able to adjust efficiently or effectively or otherwise operate profitably if the competitive environment changes.\nThe Company also competes for qualified employees and, in light of labor market disruptions, such competition has been more intense and led to increases in the costs of labor. See Labor shortages and increases in labor costs may have a material adverse impact on the Companys business and results of operations above.\nThe Company faces risks associated with environmental and other regulation.\nThe Companys business and operations are subject to federal, state, local and foreign environmental and other laws and regulations, including environmental laws governing the discharge of pollutants, the handling, generation, storage and disposal of hazardous materials, substances, and wastes and the cleanup of contaminated sites. As a public company, the Company will also be subject to any rules and regulation of the SEC and any applicable securities exchange concerning environmental and other social issues, which may result in increased costs and compliance efforts. The Company is also subject to rules and regulations with respect to its contracts and dealings with government facilities. The Company may not remain in compliance with all applicable laws and regulations and could be required to incur significant costs as a result of violations of, liabilities under, or efforts to comply with, applicable laws and regulations. In addition, violations may have other adverse implications for the Company, including negative public relations and potential litigation. Further, the Company may incur significant compliance costs in the event of changes to applicable laws and regulations.\nThe outbreak of a pandemic or public health crisis, including any resurgence of the COVID-19 pandemic (or any variant thereof), may adversely impact the Company. As previously disclosed, the Company was adversely impacted by the COVID-19 pandemic beginning at the end of the quarter ended March 31, 2020; specifically, due to delays and declines in the placement of customer orders, the completion of equipment and parts installations, and the fulfillment of parts orders. Any future pandemic or public health crisis may have similar or worse effects than those experienced in connection with the COVID-19 pandemic and may exacerbate certain of the other risks set forth herein.\nThe Company faces risks related to its foreign sales.\nThe Companys revenues from foreign sales relate principally to the Companys sales of commercial and industrial laundry and dry cleaning equipment and boilers to Canada, the Caribbean, and Latin America. All of the Companys foreign sales require the customer to make payment in United States dollars. Foreign sales may be affected by the strength of the United States dollar relative to the currencies of the countries in which customers and competitors are located, as well as the strength of the economies of the countries in which the Companys customers are located.\nFurther, conducting an international business inherently involves a number of difficulties, risks and uncertainties, such as:\n● export and trade restrictions;\n● inconsistent and changing regulatory requirements;\n● tariffs and other trade barriers;\n● cultural issues;\n● problems in collecting accounts receivable;\n● political instability and international hostilities;\n● local economic downturns; and\n● potentially adverse tax consequences.\nAny of the above factors may materially and adversely affect the Companys business, prospects, operating results or financial condition.\nDamages to, or disruptions at, the Companys facilities or the facilities of a supplier or customer could adversely impact the Companys business, operating results and financial condition.\nAlthough the Company has certain limited protection afforded by insurance, the Companys business, earnings and financial condition could be materially adversely affected if it suffers damages to, or disruptions at, its facilities. Without limiting the generality of the foregoing, the Companys facilities in Florida, Georgia, North Carolina, Texas and the Northeast United States are subject to hurricane casualty and flood risk and its facilities in California are subject to earthquake casualty risk. In addition, damages to the facility of a supplier, whether due to, fire, natural disaster or other events, would adversely impact the Companys ability to obtain products from that supplier when expected or at all and, accordingly, may result in delays in the delivery of the Companys products or the provision of its services. Further, damages to the facility of a customer may adversely impact the business of the customer and its need for products or services from the Company or result in delays in the delivery of products or provision of services to the customer. Any of these events may materially and adversely impact the Companys business, operating results and financial condition.\nThe Companys assets may suffer uninsured losses.\nThe Company attempts to ensure that its assets, including the equipment and parts that it sells, are adequately insured to cover property and casualty losses as well as any other liabilities to which the Company is reasonably expected to be subject. However, insurance may be expensive or difficult to obtain, and there are certain types of losses, generally catastrophic in nature, such as losses due to wars, acts of terrorism, floods, hurricanes, earthquakes, pollution, fire or environmental disasters or other matters, which are uninsurable or not economically insurable, or may be insured subject to limitations, such as large deductibles or co-payments. In addition, there may in certain cases be questions as to when the risk of loss related to products sold is transferred to the customer. If the equipment suffers a loss and risk of loss is deemed not to have transferred to the customer, the Company may be liable for the loss, which may not be insured. If the Companys insurance coverage is not adequate, or the Company otherwise incurs uninsured losses, the Companys operating results and financial condition would be adversely impacted.\nThe Company may also be subject to insured losses relating to breaches of its information technology systems. See also Failure to maintain the integrity of internal or customer data could result in faulty business decisions or operational inefficiencies, damage the Companys reputation and/or subject the Company to costs, fines or lawsuits below.\nThe Companys ability to manage its business and monitor results is highly dependent upon information and communication systems, and a failure of these systems or the Companys ERP implementation could disrupt its business.\nThe Company is dependent upon a variety of internal computer and telecommunication systems to operate its business, including its enterprise resource planning (ERP) systems. The Company is consolidating across a number of its subsidiaries ERP software systems and related processes to perform various functions and improve on the efficiency of the Companys business. This is a lengthy and expensive process that diverts resources from other operations, and may result in cost overruns, project delays or business interruptions.\nAny disruptions, delays or deficiencies in the design and/or implementation of the new ERP system, or in the performance of legacy systems, particularly any disruptions, delays or deficiencies that impact the Companys operations, could adversely affect the Companys ability to effectively run and manage its information. Further, as the Company is dependent upon its ability to gather and promptly transmit accurate information to key decision makers, the Companys business, results of operations and financial condition may be adversely affected if the Companys information systems do not allow the Company to transmit accurate information, even for a short period of time. Failure to properly or adequately address these issues could impact the Companys ability to perform necessary business operations, which could adversely affect the Companys reputation, competitive position, business, results of operations and financial condition.\nIn addition, the information systems of acquired businesses may not be sufficient to meet the Companys standards or the Company may not be able to successfully convert them to provide acceptable information on a timely and cost-effective basis. Furthermore, the Company must attract and retain qualified people to operate its systems, expand and improve them, integrate new programs effectively with its existing programs, and convert to new systems efficiently when required. Any disruption to the Companys business due to such issues, or an increase in costs to cover these issues that is greater than anticipated, could have an adverse effect on the Companys financial results and operations.\nFailure to maintain the integrity of internal or customer data could result in faulty business decisions or operational inefficiencies, damage the Companys reputation and/or subject the Company to costs, fines or lawsuits.\nThe Company collects and retains internal and customer data, including social security numbers, credit card numbers and other personally identifiable information of customers, in various internal information systems. The Company also maintains personally identifiable information about its employees. The integrity and protection of customer, employee and company data is critical to the Company. The Company could make faulty decisions if that data is inaccurate or incomplete. The Companys customers and employees also have a high expectation that their personal information will be adequately protected. The regulatory environment as well as the requirements imposed on the Company by the payment card industry surrounding information, security and privacy is also increasingly demanding. The Companys systems may be unable to satisfy changing regulatory and payment card industry requirements and employee and customer expectations, or may require significant additional investments or time in order to do so.\nThe Company could be negatively affected by cyber or other security threats or other disruptions.\nIn the ordinary course of its business, the Company processes, transmits and stores sensitive Company information as well as sensitive information, including personal information, about its customers, employees and vendors, all of which require the appropriate and secure utilization of such information and subjects the Company to risks relating thereto, including risks relating to increased focus regarding the Company's data security compliance. Cyber-attacks, including ransomware, malware and phishing, designed to gain access to sensitive information by breaching systems are constantly evolving. Furthermore, there has been heightened legislative and regulatory focus on data security in the U.S. and abroad, including requirements for varying levels of customer notification in the event of a data breach. These laws are changing rapidly and vary among jurisdictions. The Company will continue its efforts to meet applicable privacy and data security obligations; however, it is possible that certain new obligations may be difficult to meet and could increase the Company's costs. The Company relies on commercially available systems, software and tools to provide security for processing, transmitting and storing sensitive information. As the risk of cyber-attacks increases, related insurance premiums and the cost of defensive measures may also increase. In addition, the costs to remediate security incidents or breaches that may occur could be material.\nDespite the security measures and processes the Company has in place, efforts to protect sensitive Company, customer, employee and vendor information may not be successful in preventing a breach in the Company's systems or detecting and responding to a breach on a timely basis. The Company has experienced threats to, and incidents involving, its systems and information, and while none have been material to date, cyber-attacks are generally becoming more frequent, intense, and sophisticated. As a result of a security incident or breach in the Company's systems, the Company's systems could be interrupted or damaged, and/or sensitive information could be accessed by third parties. The Company's systems may also be disrupted or damaged, and/or sensitive information could be released, due to other system failures, viruses, operator error or inadvertent releases of data. In the event of a data or security breach, the Company's customers, employees or vendors could lose confidence in the Company's ability to protect their information, which could result in the loss of key customers, employees or vendors, or the Company's reputation could otherwise be negatively impacted, any of which may have a material adverse impact on the Company's business or results. In addition, as the regulatory environment relating to the protection of sensitive data becomes stricter, a failure to comply with applicable regulations could potentially subject the Company to fines, penalties, other regulatory sanctions, or lawsuits with the possibility of substantial damages.\nIn addition, damage or disruption to the Company's systems could adversely impact the Company's ability to manage or operate its business. Further, conversions to new information technology systems require effective change management processes and may result in cost overruns, delays or business interruptions. If the Companys information technology systems are disrupted, become obsolete or do not adequately support the Companys strategic, operational or compliance needs, the Companys business, financial position, results of operations or cash flows may be adversely affected.\nRisks Related to the Companys Indebtedness\nThe Companys indebtedness may impact its financial condition and results of operations, and the terms of the Companys indebtedness may place restrictions on the Company.\nThe Companys level of indebtedness may have several important effects on the Companys operations, including, without limitation, that the Company uses cash to satisfy its debt service requirements, that outstanding indebtedness and the Companys leverage position will increase the impact on the Company of negative changes in general economic and industry conditions, as well as competitive pressures, and that the Companys ability to obtain additional financing for acquisitions, working capital or other corporate purposes may be impacted.\nThe Company is a party, as borrower, to a syndicated credit agreement (the Credit Agreement) in the maximum aggregate principal amount of up to $100 million, with an accordion feature to increase the revolving credit facility by up to $40 million for a total of $140 million. A portion of the revolving credit facility is available for swingline loans of up to a sublimit of $5 million and for the issuance of standby letters of credit of up to a sublimit of $10 million. The maturity date of the Credit Agreement is May 6, 2027. The Company had $35.0 million outstanding under the Credit Agreement as of June 30, 2023.\nBorrowings (other than swingline loans) under the Credit Agreement bear interest at a rate, at the Companys election at the time of borrowing, equal to (a) the Bloomberg Short-Term Bank Yield Index rate (the BSBY rate) plus a margin that ranges from 1.25% to 1.75% depending on the Companys consolidated leverage ratio, which is a ratio of consolidated funded indebtedness to consolidated earnings before interest, taxes, depreciation and amortization (EBITDA) (the Consolidated Leverage Ratio) or (b) the highest of (i) prime, (ii) the federal funds rate plus 50 basis points, and (iii) the BSBY rate plus 100 basis points (such highest rate, the Base Rate), plus a margin that ranges from 0.25% to 0.75% depending on the Consolidated Leverage Ratio. Swingline loans bear interest calculated at the Base Rate plus a margin that ranges from 0.25% to 0.75% depending on the Consolidated Leverage Ratio. A significant increase in interest rates could materially impact the cost of the Companys indebtedness under the Credit Agreement and any other floating rate debt that the Company may incur in the future.\nThe Credit Agreement contains covenants applicable to the Company, including financial covenants requiring the Company to comply with maximum leverage ratios and minimum interest coverage ratios, as well as other covenants which may place restrictions on, among other things, liens, investments, indebtedness, fundamental changes, acquisitions, dispositions of property, making specified restricted payments (including cash dividends and stock repurchases that would result in the Company exceeding an agreed to Consolidated Leverage Ratio), and transactions with affiliates.\nThe Company may incur additional debt financing as determined to be appropriate by management, including in connection with the financing of acquisitions or other strategic transactions or otherwise, which would increase the Companys vulnerability to the risk factors described above related to its level of indebtedness and may place restrictions on the Company similar or in addition to those contained in the Credit Agreement. There is no assurance that the Company will receive any financing which the Company may seek to obtain in the future on acceptable terms or at all, including in the event additional funds are necessary to consummate an acquisition or other strategic transaction or support the Companys business operations.\nRisks Related to Ownership of the Companys Common Stock\nThe Companys management may be deemed to control the Company.\nThe Companys management, including Henry M. Nahmad, the Companys Chairman, Chief Executive Officer and President, and the Companys Board of Directors through stockholders agreement granting it the right to direct the voting of certain shares issued as consideration in acquisitions, may be deemed to control the Company as a result of their collective voting power over shares representing approximately 60.0% of the issued and outstanding shares of the Companys common stock as of June 30, 2023. Under the Companys Bylaws, the election of directors requires a plurality vote and all other matters put to a vote of the Companys stockholders require the affirmative vote of a majority of the shares of the Companys common stock represented at a meeting, in person or by proxy, and entitled to vote on the matter unless a greater percentage is required by applicable law. Consequently, other than in very limited circumstances where a greater vote is required by applicable law, Mr. Nahmad and the other members of the Companys management, without the consent or vote of any other stockholders of the Company, have the voting power to elect directors and approve other actions that require stockholder approval. The interests of the Companys management may conflict with the interests of the Companys other stockholders and also could have the effect of delaying or preventing a change in control or changes in management and/or adversely impact the market price of the Companys common stock or the ability of the Companys other stockholders to receive a premium for their shares in connection with any sale of the Company.\nFurther, as a result of managements controlling voting position with respect to the Companys common stock, the Company is a controlled company within the meaning of the listing standards of the NYSE American, on which the Companys common stock is listed. As a controlled company, the Company is not required under the listing standards of the NYSE American to comply with certain corporate governance requirements set forth therein, including:\n● the requirement that a majority of the Companys Board of Directors consists of independent directors;\n● the requirement that directors be recommended for nomination by, and other nominating and corporate governance matters be decided solely by, a nominating/corporate governance committee consisting of independent directors; and\n● the requirement that executive compensation matters be decided by a compensation committee consisting of independent directors.\nWhile executive compensation matters are determined by a compensation committee comprised solely of independent directors and the Companys Board of Directors is currently comprised of a majority of independent directors, the Company does not have a standing nominating/corporate governance committee and the Company has in the past from time to time maintained a Board of Directors not comprised of a majority of independent directors. In addition, in the discretion of the Companys Board of Directors, the Company may choose to utilize or continue to utilize any or all of the exceptions in the future. As a result, the Companys stockholders may not have certain of the same protections as a stockholder of other publicly-traded companies which are not controlled companies and the market price of the Companys common stock may be adversely affected.\nThe concentration of ownership with respect to the Companys common stock also results in there being a limited trading volume, which may make it more difficult for stockholders to sell their shares and increase the price volatility of the Companys common stock.\nAs a smaller reporting company, the Company may avail itself of reduced disclosure requirements, which may make the Companys common stock less attractive to investors.\nUnder applicable SEC rules and regulations, the Company is a smaller reporting company and will continue to be a smaller reporting company for so long as the market value of the Companys common stock held by non-affiliates as of the end of its most recently completed second fiscal quarter is less than $250 million. As a smaller reporting company, the Company has relied on exemptions from certain disclosure requirements that are applicable to other public companies. The Company may continue to rely on such exemptions for so long as the Company remains a smaller reporting company. These exemptions include reduced financial disclosure and reduced disclosure obligations regarding executive compensation. The Companys reliance on these exemptions may result in the public finding the Companys common stock to be less attractive and adversely impact the market price of, or trading market for, the Companys common stock.\nThe issuance of preferred stock and common stock, and the authority of the Companys Board of Directors to approve issuances of preferred stock and common stock, could adversely affect the rights of the Companys stockholders and have an anti-takeover effect.\nAs permitted by Delaware law, the Companys Board of Directors is authorized under the Companys Certificate of Incorporation, as amended (the Certificate of Incorporation), to approve the issuance by the Company of up to 200,000 shares of preferred stock, and to designate the relative rights, preferences and limitations of any preferred stock so issued, in each case, without any action on the part of the Companys stockholders. Currently, no shares of preferred stock are outstanding. In the event that the Company issues preferred stock in the future that has preference over the Companys common stock with respect to the payment of dividends or upon liquidation, dissolution or winding up of the Company, the rights of holders of shares of the Companys common stock may be adversely affected. In addition, the Company is authorized under its Certificate of Incorporation to issue up to 20,000,000 shares of common stock. There are currently approximately 13.8 million shares of common stock outstanding. Subject to applicable law and the rules and regulations of the NYSE American, the Companys Board of Directors (or a committee thereof, in the case of shares issued under the Companys equity-based compensation plan) has the power to approve the issuance of any authorized but unissued shares of the Companys common stock, and any such issuances, including, without limitation, those under the Companys equity-based compensation plan or pursuant to any acquisitions or other strategic transactions consummated by the Company or in connection with the financing thereof, would result in dilution to the Companys stockholders. These provisions of the Certificate of Incorporation could also delay, defer or prevent a change in control of the Company or its management, and could limit the price that investors are willing to pay in the future for shares of the Companys common stock.\nGeneral Risks\nManagement has identified a material weakness in the Companys internal control over financial reporting, and the Company may be unable to develop, implement and maintain appropriate controls in future periods.\nThe Sarbanes-Oxley Act of 2002 and SEC rules require that management annually report on the effectiveness of the Companys internal control over financial reporting and its disclosure controls and procedures. The Company has incurred, and expects to continue to incur, a substantial amount of management time and resources to comply with such requirements.\nAs more fully described in Item 9A, Controls and Procedures, of this Annual Report on Form 10-K, in connection with its evaluation of the effectiveness of the Companys internal control over financial reporting as of June 30, 2023, management identified a material weakness in the Companys internal control over financial reporting related to the review and approval of manual journal entries made to the general ledger at certain of the Companys subsidiaries. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. As a result of the identification of the material weakness, management concluded that the Companys internal control over financial reporting was not effective as of June 30, 2023.\nThe Company is in the process of developing and implementing a remediation plan for the identified material weakness. While there can be no assurance that these efforts will be successful, the Company expects to remediate the material weakness prior to the end of the fiscal year ending June 30, 2024. The remediation efforts are expected to result in the incurrence of additional expenses. If the remediation is not completed in a timely fashion, or at all, or if the remediation plan is inadequate, the Company may be unable to timely file future periodic reports with the SEC and/or its future financial statements could contain undetected errors.\nIn addition, there is no assurance that additional material weaknesses in the Companys internal control over financial reporting will not be identified in the future. Any failure to maintain or implement required new or improved controls, or any difficulties encountered in their implementation, could result in additional material weaknesses, or could result in material misstatements in the Companys financial statements, which could cause the Company to fail to timely meet its reporting obligations or cause investors to lose confidence in the Companys reported financial information, leading to a decline in the Companys stock price. Any of these events may also, among other things, subject the Company to litigation or investigations requiring the devotion of management time and resources and/or the payment of significant legal and other expenses.\nFurther, while businesses acquired during the fiscal year covered by the applicable Annual Report on Form 10-K are permitted to be excluded from the scope of managements report on internal control over financial reporting and the related auditor attestation for such Annual Report on Form 10-K (as is the case with the exclusion of the businesses acquired by the Company in fiscal 2023 from the scope of managements report on internal control over financial reporting and the related auditor attestation for this Report), the Company will face challenges and be required to incur expenses in connection with, and devote significant management time to, the internal control over financial reporting of acquired businesses. There is no assurance that any issues, deficiencies, significant deficiencies or material weaknesses in internal controls identified at acquired businesses will be remediated in a timely or cost-efficient manner or at all.\nThe Company has incurred, and expects to continue to incur, a substantial amount of management time and resources to comply with the requirements of Section 404 of the Sarbanes-Oxley Act of 2002. In this Report, the Companys management has provided an assessment as to the effectiveness of the Companys internal control over financial reporting. In addition, pursuant to Section 404(b) of the Sarbanes-Oxley Act of 2002, managements assessment of the effectiveness of the Companys internal control over financial reporting is subject to attestation by the Companys independent registered public accounting firm. This Report includes such attestation. However, there is no assurance that the Company will continue to timely comply with such requirements nor can there be assurance that significant deficiencies and/or material weaknesses will not be identified by management or the Companys independent registered public accounting firm (or, if identified, remedied in a timely fashion or at all), any of which may adversely affect the market price of the Companys common stock. In addition, the Companys compliance efforts will continue to require significant expenditures and devotion of management time, and may divert managements attention from the Companys operations. In addition, while businesses acquired during the fiscal year covered by the applicable Annual Report on Form 10-K are permitted to be excluded from the scope of managements report on internal control over financial reporting and the related auditor attestation for such Annual Report on Form 10-K (as is the case with the exclusion of the businesses acquired by the Company in fiscal 2023 from the scope of managements report on internal control over financial reporting and the related auditor attestation for this Report), the Company will face challenges and be required to incur expenses in connection with, and devote significant management time to, the internal control over financial reporting of acquired businesses. There is no assurance that any issues, deficiencies, significant deficiencies or material weaknesses in internal controls identified at acquired businesses will be remedied in a timely or cost-efficient manner or at all.\nThe Companys success depends on key personnel, the loss of whom could harm the Companys business, operating results and financial condition.\nThe Companys business is dependent on the active participation of its executive officers, including Henry M. Nahmad and Tom Marks. The loss of the services of any of these individuals could adversely affect the Companys business and prospects. In addition, the Companys success is dependent on its ability to retain and attract additional qualified management and other personnel. Competition for such talent is intense, and the Company may not be successful in attracting and retaining such personnel.\nLitigation and legal proceedings, the costs of defending the same and the impact of any finding of liability or damages could adversely impact the Company and its financial condition and operating results.\nThe Company may from time to time become subject to litigation and other legal proceedings. Litigation and other legal proceedings may require the Company to incur significant expenses, including those relating to legal and other professional fees. In addition, litigation and other legal proceedings are inherently uncertain, and adverse outcomes in litigation or other legal proceedings could adversely affect the Companys financial condition, cash flows, and operating results. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nThe Companys principal executive offices are located in Miami, Florida. The Companys principal properties include warehousing and distribution facilities and administrative office space, all of which are leased (generally for terms of three to ten years).\nAt June 30, 2023, the Company had 32 warehousing and distribution facilities and administrative facilities located across 19 U.S. states. Senior management and support staff are located at the Companys principal executive offices and other administrative offices mostly adjacent to the Companys warehousing and distribution facilities. The facilities have an aggregate of approximately 500,000 square feet of space. The Company believes that its facilities are sufficient to meet the Companys present operating needs. Item 3. Legal Proceedings.\nIn the ordinary course of business, the Company may from time to time be involved in, or subject to, legal and regulatory claims, proceedings, demands or actions. Litigation is inherently uncertain and the outcome of litigation cannot be predicted or determined in advance. In addition, the Companys costs of defending against litigation and other proceedings, demands and actions could be material and would generally be payable by the Company regardless of the merits of the claim. As of the date of filing of this Report, the Company is not aware of any pending legal proceedings to which the Company, including any of its subsidiaries, is a party which is expected to be material to the Company. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nThe Companys common stock is traded on the NYSE American under the symbol EVI.\nAs of September 22, 2023, there were approximately 171 holders of record of the Companys common stock.\nThe Company did not pay any dividends on its common stock during the fiscal years ended June 30, 2023 or 2022. The declaration and payment of cash dividends with respect to the Companys common stock is determined by the Companys Board of Directors based on the Companys financial condition and liquidity needs and other factors deemed relevant by the Companys Board of Directors, and may be subject to restrictions contained in the Companys debt instruments. As described elsewhere in this Report, including under Liquidity and Capital Resources in Item 7 of this Report, the Companys Credit Agreement contains certain covenants which may, among other things, restrict the Companys ability to pay dividends, and any future facilities may contain similar or more stringent requirements. The Companys management does not believe that the covenants contained in the Credit Agreement currently materially limit the Companys ability to pay dividends or are reasonably likely to materially limit the Companys ability to pay dividends in the future.\nOn October 4, 2023, the Companys Board of Directors declared a special cash dividend on the Companys common stock of $0.28 per share to be paid on October 26, 2023 to stockholders of record at the close of business on October 16, 2023. As described above, future dividends will be considered in light of the Companys financial position and liquidity needs, and other factors deemed relevant by the Companys Board of Directors.\nSee Part III, Item 12 of this Report for information regarding securities authorized for issuance under the Companys equity-based compensation plans.\nThe Company does not have in place any formal share repurchase plans or programs. Upon request by a recipient of awards granted under the Companys equity incentive plan, the Company may issue shares upon vesting of restricted stock awards or upon issuance of stock awards, net of the statutory withholding requirements that the Company pays on behalf of its employees. For financial statement purposes, the shares withheld are treated as being repurchased by the Company and are reflected as repurchases in the Companys condensed consolidated statements of cash flows and shareholders equity as they reduce the number of shares that would have been issued upon vesting.\nDuring the quarter ended June 30, 2023, the Company did not repurchase any shares of its common stock. Item 6. [Reserved]. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nGeneral\nThe following discussion should be read in conjunction with the Companys Consolidated Financial Statements and notes thereto contained in Item 8 of this Report. See also Cautionary Note Regarding Forward Looking Statements preceding Part I, Item 1 of this Report.\nOverview\nThe Company, through its wholly-owned subsidiaries, is a value-added distributor, and provides advisory and technical services. Through its vast sales organization, the Company provides its customers with planning, designing, and consulting services related to their commercial laundry operations. The Company sells and/or leases its customers commercial laundry equipment, specializing in washing, drying, finishing, material handling, water heating, power generation, and water reuse applications. In support of the suite of products it offers, the Company sells related parts and accessories. Additionally, through the Companys robust network of commercial laundry technicians, the Company provides its customers with installation, maintenance, and repair services.\nThe Companys customers include government, institutional, industrial, commercial and retail customers. Product purchases made by customers range from parts and accessories, to single or multiple units of equipment, to large complex systems. The Company also provides its customers with the services described above.\nBeginning in 2015, the Company implemented a buy-and-build growth strategy which includes (i) the consideration and pursuit of acquisitions and other strategic transactions which management believes may complement the Companys existing business or otherwise offer growth opportunities for, or benefit, the Company and (ii) the implementation of a growth culture at acquired businesses based on the exchange of ideas and business concepts among the management teams of the Company and the acquired businesses as well as through certain additional initiatives, which may include investments in additional sales and service personnel, new product lines, enhanced service operations and capabilities, new and improved facilities, and advanced technologies. See Buy-and-Build Growth Strategy below for additional information regarding the Companys buy-and-build growth strategy, including information regarding certain acquisitions consummated by the Company since its implementation of the buy-and-build growth strategy.\nThe Company reports its results of operations through a single operating and reportable segment.\nTotal revenues for the fiscal year ended June 30, 2023 (fiscal 2023) increased by 32% compared to the fiscal year ended June 30, 2022 (fiscal 2022). The increase in revenues during fiscal 2023 is attributable to increases in revenues at certain of the Companys legacy businesses due to improved conditions in connection with the continued recovery from the COVID-19 pandemic (which negatively impacted the Companys business and results beginning at the end of the quarter ended March 31, 2020; specifically, due to delays and declines in the placement of customer orders, the completion of equipment and parts installations, and the fulfillment of parts orders), the completion during fiscal 2023 of projects previously delayed by the COVID-19 pandemic, price increases established throughout the Companys product lines and service offerings aimed at maintaining or increasing margins to cover incremental product and operating cost increases, and revenues generated by businesses acquired by the Company during fiscal 2023. The increase in revenues was also attributable to the revenues of businesses acquired by the Company during fiscal 2022 whose results were consolidated in the Companys financial statements for all of fiscal 2023 as compared to just the period of fiscal 2022 from the respective closing date of the acquisition through the end of fiscal 2022.\nNet income for fiscal 2023 increased by 137% from fiscal 2022. The increase in net income was attributable primarily to the increases in revenue and the resulting gross profit, partially offset by the increases in selling, general and administrative expenses and interest expense.\nThe Companys operating expenses consist primarily of (a) selling, general and administrative expenses, primarily salaries, and commissions and marketing expenses that are variable and correlate to changes in sales, (b) expenses related to the operation of warehouse facilities, including a fleet of installation and service vehicles, and facility rent, which are payable mostly under non-cancelable operating leases, and (c) operating expenses at the parent company, including compensation expenses, fees for professional services, expenses associated with being a public company, including increased expenses attributable to the Companys growth, and expenses in furtherance of the Companys buy-and-build growth strategy.\nBuy-and Build Growth Strategy\nThe Companys acquisitions under its buy-and-build growth strategy described above since its implementation in 2015 include, without limitation, those set forth below. The acquired companies generally distribute commercial, industrial, and vended laundry products and provide installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry.\n● On October 10, 2016, the Company purchased substantially all of the assets of Western State Design, LLC, a California-based company, for a purchase price consisting of $18.5 million in cash and 2,044,990 shares of the Companys common stock.\n● On October 31, 2017, the Company purchased substantially all of the assets of Tri-State Technical Services, Inc., a Georgia-based company, for a purchase price consisting of approximately $7.95 million in cash and 338,115 shares of the Companys common stock.\n● On February 9, 2018, the Company purchased substantially all of the assets of Dallas-based companies, Zuf Acquisitions I LLC (d/b/a/ AAdvantage Laundry Systems) and Sky-Rent LP, for total consideration of approximately $20.4 million, consisting of approximately $8.1 million in cash and 348,360 shares of the Companys common stock.\n● On September 12, 2018, the Company purchased substantially all of the assets of Scott Equipment, Inc., a Houston-based company, for approximately $6.5 million in cash and 209,678 shares of the Companys common stock.\n● On February 5, 2019, the Company acquired PAC Industries Inc., a Pennsylvania-based company, for approximately $6.4 million in cash and 179,847 shares of the Companys common stock.\n● On November 3, 2020, the Company acquired Yankee Equipment Systems, LLC, a New Hampshire-based company, for approximately $4.6 million in cash and 278,385 shares of the Companys common stock.\n● On February 7, 2022, the Company acquired (the CLK Acquisition) Consolidated Laundry Equipment, Inc. and Central Equipment Company, LLC (collectively CLK), a North Carolina-based company, for approximately $3.3 million in cash, net of cash acquired, and 179,087 shares of the Companys common stock.\n● On June 1, 2022, the Company acquired (the CDL Acquisition) Clean Designs, Inc. and Clean Route, LLC (collectively CDL), a Colorado-based company, for approximately $5.4 million in cash.\nIn addition to the CLK Acquisition and the CDL Acquisition, during fiscal 2022, the Company acquired Mississippi-based LS Acquisition, LLC d/b/a Laundry South Systems and Repair (LSS), and Spynr, Inc. (SPR), a Delaware-based digital marketing and technology company which provides digital marketing services to customers and vendors within the commercial, industrial and vended laundry industries. The total consideration for these transactions consisted of $3.2 million in cash and the issuance of 34,391 shares of the Companys common stock.\nDuring fiscal 2023, the Company acquired Massachusetts-based Aldrich Clean-Tech Equipment Corp. (ACT), North Carolina-based K&B Laundry Service, LLC (K&B), Alabama-based Wholesale Commercial Laundry Equipment Company SE, LLC (WCL), and Maryland-based Gluno, Inc. d/b/a Express Parts and Services (EXP). The total consideration for these transactions consisted of $2.4 million in cash and the issuance of 24,243 shares of the Companys common stock.\nSee Note 3 to the Consolidated Financial Statements included in Item 8 of this Report for additional information about the acquisitions completed by the Company during fiscal 2023 and fiscal 2022.\nAcquisitions are generally effected by the Company through a separate wholly-owned subsidiary formed by the Company for the purpose of effecting the transaction, whether by an asset purchase or merger, and operating the acquired business following the transaction. In connection with each transaction, the Company, indirectly through its applicable wholly-owned subsidiary, also assumed certain of the liabilities of the acquired business. The financial position, including assets and liabilities, and results of operations of the acquired businesses following the respective closing dates of the acquisitions are included in the Companys consolidated financial statements.\nConsolidated Financial Condition\nThe Companys total assets increased from $230.8 million at June 30, 2022 to $253.8 million at June 30, 2023. The increase in total assets was primarily attributable to an increase in current assets, as described below under Liquidity and Capital Resources. The Companys total liabilities increased from $113.1 million at June 30, 2022 to $122.9 million at June 30, 2023, primarily due to increases in accrued employee expenses, customer deposits and long-term debt, partially offset by a decrease in accounts payable and accrued expenses. The increase in long-term debt was attributable to borrowings under the Companys credit facility in excess of optional repayments.\nLiquidity and Capital Resources\nThe Company had approximately $5.9 million of cash at June 30, 2023 compared to $4.0 million of cash at June 30, 2022. The increase in cash was primarily due to cash borrowed in excess of optional debt repayments under the Companys credit facility used to fund the cash consideration paid in connection with the Companys business acquisitions during fiscal 2023 and capital expenditures. The Companys primary sources of cash are sales of products and services, and borrowings under its credit facility. The Companys primary uses of cash are purchases of the products sold by the Company, employee related costs, and the cash consideration paid in connection with business acquisitions.\nThe following table summarizes the Companys Consolidated Statements of Cash Flows (in thousands):\nFiscal Year Ended June 30,\nNet cash provided (used) by:\nOperating activities $ 940 $ (1,898 )\nInvesting activities $ (5,986 ) $ (15,934 )\nFinancing activities $ 6,993 $ 15,749\nFor fiscal 2023, operating activities provided cash of approximately $0.9 million compared to cash used by operating activities of approximately $1.9 million in fiscal 2022. The $2.8 million increase in cash provided by operating activities was primarily attributable to increases in net income, partially offset by increases in the cash used by operating activities from changes in operating assets and liabilities.\nInvesting activities used cash of approximately $6.0 million during fiscal 2023 compared to approximately $15.9 million in fiscal 2022. The $9.9 million decrease in cash used by investing activities is due primarily to a greater amount of cash consideration paid in connection with acquisitions during fiscal 2022 as compared to fiscal 2023.\nFinancing activities provided cash of approximately $7.0 million in fiscal 2023 compared to cash provided by financing activities of approximately $15.7 million in fiscal 2022. The decrease in cash provided by financing activities was attributable primarily to a decrease in net borrowings to fund acquisitions during fiscal 2023.\nThe Company is a party, as borrower, to a syndicated credit agreement (the Credit Agreement) in the maximum aggregate principal amount of up to $100 million, with an accordion feature to increase the revolving credit facility by up to $40 million for a total of $140 million. A portion of the revolving credit facility is available for swingline loans of up to a sublimit of $5 million and for the issuance of standby letters of credit of up to a sublimit of $10 million. As of June 30, 2023, $57.3 million was available to borrow under the revolving credit facility.\nOn May 6, 2022, the Company entered into an amendment to the Credit Agreement. The amendment amended the Credit Agreement to, among other things, replace LIBOR with in connection with the phasing out of LIBOR. As a result, borrowings (other than swingline loans) under the Credit Agreement bear interest, at a rate based on (a) the Bloomberg Short-Term Bank Yield Index rate (the BSBY rate) plus a margin that ranges between 1.25% and 1.75% depending on the Companys consolidated leverage ratio, which is a ratio of consolidated funded indebtedness to consolidated earnings before interest, taxes, depreciation and amortization (EBITDA) (the Consolidated Leverage Ratio) or (b) the highest of (i) prime, (ii) the federal funds rate plus 50 basis points, and (iii) the BSBY rate plus 100 basis points (such highest rate, the Base Rate), plus a margin that ranges between 0.25% and 0.75% depending on the Consolidated Leverage Ratio. Swingline loans generally bear interest calculated at the Base Rate plus a margin that ranges between 0.25% and 0.75% depending on the Consolidated Leverage Ratio. The maturity date of the Credit Agreement is May 6, 2027.\nThe Credit Agreement contains certain covenants, including financial covenants requiring the Company to comply with maximum leverage ratios and minimum interest coverage ratios. The Credit Agreement also contains other provisions which may restrict the Companys ability to, among other things, dispose of or acquire assets or businesses, incur additional indebtedness, make certain investments and capital expenditures, pay dividends, repurchase shares and enter into transactions with affiliates. As of June 30, 2023, the Company was in compliance with its covenants under the Credit Agreement.\nThe obligations of the Company under the Credit Agreement are collateralized by substantially all of the assets of the Company and certain of its subsidiaries, and are guaranteed, jointly and severally, by certain of the Companys subsidiaries.\nThe Company believes that its existing cash, anticipated cash from operations and funds available under the Companys Credit Agreement will be sufficient to fund its operations and anticipated capital expenditures for at least the next twelve months from the filing of this Report, and thereafter. The Company may also seek to raise funds through the issuance of equity and/or debt securities or the incurrence of additional secured or unsecured indebtedness, including in connection with acquisitions or other transactions pursued by the Company as part of its buy-and-build growth strategy.\nOff-Balance Sheet Financing\nAs of June 30, 2023, the Company had no off-balance sheet financing arrangements within the meaning of Item 303(a)(4) of Regulation S-K.\nResults of Operations\nRevenues\nRevenues for fiscal 2023 increased by approximately $86.9 million (32%) from fiscal 2022. The increase in revenues during fiscal 2023 is attributable to increases in revenues at certain of the Companys legacy businesses due to improved conditions in connection with the continued recovery from the COVID-19 pandemic, the completion during fiscal 2023 of projects previously delayed by the COVID-19 pandemic, price increases established throughout the Companys product lines and service offerings aimed at maintaining or increasing margins to cover incremental product and operating cost increases, and revenues generated by businesses acquired by the Company during fiscal 2023. The increase in revenues was also attributable to the revenues of businesses acquired by the Company during fiscal 2022 whose results were consolidated in the Companys financial statements for all of fiscal 2023 as compared to just the period of fiscal 2022 from the respective closing date of the acquisition through the end of fiscal 2022.\nFrom time to time the Company enters into longer-term contracts to fulfill large complex laundry projects for divisions of the federal government where the nature of, and competition for, such contracts may result in a lower gross margin as compared to other equipment sales. During fiscal 2023, the Company entered into a number of such lower-margin equipment sales. The Company believes that the increase in equipment sales provides a strong foundation for the Company to further strengthen its customer relationships, including that they may in the future result in higher gross margin opportunities from the sale of parts, accessories, supplies, and technical services related to the equipment. Despite the lower gross margin from such longer-term contracts, the Company believes that the long-term benefit from the increase in its installed equipment base will outweigh the possible short-term impact to gross margin.\nCost of Sales and Selling, General and Administrative Expenses\nFiscal Year Ended\nJune 30,\nAs a percentage of revenues:\nCost of sales, net 70.7 % 72.4 %\nAs a percentage of revenues:\nSelling, general and administrative expenses 24.6 % 25.2 %\nCost of sales, expressed as a percentage of revenues, decreased to 70.7% in fiscal 2023 from 72.4% in fiscal 2022, representing gross margins of 29.3% in fiscal 2023 and 27.6% in fiscal 2022. The decrease in cost of sales, as a percentage of revenues, and increase in gross margin were primarily attributable to favorable changes in product and customer mix. The increase in gross margin is also attributable to the Companys efforts to drive higher quality sales opportunities from promoting solution selling as a value-added distributor. Longer-term federal government contracts entered into during fiscal 2023 lowered gross margins by 30 basis points.\nSelling, general and administrative expenses increased by approximately $19.9 million (30%) in fiscal 2023 compared to fiscal 2022, primarily due to (a) operating expenses of acquired businesses, including additional operating expenses at the acquired businesses in pursuit of future growth and in connection with the Companys optimization initiatives, (b) increases in selling costs, including commissions, from increases in revenues during fiscal 2023, and (c) increases in operating expenses and investments at the parent company level in connection with the Companys optimization initiatives, including expenses related to the consolidation of the Companys operations and the modernization of the Companys operations through the implementation of advanced technologies. As a percentage of revenues, selling, general and administrative expenses decreased to 24.6% in fiscal 2023 from 25.2% in fiscal 2022.\nInterest Expense\nInterest and other expense, net increased by approximately $1.8 million (269%) in fiscal 2023 compared to fiscal 2022. The increase is due primarily to increases in the average outstanding debt balance and average effective interest rate incurred on outstanding borrowings.\nProvision for Income Taxes\nThe Companys effective income tax rate was 30.6% for fiscal 2023 compared to 28.3% in fiscal 2022. The increase in the effective income tax rate in fiscal 2023 reflects an increase in the total state tax expense in higher rate jurisdictions.\nInflation\nInflation did not have a significant effect on the Companys results during fiscal 2023 or fiscal 2022. However, the Company faces risks relating to inflation, including the current inflationary trend, which may have an adverse impact on the market for the Companys products and services, including that there is no assurance that the Company will be able to effectively increase the price of its products and services to offset increased costs.\nTransactions with Related Parties\nCertain of the Companys subsidiaries lease warehouse and office space from one or more of the principals (or former principals) of the Company or its subsidiaries. These leases include the following:\nOn October 10, 2016, the Companys wholly-owned subsidiary, Western State Design, entered into a lease agreement pursuant to which it leases 17,600 square feet of warehouse and office space from an affiliate of Dennis Mack, a director and Executive Vice President, Corporate Strategy of the Company, and Tom Marks, Executive Vice President, Business Development and President of the West Region of the Company. The lease had an initial term of five years and provides for two successive three-year renewal terms at the option of the Company. Monthly base rental payments were $12,000 during the initial term of the lease. The Company exercised its option to renew the lease for the first three-year renewal term, which commenced in October 2021. Base rent for the first renewal term is $19,000 per month. In addition to base rent, Western State Design is responsible under the lease for costs related to real estate taxes, utilities, maintenance, repairs and insurance. Payments under this lease totaled approximately $228,000 and $207,000 during fiscal 2023 and fiscal 2022, respectively.\nOn October 31, 2017, the Companys wholly-owned subsidiary, Tri-State Technical Services, entered into lease agreements pursuant to which it leases a total of 81,000 square feet of warehouse and office space from an affiliate of Matt Stephenson, President of Tri-State. Monthly base rental payments total $21,000 during the initial terms of the leases. Each lease had an initial term of five years and provides for two successive three-year renewal terms at the option of the Company. The Company exercised its option to renew the leases for the first three-year renewal term, which commenced in October 2022. Base rent for the first renewal term is $25,000. In addition to such leases, since May 1, 2023, Tri-State Technical Services has also leased an additional 50,000 square feet of space from Mr. Stephenson. Monthly base rental payments for the additional space total $15,000. The term of this lease will expire upon the expiration of the other leases with Mr. Stephenson described above. In addition to base rent, Tri-State is responsible under the leases for costs related to real estate taxes, utilities, maintenance, repairs and insurance. Payments under these leases totaled approximately $306,000 and $252,000 during fiscal 2023 and fiscal 2022, respectively.\nOn November 1, 2018, the Companys wholly-owned subsidiary, AAdvantage Laundry Systems, entered into a lease agreement pursuant to which it leases warehouse and office space from an affiliate of Mike Zuffinetti, former Chief Executive Officer of AAdvantage. Monthly base rental payments under this lease were $26,000 initially. Pursuant to the lease agreement, on January 1, 2019, the lease expanded to cover additional warehouse space and, in connection therewith, monthly base rental payments under this lease increased to $36,000. In addition to base rent, AAdvantage is responsible under each of these leases for costs related to real estate taxes, utilities, maintenance, repairs and insurance. The lease has an initial term of five years and provides for two successive three-year renewal terms at the option of the Company, and the Company currently expects to exercise its option to renew this lease for the first three-year renewal term. Payments under the leases described in this paragraph totaled approximately $432,000 during fiscal 2023 and fiscal 2022.\nOn November 3, 2020, the Companys wholly-owned subsidiary, Yankee Equipment Systems, entered into a lease agreement pursuant to which it leases a total of 12,500 square feet of warehouse and office space from an affiliate of Peter Limoncelli, President of Yankee Equipment Systems. Monthly base rental payments total $11,000 during the initial term of the lease. In addition to base rent, Yankee Equipment Systems is responsible under the lease for costs related to real estate taxes, utilities, maintenance, repairs and insurance. The lease has an initial term of three years and provides for three successive three-year renewal terms at the option of the Company, and the Company currently expects to exercise its option to renew this lease for the first three-year renewal term. Payments under this lease totaled approximately $146,000 and $142,000 during fiscal 2023 and fiscal 2022, respectively.\nCritical Accounting Estimates\nUse of Estimates\nIn connection with the preparation of its financial statements in accordance with generally accepted accounting principles in the United States of America (GAAP), the Company makes estimates and assumptions, including those that affect the reported amounts of assets and liabilities, contingent assets and liabilities, and the reported amounts of revenues and expenses during the reported periods. Estimates and assumptions made may not prove to be correct, and actual results may differ from the estimates. The accounting policies that the Company has identified as critical to its business operations and to an understanding of the Companys financial statements are set forth below. The critical accounting policies discussed below are not intended to be a comprehensive list of all of the Companys accounting policies. In many cases, the accounting treatment of a particular transaction is specifically dictated by GAAP, with no need for managements judgment in their application. There are also areas in which managements judgment in selecting any available alternative would not produce a materially different result.\nRevenue Recognition\nPerformance Obligations and Revenue Over Time\nRevenue primarily consists of revenues from the sale or leasing of commercial and industrial laundry and dry cleaning equipment and steam and hot water boilers manufactured by others; the sale of related replacement parts and accessories; and the provision of installation and maintenance services. The Company generates revenue primarily from the sale of equipment and parts to customers. Therefore, the majority of the Companys contracts are short-term in nature and have a single performance obligation (to deliver products), and the Companys performance obligation is satisfied when control of the product is transferred to the customer. Other contracts contain a combination of equipment sales and services expected to be performed in the near-term, which services are distinct and accounted for as separate performance obligations. Judgment may be required by management to identify the distinct performance obligations within each contract. Revenue is recognized on these contracts when control transfers to the Companys customers via shipment of products or provision of services and the Company has the right to receive consideration for these products and services. Additionally, from time to time, the Company enters into longer-termed contracts which provide for the sale of equipment by the Company and the provision by the Company of related installation and construction services. The installation on these types of contracts is usually completed within six to twelve months. The Company recognizes a portion of its revenue over time using the cost-to-cost measure of progress, which measures a contracts progress toward completion based on the ratio of actual contract costs incurred to date to the Companys estimated costs at completion adjusted for uninstalled materials, as necessary. Significant judgment may be required by management in the cost estimation process for these contracts, which is based on the knowledge and experience of the Companys project managers, subcontractors and financial professionals. Changes in job performance and job conditions are factors that influence estimates of the total contract transaction price, total costs to complete those contracts and the Companys revenue recognition. The determination of the total estimated cost and progress toward completion requires management to make significant estimates and assumptions. Total estimated costs to complete projects include various costs such as direct labor, material and subcontract costs. Changes in these estimates can have a significant impact on the revenue recognized each period. From time to time, the Company also enters into maintenance and service contracts. These longer-term contracts, maintenance and service contracts have a single performance obligation where revenue is recognized over time using the cost-to-cost measure of progress, which best depicts the continuous transfer of control of goods or services to the customer.\nThe Company measures revenue, including shipping and handling fees charged to customers, as the amount of consideration it expects to be entitled to receive in exchange for its products or services, net of any taxes collected from customers and subsequently remitted to governmental authorities. Costs associated with shipping and handling activities performed after the customer obtains control are accounted for as fulfillment costs.\nRevenue from products transferred to customers at a point in time is recognized when obligations under the terms of the contract with the Companys customer are satisfied, which generally occurs with the transfer of control upon shipment.\nRevenues that are recognized over time include (i) longer-termed contracts that include an equipment purchase with installation and construction services, (ii) maintenance contracts, and (iii) service contracts.\nContract Assets and Liabilities\nContract assets and liabilities are presented in the Companys condensed consolidated balance sheets. Contract assets consist of unbilled amounts resulting from sales under longer-term contracts when the cost-to-cost method of revenue recognition is utilized and revenue recognized exceeds the amount billed to the customer. As noted above, the cost estimation process for these contracts may require significant judgment by management. The Company typically receives progress payments on sales under longer-term contracts as work progresses, although for some contracts the Company may be entitled to receive an advance payment. Contract assets also include retainage. Retainage represents a portion of the contract amount that has been billed, but for which the contract allows the customer to retain a portion of the billed amount (generally, from 5% to 20% of contract billings) until final contract settlement. Retainage amounts are generally classified as current assets within the Companys consolidated balance sheets. Retainage that has been billed, but is not due until completion of performance and acceptance by customers, is generally expected to be collected within one year. Contract liabilities consist of advanced payments, billings in excess of costs incurred and deferred revenue.\nGoodwill\nThe Company evaluates goodwill for impairment annually or more frequently when an event occurs or circumstances change that indicate that the carrying value may not be recoverable. Goodwill is tested for impairment at the reporting unit level by first performing a qualitative assessment to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. If the reporting unit does not pass the qualitative assessment, then the reporting unit's carrying value is compared to its fair value. If the fair value is determined to be less than the carrying value, a second step is performed to measure the amount of impairment loss. This step compares the current implied goodwill in the reporting unit to its carrying amount. If the carrying amount of the goodwill exceeds the implied goodwill, an impairment is recorded for the excess. The identification and measurement of goodwill impairment involves the estimation of the fair value of the reporting unit and involves uncertainty because management must use judgment in determining appropriate assumptions to be used in the measurement of fair value. The Company performed its annual impairment test on April 1, 2023 and determined there was no impairment.\nCustomer Relationships, Tradenames and Other Intangible Assets\nCustomer relationships, tradenames, non-competes, and other intangible assets are stated at cost less accumulated amortization. These assets with a finite-life are amortized on a straight-line basis over the estimated future periods to be benefited (5-10 years). The estimates of fair value of the Companys indefinite-lived intangibles are based on information available as of the date of the assessment and take into account managements assumptions about expected future cash flows and other valuation techniques. The Company reviews the recoverability of intangible assets that are amortized based primarily upon an analysis of undiscounted cash flows from the intangible assets. In the event the expected future cash flows become less than the carrying amount of the assets, an impairment loss would be recorded in the period the determination is made based on the fair value of the related assets.\nIncome Taxes\nThe Company follows Financial Accounting Standards Board (FASB) ASC Topic 740, Income Taxes (ASC 740). Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recognized for the future tax consequences attributed to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under ASC 740, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. If it is determined that it is more likely than not that some portion of a deferred tax asset will not be realized, a valuation allowance is recognized.\nSignificant judgment is required in developing the Companys provision for income taxes, deferred tax assets and liabilities, and any valuation allowances that might be required against the deferred tax assets. Management evaluates the Companys ability to realize its deferred tax assets on a quarterly basis and adjusts its valuation allowance when it believes that it is more likely than not that the asset will not be realized.\nSee Note 10 to the Consolidated Financial Statements included in Item 8 of this Report for additional information regarding income taxes.\nRecently Issued Accounting Guidance\nSee Note 2 to the Consolidated Financial Statements included in Item 8 of this Report for a description of Recently Issued Accounting Guidance. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nMarket risk is defined as the risk of loss arising from adverse changes in market valuations resulting from interest rate risk, foreign currency exchange rate risk, commodity price risk and equity price risk. The Companys primary market risk is interest rate risk.\nThe Companys indebtedness subjects the Company to interest rate risk. Interest rates are subject to the influence of economic conditions generally, both domestic and foreign, and also to the monetary and fiscal policies of the United States and its agencies, particularly the Federal Reserve. The nature and timing of any changes in such policies or general economic conditions and the effect they may have on the Company are unpredictable. The Companys indebtedness may also have other important impacts on the Company, including that the Company will be required to utilize cash flow to service the debt, indebtedness may make the Company more vulnerable to economic downturns, and the Companys indebtedness subjects the Company to covenants, which may place restrictions on its operations and activities, including its ability to pay dividends and take certain other actions. Interest on borrowings under the Companys Credit Agreement accrue at a rate, at the Companys election at the time of borrowing, equal to (a) the BSBY rate plus a margin that ranges from 1.25% to 1.75% depending on the Companys Consolidated Leverage Ratio or (b) the highest of (i) prime, (ii) the federal funds rate plus 50 basis points, and (iii) the BSBY rate plus 100 basis points (such highest rate, the Base Rate), plus a margin that ranges from 0.25% to 0.75% depending on the Consolidated Leverage Ratio. As of June 30, 2023, the Company had approximately $35.0 million of outstanding borrowings under the Credit Agreement, which accrued interest at a weighted average rate of 5.81%. Based on the amounts outstanding at June 30, 2023, a hypothetical 1% increase in daily interest rates would increase the Companys annual interest expense by approximately $350,000.\nAll of the Companys export sales require the customer to make payment in United States dollars. Accordingly, foreign sales may be affected by the strength of the United States dollar relative to the currencies of the countries in which the Companys customers are located, as well as the strength of the economies of the countries in which the Companys customers are located. The Company has, at times in the past, paid certain suppliers in Euros. The Company had no foreign exchange contracts outstanding at June 30, 2023 or 2022.\nThe Companys cash is maintained in bank accounts which bear interest at prevailing interest rates. While depositary accounts are covered by Federal Deposit Insurance Corporation (FDIC) insurance and the Company does not currently believe that it is exposed to significant credit risk due to the financial position of the banks in which the Companys cash is held, there recently have been adverse events related to the soundness of financial institutions, including a number of smaller bank failures, and the Company has exposure to the extent its cash balances exceed the current $250,000 in maximum FDIC coverage. Item 8. Financial Statements and Supplementary Data.\nEVI Industries, Inc. and Subsidiaries\nIndex to Consolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm (BDO USA, LLP; Miami, Florida; PCAOB ID #243) 38\nConsolidated Balance Sheets at June 30, 2023 and 2022 41\nConsolidated Statements of Operations for the years ended June 30, 2023 and 2022 43\nConsolidated Statements of Shareholders Equity for the years ended June 30, 2023 and 2022 44\nConsolidated Statements of Cash Flows for the years ended June 30, 2023 and 2022 45\nNotes to Consolidated Financial Statements 46\nReport of Independent Registered Public Accounting Firm\nShareholders and Board of Directors\nEVI Industries, Inc.\nMiami, Florida\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of EVI Industries, Inc. (the Company) as of June 30, 2023 and 2022, the related consolidated statements of operations, shareholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at June 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of June 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and our report dated October 4, 2023 expressed an adverse opinion thereon.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Estimated Costs to Complete\nAs described in Note 2 to the consolidated financial statements, the Company recognizes a portion of its revenue over time using the cost-to-cost measure of progress, which measures a contracts progress toward completion based on the ratio of actual contract costs incurred to date to the Companys estimated costs at completion, adjusted for uninstalled materials, as necessary. The cost estimation process for these contracts is based on the knowledge and experience of the Companys project managers, subcontractors and financial professionals. Changes in job performance and job conditions are factors that influence estimates of the total contract transaction price, total costs to complete those contracts and the Companys revenue recognition.\nWe identified the determination of the total estimated costs and progress toward completion of revenue contracts as a critical audit matter. These elements require management to make significant estimates and assumptions. Total estimated costs to complete projects include various costs such as direct labor, material and subcontract costs. Changes in these estimates can have a significant impact on the revenue recognized each period. Auditing these elements involved auditor judgment in evaluating the reasonableness of managements assumptions and estimates over the duration of these contracts.\nThe primary procedures we performed to address this critical audit matter included:\n● Testing the design, implementation and operating effectiveness of certain controls related to estimated costs to complete, including controls over: (i) development of project estimates and review of key cost inputs, (ii) ongoing assessment and revisions to project estimates, and (iii) ongoing review of project status including nature of activities required to complete open projects.\n● Evaluating the reasonableness of a sample of project estimates for projects completed during the year through a retrospective review against actual performance at project completion.\n● Assessing the reasonableness of the estimated costs to complete for a sample of open projects through: (i) evaluating the reasonableness of project budgets and the nature of costs required to complete open projects, (ii) assessing the status of completion of respective projects through testing of a sample of project costs incurred to date, (iii) evaluating the reasonableness of project status by performing inquiries of project managers, confirming with subcontractors and assessing the nature of activities required to complete open projects, and (iv) performing retrospective review for open projects and investigating significant budget to actual variances.\n● Assessing the reasonableness of changes in estimated costs to complete for a sample of contracts during the year and investigating reasons for changes in expected costs and project margins.\n/s/ BDO USA, P.C.\nWe have served as the Company's auditor since 2018.\nMiami, Florida\nOctober 4, 2023\nEVI Industries, Inc. and Subsidiaries\nConsolidated Balance Sheets\n(In thousands, except share and per share data)\nASSETS\nJune 30,\nJune 30,\nCurrent assets\nCash and cash equivalents $ 5,921 $ 3,974\nAccounts receivable, net of allowance for doubtful accounts 48,391 43,014\nInventories 59,167 49,359\nVendor deposits 2,291 1,728\nContract assets 1,181 1,519\nOther current assets 8,547 6,018\nTotal current assets 125,498 105,612\nEquipment and improvements, net 12,953 13,033\nOperating lease assets 8,714 7,480\nIntangible assets, net 24,128 26,234\nGoodwill 73,388 71,039\nOther assets 9,166 7,370\nTotal assets $ 253,847 $ 230,768\nThe accompanying notes are an integral part of these consolidated financial statements.\nEVI Industries, Inc. and Subsidiaries\nConsolidated Balance Sheets\n(In thousands, except share and per share data)\nLIABILITIES AND\nSHAREHOLDERS EQUITY\nJune 30,\nJune 30,\nCurrent liabilities\nAccounts payable and accrued expenses $ 38,730 $ 42,026\nAccrued employee expenses 10,724 8,508\nCustomer deposits 23,296 21,288\nContract liabilities\nCurrent portion of operating lease liabilities 3,027 2,518\nTotal current liabilities 76,445 74,847\nDeferred income taxes, net 5,023 4,666\nLong-term operating lease liabilities 6,554 5,736\nLong-term debt, net 34,869 27,840\nTotal liabilities 122,891 113,089\nCommitments and contingencies (Note 14)\nShareholders equity\nPreferred stock, $1.00 par value; authorized shares - 200,000; none issued and outstanding -\n-\nCommon stock, $.025 par value; authorized shares - 20,000,000; 12,711,558 shares issued at June 30, 2023 and 12,650,126 shares issued at June 30, 2022, including shares held in treasury\nAdditional paid-in capital 101,225 97,544\nRetained earnings 32,608 22,889\nTreasury stock, 134,001 shares, at cost, at June 30, 2023 and 127,801 shares, at cost, at June 30, 2022 (3,195 ) (3,070 )\nTotal shareholders equity 130,956 117,679\nTotal liabilities and shareholders equity $ 253,847 $ 230,768\nThe accompanying notes are an integral part of these consolidated financial statements.\nEVI Industries, Inc. and Subsidiaries\nConsolidated Statements of Operations\n(in thousands, except per share data)\nFor the year\nended\nJune 30,\nRevenues $ 354,173 $ 267,316\nCost of sales 250,490 193,609\nGross profit 103,683 73,707\nSelling, general and administrative expenses 87,177 67,318\nOperating income 16,506 6,389\nInterest expense, net 2,507\nIncome before provision for income taxes 13,999 5,710\nProvision for income taxes 4,280 1,615\nNet income $ 9,719 $ 4,095\nNet earnings per share - basic $ 0.68 $ 0.30\nNet earnings per share - diluted $ 0.67 $ 0.29\nThe accompanying notes are an integral part of these consolidated financial statements.\nEVI Industries, Inc. and Subsidiaries\nConsolidated Statements of Shareholders Equity\n(In thousands, except share data)\nAdditional\nCommon Stock Paid-in Treasury Stock Retained\nShares Amount Capital Shares Cost Earnings Total\nBalance at June 30, 2021 12,399,137 $ 310 $ 90,501 120,706 $ (2,865 ) $ 18,794 $ 106,740\nShare repurchases - -\n-\n7,095 (205 ) -\n(205 )\nVesting of restricted shares 20,835 (1 ) - -\n-\n-\nIssuances of shares under employee stock purchase plan 8,389 -\n-\n-\n-\nIssuances of shares in connection with acquisitions 213,478 4,326 -\n-\n-\n4,331\nStock compensation 8,287 - 2,598 - -\n-\n2,598\nNet income - -\n-\n- -\n4,095 4,095\nBalance at June 30, 2022 12,650,126 97,544 127,801 (3,070 ) 22,889 117,679\nShare repurchases -\n-\n-\n6,200 (125 ) -\n(125 )\nVesting of restricted shares 31,757 (1 ) -\n-\n-\n-\nIssuances of shares under employee stock purchase plan 5,432 -\n-\n-\n-\nIssuances of shares in connection with acquisitions 24,243 -\n-\n-\nStock compensation - -\n3,062 - -\n-\n3,062\nNet income - -\n-\n- -\n9,719 9,719\nBalance at June 30, 2023 12,711,558 $ 318 $ 101,225 134,001 $ (3,195 ) $ 32,608 $ 130,956\nThe accompanying notes are an integral part of these consolidated financial statements.\nEVI Industries, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\n(In thousands)\nYears ended June 30,\nOperating activities:\nNet income $ 9,719 $ 4,095\nAdjustments to reconcile net income to net cash (used) provided by operating activities:\nDepreciation and amortization 6,024 5,209\nAmortization of debt discount\nProvision for bad debt expense\nNon-cash lease expense\nStock compensation 3,062 2,598\nInventory reserve (178 ) (105 )\nProvision (benefit) for deferred income taxes (164 )\nOther (103 ) (24 )\n(Increase) decrease in operating assets:\nAccounts receivable (5,664 ) (12,139 )\nInventories (8,302 ) (20,396 )\nVendor deposits (527 ) (1,191 )\nContract assets (1,172 )\nOther assets (4,296 ) (433 )\n(Decrease) increase in operating liabilities:\nAccounts payable and accrued expenses (4,164 ) 13,265\nAccrued employee expenses 2,114\nCustomer deposits 1,567 9,755\nContract liabilities (2,725 )\nNet cash provided (used) by operating activities (1,898 )\nInvesting activities:\nCapital expenditures (3,708 ) (3,981 )\nCash paid for acquisitions, net of cash acquired (2,278 ) (11,953 )\nNet cash used by investing activities (5,986 ) (15,934 )\nFinancing activities:\nProceeds from borrowings 77,000 65,000\nDebt repayments (70,000 ) (49,000 )\nPayment of debt issuance costs -\n(166 )\nRepurchases of common stock in satisfaction of employee tax withholding obligations (125 ) (205 )\nIssuances of common stock under employee stock purchase plan\nNet cash provided by financing activities 6,993 15,749\nNet increase (decrease) in cash 1,947 (2,083 )\nCash at beginning of year 3,974 6,057\nCash at end of year $ 5,921 $ 3,974\nSupplemental information:\nCash paid for interest $ 2,469 $ 494\nCash paid for income taxes $ 3,099 $ 430\nSupplemental disclosure of non-cash financing activities\nCommon stock issued for acquisitions $ 503 $ 4,331\nThe accompanying notes are an integral part of these consolidated financial statements.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n1. General\nNature of Business\nEVI Industries, Inc., indirectly through its subsidiaries (EVI Industries, Inc. and its subsidiaries, collectively, the Company), is a value-added distributor, and provides advisory and technical services to customers located primarily in the United States of America (United States or US), Canada, the Caribbean, and Latin America. Through its sales organization, the Company provides its customers with planning, designing, and consulting services related to their commercial laundry operations. The Company sells and/or leases its customers commercial laundry equipment, specializing in washing, drying, finishing, material handling, water heating, power generation, and water reuse applications. In support of the suite of products it offers, the Company sells related parts and accessories. Additionally, through the Companys network of commercial laundry technicians, the Company provides its customers with installation, maintenance, and repair services.\nThe Companys customers include government, institutional, industrial, commercial and retail customers. Product purchases made by customers range from parts and accessories, to single or multiple units of equipment, to large complex systems. The Company also provides its customers with the services described above.\nThe Company reports its results of operations through a single operating and reportable segment.\nBuy-and-Build Growth Strategy\nBeginning in 2015, the Company implemented a buy-and-build growth strategy. The Companys acquisitions under its buy-and-build growth strategy since its implementation in 2015 include, without limitation, those described below.\n● On October 10, 2016, the Company purchased substantially all of the assets of Western State Design, LLC, a California-based company, for a purchase price consisting of $18.5 million in cash and 2,044,990 shares of the Companys common stock.\n● On October 31, 2017, the Company purchased substantially all of the assets of Tri-State Technical Services, Inc., a Georgia-based company, for a purchase price consisting of approximately $7.95 million in cash and 338,115 shares of the Companys common stock.\n● On February 9, 2018, the Company purchased substantially all of the assets of Dallas-based companies, Zuf Acquisitions I LLC (d/b/a/ AAdvantage Laundry Systems) and Sky-Rent LP, for total consideration of approximately $20.4 million, consisting of approximately $8.1 million in cash and 348,360 shares of the Companys common stock.\n● On September 12, 2018, the Company purchased substantially all of the assets of Scott Equipment, Inc., a Houston-based company, for approximately $6.5 million in cash and 209,678 shares of the Companys common stock.\n● On February 5, 2019, the Company acquired PAC Industries Inc., a Pennsylvania-based company, for approximately $6.4 million in cash and 179,847 shares of the Companys common stock.\n● On November 3, 2020, the Company acquired Yankee Equipment Systems, LLC, a New Hampshire-based company, for approximately $4.6 million in cash and 278,385 shares of the Companys common stock.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n● On February 7, 2022, the Company acquired Consolidated Laundry Equipment, Inc. and Central Equipment Company, LLC (collectively CLK), a North Carolina-based company, for approximately $3.3 million in cash, net of cash acquired, and 179,087 shares of the Companys common stock.\n● On June 1, 2022, the Company acquired Clean Designs, Inc. and Clean Route, LLC (collectively CDL), a Colorado-based company, for approximately $5.4 million in cash.\nSee Note 3 for additional information about the acquisitions of CLK and CDL and the other acquisitions consummated by the Company during the fiscal year ended June 30, 2023 (fiscal 2023) and the fiscal year ended June 30, 2022 (fiscal 2022).\nThe acquired companies generally distribute commercial, industrial, and vended laundry products and provide installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry. Acquisitions are generally effected by the Company through a separate wholly-owned subsidiary formed by the Company for the purpose of effecting the transaction, whether by an asset purchase or merger, and operating the acquired business following the transaction. In connection with each transaction, the Company, indirectly through its applicable wholly-owned subsidiary, also assumed certain of the liabilities of the acquired business.\nThe financial position, including assets and liabilities, and results of operations of the acquired businesses following the respective closing dates of the acquisitions are included in the Companys consolidated financial statements.\n2. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of EVI Industries, Inc. and its subsidiaries, all of which are wholly-owned. All significant intercompany transactions and balances have been eliminated in consolidation.\nRevenue Recognition\nThe Company recognizes revenue, net of sales taxes, when a sales arrangement with a customer exists (sales contract, purchase or sales order, or other indication of an arrangement), the transaction price is fixed and determinable, and the Company has satisfied the performance obligation(s) per the sales arrangement.\nPerformance Obligations and Revenue Over Time\nRevenue primarily consists of revenues from the sale or leasing of commercial and industrial laundry and dry cleaning equipment and steam and hot water boilers manufactured by others; the sale of related replacement parts and accessories; and the provision of installation and maintenance services. The Company generates revenue primarily from the sale of equipment and parts to customers. Therefore, the majority of the Companys contracts are short-term in nature and have a single performance obligation (to deliver products), which is satisfied when control of the product is transferred to the customer. Other contracts contain a combination of equipment sales with a service such as connection of the equipment, which is expected to be performed in the near-term. Such services are distinct and accounted for as separate performance obligations. The Company allocates the transaction price to each performance obligation based on its relative standalone selling price out of the total consideration of the contract. Judgment may be required by management to identify the distinct\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nperformance obligations within each contract. Revenue is recognized on these contracts when control transfers to the Companys customers via shipment of products or provision of services and the Company has the right to receive consideration for these products and services. Additionally, from time to time, the Company enters into longer-termed contracts which provide for the sale of equipment by the Company and the provision by the Company of related installation and construction services. The installation on these types of contracts is usually completed within six to twelve months. The Company recognizes a portion of its revenue over time using the cost-to-cost measure of progress, which measures a contracts progress toward completion based on the ratio of actual contract costs incurred to date to the Companys estimated costs at completion adjusted for uninstalled materials, as necessary. Significant judgment may be required by management in the cost estimation process for these contracts, which is based on the knowledge and experience of the Companys project managers, subcontractors and financial professionals. Changes in job performance and job conditions are factors that influence estimates of the total contract transaction price, total costs to complete those contracts and the Companys revenue recognition. The determination of the total estimated cost and progress toward completion requires management to make significant estimates and assumptions. Total estimated costs to complete projects include various costs such as direct labor, material and subcontract costs. Changes in these estimates can have a significant impact on the revenue recognized each period. From time to time, the Company also enters into maintenance contracts and ad hoc maintenance and installation service contracts. These longer-term contracts, and maintenance and service contracts have a single performance obligation where revenue is recognized over time using the cost-to-cost measure of progress, which best depicts the continuous transfer of control of goods or services to the customer.\nThe Company measures revenue, including shipping and handling fees charged to customers, as the amount of consideration it expects to be entitled to receive in exchange for its goods or services, net of any taxes collected from customers and subsequently remitted to governmental authorities. Costs associated with shipping and handling activities performed after the customer obtains control are accounted for as fulfillment costs and are not promised services that have to be further evaluated under revenue recognition standards.\nRevenue from products transferred to customers at a point in time include commercial and vended laundry parts and equipment sales and accounted for approximately 85% and 82% of the Companys revenue for fiscal 2023 and fiscal 2022, respectively. Revenue from products transferred to customers at a point in time is recognized when obligations under the terms of the contract with the Companys customer are satisfied, which generally occurs with the transfer of control upon shipment.\nThe Companys products are typically sold with a manufacturers warranty. Accordingly, warranty expense and product returns have not been significant.\nRevenues that are recognized over time include (i) longer-termed contracts that include equipment purchased with installation and construction services, (ii) maintenance contracts, and (iii) service contracts. Revenue from products and services that are recognized over time accounted for approximately 15% and 18% of the Companys revenue for fiscal 2023 and fiscal 2022, respectively.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nContract Assets and Liabilities\nContract assets and liabilities are presented in the Companys consolidated balance sheets. Contract assets consist of unbilled amounts resulting from sales under longer-term contracts when the cost-to-cost method of revenue recognition is utilized and revenue recognized exceeds the amount billed to the customer. As noted above, the cost estimation process for these contracts may require significant judgment by management. The Company typically receives progress payments on sales under longer-term contracts as work progresses, although for certain contracts, the Company may be entitled to receive an advance payment. Contract assets also include retainage. Retainage represents a portion of the contract amount that has been billed, but for which the contract allows the customer to retain a portion of the billed amount (generally, from 5% to 20% of contract billings) until final contract settlement. Retainage amounts are generally classified as current assets within the Companys consolidated balance sheets. Retainage that has been billed, but is not due until completion of performance and acceptance by customers, is generally expected to be collected within one year. Contract liabilities consist of advanced payments, billings in excess of costs incurred and deferred revenue.\nCosts, estimated earnings and billings on longer-term contracts when the cost-to-cost method of revenue recognition is utilized as of June 30, 2023 and 2022 consisted of the following (in thousands):\nJune 30,\nCosts incurred on uncompleted contracts $ 13,378 $ 6,143\nEstimated earnings 2,268\nLess: billings to date (16,148 ) (7,270 )\nRetainage 1,015 1,487\nEnding balance $ 513 $ 1,012\nThese amounts are included in the Companys consolidated balance sheets under the following captions (in thousands):\nJune 30,\nContract assets $ 1,181 $ 1,519\nContract liabilities (668 ) (507 )\nEnding balance $ 513 $ 1,012\nContract liabilities are generally associated with contracts with durations of less than one year. Accordingly, such amounts are expected to be realized during the subsequent year. During fiscal 2023, substantially all of the contract liabilities outstanding as of June 30, 2022 were realized.\nThe Company does not account for significant financing components if the period between the time when the transfer of the product or service to the customer occurs and when the customer pays for that service or product will be one year or less. The Company does not disclose the value of remaining performance obligations for contracts with an original expected period of one year or less or performance obligations for which the Company recognizes revenue at the amount that it has the right to invoice for services performed.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nGoodwill\nGoodwill is recorded when the purchase price paid for an acquisition exceeds the fair value of net assets acquired in a business combination. The Company evaluates goodwill for impairment annually or more frequently when an event occurs or circumstances change that indicate that the carrying value may not be recoverable. Goodwill is tested for impairment at the reporting unit level by first performing a qualitative assessment to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying value. If the reporting unit does not pass the qualitative assessment, then the reporting unit's carrying value is compared to its fair value. If the fair value is determined to be less than the carrying value, a second step is performed to measure the amount of impairment loss. This step compares the current implied goodwill in the reporting unit to its carrying amount. If the carrying amount of the goodwill exceeds the implied goodwill, an impairment is recorded for the excess. The identification and measurement of goodwill impairment involves the estimation of the fair value of the reporting unit and involves uncertainty because management must use judgment in determining appropriate assumptions to be used in the measurement of fair value. The Company performed its annual impairment test on April 1, 2023 using the qualitative assessment to evaluate relevant events and circumstances such as macroeconomic conditions, cost factors, financial performance, and others. Based on the assessment, the Company determined there was no impairment.\nAccounts Receivable\nAccounts receivable are customer obligations due under what management believes to be customary trade terms. Invoices are typically due upon receipt, however, the Company may grant extended payment terms, typically 30 days, for certain customers. The Company sells its products primarily to hospitals, nursing homes, government institutions, laundry plants, hotels, motels, vended laundry facilities and distributors and dry cleaning stores and chains. The Company performs continuing credit evaluations of its customers financial condition and depending on the terms of credit, the amount of the credit granted and managements history with a customer, the Company may require the customer to grant a security interest in the purchased equipment as collateral for the receivable. Management reviews accounts receivable on a regular basis to determine whether it is probable that any amounts are impaired. The Company includes any balances that are deemed probable to be impaired in its overall allowance for doubtful accounts. The provision for doubtful accounts is recorded in selling, general and administrative expenses in the consolidated statements of operations. If customary attempts to collect a receivable are not successful, the receivable is then written off against the allowance for doubtful accounts. The Companys allowance for doubtful accounts was $2.1 million at June 30, 2023 and $1.6 million at June 30, 2022. Actual write-offs may vary from the recorded allowance.\nCash and Cash Equivalents\nThe Company classifies as cash equivalents all highly liquid investments with an original maturity of three months or less.\nThe Companys cash is maintained in bank accounts which bear interest at prevailing interest rates and are covered by Federal Deposit Insurance Corporation (FDIC) insurance. The Company has not historically experienced any losses in its cash accounts and does not currently believe that it is exposed to significant credit risk due to the financial position of the banks in which the Companys cash is held. The Company monitors the strength and credit worthiness of financial institutions in which it holds its cash. However, there recently have been adverse events related to the soundness of financial institutions, including a number of smaller bank failures, and the Company has exposure to the extent its cash balances exceed the current $250,000 in maximum FDIC coverage.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nInventories\nInventories consist principally of equipment inventories and spare part inventories. Equipment inventories are valued at the lower of cost, determined on the specific identification method or average cost, or net realizable value. Spare part inventories are valued at the lower of cost, determined on average cost or first-in first-out method, or net realizable value. Lower of cost or net realizable value adjustments are recorded in cost of goods sold in the consolidated statement of operations. The Company records a reserve for aging or slow-moving inventory.\nThe Company established reserves of approximately $994,000 and $703,000 as of June 30, 2023 and 2022, respectively, against slow moving inventory.\nVendor Deposits\nVendor deposits represent advances made to the Companys vendors for specialized inventory on order.\nEquipment, Improvements and Depreciation\nProperty and equipment are stated at cost less accumulated depreciation and amortization. Depreciation and amortization are calculated on straight-line methods over useful lives of five to seven years for furniture and equipment, five years for vehicles, and the shorter of ten years or the remaining lease term (including renewal periods that are deemed reasonably assured) for leasehold improvements. Depreciation and amortization of property and equipment is included in selling, general and administrative expenses in the consolidated statements of operations. Repairs and maintenance costs are expensed as incurred.\nSoftware Capitalization\nThe Company capitalizes certain costs related to the acquisition and development of internal use software, including implementation costs incurred in a cloud computing arrangement, during the application development stages of projects. The Company amortizes these costs using the straight-line method over the estimated useful life of the software, typically seven years. Costs incurred during the preliminary project or the post-implementation/operation stages of the project are expensed as incurred. Capitalized computer software, included as a component of equipment and improvements, net in the accompanying consolidated balance sheets, net of accumulated amortization, was $576,000 and $671,000 at June 30, 2023 and 2022, respectively. Computer software amortization expense was $112,000 and $89,000 in fiscal 2023 and fiscal 2022, respectively. Amortization of capitalized software is included in selling, general and administrative expenses in the consolidated statements of operations.\nCustomer-Related Intangibles, Tradenames and Other Intangible Assets\nFinite-lived intangibles are amortized over their estimated useful life while indefinite-lived intangibles and goodwill are not amortized. Customer-related intangibles, non-compete, and other finite-lived intangible assets are stated at cost less accumulated amortization, and are amortized on a straight-line basis over the estimated future periods to be benefited (5-10 years). The estimates of fair value of the Companys indefinite-lived intangibles and long-lived assets are based on information available as of the date of the assessment and takes into account managements assumptions about expected future cash flows and other valuation techniques. Amortization of finite-lived intangibles is included in selling, general and administrative expenses in the consolidated statements of operations. The Company also evaluates indefinite-lived intangible assets each reporting period to determine whether events and circumstances continue to support an indefinite useful life. The Company performed its annual impairment test on April 1, 2023 using the qualitative assessment to evaluate relevant events and circumstances such as macroeconomic conditions, cost factors, financial performance, and others. Based on the assessment, the Company determined there was no impairment.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nAsset Impairments\nThe Company periodically reviews the carrying amounts of its long-lived assets, including property, plant and equipment and finite-lived intangible assets, for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to future undiscounted cash flows expected to be generated by the asset. If an asset is considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the asset exceeds the fair value of the asset. Assets to be disposed of are reported at the lower of their carrying amount or fair value less estimated costs to sell. The Company has concluded that there was no impairment of long-lived assets in fiscal 2023 or fiscal 2022.\nEstimates\nThe preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Management evaluates these estimates on an ongoing basis. Estimates which may be particularly significant to the Companys consolidated financial statements include those relating to the determination of impairment of assets (including goodwill and intangible assets), the useful life of property and equipment, the recoverability of deferred income tax assets, allowances for doubtful accounts, intangible assets, estimates to complete on contracts where revenue is recognized over time, the carrying value of inventories and long-lived assets, and the timing of revenue recognition. Management bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the recognition of revenues and expenses and the carrying value of assets and liabilities that are not readily apparent from other sources. Assumptions and estimates may, however, prove to have been incorrect, and actual results may differ from these estimates.\nEarnings Per Share\nThe Company computes earnings per share using the two-class method. The two-class method of computing earnings per share is an earnings allocation formula that determines earnings per share for common stock and any participating securities according to dividends declared (whether paid or unpaid) and participation rights in undistributed earnings. Shares of the Companys common stock subject to unvested restricted stock awards and restricted stock units are considered participating securities because they contain a non-forfeitable right to cash dividends (in the case of restricted stock awards) or dividend equivalents (in the case of restricted stock units) paid prior to vesting or forfeiture, if any, irrespective of whether the awards or units ultimately vest. During fiscal 2023 and fiscal 2022, the Company granted restricted stock awards of 222,672 and 134,612 shares, respectively, and 128,985 and 178,719 restricted stock units, respectively, under the EVI Industries, Inc. 2015 Equity Incentive Plan, as amended (see Note 17). During fiscal 2022, the Company also granted stock awards (not subject to forfeiture) of 8,287 shares of the Companys common stock (3,261 of which shares were withheld to satisfy tax withholding obligations). Shares of restricted stock are deemed to constitute a second class of stock for accounting purposes. Basic and diluted earnings per share for fiscal 2023 and fiscal 2022 are computed as follows (in thousands, except per share data):\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFor the years ended\nJune 30,\nNet income $ 9,719 $ 4,095\nLess: distributed and undistributed income allocated to non-vested restricted common stock 1,193\nNet income allocated to EVI Industries, Inc. shareholders $ 8,526 $ 3,672\nWeighted average shares outstanding used in basic earnings per share 12,553 12,367\nDilutive common share equivalents\nWeighted average shares outstanding used in diluted earnings per share 12,804 12,650\nBasic earnings per share $ 0.68 $ 0.30\nDiluted earnings per share $ 0.67 $ 0.29\nAt June 30, 2023, other than 1,028,963 unvested shares subject to restricted stock awards or restricted stock units, there were no potentially dilutive securities outstanding. The remaining 732,119 shares of restricted common stock were not included in the calculation of diluted earnings per share because their impact was anti-dilutive. At June 30, 2022, other than 42,903 shares subject to restricted stock awards or restricted stock units, there were no potentially dilutive securities outstanding. The remaining 1,399,745 shares of restricted common stock were not included in the calculation of diluted earnings per share because their impact was anti-dilutive.\nSupplier Concentration\nThe Company purchases laundry, dry cleaning equipment, boilers and other products from a number of manufacturers and suppliers. Purchases from three manufacturers accounted for a total of approximately 61% of the Companys purchases for fiscal 2023 and 56% of the Companys purchases for fiscal 2022.\nAdvertising Costs\nThe Company expenses the cost of advertising as of the first date an advertisement is run. The Company incurred approximately $778,000 and $632,000 of advertising costs in fiscal 2023 and fiscal 2022, respectively, which are included in selling, general and administrative expenses in the consolidated statements of operations.\nShipping and Handling\nShipping and handling costs associated with inbound freight are capitalized to inventories and relieved through cost of sales as inventories are sold. Shipping and handling costs associated with the delivery of products are included in selling, general and administrative expenses.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFair Value of Certain Current Assets and Current Liabilities\nFair value is the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. The inputs used to measure fair value are prioritized based on a three-level hierarchy. The three levels of inputs used to measure fair value are as follows:\n● Level 1 - Quoted prices in active markets for identical assets and liabilities.\n● Level 2 - Observable inputs other than quoted prices included in Level 1. This includes dealer and broker quotations, bid prices, quoted prices for similar assets and liabilities in active markets, or other inputs that are observable or can be corroborated by observable market data.\n● Level 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities. This includes discounted cash flow methodologies and similar techniques that use significant unobservable inputs.\nThe Company has no assets or liabilities that are adjusted to fair value on a recurring basis. The Company did not have any assets or liabilities measured at fair value on a nonrecurring basis, other than assets and liabilities from acquisitions, during fiscal 2023 or fiscal 2022.\nThe Companys cash, accounts receivable and accounts payable are reflected in the accompanying consolidated financial statements at cost, which approximated estimated fair value, using Level 1 inputs. Cash is maintained with various high-quality financial institutions and have original maturities of three months or less. Accounts receivable and accounts payable approximate their fair value due to the short term nature of such accounts. The fair value of the Companys indebtedness was estimated using Level 2 inputs based on quoted prices for those or similar debt instruments using applicable interest rates as of June 30, 2023 and approximated the carrying value of such debt because it accrues interest at variable rates that are repriced frequently. This approximates fair value based on the variable interest rate.\nCustomer Deposits\nCustomer deposits represent advances paid by customers when placing orders for equipment with the Company.\nNet Investment in Sales Type Leases\nThe Company derives a portion of its revenue from leasing arrangements. Such arrangements provide for monthly payments covering the equipment sales, maintenance, and interest. These arrangements meet the criteria to be accounted for as sales type leases. Accordingly, the equipment sale is recognized upon delivery of the system and acceptance by the customer. Upon the recognition of revenue, an asset is established for the investment in sales type leases. Maintenance revenue and interest are recognized monthly over the lease term.\nIncome Taxes\nThe Company recognizes income taxes using the asset and liability method. Under the asset and liability method, deferred tax assets and liabilities are recognized for the future tax consequences attributed to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. If it is determined that it is more likely than not that some portion of a deferred tax asset will not be realized, a valuation allowance is recognized.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nJudgment is required in developing the Companys provision for income taxes, deferred tax assets and liabilities, and any valuation allowances that might be required against the deferred tax assets. Management evaluates the Companys ability to realize its deferred tax assets on a quarterly basis and adjusts the valuation allowance when it believes that it is more likely than not that the asset will not be realized. There were no valuation allowance adjustments during fiscal 2023 or fiscal 2022.\nThe Company accounts for uncertainty in income taxes using a two-step approach to recognizing and measuring uncertain tax positions. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. The second step is to measure the tax benefit as the largest amount which is more than 50% likely of being realized upon ultimate settlement. The Company considers many factors when evaluating and estimating its tax positions and tax benefits, which may require periodic adjustments and which may not accurately reflect actual outcomes. The Company does not believe that there are any material unrecognized tax benefits as of June 30, 2023 or 2022 related to tax positions taken on its income tax returns. The Companys policy is to classify interest and penalties related to unrecognized tax benefits, if and when required, as part of interest expense and general and administrative expense, respectively, in the consolidated statements of operations.\nThe CARES Act, among its other provisions, includes tax provisions relating to refundable payroll tax credits, deferral of employers social security payments, net operating loss (NOL) utilization and carryback periods, modifications to the net interest deduction limitations and technical corrections to tax depreciation methods for qualified improvement property (QIP), and financing options. The Companys income tax provision for fiscal 2023 and fiscal 2022 was not materially impacted by the provisions of the CARES Act.\nLeases\nCompany as Lessee\nThe Company leases warehouse and distribution facilities and administrative office space, generally for terms of three to ten years.\nThe Company recognizes the lease payments under its short-term leases (which are defined as leases with a term of twelve months or less) in profit or loss on a straight-line basis over the lease term. The Company follows this accounting policy for all classes of underlying assets. In addition, variable lease payments in the period in which the obligation for those payments is incurred are not included in the recognition of a lease liability or right-of-use asset.\nRight-of-use assets represent the Companys right to use an underlying asset for the lease term, and lease liabilities represent the Companys obligation to make lease payments arising from the lease. Right-of-use assets and liabilities are recognized at the lease commencement date based on the estimated present value of lease payments over the lease term. When available, the Company uses the rate implicit in the lease to discount lease payments to present value. However, certain of the Companys leases do not provide a readily determinable implicit rate. For such leases, the Company estimates the incremental borrowing rate to discount lease payments based on information available at lease commencement. The Company uses instruments with similar characteristics when calculating its incremental borrowing rates.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nThe Company has options to extend certain of its operating leases for additional periods of time and the right to terminate several of its operating leases prior to their contractual expirations, in each case, subject to the terms and conditions of the lease. The lease term consists of the non-cancellable period of the lease and the periods covered by Company options to extend the lease when management considers it reasonably certain that the Company will exercise such options. The Company's lease agreements do not contain residual value guarantees. The Company has elected to not separate non-lease components from the associated lease component for all underlying classes of assets with lease and non-lease components.\nRecently Issued Accounting Guidance\nIn June 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13), which will change the way companies evaluate credit losses for most financial assets and certain other instruments. For trade and other receivables, held-to-maturity debt securities, loans and other specified instruments, entities will be required to use a new forward-looking expected loss model to evaluate impairment, potentially resulting in earlier recognition of allowances for losses. The new standard will also require enhanced disclosures, including the requirement to disclose the information used to track credit quality by year of origination for most financing receivables. The guidance must be applied using a cumulative-effect transition method. ASU 2016-13 is effective for fiscal years beginning after December 15, 2022, and for interim periods within those fiscal years (the fiscal year ending June 30, 2024 for the Company), with early adoption permitted. The Company will adopt this ASU using a modified-retrospective approach, and is continuing to quantify the impact of the standard on its consolidated financial statements and evaluating the disclosures required under the standard. The Company does not currently anticipate the adoption of this ASU will have a material impact on its financial position, results of operations and cash flows; however, the Companys assessment will be finalized during the first quarter fiscal 2024.\nManagement does not believe that other issued accounting standards and updates which are not yet effective will have a material impact on the Companys consolidated financial position, results of operations or cash flows upon adoption.\n3. Acquisitions\nFiscal 2023 Acquisitions\nOn September 1, 2022, the Company completed the acquisitions of Aldrich Clean-Tech Equipment Corp. (ACT), a Massachusetts-based distributor of commercial, industrial, and vended laundry products and provider of installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry, and K&B Laundry Service, LLC (K&B), a North Carolina-based distributor of commercial, industrial, and vended laundry products and provider of installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry. The total consideration for these two acquisitions consisted of approximately $1.2 million in cash, net of cash acquired, which the Company funded through borrowings under its credit facility. Fees and expenses related to these acquisitions, consisting primarily of legal and other professional fees, totaled approximately $102,000 and are classified as selling, general and administrative expenses in the Companys consolidated statements of operations for fiscal 2023. Each acquisition was treated for accounting purposes as a purchase of the acquired business using the acquisition method of accounting in accordance with Accounting Standards Codification (ASC) 805, Business Combinations (ASC 805), pursuant to which the consideration paid by the Company was allocated to the acquired assets and assumed liabilities, in each case, based on their respective fair values as of the closing date, with the excess of the consideration transferred over the fair value of the net assets acquired being allocated to intangible assets and goodwill. The Company allocated a total of $793,000 to goodwill, which is expected to be amortized and deductible for tax purposes over 15 years. Goodwill is attributable primarily to the assembled workforces, as well as the expected benefits from the increased scale of the Company as a result of these acquisitions. The financial position, including assets and liabilities, of ACT and K&B is included in the Companys consolidated balance sheet as of June 30, 2023 and the results of operations of the businesses since the September 1, 2022 closing date are included in the Companys consolidated financial statements for fiscal 2023.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nOn November 1, 2022, the Company acquired substantially all of the assets of Wholesale Commercial Laundry Equipment Company SE, LLC (WCL), an Alabama-based distributor of commercial, industrial, and vended laundry products and provider of installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry. The consideration paid by the Company in connection with the acquisition consisted of $650,000 in cash and 24,243 shares of the Companys common stock, with an acquisition date fair value of approximately $503,000. Fees and expenses related to the acquisition, consisting primarily of legal and other professional fees, totaled approximately $31,000 and are classified as selling, general and administrative expenses in the Companys consolidated statement of operations for fiscal 2023. The acquisition was treated for accounting purposes as a purchase of the acquired business using the acquisition method of accounting in accordance with ASC 805, pursuant to which the consideration paid by the Company was allocated to the acquired assets and assumed liabilities, in each case, based on their respective fair values as of the closing date, with the excess of the consideration transferred over the fair value of the net assets acquired being allocated to goodwill. The Company allocated $1,062,000 to goodwill, which is expected to be amortized and deductible for tax purposes over 15 years. Goodwill is attributable primarily to the assembled workforce, as well as the expected benefits from the increased scale of the Company as a result of the acquisition. The financial position, including assets and liabilities, of WCL is included in the Companys consolidated balance sheet as of June 30, 2023 and the results of operations of WCL since the November 1, 2022 closing date are included in the Companys consolidated financial statements for fiscal 2023.\nOn June 5, 2023, the Company acquired substantially all of the assets of Gluno, Inc. d/b/a Express Parts and Services (EXP), a Maryland-based distributor of commercial laundry products and a provider of related technical installation and maintenance services. The consideration paid by the Company in connection with the acquisition consisted of $550,000 in cash. Fees and expenses related to the acquisition, consisting primarily of legal and other professional fees, were not material and are classified as selling, general and administrative expenses in the Companys consolidated statement of operations for fiscal 2023. The acquisition was treated for accounting purposes as a purchase of the acquired business using the acquisition method of accounting in accordance with ASC 805, pursuant to which the consideration paid by the Company was allocated to the acquired assets and assumed liabilities, in each case, based on their respective fair values as of the closing date, with the excess of the consideration transferred over the fair value of the net assets acquired being allocated to goodwill. The Company allocated $392,000 to goodwill, which is expected to be amortized and deductible for tax purposes over 15 years. Goodwill is attributable primarily to the assembled workforce, as well as the expected benefits from the increased scale of the Company as a result of the acquisition. The financial position, including assets and liabilities, of EXP is included in the Companys consolidated balance sheet as of June 30, 2023 and the results of operations of EXP since the June 5, 2023 closing date are included in the Companys consolidated financial statements for fiscal 2023.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nFiscal 2022 Acquisitions\nCLK Acquisition\nOn February 7, 2022, the Company acquired Consolidated Laundry Equipment, Inc. and Central Equipment Company, LLC (collectively CLK), pursuant to a merger whereby CLK merged with and into, and became, a wholly-owned subsidiary of the Company (the CLK Acquisition). CLK is a North Carolina-based distributor of commercial, industrial, and vended laundry products and provider of installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry. This acquisition expanded the Companys footprint in the Southeast region of the United States. The consideration paid by the Company in connection with the merger consisted of $4.5 million in cash and 179,087 shares of the Companys common stock. The Company funded the cash consideration with borrowings under its credit facility. Fees and expenses related to the CLK Acquisition, consisting primarily of legal and other professional fees, totaled approximately $45,000 and are classified as selling, general and administrative expenses in the Companys consolidated statement of operations for fiscal 2022. The total purchase price for accounting purposes was $7.2 million, net of cash acquired of $1.2 million.\nThe CLK Acquisition was treated for accounting purposes as a purchase of CLK using the acquisition method of accounting in accordance with ASC 805. Under the acquisition method of accounting, the aggregate consideration paid in the CLK Acquisition was allocated to the acquired assets and assumed liabilities, in each case, based on their respective fair values as of the closing date, with the excess of the consideration transferred over the fair value of the net assets acquired being allocated to intangible assets and goodwill. The computation of the purchase price consideration and the allocation of the consideration to the net assets acquired are presented in the following tables (in thousands):\nPurchase price consideration:\nCash consideration, net of cash acquired(a) $ 3,346\nStock consideration(b) 3,840\nTotal purchase price consideration, net of cash acquired $ 7,186\n(a) Includes $4.5 million paid net of $1.2 million of cash acquired.\n(b) Calculated as 179,087 shares of the Companys common stock, multiplied by $21.44, the closing price of the Companys common stock on the closing date.\nAllocation of purchase price consideration:\nAccounts receivable $ 1,322\nInventories 2,074\nVendor Deposits\nOther assets\nEquipment and improvements\nIntangible assets 1,700\nAccounts payable and accrued expenses (948 )\nAccrued employee expenses (62 )\nCustomer deposits (689 )\nDeferred tax liabilities (622 )\nTotal identifiable net assets 4,565\nGoodwill 2,621\nTotal $ 7,186\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nIntangible assets consist of $800,000 allocated to the Consolidated Laundry Equipment trade name and $900,000 allocated to customer-related intangible assets. The Consolidated Laundry Equipment trade name is indefinite-lived and therefore not subject to amortization. The Consolidated Laundry Equipment trade name will be evaluated for impairment annually or more frequently if an event occurs or circumstances change that indicate it may be impaired, by comparing its fair value to its carrying amount to determine if a write-down to fair value is required. Customer-related intangible assets are being amortized over 10 years.\nGoodwill is attributable primarily to the assembled workforce acquired, as well as expected benefits from the increased scale of the Company as a result of the CLK Acquisition. The goodwill from the CLK Acquisition is not deductible for income tax purposes.\nCDL Acquisition\nOn June 1, 2022, the Company acquired Clean Designs, Inc. and Clean Route, LLC (collectively CDL). The acquisition (the CDL Acquisition) was effected by the Company, indirectly through a wholly-owned subsidiary, which purchased substantially all of the assets and assumed certain of the liabilities of CDL. CDL is a Colorado -based distributor of commercial, industrial, and vended laundry products and provider of installation and maintenance services to the new and replacement segments of the commercial, industrial and vended laundry industry. This acquisition expanded the Companys footprint in the West region of the United States. The consideration paid by the Company in connection with the acquisition consisted of $5.4 million in cash. The Company funded the cash consideration with borrowings under its credit facility. Fees and expenses related to the CDL Acquisition, consisting primarily of legal and other professional fees, totaled approximately $65,000 and are classified as selling, general and administrative expenses in the Companys consolidated statement of operations for fiscal 2022. The total purchase price for accounting purposes was $5.4 million.\nThe CDL Acquisition was treated for accounting purposes as a purchase of CDL using the acquisition method of accounting in accordance with ASC 805. Under the acquisition method of accounting, the aggregate consideration paid in the CDL Acquisition was allocated to the acquired assets and assumed liabilities, in each case, based on their respective fair values as of the closing date, with the excess of the consideration transferred over the fair value of the identifiable net assets acquired being allocated to goodwill. The computation of the purchase price consideration and the allocation of the consideration to the net assets acquired are presented in the following tables (in thousands):\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nPurchase price consideration:\nCash consideration $ 5,366\nTotal purchase price consideration $ 5,366\nAllocation of purchase price consideration:\nAccounts receivable $ 920\nInventories 1,232\nOther assets\nEquipment and improvements\nIntangible assets 1,580\nAccounts payable and accrued expenses (1,357 )\nAccrued employee expenses (72 )\nCustomer deposits (336 )\nTotal identifiable net assets 2,898\nGoodwill 2,468\nTotal $ 5,366\nIntangible assets consist of $590,000 allocated to the Clean Designs trade name and $990,000 allocated to customer-related intangible assets. The Clean Designs trade name is indefinite-lived and therefore not subject to amortization. The Clean Designs trade name will be evaluated for impairment annually or more frequently if an event occurs or circumstances change that indicate it may be impaired, by comparing its fair value to its carrying amount to determine if a write-down to fair value is required. Customer-related intangible assets are being amortized over 10 years.\nGoodwill is expected to be amortized and deductible for tax purposes over 15 years. Goodwill is attributable primarily to the assembled workforce acquired, as well as expected benefits from the increased scale of the Company as a result of the CDL Acquisition.\nOther Fiscal 2022 Acquisitions\nIn addition to the CLK Acquisition and the CDL Acquisition, during fiscal 2022, the Company completed the acquisition of the following two companies: (i) LS Acquisition, LLC d/b/a Laundry South Systems and Repair (LSS), which was acquired on April 29, 2022; and (ii) Spynr, Inc. (SPR), which was acquired on May 5, 2022. The total consideration for these two transactions consisted of $3.2 million in cash and 34,391 shares of the Companys common stock. The Company funded the cash consideration for each acquisition with credit facility borrowings. Fees and expenses related to these acquisitions, consisting primarily of legal and other professional fees, totaled approximately $46,000 and are classified as selling, general and administrative expenses in the Companys consolidated statement of operations for fiscal 2022. Each acquisition was treated for accounting purposes as a purchase of the acquired business using the acquisition method of accounting in accordance with ASC 805, pursuant to which the consideration paid by the Company was allocated to the acquired assets and assumed liabilities, in each case, based on their respective fair values as of the closing date, with the excess of the consideration transferred over the fair value of the net assets acquired being allocated to intangible assets and goodwill. The Company allocated a total of $2.2 million to goodwill, $760,000 to customer-related intangibles, and $460,000 to the respective trade names. Goodwill totaling $2.2 million from these acquisitions is expected to be amortized and deductible for tax purposes over 15 years. Goodwill is attributable primarily to the assembled workforces, as well as expected benefits from the increased scale of the Company as a result of these acquisitions.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nSupplemental Pro Forma Results of Operations\nThe following unaudited supplemental pro forma information presents the results of operations of the Company, after giving effect to the acquisitions completed by the Company during fiscal 2023 and 2022 as described above, as if the Company had completed each such transaction on July 1, 2021, using the estimated fair values of the assets acquired and liabilities assumed. These unaudited pro forma results are presented for informational purposes only and are not necessarily indicative of what the actual results of operations of the Company would have been if the transactions had occurred on the date assumed, nor are they indicative of future results of operations.\nFor the year ended\nJune 30,\n(in thousands)\n(Unaudited)\n(Unaudited)\nRevenues $ 357,353 $ 299,321\nNet income 10,074 6,850\nThe Companys consolidated results of operations for fiscal 2023 include total revenue of approximately $37.8 million and total net income of approximately $931,000 attributable to businesses acquired during fiscal 2023 and fiscal 2022, based on the consolidated effective tax rate. The Companys consolidated results of operations for fiscal 2022 include total revenue of approximately $9.3 million and total net income of approximately $134,000 attributable to businesses acquired during fiscal 2022, based on the consolidated effective tax rate. These results of acquired businesses do not include the effects of acquisition costs or interest expense associated with consideration paid for the acquisitions.\n4. Accounts Receivable\nAccounts receivable as of June 30, 2023 and 2022 consisted of the following (in thousands):\nJune 30,\nAccounts receivable - trade $ 50,455 $ 44,620\nAllowance for doubtful accounts (2,064 ) (1,606 )\n$ 48,391 $ 43,014\n5. Other Current Assets\nOther current assets as of June 30, 2023 and 2022 were comprised of the following (in thousands):\nJune 30,\nOther receivables $ 775 $ 1,161\nPrepaid insurance\nNet investments in sales type leases - current 1,580 2,024\nOther current assets 5,370 2,152\n$ 8,547 $ 6,018\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n6. Leases\nCompany as Lessee\nAs of June 30, 2023, the Company had 32 facilities, consisting of warehouse facilities and administrative offices, financed under operating leases with lease term expirations between 2023 and 2030. Rent expense consists of monthly rental payments under the terms of the Companys lease agreements recognized on a straight-line basis.\nThe following table sets forth the Companys future minimum lease payments under operating lease liabilities recorded on the Companys condensed consolidated balance sheet as of June 30, 2023. The table below does not include commitments that are contingent on events or other factors that are currently uncertain or unknown.\nFiscal years ending June 30, Maturity of\nOperating Lease\nLiabilities\n(in thousands)\n$ 3,329\n2,571\n1,904\n1,019\nThereafter\nTotal lease payments $ 10,264\nLess: amounts representing interest\nPresent value of lease liabilities $ 9,581\nLess: current portion 3,027\nLong-term portion $ 6,554\nThe table below presents additional information related to the Companys operating leases (in thousands):\nOperating lease cost Fiscal year\nended June 30,\nFiscal year\nended June 30,\nOperating lease cost (1) $ 3,526 $ 2,612\nVariable lease cost (2) 3,391\nTotal lease cost $ 6,917 $ 2,901\n(1) Expenses are classified within selling, general and administrative expenses in the Companys consolidated statements of operations for the fiscal years ended June 30, 2023 and 2022.\n(2) Certain of the Companys subsidiaries lease space at locations where (i) they install laundry equipment and customers pay for the use of equipment and (ii) the leased space is paid for as part of a revenue sharing arrangement. The Company did not report this variable lease cost in the fiscal year ended June 30, 2022 and does not believe the omission is material to the Companys consolidated financial statements. These expenses are classified within cost of sales in the Companys consolidated statements of operations for the fiscal years ended June 30, 2023 and 2022.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nThe table below presents lease-related terms and discount rates as of June 30, 2023 and 2022:\nJune 30, 2023 June 30, 2022\nWeighted average remaining lease terms\nOperating leases 4.0 years 4.8 years\nWeighted average discount rate\nOperating leases 3.45% 3.2%\nThe table below presents supplemental cash flow information related to the Companys long-term operating lease liabilities for the fiscal years ended June 30, 2023 and 2022 (in thousands):\nFiscal year ended\nJune 30, 2023 Fiscal year ended\nJune 30, 2022\nCash paid for amounts included in the measurement of lease liabilities: $ 3,526 $ 2,612\nOperating lease right-of-use assets obtained in exchange for operating lease liabilities: $ 4,403 $ 2,658\nCompany as Lessor\nThe Company derives a portion of its revenue from equipment leasing arrangements. Such arrangements provide for monthly payments covering the equipment provided, maintenance, and interest. These arrangements meet the criteria to be accounted for as sales type leases. Accordingly, revenue related to the provision of the equipment is recognized upon delivery of the equipment and its acceptance by the customer. Upon the recognition of such revenue, an asset is established for the investment in sales type leases. Maintenance revenue and interest are recognized monthly over the lease term.\nThe future minimum lease payments receivable for sales type leases are as follows (in thousands):\nFiscal years ending June 30, Total Minimum\nLease Payments\nto be Received Amortization of\nUnearned\nIncome Net Investment in\nSales Type\nLeases\n$ 4,385 $ 2,759 $ 1,626\n3,377 2,172 1,205\n2,749 1,522 1,227\n1,962 1,011\n524\nThereafter\n$ 6,054 *\n* Excludes non-guaranteed residual values of $3.0 million.\nThe total net investments in sales type leases, including stated residual values, as of June 30, 2023 and June 30, 2022 was $9.0 million and $7.7 million, respectively. The current portion of $1.6 million and $2.0 million is included in other current assets in the consolidated balance sheets as of June 30, 2023 and June 30, 2022, respectively, and the long term portion of $7.4 million and $5.7 million is included in other assets in the consolidated balance sheets as of June 30, 2023 and June 30, 2022, respectively.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n7. Equipment and Improvements\nMajor classes of equipment and improvements as of June 30, 2023 and 2022 consisted of the following (in thousands):\nJune 30,\nFurniture and equipment $ 15,247 $ 12,550\nLeasehold improvements 2,962 2,845\nVehicles 6,886 6,269\n25,095 21,664\nAccumulated depreciation and amortization (12,142 ) (8,631 )\n$ 12,953 $ 13,033\nDepreciation and amortization of equipment and improvements totaled approximately $3.9 million in fiscal 2023 and $3.3 million in fiscal 2022.\n8. Goodwill and Intangible Assets\nThe changes in the carrying amount of goodwill are as follows (in thousands):\nBalance at June 30, 2021 $ 63,881\nGoodwill from fiscal 2022 acquisitions (as described in Note 3) 7,134\nWorking capital adjustments (1)\nBalance at June 30, 2022 $ 71,039\nGoodwill from fiscal 2023 acquisitions (as described in Note 3) 2,246\nWorking capital adjustments (2)\nBalance at June 30, 2023 $ 73,388\n(1) Relates to working capital adjustments from business acquisitions consummated by the Company during the fiscal year ended June 30, 2021.\n(2) Relates to working capital adjustments from business acquisitions consummated by the Company during fiscal 2022.\nCustomer-related intangibles, tradenames and other intangible assets as of June 30, 2023 and 2022 consisted of the following (dollars in thousands):\nJune 30, Estimated\nUseful Lives\n(in years)\nCustomer-related intangibles 8-10 $ 20,887 $ 20,887\nTradenames Indefinite 13,005 13,005\nCovenants not to compete\nLicense agreements\nTrademarks and patents 10-15\n35,163 35,163\nAccumulated amortization\n(11,035 ) (8,929 )\n$ 24,128 $ 26,234\nAmortization expense was approximately $2.1 million and $1.9 million in fiscal 2023 and fiscal 2022, respectively, and is included in selling, general and administrative expenses in the consolidated statements of operations. The weighted average remaining estimated useful lives for customer-related intangibles, covenants not to compete, license agreements, and trademarks and patents were 5.9 years, 0 years, 0 years and 0 years, respectively.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nBased on the carrying amount of intangible assets as of June 30, 2023, and assuming no future impairment of the underlying assets, the estimated future amortization at the end of each fiscal year in the five-year period ending June 30, 2028 and thereafter is as follows (in thousands):\nFiscal years ending June 30,\n$ 2,106\n2,102\n2,101\n1,778\n1,256\nThereafter 1,780\nTotal $ 11,123\n9. Accounts Payable and Accrued Expenses\nAccounts payable and accrued expenses as of June 30, 2023 and 2022 were comprised of the following (in thousands):\nJune 30,\nAccounts payable $ 26,690 $ 32,632\nAccrued expenses 10,080 7,601\nSales tax accruals 1,960 1,793\n$ 38,730 $ 42,026\n10. Income Taxes\nThe following are the components of income taxes (benefit) (in thousands):\nFiscal years ended June 30,\nCurrent\nFederal $ 3,137 $ 1,510\nState\n3,923 1,779\nDeferred\nFederal (118 )\nState (46 )\n(164 )\n$ 4,280 $ 1,615\nThe reconciliation of income tax expense computed at the federal statutory tax rate of 21% for the fiscal years ended June 30, 2023 and 2022 to the provision for income taxes is as follows (in thousands):\nFiscal years ended June 30,\nTax at the statutory rate $ 2,940 $ 1,198\nState income taxes, net of federal benefit\nNondeductible compensation\nOther\n$ 4,280 $ 1,615\nEffective tax rate 30.6% 28.3%\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nDeferred income taxes reflect the net tax effect of temporary differences between the basis of assets and liabilities for financial reporting purposes and the basis used for income tax purposes. Significant components of the Companys current and noncurrent deferred tax assets and liabilities as of June 30, 2023 and 2022 were as follows (in thousands):\nAs of June 30,\nDeferred tax assets:\nAllowance for doubtful accounts $ 418 $ 298\nInventory capitalization 1,074\nStock compensation 1,013\nAccrued liabilities 1,073\nOther\n3,694 2,742\nDeferred tax liabilities:\nGoodwill (4,946 ) (3,850 )\nDepreciation (2,104 ) (1,855 )\nIntangible assets (1,472 ) (1,544 )\nOther (195 ) (159 )\n(8,717 ) (7,408 )\nNet deferred income tax (liabilities) assets $ (5,023 ) $ (4,666 )\nAs of June 30, 2023, the Company was subject to potential federal and state tax examinations for the tax years including and subsequent to 2018.\n11. Debt\nThe Companys long-term debt as of June 30, 2023 and 2022 was as follows (in thousands):\nJune 30,\nJune 30,\nRevolving Line of Credit $ 35,000 $ 28,000\nLess: unamortized discount and deferred financing costs (131 ) (160 )\nTotal long-term debt $ 34,869 $ 27,840\nOn November 2, 2018, the Company entered into a syndicated credit agreement (the Credit Agreement) for a five-year revolving credit facility in the maximum aggregate principal amount of up to $100 million, with an accordion feature to increase the revolving credit facility by up to $40 million for a total of $140 million. A portion of the revolving credit facility is available for swingline loans of up to a sublimit of $5 million and for the issuance of standby letters of credit of up to a sublimit of $10 million.\nPrior to the amendment described below, borrowings (other than swingline loans) under the Credit Agreement accrued interest at a rate, at the Companys election at the time of borrowing, equal to (a) LIBOR plus a margin that ranged from 1.25% to 1.75% depending on the Companys consolidated leverage ratio, which is a ratio of consolidated funded indebtedness to consolidated earnings before interest, taxes, depreciation and amortization (EBITDA) (the Consolidated Leverage Ratio) or (b) the highest of (i) prime, (ii) the federal funds rate plus 50 basis points, and (iii) the one month LIBOR rate plus 100 basis points, plus a margin that ranged from 0.25% to 0.75% depending on the Consolidated Leverage Ratio. Swingline loans accrued interest calculated at the base rate determined in accordance with clause (b) of the preceding sentence plus a margin that ranged from 0.25% to 0.75% depending on the Consolidated Leverage Ratio. The Credit Agreement had an initial term of five years with a scheduled maturity date of November 2, 2023.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nOn May 6, 2022, the Company entered into an amendment to the Credit Agreement. The amendment amended the Credit Agreement to, among other things, replace LIBOR with the Bloomberg Short-Term Bank Yield Index rate (the BSBY rate) in connection with the phasing out of LIBOR. As a result, borrowings (other than swingline loans) under the Credit Agreement bear interest, at a rate based on (a) the BSBY rate plus a margin that ranges between 1.25% and 1.75%r depending on the Companys Consolidated Leverage Ratio or (b) the highest of (i) prime, (ii) the federal funds rate plus 50 basis points, and (iii) the BSBY rate plus 100 basis points (such highest rate, the Base Rate), plus a margin that ranges between 0.25% and 0.75% depending on the Consolidated Leverage Ratio. Swingline loans generally bear interest calculated at the Base Rate plus a margin that ranges between 0.25% and 0.75% depending on the Consolidated Leverage Ratio. The amendment also extended the maturity date of the Credit Agreement from November 2, 2023 to May 6, 2027. As of June 30, 2023, the Company had approximately $35.0 million of outstanding borrowings under the Credit Agreement, which accrued interest at a weighted average rate of 5.81%.\nThe Credit Agreement contains certain covenants, including financial covenants requiring the Company to comply with maximum leverage ratios and minimum interest coverage ratios. The Credit Agreement also contains other provisions which may restrict the Companys ability to, among other things, dispose of or acquire assets or businesses, incur additional indebtedness, make certain investments and capital expenditures, pay dividends, repurchase shares and enter into transactions with affiliates. At June 30, 2023, the Company was in compliance with its covenants under the Credit Agreement and $57.3 million was available to borrow under the revolving credit facility.\nThe obligations of the Company under the Credit Agreement are collateralized by substantially all of the assets of the Company and certain of its subsidiaries, and are guaranteed, jointly and severally, by certain of the Companys subsidiaries.\n12. Related Party Transactions\nCertain of the Companys subsidiaries lease warehouse and office space from one or more of the principals (or former principals) of the Company or its subsidiaries. These leases include the following:\nOn October 10, 2016, the Companys wholly-owned subsidiary, Western State Design, entered into a lease agreement pursuant to which it leases 17,600 square feet of warehouse and office space from an affiliate of Dennis Mack, a director and Executive Vice President, Corporate Strategy of the Company, and Tom Marks, Executive Vice President, Business Development and President of the West Region of the Company. The lease had an initial term of five years and provides for two successive three-year renewal terms at the option of the Company. Monthly base rental payments were $12,000 during the initial term of the lease. The Company exercised its option to renew the lease for the first three-year renewal term, which commenced in October 2021. Base rent for the first renewal term is $19,000 per month. In addition to base rent, Western State Design is responsible under the lease for costs related to real estate taxes, utilities, maintenance, repairs and insurance. Payments under this lease totaled approximately $228,000 and $207,000 during fiscal 2023 and fiscal 2022, respectively.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nOn October 31, 2017, the Companys wholly-owned subsidiary, Tri-State Technical Services, entered into lease agreements pursuant to which it leases a total of 81,000 square feet of warehouse and office space from an affiliate of Matt Stephenson, President of Tri-State. Monthly base rental payments total $21,000 during the initial terms of the leases. Each lease had an initial term of five years and provides for two successive three-year renewal terms at the option of the Company. The Company exercised its option to renew the leases for the first three-year renewal term, which commenced in October 2022. Base rent for the first renewal term is $25,000. In addition to such leases, since May 1, 2023, Tri-State Technical Services has also leased an additional 50,000 square feet of space from Mr. Stephenson. Monthly base rental payments for the additional space total $15,000. The term of this lease will expire upon the expiration of the other leases with Mr. Stephenson described above. In addition to base rent, Tri-State is responsible under the leases for costs related to real estate taxes, utilities, maintenance, repairs and insurance. Payments under these leases totaled approximately $306,000 and $252,000 during fiscal 2023 and fiscal 2022, respectively.\nOn November 1, 2018, the Companys wholly-owned subsidiary, AAdvantage Laundry Systems, entered into a lease agreement pursuant to which it leases warehouse and office space from an affiliate of Mike Zuffinetti, former Chief Executive Officer of AAdvantage. Monthly base rental payments under this lease were $26,000 initially. Pursuant to the lease agreement, on January 1, 2019, the lease expanded to cover additional warehouse space and, in connection therewith, monthly base rental payments under this lease increased to $36,000. In addition to base rent, AAdvantage is responsible under each of these leases for costs related to real estate taxes, utilities, maintenance, repairs and insurance. The lease has an initial term of five years and provides for two successive three-year renewal terms at the option of the Company, and the Company currently expects to exercise its option to renew this lease for the first three-year renewal term. Payments under the leases described in this paragraph totaled approximately $432,000 during fiscal 2023 and fiscal 2022.\nOn November 3, 2020, the Companys wholly-owned subsidiary, Yankee Equipment Systems, entered into a lease agreement pursuant to which it leases a total of 12,500 square feet of warehouse and office space from an affiliate of Peter Limoncelli, President of Yankee Equipment Systems. Monthly base rental payments total $11,000 during the initial term of the lease. In addition to base rent, Yankee Equipment Systems is responsible under the lease for costs related to real estate taxes, utilities, maintenance, repairs and insurance. The lease has an initial term of three years and provides for three successive three-year renewal terms at the option of the Company, and the Company currently expects to exercise its option to renew this lease for the first three-year renewal term. Payments under this lease totaled approximately $146,000 and $142,000 during fiscal 2023 and fiscal 2022, respectively.\n13. Concentrations of Credit Risk\nThe Company believes that concentrations of credit risk with respect to trade receivables are limited due to the Companys large customer base. Also, based on the Companys credit evaluation, trade receivables are often collateralized by the equipment sold. No single customer or contract accounted for more than 10% of the Companys revenues for fiscal 2023 or fiscal 2022. As of June 30, 2023, there were no accounts receivable due from any customer which accounted for greater than 10% of the Companys accounts receivable.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n14. Commitments and Contingencies\nFrom time to time in the ordinary course of business, certain of the Companys contracts require the Company to provide performance and payment bonds related to projects in process. These bonds are intended to provide assurance to the customer that the Company will perform under the terms of the contract and that the Company will pay subcontractors and vendors. If the Company fails to perform under the contract or pay subcontractors and vendors, the customer may demand that the surety make payments or provide services under the bond. The Company is required to reimburse the surety for expenses or outlays it incurs. There were no such performance or payment bonds outstanding at June 30, 2023 or 2022.\nThe Company may from time to time become subject to litigation and other legal proceedings. Litigation and other legal proceedings may require the Company to incur significant expenses, including those relating to legal and other professional fees. In addition, litigation and other legal proceedings are inherently uncertain, and adverse outcomes in litigation or other legal proceedings could adversely affect the Companys financial condition, cash flows, and operating results.\n15. Retirement Plan\nThe Company has participatory deferred compensation plans under which it matches 50% of employee contributions up to 6% of an eligible employees yearly compensation on a discretionary basis. During fiscal 2023 and fiscal 2022, employees were eligible to participate in the plans after one year of service. Beginning on July 1, 2023, employees are eligible to participate in the plans after six months of service. The Company contributed approximately $643,000 and $493,000 to the plans during fiscal 2023 and fiscal 2022, respectively. The plans are qualified plans under Section 401(k) of the Internal Revenue Code.\n16. Shareholders Equity\nNo dividends were declared or paid during the fiscal years ended June 30, 2023 or 2022.\nOn October 4, 2023, the Companys Board of Directors declared a special cash dividend on the Companys common stock of $0.28 per share to be paid on October 26, 2023 to stockholders of record at the close of business on October 16, 2023.\n17. Equity Plan\nEquity Incentive Plan\nDuring 2015, the Companys board of directors and stockholders approved the Companys 2015 Equity Incentive Plan (the Plan). During December 2020, the Companys stockholders approved an amendment to the Plan to increase the number of shares of the Companys common stock authorized for issuance pursuant to awards granted under the Plan from 1,500,000 shares to 3,000,000 shares. The fair value of awards granted under the Plan is expensed on straight-line basis over the vesting period of the awards. Share-based compensation expense is included in selling, general and administrative expenses in the Companys condensed consolidated statements of operations. Non-cash share-based compensation expense under the Plan totaled $3.1 million and $2.6 million for fiscal 2023 and fiscal 2022, respectively.\nDuring fiscal 2023, restricted stock awards of a total of 222,672 shares and 128,985 restricted stock units were granted under the Plan. A portion of the restricted stock awards granted during fiscal 2023 is scheduled to vest ratably over four years and the remainder is scheduled to vest in 10 years from the date of grant. The total grant date fair value, determined by using the closing stock price on the date of grant, of such restricted stock awards was $3.6 million. A portion of the restricted stock units granted during fiscal 2023 is scheduled to vest ratably over four years and the remainder is scheduled to vest in 4 to 40 years from the date of grant. The total grant date fair value of such restricted stock units was $2.1 million.\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nDuring fiscal 2022, restricted stock awards, restricted stock units and stock awards of a total of 134,612 shares, 178,719 shares and 8,287 shares, respectively, were granted under the Plan. A portion of the restricted stock awards granted during fiscal 2022 is scheduled to vest ratably over four years and the remainder is scheduled to vest in 10 to 19 years from the date of grant, subject, in the case of certain restricted shares, to accelerated vesting upon the achievement of certain specified performance goals. The total grant date fair value, determined by using the closing stock price on the date of grant, of such restricted stock awards was $4.8 million. A portion of the restricted stock units granted during fiscal 2022 is scheduled to vest ratably over four years and the remainder is scheduled to vest in 4 to 37 years from the date of grant. The total grant date fair value of such restricted stock units was $3.8 million. Stock awards relate to shares of the Companys common stock issued under the Plan which are immediately held by the recipient upon grant without any risk of forfeiture. The total grant date fair value of the stock awards granted during fiscal 2022 was $300,000.\nDuring fiscal 2023, 20,973 shares of restricted stock awards and 10,784 restricted stock units vested and 6,200 shares of common stock with an aggregate fair market value of $125,000 were withheld as payment in lieu of cash to satisfy tax withholding obligations in connection with the vesting of such restricted stock.\nDuring fiscal 2022, 14,485 shares of restricted stock awards and 6,350 restricted stock units vested and 3,834 shares of common stock with an aggregate fair market value of $87,000 were withheld as payment in lieu of cash to satisfy tax withholding obligations in connection with the vesting of such restricted stock. As described above, during fiscal 2022, the Company also granted stock awards (not subject to forfeiture) of 8,287 shares of the Companys common stock. 3,261 of such shares of common stock, which had an aggregate fair market value of $118,000 as of the grant date, were withheld in lieu of cash to satisfy tax withholding obligations in connection with the grant of the stock awards.\nAs of June 30, 2023, the Company had $20.0 million and $10.4 million of total unrecognized compensation expense related to non-vested restricted stock awards and restricted stock units, respectively, which is expected to be recognized over the weighted-average period of 14.8 years and 10.4 years, respectively.\nThe following is a summary of non-vested restricted stock activity as of, and for the fiscal year ended, June 30, 2023:\nRestricted Stock Awards Restricted Stock Units\nShares Weighted-\nAverage Grant\nDate Fair Value Shares Weighted-\nAverage Grant\nDate Fair Value\nNon-vested restricted stock outstanding at June 30, 2022 1,026,183 $ 21.65 416,465 $ 26.75\nGranted 222,672 16.30 128,985 16.52\nVested (20,973 ) 28.51 (10,784 ) 31.11\nForfeited -\n-\n(1,466 ) 20.42\nNon-vested restricted stock outstanding at June 30, 2023 1,227,882 20.56 533,200 24.20\nEVI Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\nEmployee Stock Purchase Plan\nDuring 2017, the Companys board of directors and stockholders approved the Companys 2017 Employee Stock Purchase Plan, which, subject to the terms of the plan, allows eligible employees the opportunity to purchase shares of the Companys common stock at a 5% discount. The employee stock purchase plan provides for six-month offering periods ending on December 31 and June 30 of each year. During fiscal 2023, 5,432 shares of common stock were purchased under the Companys employee stock purchase plan for which the Company received net proceeds of $118,000. During fiscal 2022, 8,389 shares of common stock were purchased under the Companys employee stock purchase plan for which the Company received net proceeds of $120,000. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this Report, management of the Company, with the participation of the Companys principal executive officer and principal financial officer, evaluated the effectiveness of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)). Based on that evaluation, the Companys principal executive officer and principal financial officer concluded that the Companys disclosure controls and procedures were not effective as of June 30, 2023 because of a material weakness in the Companys internal control over financial reporting, as described under Managements Report on Internal Control over Financial Reporting below.\nThe Companys management, including the Companys principal executive officer and principal financial officer, does not expect that the Companys disclosure controls and procedures and internal control over financial reporting will prevent all errors and improper conduct. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that it will detect or uncover failures within the Company to disclose material information otherwise required to be set forth in the Companys periodic reports or that the objectives of the control system will otherwise be met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of improper conduct, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons or by the collusion of two or more people. Further, the design of any control system is based in part upon assumptions about the likelihood of future events, and there can be no assurance that any such design will succeed in achieving its stated goals under all potential future conditions.\nManagements Report on Internal Control over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act). Internal control over financial reporting means a process designed by, or under the supervision of, a companys principal executive and principal financial officers, and effected by the companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the company, (ii) provide reasonable assurance that transactions are recorded as necessary to permit the preparation of financial statements in accordance with GAAP, and that receipts and expenditures of the company are being made only in accordance with authorizations of the companys management and directors, and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use or disposition of the companys assets that could have a material effect on the companys financial statements.\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, the projection of any evaluation of effectiveness to future periods is subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nThe Companys management, with the participation of the Companys principal executive officer and principal financial officer, evaluated the effectiveness of the Companys internal control over financial reporting as of June 30, 2023. This evaluation was conducted using the criteria set forth by the Committee of Sponsoring Organizations (COSO) of the Treadway Commission in the 2013 Internal Control - Integrated Framework. This evaluation included review of the documentation of controls, evaluation of the design effectiveness of controls, testing of the operating effectiveness of controls and a conclusion on this evaluation.\nIn connection with its evaluation of the effectiveness of the Companys internal control over financial reporting as of June 30, 2023, management identified a material weakness in the Companys internal control over financial reporting related to the review and approval of manual journal entries made to the general ledger at certain of the Companys subsidiaries. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. As a result of the identification of the material weakness, management concluded that the Companys internal control over financial reporting was not effective as of June 30, 2023.\nThe material weakness did not result in any identified misstatements to the audited financial statements contained in this Annual Report on Form 10-K or the financial statements for any previously reported period. BDO USA, P.C., the Companys independent registered public accounting firm, has expressed an unqualified opinion on the audited financial statements contained in this Annual Report on Form 10-K, which report is included in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form 10-K.\nManagement has excluded K&B, WCL, and EXP from its assessment of internal control over financial reporting as of June 30, 2023. These businesses were acquired by the Company during fiscal 2023, and management has not conducted an assessment of the internal control over financial reporting of these businesses. Total assets and revenues of each of K&B, WCL and EXP represented less than 2% of the related consolidated financial statement amounts of the Company as of, or for the fiscal year ended, June 30, 2023.\nBDO USA, P.C. (BDO), the Companys independent registered public accounting firm, has audited the Companys internal control over financial reporting as of June 30, 2023 and its report thereon is included herein.\nManagements Plans for Remediation of Material Weakness\nManagement has implemented and continues to implement measures designed to ensure that control deficiencies contributing to the material weakness are remediated, such that these controls are designed, implemented, and operating effectively. These remediation actions are ongoing and include or are expected to include modifying our journal entry process and system role configuration to establish a formal hierarchy of review of journal entries in order to enforce proper segregation of duties. The Company may also take additional measures to remediate the underlying control deficiencies identified above or modify the remediation plans described above. Although management believes that these actions will remediate the material weakness, the weakness will not be considered remediated until the applicable controls operate for a sufficient period of time and management has concluded, through testing, that these controls are operating effectively.\nChanges in Internal Control over Financial Reporting\nExcept as described under Managements Report on Internal Control Over Financial Reporting above, there have been no other changes in the Companys internal control over financial reporting during the quarter ended June 30, 2023 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nShareholders and Board of Directors\nEVI Industries, Inc.\nMiami, Florida\nOpinion on Internal Control over Financial Reporting\nWe have audited EVI Industries, Inc.s (the Companys) internal control over financial reporting as of June 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (the COSO criteria). In our opinion, the Company did not maintain, in all material respects, effective internal control over financial reporting as of June 30, 2023, based on the COSO criteria.\nWe do not express an opinion or any other form of assurance on managements statements referring to any corrective actions taken by the Company after the date of managements assessment.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of June 30, 2023 and 2022, the related consolidated statements of operations, shareholders equity, and cash flows for the years then ended, and the related notes and our report dated October 4, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Item 9A, Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit of internal control over financial reporting in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. A material weakness regarding managements failure to design and maintain controls over journal entries has been identified and described in managements assessment. This material weakness was considered in determining the nature, timing, and extent of audit tests applied in our audit of the 2023 financial statements, and this report does not affect our report dated October 4, 2023 on those financial statements.\nAs indicated in the accompanying 9A, Managements Report on Internal Control over financial Reporting, managements assessment of and conclusion on the effectiveness of internal control over financial reporting did not include the internal controls of K&B Laundry Service, LLC (K&B), Wholesale Commercial Equipment Company SE, LLC (WCL) and Gluno Inc. d/b/a Express Parts and Services (EXP), which were acquired during the year ended June 30, 2023, and which are included in the consolidated balance sheet of the Company as of June 30, 2023, and the related consolidated statements of operations, shareholders equity, and cash flows for the year then ended. Total assets and revenues of each K&B, WCL, and EXP represented less than 2% of the related consolidated financial statement amounts of the Company as of, or for the year ended June 30, 2023. Management did not assess the effectiveness of internal control over financial reporting of K&B, WCL, and EXP, because of the timing of their acquisitions. Accordingly, our audit of internal control over financial reporting of the Company also did not include an evaluation of the internal control over financial reporting of these subsidiaries.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ BDO USA, P.C.\nMiami, Florida\nOctober 4, 2023 Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe information required by Item 10 of Form 10-K will be provided by incorporating the information required under such item by reference to the Companys Definitive Proxy Statement with respect to the Companys 2023 Annual Meeting of Stockholders, if filed with the SEC within 120 days after the end of the fiscal year covered by this Report, or, alternatively, by amendment to this Report filed with the SEC under cover of Form 10-K/A no later than the end of such 120-day period. Item 11. Executive Compensation.\nThe information required by Item 11 of Form 10-K will be provided by incorporating the information required under such item by reference to the Companys Definitive Proxy Statement with respect to the Companys 2023 Annual Meeting of Stockholders, if filed with the SEC within 120 days after the end of the fiscal year covered by this Report, or, alternatively, by amendment to this Report filed with the SEC under cover of Form 10-K/A no later than the end of such 120-day period. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nEquity Compensation Plan Information\nThe following table sets forth information, as of June 30, 2023, with respect to compensation plans under which shares of the Companys common stock are authorized for issuance.\nPlan category Number of securities to be issued upon exercise of outstanding options, warrants and rights Weighted-average exercise price of outstanding options, warrants and rights Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\n(a) (b) (c)\nEquity compensation plans approved by security holders $- 1,003,399 (1)\nEquity compensation plans not approved by security holders $-\nTotal\n$- 1,003,399(1)\n(1) Includes 923,269 shares of the Companys common stock available for issuance under the Companys 2015 Equity Incentive Plan, as amended, and 80,130 shares of the Companys common stock available for issuance under the Companys 2017 Employee Stock Purchase Plan.\nOther Information\nThe remaining information required by Item 12 of Form 10-K will be provided by incorporating such information by reference to the Companys Definitive Proxy Statement with respect to the Companys 2023 Annual Meeting of Stockholders, if filed with the SEC within 120 days after the end of the fiscal year covered by this Report, or, alternatively, by amendment to this Report filed with the SEC under cover of Form 10-K/A no later than the end of such 120-day period. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information required by Item 13 of Form 10-K will be provided by incorporating the information required under such item by reference to the Companys Definitive Proxy Statement with respect to the Companys 2023 Annual Meeting of Stockholders, if filed with the SEC within 120 days after the end of the fiscal year covered by this Report, or, alternatively, by amendment to this Report filed with the SEC under cover of Form 10-K/A no later than the end of such 120-day period. Item 14. Principal Accountant Fees and Services.\nThe information required by Item 14 of Form 10-K will be provided by incorporating the information required under such item by reference to the Companys Definitive Proxy Statement with respect to the Companys 2023 Annual Meeting of Stockholders, if filed with the SEC within 120 days after the end of the fiscal year covered by this Report, or, alternatively, by amendment to this Report filed with the SEC under cover of Form 10-K/A no later than the end of such 120-day period.\nPART IV Item 15. Exhibit and Financial Statement Schedules.\n(a) Documents filed as part of this Report:\n(1) Financial Statements. The following consolidated financial statements of the Company and its subsidiaries are included in Part II, Item 8 of this Report.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at June 30, 2023 and 2022\nConsolidated Statements of Operations for the years ended June 30, 2023 and 2022\nConsolidated Statements of Shareholders Equity for the years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\n(2) Financial Statement Schedules. All financial statement schedules have been omitted because the information is either not applicable or not required or because the information is included in the Companys consolidated financial statements or the related notes to consolidated financial statements.\n(3) Exhibits. The following exhibits are either filed as a part of or furnished with this Report, or are incorporated into this Report by reference to documents previously filed by the Company with the SEC, as indicated below:\nExhibit No. Description\n3(a)(1) Certificate of Incorporation of the Company, as filed with the Secretary of State of the State of Delaware on June 13, 1963 (Incorporated by reference to Exhibit 3.1(a) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(2) Certificate of Amendment to the Certificate of Incorporation of the Company, as filed with the Secretary of State of the State of Delaware on March 27, 1968 (Incorporated by reference to Exhibit 3.1(b) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(3) Certificate of Amendment to the Certificate of Incorporation of the Company, as filed with the Secretary of State of the State of Delaware on November 4, 1983 (Incorporated by reference to Exhibit 3.1(c) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(4) Certificate of Amendment to the Certificate of Incorporation of the Company, as filed with the Secretary of State of the State of Delaware on November 5, 1986 (Incorporated by reference to Exhibit 3.1(d) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(5) Certificate of Change of Location of Registered Office and of Agent, as filed with the Secretary of State of the State of Delaware on December 31, 1986 (Incorporated by reference to Exhibit 3.1(e) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(6) Certificate of Amendment to the Companys Certificate of Incorporation, as filed with the Secretary of State of the State of Delaware on October 30, 1998 (Incorporated by reference to Exhibit 3.1(f) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(7) Certificate of Amendment to the Companys Certificate of Incorporation, as filed with the Secretary of State of the State of Delaware on November 5, 1999 (Incorporated by reference to Exhibit 3.1(g) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(8) Certificate of Amendment to the Companys Certificate of Incorporation, as filed with the Secretary of State of the State of Delaware on November 13, 2009 (Incorporated by reference to Exhibit 3.1(h) to the Companys Current Report on Form 8-K filed with the SEC on November 13, 2009)\n3(a)(9) Certificate of Amendment to the Companys Certificate of Incorporation, as filed with the Secretary of State of the State of Delaware on November 30, 2016 (Incorporated by reference to Appendix A of the Companys Definitive Proxy Statement on Schedule 14A filed with the SEC on October 28, 2016)\n3(a)(10) Certificate of Amendment to the Companys Certificate of Incorporation, as filed with the Secretary of State of the State of Delaware on December 21, 2018 (Incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed with the SEC on December 21, 2018)\n3(b) Amended and Restated By-Laws of the Company (Incorporated by reference to Exhibit 3(b) to the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2020 filed with the SEC on September 14, 2020)\n4(a) Specimen Common Stock Certificate (Incorporated by reference to Exhibit 4 to the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2016 filed with the SEC on September 20, 2016)\n4(b) Stockholders Agreement, dated as of October 31, 2017, by and among the Company, Symmetric Capital LLC, Symmetric Capital II LLC, Henry M. Nahmad and Vernon Matthew Stephenson (Incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed with the SEC on November 3, 2017)\n4(c) Stockholders Agreement, dated as of February 9, 2018, by and among the Company, Zuf Acquisitions I LLC, d/b/a/ AAdvantage Laundry Systems, Zuf Management LLC, Michael Zuffinetti, Ryan C. Smith, Sky-Rent LP, Sky-Rent Management LLC, and Teri Zuffinetti (Incorporated by reference to Exhibit 4.1 to the Companys Current Report on Form 8-K filed with the SEC on February 12, 2018)\n4(d) Description of the Companys Securities (Incorporated by reference to Exhibit 4(g) to the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2021 filed with the SEC on September 13, 2019)\n10(a)(1) Credit Agreement, dated as of November 2, 2018, by and among the Company, as Borrower, certain subsidiaries of the Company party thereto, as Guarantors, Bank of America, N.A, as Administrative Agent, Swingline Lender and L/C Issuer, Merrill Lynch, Pierce, Fenner & Smith Incorporated and U.S. Bank National Association, as Joint Lead Arrangers, Merrill Lynch Pierce, Fenner & Smith Incorporated, as Sole Bookrunner, and other lender parties thereto (Incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed with the SEC on November 7, 2018)\n10(a)(2) First Amendment to Credit Agreement dated as of May 6, 2022 by and among the Company, certain subsidiaries of the Company party thereto, as Guarantors, the lenders identified on the signature pages thereto and Bank of America, N.A., as Administrative Agent (Incorporated by reference to Exhibit 10.01 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2022 filed with the SEC on May 10, 2022)\n10(a)(3) Annex A to First Amendment to Credit Agreement dated as of May 6, 2022 by and among the Company, certain subsidiaries of the Company party thereto, as Guarantors, the lenders identified on the signature pages thereto and Bank of America, N.A., as Administrative Agent (Incorporated by reference to Exhibit 10.02 to the Companys Quarterly Report on Form 10-Q for the quarter ended March 31, 2022 filed with the SEC on May 10, 2022)\n10(b)(1)* EVI Industries, Inc. 2015 Equity Incentive Plan, as amended (Incorporated by reference to Appendix A of the Companys Definitive Proxy Statement on Schedule 14A filed with the SEC on November 25, 2020)\n10(b)(2)* Form of Notice of Grant and Restricted Stock Agreement (Incorporated by reference to Exhibit 10(e)(2) to the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2017 filed with the SEC on September 28, 2017)\n10(b)(3)* Form of Notice of Grant and Stock Option Agreement (Incorporated by reference to Exhibit 10.3 to the Companys Current Report on Form 8-K filed with the SEC on November 17, 2015)\n10(c)* EVI Industries, Inc. Employee Stock Purchase Plan (Incorporated by reference to Appendix A of the Companys Definitive Proxy Statement on Schedule 14A filed with the SEC on October 30, 2017)\nSubsidiaries of the Company\nConsent of BDO USA, P.C.\n31(a) Certification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31(b) Certification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32(a)+ Certification of Principal Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32(b) + Certification of Principal Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Label Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n* Indicates management contract or compensatory plan or arrangement.\n+ Indicates that document is furnished, not filed, with this Report. All other exhibits not so indicated are filed with this Report.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nEVI Industries, Inc.\nDated: October 4, 2023\nBy: /s/ Henry M. Nahmad\nHenry M. Nahmad\nChairman, Chief Executive Officer and President\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nCapacity Date\n/s/ Henry M. Nahmad Chairman, Chief Executive Officer October 4, 2023\nHenry M. Nahmad (Principal Executive Officer) and President\n/s/ Dennis Mack Executive Vice President October 4, 2023\nDennis Mack and Director\n/s/ Robert H. Lazar Chief Financial Officer October 4, 2023\nRobert H. Lazar\n(Principal Financial and Accounting Officer)\n/s/ David Blyer Director October 4, 2023\nDavid Blyer\n/s/ Timothy P. LaMacchia Director October 4, 2023\nTimothy P. LaMacchia\n/s/ Hal M. Lucas Director October 4, 2023\nHal M. Lucas\n/s/ Glen Kruger Director October 4, 2023\nGlen Kruger\n402-9300\nIncludes $4.5 million paid net of $1.2 million of cash acquired. Calculated as 179,087 shares of the Companys common stock, multiplied by $21.44, the closing price of the Companys common stock on the closing date. P5Y P5Y P3Y P3Y P3Y\nfalse FY\n2022-07-01 2023-06-30\n2022-12-31\n2023-09-22\n2023-06-30\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:TreasuryStockCommonMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:TreasuryStockCommonMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:TreasuryStockCommonMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:TreasuryStockCommonMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:TreasuryStockCommonMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\nevi:WesternStateDesignLLCMember\n2016-10-01 2016-10-10\nevi:TriStateTechnicalServicesMember\n2017-10-01 2017-10-31\nsrt:MaximumMember evi:ZufAcquisitionsILLCMember\n2018-02-01 2018-02-09\nsrt:MinimumMember evi:ZufAcquisitionsILLCMember\n2018-02-01 2018-02-09\nevi:ZufAcquisitionsILLCMember\n2018-02-01 2018-02-09\nevi:ScottEquipmentIncMember\n2018-09-01 2018-09-12\nevi:PACAcquisitionMember\n2019-02-01 2019-02-05\nevi:EquipmentSystemsLLCMember\n2020-10-28 2020-11-03\nevi:ConsolidatedLaundryEquipmentMember\n2022-02-01 2022-02-07\nevi:CleanRouteLLCMember\n2022-05-25 2022-06-01\nevi:CommercialAndVendedLaundryPartsAndEquipmentSalesMember srt:MaximumMember\n2023-06-30\nevi:CommercialAndVendedLaundryPartsAndEquipmentSalesMember srt:MinimumMember\n2022-06-30\nevi:ServiceContractsMember\n2023-06-30\nevi:ServiceContractsMember\n2022-06-30\nsrt:MinimumMember\n2022-07-01 2023-06-30\nsrt:MaximumMember\n2022-07-01 2023-06-30\nsrt:MinimumMember evi:FurnitureAndEquipmentMember\n2023-06-30\nsrt:MaximumMember evi:FurnitureAndEquipmentMember\n2023-06-30\nsrt:MaximumMember\n2023-06-30\nsrt:MinimumMember us-gaap:LeaseholdImprovementsMember\n2023-06-30\nevi:SoftwareCapitalizationMember\n2023-06-30\nus-gaap:ComputerSoftwareIntangibleAssetMember\n2023-06-30\nus-gaap:ComputerSoftwareIntangibleAssetMember\n2022-06-30\nsrt:MinimumMember us-gaap:RestrictedStockMember\n2023-06-30\nevi:RestrictedStockAwardsMember\n2022-07-01 2023-06-30\nevi:RestrictedStockAwardsMember\n2021-07-01 2022-06-30\nevi:EquityIncentivePlanMember\n2022-07-01 2023-06-30\nevi:EquityIncentivePlanMember\n2021-07-01 2022-06-30\nevi:StockAwardsMember\n2022-07-01 2023-06-30\nus-gaap:RestrictedStockMember\n2022-07-01 2023-06-30\nus-gaap:RestrictedStockUnitsRSUMember\n2022-07-01 2023-06-30\nus-gaap:RestrictedStockUnitsRSUMember\n2021-07-01 2022-06-30\nevi:ManufacturersAndSuppliersMember evi:SupplierConcentrationMember\n2021-07-01 2022-06-30\nevi:ManufacturersAndSuppliersMember evi:SupplierConcentrationMember\n2022-07-01 2023-06-30\n2022-09-01 2022-09-01\nevi:KBLaundryServiceLLCMember\n2022-07-01 2023-06-30\nevi:WholesaleCommercialLaundryEquipmentCompanySELLCMember\n2022-11-01 2022-11-01\nevi:WholesaleCommercialEquipmentCompanySELLCMember\n2022-11-01 2022-11-01\nevi:WholesaleCommercialEquipmentCompanySELLCMember\n2022-11-01\nevi:GlunoIncMember\n2023-06-05 2023-06-05\nevi:GlunoIncMember\n2023-06-30\nevi:GlunoIncMember\n2022-07-01 2023-06-30\nevi:CLKAcquisitionMember\n2022-02-07 2022-02-07\n2022-02-07 2022-02-07\nevi:CLKAcquisitionMember\n2022-06-30\nevi:CLKAcquisitionMember\n2022-07-01 2023-06-30\nevi:ConsolidatedLaundryEquipmentIncMember us-gaap:TradeNamesMember\n2023-06-30\nevi:CleanDesignsIncMember\n2022-06-01 2022-06-01\nevi:CleanDesignsIncMember\n2021-07-01 2022-06-30\nevi:CleanDesignsIncMember\n2022-07-01 2023-06-30\nevi:CleanDesignsIncMember us-gaap:TradeNamesMember\n2023-06-30\nevi:CleanDesignsIncMember us-gaap:CustomerRelationshipsMember\n2023-06-30\nevi:CleanDesignsIncMember us-gaap:CustomerRelationshipsMember\n2022-07-01 2023-06-30\nevi:OtherFiscal2022AcquisitionsMember\n2021-07-01 2022-06-30\nevi:OtherFiscal2022AcquisitionsMember us-gaap:GoodwillMember\n2023-06-30\nevi:OtherFiscal2022AcquisitionsMember us-gaap:CustomerRelationshipsMember\n2023-06-30\nevi:OtherFiscal2022AcquisitionsMember us-gaap:TradeNamesMember\n2023-06-30\nevi:YankeeEquipmentMember us-gaap:TradeNamesMember\n2023-06-30\nevi:ConsolidatedLaundryEquipmentMember\n2021-07-01 2022-06-30\nevi:ConsolidatedLaundryEquipmentMember\n2022-06-30\nevi:CleanDesignsIncMember\n2021-07-01 2022-06-30\nevi:CleanDesignsIncMember\n2022-06-30\nevi:TotalMinimumLeasePaymentsReceivableMember\n2023-06-30\nevi:AmortizationOfUnearnedIncomeMember\n2023-06-30\nevi:NetInvestmentinSalesTypeLeasesMember\n2023-06-30\nus-gaap:FurnitureAndFixturesMember\n2023-06-30\nus-gaap:FurnitureAndFixturesMember\n2022-06-30\nus-gaap:LeaseholdImprovementsMember\n2023-06-30\nus-gaap:LeaseholdImprovementsMember\n2022-06-30\nus-gaap:VehiclesMember\n2023-06-30\nus-gaap:VehiclesMember\n2022-06-30\nus-gaap:CustomerRelatedIntangibleAssetsMember\n2023-06-30\nus-gaap:NoncompeteAgreementsMember\n2023-06-30\nus-gaap:LicensingAgreementsMember\n2023-06-30\nevi:TrademarksAndPatentsMember\n2023-06-30\nsrt:MinimumMember us-gaap:CustomerRelatedIntangibleAssetsMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:CustomerRelatedIntangibleAssetsMember\n2022-07-01 2023-06-30\nus-gaap:CustomerRelatedIntangibleAssetsMember\n2022-06-30\nus-gaap:TradeNamesMember\n2022-07-01 2023-06-30\nus-gaap:TradeNamesMember\n2023-06-30\nus-gaap:TradeNamesMember\n2022-06-30\nus-gaap:NoncompeteAgreementsMember\n2022-07-01 2023-06-30\nus-gaap:NoncompeteAgreementsMember\n2022-06-30\nus-gaap:LicensingAgreementsMember\n2022-07-01 2023-06-30\nus-gaap:LicensingAgreementsMember\n2022-06-30\nsrt:MinimumMember evi:TrademarksAndPatentsMember\n2022-07-01 2023-06-30\nsrt:MaximumMember evi:TrademarksAndPatentsMember\n2022-07-01 2023-06-30\nevi:TrademarksAndPatentsMember\n2022-06-30\nevi:AccumulatedAmortizationMember\n2022-07-01 2023-06-30\nevi:AccumulatedAmortizationMember\n2021-07-01 2022-06-30\n2018-11-02 2018-11-02\nus-gaap:RevolvingCreditFacilityMember\n2018-11-02\nsrt:MaximumMember us-gaap:RevolvingCreditFacilityMember\n2018-11-02\nevi:SwinglineLoansMember\n2018-11-02\nevi:StandbyLettersOfCreditMembeMember\n2018-11-02\nus-gaap:RevolvingCreditFacilityMember\n2022-07-01 2023-06-30\nus-gaap:RevolvingCreditFacilityMember evi:BSBYRateMember\n2022-07-01 2023-06-30\nevi:WesternStateDesignMember evi:DennisMackMember\n2016-10-10\nevi:WesternStateDesignMember evi:DennisMackMember\n2022-07-01 2023-06-30\nevi:WesternStateDesignMember evi:DennisMackMember\n2021-07-01 2022-06-30\nevi:TriStateMember evi:MattStephensonMember\n2017-10-31\nevi:TriStateMember evi:MattStephensonMember\n2022-07-01 2023-06-30\nevi:TriStateMember\n2023-05-01\nevi:PACIndustriesIncMember evi:FrankCostabileMember\n2023-05-01\nevi:ScottEquipmentMember evi:ScottMartinMember\n2022-07-01 2023-06-30\nevi:ScottEquipmentMember evi:ScottMartinMember\n2021-07-01 2022-06-30\nevi:AAdvantageMember evi:MikeZuffinettiMember\n2018-10-26 2018-11-01\nevi:AAdvantageMember evi:MikeZuffinettiMember\n2019-01-01 2019-01-01\nevi:AAdvantageMember evi:MikeZuffinettiMember\n2019-01-01\nevi:AAdvantageMember evi:MikeZuffinettiMember\n2022-07-01 2023-06-30\nevi:AAdvantageMember evi:MikeZuffinettiMember\n2021-07-01 2022-06-30\nevi:ScottEquipmentMember evi:ScottMartinMember\n2020-11-03\nevi:YankeeEquipmentSystemsIncMember evi:PeterLimoncelliMember\n2020-11-03\nevi:PeterLimoncelliMember\n2022-07-01 2023-06-30\nevi:PeterLimoncelliMember\n2021-07-01 2022-06-30\nevi:FederalGovernmentMember us-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember\n2022-07-01 2023-06-30\nevi:FederalGovernmentMember us-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember\n2021-07-01 2022-06-30\nevi:FederalGovernmentMember us-gaap:AccountsReceivableMember us-gaap:CustomerConcentrationRiskMember\n2022-07-01 2023-06-30\n2023-09-28\n2020-12-31\nevi:RestrictedStockUnitsMember\n2022-07-01 2023-06-30\nus-gaap:RestrictedStockUnitsRSUMember\n2023-06-30\nsrt:MinimumMember us-gaap:RestrictedStockUnitsRSUMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:RestrictedStockUnitsRSUMember\n2022-07-01 2023-06-30\nevi:RestrictedStockUnitsMember\n2021-07-01 2022-06-30\nsrt:MinimumMember us-gaap:RestrictedStockMember\n2021-07-01 2022-06-30\nsrt:MaximumMember us-gaap:RestrictedStockMember\n2021-07-01 2022-06-30\nus-gaap:RestrictedStockUnitsRSUMember\n2022-06-30\nevi:StockAwardsMember\n2022-06-30\nus-gaap:StockCompensationPlanMember\n2021-07-01 2022-06-30\nevi:RestrictedStockUnitsMember\n2023-06-30\nevi:TwoThousandsSeventeenEmployeeStockPurchasePlanMembeMember\n2022-07-01 2023-06-30\nevi:TwoThousandsSeventeenEmployeeStockPurchasePlanMembeMember\n2021-07-01 2022-06-30\nevi:RestrictedStockUnitsMember\n2022-06-30\nus-gaap:PhantomShareUnitsPSUsMember\n2022-06-30\nus-gaap:PhantomShareUnitsPSUsMember\n2022-07-01 2023-06-30\nus-gaap:PhantomShareUnitsPSUsMember\n2023-06-30\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure\nutr:sqft"
}