{
    "cik": "67887",
    "company": "MOOG INC.",
    "filing_type": "10-K",
    "filing_date": "2023-11-14",
    "period_of_report": "2023-09-30",
    "sic": "3590",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/67887/0000067887-23-000115-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/67887/000006788723000115/mog-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/67887/0000067887-23-000115.txt",
    "filename": "67887_10K_2023_0000067887-23-000115.htm",
    "content": "Item 1.\nBusiness.\nDescription of the Business. Moog is a worldwide designer, manufacturer and systems integrator of high performance precision motion and fluid controls and controls systems for a broad range of applications in aerospace and defense and industrial markets. We have three operating segments: Aircraft Controls, Space and Defense Controls and Industrial Systems.\nAdditional information describing the business and comparative segment revenues, operating profits and related financial information for 2023, 2022 and 2021 are provided in Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data, of this report.\nDistribution. Our sales and marketing organization consists of individuals possessing highly specialized technical expertise. This expertise is required in order to effectively evaluate a customers precision control requirements and to facilitate communication between the customer and our engineering staff. Our sales staff is the primary contact with customers. Manufacturers representatives are used to cover certain domestic aerospace markets. Distributors are used selectively to cover certain industrial and medical markets.\nIndustry and Competitive Conditions. We experience considerable competition in our aerospace and defense and industrial markets across tier one and tier two suppliers as well as vertically integrated primes. We believe that the principal points of competition in our markets are product quality, reliability, price, design and engineering capabilities, product development, conformity to customer specifications, timeliness of delivery, effectiveness of the distribution organization and quality of support after the sale. We believe we compete effectively on all of these bases. Competitors to our Aircraft Controls segment specialize in precision flight control and control systems manufacturing. Competitors to our space market specialize in thrust vector controls and spacecraft engines, mechanisms, avionics and structure systems and components. Competitors in our defense market produce turreted weapons, missile steering actuation and power and data transfer systems and components. Competitors to our Industrial Systems segment include other industrial precision controls and medical device manufacturers.\nBacklog. Our twelve-month backlog represents confirmed orders we believe will be recognized as revenue within the next twelve months. Our twelve-month backlog as of September 30, 2023 was $2.4 billion, an increase of 4% compared to October 1, 2022. See Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations of this report for a discussion on the various business drivers and conditions contributing to the twelve-month backlog change.\nRaw Materials. Materials, supplies and components are purchased from numerous suppliers. We believe the loss of any one supplier, although potentially disruptive in the short-term, would not materially affect our operations in the long-term.\nWorking Capital. See the discussion on operating cycle in Note 1 - Summary of Significant Accounting Policies, of Item 8, Financial Statements and Supplementary Data, of this report.\nSeasonality. Our business is generally not seasonal; however, certain products and systems, such as those in the energy market of our Industrial Systems segment, do experience seasonal variations in sales levels.\nPatents. We maintain a patent portfolio of issued or pending patents and patent applications worldwide that generally includes the United States (\"U.S.\"), Europe, China, Japan and India. The portfolio includes patents that relate to electrohydraulic, electromechanical, electronics, hydraulics, components and methods of operation and manufacture as related to motion control and actuation systems. The portfolio also includes patents related to wind turbines, robotics, vibration control and medical devices. We do not consider any one or more of these patents or patent applications to be material in relation to our business as a whole. The patent portfolio related to certain medical devices is significant to our position in this market as several of these products work exclusively together, and provide us future revenue opportunities.\nResearch Activities. Research and development activity has been, and continues to be, significant for us. Research and development expense was at least $107 million in each of the last three years and represented approximately 3% of sales in 2023.\nHuman Capital Resources. Moog possesses a unique culture that fuels our business success. Our nearly 13,500 employees across over 20 countries work closely together, driven by a shared sense of purpose and a desire to do the right thing. We value our ground-breaking, challenging work and what we stand for. We value the skill and commitment of our talented workforce above all else. Whether its enabling a Mars Rover to land safely or helping to support breakthrough advances in healthcare, together, we solve our customers most difficult challenges.\nAlthough we are a successful, global business, our employees feel like they are amongst friends and are comfortable being themselves. We empower them to find innovative ways of accomplishing things, and the scale of our business means that careers can develop in exciting and unexpected directions. For prospective employees looking for inspiring and meaningful work in a warm, respectful, family-like environment, Moog will feel like home.\nIn order to ensure we live our values and our culture stays unique and strong, our Board of Directors and executive team put significant focus on our human capital resources. These are some of the key aspects of Moogs human capital strategy:\nEmployee Recruitment\nMoog actively seeks to attract the best talent from a diverse range of sources and industries in order to meet the current and future demands of our business. We have established relationships with trade schools, world-class universities, professional associations, and industry groups to proactively attract talent.\nIn 2023, we hired over 2,000 new regular employees throughout the world.\nDiversity, Equity and Inclusion\nMoog aspires to be diverse, equitable, and inclusive, where employees are empowered to bring their whole, authentic selves to work every day. We believe being diverse, equitable and inclusive is better for all of our employees, customers and shareholders.\nDuring 2023, we continued to make progress toward our Diversity, Equity and Inclusion (\"DE&I\") strategy. In support of this strategy, we:\nGrew our DE&I curriculum to continue to help our employees understand the value of inclusivity, the very different experiences people have, and the role we all must play in creating an inclusive and welcoming environment at Moog.\nHonored employees from different backgrounds and helped increase understanding through a variety of monthly celebrations, including, but not limited to, Black History Month, International Womens Day, and Pride Month.\nExpanded our pilot of Employee Resource Groups (\"ERGs\") to include Veterans and LGBTQ+. Our ERGs are voluntary, employee-led, corporate-supported groups that are organized primarily around a defined characteristic, special interest, or life experience. We currently have five ERG chapters focused on Employees of Color, Women (2 chapters), Veterans and LGBTQ+.\nAt Moog, we are continuously striving to ensure the diversity of our organization more fully represents the diversity of the communities in which we operate.\nCompensation and Benefits\nMoog works to maintain compensation, benefits and rewards programs that enable us to attract, retain, motivate, and reward employees for their contributions to company performance. Our compensation and rewards programs are linked closely to our values of We Are All In This Together, We Try Harder, Competence Is King and Performance And Commitment Should Be Rewarded.\nMoog is committed to providing comprehensive benefit options that reflect the differing priorities and needs of our sites globally, governed by an intent to offer plans that will allow our employees and their families to live healthier and more secure lives.\nIn addition to traditional employee benefits, Moog has a number of innovative initiatives to support the well-being of our employee base, including onsite wellness clinics at a number of locations, online tools that assist employees with their physical and mental health, special events with outside vendors and participants focusing on employee well-being and much more.\nHealth and Safety\nMaintaining a safe and healthy work environment is a key priority and a responsibility for all of our employees. At Moog, we embrace a continuous improvement approach with regard to our global Environment, Health & Safety (\"EHS\") culture. All Moog businesses strive to operate in a responsible manner that demonstrates our commitment to the health and safety of our employees, customers, suppliers, communities and the environment. Our commitment will not be compromised. We expect our employees, visitors and service providers to follow our EHS standards and practices. We regularly conduct training for all of our employees and work hard to learn lessons from every incident. Additionally, we measure and review our EHS results continuously in each location.\nEmployee Engagement and Retention\nMoog is deeply committed to continuously evolving into an even better place to work. We're built on a strong foundation of mutual trust and the premise that we must engage with employees at different levels to empower our people, enable progress and align efforts.\nMoog employs a variety of mechanisms to collect and respond to feedback from our employees. We conduct a regular employee engagement survey. We also leverage focus groups and listening sessions to solicit feedback. In response to employee feedback and in acknowledgment of the changing landscape brought about by the global pandemic, Moog has been piloting a variety of flexible working arrangements, including remote work and hybrid working schedules. We are implementing these changes in a way that allows our employees to collaborate and innovate in the Moog Way that has made us so successful to date.\nWe see our positive employee engagement coming through in high levels of employee retention. For the last five years, the average of voluntary attrition has been approximately 6% of our workforce. That is a competitive attrition figure and a testament to Moog being a great place to work.\nLeadership Development and Training\nAt Moog, we believe that the best leaders are the ones who come from within. These leaders learn with us, grow with us, and reach their potential through challenging job and deliberate learning experiences we provide. Moog's leadership development strategy is to aid in the growth of its leaders at the various stages of leadership. At the foundation of these stages is our Moog Values, Moog Leadership Qualities and our Business Strategy and Processes.\nMoog has carefully designed two leadership development programs to improve the effectiveness of our managers. Our Moog Leadership Program is a two-year program designed to expand, develop, support, and sustain high potential leadership throughout the Company. Our Emerging Leadership Program is a nine-month global, cross-group leadership development program. The goal of this program is to accelerate the development of a pool of global, cross-group top talent in order to help meet the demand for important leadership roles throughout our Company. For their specific leadership needs, the operating groups have leadership programs for those emerging leaders as well, the Aircraft Group Leadership Development Program, the Space and Defense Launch Leadership Development Program and the Industrial Group Leadership Pathway. The goal of these programs is to accelerate the development of our talent in order to meet the demands for important leadership roles within the operating groups. Finally, to establish the foundations of leadership, we have our Leading and Coaching People program, which is a two-day course open to all leaders that provides the foundational framework for engaging, empowering, and coaching employees for optimal performance.\nIn addition to our leadership development programs, Moog has many other valuable development resources available for employees in order to ensure our people have everything they need to succeed both personally and professionally. These resources include a Global Mentoring Program and a Moog Leadership Qualities Library to help give our leaders guidance and support. Moog facilitates these training opportunities and programs through state-of-the-art learning and talent management systems. Our employees are encouraged to take responsibility for their own development and create learning plans that fit their needs and development goals best.\nSuccession Planning\nEach year Moog conducts an extensive talent review across our global enterprise that includes, among other important topics, a review of succession plans for many of our roles. To ensure the long-term continuity of our business, we actively manage the development of talent to fill the roles that are most critical to the on-going success of our Company.\nCorporate Social and Environmental Responsibility\nOur values, rooted in trust, integrity, and collaboration, lay the foundation for Moog's commitment to grow as a sustainable corporation. As a developer of advanced motion control products, we believe in momentum and our shared responsibility to protect people and the planet now and for generations to come. At Moog, we are committed to:\nProtecting our planet by minimizing our environmental impact.\nStriving to contribute our time, talent, and resources to strengthen the communities where we do business.\nEngaging in ethical practices.\nWe are committed to a more inclusive, equitable world which is reflected in our corporate culture, work environment, supply chain and community support around the globe.\nCurrently, we are assessing our environmental, social and governance impact in all of our locations across 25 countries. Among other areas, we are evaluating our direct and indirect greenhouse emissions, how we operate and our effect on stakeholders. This latest available data will help us establish a baseline and set ambitious sustainability goals across the business.\nWe're all in this together. Moog and its employees live this mantra with countless initiatives focused on supporting our sustainability strategy and communities. Some recent examples in 2023 of Moogs responsibility in action include:\nSee our Sustainability Report and Sustainability Accounting Standards Board (SASB) disclosure at https://www.moog.com/sustainability.html. The content of the Sustainability Report and the Company's website are not, and should not, be deemed to be incorporated by reference in this Form 10-K or otherwise filed with the Securities and Exchange Commission (\"SEC\").\nWe compiled our first global inventory of greenhouse gas emissions starting with fiscal year 2021 and have developed a global Data Collection Procedure and an Inventory Management Plan. Additionally, we have set a goal to reduce our combined Scope 1 and 2 emissions in company operations and plan to communicate this in 2024, it is supported by a strategy and governance controls. We have established baselines from 2022 data for Hazardous Waste and Water consumption, both of which will be subject to goals for improvement.\nWe electrified a fleet of Facilities and Operations vehicles at our head quarters, in East Aurora, NY, with more planned.\nWe continue to expand our Community giving platform, now available across all UK and US sites, with plans for further expansion internationally in 2024.\nWe have developed an East Aurora Campus Biodiversity Plan to nurture the 300 acres of land we own in Western New York.\nBusiness Ethics\nMoog is fully dedicated to conducting ourselves by the letter and in the spirit of the many laws and standards that apply to our business. Ethics are deeply embedded in our values and business processes. We regularly re-enforce our commitment to ethics and integrity in employee communications, in our everyday actions and in processes and controls. As a part of our on-going efforts to ensure our employees conduct business with the highest levels of ethics and integrity, Moog has compliance training programs in multiple languages. We also maintain two ethics related hotlines, through which individuals can anonymously raise concerns they have about business behavior they do not feel comfortable discussing personally with business operations managers or human resources personnel. The Company's general confidential ethics hotline is administered by internal company counsel designated as Moog's ethics advocate. In addition, we maintain a separate hotline for cases wherein an employee believes that the Company's financial statements are materially misstated as a result of intentional acts or material weaknesses in the systems of internal control. This hotline is administered by the Company's Corporate Secretary.\nCustomers. Our principal customers are Original Equipment Manufacturers (\"OEMs\") and end users for whom we provide aftermarket support. Aerospace and defense OEM customers collectively represented 58% of 2023 sales. The majority of these sales are to a small number of large companies. Due to the long-term nature of many of the programs, many of our relationships with aerospace and defense OEM customers are based on long-term agreements. Our industrial market sales, which represented 30% of 2023 sales, are to a wide range of global customers and are normally based on lead times of 90 days or less. We also provide aftermarket support, consisting of spare and replacement parts and repair and overhaul services, for all of our products. Our major aftermarket customers are the U.S. Government and commercial airlines. In 2023, aftermarket sales accounted for 13% of total sales.\nOur significant customers include tier one, large U.S. Government contractors and system integrators and are primarily within our Aircraft Controls and Space and Defense Controls segments. Net sales to our five largest customers represented approximately 32% of our 2023 sales.\nAll U.S. Government contracts are subject to termination by the U.S. Government. In 2023, sales under U.S. Government contracts represented 39% of total sales and were primarily within our Aircraft Controls and Space and Defense Controls segments.\nSee Item 1A, Risk Factors and Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data, of this report for additional information on U.S. Government contracts and customers accounting for more than 10% of our net sales.\nInternational Operations. Our operations outside the U.S. are conducted primarily through wholly-owned foreign subsidiaries and are located predominantly in Europe and the Asia-Pacific region. See Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data of this report for information regarding sales by geographic area and Exhibit 21 of Item 15, Exhibits and Financial Statement Schedules of this report for a list of subsidiaries. Our international operations are subject to the usual risks inherent in international trade, including currency fluctuations, local government contracting regulations, local governmental restrictions on foreign investment and repatriation of profits, exchange controls, regulation of the import and distribution of foreign goods, as well as changing economic and social conditions in countries in which our operations are conducted.\nEnvironmental Matters. See the discussion in Note 24 - Commitments and Contingencies, of Item 8, Financial Statements and Supplementary Data, of this report.\nWebsite Access to Information. Our internet address is www.moog.com. The information contained on or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this or any other report filed with the SEC. We make our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and, if applicable, amendments to those reports, available on the investor relations portion of our website. The reports are free of charge and are available as soon as reasonably practicable after they are filed with the SEC. The SEC maintains a website at www.sec.gov that contains reports, proxy statements and other information regarding SEC registrants, including Moog.\nInformation about our Executive Officers. Other than the prior positions noted in the table below, the principal occupations of our executive officers for the past five years is the current positions they hold.\nExecutive Officers\nCurrent Position Prior Positions Age\nYear First\nElected Officer\nPat Roche\nChief Executive Officer and Director\nOn February 2, 2023, Pat Roche was named Chief Executive Officer. Previously, he served as Executive Vice President and Chief Operating Officer, a position he held since December 1, 2021. Prior to that, he served as Group Vice President and President, Industrial Group, positions he held since 2012. 60 2012\nMark J. Trabert\nExecutive Vice President and Chief Operating Officer On March 1, 2023, Mark J. Trabert was named Executive Vice President and Chief Operating Officer. Previously, he served as Vice President and President, Aircraft a position he held since 2015. 64 2015\nJennifer Walter\nVice President and Chief Financial Officer\nOn January 2, 2020 Jennifer Walter was named Chief Financial Officer. Previously, she was Vice President - Finance, a position she held since 2018. 52 2008\nJoseph Alfieri\nVice President and President, Space and Defense\nOn March 1, 2023, Joseph Alfieri was named Vice President and President, Space and Defense. Previously, he served as General Manager, Moog Construction, a position he held since 2021. Prior to that, he served as General Manager, Commercial Aircraft Original Equipment since 2018. 41 2023\nMaureen M. Athoe\nVice President\nOn February 28, 2023, Maureen Athoe retired as President, Space and Defense, while continuing to serve as Vice President. 65 2015\nMark Graczyk Vice President and President, Military Aircraft On March 1, 2023, Mark Graczyk was named Vice President and President, Military Aircraft. Previously, he served as Chief Business Officer, Aircraft, a position he held since 2022. Prior to that, he served as General Manager, Industrial Controls since 2021 and Finance Director, Aircraft, since 2017. 40 2023\nStuart Mclachlan Vice President On December 1, 2021, Stuart Mclachlan was named Vice President and President, Industrial Group. Previously, he was Group Vice President and Chief Business Officer to the Aircraft Group, a position he held since 2019. Prior to that, he served as Group Vice President for Aircraft Control Components. 52 2022\nMichael Schaff Vice President and President, Commercial Aircraft On March 1, 2023, Michael Schaff was named Vice President and President, Commercial Aircraft. Previously, he served as General Manager, Commercial Aircraft Original Equipment since 2021. Prior to that, he served as Finance Director, Space and Defense since 2017. 52 2023\nPaul Wilkinson\nVice President\n43 2017\nDisclosure Regarding Forward-Looking Statements\nInformation included or incorporated by reference in this report that does not consist of historical facts, including statements accompanied by or containing words such as may, will, should, believes, expects, expected, intends, plans, projects, approximate, estimates, predicts, potential, outlook, forecast, anticipates, presume and assume, are forward-looking statements. Such forward-looking statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements are not guarantees of future performance and are subject to several factors, risks and uncertainties, the impact or occurrence of which could cause actual results to differ materially from the expected results described in the forward-looking statements. Certain of these factors, risks and uncertainties are discussed in the sections of this report entitled Risk Factors and Managements Discussion and Analysis of Financial Condition and Results of Operations. New factors, risks and uncertainties may emerge from time to time that may affect the forward-looking statements made herein. Given these factors, risks and uncertainties, investors should not place undue reliance on forward-looking statements as predictive of future results. We disclaim any obligation to update the forward-looking statements made in this report, except as required by law. Item 1A.\nRisk Factors.\nOur business, financial condition and results of operations face many risks, many of which are not exclusively within our control. The known, material risks to our business summarized below should be carefully considered together with all of the other information included in this report, including the financial statements and related notes. Any of the risks discussed below, elsewhere in this report or in our other SEC filings could have a material impact on our business, financial condition or results of operations. Although the risks summarized below are organized by heading, and each risk is summarized separately, many of the risks are interrelated. While we believe we have identified and discussed below the material risks affecting our business, there may be additional risks and uncertainties not currently known to us or that we currently consider immaterial that may materially adversely affect our business, financial condition or results of operations in the future and may require significant management time and attention.\nSTRATEGIC RISKS\nWe operate in highly competitive markets with competitors who may have greater resources than we possess. Many of our products are sold in highly competitive markets. Some of our competitors, especially in our industrial markets and medical markets, are larger, more diversified and have greater financial, marketing, production and research and development resources. Within the aerospace and defense industries, suppliers have consolidated to widen their product offerings and to secure long-term sole-source positions. As a result, these competitors may be better able to withstand the effects of periodic economic downturns. Our sales and operating margins will be negatively impacted if our competitors:\ndevelop products that are superior to our products,\ndevelop products of comparable quality and performance that are more competitively priced than our products,\ndevelop more efficient and effective manufacturing methods for their products and services, or\nadapt more quickly than we do to technological innovations or evolving customer requirements.\nWe believe that the principal points of competition in our markets are product quality, reliability, design and engineering capabilities, price, innovation, conformity to customers' specifications, timeliness of delivery, effectiveness of the distribution organization and quality of support after the sale. Maintaining or improving our competitive position requires continued investment in manufacturing, engineering, quality standards, marketing, customer service and support and our distribution networks. If we do not maintain sufficient resources to make these investments, are not successful in meeting our quality or delivery standards or are not successful in maintaining our competitive position, we could face pricing pressures or loss in market share, causing our operations and financial performance to suffer.\nOur research and development and innovation efforts are substantial and may not be successful, which could reduce our sales and earnings. Our products and technological capabilities have undergone, and in the future may undergo, significant changes. In order to maintain a leadership position in the high-performance, precision controls market in the future, we have incurred, and we expect to continue to incur, substantial expenses associated with research and development and innovation activities during the introduction of new products. Our technology has been developed through customer-funded and internally-funded research and development investments, as well as through business acquisitions. If we fail to predict customers' preferences, market preferences or fail to provide viable technological solutions, we may experience inefficiencies that could delay or prevent the acceptance of new products or product innovations. Also, incurred research and development expenses may exceed our cost estimates and the new products we develop may not generate sales sufficient to offset our investments. Additionally, our competitors may develop technologies or products that have more competitive advantages than ours and render our technology noncompetitive or obsolete.\nIf we are unable to adequately enforce and protect our intellectual property or defend against assertions of infringement, our business and our ability to compete could be harmed. Protecting our intellectual property is critical in order to maintain a competitive advantage. We therefore rely on internally developed and acquired patents, trademarks, copyrights, trade secrets, proprietary know-how to establish and protect our technologies and products. However, these measures afford only limited protection, and our patent rights and other intellectual property protections have been in the past, and may be in the future, infringed, misappropriated, misrepresented, copied without authorization, circumvented or invalidated in the U.S. or in foreign countries that do not offer the same level of intellectual property protections. Also, as our patents and other intellectual property protections expire, we may face increased competition. Additionally, we cannot be assured that our existing or planned products do not, or will not, infringe on the intellectual property rights of others or that others will not claim such infringement. When others infringe on our intellectual property rights, the value of our products is diminished, and we have incurred, and may continue to incur, substantial litigation costs to enforce our rights. Litigation related to intellectual property matters has diverted, and may continue to divert, management's focus and resources away from operations. If we are unable to adequately enforce and protect our intellectual property or defend against assertions of infringement, we could face reputational harm and our inability to defend against these scenarios could have an adverse effect on our competitive position, our business operations and financial condition.\nOur sales and earnings may be affected if we cannot identify, acquire or integrate strategic acquisitions, or as we conduct portfolio shaping and footprint rationalization initiatives. Acquisitions are an element of our growth strategy as we opportunistically make investments in our businesses. Our historical growth has depended, and our future growth is likely to depend, in part, on our ability to successfully identify, acquire and integrate acquired businesses. We intend to seek additional acquisition opportunities that enhance our core businesses or accelerate our position on our new growth ventures. Growth by acquisition involves risk that could adversely affect our financial condition and operating results. We may not know the potential exposure to unanticipated liabilities, and the acquisition agreements we may enter into may not fully protect us or protect us at all from unanticipated liabilities. Additionally, the expected benefits or synergies might not be fully realized, integrating operations and personnel may be slowed and key employees, suppliers or customers of the acquired business may depart. As a result of our ongoing margin expansion initiatives, we expect to continue to divest assets or businesses, discontinue products or reduce our operating footprint. Under certain circumstances, this may require us to record impairment charges or losses as a result of a transaction. In pursuing acquisition opportunities, integrating acquired businesses or divesting business operations, management's time and attention may be diverted from our core business, while consuming resources and incurring expenses for these activities.\nMARKET CONDITION RISKS\nThe markets we serve are cyclical and sensitive to domestic and foreign economic conditions and events, which may cause our operating results to fluctuate. The markets we serve are sensitive to fluctuations in general business cycles, global pandemics, domestic and foreign governmental tariffs, trade and monetary policies and economic conditions and events. U.S. domestic air travel has recovered from the COVID-19 pandemic, while international travel utilizing widebody aircraft remains slightly below 2019 levels. As such, we believe The Boeing Company, or Boeing, and Airbus will continue to directionally match their widebody aircraft production rates with the reduced, albeit recovering, international air traffic volume, which has lowered their demand for our flight control systems. Also, U.S. Department of Defense and other foreign governments' defense funding levels, driven in part by the current global unrest, can fluctuate and affect our defense and our space programs. Our industrial product demand depends upon several factors including levels of capital investment, the pace of product innovations and technology upgrades, changing economic conditions and the current and forecasted price of oil and natural gas.\nWe depend heavily on government contracts that may not be fully funded or may be terminated, and the failure to receive funding or the termination of one or more of these contracts could reduce our sales and increase our costs. Sales to the U.S. Government and its prime contractors and subcontractors represent a significant portion of our business. In 2023, sales under U.S. Government contracts represented 39% of our total sales, primarily within Aircraft Controls and Space and Defense Controls. Sales to foreign governments represented 8% of our total sales. Funding for government programs can be structured into a series of individual contracts and depend on cyclical annual congressional appropriations. At times when there are perceived threats to national security, U.S. Defense spending can increase; at other times, defense spending can decrease. Future levels of defense spending are uncertain and subject to congressional debate and spending prioritization. Any reduction in future Department of Defense spending levels could adversely impact our sales, operating profit and our cash flow. We have resources applied to specific government contracts and if any of those contracts are rescheduled or terminated, we may incur substantial costs redeploying those resources.\nThe loss of The Boeing Company as a customer or a significant reduction in the sales to The Boeing Company could adversely impact our operating results. We provide Boeing with controls for both military and commercial applications, as well as controls for space and defense applications, which totaled 11% of our 2023 sales. Sales to Boeing's commercial airplane group are generally made under long-term supply agreements. Boeing operates in a competitive environment and continues to evaluate the size, scope and cost of their supplier base. Also, Boeing continues to match their commercial production rates to the resized global air traffic volume and is increasing production rates following the COVID-19 pandemic. In addition, a portion of our sales to Boeing is tied to varying levels of government defense spending, and a reduction in future Department of Defense spending levels could adversely impact our sales, operating profit and cash flow. Furthermore, a loss of Boeing as a customer could materially reduce our sales and earnings.\nWe may not realize the full amounts reflected in our backlog as revenue, which could adversely affect our future revenue and growth prospects. As of September 30, 2023, our total backlog was $5.1 billion, which represents confirmed orders we believe will be recognized as revenue. There is no assurance that our customers will purchase all the orders represented in our backlog. A significant portion of our backlog relates to commercial aircraft programs. We believe Boeing and Airbus will continue to directionally match their widebody aircraft production rates with the resized international air traffic volume. Also, given the uncertain nature of our contracts with the U.S. Government and other foreign governments, in part due to governments' abilities to modify, curtail or terminate major programs, we may not realize the full revenue value of the orders included in our backlog. If this occurs, our future revenue and growth prospects may be adversely affected.\nOPERATIONAL RISKS\nA constrained supply chain, as well as inflated prices, across various raw materials and third-party provided components and sub-assemblies have had, and could continue to have, a material impact on our ability to manufacture and ship our products, in addition to adversely impacting our operating profit and balance sheet. Constraints in our supply chain due to worldwide demand for electronics and components across several end markets has affected our business. We have experienced and may continue to experience shortages and delays in materials and components necessary in our manufacturing processes, preventing us from completing and shipping our final products on time. As a result of these interruptions and long lead times that may continue, we are selectively purchasing, in advance, certain raw materials and third-party provided components and sub-assemblies that we are concerned might otherwise be delayed. Additionally, the prices for materials and components used in our products has increased, adding additional pressures to our operating margins. We may be unable to raise our prices for our products equal to the increased prices for supplied materials and components, and if our constrained supply chain continues or we otherwise face continued price increases from our suppliers, our operating profit and balance sheet may be negatively impacted.\nIf our subcontractors or suppliers fail to perform their contractual obligations, our prime contract performance and our ability to obtain future business could be materially and adversely impacted. With respect to many of our contracts, we rely on other companies to perform portions of the manufacturing process of our products. While we actively manage our supply chain establishing alternate sources, some business conditions cause us to obtain certain components and sub-assemblies from a single supplier or a limited group of suppliers. There are risks that we may have disputes with our subcontractors regarding the quality and timeliness of work performed by the subcontractor, customer concerns about the subcontractor, our failure to extend existing task orders or issue new task orders under a subcontract or our hiring of personnel of a subcontractor. A failure by any of our sole-sourced or group of subcontractors to timely and satisfactorily provide the required, defect-free supplies or components, or perform the required services, may materially and adversely impact our ability to perform our obligations as the prime contractor. Subcontractor performance deficiencies could result in a customer terminating our prime contract for default, which could expose us to liability and substantially impair our ability to compete for future orders.\nWe face, and may continue to face, risks related to information systems interruptions, intrusions and or new software implementations, which may adversely affect our business operations. We rely extensively on various information technologies throughout our company supporting nearly every business activity. In doing so, we work with sensitive data types including proprietary business information, intellectual property and confidential employee data. Handling and storage of this data, either onsite or managed by authorized third parties, subjects us to privacy, security, or other regulatory requirements, which could, if not handled or stored in compliance with applicable requirements, result in a potential liability. Business operations face risks, and may continue to face risks, due to information system errors, equipment failures, or ever-evolving cyber-attacks. Unauthorized access or tampering via cybersecurity incidents may result in potential data corruption, exposure of proprietary or confidential information and work stoppages. Additionally, we have and expect to incur additional costs to comply with our customers' increased cybersecurity protections and standards, including those of the U.S. Government. We have embarked on multi-year business information system transformation and standardization projects. These endeavors are complex and company-wide, involving new technologies and may introduce risk to our cybersecurity infrastructure. While we are investing significant resources throughout the planning, project managing and deployment processes, unanticipated delays could occur and could adversely affect our financial results. Any of these cybersecurity issues may cause operational stoppages, increased operational costs, fines, penalties and diminished competitive advantages through reputational damages.\nWe may not be able to prevent, or timely detect, issues with our products and our manufacturing processes which may adversely affect our operations and our earnings. We must continuously improve product development and manufacturing processes and systems to ensure we deliver high-quality, technically advanced products. Due to growth in operations, and our constrained supply chain, there is a risk our current manufacturing processes and systems are unable to maintain our high-quality and on-time delivery standards for our customers. If we are unable to maintain these standards, we could experience late deliveries and penalties, recalls, increased warranty costs, order cancellations and litigation.\nThe failure or misuse of our products may damage our reputation, necessitate a product recall or result in claims against us that exceed our insurance coverage, thereby requiring us to pay significant damages. Defects in the design and manufacture of our products or our subcontractors' products may necessitate a product recall. We include complex system designs and components in our products that could contain errors or defects, particularly when we incorporate new technologies into our products. If any of our products are defective, we could be required to redesign or recall those products, pay substantial damages or warranty claims and face actions by regulatory bodies and government authorities. Such an event could result in significant expenses, delay sales, inflate inventory, cause reputational damage or cause us to withdraw from certain markets. We are also exposed to product liability claims. Many of our products are used in applications where their failure or misuse could result in significant property loss and serious personal injury or death. We carry product liability insurance consistent with industry norms. However, these insurance coverages may not be sufficient to fully cover the payment of any potential claim. A product recall or a product liability claim not covered by insurance could have a material adverse effect on our business, financial condition and results of operations.\nFINANCIAL RISKS\nWe make estimates in accounting for over-time contracts, and changes in these estimates may have significant impacts on our earnings. We have over-time contracts with some of our customers, predominantly in our aerospace and defense markets. We recognize revenue using an input method that uses costs incurred to date to measure progress toward completion (\"cost-to-cost\"). Changes in these required estimates could have a material adverse effect on sales and profits. Any adjustments are recognized in the period in which the change becomes known using the cumulative catch-up method of accounting. For contracts with anticipated losses at completion, we establish a provision for the entire amount of the estimated remaining loss and charge it against income in the period in which the loss becomes known and can be reasonably estimated. Amounts representing performance incentives, penalties, contract claims or impacts of scope change negotiations are considered in estimating revenues, costs and profits when they can be reliably estimated and realization is considered probable. Due to the substantial judgments involved with this process, our actual results could differ materially or could be settled unfavorably from our estimates. See Note 2 - Revenue from Contracts with Customers of Item 8, Financial Statements and Supplementary Data, of this report.\nWe enter into fixed-price contracts, which could subject us to losses if we have cost overruns. In 2023, fixed-price contracts represented 93% of our over-time sales that we account for using the cost-to-cost method. On fixed-price contracts, we agree to perform the scope of work specified in the contract for a predetermined price. Depending on the fixed price negotiated, these contracts may provide us with an opportunity to achieve higher profits based on the relationship between our total contract costs and the contract's fixed price. However, we bear the risk that increased or unexpected costs may reduce our profit or cause us to incur a loss on the contract, which would reduce our net earnings. Although we closely monitor all programs and continuously seek opportunities, in coordination with our customers and suppliers, to mitigate future material impacts on profitability relating to our fixed price contracts, we may be unsuccessful in these efforts and our net earnings may be reduced. Contract loss reserves are most commonly associated with fixed-price contracts that involve the design and development of innovative control systems to meet the customer's specifications.\nOur indebtedness and restrictive covenants under our credit facilities and indenture governing our senior notes could limit our operational and financial flexibility. We have incurred significant indebtedness and may incur additional debt as we invest in operations, research and development, capital expenditures and acquisitions. Our ability to make scheduled interest and principal payments could be adversely impacted by changes in the availability, terms and cost of capital, changes in interest rates or changes in our credit ratings or our outlook. These changes could increase our cost of debt, limiting our ability to meet operational and capital needs, delaying our reactions to changes in market conditions and pursuing acquisitions, thereby placing us at a competitive disadvantage. In addition, the restrictive covenants under both our credit facilities and the indenture governing our senior notes could limit our operational and financial flexibility, which could also impact our ability to operate our business.\nSignificant changes in discount rates, rates of return on pension assets, mortality tables and other factors could adversely affect our earnings and equity and increase our pension funding requirements. Pension costs and obligations are determined using actual results as well as actuarial valuations that involve several assumptions. The most critical assumptions are the discount rate, the long-term expected return on assets and mortality tables. Other assumptions include salary increases and retirement age. Some of these assumptions, such as the discount rate and return on pension assets, are reflective of economic conditions and largely out of our control. Despite our largest pension plan being well funded, changes in the pension assumptions could adversely affect our earnings, equity and funding requirements.\nA write-off of all or part of our goodwill or other intangible assets could adversely affect our operating results and net worth. Goodwill and other intangible assets are a substantial portion of our assets. At September 30, 2023, goodwill was $821 million and other intangible assets were $72 million of our total assets of $3.8 billion. The amount of goodwill and other intangible assets may increase in the future since our growth strategy includes acquisitions. However, we may have to write off all or part of our goodwill or other intangible assets if their value becomes impaired. Although this write-off would be a non-cash charge, it could reduce our earnings and adversely affect our enterprise value or financial condition significantly. We review whether goodwill or other intangible assets have been impaired annually, or more frequently, if there have been changes in circumstances or conditions.\nUnforeseen exposure to additional income tax liabilities may affect our operating results. Our distribution of taxable income is subject to domestic and, as a result of our significant manufacturing and sales presence in foreign countries, foreign tax jurisdictions. Our effective tax rate and earnings may be affected by shifts in our mix of earnings in countries with varying statutory tax rates, changes in the valuation of deferred tax assets and outcomes of any audits performed on previous tax returns. Additionally, any alterations to domestic and foreign government tax regulations or interpretations, global minimum taxes or other tax law changes could have significant impacts on our effective tax rate and on our deferred tax assets and liabilities.\nLEGAL AND COMPLIANCE RISKS\nContracting on government programs is subject to significant regulation, including rules related to bidding, billing and accounting standards, and any false claims or non-compliance could subject us to fines, penalties or possible debarment. We are subject to risks associated with government program contracting, including substantial civil and criminal fines and penalties. These fines and penalties could be imposed for failing to follow procurement integrity and bidding rules, employing improper billing practices or otherwise failing to follow cost accounting standards, receiving or paying kickbacks or filing false claims. We have been, and expect to continue to be, subjected to audits and investigations by U.S. and foreign government agencies and authorities. The failure to comply with the terms of our government contracts could harm our business reputation. We also could be subject to withheld progress payments or suspension or debarment from future government contracts, which could have a material effect on our operational and financial results.\nOur operations in foreign countries expose us to currency, political and trade risks and adverse changes in local legal and regulatory environments could impact our results of operations. We have significant manufacturing and sales operations in foreign countries. In addition, our domestic operations sell to foreign customers. Our financial results may be adversely affected by fluctuations in foreign currencies and by the translation of the financial statements of our foreign subsidiaries from local currencies into U.S. dollars. Both the sales from international operations and export sales are subject to varying degrees of risks inherent in doing business outside of the U.S. Such risks include the possibility of unfavorable circumstances arising from host country laws, regulations or customs including, but not limited to privacy laws protecting personal data, changes in tariff and trade barriers and import or export licensing requirements. Uncertainty also remains with respect to trade policies and treaties between the U.S. and other countries including China, where we both source products and have customers. Changes to tariffs or other trade restrictions may result in higher prices for new aircraft, which may negatively impact customer order volume, and restrict our future orders. The potential loss of orders could negatively impact our financial results including lower sales, operating profits and cash flow. For our sales mix by country, see Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data, of this report.\nGovernment regulations could limit our ability to sell our products outside the U.S. and otherwise adversely affect our business. Our failure to obtain, or fully adhere to, the limitations contained in the requisite licenses, meet registration standards or comply with other government export regulations would hinder our ability to generate revenues from the sale of our products outside the U.S. In addition, the U.S. Government has established, and from time to time revises, sanctions that restrict or prohibit U.S. companies and their subsidiaries from doing business with certain foreign countries, entities and individuals. The absence of comparable restrictions on competitors in other countries may adversely affect our competitive position. In order to sell our products in European Union countries, we must satisfy certain technical requirements. If we are unable to comply with those requirements, our sales in Europe would be restricted. Doing business internationally also subjects us to numerous U.S. and foreign laws and regulations, including regulations relating to import-export control, technology transfer restrictions, anti-bribery, privacy regulations and anti-boycott provisions. From time to time, we have in the past filed, and may in the future file, voluntary disclosure reports with the U.S. Department of State and the Department of Commerce regarding certain violations of U.S. export laws and regulations discovered by us in the course of our business activities, employee training or internal reviews and audits. To date, our voluntary disclosures have not resulted in a fine, penalty, or export privilege denial or restriction that has materially impacted our financial condition or ability to export. Our failure, or failure by an authorized agent or representative that is attributable to us, to comply with these laws and regulations could result in administrative, civil or criminal liabilities. In the extreme case, these failures could result in financial penalties, suspension or debarment from government contracts or suspension of our export privileges, which could have a material adverse effect on us. For our sales mix by country, see Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data, of this report.\nWe are involved in various legal proceedings, the outcome of which may be unfavorable to us. Our business may be adversely impacted by the outcome of legal proceedings and other contingencies that cannot be predicted with certainty. We estimate loss contingencies and establish reserves based on our assessment when liability is deemed probable and reasonably estimable given the facts and circumstances known to us at a particular point in time. Subsequent developments may affect our assessment and estimates of the loss contingencies recognized as liabilities.\nOur operations are subject to environmental laws and complying with those laws may cause us to incur significant costs. Our operations and facilities are subject to numerous stringent environmental laws and regulations. Although we believe that we are in material compliance with these laws and regulations, future changes in these laws, regulations or interpretations of them, or changes in the nature of our operations may require us to make significant capital expenditures to ensure compliance. We have been, and are currently involved in, environmental remediation activities. The cost of these activities may become significant depending on the discovery of additional environmental exposures at sites that we currently own or operate, at sites that we formerly owned or operated, or at sites to which we have sent hazardous substances or wastes for treatment, recycling or disposal.\nWe may face reputational, regulatory or financial risks from a perceived, or an actual, failure to achieve our sustainability goals. The increased focus on sustainability practices and disclosures is rapidly evolving, as is the criteria to measure our sustainability performance; both of which could result in greater expectations and may cause us to undertake costly initiatives to satisfy the evolving criteria. As we advance our sustainable business model, we are pursuing programs that we believe will improve our environmental practices, social engagement and how we govern ourselves. We periodically publish information about our sustainability goals, standards and frameworks. Achievement of these objectives is subject to risks and uncertainties, many of which are outside of our direct control, and it is possible we may fail, or be perceived to have failed, in the achievement of our sustainability goals. Also, certain customers, associates, shareholders, investors, suppliers, business partners, government agencies and non-governmental organizations may not be satisfied with our sustainability efforts. A failure or perceived failure of our sustainability goals could negatively affect our reputation and our results of operations.\nThe recently received invalidation of our facility security clearance by the U.S. Defense Counterintelligence and Security Agency (DCSA) could impact potential future business as well as adversely affect our operating results. The DCSA requires facility security clearance to bid and perform on classified contracts for the Department of Defense and other agencies of the U.S. government. On September 8, 2023, the DCSA notified us in writing that our existing facility security clearance has been invalidated on the basis that our Senior Management Official, Chief Executive Officer Pat Roche, is not a U.S. citizen. Until a mitigation plan approved by the DCSA is in place, we will not be able to enter new contracts that require a facility security clearance. While we expect to obtain approval from DCSA for our mitigation plan, there are no assurances that it will be approved in a timely manner or approved at all. Furthermore, the DCSA may require that we comply with additional, or currently unforeseen conditions or obligations, as part of the mitigation plan, which may adversely impact our business or operations. We expect that the mitigation measure will involve creating a subsidiary with an organizational structure and procedures to ensure the protection of classified information. The inability to enter into new contracts that require a facility security clearance until the mitigation plan is implemented, the unknown timeline and additional costs we may incur to satisfy the mitigation plan and the diversion of management's focus and resources away from operations and towards matters related to the mitigation plan could adversely affect our business, sales, operating profit and cash flow.\nGENERAL RISKS\nFuture terror attacks, war, natural disasters or other catastrophic events beyond our control could negatively impact our business. Terror attacks, war or other civil disturbances, natural disasters and other catastrophic events could lead to economic instability and decreased demand for commercial products, which could negatively impact our business, financial condition, results of operations and cash flows. From time to time, terrorist attacks worldwide have caused instability in global financial markets and in the aviation industry. Also, our facilities and suppliers are located throughout the world and could be subject to damage from fires, floods, earthquakes or other natural or man-made disasters. Although we carry third party property insurance covering these and other risks, our inability to meet customers' schedules as a result of a catastrophe may result in the loss of customers or significantly increase costs, including penalty claims under customer contracts.\nOur performance could suffer if we cannot maintain our culture as well as attract, retain and engage our employees. We believe our culture is our strongest asset and is the foundation of our business. Our culture focuses on trust, respect, collaboration, confidence and empowerment. Our strong culture allows us to recruit and retain top-level talent. We also believe our employees and our experienced leadership group are competitive advantages, as the best people, over time, produce the best results. If we are unable to carry these values forward by not attracting the most talented candidates, by not retaining and engaging our global workforce including our senior management team, or by not investing in their talent and personal development, our operational and financial performances could suffer Item 1B.\nUnresolved Staff Comments.\nNone. Item 2.\nProperties.\nOn September 30, 2023, we occupied 5,532,000 square feet of space, distributed by segment as follows:\nSquare Feet\nOwned\nLeased\nTotal\nAircraft Controls 1,481,000 394,000 1,875,000\nSpace and Defense Controls 1,107,000 486,000 1,593,000\nIndustrial Systems 1,388,000 656,000 2,044,000\nCorporate Headquarters 20,000 - 20,000\nTotal 3,996,000 1,536,000 5,532,000\nWe have principal manufacturing facilities in the U.S. and countries throughout the world in the following locations:\nAircraft Controls - U.S., Philippines, United Kingdom and Ireland.\nSpace and Defense Controls - U.S., Ireland, United Kingdom and Australia.\nIndustrial Systems - U.S., Germany, Italy, Japan, India, Czech Republic, China, Costa Rica, Netherlands, Luxembourg, Canada, Lithuania, United Kingdom and Philippines.\nOur corporate headquarters is located in East Aurora, New York.\nWe believe that our properties have been adequately maintained, are generally in good condition and will be able to accommodate our capacity needs to meet current levels of demand. We continuously review our anticipated requirements for facilities and on the basis of that review, may from time to time acquire additional facilities, expand or dispose of existing facilities. Leases for our properties expire at various times from 2024 through 2093. Upon the expiration of our current leases, we believe that we will be able to either secure renewal terms or enter into leases for alternative locations at market terms. Item 3.\nLegal Proceedings.\nFrom time to time, we are involved in legal proceedings. We are not a party to any pending legal proceedings that management believes will result in a material adverse effect on our financial condition, results of operations or cash flows. Item 4.\nMine Safety Disclosures.\nNot applicable.\nPART II Item 5.\nMarket for the Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur two classes of common shares, Class A common stock and Class B common stock, are traded on the New York Stock Exchange (\"NYSE\") under the ticker symbols MOG.A and MOG.B.\nThe number of registered shareholders of our Class A common stock and Class B common stock was 517 and 296, respectively, as of November 6, 2023.\nThe following table summarizes our purchases of our common stock for the quarter ended September 30, 2023.\nIssuer Purchases of Equity Securities\nPeriod (a) Total\nNumber of\nShares\nPurchased\n(1)(2) (b) Average\nPrice Paid\nPer Share (c) Total Number\nof Shares\nPurchased as\nPart of Publicly\nAnnounced Plans\nor Programs (3) (d) Maximum\nNumber\n(or Approx.\nDollar Value) of\nShares that May\nYet Be Purchased\nUnder Plans or\nPrograms (3)\nJuly 2, 2023 - July 29, 2023 68,962 $ 106.13 - 2,172,081\nJuly 30, 2023 - September 2, 2023 19,316 113.77 - 2,172,081\nSeptember 3, 2023 - September 30, 2023 12,823 114.12 - 2,172,081\nTotal 101,101 $ 108.60 - 2,172,081\n(1)Reflects purchases by the Moog Inc. Stock Employee Compensation Trust Agreement (\"SECT\") of shares of Class B common stock from the Moog Inc. Retirement Savings Plan (\"RSP\") and the Employee Stock Purchase Plan (\"ESPP\") as follows: 13,010 shares at $108.54 during July; 18,324 shares at $113.70 during August and 11,538 shares at $113.57 during September.\n(2)In connection with the exercise of equity-based compensation awards, we accept delivery of shares to pay for the exercise price and withhold shares for tax withholding obligations. In July, we accepted delivery of 765 Class A shares at $109.57 and 300 Class B shares at $112.06; In August, we accepted delivery of 88 Class A shares at $108.56 and 408 Class B shares at $116.16; In September, we accepted delivery of 1,236 Class A shares at $119.42 and 18 Class B shares at $110.78. In connection with the issuance of equity-based awards and shares to the ESPP, we purchased 54,887 Class B shares at $105.47 in July, 496 Class B shares at $115.43 in August and 31 Class B shares at $112.16 in September from the SECT.\n(3)The Board of Directors has authorized a share repurchase program that permits the purchase of up to 3 million common shares of Class A or Class B common stock in open market or privately negotiated transactions at the discretion of management.\nPerformance Graph\nThe following graph and tables show the performance of the Company's Class A common stock compared to the NYSE Composite-Total Return Index and the S&P Aerospace & Defense Index for a $100 investment made on September 30, 2018, including reinvestment of any dividends.\n9/18 9/19 9/20 9/21 9/22 9/23\nMoog Inc. - Class A Common Stock $ 100.00 $ 95.49 $ 75.50 $ 91.73 $ 85.77 $ 139.24\nNYSE Composite - Total Return Index 100.00 102.03 102.17 132.70 113.35 132.78\nS&P Aerospace & Defense Index 100.00 106.51 76.39 99.00 93.40 103.90 Item 6.\nReserved. Item 7.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our financial condition and results of operations should be read together with our consolidated financial statements and the related notes appearing elsewhere in this report.\nThis discussion and analysis contains forward-looking statements that involve risks, uncertainties and assumptions. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of many factors, including but not limited to those under the heading Risk Factors in Item 1A of this report.\nOVERVIEW\nWe are a worldwide designer, manufacturer and systems integrator of high-performance precision motion and fluid controls and control systems for a broad range of applications in aerospace and defense and industrial markets.\nWithin the aerospace and defense market, our products and systems include:\nDefense market - primary and secondary flight controls and components for military aircraft, turreted weapon systems, tactical and strategic missile steering controls and various defense product components.\nCommercial aircraft market - primary and secondary flight controls and components for commercial aircraft.\nSpace market - satellite avionics, positioning controls and components, launcher thrust vector controls and components, as well as integrated space vehicles.\nIn the industrial market, our products are used in a wide range of applications including:\nIndustrial market - various components and systems used in various applications including: heavy industrial machinery used for metal forming and pressing, flight simulation motion control systems, gas and steam exploration and generation products, material and automotive structural and fatigue testing systems, as well as for the electrification of construction vehicles.\nMedical market - components and pumps for enteral clinical nutrition and infusion therapy, CT scan medical equipment, ultrasonic sensors and surgical handpieces and sleep apnea equipment.\nWe operate under three segments, Aircraft Controls, Space and Defense Controls and Industrial Systems. Our principal manufacturing facilities are located in the U.S., Philippines, United Kingdom, Germany, Italy, Costa Rica, China, Netherlands, Luxembourg, Japan, Czech Republic, Canada, India and Lithuania.\nUnder ASC 606, 64% of revenue was recognized over time for the year ended September 30, 2023, using the cost-to-cost method of accounting. The over-time method of revenue recognition is predominantly used in Aircraft Controls and Space and Defense Controls. We use this method for U.S. Government contracts and repair and overhaul arrangements as we are creating or enhancing assets that the customer controls. In addition, many of our large commercial contracts qualify for over-time accounting as our performance does not create an asset with an alternative use and we have an enforceable right to payment for performance completed to date.\nFor the year ended September 30, 2023, 36% of revenue was recognized at the point in time control transferred to the customer. This method of revenue recognition is used most frequently in Industrial Systems. We use this method for commercial contracts in which the asset being created has an alternative use. We determine the point in time control transfers to the customer by weighing the five indicators provided by ASC 606. When control has transferred to the customer, profit is generated as cost of sales is recorded and as revenue is recognized.\nOur products and technologies affect millions of people around the world. Our solutions are critical to preserving national security, ensuring safe air transportation, reducing factory emissions and enhancing patient's lives all while driving innovation. Our engineers collaboratively design and manufacture the most advanced motion control products, to the highest quality standards, for use in demanding applications. By capitalizing on these core foundational strengths, we believe we have achieved a leadership position in the high performance, precision controls market and are \"Shaping The Way Our World Moves™.\"\nBy leveraging our engineering heritage and by focusing on customer intimacy to solve our customers' most demanding technical problems, we have been able to expand our control product franchise to multiple markets; organically growing from a high-performance components manufacturer to a high-performance systems designer, manufacturer and integrator. In addition, we continue expanding our content positions on our current platforms, seeking to be the leading supplier in the niche markets we serve. We also look for innovation in all aspects of our business, employing new technologies to improve productivity, while focusing on talent development to strengthen our employee operational performance.\nOur fundamental long-term strategies that will help us achieve our financial objectives center around pricing and simplification initiatives. Our pricing initiatives focus on receiving fair recognition for the value we deliver to our customers across all of our markets. Our simplification initiatives include:\nutilizing 80/20 processes to create, deliver and capture value,\nshaping our product and business portfolio to invest in growth areas and to divest those that no longer fit,\nrationalizing our manufacturing facility footprint to align with current and future business levels,\nfocusing our factories so that individual sites meet the unique needs of a specific market, and\ninvesting in automation and technologies to improve business operations.\nWe focus on improving shareholder value through strategic revenue growth, both organic and acquired, through improving operating efficiencies and manufacturing initiatives and through utilizing low cost manufacturing facilities without compromising quality. Historically, we have taken a balanced approach to capital deployment in order to maximize shareholder returns over the long term. These activities have included strategic acquisitions, share buybacks and dividend payments. Today, we believe we can create long term value for our shareholders by continuing to invest in our business through both capital expenditures, as well as investments in new market opportunities. We will also continue exploring opportunities to make strategic acquisitions and return capital to shareholders.\nAcquisitions and Divestitures\nAll of our acquisitions are accounted for under the purchase method and, accordingly, the operating results for the acquired companies are included in the Consolidated Statements of Earnings from the respective dates of acquisition. Under purchase accounting, we record assets and liabilities at fair value and such amounts are reflected in the respective captions on the Consolidated Balance Sheets. The purchase price described for each acquisition below is net of any cash acquired, includes debt issued or assumed and the fair value of contingent consideration.\nAcquisitions\nOn February 21, 2022, we acquired TEAM Accessories Limited (\"TEAM\") based in Dublin, Ireland for a purchase price of $14 million, consisting of $12 million in cash and contingent consideration with an initial fair value of $3 million. TEAM specializes in Maintenance, Report and Overhaul (\"MRO\") of engine and airframe components. This operation is included in our Aircraft Controls segment. TEAM has been rebranded as Moog MRO Services as of July 1, 2023.\nDivestitures\nOn September 30, 2022, we sold a sonar business based in the United Kingdom previously included in our Industrial Systems segment. We received net proceeds of $13 million and recorded a loss of $15 million, net of transaction costs. The loss is subject to adjustments associated with amounts currently held in escrow.\nOn September 20, 2022, we sold assets of a security business based in Northbrook, Illinois previously included in our Space and Defense Controls segment. We received net proceeds of $10 million and recorded a loss of $4 million, net of transaction costs.\nOn December 3, 2021, we sold the assets of our Navigation Aids (\"NAVAIDS\") business based in Salt Lake City, Utah previously included in our Aircraft Controls segment. We have cumulatively received net proceeds of $37 million and recorded a gain of $15 million, net of transaction costs. The initial gain recorded was reduced in 2023 by the recording of a reserve against the escrow receivable, which remains subject to adjustment until settlement.\nFor further information, refer to Note 3 - Acquisitions and Divestitures, of Item 8, Financial Statements and Supplementary Data, of this report.\nEquity Method Investments and Joint Ventures\nWe use the equity method of accounting to record investments and operating results of those investments in which we do not have a controlling interest, however we do have the ability to exercise significant influence over operations. We held the following equity method investments and joint ventures as of the year ended September 30, 2023.\nMoog Aircraft Services Asia (\"MASA\") is a joint venture included in our Aircraft Controls segment in which we currently hold a 51% ownership share.\nWe hold a 20% ownership interest in NOVI LLC (\"NOVI\") that is included in our Space and Defense Controls segment.\nSuffolk Technologies Fund 1, L.P., is a limited partnership included in our Industrial Systems segment.\nHybrid Motion Solutions (HMS) is a joint venture in our Industrial Systems segment in which we hold a 50% ownership interest.\nInvestments in, and the operating results of, entities in which we do not have a controlling financial interest or the ability to exercise significant influence over the operations are accounted for using the cost method of accounting, which are included in Other assets in the Consolidated Balance Sheets.\nFor further information, refer to Note 9 - Equity Method Investments and Joint Ventures, of Item 8, Financial Statements and Supplementary Data, of this report.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur financial statements and accompanying notes are prepared in accordance with U.S. generally accepted accounting principles. The preparation of these consolidated financial statements requires us to make estimates, assumptions and judgments that affect the amounts reported. These estimates, assumptions and judgments are affected by our application of accounting policies, which are discussed in Note 1 - Summary of Significant Accounting Policies, of Item 8, Financial Statements and Supplementary Data, of this report. We believe the accounting policies discussed below are the most critical in understanding and evaluating our financial results. These critical accounting policies have been reviewed with the Audit Committee of our Board of Directors.\nRevenue Recognition on Over-Time Contracts\nWe recognize revenue from contracts with customers using the five-step model prescribed in ASC 606. For contracts that qualify for over time treatment, we recognize revenue as control of the promised goods or services is being transferred to the customer. This is accomplished by using the cost-to-cost method of accounting, which measures progress as determined by the ratio of cumulative costs incurred to date to estimated total contract costs at completion, multiplied by the total estimated contract revenue, less cumulative revenue recognized in prior periods. We believe this is an appropriate measure of progress toward satisfaction of performance obligations as this measure most accurately depicts the progress of our work and transfer of control to our customers. Changes in estimates affecting sales, costs and profits are recognized in the period in which the change becomes known using the cumulative catch-up method of accounting. Revenue recognized using the cost-to-cost method of accounting over time for the year ended September 30, 2023 was 64% of total revenue. Revenue and cost estimates for substantially all over-time contract performance obligations are reviewed and updated quarterly. For further information, refer to Note 2 - Revenue from Contracts with Customers and Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data, of this report.\nContract Reserves\nAt September 30, 2023, we had contract reserves of $45 million. Contract reserves are comprised of contract loss reserves, recall reserves, and contract-related reserves. Contract loss reserves are recorded for open contracts where it is anticipated that contract costs will be greater than contract income and are determined considering all direct and indirect contract costs, exclusive of any selling, general or administrative cost allocations that are treated as period expenses. In accordance with ASC 606, we calculate contract losses at the contract level, versus the performance obligation level. Recall reserves are recorded when additional work is needed on completed products for them to meet contract specifications. Contract-related reserves are recorded for other reasons, such as delivery issues outside of the ordinary scope of the contract. For all three types of reserves, a provision for the entire amount of the loss is charged against income in the period in which the loss becomes known and can be reasonably estimated by management. For further information, refer to Note 2 - Revenue from Contracts with Customers, of Item 8, Financial Statements and Supplementary Data, of this report.\nReserves for Inventory Valuation\nAt September 30, 2023, we had net inventories of $724 million, or 36% of current assets. Reserves for inventory were $142 million, or 16% of gross inventories. Inventories are stated at the lower of cost or net realizable value with cost determined primarily on the first-in, first-out method of valuation.\nWe record valuation reserves to provide for slow-moving or obsolete inventory by principally using a formula-based method that increases the valuation reserve as the inventory ages. We also take specific circumstances into consideration. We consider overall inventory levels in relation to firm customer backlog in addition to forecasted demand including aftermarket sales. Changes in these and other factors, such as low demand and technological obsolescence, could cause us to increase our reserves for inventory valuation, which would negatively impact our gross margin. As we record provisions within cost of sales to increase inventory valuation reserves, we establish a new, lower cost basis for the inventory.\nReviews for Impairment of Goodwill\nAt September 30, 2023, we had $821 million of goodwill, or 22% of total assets. We test goodwill for impairment for each of our reporting units at least annually, during our fourth quarter, and whenever events occur or circumstances change, such as changes in the business climate, poor indicators of operating performance or the sale or disposition of a significant portion of a reporting unit. We also test goodwill for impairment when there is a change in reporting units.\nWe identify our reporting units by assessing whether the components of our operating segments constitute businesses for which discrete financial information is available and segment management regularly reviews the operating results of those components. We aggregate certain components based upon an evaluation of the facts and circumstances, including the nature of products and services and the extent of shared assets and resources. As a result, we have four reporting units.\nCompanies may perform a qualitative assessment as the initial step in the annual goodwill impairment testing process for all or selected reporting units. Companies are also allowed to bypass the qualitative analysis and perform a quantitative analysis if desired. Economic uncertainties and the length of time from the calculation of a baseline fair value are factors that we consider in determining whether to perform a quantitative test.\nWhen we evaluate the potential for goodwill impairment using a qualitative assessment, we consider factors including, but not limited to, macroeconomic conditions, industry conditions, the competitive environment, changes in the market for our products and services, regulatory and political developments, entity specific factors such as strategy and changes in key personnel and overall financial performance. If, after completing this assessment, it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, we proceed to a quantitative two-step impairment test.\nQuantitative testing first requires a comparison of the fair value of each reporting unit to its carrying value. We principally use the discounted cash flow method to estimate the fair value of our reporting units. The discounted cash flow method incorporates various assumptions, the most significant being projected revenue growth rates, operating margins and cash flows, the terminal growth rate and the discount rate. Management projects revenue growth rates, operating margins and cash flows based on each reporting unit's current business, expected developments and operational strategies typically over a five-year period. If the carrying value of the reporting unit exceeds its fair value, goodwill is considered impaired and any loss must be measured.\nIn measuring the impairment loss, the implied fair value of goodwill is determined by assigning a fair value to all of the reporting unit's assets and liabilities, including any unrecognized intangible assets, as if the reporting unit had been acquired in a business combination at fair value. If the carrying amount of the reporting unit's goodwill exceeds the implied fair value of that goodwill, an impairment loss would be recognized in an amount equal to that excess.\nThe determination of our assumptions is subjective and requires significant estimation. Changes in these estimates and assumptions could materially affect the results of our reviews for impairment of goodwill.\nFor our annual test of goodwill for impairment in 2023, we performed a qualitative assessment for each of our four reporting units.\nWe evaluated the potential for goodwill impairment by considering macroeconomic conditions, industry and market conditions, cost factors, both current and future expected financial performance, and relevant entity-specific events for each of the reporting units. We also considered our overall market performance discretely as well as in relation to our peers. The results of our qualitative assessment indicated that is more likely than not that the fair value of each of the reporting units exceed its carrying value; and therefore, a quantitative two-step impairment test was not necessary and goodwill was not impaired.\nReviews for Impairment of Long-Lived Assets\nLong-lived assets held for use, which primarily includes finite-lived intangible assets, property, plant and equipment and right-of-use assets, are evaluated for impairment whenever events or circumstances indicate that the undiscounted net cash flows to be generated by their use over their expected useful lives and eventual disposition are less than their carrying value. The long-term nature of these assets requires the estimation of their cash inflows and outflows several years into the future and only takes into consideration technological advances known at the time of the impairment test. For further information, refer to Note 6 - Property, Plant and Equipment and Note 8 - Goodwill and Intangible Assets, of Item 8, Financial Statements and Supplementary Data, of this report.\nPension Assumptions\nWe maintain various defined benefit pension plans covering employees at certain locations. In 2023, pension expense for all defined benefit plans, which includes the postretirement benefit plan, was $40 million. For further information, refer to Note 15 - Employee Benefit Plans, of Item 8, Financial Statements and Supplementary Data, of this report. Pension obligations and the related costs are determined using actuarial valuations that involve several assumptions. The most critical assumptions are the discount rate, the long-term expected return on assets and mortality rates. Other assumptions include salary increases and retirement age.\nWe use the spot rate approach to estimate the service and interest cost components of the net periodic benefit cost for most of our plans. Under this approach the service cost is determined by applying the discount rates along the yield curve to the specific service cost cash flows to determine the present value. The interest cost component is computed by using each assumed discount rate along the curve. The discount rates used in determining expense for the U.S. Employees Retirement Plan, our largest plan, in 2023 were 5.5% for service cost and 5.4% for interest cost, compared to 3.3% and 2.7%, respectively, in 2022. A 50 basis point decrease in the discount rates would decrease our annual pension expense by $1 million. The discount rates are used to state expected future cash flows at present value. Using a higher discount rate typically decreases the present value of pension obligations and decreases pension expense. We use the Aon Hewitt AA Above Median yield curve to determine the discount rate for our U.S. defined benefit plans at year end. We believe that the Aon Hewitt AA Above Median yield curve best mirrors the yields of bonds that would be selected by management if actions were taken to settle our obligation.\nMortality rates are used to estimate the life expectancy of plan participants during which they are expected to receive benefit payments. We use a modified version of the mortality table and projection scale published by the Society of Actuaries, which reflects improvements consistent with the Social Security Administration, as a basis for our mortality assumptions for our U.S. plans. We believe the use of this modified table and projection scale best reflects our demographics and anticipated plan outcomes.\nThe long-term expected return on assets assumption reflects the average rate of return expected on funds invested or to be invested to provide for the benefits included in the projected benefit obligation. In determining the long-term expected return on assets assumption, we consider our current and target asset allocations. We consider the relative weighting of plan assets, the historical performance of total plan assets and individual asset classes and economic and other indicators of future performance. Asset management objectives include maintaining an adequate level of diversification to reduce interest rate and market risk and to provide adequate liquidity to meet immediate and future benefit payment requirements. In determining the 2023 expense for our largest plan, we used a 6.5% return on assets assumption, compared to 5.0% for 2022. A 25 basis point decrease in the long-term expected return on assets assumption would increase our annual pension expense by $1 million.\nIncome Taxes\nOur annual tax rate is based on our earnings before tax by jurisdiction, applicable statutory tax rates, the impacts of permanent differences, tax incentives and tax planning opportunities in the various jurisdictions in which we operate. Significant judgment is required in determining our annual tax rate and in evaluating our tax positions.\nAn estimated annual effective tax rate is applied to our quarterly ordinary operating results. For certain significant, unusual or infrequent events, we recognize the tax impact in the quarter in which it occurs.\nWe record reserves against tax benefits when its more likely than not that we will not sustain a position if the appropriate taxing jurisdiction had full information and examined our position. We adjust these reserves when facts and circumstances change, such as when progress is made by taxing authorities in their review of our position. There is a considerable amount of judgment in making these assessments. There were no significant reserves taken in 2023.\nValuation allowances associated with deferred tax assets is another area that requires judgment. We record a valuation allowance to reduce deferred tax assets to the amount of future tax benefit that we believe is more likely than not to be realized. We consider recent earnings projections, allowable tax carryforward periods, tax planning strategies and historical earnings performance to determine the amount of the valuation allowance. Changes in these factors could cause us to adjust our valuation allowance, which would impact our income tax expense when we determine that these factors have changed.\nAt September 30, 2023, we had gross deferred tax assets of $170 million and deferred tax asset valuation allowances of $6 million. The deferred tax assets principally relate to benefit accruals, inventory obsolescence, tax benefit carryforwards, contract reserves and lease liabilities. The deferred tax assets include $8 million related to tax benefit carryforwards associated with net operating losses and tax credits, for which $6 million of deferred tax asset valuation allowances are recorded. For further information, refer to Note 16 - Income Taxes, of Item 8, Financial Statements and Supplementary Data, of this report.\nCONSOLIDATED RESULTS OF OPERATIONS\nThe following is a discussion of our results of operations in 2023 compared to 2022. A discussion of our 2022 results of operations compared to 2021 results can be found within Part II, Item 7. Management's Discussion and Analysis within our 2022 Annual Report on Form 10-K, filed with the SEC on November 14, 2022.\n2023 vs. 2022 2022 vs. 2021\n(dollars and shares in millions, except per share data) 2023 2022 2021 $ Variance % Variance $ Variance % Variance\nNet sales $ 3,319 $ 3,036 $ 2,852 $ 283 9 % $ 184 6 %\nGross margin 26.9 % 27.0 % 27.2 %\nResearch and development expenses $ 107 $ 110 $ 126 $ (3) (3 %) $ (16) (13 %)\nSelling, general and administrative expenses as a percentage of sales 14.2 % 14.8 % 14.4 %\nInterest expense $ 64 $ 37 $ 34 $ 27 73 % $ 3 8 %\nAsset impairment $ 15 $ 18 $ 2 $ (3) (19 %) $ 17 n/a\nRestructuring expense $ 8 $ 10 $ - $ (2) (16 %) $ 10 n/a\nLoss on sale of businesses $ 1 $ 3 $ 2 $ (2) (73 %) $ 2 118 %\nGain on sale of buildings $ (10) $ (9) $ - $ (1) n/a $ (9) n/a\nPension settlement $ 13 $ - $ - $ 13 - % $ - - %\nOther $ 9 $ 1 $ (3) $ 8 n/a $ 4 (146 %)\nEffective tax rate 20.9 % 23.6 % 22.8 %\nNet earnings $ 171 $ 155 $ 157 $ 16 10 % $ (2) (1 %)\nDiluted average common shares outstanding 32 32 32 - - % - (1 %)\nDiluted earnings per share $ 5.34 $ 4.83 $ 4.87 $ 0.51 11 % $ (0.04) (1 %)\nTotal backlog $ 5,100 $ 5,200 $ 4,800 $ (100) (2 %) $ 400 9 %\nTwelve-month backlog $ 2,400 $ 2,300 $ 2,100 $ 100 4 % $ 200 10 %\nNet sales increased across all of our segments in 2023 compared to 2022. The absence of sales associated with our businesses divested in 2022 decreased sales $36 million. Also, weaker foreign currencies, primarily the British Pound, Chinese Yuan and the Euro relative to the U.S. Dollar, decreased sales $19 million in 2023 relative to 2022. Excluding these effects, sales increased 11% in 2023 compared to 2022.\nGross margin declined slightly in 2023 compared to 2022. Incremental contract charges, primarily in Space and Defense Controls and in Aircraft Controls, offset benefits of pricing initiatives across our three segments.\nResearch and development expenses in 2023 decreased compared to 2022 due to our prioritization of our engineering activities on funded development programs.\nSelling, general and administrative expense as a percentage of sales decreased in 2023 compared to 2022, reflecting the incremental benefit of higher sales volume.\nInterest expense in 2023 compared to 2022 increased due to higher interest rates on our outstanding debt balances and due to higher debt levels.\nIn 2023 and 2022 we incurred charges for various restructuring activities and impairments across all of our segments as we progressed on simplifying our business. In 2023, we incurred $29 million of impairment charges, inventory write-downs and restructuring charges, primarily in Industrial Systems. Additionally in 2023, we benefited from a $10 million gain from the sale of three buildings in Industrial Systems. In 2022 we incurred $31 million from various asset impairments, restructuring expenses and inventory write-down charges across all of our segments. We also incurred $19 million of losses on the sales of businesses in both Space and Defense Controls and in Industrial Systems. These were partially offset by a $16 million gain from the sale of a business in Aircraft Controls and a $9 million gain of the sale of a building in Industrial Systems.\nIn 2023, we settled $41 million of our projected benefit obligation through a lump sum buyout and incurred a $13 million non-cash pension settlement charge.\nOther expense in 2023 increased compared to 2022 due to a $6 million increase in non-service pension expense.\nThe effective tax rates in 2023 and 2022 both include benefits of favorable provision to return adjustments for tax credits associated with the respective prior year's tax returns.\nThe twelve-month backlog at September 30, 2023 increased as compared with the twelve-month backlog at October 1, 2022. Within Aircraft Controls, we had higher orders for both military and commercial OEM programs. The twelve-month backlog also increased in Space and Defense Controls across our defense control programs as well as our space vehicle programs. Partially offsetting these increases was a decline in Industrial Systems' twelve-month backlog due to lower orders across our industrial automation programs.\nSEGMENT RESULTS OF OPERATIONS\nOperating profit, as presented below, is net sales less cost of sales and other operating expenses, excluding interest expense, equity-based compensation expense, non-service pension expense and other corporate expenses. Cost of sales and other operating expenses are directly identifiable to the respective segment or allocated on the basis of sales, manpower or profit. Operating profit is reconciled to earnings before income taxes in Note 22 - Segments, of Item 8, Financial Statements and Supplementary Data, of this report.\nAircraft Controls\n2023 vs. 2022 2022 vs. 2021\n(dollars in millions) 2023 2022 2021\n$ Variance\n% Variance $ Variance % Variance\nNet sales - military aircraft $ 700 $ 745 $ 782 $ (45) (6 %) $ (37) (5 %)\nNet sales - commercial aircraft 689 511 379 178 35 % 132 35 %\n$ 1,389 $ 1,256 $ 1,161 $ 133 11 % $ 95 8 %\nOperating profit $ 145 $ 124 $ 97 $ 21 17 % $ 27 28 %\nOperating margin 10.4 % 9.8 % 8.3 %\nAircraft Controls' net sales increased in 2023 compared to 2022, as the continued commercial aircraft market recovery was partially offset by lower military sales.\nIn 2023, sales increased $120 million across all of our commercial OEM programs. Sales increased $35 million across our widebody programs and increased $22 million across our other Boeing and Airbus commercial aircraft programs. Additionally, higher sales volumes for business jets increased sales $27 million. Also in 2023, sales increased $58 million across all of our commercial aftermarket programs. We benefited from higher amounts of spares and repair volume, primarily for the A350 program, as well as the sale of inventory on mature programs that we decided to exit as part of our simplification efforts.\nPartially offsetting the commercial increases were sales declines across both our military OEM and aftermarket programs. Sales decreased $30 million in our military OEM programs as lower funded development activities reduced sales $38 million. Partially offsetting the decline was a $13 million increase in sales for the program. Also, military aftermarket sales decreased $16 million across our programs due to lower repair volume.\nOperating margin increased in 2023 compared to 2022. Adjustments in 2023 included $5 million of impairment, inventory write-down and restructuring charges. Adjustments in 2022 included $15 million of impairment and $4 million of restructuring expenses, mostly offset by a $16 million gain associated with the divestiture of our NAVAIDS business. Excluding these charges, the adjusted operating margins in 2023 and 2022 were 10.8% and 10.1%, respectively. The resulting 70 basis-point increase in adjusted operating margin is largely due to the benefits of our pricing and simplification initiatives. Partially offsetting the margin increases were additional charges for military funded development programs.\nSpace and Defense Controls\n2023 vs. 2022 2022 vs. 2021\n(dollars in millions)\n2023 2022 2021 $ Variance % Variance $ Variance % Variance\nNet sales\n$ 947 $ 872 $ 799 $ 75 9 % $ 73 9 %\nOperating profit\n$ 96 $ 87 $ 88 $ 9 10 % $ (1) (2 %)\nOperating margin\n10.1 % 10.0 % 11.1 %\nSpace and Defense Controls' net sales increased in 2023 compared to 2022 driven by growing defense demand in both of our markets.\nIn 2023 sales increased $41 million in our space market due to accelerated activity on satellite avionics and components programs. Within our defense market, sales increased $34 million. Sales increased $40 million on our reconfigurable turret program, which achieved full-rate production in the first quarter of 2023. Also, new defense programs increased sales $10 million. Partially offsetting these increases was the absence of sales from our divested security business.\nOperating margin increased slightly in 2023 compared to 2022. In 2023, we incurred $3 million of restructuring and impairment charges. In 2022, we incurred $4 million of restructuring and inventory write-down charges, and incurred a $4 million loss associated with the divestiture of our security business. Excluding these charges, adjusted operating margins were 10.5% and 10.9%, respectively. The resulting decline in adjusted operating margin is due to cost growth on our space vehicle development programs. Mostly offsetting the decline was the incremental margin from higher sales and improved operational performance.\nIndustrial Systems\n2023 vs. 2022 2022 vs. 2021\n(dollars in millions) 2023 2022 2021 $ Variance % Variance $ Variance % Variance\nNet sales $ 983 $ 907 $ 892 $ 76 8 % $ 15 2 %\nOperating profit $ 102 $ 72 $ 86 $ 30 41 % $ (14) (16 %)\nOperating margin 10.4 % 8.0 % 9.6 %\nIndustrial Systems' net sales increased in 2023 compared to 2022, primarily due to general market recoveries. Weaker foreign currencies, primarily the Chinese Yuan and the Euro relative to the U.S. Dollar, decreased sales $14 million. Also, sales decreased $12 million due to the absence of prior year sales associated with our sonar business that we divested in the fourth quarter of 2022. Excluding the impacts of weaker foreign currencies and the divested sales, the resulting sales increase was 12%.\nIn 2023 compared to 2022, sales increased across all of our markets. Sales increased $50 million for our industrial automation programs, driven by higher demand for industrial components and core products, and by new orders for our electrified construction vehicles. Sales also increased $25 million in our simulation and test programs due to higher orders for flight simulation products. Additionally, sales increased $11 million in our energy market excluding the lost sales associated with our divested business.\nOperating margin increased in 2023 compared to 2022. In 2023, we incurred $13 million of impairment losses and $8 million of restructuring and write-down charges as we continued to simplify our business operations. These charges were offset by a $10 million gain related to the sales of three buildings. In 2022, we incurred a $15 million loss associated with the divestiture of our sonar business and incurred $8 million of restructuring, inventory write-downs and asset impairment charges. These were partially offset by a $9 million gain on the sale of a building. Excluding these impacts, adjusted operating margins were 11.5% and 9.5%, respectively. The resulting increase in adjusted operating margin is primarily due to the benefits of our pricing and simplification initiatives.\nSEGMENT OUTLOOK\n2024 vs. 2023\n(dollars in millions)\n2024 2023 $ Variance % Variance\nNet sales:\nMilitary Aircraft $ 735 $ 700 $ 35 5 %\nCommercial Aircraft 785 689 96 14 %\nAircraft Controls\n1,520 1,389 131 9 %\nSpace and Defense Controls\n1,015 947 68 7 %\nIndustrial Systems\n915 983 (68) (7 %)\n$ 3,450 $ 3,319 $ 131 4 %\nOperating profit:\nMilitary Aircraft $ 85 $ 57 $ 28 48 %\nCommercial Aircraft 80 88 (8) (9 %)\nAircraft Controls\n165 145 20 14 %\nSpace and Defense Controls\n137 96 41 43 %\nIndustrial Systems\n113 102 11 11 %\n$ 415 $ 343 $ 72 21 %\nOperating margin:\nMilitary Aircraft 11.6 % 8.2 %\nCommercial Aircraft 10.2 % 12.7 %\nAircraft Controls\n10.9 % 10.4 %\nSpace and Defense Controls\n13.5 % 10.1 %\nIndustrial Systems\n12.3 % 10.4 %\n12.0 % 10.3 %\nNet earnings\n$ 220 $ 171\nDiluted earnings per share\n$ 6.80 $ 5.34\n2024 Outlook - We expect higher sales in 2024, driven by the continued market recovery in our aerospace and defense markets. However, a slowdown of orders will reduce sales in our industrial market. We also expect operating margin will increase due to the continued benefits of our pricing and simplification initiatives. Partially offsetting the incremental profit is an expected higher interest expense and a higher tax rate. We expect diluted earnings per share will range between $6.60 and $7.00, with a midpoint of $6.80.\n2024 Outlook for Military Aircraft Controls - In 2024, we expect sales growth in our OEM programs, in particular sales for the V-280 program. Partially offsetting the increase is an expected sales decline in military aftermarket programs as defense funding shifts from legacy refurbishments to product modernization. We expect operating margin will increase due to having a full year of activity on the V-280 program, and due to lower amounts of charges associated with funded development contracts which are winding down.\n2024 Outlook for Commercial Aircraft Controls - In 2024, we expect sales growth to come from our widebody OEM programs as build rates continue to recover. We expect lower sales in commercial aftermarket as the prior year's specials won't repeat, which will also reduce our operating margin in 2024.\n2024 Outlook for Space and Defense Controls - In 2024, we expect sales growth across both of our space and defense markets, primarily driven by the increased investment in defense spending. We expect operating margin will increase due to the absence of the prior year's charges associated with our space vehicles development programs.\n2024 Outlook for Industrial Systems - In 2024, we expect a decrease in sales due to lower orders in our industrial automation market consistent with macroeconomic indicators for capital spending. We also expect a sales decrease associated with the lost sales associated with our footprint and portfolio initiatives. We expect operating margin will increase due to the benefits of our pricing initiatives and the savings from our simplified operations.\nLIQUIDITY AND CAPITAL RESOURCES\nConsolidated Statement of Cash Flows\n2023 vs. 2022 2022 vs. 2021\n(dollars in millions) 2023 2022 2021 $ Variance % Variance $ Variance % Variance\nNet cash provided (used) by:\nOperating activities $ 136 $ 247 $ 293 $ (111) (45 %) $ (46) (16 %)\nInvesting activities (163) (85) (191) (78) 91 % 106 (55 %)\nFinancing activities (23) (135) (87) 112 (83 %) (48) 55 %\nOperating activities\nNet cash provided by operating activities decreased in 2023 compared to 2022. Accounts receivable used $64 million more of cash, as last year included a $100 million benefit from the Receivables Purchase Agreement program. Also, inventory used $102 million more of cash as all of our segments faced supply chain and labor availability challenges preventing the release of products, especially in the first half of 2023. Partially offsetting the higher use of cash was a $38 million benefit of higher customer advances across our aerospace and defense programs.\nInvesting activities\nNet cash used by investing activities in 2023 included $173 million of capital expenditures, driven by investments in facilities and equipment to accommodate our sales growth, focus our factories and enhance our capabilities through automation. Also, 2023 included $22 million of proceeds from the sales of buildings and businesses.\nNet cash used by investing activities in 2022 included $139 million of capital expenditures, as we increased investments in facilities to support our sales growth. Also, 2022 included $12 million for the acquisition of TEAM Accessories. These cash outflows were partially offset by $71 million of proceeds from the sales of two businesses and a building in 2022.\nFinancing activities\nNet cash used by financing activities in 2023 included $26 million of net borrowings on our credit facilities. Partially offsetting the borrowings was a cash use of $34 million for dividend payments.\nNet cash used by financing activities in 2022 included $68 million of net payments on our credit facilities. Additionally, financing activities in 2022 included $33 million of cash dividends and $33 million of share repurchases.\nGeneral\nCash flows from our operations, together with our various financing arrangements, fund on-going activities, debt service requirements, organic growth, acquisition opportunities and the ability to return capital to shareholders. We believe these sources of funding will be sufficient to meet our cash requirements for the next 12 months and for the foreseeable future thereafter.\nAt September 30, 2023, our cash balances were $69 million, which includes $63 million held outside of the U.S. by foreign operations. We regularly assess our cash needs, including repatriation of foreign earnings which may be subject to regulatory approvals and withholding taxes, where applicable by law.\nFinancing Arrangements\nIn addition to operations, our capital resources include bank credit facilities and an accounts receivable financing program to fund our short and long-term capital requirements. We continuously evaluate various forms of financing to improve our liquidity and position ourselves for future opportunities, which from time to time, may result in selling debt and equity securities to fund acquisitions or take advantage of favorable market conditions.\nWe are generally not required to obtain the consent of lenders of the U.S. revolving credit facility before raising significant additional debt financing; however, certain limitations and conditions may apply that would require consent to be obtained. We have demonstrated our ability to secure consents to access debt markets. We have also been successful in accessing equity markets from time to time. We believe that we will be able to obtain additional debt or equity financing as needed.\nIn the normal course of business, we are exposed to interest rate risk from our long-term debt. To manage these risks, we may enter into derivative instruments such as interest rate swaps which are used to adjust the proportion of total debt that is subject to variable and fixed interest rates.\nOur U.S. revolving credit facility, which matures on October 27, 2027, has a capacity of $1.1 billion and also provides an expansion option, which permits us to request an increase of up to $400 million to the credit facility upon satisfaction of certain conditions. The weighted-average interest rate on the outstanding credit facility borrowings was 6.93% and is based on SOFR plus the applicable margin, which was 1.60% at September 30, 2023.\nThe U.S. revolving credit facility contains various covenants. The minimum for the interest coverage ratio, defined as the ratio of EBITDA to interest expense for the most recent four quarters, is 3.0. The maximum for the leverage ratio, defined as the ratio of net debt to EBITDA for the most recent four quarters, is 4.0. EBITDA is defined in the loan agreement as (i) the sum of net income, interest expense, income taxes, depreciation expense, amortization expense, other non-cash items reducing consolidated net income and non-cash equity-based compensation expenses minus (ii) other non-cash items increasing consolidated net income.\nThe SECT has a revolving credit facility with a borrowing capacity of $35 million, maturing on October 26, 2025. Interest was 7.55% as of September 30, 2023 and is based on SOFR plus a margin of 2.23%.\nWe have $500 million aggregate principal amount of 4.25% senior notes due December 15, 2027 with interest paid semiannually on June 15 and December 15 of each year. The senior notes are unsecured obligations, guaranteed on a senior unsecured basis by certain subsidiaries and contain normal incurrence-based covenants and limitations such as the ability to incur additional indebtedness, pay dividends, make other restricted payments and investments, create liens and certain corporate acts such as mergers and consolidations.\nOur Receivables Purchase Agreement, which matures on November 4, 2024, allows the Receivables Subsidiary to sell receivables to the Purchasers in amounts up to a $100 million limit so long as certain conditions are satisfied. The receivables are sold to the Purchasers in consideration for the Purchasers making payments of cash. Each Purchasers share of capital accrues yield at a variable rate plus an applicable margin, which totaled 6.32% as of September 30, 2023.\nAt September 30, 2023, we had $712 million of unused capacity, including $710 million from the U.S. revolving credit facility after considering standby letters of credit and other limitations.\nWe are in compliance with all covenants under each of our financing arrangements.\nSee Note 10 - Indebtedness, of Item 8, Financial Statements and Supplementary Data, for additional details regarding our financing arrangements.\nDividends and Common Stock\nWe believe we can create long term value for our shareholders by continuing to invest in our business through both capital expenditures as well as investments in new market opportunities. We will also continue exploring opportunities to make strategic acquisitions and return capital to shareholders.\nWe are currently paying quarterly cash dividends on our Class A and Class B common stock and expect to continue to do so for the foreseeable future. See the Consolidated Statement of Shareholders Equity and Cash Flows, of Item 8, Financial Statements and Supplementary Data, for additional details regarding our financing arrangements.\nThe Board of Directors authorized a share repurchase program that permits repurchases for both Class A and Class B common stock, and allows us to buy up to an aggregate 3 million common shares. There are approximately 2.2 million common shares remaining under this authorization. See the Consolidated Statement of Shareholders Equity and Cash Flows, of Part II, Item 8, Financial Information and Part II, Item 5, Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities, of this report for additional details.\nToday, we believe we can create long term value for our shareholders by continuing to invest in our business through both capital expenditures as well as investments in new market opportunities. We will also continue exploring opportunities to make strategic acquisitions and return capital to shareholders.\nOff Balance Sheet Arrangements\nWe do not have any material off balance sheet arrangements that have or are reasonably likely to have a material future effect on our financial condition, results of operations or cash flows.\nContractual Obligations and Commercial Commitments\nFor further information on our contractual obligations and commitments as of September 30, 2023, see the notes referenced below, of Item 8, Financial Statements and Supplementary Data, of this report.\nRight-of-use lease liabilities - See Note 7 - Leases, for details on obligations and timing of expected future payments, including a five-year maturity schedule.\nDebt Obligations and Interest Payments - See Note 10 - Indebtedness, for details of our debt and timing of expected future principal and interest payments. Our current and long-term interest obligation on fixed-rate debt is $21 million and $68 million, respectively. Interest on variable-rate long-term debt, assuming the rate and outstanding balances do not change from those at September 30, 2023, would be approximately $27 million annually.\nEmployee Benefit Plans - See Note 15 - Employee Benefit Plans, for details on our obligations and timing of expected future payments under these plans. In 2024, we have no minimum funding requirements. However, we anticipate making contributions to defined benefit pension plans of $14 million, of which approximately $6 million is for a non-qualified U.S. plan. We are unable to determine minimum funding requirements beyond 2024. We have made no discretionary incremental contributions to our defined benefit plans in excess of minimum funding requirements. We do not plan to make additional contributions for the foreseeable future.\nIncome Taxes - We are unable to determine if and when any unrecognized tax benefits, which are not material, will be settled, nor can we estimate any potential changes to the unrecognized tax benefits. See Note 16 - Income Taxes, for additional details of tax obligations.\nCommitments - See Note 24 - Commitments and Contingencies, for additional details.\nECONOMIC CONDITIONS AND MARKET TRENDS\nWe operate within the aerospace and defense and industrial markets. Our businesses are facing varying levels of supply chain pressures from the residual impacts of the COVID-19 pandemic.\nOur aerospace and defense businesses represented 70% of our 2023 sales. Within the defense market, our programs are directly affected by funding levels, which have recently increased. Our commercial aircraft market, which represented 21% of our 2023 sales, is driven by our customers' growing demand. While domestic travel has recovered, global international travel remains slightly below pre-pandemic levels.\nWithin our industrial markets, which represented 30% of our 2023 sales, our programs benefited from increased order demand within industrial automation, simulation and test and energy markets.\nA common factor throughout our markets is the continuing demand for technologically advanced products.\nAerospace and Defense\nWithin aerospace and defense, we serve three end markets: defense, commercial aircraft and space.\nThe defense market is dependent on military spending for development and production programs. We have a growing development program order book for future generation aircraft and turret programs, and we strive to embed our technologies within these high-performance military programs of the future including the Textron Bell V-280 Valor. Aircraft production programs are typically long-term in nature, offering predictable capacity needs and future revenues. We maintain positions on numerous high priority programs, including the Lockheed Martin Lightning II. The large installed base of our products leads to attractive aftermarket sales and service opportunities. The tactical and strategic missile, missile defense and defense controls markets are dependent on many of the same market conditions as military aircraft, including overall military spending and program funding levels. At times when there are perceived threats to national security, U.S. defense spending can increase; at other times, defense spending can decrease. Future levels of defense spending have increased in the near-term given the current global tensions, and are subject to presidential and congressional approval.\nThe commercial OEM aircraft market has depended on a number of factors, including both the last decade's increasing global demand for air travel and increasing fuel prices. Both factors contributed to the demand for new, more fuel-efficient aircraft with lower operating costs that led to large production backlogs for Boeing and Airbus. Domestic air travel has recovered from the impact of the COVID-19 pandemic, and international travel utilizing primarily widebody aircraft is close to 2019 levels. We believe Boeing and Airbus will continue to directionally match their widebody aircraft production rates with the post-pandemic air traffic volumes, which affects our demand for our flight control systems.\nThe commercial aftermarket is driven by usage and the age of the existing aircraft fleet for passenger and cargo aircraft, which drives the need for maintenance and repairs. We have seen a recovery in the demand volume for our maintenance services and spare parts after the COVID-19 pandemic. During the pandemic, there were very few new A350 and 787 entries into service. These delays have subsequent impacts on our aftermarket revenue, as sales are generated after the warranty period. Therefore, we expect aftermarket sales growth to be modest over the next few years.\nThe space market is comprised of three customer markets: the civil market, the U.S. Department of Defense market and the commercial space market. The civil market, namely NASA, is driven by investment for commercial and exploration activities, including NASA's return to the moon. The U.S. Department of Defense market is driven by governmental-authorized levels of defense spending, including funding for defense-related satellite technologies. Levels of U.S. defense spending could increase as there is growing emphasis on space as the next frontier of potential future conflicts. The commercial space market is comprised of large satellite customers, which traditionally sell to communications companies. Trends for this market, as well as for commercial launch vehicles, follow demand for increased capacity. Our launch vehicle and satellite components and systems, as well as our new space vehicle programs, will continue to develop from increased investments in these markets.\nIndustrial\nWithin industrial, we serve two end markets: industrial and medical.The industrial market consists of industrial automation products, simulation and test products and energy generation and exploration products. The medical market consists of medical devices and medical components products.\nThe industrial market we serve with our industrial automation products is influenced by several factors including capital investment levels, the pace of product innovation, economic conditions, cost-reduction efforts, technology upgrades and the subsequent effects of the COVID-19 pandemic. We experience challenges from changing demands from customers that have both surged and reduced their industrial product orders, as our customers are impacted by rapidly changing international and domestic economic conditions.\nOur simulation and test products operate in markets that were largely affected by the same factors and investment challenges stemming from the COVID-19 pandemic on our commercial aircraft market. However, we have seen stronger order demand for flight simulation systems as the airline training market recovers in line with domestic and foreign flight hours.\nOur energy generation and exploration products operate in a market that is influenced by changing oil and natural gas prices, global urbanization and the resulting change in supply and demand for global energy. Historically, drivers for global growth include investments in power generation infrastructure and exploration of new oil and gas resources.\nThe medical market we serve, in general, is influenced by economic conditions, regulatory environments, hospital and outpatient clinic spending on equipment, population demographics, medical advances, patient demands and the need for precision control components and systems. Advances in medical technology and medical treatments have resulted in the greater need for medical services, which drive the demand for our medical devices and components programs.\nForeign Currencies\nWe are affected by the movement of foreign currencies compared to the U.S. dollar, particularly in Aircraft Controls and Industrial Systems. About one-sixth of our 2023 sales were denominated in foreign currencies. During 2023, average foreign currency rates generally weakened against the U.S. dollar compared to 2022. The translation of the results of our foreign subsidiaries into U.S. dollars decreased sales by $19 million compared to one year ago. During 2022, average foreign currency rates generally weakened against the U.S. dollar compared to 2021. The translation of the results of our foreign subsidiaries into U.S. dollars decreased 2022 sales by $44 million compared to 2021.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee Note 1 - Summary of Significant Accounting Policies, included in Item 8, Financial Statements and Supplementary Data, of this report for further information regarding Financial Accounting Standards Board issued Accounting Standards Updates (\"ASU\"). Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nIn the normal course of business, we are exposed to interest rate risk from our long-term debt and foreign exchange rate risk related to our foreign operations and foreign currency transactions. To manage these risks, we may enter into derivative instruments such as interest rate swaps and foreign currency contracts. We do not hold or issue financial instruments for trading purposes. In 2023, our derivative instruments consisted of foreign currency contracts.\nAt September 30, 2023, we had $368 million of borrowings subject to variable interest rates. At September 30, 2023, we had no outstanding interest rate swaps. During 2023, our average borrowings subject to variable interest rates were $481 million and, therefore, if interest rates had been one percentage point higher during 2023, our interest expense would have been $5 million higher.\nWe also enter into forward contracts to reduce fluctuations in foreign currency cash flows related to third party purchases and revenue, intercompany product shipments and to reduce exposure on intercompany balances that are denominated in foreign currencies. We have foreign currency contracts with notional amounts of $122 million outstanding at September 30, 2023 that mature at various times through March 1, 2024. These include notional amounts of $122 million outstanding where the U.S. dollar is one side of the trade. The net fair value of all of our foreign currency contracts involving the U.S. dollar was a $1 million net liability at September 30, 2023. A hypothetical 10% increase in the value of the U.S. dollar against all currencies would decrease the fair value of our foreign currency contracts at September 30, 2023 by approximately $9 million, while a hypothetical 10% decrease in the value of the U.S. dollar against all currencies would increase the fair value of our foreign currency contracts at September 30, 2023 by approximately $11 million. It is important to note that gains and losses indicated in the sensitivity analysis would often be offset by gains and losses on the underlying receivables and payables.\nAlthough the majority of our sales, expenses and cash flows are transacted in U.S. dollars, we have exposure to changes in foreign currency exchange rates such as the Euro and British pound. If average annual foreign exchange rates collectively weakened or strengthened against the U.S. dollar by 10%, our net earnings in 2023 would have decreased or increased by $8 million from foreign currency translation. This sensitivity analysis assumed that each exchange rate would change in the same direction relative to the U.S. dollar and excludes the potential effects that changes in foreign currency exchange rates may have on actual transactions. Item 8.\nFinancial Statements and Supplementary Data.\nConsolidated Statements of Earnings\nFiscal Years Ended\n(dollars in thousands, except share and per share data) September 30, 2023 October 1, 2022 October 2, 2021\nNet sales $ 3,319,122 $ 3,035,783 $ 2,851,993\nCost of sales 2,423,245 2,211,384 2,076,270\nInventory write-down 4,345 3,598 -\nGross profit 891,532 820,801 775,723\nResearch and development 106,551 109,527 125,528\nSelling, general and administrative 469,836 448,531 412,028\nInterest 63,578 36,757 33,892\nAsset impairment 14,628 18,053 1,500\nRestructuring 7,997 9,509 -\nLoss on sale of businesses 900 3,346 1,536\nGain on sale of buildings (10,030) (9,075) -\nPension settlement 12,542 - -\nOther 9,478 1,174 (2,535)\nEarnings before income taxes 216,052 202,979 203,774\nIncome taxes 45,054 47,802 46,554\nNet earnings $ 170,998 $ 155,177 $ 157,220\nNet earnings per share\nBasic $ 5.37 $ 4.85 $ 4.90\nDiluted $ 5.34 $ 4.83 $ 4.87\nAverage common shares outstanding\nBasic 31,831,687 31,977,482 32,112,589\nDiluted 32,044,226 32,117,028 32,297,956\nSee accompanying Notes to Consolidated Financial Statements.\nConsolidated Statements of Comprehensive Income\nFiscal Years Ended\n(dollars in thousands) September 30,\n2023 October 1,\n2022 October 2,\nNet earnings $ 170,998 $ 155,177 $ 157,220\nOther comprehensive income (loss) (\"OCI\"), net of tax:\nForeign currency translation adjustment 41,538 (89,035) 10,005\nRetirement liability adjustment 11,626 27,979 30,443\nChange in accumulated loss (income) on derivatives 3,269 (2,426) (2,555)\nOther comprehensive income (loss), net of tax 56,433 (63,482) 37,893\nComprehensive income $ 227,431 $ 91,695 $ 195,113\nSee accompanying Notes to Consolidated Financial Statements.\nConsolidated Balance Sheets\n(dollars in thousands, except per share data) September 30, 2023 October 1, 2022\nASSETS\nCurrent assets\nCash and cash equivalents $ 68,959 $ 101,990\nRestricted cash 185 15,338\nReceivables, net 434,723 375,502\nUnbilled receivables 706,601 614,760\nInventories, net 724,002 588,466\nPrepaid expenses and other current assets 50,862 60,349\nTotal current assets 1,985,332 1,756,405\nProperty, plant and equipment, net 814,696 668,908\nOperating lease right-of-use assets 56,067 69,072\nGoodwill 821,301 805,320\nIntangible assets, net 71,637 85,410\nDeferred income taxes 8,749 8,630\nOther assets 50,254 38,096\nTotal assets $ 3,808,036 $ 3,431,841\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities\nCurrent installments of long-term debt $ - $ 916\nAccounts payable 264,573 232,104\nAccrued compensation 111,154 93,141\nContract advances and progress billings 377,977 296,899\nAccrued liabilities and other 211,769 215,376\nTotal current liabilities 965,473 838,436\nLong-term debt, excluding current installments 863,092 836,872\nLong-term pension and retirement obligations 157,455 140,602\nDeferred income taxes 37,626 63,527\nOther long-term liabilities 148,303 115,591\nTotal liabilities 2,171,949 1,995,028\nShareholders equity\nCommon stock - par value $1.00\nClass A - Authorized 100,000,000 shares 43,822 43,807\nIssued 43,822,344 and outstanding 28,739,299 shares at September 30, 2023\nIssued 43,806,835 and outstanding 28,767,243 shares at October 1, 2022\nClass B - Authorized 20,000,000 shares. Convertible to Class A on a one-for-one basis 7,458 7,473\nIssued 7,457,369 and outstanding 3,142,226 shares at September 30, 2023\nIssued 7,472,878 and outstanding 3,014,475 shares at October 1, 2022\nAdditional paid-in capital 608,270 516,123\nRetained earnings 2,496,979 2,360,055\nTreasury shares (1,057,938) (1,047,012)\nStock Employee Compensation Trust (114,769) (73,602)\nSupplemental Retirement Plan Trust (93,126) (58,989)\nAccumulated other comprehensive loss (254,609) (311,042)\nTotal shareholders equity 1,636,087 1,436,813\nTotal liabilities and shareholders equity $ 3,808,036 $ 3,431,841\nSee accompanying Notes to Consolidated Financial Statements.\nConsolidated Statements of Shareholders Equity\nFiscal Years Ended\n(dollars in thousands) September 30, 2023 October 1, 2022 October 2, 2021\nCOMMON STOCK\nBeginning and end of year\n$ 51,280 $ 51,280 $ 51,280\nADDITIONAL PAID-IN CAPITAL\nBeginning of year 516,123 509,622 472,645\nIssuance of treasury shares 7,852 11,570 7,478\nEquity-based compensation expense 8,119 7,460 6,859\nAdjustment to market - SECT and SERP 76,176 (12,529) 22,640\nEnd of year 608,270 516,123 509,622\nRETAINED EARNINGS\nBeginning of year 2,360,055 2,237,848 2,112,734\nNet earnings 170,998 155,177 157,220\nDividends (1)\n(34,074) (32,970) (32,106)\nEnd of year 2,496,979 2,360,055 2,237,848\nTREASURY SHARES AT COST\nBeginning of year (1,047,012) (1,007,506) (990,783)\nClass A and B shares issued related to compensation 16,107 11,326 14,139\nClass A and B shares purchased (27,033) (50,832) (30,862)\nEnd of year (1,057,938) (1,047,012) (1,007,506)\nSTOCK EMPLOYEE COMPENSATION TRUST (\"SECT\")\nBeginning of year (73,602) (79,776) (64,242)\nIssuance of shares 15,713 13,250 679\nPurchase of shares (14,841) (14,830) (4,239)\nAdjustment to market (42,039) 7,754 (11,974)\nEnd of year (114,769) (73,602) (79,776)\nSUPPLEMENTAL RETIREMENT PLAN (\"SERP\") TRUST\nBeginning of year (58,989) (63,764) (53,098)\nAdjustment to market (34,137) 4,775 (10,666)\nEnd of year (93,126) (58,989) (63,764)\nACCUMULATED OTHER COMPREHENSIVE LOSS\nBeginning of year (311,042) (247,560) (285,453)\nOther comprehensive income (loss) 56,433 (63,482) 37,893\nEnd of year (254,609) (311,042) (247,560)\nTOTAL SHAREHOLDERS EQUITY $ 1,636,087 $ 1,436,813 $ 1,400,144\nSee accompanying Notes to Consolidated Financial Statements.\n(1) Cash dividends were $1.07, $1.03 and $1.00 per share for the fiscal years ended September 30, 2023, October 1, 2022, and October 2, 2021, respectively.\nConsolidated Statements of Shareholders Equity, Shares\nFiscal Years Ended\n(share data) September 30, 2023 October 1, 2022 October 2, 2021\nCOMMON STOCK - CLASS A\nBeginning of year\n43,806,835 43,803,236 43,799,229\nConversion of Class B to Class A 15,509 3,599 4,007\nEnd of year\n43,822,344 43,806,835 43,803,236\nCOMMON STOCK - CLASS B\nBeginning of year\n7,472,878 7,476,477 7,480,484\nConversion of Class B to Class A (15,509) (3,599) (4,007)\nEnd of year\n7,457,369 7,472,878 7,476,477\nTREASURY SHARES - CLASS A COMMON STOCK\nBeginning of year\n(14,614,444) (14,157,721) (13,959,998)\nClass A shares issued related to compensation 50,057 45,201 39,227\nClass A shares purchased (93,510) (501,924) (236,950)\nEnd of year\n(14,657,897) (14,614,444) (14,157,721)\nTREASURY SHARES - CLASS B COMMON STOCK\nBeginning of year\n(3,020,291) (3,179,055) (3,344,877)\nClass B shares issued related to compensation 336,451 333,200 346,585\nClass B shares purchased (213,005) (174,436) (180,763)\nEnd of year\n(2,896,845) (3,020,291) (3,179,055)\nSECT - CLASS A COMMON STOCK\nBeginning and end of period\n(425,148) (425,148) (425,148)\nSECT - CLASS B COMMON STOCK\nBeginning of year\n(611,942) (600,880) (557,543)\nIssuance of shares 168,519 165,592 8,683\nPurchase of shares (148,705) (176,654) (52,020)\nEnd of year\n(592,128) (611,942) (600,880)\nSERP - CLASS B COMMON STOCK\nBeginning and end of year\n(826,170) (826,170) (826,170)\nSee accompanying Notes to Consolidated Financial Statements.\nConsolidated Statements of Cash Flows\nFiscal Years Ended\n(dollars in thousands) September 30, 2023 October 1, 2022 October 2, 2021\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet earnings $ 170,998 $ 155,177 $ 157,220\nAdjustments to reconcile net earnings to net cash provided (used) by operating activities:\nDepreciation 78,692 75,238 76,671\nAmortization 11,541 13,151 13,488\nDeferred income taxes (35,531) 11,739 8,162\nEquity-based compensation expense 10,582 8,882 7,461\nLoss on sale of businesses 900 3,346 1,536\nAsset impairment and inventory write-down 18,973 21,651 1,500\nGain on sale of buildings (10,030) (9,075) -\nPension settlement 12,542 - -\nOther 6,244 6,818 (791)\nChanges in assets and liabilities providing (using) cash:\nReceivables (56,575) 7,668 (22,258)\nUnbilled receivables (87,915) (94,535) (51,201)\nInventories (130,378) (28,677) 19,576\nAccounts payable 28,641 43,349 20,520\nContract advances and progress billings 79,983 42,097 59,298\nAccrued expenses (1,692) (4,445) 2,290\nAccrued income taxes 22,869 3,070 4,653\nNet pension and post retirement liabilities 13,940 18,093 12,503\nOther assets and liabilities 2,151 (26,745) (17,402)\nNet cash provided by operating activities 135,935 246,802 293,226\nCASH FLOWS FROM INVESTING ACTIVITIES\nAcquisitions of businesses, net of cash acquired - (11,832) (77,600)\nPurchase of property, plant and equipment (173,286) (139,431) (128,734)\nNet proceeds from businesses sold 1,892 57,315 -\nNet proceeds from buildings sold 19,702 13,297 14,675\nOther investing transactions (11,455) (4,573) 502\nNet cash used by investing activities (163,147) (85,224) (191,157)\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from revolving lines of credit 1,044,101 840,475 799,950\nPayments on revolving lines of credit (1,017,420) (827,801) (838,936)\nProceeds from long-term debt - - 78,700\nPayments on long-term debt (916) (80,364) (68,080)\nPayments on finance lease obligations (4,620) (2,524) (2,156)\nPayment of dividends (34,074) (32,970) (32,106)\nProceeds from sale of treasury stock 19,785 18,414 10,866\nPurchase of outstanding shares for treasury (29,306) (48,558) (31,673)\nProceeds from sale of stock held by SECT 15,713 13,250 679\nPurchase of stock held by SECT (14,251) (14,830) (4,239)\nOther financing transactions (2,027) - -\nNet cash used by financing activities (23,015) (134,908) (86,995)\nEffect of exchange rate changes on cash 2,043 (10,256) 768\nIncrease (decrease) in cash, cash equivalents and restricted cash (48,184) 16,414 15,842\nCash, cash equivalents and restricted cash at beginning of year\n117,328 100,914 85,072\nCash, cash equivalents and restricted cash at end of year\n$ 69,144 $ 117,328 $ 100,914\nConsolidated Statements of Cash Flows, continued\nFiscal Years Ended\nSeptember 30, 2023 October 1, 2022 October 2, 2021\nSUPPLEMENTAL CASH FLOW INFORMATION\nInterest paid $ 63,193 $ 34,765 $ 35,220\nIncome taxes paid, net of refunds 69,253 24,047 44,043\nTreasury shares issued as compensation 4,174 4,482 10,751\nAssets acquired through lease financing 61,805 36,897 14,894\nSee accompanying Notes to Consolidated Financial Statements.\nNotes to Consolidated Financial Statements\n(dollars in thousands, except per share data)\nNote 1 - Summary of Significant Accounting Policies\nConsolidation: The consolidated financial statements include the accounts of Moog Inc. and all of our U.S. and foreign subsidiaries. All intercompany balances and transactions have been eliminated in consolidation.\nFiscal Year: Our fiscal year ends on the Saturday that is closest to September 30. The consolidated financial statements include 52 weeks for the years ended September 30, 2023, October 1, 2022 and October 2, 2021.\nOperating Cycle: Consistent with industry practice, aerospace and defense related inventories, unbilled recoverable costs and profits on over-time contract receivables, customer advances, warranties and contract reserves include amounts relating to contracts having long production and procurement cycles, portions of which are not expected to be realized or settled within one year.\nForeign Currency Translation: Assets and liabilities of subsidiaries that prepare financial statements in currencies other than the U.S. dollar are translated using rates of exchange as of the balance sheet date and the statements of earnings are translated at the average rates of exchange for each reporting period.\nUse of Estimates: The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates and assumptions.\nRevenue Recognition: We recognize revenue from contracts with customers using an over-time, cost-to-cost method of accounting or at the point in time that control transfers to the customer. For additional discussion on revenue recognition, see Note 2 - Revenue from Contracts with Customers.\nShipping and Handling Costs: Shipping and handling costs are included in cost of sales.\nResearch and Development: Research and development costs are expensed as incurred and include salaries, benefits, consulting, material costs depreciation and amortization.\nBid and Proposal Costs: Bid and proposal costs are expensed as incurred and classified as selling, general and administrative expenses.\nEquity-Based Compensation: Our equity-based compensation plans allow for various types of equity-based incentive awards. The types and mix of these incentive awards are evaluated on an on-going basis and may vary based on our overall strategy regarding compensation. Equity-based compensation expense is based on awards that are ultimately expected to vest over the requisite service periods and are based on the fair value of the award measured on the grant date. Vesting requirements vary for directors, officers and key employees. In general, awards granted to officers and key employees principally vest over three years, in equal annual installments for time-based awards and in three years cliff vest for performance-based awards. We have elected to account for forfeitures when the forfeiture of the underlying awards occur. Equity-based compensation expense is included in selling, general and administrative expenses.\nCash and Cash Equivalents: All highly liquid investments with an original maturity of three months or less are considered cash equivalents.\nRestricted Cash: Restricted cash principally represents funds held for capital expenditures and to satisfy supplemental retirement obligations.\nAllowance for Credit Losses: The allowance for credit losses is based on our assessment of the collectibility of customer accounts. The allowance is determined by considering factors such as historical experience, credit quality, age of the accounts receivable, current economic conditions and reasonable forecasted financial information that may affect a customers ability to pay.\nInventories: Inventories are stated at the lower of cost or net realizable value with cost determined primarily on the first-in, first-out (FIFO) method of valuation.\nProperty, Plant and Equipment: Property, plant and equipment are stated at cost. Plant and equipment are depreciated principally using the straight-line method over the estimated useful lives of the assets, generally ranging from 15 to 40 years for buildings and improvements, 5 to 15 years for machinery and equipment and 3 to 10 years for computer equipment and software. Leasehold improvements are amortized on a straight-line basis over the term of the lease or the estimated useful life of the asset, whichever is shorter.\nGoodwill: We test goodwill for impairment at the reporting unit level on an annual basis or more frequently if an event occurs or circumstances change that indicate that the fair value of a reporting unit is likely to be below its carrying amount. We also test goodwill for impairment when there is a change in reporting units.\nWe may elect to perform a qualitative assessment that considers economic, industry and company-specific factors for all or selected reporting units. If, after completing this assessment, it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, we proceed to a quantitative test. We may also elect to perform a quantitative test instead of a qualitative assessment for any or all of our reporting units. We performed a qualitative test for all reporting units in 2023 and 2021.\nQuantitative testing requires a comparison of the fair value of each reporting unit to its carrying value. We typically use the discounted cash flow method to estimate the fair value of our reporting units. The discounted cash flow method incorporates various assumptions, the most significant being projected revenue growth rates, operating margins and cash flows, the terminal growth rate and the weighted-average cost of capital. If the carrying value of the reporting unit exceeds its fair value, goodwill is considered impaired and any loss must be measured. To determine the amount of the impairment loss, the implied fair value of goodwill is determined by assigning a fair value to all of the reporting unit's assets and liabilities, including any unrecognized intangible assets, as if the reporting unit had been acquired in a business combination at fair value. If the carrying amount of the reporting unit goodwill exceeds the implied fair value of that goodwill, an impairment loss would be recognized in an amount equal to that excess. We performed a quantitative test for all reporting units in 2022.\nThere were no goodwill impairment charges recorded in 2023, 2022 or 2021.\nAcquired Intangible Assets: Acquired identifiable intangible assets are recorded at cost and are amortized over their estimated useful lives.\nImpairment of Long-Lived Assets: Long-lived assets, including acquired identifiable intangible assets, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of those assets may not be recoverable. We use undiscounted cash flows to determine whether impairment exists and measure any impairment loss using discounted cash flows.\nIn 2023, we recorded an impairment charge on long-lived assets, as well as an inventory write-down in our Aircraft Controls segment. These charges relate to equipment and inventory that experienced a decline in value due to the U.S. Air Force announcement to retire the KC-10 aerial refueling tanker and retirement of a trade name intangible. We also recorded impairment charges on receivables in our Space and Defense Controls segment associated with an expected cancellation of a contract. In addition, we recorded impairment charges on long-lived assets, as well as an inventory write-down in our Industrial Systems segment as we continue to review and simplify our business operations.\nIn 2022, we recorded impairment charges on long-lived assets in our Aircraft Controls and Industrial Systems segment. These charges relate to property, plant and equipment that experienced a significant decline in value due to the slower than expected recovery of our commercial aircraft business. In addition, we recorded impairment charges on intangible assets associated with a product line we are no longer pursuing. These charges are included in asset impairment in the Consolidated Statements of Earnings.\nIn 2021, we recorded impairment charges on long-lived assets in our Space and Defense Controls segment. These charges relate to property, plant and equipment and intangibles assets that experienced a decline in value. These charges are included in asset impairment in the Consolidated Statements of Earnings.\nSee Note 4 - Receivables, Note 5 - Inventories, Note 6 - Property, Plant and Equipment, Note 7 - Leases, Note 8 - Goodwill and Intangible Assets and Note 13 - Fair Value for additional disclosures relating to impairment charges recorded.\nProduct Warranties: In the ordinary course of business, we warrant our products against defect in design, materials and workmanship typically over periods ranging from twelve to sixty months. We determine warranty reserves needed by product line based on historical experience and current facts and circumstances.\nFinancial Instruments: Our financial instruments consist primarily of cash and cash equivalents, restricted cash, receivables, notes payable, accounts payable, long-term debt, interest rate swaps and foreign currency contracts. The carrying values for our financial instruments approximate fair value with the exception at times of long-term debt. We do not hold or issue financial instruments for trading purposes.\nWe carry derivative instruments on the Consolidated Balance Sheets at fair value, determined by reference to quoted market prices. The accounting for changes in the fair value of a derivative instrument depends on whether it has been designated and qualifies as part of a hedging relationship and, if so, the reason for holding it. Our use of derivative instruments is generally limited to cash flow hedges of certain interest rate risks and minimizing foreign currency exposure on foreign currency transactions, which are typically designated in hedging relationships, and intercompany balances, which are not designated as hedging instruments. Cash flows resulting from forward contracts are accounted for as hedges of identifiable transactions or events and classified in the same category as the cash flows from the items being hedged.\nReclassifications: Certain prior year amounts have been reclassified to conform to current year's presentation, which management does not consider to be material.\nRecent Accounting Pronouncements:\nRecent Accounting Pronouncements Adopted\nThere have been no accounting pronouncements adopted for the year ended September 30, 2023.\nRecent Accounting Pronouncements Not Yet Adopted\nWe consider the applicability and impact of all Accounting Standard Updates (\"ASU\"). ASUs not listed were assessed and determined to be either not applicable, or had or are expected to have an immaterial impact on our financial statements and related disclosures.\nNote 2 - Revenue from Contracts with Customers\nWe recognize revenue from contracts with customers using the five-step model prescribed in ASC 606. The first step is identifying the contract. The identification of a contract with a customer requires an assessment of each partys rights and obligations regarding the products or services to be transferred, including an evaluation of termination clauses and presently enforceable rights and obligations. Each partys rights and obligations and the associated terms and conditions are typically determined in purchase orders. For sales that are governed by master supply agreements under which provisions define specific program requirements, purchase orders are issued under these agreements to reflect presently enforceable rights and obligations for the units of products and services being purchased.\nContracts are sometimes modified to account for changes in contract specifications and requirements. When this occurs, we assess the modification as prescribed in ASC 606 and determine whether the existing contract needs to be modified (and revenue cumulatively caught up), whether the existing contract needs to be terminated and a new contract needs to be created, or whether the existing contract remains and a new contract needs to be created. This is determined based on the rights and obligations within the modification as well as the associated transaction price.\nThe next step is identifying the performance obligations. A performance obligation is a promise to transfer goods or services to a customer that is distinct in the context of the contract, as defined by ASC 606. We identify a performance obligation for each promise in a contract to transfer a distinct good or service to the customer. As part of our assessment, we consider all goods and/or services promised in the contract, regardless of whether they are explicitly stated or implied by customary business practices. The products and services in our contracts are typically not distinct from one another due to their complexity and reliance on each other or, in many cases, we provide a significant integration service. Accordingly, many of our contracts are accounted for as one performance obligation. In limited cases, our contracts have more than one distinct performance obligation, which occurs when we perform activities that are not highly complex or interrelated or involve different product life cycles. Warranties are provided on certain contracts, but do not typically provide for services beyond standard assurances and are therefore not distinct performance obligations under ASC 606.\nThe third step is determining the transaction price, which represents the amount of consideration we expect to be entitled to receive from a customer in exchange for providing the goods or services. There are times when this consideration is variable, for example a volume discount, and must be estimated. Sales, use, value-added, and excise taxes are excluded from the transaction price, where applicable.\nThe fourth step is allocating the transaction price. The transaction price must be allocated to the performance obligations identified in the contract based on relative stand-alone selling prices when available, or an estimate for each distinct good or service in the contract when standalone prices are not available. Our contracts with customers generally require payment under normal commercial terms after delivery. Payment terms are typically within 30 to 60 days of delivery. The timing of satisfaction of our performance obligations does not significantly vary from the typical timing of payment.\nThe final step is the recognition of revenue. We recognize revenue as the performance obligations are satisfied. ASC 606 provides guidance to help determine if we are satisfying the performance obligation at a point in time or over time. In determining when performance obligations are satisfied, we consider factors such as contract terms, payment terms and whether there is an alternative use of the product or service. In essence, we recognize revenue when, or as control of, the promised goods or services transfer to the customer.\nRevenue is recognized using either the over time or point in time method. The over-time method of revenue recognition is predominantly used in Aircraft Controls and Space and Defense Controls. We use this method for U.S. Government contracts and repair and overhaul arrangements as we are creating or enhancing assets that the customer controls as the assets are being created or enhanced. In addition, many of our large commercial contracts qualify for over-time accounting as our performance does not create an asset with an alternative use and we have an enforceable right to payment for performance completed to date. Our over-time contracts are primarily firm fixed price.\nRevenue recognized at the point in time control is transferred to the customer is used most frequently in Industrial Systems. We use this method for commercial contracts in which the asset being created has an alternative use. We determine the point in time control transfers to the customer by weighing the five indicators provided by ASC 606 - the entity has a present right to payment; the customer has legal title; the customer has physical possession; the customer has significant risks and rewards of ownership; and the customer has accepted the asset. When control has transferred to the customer, profit is generated as cost of sales is recorded and as revenue is recognized. Inventory costs include all product manufacturing costs such as direct material, direct labor, other direct costs and indirect overhead cost allocations. Shipping and handling costs are considered costs to fulfill a contract and not considered performance obligations. They are included in cost of sales as incurred.\nRevenue is recognized over time on contracts using the cost-to-cost method of accounting as work progresses toward completion as determined by the ratio of cumulative costs incurred to date to estimated total contract costs at completion, multiplied by the total estimated contract revenue, less cumulative revenue recognized in prior periods. We believe that cumulative costs incurred to date as a percentage of estimated total contract costs at completion is an appropriate measure of progress toward satisfaction of performance obligations as this measure most accurately depicts the progress of our work and transfer of control to our customers. Changes in estimates affecting sales, costs and profits are recognized in the period in which the change becomes known using the cumulative catch-up method of accounting, resulting in the cumulative effect of changes reflected in the period. Estimates are reviewed and updated quarterly for substantially all contracts. In 2023, we recognized lower revenues of $3,095 for adjustments made to performance obligations satisfied (or partially satisfied) in previous periods. In 2022, we recognized lower revenues of $3,518 for adjustments made to performance obligations satisfied (or partially satisfied) in previous periods. In 2021, we recognized revenues of $11,167 for adjustments made to performance obligations satisfied (or partially satisfied) in previous periods.\nContract costs include only allocable, allowable and reasonable costs which are included in cost of sales when incurred. For applicable U.S. Government contracts, contract costs are determined in accordance with the Federal Acquisition Regulations and the related Cost Accounting Standards. The nature of these costs includes development engineering costs and product manufacturing costs such as direct material, direct labor, other direct costs and indirect overhead costs. Contract profit is recorded as a result of the revenue recognized less costs incurred in any reporting period. Variable consideration and contract modifications, such as performance incentives, penalties, contract claims or change orders are considered in estimating revenues, costs and profits when they can be reliably estimated and realization is considered probable. As of September 30, 2023, revenue recognized on contracts for unresolved claims or unapproved contract change orders was not material.\nAs of September 30, 2023, we had contract reserves of $45,257. For contracts with anticipated losses at completion, a provision for the entire amount of the estimated remaining loss is charged against income in the period in which the loss becomes known. Contract losses are determined considering all direct and indirect contract costs, exclusive of any selling, general or administrative cost allocations that are treated as period expenses. Loss reserves are more common on firm fixed-price contracts that involve, to varying degrees, the design and development of new and unique controls or control systems to meet the customers specifications. In accordance with ASC 606, we calculate contract losses at the contract level, versus the performance obligation level. Recall reserves are recorded when additional work is needed on completed products for them to meet contract specifications. Contract-related loss reserves are recorded for the additional work needed on completed and delivered products in order for them to meet contract specifications.\nContract Assets and Liabilities\nUnbilled receivables (contract assets) primarily represent revenues recognized for performance obligations that have been satisfied but for which amounts have not been billed. Unbilled receivables are classified as current assets and in accordance with industry practice, include amounts that may be billed and collected beyond one year due to the long term nature of our contracts.\nContract advances and progress billings (contract liabilities) relate to payments received from customers in advance of the satisfaction of performance obligations for a contract (contract advances) and when billings are in excess of revenue recognized (progress billings). These amounts are recorded as contract liabilities until such obligations are satisfied, either over-time as costs are incurred or at a point when deliveries are made. We do not consider contract advances and progress billings to be significant financing components as the intent of these payments in advance are for reasons other than providing a significant financing benefit and are customary in our industry.\nFor contracts recognized using the cost-to-cost method, the amount of unbilled receivables or contract advances and progress billings is determined for each contract to determine the contract asset or contract liability position at the end of each reporting period.\nUnbilled recoverable costs and accrued profits for over-time contracts to be billed to the U.S. Government were $79,388 at September 30, 2023 and $38,020 at October 1, 2022. Unbilled recoverable costs and accrued profits principally represent revenues recognized on contracts that were not billable on the balance sheet date. These amounts will be billed in accordance with contract terms, generally as certain milestones are reached or upon shipment. Unbilled amounts expected to be collected beyond one year are not material.\nTotal contract assets and contract liabilities are as follows:\nSeptember 30,\n2023 October 1,\nUnbilled receivables $ 706,601 $ 614,760\nContract advances and progress billings 377,977 296,899\nNet contract assets $ 328,624 $ 317,861\nThe increase in contract assets reflects the net impact of additional unbilled revenues recorded in excess of revenue recognized during the period. The increase in contract liabilities reflects the net impact of additional deferred revenues recorded in excess of revenue recognized during the period. As of September 30, 2023, we recognized $263,933 of revenue that was included in the contract liability balance at the beginning of the period.\nRemaining Performance Obligations\nAs of September 30, 2023, the aggregate amount of the transaction price allocated to the performance obligations that are unsatisfied (or partially unsatisfied) was $5,100,000. We expect to recognize approximately 47% of that amount as sales over the next twelve months and the balance thereafter.\nDisaggregation of Revenue\nSee Note 22 - Segments, for disclosures related to disaggregation of revenue.\nNote 3 - Acquisitions and Divestitures\nAcquisitions\nOn February 21, 2022, we acquired TEAM Accessories Limited (\"TEAM\") based in Dublin, Ireland for a purchase price, net of acquired cash, of $14,394, consisting of $11,832 in cash and contingent consideration with an initial fair value of $2,562. TEAM specializes in Maintenance, Repair and Overhaul of engine and airframe components. This operation is included in our Aircraft Controls segment. TEAM has been rebranded as Moog MRO Services as of July 1, 2023.\nDivestitures\nOn September 30, 2022, we sold a sonar business based in the United Kingdom previously included in our Industrial Systems segment. We have cumulatively received net proceeds of $13,075 and recorded a loss of $15,246, net of transaction costs. The transaction is subject to adjustments associated with amounts currently held in escrow.\nOn September 20, 2022, we sold assets of a security business based in Northbrook, Illinois previously included in our Space and Defense Controls segment. We received net proceeds of $10,041 and recorded a loss of $4,428, net of transaction costs.\nOn December 3, 2021, we sold the assets of our Navigation Aids (\"NAVAIDS\") business based in Salt Lake City, Utah previously included in our Aircraft Controls segment to Thales USA Inc. We have cumulatively received net proceeds of $36,550 and recorded a gain of $15,242, net of transaction costs. The initial gain recorded was reduced in 2023 by the recording of a reserve against the escrow receivable, which remains subject to adjustment until settlement.\nNote 4 - Receivables\nReceivables consist of:\nSeptember 30,\n2023 October 1,\nAccounts receivable $ 426,804 $ 363,137\nOther 11,929 16,973\nLess allowance for credit losses (4,010) (4,608)\nReceivables, net $ 434,723 $ 375,502\nIn 2023, we recorded impairment charges of $219 associated with an unexpected cancellation of a contract. In 2022, we recorded impairment charges of $642 associated with Russian activities in Ukraine.\nMoog Receivables LLC (the \"Receivables Subsidiary\"), a wholly owned bankruptcy remote special purpose subsidiary of Moog Inc. (the \"Company\"), as seller, the Company, as master servicer, Wells Fargo Bank, N.A., as administrative agent (the \"Agent\") and certain purchasers (collectively, the \"Purchasers\") entered into an Amended and Restated Receivables Purchase Agreement (the \"RPA\"). The RPA matures on November 4, 2024 and is subject to customary termination events related to transactions of this type.\nUnder the RPA, the Receivables Subsidiary may sell receivables to the Purchasers in amounts up to a $100,000 limit. The receivables will be sold to the Purchasers in consideration for the Purchasers making payments of cash, which is referred to as \"capital\" for purposes of the RPA, to the Receivables Subsidiary in accordance with the terms of the RPA. The Receivables Subsidiary may sell receivables to the Purchasers so long as certain conditions are satisfied, including that, at any date of determination, the aggregate capital paid to the Receivables Subsidiary does not exceed a \"capital coverage amount\", equal to an adjusted net receivables pool balance minus a required reserve. Each Purchaser's share of capital accrues yield at a variable rate plus an applicable margin.\nThe parties intend that the conveyance of receivables to the Agent, for the ratable benefit of the Purchasers will constitute a purchase and sale of receivables and not a pledge for security. The Receivables Subsidiary has guaranteed to each Purchaser and Agent the prompt payment of sold receivables, and to secure the prompt payment and performance of such guaranteed obligations, the Receivables Subsidiary has granted a security interest to the Agent, for the benefit of the Purchasers, in all assets of the Receivables Subsidiary. The assets of the Receivables Subsidiary are not available to pay our creditors or any affiliate thereof. In our capacity as master servicer under the RPA, we are responsible for administering and collecting receivables and have made customary representations, warranties, covenants and indemnities. We also provided a performance guarantee for the benefit of the Purchaser.\nThe proceeds of the RPA are classified as operating activities in our Consolidated Statement of Cash Flows and were used to pay off the outstanding balance of the Securitization Program. Cash received from collections of sold receivables is used by the Receivables Subsidiary to fund additional purchases of receivables on a revolving basis or to return all or any portion of outstanding capital of the Purchaser. Subsequent collections on the pledged receivables, which have not been sold, will be classified as operating cash flows at the time of collection. Total receivables sold and cash collections under the RPA were $474,402 for the year ended September 30, 2023. The fair value of the sold receivables approximated book value due to their credit quality and short-term nature, and as a result, no gain or loss on sale of receivables was recorded.\nThe amount sold to the Purchasers was $100,000 at September 30, 2023, which was derecognized from the Consolidated Balance Sheets. As collateral against sold receivables, the Receivables Subsidiary maintains a certain level of unsold receivables, which was $789,568 at September 30, 2023.\nOver-time contract receivables are primarily associated with prime contractors and subcontractors in connection with U.S. Government contracts, as well as commercial aircraft and satellite manufacturers. Amounts billed for over-time contracts to the U.S. Government were $13,350 at September 30, 2023 and $18,750 at October 1, 2022.\nThere are no material amounts of claims or unapproved change orders included in the Consolidated Balance Sheets. There are no material balances billed but not paid by customers under retainage provisions.\nConcentrations of credit risk on receivables are limited to those from significant customers who are believed to be financially sound. Receivables from Boeing were $227,107 at September 30, 2023 and $235,405 at October 1, 2022 and receivables from Lockheed Martin were $120,014 at September 30, 2023 and $99,707 at October 1, 2022. We perform periodic credit evaluations of our customers financial condition and generally do not require collateral.\nNote 5 - Inventories\nInventories, net of reserves, consist of:\nSeptember 30,\n2023 October 1,\nRaw materials and purchased parts $ 270,305 $ 219,893\nWork in progress 368,277 305,328\nFinished goods 85,420 63,245\nInventories, net $ 724,002 $ 588,466\nThere are no material inventoried costs relating to over-time contracts where revenue is accounted for using the cost-to-cost method of accounting as of September 30, 2023 and October 1, 2022.\nIn 2023, we recorded $4,345 of inventory write-downs associated with a decline in business in our Industrial Systems segment and the retirement of a program in our Aircraft Controls segment. In 2022, we recorded impairment charges on inventory of $1,907 associated with Russian actions in the Ukraine. See Note 14 - Restructuring for additional disclosures relating to inventory write-downs.\nNote 6 - Property, Plant and Equipment\nProperty, plant and equipment consists of:\nSeptember 30,\n2023 October 1,\nLand $ 31,417 $ 32,164\nBuildings and improvements 646,079 519,867\nMachinery and equipment 827,257 768,745\nComputer equipment and software 228,284 201,960\nProperty, plant and equipment, at cost 1,733,037 1,522,736\nLess accumulated depreciation and amortization (918,341) (853,828)\nProperty, plant and equipment, net $ 814,696 $ 668,908\nIn 2023, we recorded $5,301 of impairment charges on property and equipment on owned assets that experienced a decline in value, based on expected cash flows over the remaining life of the assets in relation to a decline in the related business in our Industrial Systems segment and from the retirement of a program in our Aircraft Controls segment. In 2022, we recorded $15,048 of impairment charges for owned assets, based on expected cash flows over the remaining life of the assets associated with a slower than expected recovery of our commercial aircraft business. In 2021, we recorded $356 of impairment charges for owned assets, based on expected cash flows over the remaining life of the assets in relation to a decline in the related business.\nNote 7 - Leases\nWe lease certain manufacturing facilities, office space and machinery and equipment globally. At inception we evaluate whether a contractual arrangement contains a lease. Specifically, we consider whether we control the underlying asset and have the right to obtain substantially all the economic benefits or outputs from the asset. If the contractual arrangement contains a lease, we then determine the classification of the lease, operating or finance, using the classification criteria described in ASC 842. We then determine the term of the lease based on terms and conditions of the contractual arrangement, including whether the options to extend or terminate the lease are reasonably certain to be exercised. We have elected to not separate lease components from non-lease components, such as common area maintenance charges and instead, account for the lease and non-lease components as a single component.\nOur lease right-of-use (\"ROU\") assets represent our right to use an underlying asset for the lease term and our lease liabilities represent our obligation to make lease payments. Operating lease ROU assets are included in Operating lease right-of-use assets and operating lease liabilities are included in Accrued liabilities and other and Other long-term liabilities on the Consolidated Balance Sheets. Finance lease ROU assets are included in Property, plant and equipment and finance lease liabilities are included in Accrued liabilities and other and Other long-term liabilities on the Consolidated Balance Sheets. Operating lease cost is included in Cost of sales and Selling, general and administrative on the Consolidated Statements of Earnings. Finance lease cost is included in Cost of sales, Selling, general and administrative and Interest on the Consolidated Statements of Earnings.\nThe ROU assets and lease liabilities for both operating and finance leases are recognized as of the commencement date at the net present value of the fixed minimum lease payments over the term of the lease, using the discount rate described below. Variable lease payments are recorded in the period in which the obligation for the payment is incurred. Variable lease payments based on an index or rate are initially measured using the index or rate as of the commencement date of the lease and included in the fixed minimum lease payments. For short-term leases that have a term of 12 months or less as of the commencement date, we do not recognize a ROU asset or lease liability on our balance sheet; we recognize expense as the lease payments are made over the lease term.\nThe discount rate used to calculate the present value of our leases is the rate implicit in the lease. If the information necessary to determine the rate implicit in the lease is not available, we use our incremental borrowing rate for collateralized debt, which is determined using our credit rating and other information available as of the lease commencement date.\nThe components of lease expense were as follows:\n2023 2022 2021\nOperating lease cost $ 30,031 $ 28,670 $ 30,353\nFinance lease cost:\nAmortization of right-of-use assets $ 5,310 $ 2,884 $ 2,282\nInterest on lease liabilities 2,964 1,057 736\nTotal finance lease cost $ 8,274 $ 3,941 $ 3,018\nSupplemental cash flow information related to leases was as follows:\n2023 2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flow for operating leases $ 30,281 $ 28,914 $ 29,926\nOperating cash flow for finance leases 2,964 1,057 736\nFinancing cash flow for finance leases 4,620 2,524 2,156\nAssets obtained in exchange for lease obligations:\nOperating leases 6,014 24,659 9,426\nFinance leases 55,791 12,238 5,558\nSupplemental balance sheet information related to leases was as follows:\nSeptember 30, 2023 October 1, 2022\nOperating Leases:\nOperating lease right-of-use assets $ 56,067 $ 69,072\nAccrued liabilities and other $ 11,283 $ 13,002\nOther long-term liabilities 56,398 66,167\nTotal operating lease liabilities $ 67,681 $ 79,169\nFinance Leases:\nProperty, plant, and equipment, at cost $ 85,324 $ 30,614\nAccumulated depreciation (10,913) (5,606)\nProperty, plant, and equipment, net $ 74,411 $ 25,008\nAccrued liabilities and other $ 5,621 $ 3,244\nOther long-term liabilities 71,225 23,529\nTotal finance lease liabilities $ 76,846 $ 26,773\nWeighted average remaining lease term in years:\nOperating leases 6.9 7.7\nFinance leases 23.1 16.7\nWeighted average discount rates:\nOperating leases 5.0 % 5.0 %\nFinance leases 6.5 % 4.8 %\nMaturities of lease liabilities were as follows:\nSeptember 30, 2023\nOperating Leases Finance Leases\n2024 $ 14,213 $ 9,809\n2025 12,336 9,630\n2026 11,595 9,353\n2027 10,303 8,603\n2028 8,190 7,602\nThereafter 23,791 133,642\nTotal lease payments 80,428 178,639\nLess: imputed interest (12,747) (101,793)\nTotal $ 67,681 $ 76,846\nThe operating lease ROU and finance lease disclosures above reflect write downs of $2,086 for the year ended September 30, 2023 as a result of simplifying our business operations and $4,808 for the year ended October 2, 2021, based on expected cash flows over the remaining life of the assets in relation to impairment charges associated with the COVID-19 pandemic.\nOn September 30, 2022, we sold a building located in Murray, Utah and concurrently entered into a lease agreement for the building with an initial term of two years, which also includes the option to extend the terms of the lease for up to two consecutive terms of six months each. The transaction resulted in a net gain of $9,075 which is included in the Consolidated Statements of Earnings.\nNote 8 - Goodwill and Intangible Assets\nThe changes in the carrying amount of goodwill are as follows:\nAircraft\nControls Space and\nDefense\nControls Industrial\nSystems Total\nBalance at October 3, 2020 $ 179,521 $ 261,726 $ 380,609 $ 821,856\nAcquisition 29,123 - - 29,123\nDivestiture (312) - (3,092) (3,404)\nForeign currency translation 2,447 41 1,542 4,030\nBalance at October 2, 2021 210,779 261,767 379,059 851,605\nAcquisition 5,344 - - 5,344\nDivestitures (6,961) (2,205) (4,137) (13,303)\nForeign currency translation (9,643) (155) (28,528) (38,326)\nBalance at October 1, 2022 199,519 259,407 346,394 805,320\nAdjustments to prior year acquisitions 122 - - 122\nForeign currency translation 4,247 68 11,544 15,859\nBalance at September 30, 2023 $ 203,888 $ 259,475 $ 357,938 $ 821,301\nGoodwill in our Space and Defense Controls segment is net of a $4,800 accumulated impairment loss at September 30, 2023. Goodwill in our Medical Devices reporting unit, included in our Industrial Systems segment, is net of a $38,200 accumulated impairment loss at September 30, 2023.\nThe components of intangible assets are as follows:\nSeptember 30, 2023 October 1, 2022\nWeighted-\nAverage\nLife (years) Gross Carrying\nAmount Accumulated\nAmortization Gross Carrying\nAmount\nAccumulated\nAmortization\nCustomer-related 11 $ 133,269 $ (93,648) $ 135,899 $ (88,179)\nTechnology-related 9 69,242 (56,106) 69,856 (52,951)\nProgram-related 23 37,465 (21,672) 35,305 (18,817)\nMarketing-related 8 21,890 (18,995) 21,925 (17,833)\nOther 10 1,773 (1,581) 1,693 (1,488)\nIntangible assets 12 $ 263,639 $ (192,002) $ 264,678 $ (179,268)\nAll acquired intangible assets other than goodwill are being amortized. Customer-related intangible assets primarily consist of customer relationships. Technology-related intangible assets primarily consist of technology, patents, intellectual property and software. Program-related intangible assets consist of long-term programs represented by current contracts and probable follow on work. Marketing-related intangible assets primarily consist of trademarks, trade names and non-compete agreements.\nIn 2023, we recorded $4,409 in impairment charges on long-lived assets in our Aircraft Controls and Industrial Systems segments. These charges relate to a decline in value with the associated business and the retirement of a trade name intangible. In 2022, we recorded $2,125 in impairment charges on long-lived assets in our Industrial Systems segment. These charges relate to intangibles assets associated with a product line we are no longer pursuing. In 2021, we recorded $1,144 in impairment charges on long-lived assets in our Space and Defense Controls segment, relating to intangibles assets that experienced a decline in value.\nAmortization of acquired intangible assets is as follows:\n2023 2022 2021\nAcquired intangible asset amortization $ 11,514 $ 13,106 $ 13,454\nBased on acquired intangible assets recorded at September 30, 2023, amortization is estimated to be approximately:\n2024 2025 2026 2027 2028\nEstimated future amortization of acquired intangible assets $ 10,400 $ 9,300 $ 9,100 $ 7,800 $ 7,000\nNote 9 - Equity Method Investments and Joint Ventures\nInvestments and operating results in which we do not have a controlling interest, however we do have the ability to exercise significant influence over operations are accounted for using the equity method of accounting. Net investment balances for equity method investments and joint ventures are included as Other assets in the Consolidated Balance Sheets and consist of:\nSeptember 30, 2023 October 1, 2022\nMoog Aircraft Service Asia $ 1,302 $ 843\nNOVI LLC 325 609\nSuffolk Technologies Fund 1, L.P. 1,180 928\nNet investment balance $ 2,807 $ 2,380\nLosses from equity method investments and joint ventures were $62, $724 and $1,746 for the years ended September 30, 2023, October 1, 2022 and October 2, 2021, respectively and are included in Other in the Consolidated Statements of Earnings.\nMoog Aircraft Services Asia (\"MASA\") is a joint venture included in our Aircraft Controls segment in which we currently hold a 51% ownership share. MASA is intended to provide maintenance, repair and overhaul services for our manufactured flight control systems.\nWe hold a 20% ownership interest in NOVI LLC (\"NOVI\") that is included in our Space and Defense Controls segment. NOVI specializes in applying machine learning algorithms to space situational awareness.\nSuffolk Technologies Fund 1, L.P., is a limited partnership included in our Industrial Systems segment that invests in startups to transform the construction, real estate and property maintenance industries in the U.S. We have a remaining on-call capital commitment of up to $6,476.\nHybrid Motion Solutions (HMS) is a joint venture in our Industrial Systems segment in which we hold a 50% ownership interest. HMS specializes in hydrostatic servo drives and leverages synergies to enter new markets. The joint venture focuses on research and development, design and assembly as well as service. Our share of cumulative losses to date has exceeded our initial investment, and as such, we had no net investment balance recorded as of September 30, 2023. In addition to the investment, we had a loan to HMS for $2,613, which we wrote off during 2023 and is included in Asset Impairment in the Consolidated Statement of Earnings.\nInvestments in, and the operating results of, entities in which we do not have a controlling financial interest or the ability to exercise significant influence over the operations are accounted for using the cost method of accounting. As of September 30, 2023 we had cost method investments of $9,875, which are included as Other assets in the Consolidated Balance Sheets.\nNote 10 - Indebtedness\nWe maintain short-term line of credit facilities with banks throughout the world that are principally demand lines subject to revision by the banks.\nLong-term debt consists of:\nSeptember 30,\n2023 October 1,\nU.S. revolving credit facility $ 334,500 $ 321,300\nSECT revolving credit facility 33,000 20,000\nSenior notes 4.25% 500,000 500,000\nOther long-term debt - 916\nSenior debt 867,500 842,216\nLess deferred debt issuance cost (4,408) (4,428)\nLess current installments - (916)\nLong-term debt $ 863,092 $ 836,872\nOn October 27, 2022, we amended our U.S. revolving credit facility, which extended the maturity date of the credit facility from October 15, 2024 to October 27, 2027. The credit facility has a capacity of $1,100,000 and provides an expansion option, which permits us to request an increase of up to $400,000 to the credit facility upon satisfaction of certain conditions. The credit facility is secured by substantially all of our U.S. assets. The loan agreement contains various covenants which, among others, specify interest coverage and maximum leverage. We are in compliance with all covenants. The weighted-average interest rate on the outstanding credit facility borrowings is 6.93% and is based on SOFR plus the applicable margin, which was 1.60% at September 30, 2023.\nThe SECT has a revolving credit facility with a borrowing capacity of $35,000. On April 21, 2023, the SECT amended the credit facility, which extended the maturity date of the credit facility from July 26, 2024 to October 26, 2025. Interest is based on SOFR plus an applicable margin of 2.23%. A commitment fee is also charged based on a percentage of the unused amounts available and is not material.\nWe have $500,000 aggregate principal amount of 4.25% senior notes due December 15, 2027 with interest paid semiannually on June 15 and December 15 of each year. The senior notes are unsecured obligations, guaranteed on a senior unsecured basis by certain subsidiaries and contain normal incurrence-based covenants and limitations such as the ability to incur additional indebtedness, pay dividends, make other restricted payments and investments, create liens and certain corporate acts such as mergers and consolidations. We are in compliance with all covenants.The effective interest rate for these notes after considering the amortization of deferred debt issuance costs is 4.60%.\nMaturities of long-term debt are:\n2024 2025 2026 2027 2028 Thereafter\nLong-term debt maturities $ - $ - $ 33,000 $ - $ 834,500 $ -\nAt September 30, 2023, we had pledged assets with a net book value of $1,636,196 as security for long-term debt.\nAt September 30, 2023, we had $712,475 of unused short and long-term borrowing capacity, including $710,475 from the U.S. revolving credit facility.\nCommitment fees are charged on some of these arrangements and on the U.S. revolving credit facility based on a percentage of the unused amounts available and are not material.\nNote 11 - Other Accrued Liabilities\nOther accrued liabilities consists of:\nSeptember 30, 2023 October 1, 2022\nEmployee benefits $ 47,653 $ 56,136\nContract reserves 45,257 46,547\nWarranty accrual 22,939 23,072\nAccrued income taxes 29,631 17,776\nOther 66,289 71,845\nOther accrued liabilities $ 211,769 $ 215,376\nActivity in the warranty accrual is summarized as follows:\n2023 2022 2021\nWarranty accrual at beginning of period $ 23,072 $ 26,602 $ 27,707\nAdditions from acquisitions - - 990\nWarranties issued during current period 11,227 9,227 13,937\nAdjustments to pre-existing warranties (350) (764) (519)\nReductions for settling warranties (11,264) (10,366) (15,630)\nDivestiture adjustment - (618) -\nForeign currency translation 254 (1,009) 117\nWarranty accrual at end of year $ 22,939 $ 23,072 $ 26,602\nNote 12 - Derivative Financial Instruments\nWe principally use derivative financial instruments to manage foreign exchange risk related to foreign operations and foreign currency transactions and interest rate risk associated with long-term debt. We enter into derivative financial instruments with a number of major financial institutions to minimize counterparty credit risk.\nDerivatives designated as hedging instruments\nWe use foreign currency contracts as cash flow hedges to effectively fix the exchange rates on future payments and revenue. To mitigate exposure in movements between various currencies, including the Philippine peso, we had outstanding foreign currency contracts with notional amounts of $6,787 at September 30, 2023. These contracts mature at various times through March 1, 2024.\nWe use forward currency contracts to hedge our net investment in certain foreign subsidiaries. As of September 30, 2023, we had no outstanding net investment hedges.\nInterest rate swaps are used to adjust the proportion of total debt that is subject to variable and fixed interest rates. The interest rate swaps are designated as hedges of the amount of future cash flows related to interest payments on variable-rate debt that, in combination with the interest payments on the debt, convert a portion of the variable-rate debt to fixed-rate debt. At September 30, 2023, we had no outstanding interest rate swaps.\nForeign currency contracts, net investment hedges and interest rate swaps are recorded in the Consolidated Balance Sheets at fair value and the related gains or losses are deferred in Shareholders Equity as a component of Accumulated Other Comprehensive Income (Loss) (\"AOCIL\"). These deferred gains and losses are reclassified into the Consolidated Statements of Earnings, as necessary, during the periods in which the related payments or receipts affect earnings. However, to the extent the foreign currency contracts and interest rate swaps are not perfectly effective in offsetting the change in the value of the payments and revenue being hedged, the ineffective portion of these contracts is recognized in earnings immediately. Ineffectiveness was not material in 2023, 2022 or 2021.\nDerivatives not designated as hedging instruments\nWe also have foreign currency exposure on balances, primarily intercompany, that are denominated in a foreign currency and are adjusted to current values using period-end exchange rates. The resulting gains or losses are recorded in the Consolidated Statements of Earnings. To minimize foreign currency exposure, we have foreign currency contracts with notional amounts of $115,660 at September 30, 2023. The foreign currency contracts are recorded in the Consolidated Balance Sheets at fair value and resulting gains or losses are recorded in the Consolidated Statements of Earnings. We recorded the following gains and losses on foreign currency contracts which are included in other income or expense and generally offset the gains or losses from the foreign currency adjustments on the intercompany balances that are also included in other income or expense:\nStatements of Earnings location 2023 2022 2021\nNet gain (loss)\nForeign currency contracts Other $ 2,781 $ (10,396) $ 648\nSummary of derivatives\nThe fair value and classification of derivatives is summarized as follows:\nBalance Sheets location\nSeptember 30, 2023 October 1, 2022\nDerivatives designated as hedging instruments:\nForeign currency contracts Other current assets $ 295 $ 562\nForeign currency contracts Other assets - 165\nTotal asset derivatives $ 295 $ 727\nForeign currency contracts Accrued liabilities and other $ 581 $ 3,877\nForeign currency contracts Other long-term liabilities - 751\nTotal liability derivatives $ 581 $ 4,628\nDerivatives not designated as hedging instruments:\nForeign currency contracts Other current assets $ 93 $ 679\nForeign currency contracts Accrued liabilities and other $ 324 $ 738\nNote 13 - Fair Value\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Depending on the nature of the asset or liability, various techniques and assumptions can be used to estimate fair value. The definition of the fair value hierarchy is as follows:\nLevel 1 - Quoted prices in active markets for identical assets and liabilities.\nLevel 2 - Observable inputs other than quoted prices in active markets for similar assets and liabilities.\nLevel 3 - Inputs for which significant valuation assumptions are unobservable in a market and therefore value is based on the best available data, some of which is internally developed and considers risk premiums that a market participant would require.\nOur derivatives are valued using various pricing models or discounted cash flow analyses that incorporate observable market data, such as interest rate yield curves and currency rates, and are classified as Level 2 within the valuation hierarchy.\nThe following table presents the fair values and classification of our financial assets and liabilities measured on a recurring basis, all of which are classified as Level 2, except for the acquisition contingent consideration, which is classified as Level 3:\nBalance Sheets location September 30, 2023 October 1, 2022\nForeign currency contracts Other current assets $ 388 $ 1,241\nForeign currency contracts Other assets - 165\nTotal assets $ 388 $ 1,406\nForeign currency contracts Accrued liabilities and other $ 905 $ 4,615\nForeign currency contracts Other long-term liabilities - 751\nAcquisition contingent consideration Other long-term liabilities 3,089 3,272\nTotal liabilities $ 3,994 $ 8,638\nThe changes in financial liabilities classified as Level 3 within the fair value hierarchy are as follows:\nSeptember 30, 2023 October 1, 2022\nBalance at beginning of period $ 3,272 $ -\nAdditions from acquisition (491) 3,053\nIncrease in discounted future cash flows recorded as interest expense 308 219\nBalance at end of period $ 3,089 $ 3,272\nOur only financial instrument for which the carrying value differs from its fair value is long-term debt. At September 30, 2023, the fair value of long-term debt was $812,693 compared to its carrying value of $867,500. The fair value of long-term debt is classified as Level 2 within the fair value hierarchy and was estimated based on quoted market prices.\nCertain receivables, inventories, property, plant and equipment, ROU assets, and intangible assets have been measured at fair values on a nonrecurring basis using future discounted cash flows and other observable inputs (Level 3) and are not included in the fair value tables above. Impairment losses and inventory write-downs of $18,973, $19,960 and $1,500 in 2023, 2022 and 2021, respectively, are recorded as a result of these measurements and are described in Note 4 - Receivables, Note 5 - Inventories, Note 6 - Property, Plant and Equipment, Note 7 - Leases and Note 8 - Goodwill and Intangible Assets.\nNote 14 - Restructuring\nIn 2023, we initiated restructuring actions in relation to portfolio shaping activities. These actions have and will result in workforce reductions, principally in the U.S. and Europe. The 2023 restructuring charge consists of $6,905 for severance and $1,092 for facility closure and other costs. The 2023 plan has elements, primarily retention agreements, that will continue through 2027 and could result in additional costs of up to approximately $11,000.\nIn 2022, we initiated restructuring actions in relation to portfolio shaping activities in our Space and Defense and Industrial Systems segments and for slower than expected commercial aircraft business recovery in our Aircraft Controls segment. These actions have and will result in workforce reductions, principally in the U.S., China, Europe and the U.K. The 2022 restructuring charge consists of non-cash charges related to an inventory write-down of $1,692 and equipment of $538 as well as severance and other costs of $8,971.\nRestructuring activity for severance and other costs by segment and reconciliation to consolidated amounts is as follows:\nAircraft Controls Space and Defense Controls Industrial Systems Total\nBalance at October 3, 2020 $ 1,247 $ - $ 9,095 $ 10,342\nAdjustments to provision (457) - (711) (1,168)\nCash payments - 2020 plan (611) - (2,423) (3,034)\nCash payments - 2018 plan - - (524) (524)\nForeign currency translation - - 49 49\nBalance at October 2, 2021 179 - 5,486 5,665\nCharged to expense - 2022 plan 3,996 3,755 3,450 11,201\nNon-cash charges - 2022 plan - (2,230) - (2,230)\nCash payments - 2022 plan (3,767) (1,297) (613) (5,677)\nCash payments - 2020 plan (179) - (443) (622)\nCash payments - 2018 plan - - (432) (432)\nForeign currency translation - - (770) (770)\nBalance at October 1, 2022 229 228 6,678 7,135\nCharged to expense - 2023 plan 458 2,308 5,808 8,574\nAdjustments to provision (15) (37) (525) (577)\nCash payments - 2023 plan (95) (678) (1,450) (2,223)\nCash payments - 2022 plan (229) (190) (1,885) (2,304)\nCash payments - 2020 plan - - (372) (372)\nCash payments - 2018 plan - - (359) (359)\nForeign currency translation (1) (9) 313 303\nBalance at September 30, 2023 $ 347 $ 1,622 $ 8,208 $ 10,177\nAs of September 30, 2023, the restructuring accrual consists $6,057 for the 2023 plan, $650 for the 2022 plan, $2,293 for the 2020 plan and $1,177 for the 2018 plan. Restructuring is expected to be paid within a year, except portions classified as long-term liabilities based on the nature of the reserve and the timing of the expected payments.\nNote 15 - Employee Benefit Plans\nWe maintain multiple employee benefit plans, covering employees at certain locations.\nOur qualified U.S. defined benefit pension plan is not open to new entrants. New employees are not eligible to participate in the pension plan. Instead, we make contributions for those employees to an employee-directed investment fund in the Moog Inc. Retirement Savings Plan (\"RSP\"), which consists of two defined contribution options, the RSP and the RSP(+). Effective January 1, 2020, all employees hired prior to January 1, 2019 are eligible to either participate in the new RSP(+) or remain in the existing RSP. All employees hired after January 1, 2019 are automatically enrolled in the new RSP(+). The Companys contributions to both the RSP and RSP(+) are based on a percentage of the employees eligible compensation and age and are in addition to the employer match on voluntary employee contributions.\nThe RSP and RSP(+) includes an employee stock ownership feature. As one of the investment alternatives, participants in the RSP and RSP(+) can acquire our stock at market value. Shares are allocated and compensation expense is recognized as the employer share match is earned. At September 30, 2023, the participants in the RSP and RSP(+) owned 1,814,252 Class B shares.\nExpense for all defined contribution plans consists of:\n2023 2022 2021\nU.S. defined contribution plans $ 45,868 $ 43,550 $ 36,131\nNon-U.S. defined contribution plans 8,650 8,157 8,890\nTotal expense for defined contribution plans $ 54,518 $ 51,707 $ 45,021\nAs of January 1, 2021, one of our non-U.S. defined benefit plans was replaced by a defined contribution plan. The transaction eliminated balance sheet exposure for the plan, reducing the projected benefit obligation by $63,333, the fair value of plan assets by $57,643 and resulted in a curtailment gain of $5,830.\nThe changes in projected benefit obligations and plan assets and the funded status of the U.S. and non-U.S. defined benefit plans are as follows:\nU.S. Plans Non-U.S. Plans\n2023 2022 2023 2022\nChange in projected benefit obligation:\nProjected benefit obligation at prior year measurement date $ 530,946 $ 704,989 $ 127,739 $ 205,093\nService cost 12,913 19,827 2,674 4,248\nInterest cost 28,112 18,246 5,448 2,413\nContributions by plan participants - - 170 184\nActuarial (gains) losses (17,701) (198,538) (5,874) (48,255)\nForeign currency exchange impact - - 8,838 (28,435)\nBenefits paid (17,391) (12,845) (6,514) (5,136)\nSettlements (40,518) - (2,146) (2,312)\nOther (1,485) (733) (161) (61)\nProjected benefit obligation at measurement date $ 494,876 $ 530,946 $ 130,174 $ 127,739\nChange in plan assets:\nFair value of assets at prior year measurement date $ 445,723 $ 640,513 $ 90,994 $ 127,766\nActual return on plan assets 20 (186,536) 1,828 (17,686)\nEmployer contributions 6,095 5,324 7,455 8,210\nContributions by plan participants - - 170 184\nBenefits paid (17,391) (12,845) (6,514) (5,136)\nSettlements (40,518) - (2,146) (2,312)\nForeign currency exchange impact - - 5,558 (19,971)\nOther (1,485) (733) (161) (61)\nFair value of assets at measurement date $ 392,444 $ 445,723 $ 97,184 $ 90,994\nFunded status and amount recognized in assets and liabilities $ (102,432) $ (85,223) $ (32,990) $ (36,745)\nAmount recognized in assets and liabilities:\nLong-term assets $ - $ - $ 13,647 $ 10,672\nCurrent and long-term pension liabilities (102,432) (85,223) (46,637) (47,417)\nAmount recognized in assets and liabilities $ (102,432) $ (85,223) $ (32,990) $ (36,745)\nAmount recognized in AOCIL, before taxes:\nPrior service cost (credit) $ - $ - $ 737 $ 724\nActuarial losses 145,536 160,659 10,726 13,209\nAmount recognized in AOCIL, before taxes $ 145,536 $ 160,659 $ 11,463 $ 13,933\nOn September 26, 2023, we made a lump sum payment to certain retirees and beneficiaries in our qualified U.S. defined benefit pension plan. The settlement reduced the projected benefit obligation and fair value of assets by $40,518 and resulted in a one-time settlement charge of $12,542.\nOur funding policy is to contribute at least the amount required by law in the respective countries.\nThe total accumulated benefit obligation as of the measurement date for all defined benefit pension plans was $587,754 in 2023 and $611,225 in 2022. At the measurement date in 2023, our plans had fair values of plan assets totaling $489,628. The following table provides aggregate information for the pension plans, which have accumulated benefit obligations in excess of plan assets:\nSeptember 30, 2023 October 1, 2022\nAccumulated benefit obligation $ 138,054 $ 130,315\nFair value of plan assets 13,107 11,231\nThe following table provides aggregate information for the pension plans, which have projected benefit obligations in excess of plan assets:\nSeptember 30, 2023 October 1, 2022\nProjected benefit obligation $ 583,029 $ 615,339\nFair value of plan assets 433,960 482,700\nWeighted-average assumptions used to determine net periodic benefit cost and weighted-average assumptions used to determine benefit obligations as of the measurement dates are as follows:\nU.S. Plans Non-U.S. Plans\n2023 2022 2021 2023 2022 2021\nAssumptions for net periodic benefit cost:\nService cost discount rate 5.5 % 3.3 % 3.1 % 4.5 % 2.0 % 1.5 %\nInterest cost discount rate 5.4 % 2.7 % 2.6 % 4.5 % 1.7 % 1.2 %\nReturn on assets 6.5 % 5.0 % 5.0 % 4.3 % 2.9 % 3.2 %\nRate of compensation increase 3.8 % 3.5 % 3.3 % 3.2 % 3.0 % 2.6 %\nAssumptions for benefit obligations:\nDiscount rate 5.9 % 5.5 % 3.2 % 4.7 % 4.4 % 1.8 %\nRate of compensation increase 3.8 % 3.8 % 3.5 % 3.2 % 3.1 % 2.8 %\nPension plan investment policies and strategies are developed on a plan specific basis, which varies by country. The overall objective for the long-term expected return on both domestic and international plan assets is to earn a rate of return over time to meet anticipated benefit payments in accordance with plan provisions. The long-term investment objective of both the domestic and international retirement plans is to maintain the economic value of plan assets and future contributions by producing positive rates of investment return after subtracting inflation, benefit payments and expenses. Each of the plans strategic asset allocations is based on this long-term perspective and short-term fluctuations are viewed with appropriate perspective.\nThe U.S. qualified defined benefit plans assets are invested for long-term investment results. To accommodate the long-term investment horizon while providing appropriate liquidity, the plan maintains a liquid cash reserve sufficient to allow the plan to meet its benefit payment, fee and expense obligations. Its assets are broadly diversified to help alleviate the risk of adverse returns in any one security or investment class. The international plans assets are invested in both low-risk and high-risk investments in order to achieve the long-term investment strategy objective. Investment risks for both domestic and international plans are considered within the context of the entire asset allocation, rather than on a security-by-security basis.\nThe U.S. qualified defined benefit plan and certain international plans have investment committees that are responsible for formulating investment policies, developing manager guidelines and objectives and approving and managing qualified advisors and investment managers. The guidelines established for each of the plans define permitted investments within each asset class and apply certain restrictions such as limits on concentrated holdings in order to meet overall investment objectives.\nPension obligations and the related costs are determined using actuarial valuations that involve several assumptions. The return on assets assumption reflects the average rate of return expected on funds invested or to be invested to provide for the benefits included in the projected benefit obligation. In determining the return on assets assumption, we consider the relative weighting of plan assets, the historical performance of total plan assets and individual asset classes and economic and other indicators of future performance. Asset management objectives include maintaining an adequate level of diversification to reduce interest rate and market risk and to provide adequate liquidity to meet immediate and future benefit payment requirements.\nIn determining our U.S. pension expense for 2023, we assumed an average rate of return on U.S. pension assets of approximately 6.5% measured over a planning horizon with reasonable and acceptable levels of risk. The rate of return was based on the actual asset allocation of 30% in equity securities and 70% in fixed income securities at October 1, 2022. In determining our non-U.S. pension expense for 2023, we assumed an average rate of return on non-U.S. pension assets of approximately 4.3% measured over a planning horizon with reasonable and acceptable levels of risk. The rate of return assumed an average asset allocation of 40% in equity securities and 60% in fixed income securities and other investments.\nThe weighted average asset allocations by asset category for the pension plans as of September 30, 2023 and October 1, 2022 are as follows:\nU.S. Plans Non-U.S. Plans\nTarget 2023\nActual 2022\nActual Target 2023\nActual 2022\nActual\nAsset category:\nEquity 35%-45% 40% 30% 20%-40% 25% 26%\nFixed Income 55%-65% 60% 70% 50%-70% 68% 65%\nOther -% -% -% 5%-15% 7% 9%\nThe valuation methodologies used for pension plan assets measured at fair value have been applied consistently.\nShares of registered investment companies: Consists of both equity and fixed income mutual funds. Valued at quoted market prices that represent the net asset value (\"NAV\") of shares held by the plan at year end.\nEquity securities: Traded on national exchanges are valued at the last reported sales price. Investments denominated in foreign currencies are translated into U.S. dollars using the last reported exchange rate.\nFixed income securities: Valued using methods, such as dealer quotes, available trade information, spreads, bids and offers provided by a pricing vendor.\nMoney market funds: Institutional short-term investment vehicles valued daily.\nCash and cash equivalents: Direct cash holdings valued at cost (Level 1) or cash collateral for the initial margin requirements on futures contracts (Level 2) which approximates fair value.\nCollective investment trust: NAV of the fund is calculated daily or weekly by the investment manager.\nUnit linked life insurance funds: NAV value of the fund is calculated daily by the investment manager.\nInvestment in insurance contracts: Valued at contract value, which is the fair value of the underlying investment of the insurance company.\nLimited partnerships: Valued at NAV of units held. The NAV is used as a practical expedient to estimate fair value. The NAV is based on the fair value of the underlying investments held by the fund less its liability. This practical expedient is not used when it is determined to be probable that the fund will sell the investment for an amount different from the reported NAV.\nSecurities or other assets for which market quotations are not readily available or for which market quotations do not represent the value at the time of pricing (including certain illiquid securities) are fair valued in accordance with procedures established under the supervision and responsibility of the Trustee of that investment. Such procedures may include the use of independent pricing services or affiliated advisor pricing, which use prices based upon yields or prices of securities of comparable quality, coupon, maturity and type, indications as to values from dealers, operating data and general market conditions.\nThe following tables present the consolidated plan assets using the fair value hierarchy, which is described in Note 13 - Fair Value, as of September 30, 2023 and October 1, 2022.\nU.S. Plans, September 30, 2023 Level 1\nLevel 2\nLevel 3\nTotal\nInvestments at fair value:\nShares of registered investment companies:\nEquity funds $ 143,528 $ - $ - $ 143,528\nFixed income funds 125,724 - - 125,724\nMoney market funds - 9,386 - 9,386\nCash and cash equivalents - 8,410 - 8,410\nTotal investments in fair value hierarchy 269,252 17,796 - 287,048\nInvestments measured at NAV practical expedient (1) 105,396\nTotal investments at fair value $ 269,252 $ 17,796 $ - $ 392,444\nNon-U.S. Plans, September 30, 2023 Level 1 Level 2 Level 3 Total\nInvestments at fair value:\nMutual funds:\nEquity funds $ - $ 6,346 $ - $ 6,346\nFixed income funds - 6,567 - 6,567\nEquity securities 6,694 - - 6,694\nFixed income securities - 19,045 - 19,045\nCollective investment trusts - 19,044 - 19,044\nUnit linked life insurance funds - 35,988 - 35,988\nMoney market funds - 904 - 904\nCash and cash equivalents 978 - - 978\nInsurance contracts and other - - 1,618 1,618\nTotal investments at fair value $ 7,672 $ 87,894 $ 1,618 $ 97,184\nU.S. Plans, October 1, 2022 Level 1 Level 2 Level 3 Total\nInvestments at fair value:\nShares of registered investment companies:\nEquity funds $ 116,598 $ - $ - $ 116,598\nFixed income funds 180,291 - - 180,291\nMoney market funds - 7,144 - 7,144\nCash and cash equivalents - 5,790 - 5,790\nTotal investments in fair value hierarchy\n296,889 12,934 - 309,823\nInvestments measured at NAV practical expedient (1) 135,900\nTotal investments at fair value $ 296,889 $ 12,934 $ - $ 445,723\nNon-U.S. Plans, October 1, 2022 Level 1 Level 2 Level 3 Total\nInvestments at fair value:\nMutual funds:\nEquity funds $ - $ 5,091 $ - $ 5,091\nFixed income funds - 6,020 - 6,020\nEquity securities 5,739 - - 5,739\nFixed income securities - 18,515 - 18,515\nCollective investment trusts - 17,229 - 17,229\nUnit linked life insurance funds - 35,089 - 35,089\nMoney market funds - 840 - 840\nCash and cash equivalents 465 - - 465\nInsurance contracts and other\n- - 2,006 2,006\nTotal investments at fair value $ 6,204 $ 82,784 $ 2,006 $ 90,994\n(1)Certain investments that are measured at fair value using the NAV per share (or its equivalent) practical expedient have not been classified in the fair value hierarchy. The fair value amounts presented in this table are intended to permit reconciliation of the fair value hierarchy to the total retirement plan assets.\nThe following is a roll forward of the consolidated plan assets classified as Level 3 within the fair value hierarchy:\nNon-U.S. Plans\nBalance at October 2, 2021 $ 2,991\nReturn on assets 36\nPurchases from contributions to Plans 1,430\nSettlements paid in cash (1,801)\nForeign currency translation\n(650)\nBalance at October 1, 2022 2,006\nReturn on assets 23\nPurchases from contributions to Plans 2,310\nSettlements paid in cash (2,684)\nForeign currency translation (37)\nBalance at September 30, 2023 $ 1,618\nThe following table summarizes investments measured at fair value based on NAV per share as of September 30, 2023:\nFair Value\nSeptember 30, 2023 October 1, 2022 Unfunded Commitments Redemption Frequency Redemption Notice Period\nCollective investment trusts $ 92,140 $ 119,470 $ - Daily 5 days\nLimited partnerships (1) 13,256 16,430 3,799 Varies 10-45 days\nTotal $ 105,396 $ 135,900 $ 3,799\n(1)Investments in limited partnerships held by us invest primarily in emerging markets, equity and equity related securities. The strategy for the partnerships is to have exposure to certain markets or to securities that are judged to achieve superior earnings growth and/or judged undervalued relative to intrinsic value.\nThe preceding methods may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. Furthermore, although we believe the valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement at the reporting date.\nExpense for defined benefit plans is as follows:\nU.S. Plans Non-U.S. Plans\n2023 2022 2021 2023 2022 2021\nService cost $ 12,913 $ 19,827 $ 22,488 $ 2,674 $ 4,248 $ 5,290\nInterest cost 28,112 18,246 17,103 5,448 2,413 2,277\nExpected return on plan assets (28,589) (29,803) (30,543) (4,244) (3,401) (4,102)\nAmortization of prior service cost - - - 55 58 45\nAmortization of actuarial loss 13,449 15,586 13,721 399 3,877 5,568\nCurtailment gain - - - - - (5,830)\nSettlement (gain) loss 12,542 - - (151) 280 (44)\nTotal expense for defined benefit plans\n$ 38,427 $ 23,856 $ 22,769 $ 4,181 $ 7,475 $ 3,204\nBenefits expected to be paid to the participants of the plans are:\nU.S. Plans\nNon-U.S. Plans\n2024 $ 19,653 $ 6,479\n2025 22,702 6,743\n2026 25,438 7,920\n2027 27,999 7,115\n2028 30,434 8,865\nFive years thereafter 182,979 42,211\nWe presently anticipate contributing approximately $6,200 to the SERP Trust for the non-qualified plan and $7,500 to the non-U.S. plans in 2024.\nWe provide postretirement health care benefits to certain domestic retirees, who were hired prior to October 1, 1989. There are no plan assets. The changes in the accumulated benefit obligation of this unfunded plan for 2023 and 2022 are shown in the following table:\nSeptember 30, 2023 October 1, 2022\nChange in Accumulated Postretirement Benefit Obligation (APBO):\nAPBO at prior year measurement date $ 3,674 $ 6,281\nService cost 16 33\nInterest cost 166 90\nContributions by plan participants 453 559\nBenefits paid (903) (478)\nActuarial (gains) losses (566) (2,811)\nAPBO at measurement date $ 2,840 $ 3,674\nFunded status $ (2,840) $ (3,674)\nAccrued postretirement benefit liability $ 2,840 $ 3,674\nAmount recognized in AOCIL, before taxes:\nActuarial gains 5,252 7,579\nAmount recognized in AOCIL, before taxes $ 5,252 $ 7,579\nThe cost of the postretirement benefit plan is as follows:\n2023 2022 2021\nService cost $ 16 $ 33 $ 52\nInterest cost 166 90 124\nAmortization of actuarial gain (2,321) (1,274) (513)\nNet periodic postretirement benefit income $ (2,139) $ (1,151) $ (337)\nAs of the measurement date, the assumed discount rate used in the accounting for the postretirement benefit obligation was 5.6% in 2023, 5.2% in 2022 and 2.5% in 2021. The assumed service cost discount rate and interest cost discount rate used in the accounting for the net periodic postretirement benefit cost were 5.1% and 5.1%, respectively in 2023, 2.7% and 1.5%, respectively in 2022 and 2.5% and 1.4%, respectively in 2021.\nFor measurement purposes, a 7.3% annual per capita rate of increase of medical and drug costs were assumed for 2024, gradually decreasing to 4.5% for 2035 and years thereafter.\nEmployee and management profit sharing reflects a discretionary payment based on our financial performance. Profit share expense was $38,702, $32,993 and $34,257 in 2023, 2022 and 2021, respectively.\nNote 16 - Income Taxes\nThe reconciliation of the provision for income taxes to the amount computed by applying the U.S. federal statutory tax rate to earnings before income taxes is as follows:\n2023 2022 2021\nEarnings before income taxes:\nDomestic $ 136,080 $ 151,870 $ 141,665\nForeign 79,972 51,109 62,109\nTotal $ 216,052 $ 202,979 $ 203,774\nFederal statutory income tax rate 21.0 % 21.0 % 21.0 %\nIncrease (decrease) in income taxes resulting from:\nImpacts of Tax Act (0.8) % (0.4) % (1.2) %\nRevaluation of deferred taxes - % - % 1.6 %\nWithholding taxes 0.4 % 0.6 % 0.4 %\nReversal of indefinite reinvestment assertion 0.5 % - % 0.2 %\nR&D and foreign tax credits (6.4) % (5.4) % (4.6) %\nDivestiture impacts - % 2.3 % - %\nForeign tax rates 6.8 % 4.5 % 4.4 %\nEquity-based compensation (0.3) % (0.2) % (0.1) %\nChange in valuation allowance for deferred taxes (0.8) % (2.3) % (1.6) %\nState taxes, net of federal benefit 0.1 % 1.9 % 2.1 %\nOther 0.3 % 1.6 % 0.6 %\nEffective income tax rate 20.8 % 23.6 % 22.8 %\nOur accounting policy is to treat tax on the Global Intangible Low-Tax Income (\"GILTI\") as a current period cost included in tax expense the year incurred. As such, we don't measure the impact of the GILTI in our determination of deferred taxes. In 2023, we recorded $1,578 of GILTI tax and received a benefit of $3,159 related to the Foreign-Derived Intangible Income deduction. In 2023, we also recorded a tax benefit for provision to return adjustments of $2,338 primarily related to domestic research and development tax credits. In addition, we recorded a current year expense of $2,201 for a total accrual of $10,535 for taxes on undistributed earnings not considered permanently reinvested.\nDuring 2023, 2022 and 2021, we repatriated available unremitted earnings from various foreign subsidiaries that were previously taxed under the Tax Act of $39,156, $37,986 and $41,987, respectively. We no longer indefinitely reinvest unremitted earnings and therefore we record a liability related to the remaining unremitted earnings generated by the foreign subsidiaries in the current year. We continue to be permanently invested in outside basis differences other than the unremitted earnings as we have no plans to liquidate or sell those foreign subsidiaries.\nThe components of income taxes are as follows:\n2023 2022 2021\nCurrent:\nFederal $ 41,714 $ 6,270 $ 9,907\nForeign 32,269 26,730 23,801\nState 6,602 3,063 4,684\nTotal current 80,585 36,063 38,392\nDeferred:\nFederal (30,756) 8,076 4,625\nForeign 629 1,742 2,898\nState (5,404) 1,921 639\nTotal deferred (35,531) 11,739 8,162\nIncome taxes $ 45,054 $ 47,802 $ 46,554\nRealization of deferred tax assets is dependent, in part, upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers projected future taxable income, tax planning strategies, carryback opportunities and reversal of existing deferred tax liabilities in making its assessment of the recoverability of deferred tax assets.\nThe tax effects of temporary differences that generated deferred tax assets and liabilities are as follows:\nSeptember 30,\n2023 October 1,\nDeferred tax assets:\nBenefit accruals $ 59,738 $ 65,863\nInventory reserves 28,301 30,053\nTax benefit carryforwards 7,897 10,885\nContract reserves not currently deductible 10,467 10,447\nLease liability 16,342 18,473\nResearch and development 41,118 -\nOther accrued expenses 6,212 14,824\nTotal gross deferred tax assets 170,075 150,545\nLess valuation allowance (6,430) (8,650)\nTotal net deferred tax assets $ 163,645 $ 141,895\nDeferred tax liabilities:\nDifferences in bases and depreciation of property, plant and equipment $ 170,284 $ 167,990\nPension 22,238 28,802\nTotal gross deferred tax liabilities 192,522 196,792\nNet deferred tax liabilities $ (28,877) $ (54,897)\nDeferred tax assets and liabilities are reported in separate captions on the Consolidated Balance Sheets.\nAt September 30, 2023, foreign tax loss carryforwards total $1,452 with expirations ranging from 2024 to 2028. We have $895 of federal tax credit carryforward with expirations of 2031 and 2033 and $6,285 state tax credit carryforward with expirations of 2027 to indefinite life. The change in the valuation allowance relates to tax benefit carryforwards that were utilized or expired during 2023 and credits that were generated in 2023 but will likely not be used before expiration.\nEffective for tax year ended September 30, 2023, the Tax Cuts and Jobs Act (TCJA) of 2017 requires taxpayers to capitalize and amortize research and development costs pursuant to IRC Section 174. Domestic expenses are amortized over a 5 year period and foreign over a 15 year period. As a result of the act, a deferred tax asset of $41,118 was established in 2023.\nWe record unrecognized tax benefits as liabilities and we adjust these liabilities when our judgment changes as a result of the evaluation of new information not previously available. Further, we record interest and penalties related to unrecognized tax benefits in income tax expense. In 2023, we recorded a $1,072 benefit for the reversal of the uncertain tax position as a result of concluding the benefit is likely to be realized. In 2022, we expensed interest and penalties of $43 related to $848 of unrecognized tax benefits.\nWe are subject to income taxes in the U.S. and in various states and foreign jurisdictions. Tax regulations within each jurisdiction are subject to the interpretation of the related tax laws and regulations and require the application of significant judgment. With few exceptions, we are no longer subject to U.S. federal, state and local, or non-U.S. income tax examinations by tax authorities in significant jurisdictions for tax years before 2020. The statute of limitations in several jurisdictions will expire in the next twelve months and we will have no unrecognized tax benefits recognized if the statute of limitations expires without the relevant taxing authority examining the applicable returns.\nNote 17 - Earnings per Share\nBasic and diluted weighted-average shares outstanding, as well as shares considered to be anti-dilutive, are as follows:\n2023 2022 2021\nBasic weighted-average shares outstanding 31,831,687 31,977,482 32,112,589\nDilutive effect of equity-based awards 212,539 139,546 185,367\nDiluted weighted-average shares outstanding 32,044,226 32,117,028 32,297,956\nAnti-dilutive shares from equity-based awards 818 50,320 50,012\nNote 18 - Shareholders Equity\nClass A and Class B common stock share equally in our earnings and are identical with certain exceptions. Other than on matters relating to the election of directors or as required by law where the holders of Class A and Class B shares vote as separate classes, Class A shares have limited voting rights, with each share of Class A being entitled to one-tenth of a vote on most matters, and each share of Class B being entitled to one vote. Class A shareholders are entitled, subject to certain limitations, to elect at least 25% of the Board of Directors (rounded up to the nearest whole number) with Class B shareholders entitled to elect the balance of the directors. No cash dividend may be paid on Class B shares unless at least an equal cash dividend is paid on Class A shares. Class B shares are convertible at any time into Class A shares on a one-for-one basis at the option of the shareholder.\nClass A shares and Class B shares reserved for issuance at September 30, 2023 are as follows:\nShares\nConversion of Class B to Class A shares 7,457,369\nEmployee Stock Purchase Plan 1,310,543\n2014 Long Term Incentive Plan 1,662,796\n2008 Stock Appreciation Rights Plan 1,035,822\nClass A and B shares reserved for issuance 11,466,530\nWe are authorized to issue up to 10,000,000 shares of preferred stock. The Board of Directors may authorize, without further shareholder action, the issuance of additional preferred stock which ranks senior to both classes of our common stock with respect to the payment of dividends and the distribution of assets on liquidation. The preferred stock, when issued, would have such designations relative to voting and conversion rights, preferences, privileges and limitations as determined by the Board of Directors.\nWe issue common stock under our equity-based compensation plans from treasury stock or from stock held by the SECT. As of September 30, 2023, in addition to the shares reserved for issuance upon the exercise of outstanding equity awards, there were 677,923 shares authorized for awards that may be granted in the future under the 2014 Long Term Incentive Plan, assuming performance-based awards currently outstanding are all settled at the targeted payout.\nOn November 20, 2020, the Board of Directors authorized a new share repurchase program to replace the previously existing share repurchase program. This program authorizes repurchases that includes both Class A and Class B common stock, and allows us to buy up to an aggregate 3,000,000 common shares. Shares acquired by the SECT or the SERP Trust are not included in this program. During 2023, we repurchased 97,849 of our Class A and B common stock for $7,697. During 2022, we repurchased 486,923 of our Class A and B common stock for $35,626. During 2021, we repurchased 243,147 of our Class A and B common stock for $19,253. As of September 30, 2023, the total remaining authorization for future common share repurchases under our program is 2,172,081 shares.\nPreviously, the Board of Directors authorized a share repurchase program that was amended from time to time to authorize additional repurchases. Shares acquired by the SECT or the SERP Trust were not included in this program. During 2021, we repurchased 155,963 of our Class A and Class B common stock for $10,193. As of September 30, 2023, there are no shares remaining for future common share repurchases under this program.\nNote 19 - Equity-Based Compensation\nWe have equity-based compensation plans that authorize the issuance of equity-based awards for shares of Class A and Class B common stock to directors, officers and key employees. Equity-based compensation grants are designed to reward long-term contributions to Moog and provide incentives for recipients to remain with Moog.\nWe have an Employee Stock Purchase Plan (\"ESPP\") that allows for qualified employees (as defined in the plan) to purchase our common stock at a price equal to 85% of the fair market value at the lower of the beginning or the end of the semi-annual offering period.\nThe 2014 Long Term Incentive Plan (\"2014 Plan\") authorizes the issuance of a total of 2,000,000 shares of either Class A or Class B common stock. The 2014 Plan is intended to provide a flexible framework that permits the development and implementation of a variety of equity-based programs that base awards on key performance metrics as well as align our long term incentive compensation with our peers and shareholder interests.\nDuring 2023, we granted awards in the form of performance-based restricted stock units (\"PSUs\"), time vested restricted stock units (\"TVAs\") and restricted stock awards (\"RSAs\"). The compensation cost for employee and non-employee director equity-based compensation programs for all current and prior year awards granted are as follows:\n2023 2022 2021\nStock appreciation rights $ 1,584 $ 2,370 $ 2,345\nPerformance-based restricted stock units 2,479 1,718 1,151\nTime vested restricted stock units 2,461 1,423 602\nRestricted stock awards 1,102 850 730\nEmployee stock purchase plan 2,956 2,521 2,633\nTotal compensation cost before income taxes $ 10,582 $ 8,882 $ 7,461\nIncome tax benefit $ 1,156 $ 970 $ 893\nRestricted Stock Units\nPerformance-Based Awards\nPSU awards consist of shares of our stock which are payable upon the determination that we achieve certain established performance targets and can range from 0% to 200% of the targeted payout based on the actual results. PSU's granted in 2023 have a performance period of three years. The fair value of each PSU granted is equal to the fair market value of our common stock on the date of grant. PSUs granted generally have a cliff vesting schedule of three years; however, according to the grant agreements, if certain conditions are met, the employee (or beneficiary) will receive a prorated amount of the award based on active employment during the service period.\nPSUs are as follows:\nPerformance-Based Restricted Stock Units Number of Awards Weighted-\nAverage\nGrant Date Fair Value\nNonvested at October 1, 2022 58,444 $ 78.41\nGranted in 2023 40,949 85.17\nVested in 2023 (27,077) 73.39\nForfeited in 2023 (2,417) 80.29\nNonvested at September 30, 2023 69,899 $ 84.25\nAs of September 30, 2023, total unvested compensation expense associated with nonvested PSUs amounted to $3,232 and will be recognized over a weighted-average period of two years.\nThe number of Class B shares to be issued for PSU awards granted in 2021 that vested based on the achievement of performance targets in 2023, will be approximately 26,800 shares.\nTime Vested Awards\nTVAs consist of shares of our stock which are payable over a vesting schedule determined at the time the award is granted. TVAs vest in equal fixed dollar tranches over the agreed upon vesting term beginning one year after the date of the grant and will settle using the fair market value of shares on the date of vesting of the tranche. Although it is our intention to settle vested amount in shares, we reserve the right to settle in cash at our discretion.\nTVAs are as follows:\nTime Vested Restricted Stock Units Number of Awards Weighted-\nAverage\nFair Value\nNonvested at October 1, 2022 54,559 $ 71.40\nGranted in 2023 39,920 85.17\nVested in 2023 (17,768) 86.21\nForfeited in 2023 (1,220) 105.13\nDecrease due to fair value change in 2023 (25,446) n/a\nNonvested at September 30, 2023 50,045 $ 112.72\nAs of September 30, 2023, total unvested compensation expense associated with nonvested TVAs amounted to $3,373 and will be recognized over a weighted-average period of one year.\nThe number of Class B shares to be issued for TVAs that are expected to vest in 2023 from time based service conditions is approximately 23,000 shares, based on our closing price of Class B common stock of $112.72 as of September 30, 2023.\nRestricted Stock Awards\nThe fair value of each RSA granted is equal to the fair market value of our common stock on the date of grant. These shares vest and are issued upon grant. There were 12,464 RSAs granted and vested in 2023 at a price of $88.38 resulting in a fair value of the RSAs vested of $1,102.\nEmployee Stock Purchase Plan\nShares and the weighted-average price per share associated with the ESPP are as follows:\nEmployee Stock Purchase Plan 2023 2022 2021\nShares issued 155,704 139,121 141,647\nWeighted-average price per share $ 70.91 $ 67.91 $ 58.52\nStock Appreciation Rights\nThe fair value of SARs granted was estimated on the date of grant using the Black-Scholes option-pricing model. In 2023, there were no SARs granted. The following table provides the range of assumptions used to value awards and the weighted-average fair value of the awards granted.\n2022 2021\nExpected volatility 39% - 40% 38% - 41%\nRisk-free rate 1.3 % 0.4% - 0.5%\nExpected dividends 1.2 % 1.4 %\nExpected term 5-6 years 5-6 years\nWeighted-average fair value of awards granted $ 27.86 $ 23.11\nTo determine expected volatility, we generally use historical volatility based on daily closing prices of our Class A and Class B common stock over periods that correlate with the expected terms of the awards granted. The risk-free rate is based on the U.S. Treasury yield curve at the time of grant for the appropriate expected term of the awards granted. Expected dividends are based on our history and expectation of dividend payouts. The expected term of equity-based awards is based on vesting schedules, expected exercise patterns and contractual terms.\nThe number of shares received upon the exercise of a SAR is equal in value to the difference between the fair market value of the common stock on the exercise date and the exercise price of the SAR. The term of a SAR may not\nexceed ten years from the grant date. The exercise price of SARs and options, determined by a committee of the Board of Directors, may not be less than the fair value of the common stock on the grant date.\nSARs are as follows:\nStock Appreciation Rights Number of Awards Weighted-\nAverage\nExercise Price Weighted-\nAverage\nRemaining Contractual Life Aggregate\nIntrinsic\nValue\nOutstanding at October 1, 2022 858,503 $ 73.67\nExercised in 2023 (152,698) 57.85\nExpired in 2023 (1,736) 85.95\nForfeited in 2023 (2,559) 79.59\nOutstanding at September 30, 2023 701,510 $ 77.06 4.7 years $ 25,045\nExercisable at September 30, 2023 614,012 $ 76.66 4.2 years $ 22,169\nThe aggregate intrinsic value in the preceding tables represents the total pre-tax intrinsic value, based on our closing price of Class A common stock of $112.96 and Class B common stock of $112.72 as of September 30, 2023. That value would have been effectively received by the SAR holders had all SARs been exercised as of that date.\nThe intrinsic value of awards exercised and fair value of awards vested are as follows:\nStock Appreciation Rights 2023 2022 2021\nIntrinsic value of SARs exercised $ 5,596 $ 3,777 $ 3,833\nTotal fair value of SARs vested $ 2,426 $ 2,346 $ 2,558\nAs of September 30, 2023, total unvested compensation expense associated with SARs amounted to $1,013 and will be recognized over a weighted-average period of one year.\nNote 20 - Stock Employee Compensation Trust and Supplemental Retirement Plan Trust\nThe SECT assists in administering and provides funding for equity-based compensation plans and benefit programs, including the Moog Inc. Retirement Savings Plan (\"RSP\"), RSP(+) and the Employee Stock Purchase Plan (\"ESPP\"). The SERP Trust provides funding for benefits under the SERP provisions of the Moog Inc. Plan to Equalize Retirement Income and Supplemental Retirement Income. Both the SECT and the SERP Trust hold Moog shares as investments. The shares in the SECT and SERP Trust are not considered outstanding for purposes of calculating earnings per share. However, in accordance with the trust agreements governing the SECT and SERP Trust, the trustees vote all shares held by the SECT and SERP Trust on all matters submitted to shareholders.\nNote 21 - Accumulated Other Comprehensive Income (Loss)\nThe changes in AOCIL, net of tax, by component are as follows:\nAccumulated foreign currency translation Accumulated retirement liability Accumulated gain (loss) on derivatives Total\nAOCIL at October 2, 2021 $ (92,989) $ (153,210) $ (1,361) $ (247,560)\nOCI before reclassifications (101,906) 13,845 (4,031) (92,092)\nAmounts reclassified from AOCIL 12,871 14,134 1,605 28,610\nOCI, net of tax (89,035) 27,979 (2,426) (63,482)\nAOCIL at October 1, 2022 (182,024) (125,231) (3,787) (311,042)\nOCI before reclassifications 41,089 (6,716) 1,021 35,394\nAmounts reclassified from AOCIL 449 18,342 2,248 21,039\nOCI, net of tax 41,538 11,626 3,269 56,433\nAOCIL at September 30, 2023 $ (140,486) $ (113,605) $ (518) $ (254,609)\nNet gains and losses on net investment hedges are recorded in Accumulated foreign currency translation to the extent that the instruments are effective in hedging the designated risk.\nThe amounts reclassified from AOCIL into earnings are as follows:\nStatements of Earnings location 2023 2022\nRetirement liability:\nPrior service cost $ 55 $ 58\nActuarial losses 11,527 18,189\nSettlement loss 12,391 280\nReclassification from AOCIL into earnings 23,973 18,527\nTax effect (5,631) (4,393)\nNet reclassification from AOCIL into earnings $ 18,342 $ 14,134\nDerivatives:\nForeign currency contracts Sales $ 517 $ 996\nForeign currency contracts Cost of sales 2,394 1,044\nReclassification from AOCIL into earnings 2,911 2,040\nTax effect (663) (435)\nNet reclassification from AOCIL into earnings $ 2,248 $ 1,605\nReclassification from AOCIL into earnings for the Retirement liability are included in the computation of non-service pension expense, which is included in Other and Pension settlement on the Consolidated Statements of Earnings.\nThe effective portion of amounts deferred in AOCIL are as follows:\n2023 2022\nRetirement liability:\nNet actuarial gain (loss) during period $ (8,432) $ 15,521\nTax effect 1,716 (1,676)\nNet deferral in AOCIL of retirement liability $ (6,716) $ 13,845\nDerivatives:\nForeign currency contracts $ 1,319 $ (5,190)\nNet gain (loss) 1,319 (5,190)\nTax effect (298) 1,159\nNet deferral in AOCIL of derivatives $ 1,021 $ (4,031)\nNote 22 - Segments\nAircraft Controls. We design, manufacture and integrate primary and secondary flight controls and avionics for military and commercial aircraft and provide aftermarket support. Our systems are used on both development and production programs in large commercial transports, supersonic fighters, multi-role military aircraft, business jets and rotorcraft. Typically development programs require concentrated periods of research and development by our engineering teams, while production programs are generally long-term manufacturing efforts that extend for as long as the aircraft builder receives new orders.\nOur military production programs include the Joint Strike Fighter, the V-22 Osprey tiltrotor and the Black Hawk UH-60/Seahawk SH-60 helicopter, while our large commercial production programs include the full line of Boeing 787 and 737-MAX, the Airbus A320, A330 and A350XWB programs, the Embraer E195-E2 and a variety of business jets.\nWe are currently working on the development of the Textron Bell V-280 Valor, the MQ-25 aerial refueling drone and other classified funded development military programs.\nAftermarket sales, which represented 30%, 30% and 27% of 2023, 2022 and 2021 sales, respectively, for this segment consist of the maintenance, repair, overhaul and parts supply for both military and commercial aircraft. Further, we sell spare parts and line replaceable units to both military and commercial customers that they store throughout the world in order to minimize down time.\nSpace and Defense Controls. We provide solutions for a wide array of space and defense applications including space vehicles, launch vehicles, military vehicles, air defense platforms, naval vessels, as well as tactical, hypersonic, and strategic missiles.\nWe design, manufacture, and integrate steering and propulsion controls for space launch vehicles, hypersonic missiles, and Missile Defense Agency (MDA) vehicles. Launch programs of note include NASA's new Space Launch System for the Artemis program, as well as legacy launch vehicles Atlas and Vulcan. We have also developed modular space vehicle products, which have their own avionics, power, propulsion, and communications systems and are configurable for short durations up through multiyear missions in a wide range of orbits and transfer capabilities. Our spacecraft avionics are used for a variety of purposes and missions, including a complete flight control computer, payload data processing, and processing of discrete elements onboard a spacecraft. Mission specific actuation mechanisms control solar array panels, antenna and thrusters. We also provide discrete isolation systems for the entire spacecraft during launch and for vibration sensitive systems during spacecraft operation. Our propulsion and fluid control solutions accelerate the spacecraft for orbit-insertion, station keeping, and attitude control. Our fluid control systems are also used in Environmental Control and Life Support System (ECLSS) for crewed missions, such as the Orion Multi-Purpose Crew Vehicle that is part of NASAs Artemis program and the Habitation and Logistics Outpost (HALO), both of which will support humans working on the moon.\nWe produce an innovative turreted weapon system, the Reconfigurable Integrated-weapons Platform (RIwP®), for several military vehicle programs. In addition, we design controls for gun aiming, stabilization and automatic ammunition loading. Our coordinated multi-axis control systems support military vehicles, radars and launchers. We also manufacture controls for steering tactical and strategic missiles including Lockheed Martin's HELLFIRE® and PAC-3 interceptor, the U.S. National Missile Defense Agency's (MDA) Layered Missile Defense initiatives, multiple hypersonic missiles, as well as Raytheon's TOW missiles. Further, we design, build, and integrate weapons Stores Management Systems (SMS) for light attack aerial reconnaissance, ground, and sea platforms. We also produce high-power, quiet controls designed and built for many naval vessels including surface ships, Unmanned Undersea Vehicles (UUVs) and submarines such as the Ohio and Columbia classes.\nAlso, we design and manufacture various component products that serve both the space and defense segments by providing mission critical power, data and motion control capabilities. Slip rings allow unimpeded rotation while delivering power and data through a rotating interface. Our motion control products include high-performance motors, position feedback devices and actuators. The military electronics include a range of transceiver and Ethernet-based devices. These capabilities can be vertically integrated to support a broad range of applications which include military vehicles, aircraft, missiles, radar, and satellites.\nIndustrial Systems. We provide customized machine performance components and systems utilizing electrohydraulic, electromechanical and control technologies in applications involving motion control, fluid control and power and data management across a variety of markets.\nIn the industrial automation market, we design, manufacture and integrate components and systems for applications in injection and blow molding machinery, metal forming presses and heavy industry for steel and aluminum production. Our components and systems allow for precise controls of critical parameters in the industrial manufacturing processes, using both hydraulic and electric technologies. Our components product categories include hydraulics, slip rings, rotary unions and fiber optic rotary joints, motors and infusion and enteral pumps and associated sets across similar markets. We have also developed control components and systems for construction vehicles to run as zero-emission, autonomous machines with improved performance and safety capabilities.\nIn the simulation and test market, we supply electromechanical motion simulation bases for the flight simulation and training applications. We also supply custom test systems and controls for automotive, structural and fatigue testing.\nIn the energy market, we supply solutions for power generation applications which allow for precise control and greater safety of fuel metering and guide vane positioning on steam and gas turbines. We also design and manufacture high reliability systems and components for applications in oil and gas exploration and production, including downhole drilling, topside and subsea environments.\nIn the medical market, we supply components and systems for diagnostic imaging CT scan medical equipment, sleep apnea equipment, oxygen concentrators, infusion therapy and enteral clinical nutrition. We also manufacture medical devices including infusion therapy pumps and associated administration sets and enteral clinical nutrition pumps along with disposable sets. Medical device customers use our enteral feeding products in the delivery of enteral nutrition for patients in their own homes, hospitals and long-term care facilities.\nDisaggregation of net sales by segment are as follows:\nMarket Type 2023 2022 2021\nNet sales:\nMilitary $ 700,080 $ 745,376 $ 781,921\nCommercial 689,067 511,085 379,317\nAircraft Controls 1,389,147 1,256,461 1,161,238\nSpace 407,153 337,773 332,946\nDefense 540,098 534,570 466,289\nSpace and Defense Controls 947,251 872,343 799,235\nEnergy 123,864 125,574 120,173\nIndustrial Automation 485,502 435,074 427,076\nSimulation and Test 124,980 99,815 89,459\nMedical 248,378 246,516 254,812\nIndustrial Systems 982,724 906,979 891,520\nNet sales $ 3,319,122 $ 3,035,783 $ 2,851,993\nCustomer Type 2023 2022 2021\nNet sales:\nCommercial $ 689,067 $ 511,085 $ 379,317\nU.S. Government (including OEM) 518,033 566,855 617,034\nOther 182,047 178,521 164,887\nAircraft Controls 1,389,147 1,256,461 1,161,238\nCommercial 112,777 111,569 126,751\nU.S. Government (including OEM) 778,229 704,675 614,984\nOther 56,245 56,099 57,500\nSpace and Defense Controls 947,251 872,343 799,235\nCommercial 965,867 891,238 865,269\nU.S. Government (including OEM) 5,204 7,565 18,510\nOther 11,653 8,176 7,741\nIndustrial Systems 982,724 906,979 891,520\nCommercial 1,767,711 1,513,892 1,371,337\nU.S. Government (including OEM) 1,301,466 1,279,095 1,250,528\nOther 249,945 242,796 230,128\nNet sales $ 3,319,122 $ 3,035,783 $ 2,851,993\nRevenue Recognition Method 2023 2022 2021\nNet sales:\nOver-time $ 1,098,608 $ 1,003,432 $ 939,251\nPoint in time 290,539 253,029 221,987\nAircraft Controls 1,389,147 1,256,461 1,161,238\nOver-time 883,727 806,994 746,613\nPoint in time 63,524 65,349 52,622\nSpace and Defense Controls 947,251 872,343 799,235\nOver-time 137,338 121,405 122,066\nPoint in time 845,386 785,574 769,454\nIndustrial Systems 982,724 906,979 891,520\nOver-time 2,119,673 1,931,831 1,807,930\nPoint in time 1,199,449 1,103,952 1,044,063\nNet sales $ 3,319,122 $ 3,035,783 $ 2,851,993\nSales to Boeing were $349,961, $339,119 and $345,907, or 11%, 11% and 12% of sales, in 2023, 2022 and 2021, respectively, including sales to Boeing Commercial Airplanes of $166,748, $139,615 and $118,549 in 2023, 2022 and 2021, respectively. Sales to Lockheed Martin were $294,017, $260,902 and $330,778, or 9%, 9% and 12% in 2023, 2022 and 2021, respectively. Sales arising from U.S. Government prime or sub-contracts, including military sales to Boeing and Lockheed Martin are made primarily from our Aircraft Controls and Space and Defense Controls segments and are included in the Customer Type table above.\nOperating profit is net sales less cost of sales and other operating expenses, excluding interest expense, equity-based compensation expense, non-service pension expense and other corporate expenses. Cost of sales and other operating expenses are directly identifiable to the respective segment or allocated on the basis of sales, manpower or profit. Operating profit by segment and reconciliations to consolidated amounts are as follows:\n2023 2022 2021\nOperating profit:\nAircraft Controls $ 144,803 $ 123,620 $ 96,678\nSpace and Defense Controls 95,949 86,844 88,333\nIndustrial Systems 102,165 72,384 85,948\nTotal operating profit 342,917 282,848 270,959\nDeductions from operating profit:\nInterest expense 63,578 36,757 33,892\nEquity-based compensation expense 10,582 8,882 7,461\nPension settlement 12,542 - -\nNon-service pension expense 12,324 6,072 (2,194)\nCorporate and other expenses, net 27,839 28,158 28,026\nEarnings before income taxes $ 216,052 $ 202,979 $ 203,774\nDepreciation and amortization:\nAircraft Controls $ 43,636 $ 42,337 $ 41,580\nSpace and Defense Controls 20,227 19,399 18,655\nIndustrial Systems 26,157 26,515 29,731\nCorporate 213 138 193\nTotal depreciation and amortization $ 90,233 $ 88,389 $ 90,159\nIdentifiable assets:\nAircraft Controls $ 1,683,401 $ 1,469,968 $ 1,471,338\nSpace and Defense Controls 1,012,616 873,341 839,783\nIndustrial Systems 1,088,753 1,046,754 1,078,025\nCorporate 23,266 41,778 44,023\nTotal assets $ 3,808,036 $ 3,431,841 $ 3,433,169\nCapital expenditures:\nAircraft Controls $ 77,046 $ 70,526 $ 63,514\nSpace and Defense Controls 65,130 44,255 39,863\nIndustrial Systems 30,949 24,620 25,338\nCorporate 161 30 19\nTotal capital expenditures $ 173,286 $ 139,431 $ 128,734\nSales, based on the customers location, and property, plant and equipment by geographic area are as follows:\n2023 2022 2021\nNet sales:\nUnited States $ 2,152,967 $ 2,041,952 $ 1,935,626\nGermany 203,666 164,388 148,739\nOther 962,489 829,443 767,628\nNet sales $ 3,319,122 $ 3,035,783 $ 2,851,993\nProperty, plant and equipment, net:\nUnited States $ 537,908 $ 466,427 $ 438,851\nUnited Kingdom 125,471 61,950 62,662\nPhilippines 33,559 32,905 35,851\nOther 117,758 107,626 108,414\nProperty, plant and equipment, net $ 814,696 $ 668,908 $ 645,778\nNote 23 - Related Party Transactions\nJohn Scannell, Moog's Non-Executive Chairman of the Board of Directors, is a member of the Board of Directors of M&T Bank Corporation and M&T Bank. We currently engage with M&T Bank in the ordinary course of business for financing routine purchases and lease transactions, which totaled $13,670, $14,284 and $14,176 for 2023, 2022 and 2021, respectively. At September 30, 2023, we held outstanding leases with a total remaining obligation of $12,956. At September 30, 2023, outstanding deposits on our behalf for future equipment leases totaled $2,191. M&T Bank also maintains an interest of approximately 12% in our U.S. revolving credit facility. Further details of the U.S. revolving credit facility can be found in Note 10 - Indebtedness. Wilmington Trust, a subsidiary of M&T Bank, is the trustee of the pension assets for our qualified U.S. defined benefit pension plan. For further details, see Note 15 - Employee Benefit Plans.\nNote 24 - Commitments and Contingencies\nFrom time to time, we are involved in legal proceedings. We are not a party to any pending legal proceedings which management believes will result in a material adverse effect on our financial condition, results of operations or cash flows.\nWe are engaged in administrative proceedings with governmental agencies and legal proceedings with governmental agencies and other third parties in the normal course of our business, including litigation under Superfund laws, regarding environmental matters. We believe that adequate reserves have been established for our share of the estimated cost for all currently pending environmental administrative or legal proceedings and do not expect that these environmental matters will have a material adverse effect on our financial condition, results of operations or cash flows.\nIn the ordinary course of business we could be subject to ongoing claims or disputes from our customers, the ultimate settlement of which could have a material adverse impact on our consolidated results of operations. While the receivables and any loss provisions recorded to date reflect management's best estimate of the projected costs to complete a given project, there is still significant effort required to complete the ultimate deliverable. Future variability in internal cost and future profitability is dependent upon a number of factors including deliveries, performance and government budgetary pressures. The inability to achieve a satisfactory contractual solution, further unplanned delays, additional developmental cost growth or variations in any of the estimates used in the existing contract analysis could lead to further loss provisions. Additional losses could have a material adverse impact on our financial condition, results of operations or cash flows in the period in which the loss may be recognized.\nWe are contingently liable for $21,083 related to standby letters of credit issued by banks to third parties on our behalf at September 30, 2023. Purchase commitments outstanding at September 30, 2023 are $1,279,156 including $101,551 for property, plant and equipment.\nNote 25 - Subsequent Events\nOn November 2, 2023, the Board of Directors declared a $0.27 per share quarterly dividend payable on issued and outstanding shares of our Class A and Class B common stock on December 8, 2023 to shareholders of record at the close of business on November 22, 2023.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Moog Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Moog Inc. (the Company) as of September 30, 2023 and October 1, 2022, the related consolidated statements of earnings, comprehensive income, shareholders' equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and financial statement schedule listed in the Index at Item 15(2) (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2023 and October 1, 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 14, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosure to which it relates.\nEstimated contract costs at completion\nDescription of the Matter As discussed in Note 2 of the consolidated financial statements, revenue for certain of the Companys contracts with its customers is recognized over time as work progresses toward completion and is measured based on the ratio of cumulative costs incurred to date to the estimated total contract costs at completion. For the year ended September 30, 2023, the Company recognized revenue of $2.1 billion or 64% of total net sales on this basis.\nAuditing managements estimated contract costs at completion was complex and highly judgmental due to the significant judgments applied by management including the application of significant assumptions such as estimated direct labor hours, direct material costs, and other direct costs. A significant change in an estimate on one or more contracts could have a material effect on the Companys statement of earnings.\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over managements review of estimated contract costs at completion, including the determination of the underlying significant assumptions described above.\nTo test the estimated contract cost at completion, we performed audit procedures that included, among others, inspecting the approved contract and inquiring of program managers regarding the nature of the contract and the scope of work to be performed, testing the actual costs incurred through inspection of source documentation and testing the significant assumptions described above. Our testing of each of these assumptions included a combination of inquiries of finance directors and program managers, inspection of source documentation to support the future estimated costs and analytical procedures comparing profit rates to similar contracts, as applicable. We also assessed the historical accuracy of managements estimated costs at completion.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2003.\nBuffalo, NY\nNovember 14, 2023\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) and 15d-15(f) of the Exchange Act. Under the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2023 based upon the framework in Internal Control - Integrated Framework (2013) by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on that evaluation, our management concluded that our internal control over financial reporting is effective as of September 30, 2023.\nErnst & Young LLP, independent registered public accounting firm, has audited our consolidated financial statements included in this Annual Report on Form 10-K and, as part of their audit, has issued their report, included herein, on the effectiveness of our internal control over financial reporting.\n/s/ PAT ROCHE\nPat Roche\nChief Executive Officer\n(Principal Executive Officer)\n/s/ JENNIFER WALTER\nJennifer Walter\nVice President,\nChief Financial Officer\n(Principal Financial Officer)\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Moog Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Moog Inc.s internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Moog Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2023 and October 1, 2022, the related consolidated statements of earnings, comprehensive income, shareholders' equity and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and schedule listed in the Index at Item 15(2) and our report dated November 14, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nBuffalo, NY\nNovember 14, 2023 Item 9.\nChanges in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNot applicable. Item 9A.\nControls and Procedures.\nDisclosure Controls and Procedures.\nWe carried out an evaluation, under the supervision and with the participation of our management, including the Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as defined in Exchange Act Rules 13a-15(e) and 15d-15(e). Based on that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that these disclosure controls and procedures are effective as of the end of the period covered by this report, to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms, and that such information is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures.\nManagements Report on Internal Control over Financial Reporting.\nSee the report appearing under Item 8, Financial Statements and Supplemental Data, of this report.\nChanges in Internal Control over Financial Reporting.\nThere have been no changes in our internal control over financial reporting during the most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B.\nOther Information.\nOn November 13, 2023, the Board of Directors adopted and approved Amended and Restated By-laws for the Company, that amended the restated the Company's prior Amended and Restated By-Laws. Among other things, the amendments effected by the Amended and Restated By-laws:\naddress matters relating to Rule 14a-19 promulgated under the Securities Exchange Act of 1934, as amended (the Universal Proxy Rules), including (i) providing that a shareholder delivering a notice of director nomination must specify whether such shareholder intends to use the Universal Proxy Rules and must represent to the Company in writing that such shareholder will comply with the Universal Proxy Rules requirements in connection therewith, (ii) providing the Company a remedy if a shareholder fails to satisfy the Universal Proxy Rules requirements, and (iii) requiring shareholders intending to use the Universal Proxy Rules to provide reasonable evidence of the satisfaction of the requirements under the Universal Proxy Rules at least five business days before the meeting;\nrequire that a shareholder soliciting proxies from other shareholders must use a proxy card color other than white; and\nrevise to permit the Board to establish the term of office for any director for a period less than three years in connection with a director's election or re-election to the Board to accommodate the classification of the Board as contemplated by the Amended and Restated By-laws.\nThe Amended and Restated By-laws also incorporate other ministerial, clarifying and conforming changes. The above description does not purport to be complete and is qualified in its entirety by reference to the full text, which is filed as Exhibit 3.2 to this Annual Report on Form 10-K and incorporated by reference herein.\nDuring the quarter ended September 30, 2023, no director or officer of the Company adopted or terminated a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement, as each term is defined in Item 408 of Regulation S-K.\nItem 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10.\nDirectors, Executive Officers and Corporate Governance.\nInformation concerning the Companys directors required by Item 401 of Regulation S-K will appear under the caption Proposal 1 - Election of Directors in the 2023 Proxy Statement and is incorporated herein by reference. Information concerning the Companys executive officers required by Item 401 of Regulation S-K is presented under the caption Information about our Executive Officers in Part I of this Annual Report on Form 10-K. Information required by Item 405 of Regulation S-K will be included under the caption Security Ownership of Certain Beneficial Owners and Management in the 2023 Proxy Statement and is incorporated herein by reference. Information required by Items 407(d)(4) and (d)(5) of Regulation S-K will be included under the captions Audit Committee and Audit Committee Report in the 2023 Proxy Statement and is incorporated herein by reference.\nWe have adopted a code of ethics that applies to our Chief Executive Officer, Chief Financial Officer and Controller. The code of ethics is available upon request without charge by contacting our Chief Financial Officer at 716-652-2000.\nIn the event that we amend or grant any waiver from a provision of the code of ethics that applies to the principal executive officer, principal financial officer and that requires disclosure under applicable SEC rules, we intend to disclose such amendment or waiver and the reasons on our website. Item 11.\nExecutive Compensation.\nInformation required by Item 402 of Regulation S-K will be included under the captions Compensation Discussion and Analysis, Compensation of Executive Officers, and Compensation of Directors in the 2023 Proxy Statement and is incorporated herein by reference. Information required by Item 407(e)(4) and 407(e)(5) of Regulation S-K will be included under the captions Executive Compensation Committee Interlocks and Insider Participation and The Executive Compensation Committee Report in the 2023 Proxy Statement and is incorporated herein by reference. Item 12.\nSecurity Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nInformation required by Item 201(d) of Regulation S-K will be included under the caption Equity Compensation Plan Information in the 2023 Proxy Statement and is incorporated herein by reference. Information required by Item 403 of Regulation S-K will be included under the caption Security Ownership of Certain Beneficial Owners and Management in the 2023 Proxy Statement and is incorporated herein by reference. Item 13.\nCertain Relationships and Related Transactions, and Director Independence.\nInformation required by Item 404 of Regulation S-K will be included under the caption Related Party Transactions in the 2023 Proxy Statement and is incorporated herein by reference. Information required by Item 407(a) of Regulation S-K will be included under the caption Director Independence in the 2023 Proxy Statement and is incorporated herein by reference. Item 14.\nPrincipal Accountant Fees and Services.\nInformation required by this Item 14 will be included under the caption Audit Fees and Pre-Approval Policy in the 2023 Proxy Statement and is incorporated herein by reference.\nPART IV Item 15.\nExhibits and Financial Statement Schedules.\nDocuments filed as part of this report:\n1 Financial Statements\nConsolidated Statements of Earnings\nConsolidated Statements of Comprehensive Income\nConsolidated Balance Sheets\nConsolidated Statements of Shareholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nReports of Independent Registered Public Accounting Firm*\n*Ernst & Young LLP, PCAOB Firm ID No. 00042.\n2 Financial Statement Schedules\nII.\nValuation and Qualifying Accounts.\nSchedules other than that listed above are omitted because the conditions requiring their filing do not exist or because the required information is included in the Consolidated Financial Statements, including the Notes thereto.\n3 Exhibits\nExhibit No. Exhibit Description Form Filing Date or Filed Herewith\nArticles of Incorporation and By-Laws.\n3.1 Restated Certificate of Incorporation of Moog Inc.\n10-K November 12, 2013\n3.2 Amended and Restated By-laws of Moog Inc., dated November 13, 2023.\nX\nInstruments defining the rights of security holders, including indentures.\n4.1 Indenture between Moog Inc. and MUFG Union Bank, N.A. as Trustee, dated December 13, 2019, relating to the 4.25% Senior Notes due 2027.\n8-K December 13, 2019\n4.2 Description of Registrant's Securities.\n10-K November 12, 2019\nMaterial Contracts\nCredit and Securitization Agreements\n10.1 Amended and Restated Receivables Purchase Agreement, dated November 4, 2021, by and among Moog Receivables LLC, as Seller, Moog Inc. as Master Servicer and Wells Fargo Bank, N.A., as Administrative Agent.\n8-K November 10, 2021\n10.2 First Amendment to the Amended and Restated Receivables Purchase Agreement, dated June 29, 2022, by and among Moog Receivables LLC, as Seller, Moog Inc. as Master Servicer and Wells Fargo Bank, N.A., as Administrative Agent.\nX\n10.3 Second Amendment to the Amended and Restated Receivables Purchase Agreement, dated March 31, 2023, by and among Moog Receivables LLC, as Seller, Moog Inc. as Master Servicer and Wells Fargo Bank, N.A., as Administrative Agent.\nX\n10.4 Sixth Amended and Restated Loan Agreement between Moog Inc. and the Lenders and HSBC Bank USA, National Association, as Administrative Agent for the Lenders dated as of October 27, 2022.\n8-K November 1, 2022\n10.5 Credit Agreement by and between Moog Inc. Stock Employee Compensation Trust and Citizens Bank, N.A. dated July 26, 2018.\nX\n10.6 Third Amendment to the Credit Agreement by and between Moog Inc. Stock Employee Compensation Trust and Citizens Bank, N.A. dated April 21, 2023.\nX\nManagement Contracts or Compensatory Plan or Arrangement\n10.7 2008 Stock Appreciation Rights Plan.\n14A December 10, 2007\n10.8 First Amendment to the Moog Inc. 2008 Stock Appreciation Rights Plan.\n14A December 13, 2012\n10.9 Second Amendment to the Moog Inc. 2008 Stock Appreciation Rights Plan.\n8-K December 26, 2012\n10.10 Form of Stock Appreciation Rights Award Agreement under 2008 Stock Appreciation Rights Plan.\n10-K November 25, 2008\n10.11 2014 Long Term Incentive Plan.\n14A December 12, 2014\n10.12 First Amendment to the Moog Inc. 2014 Long Term Incentive Plan, effective November 17, 2015.\n10-K November 14, 2022\n10.13 Second Amendment to the Moog Inc. 2014 Long Term Incentive Plan, effective November 15, 2016.\n10-K November 14, 2022\n10.14 Third Amendment to the Moog Inc. 2014 Long Term Incentive Plan, effective November 11, 2019.\n10-K November 14, 2022\n10.15 Fourth Amendment to the Moog Inc. 2014 Long Term Incentive Plan, effective November 17, 2020.\n10-K November 14, 2022\n10.16 Fifth Amendment to the Moog Inc. 2014 Long Term Incentive Plan, effective November 16, 2021.\n10-Q January 28, 2022\n10.17 Form of Stock Appreciation Rights Award Agreement under the 2014 Long Term Incentive Plan.\n8-K November 20, 2015\n10.18 Form of Restricted Stock Unit Award Agreement under the 2014 Long Term Incentive Plan.\n8-K November 20, 2015\n10.19 Form of Restricted Stock Unit Award Agreement under the 2014 Long Term Incentive Plan (for awards granted on or after November 15, 2021).\n10-K November 15, 2021\n10.20 Form of Stock Appreciation Rights Award Agreement under the 2014 Long Term Incentive Plan (for awards granted on or after November 15, 2021).\n10-K November 15, 2021\n10.21 Form of Time Vested Award Agreement under the 2014 Long Term Incentive Plan (for awards granted on or after November 17, 2020).\n10-K November 15, 2021\n10.22 Form of Restricted Stock Unit Award Agreement under the 2014 Long Term Incentive Plan (for awards granted on or after November 15, 2022).\n10-Q February 3, 2023\n10.23 Moog Inc. Management Short Term Incentive Plan, dated September 29, 2017.\n8-K October 5, 2017\n10.24 First Amendment to the Moog Inc. Management Short Term Incentive Plan, dated July 26, 2018.\n8-K July 27, 2018\n10.25 Moog Inc. Revised 2021 Management Short Term Incentive Plan, effective October 3, 2021.\n10-K November 15, 2021\n10.26 2023 Management Short Term Incentive Plan.\n10-K November 14, 2022\n10.27 Moog Inc. Deferred Compensation Plan for Directors and Officers, amended and restated effective January 1, 2005.\n10-K November 14, 2022\n10.28 First Amendment to the Moog Inc. Deferred Compensation Plan for Directors and Officers, effective November 16, 2021.\n10-Q January 28, 2022\n10.29 Form of Employment Termination Benefits Agreement between Moog Inc.and Employee-Officers.\n10-K September 25, 1999\n10.30 Form of Employment Termination Benefits Agreement between Moog Inc. and Employee-Officers.\n10-Q April 28, 2023\n10.31 Form of Indemnification Agreement for officers, directors and key employees.\n8-K November 30, 2004\n10.32 Moog Inc. Plan to Equalize Retirement Income and Supplemental Retirement Plan dated August 9, 2017.\n8-K August 11, 2017\n10.33 Defined Contribution Supplemental Executive Retirement Plan, dated March 4, 2016.\n10-Q May 2, 2016\n10.34 First Amendment to the Defined Contribution Supplemental Executive Retirement Plan, dated July 26, 2018.\n10-Q July 27, 2018\n10.35 Moog Inc. Retirement Savings Restoration Plan.\n10-K November 14, 2022\nFirst Amendment to the Moog Inc.Retirement Savings Restoration Plan.\n10-K November 14, 2022\n10.36 Other Material Contracts\n10.37 Moog Inc. Supplemental Retirement Plan Trust, as amended and restated, effective January 1, 2015.\n10-Q May 4, 2015\n10.38 Moog Inc. Stock Employee Compensation Trust Agreement amended and restated as of August 13, 2014.\n10-Q February 3, 2015\n10.39 Amendment No.1 to the Moog Inc. Stock Employee Compensation Trust Agreement, dated May 8, 2018.\n10-Q July 27, 2018\nOther Exhibits\n21 Registrant Subsidiary Listing.\nX\n23 Consent of Ernst & Young LLP.\nX\n97 Moog Inc. Compensation Clawback Policy, dated November 2023.\nX\nExecutive Certifications\n31.1 Certification of Chief Executive Officer pursuant to Exchange Act Rule 13a-14(a) as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n31.2 Certification of Chief Financial Officer pursuant to Exchange Act Rule 13a-14(a) as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nX\n32.1 Certification pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nX\nInteractive Data Files\n101.INS XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document. X\n101.SCH XBRL Taxonomy Extension Schema Document. X\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document. X\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document. X\n101.LAB XBRL Taxonomy Extension Label Linkbase Document. X\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document. X\n104 Cover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document and are contained within Exhibit 101. X\nAll of the exhibits listed above have been filed under Moog Inc., Securities and Exchange Commission file number 1-05129.\nItem 16.\nForm 10-K Summary.\nNone.\nValuation and Qualifying Accounts\n(dollars in thousands)\nSchedule II\nAdditions Foreign\nBalance at charged to exchange Balance\nbeginning expenses and impact at end\nDescription of year other accounts Deductions* and other of year\nFiscal year ended October 2, 2021\nContract reserves $ 72,412 $ 41,572 $ 55,377 $ 250 $ 58,857\nAllowance for credit losses 6,313 2,245 4,238 31 4,351\nReserve for inventory valuation 153,311 26,513 25,151 982 155,655\nDeferred tax valuation allowance 14,784 2,513 3,729 328 13,896\nFiscal year ended October 1, 2022\nContract reserves $ 58,857 $ 23,607 $ 35,099 $ (818) $ 46,547\nAllowance for credit losses 4,351 1,686 1,083 (346) 4,608\nReserve for inventory valuation 155,655 25,252 33,876 (6,426) 140,605\nDeferred tax valuation allowance 13,896 - 4,598 (648) 8,650\nFiscal year ended September 30, 2023\nContract reserves $ 46,547 $ 94,829 $ 96,046 $ (73) $ 45,257\nAllowance for credit losses 4,608 1,786 2,200 (184) 4,010\nReserve for inventory valuation 140,605 20,286 21,336 2,244 141,799\nDeferred tax valuation allowance 8,650 2,454 4,254 (420) 6,430\n* Includes the effects of divestitures.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMoog Inc.\n(Registrant)\nBy /s/ PAT ROCHE\nPat Roche\nChief Executive Officer\nDate: November 14, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on November 14, 2023.\n/s/ PAT ROCHE /s/ WILLIAM G. GISEL, JR.\nPat Roche William G. Gisel, Jr.\nChief Executive Officer Director\n(Principal Executive Officer)\nDirector\n/s/ JENNIFER WALTER /s/ PETER J. GUNDERMANN\nJennifer Walter Peter J. Gundermann\nVice President and Chief Financial Officer Director\n(Principal Financial Officer)\n/s/ MICHAEL J. SWOPE /s/ KRAIG H. KAYSER\nMichael J. Swope Kraig H. Kayser\nController Director\n(Principal Accounting Officer)\n/s/ JOHN R. SCANNELL /s/ BRIAN J. LIPKE\nJohn R. Scannell Brian J. Lipke\nChairman of the Board and Director Director\n/s/ JANET M. COLETTI /s/ MAHESH NARANG\nJanet M. Coletti Mahesh Narang\nDirector Director\n/s/ DONALD R. FISHBACK /s/ BRENDA L. REICHELDERFER\nDonald R. Fishback Brenda L. Reichelderfer\nDirector Director"
}