{
    "cik": "69422",
    "company": "INTERGROUP CORP",
    "filing_type": "10-K",
    "filing_date": "2023-10-16",
    "period_of_report": "2023-06-30",
    "sic": "6513",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/69422/0001493152-23-037253-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/69422/000149315223037253/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/69422/0001493152-23-037253.txt",
    "filename": "69422_10K_2023_0001493152-23-037253.htm",
    "content": "Item 1. Business.\nGENERAL\nThe InterGroup Corporation (InterGroup or the Company and may also be referred to as we us or our in this report) is a Delaware corporation formed in 1985, as the successor to Mutual Real Estate Investment Trust (M-REIT), a New York real estate investment trust created in 1965. The Company has been a publicly held company since M-REITs first public offering of shares in 1966.\nThe Company was organized to buy, develop, operate, rehabilitate, and dispose of real property of various types and descriptions, and to engage in such other business and investment activities as would benefit the Company and its shareholders. The Company was founded upon, and remains committed to, social responsibility. Such social responsibility was originally defined as providing decent and affordable housing to people without regard to race. In 1985, after examining the impact of federal, state, and local equal housing laws, the Company determined to broaden its definition of social responsibility. The Company changed its form from a REIT to a corporation so that it could pursue a variety of investments beyond real estate and broaden its social impact to engage in any opportunity which would offer the potential to increase shareholder value within the Companys underlying commitment to social responsibility.\nAs of June 30, 2023, InterGroup owns approximately 75.7% of the outstanding common shares of Portsmouth. As of June 30, 2023, the Companys President, Chairman of the Board and Chief Executive Officer, John Winfield, owns approximately 2.5% of the outstanding common shares of Portsmouth. Mr. Winfield also serves as the Chairman of the Board and Chief Executive Officer of Portsmouth. The Companys Chief Operating Officer, David Gonzalez was elected President of Portsmouth in May 2021.\nPortsmouths primary business was conducted through its general and limited partnership interest in Justice Investors Limited Partnership, a California limited partnership (Justice or the Partnership). Portsmouth received management fees as a general partner of Justice for its services in overseeing and managing the Partnerships assets. Those fees were eliminated in consolidation. Effective July 15, 2021, Portsmouth completed the purchase of 100% of the limited partnership interest of Justice through the acquisition of the remaining 0.7% non-controlling interest.\nEffective December 23, 2021, The partnership was dissolved. The financial statements of Justice were consolidated with those of the Company.\nPrior to its dissolution effective December 23, 2021, Justice owned and operated a 544-room hotel property located at 750 Kearny Street, San Francisco California, known as the Hilton San Francisco Financial District (the Hotel) and related facilities including a five-level underground parking garage through its subsidiaries Justice Operating Company, LLC (Operating) and Justice Mezzanine Company, LLC (Mezzanine). Mezzanine was a wholly owned subsidiary of the Partnership; Operating is a wholly owned subsidiary of Mezzanine. Effective December 23, 2021, Portsmouth replaced Justice as the single member of Mezzanine. Mezzanine is the borrower under certain mezzanine indebtedness of Justice, and in December 2013, the Partnership conveyed ownership of the Hotel to Operating. The Hotel is a full-service Hilton brand hotel pursuant to a Franchise License Agreement with HLT Franchise Holding LLC (Hilton) through January 31, 2030.\nIn addition to the operations of the Hotel, the Company also generates income from the ownership, management and, when appropriate, sale of real estate. Properties include sixteen apartment complexes, one commercial real estate property and three single-family houses. The properties are located throughout the United States but are concentrated in Texas and the County of Los Angeles, California. The Company also has an investment in unimproved real property. As of June 30, 2023, all the Companys operating real estate properties are managed in-house.\nThe Company acquires its investments in real estate and other investments utilizing cash, securities, or debt, subject to approval or guidelines of the Board of Directors and its Executive Strategic Real Estate and Securities Investment Committee. The Company may also look for new real estate investment opportunities in hotels, apartments, office buildings and development properties. The acquisition of any new real estate investments will depend on the Companys ability to find suitable investment opportunities and the availability of sufficient financing to acquire such investments. To help fund any such acquisition, the Company may borrow funds to leverage its investment capital. The amount of any such debt will depend on several factors including, but not limited to, the availability of financing and the sufficiency of the acquisition propertys projected cash flows to support the operations and debt service.\nThe Company also may derive income from the investment of its cash and investment securities assets. The Company has invested in income-producing instruments, equity and debt securities and will consider other investments if such investments offer growth or profit potential. See Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations for a discussion of the Companys marketable securities and other investments.\nHILTON HOTELS FRANCHISE LICENSE AGREEMENT\nThe Partnership entered into a Franchise License Agreement (the License Agreement) with the HLT Existing Franchise Holding LLC (Hilton) on December 10, 2004. The term of the License Agreement was for an initial period of fifteen years commencing on the date the Hotel began operating as a Hilton hotel, with an option to extend the License Agreement for another five years, subject to certain conditions. On June 26, 2015, Operating and Hilton entered into an amended franchise agreement that, among other things, extended the License Agreement through 2030, and provided the Partnership with certain key money cash incentives to be earned through 2030.\nHOTEL MANAGEMENT COMPANY AGREEMENT\nOperating entered into a hotel management agreement (HMA) with Aimbridge Hospitality (Aimbridge) to manage the Hotel, along with its five-level parking garage, with an effective date of February 3, 2017. The term of the management agreement is for an initial period of ten years commencing on the February 3, 2017 date and automatically renews for successive one (1) year periods, not to exceed five years in the aggregate, subject to certain conditions. Under the terms on the HMA, base management fee (Basic Fee) payable to Aimbridge shall be one and seven-tenths percent (1.70%) of total Hotel revenue. In addition to the Basic Fee, Aimbridge shall be entitled to an annual incentive fee for each fiscal year equal to ten percent (10%) of the amount by which Gross Operating Profit in the current fiscal year exceeds the previous fiscal years Gross Operating Profit.\nFor the fiscal years ended June 30, 2023 and 2022, hotel management fees were $711,000 and $530,000, and incentive fees of $505,000 and $525,000, respectively, offset by key money amortization of $250,000 for both years and are included in Hotel operating expenses in the consolidated statements of operations. As part of the Hotel management agreement, Aimbridge, through the Companys wholly owned subsidiary, Kearny Street Parking LLC, manages the parking garage in-house.\nCHINESE CULTURE FOUNDATION LEASE\nOn March 15, 2005, the Hotel entered into an amended lease with the Chinese Culture Foundation of San Francisco (the Foundation) for the third-floor space of the Hotel commonly known as the Chinese Culture Center, which the Foundation had right to occupy pursuant to a 50-year nominal rent lease that began in 1967.\nThe amended lease, among other things, requires the Hotel to pay to the Foundation a monthly event space fee in the amount of $5,000, adjusted annually based on the local Consumer Price Index. As of June 30, 2023, the monthly event space fee is $7,131. The term of the amended lease expires on October 17, 2023, with an automatic extension for another 10-year term if the property continues to be operated as a hotel. Subject to certain conditions as set forth in the amended lease, the Foundation is entitled to reserve a maximum of 75 days per calendar year for use of the event space. If the Hotel needs the event space during one of the dates previously reserved by the Foundation, the Hotel shall pay the Foundation $4,000 per day for using the event space. During the fiscal years ended June 30, 2023 and 2022, the Hotel paid the Foundation $20,000 and $12,000 for such fees, respectively.\nSALES AND REFINANCING OF REAL ESTATE PROPERTIES\nIn July 2021, the Company refinanced three of its California properties existing mortgages totaling $1,065,000 with three new mortgages totaling $3,450,000. The Company generated net proceeds totaling $2,325,000 as a result of the refinancing. The interest rate on the three new mortgages is fixed at 3.50% for five years and the mortgages mature in July 2051. In July 2021, the Company obtained a mortgage note payable on one of its California properties for $830,000. The Company received net proceeds of $836,000 which exceeded the new loan amount by $6,000 due to advanced deposits made by the Company prior to closing. The interest rate on the mortgage is fixed at 3.50% for five years and the mortgage note payable matures in August 2051.\nOn October 14, 2021, the Company refinanced its $15,900,000 mortgage note payable on its 358-unit apartment complex in Irving, Texas and obtained a new mortgage note payable for $28,800,000. The Company received net proceeds of $12,938,000 as a result of the refinance. The annual interest rate on the mortgage is fixed at 2.95% for ten years with interest-only payments for the first five years and 30-year amortization thereafter. The mortgage loan matures in November 2031.\nOn June 30, 2022, the Company refinanced its $5,283,000 mortgage note payable on its 30-unit apartment complex in West Los Angeles, California and obtained a new mortgage note payable for $5,850,000. The Company received net proceeds of $584,000 as a result of the refinance. The annual interest rate on the mortgage is fixed at 4.4% for the first five years and 5.44% thereafter. The mortgage loan matures in July 2052.\nOn May 31, 2023, the Company refinanced its $4,823,000 mortgage note payable on its 264-unit apartment complex in St Louis, Missouri and obtained a new two year mortgage for $5,360,000. The Company deposited the existing cash in escrow for Capital Expenditure Reserve of $616,000 and $244,000 in Additional Reserve for taxes and insurance. The mortgage has a floating monthly rate of 30-day SOFR (capped at 5.5%) plus SOFR margin of 3.10% interest-only payments are due for the 12 months and $5,500 principal paydowns commencing in June 2024. The mortgage loan matures in May 2025.\nMARKETABLE SECURITIES INVESTMENT POLICIES\nIn addition to its Hotel and real estate operations, the Company also invests from time to time in income producing instruments, corporate debt and equity securities, publicly traded investment funds, mortgage-backed securities, securities issued by REITs and other companies which invest primarily in real estate.\nThe Companys securities investments are made under the supervision of an Executive Strategic Real Estate and Securities Investment Committee of the Board of Directors (the Committee). The Committee currently has three members and is chaired by the Companys Chairman of the Board and President, John V. Winfield. The Committee has delegated authority to manage the portfolio to the Companys Chairman and President together with such assistants and management committees he may engage. The Committee generally follows certain established investment guidelines for the Companys investments. These guidelines presently include: (i) corporate equity securities should be listed on the New York Stock Exchange (NYSE), NYSE MKT, NYSE Arca or the Nasdaq Stock Market (NASDAQ); (ii) the issuer of the listed securities should be in compliance with the listing standards of the applicable national securities exchange; and (iii) investment in a particular issuer should not exceed 10% of the market value of the total portfolio. The investment guidelines do not require the Company to divest itself of investments, which initially meet these guidelines but subsequently fail to meet one or more of the investment criteria. The Committee has in the past approved non-conforming investments and may in the future approve non-conforming investments. The Committee may modify these guidelines from time to time.\nThe Company may also invest, with the approval of the Committee, in unlisted securities, such as convertible notes, through private placements including private equity investment funds. Those investments in non-marketable securities are carried at cost on the Companys consolidated balance sheets as part of Other Assets, net and reviewed for impairment on a periodic basis.\nAs part of its investment strategies, the Company may assume short positions in marketable securities. Short sales are used by the Company to potentially offset normal market risks undertaken in the course of its investing activities or to provide additional return opportunities. As of June 30, 2023 and 2022, the Company had obligations for securities sold (equities short) of $1,416,000 and $449,000, respectively.\nThe Company may utilize margin for its marketable securities purchases through the use of standard margin agreements with national brokerage firms. The margin used by the Company may fluctuate depending on market conditions. The use of leverage could be viewed as risky, and the market values of the portfolio may be subject to large fluctuations. Margin balances due as of June 30, 2023 and 2022 were $1,601,000 and $490,000, respectively.\nAs Chairman of the Executive Strategic Real Estate and Securities Investment Committee, the Companys President and Chief Executive Officer (CEO), John V. Winfield, directs the investment activity of the Company in public and private markets pursuant to authority granted by the Board of Directors. Mr. Winfield also serves as Chief Executive Officer and Chairman of the Board of Portsmouth and oversees the investment activity of Portsmouth. Effective June 2016, Mr. Winfield became the Managing Director of Justice and served in that position until the dissolution of Justice in December 2021. Depending on certain market conditions and various risk factors, the Chief Executive Officer, and Portsmouth, at times, invest in the same companies in which the Company invests. Such investments align the interests of the Company with the interests of related parties because it places the personal resources of the Chief Executive Officer and the resources of Portsmouth, at risk in substantially the same manner as the Company in connection with investment decisions made on behalf of the Company.\nFurther information with respect to investment in marketable securities and other investments of the Company is set forth in Management Discussion and Analysis of Financial Condition and Results of Operations section and Notes 5 and 6 of the Notes to Consolidated Financial Statements.\nSEASONALITY\nHistorically, the Hotels operation has been seasonal under normal circumstances. Like most hotels in the San Francisco area, the Hotel generally maintained high occupancy and room rates during the entire year except for the weeks starting from Thanksgiving to first week of January due to the holiday season. These seasonal patterns can be expected to cause fluctuations in the quarterly revenues of the Hotel. See Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations for more information regarding the effects on our results of operations.\nCOMPETITION\nThe Hotel has navigated this very competitive market nimbly and has consistently been ranked the number one hotel in its Competitive Set (CompSet) based on our ability to drive occupancy. During 2021 and first part of calendar 2022, we took advantage of the slow periods to make certain capital improvements including complete refinishing of all guest room furniture, resurfacing half of the hotel bathtubs that needed repair, refreshed meeting space and lobby paint and vinyl, replaced all bed frames and socks, and completed the carpet and wall covering corridor installation. In November 2022, we began our guestroom renovation and had completed approximately 200 guestrooms as of June 30, 2023. Hotel improvements are ongoing to remain competitive and we anticipate completing the guestroom renovations by the end March 2024.\nAs of the date of this report, the competition for business is very strong as there still hasnt been a rebound close to 2019 for the overall San Francisco market. The fiscal year ending June 30, 2023, the Hotels Competitive Set (CompSet) was running 64% occupancy and average daily rate of $236 for a RevPAR of $152. The Hotel has fared drastically better than its CompSet by aggressively pursuing all segments and opening all channels on off peak days and limiting access over peak demand dates. At the end of fiscal year ending June 30, 2023, the Hotel was running occupancy of 83% including the vacancy of the Out Of Order rooms of about 13% at $195 average daily rate for a RevPAR of $161, giving the Hotel a RevPAR index of 106%.\nThe Hotels location in the San Francisco Financial District historically had provided greater opportunities over its competitors when it comes to developing relationships with the Financial District entities and the customers who regularly do business in the downtown area. With limited business travel to San Francisco for the time, we are competing with hotels in more tourist attracting locations and amenities for the leisure traveler. The ability to capitalize on the strong midweek demand of the individual business traveler to the Financial District has been the focus during the timeframe of strong growth in the market. The shift to attracting leisure travel has pushed the hotel to price aggressively to lure competition from the more tourist locations in San Francisco.\nThe Hotel is also subject to certain operating risks common to all of the hotel industry, which could adversely impact performance. These risks include, but are not limited to:\n● Competition for guests and meetings from other hotels including competition and pricing pressure from internet wholesalers and distributors;\n● increases in operating costs, including wages, benefits, insurance, property taxes and energy, due to inflation and other factors, which may not be offset in the future by increased room rates;\n● labor strikes, disruptions or lock outs;\n● dependence on demand from business and leisure travelers, which may fluctuate and is seasonal;\n● increases in energy costs, cost of fuel, airline fares and other expenses related to travel, which may negatively affect traveling;\n● terrorism, terrorism alerts and warnings, wars and other military actions, pandemics or other medical events or warnings which may result in decreases in business and leisure travel;\n● natural disasters; and\n● adverse effects of downturns and recessionary conditions in international, national and/or local economies and market conditions.\nENVIRONMENTAL MATTERS\nIn connection with the ownership of the Hotel, the Company is subject to various federal, state and local laws, ordinances and regulations relating to environmental protection. Under these laws, a current or previous owner or operator of real estate may be liable for the costs of removal or remediation of certain hazardous or toxic substances on, under or in such property. Such laws often impose liability without regard to whether the owner or operator knew of, or was responsible for, the presence of hazardous or toxic substances.\nEnvironmental consultants retained by Justice and its lenders conducted updated Phase I environmental site assessments in fiscal year ended June 30, 2014 on the Hotel property. These Phase I assessments relied, in part, on Phase I environmental assessments prepared in connection with the Partnerships first mortgage loan obtained in December 2013. Phase I assessments are designed to evaluate the potential for environmental contamination on properties based generally upon site inspections, facility personnel interviews, historical information, and certain publicly available databases; however, Phase I assessments will not necessarily reveal the existence or extent of all environmental conditions, liabilities or compliance concerns at the properties.\nAlthough the Phase I assessments and other environmental reports we have reviewed disclose certain conditions on our property and the use of hazardous substances in operation and maintenance activities that could pose a risk of environmental contamination or liability, we are not aware of any environmental liability that we believe would have a material adverse effect on our business, financial position, results of operations or cash flows.\nThe Company believes that the Hotel is in compliance, in all material respects, with all federal, state and local environmental ordinances and regulations regarding hazardous or toxic substances and other environmental matters, the violation of which could have a material adverse effect on the Company. The Company has not received written notice from any governmental authority of any material noncompliance, liability or claim relating to hazardous or toxic substances or other environmental matters in connection with any of its present properties.\nCompetition - Rental Properties\nThe ownership, operation, and leasing of multifamily rental properties are highly competitive. The Company competes with domestic and foreign financial institutions, REITs, life insurance companies, pension trusts, trust funds, partnerships and individual investors. In addition, The Company competes for tenants in markets primarily on the basis of property location, rent charged, services provided and the design and condition of improvements. The Company also competes with other quality apartments owned by public and private companies. The number of competitive multifamily properties in a particular market could adversely affect the Companys ability to lease its multifamily properties, as well as the rents it is able to charge. In addition, other forms of residential properties, including single family housing and town homes, provide housing alternatives to potential residents of quality apartment communities or potential purchasers of for-sale condominium units. The Company competes for residents in its apartment communities based on resident service and amenity offerings and the desirability of the Companys locations. Resident leases at the Companys apartment communities are priced competitively based on market conditions, supply and demand characteristics, and the quality and resident service offerings of its communities.\nEMPLOYEES\nAs of June 30, 2023, the Companys corporate office and multifamily operations had 32 employees. Effective August 2014, the Company entered into a client service agreement with Automatic Data Processing (ADP), a professional employer organization serving as an off-site, full-service human resource department for its employees. ADP personnel management services are delivered by entering into a co-employment relationship with the Companys employees. The employees and the Company are not party to any collective bargaining agreement, and the Company believes that its employee relations are satisfactory.\nThe hotel operations had 187 employees as of June 30, 2023. On February 3, 2017, Aimbridge assumed all labor union agreements and Justice provides all funding for all payroll and related costs. As of June 30, 2023, approximately 90% of those employees were represented by one of three labor unions, and their terms of employment were determined under various collective bargaining agreements (CBAs) to which Aimbridge was a party. CBA for Local 2 (Hotel and Restaurant Employees) expired on August 13, 2022 and a new MOU was signed June 26, 2023. CBA for Local 856 (International Brotherhood of Teamsters) expired on December 31, 2022 and a new agreement was signed on April 26, 2023. CBA for Local 39 (Stationary Engineers) will expire on July 31, 2024.\nNegotiation of collective bargaining agreements, which includes not just terms and conditions of employment, but scope and coverage of employees, is a regular and expected course of business operations for the Partnership and Aimbridge. The Partnership expects and anticipates that the terms of conditions of CBAs will have an impact on wage and benefit costs, operating expenses, and certain hotel operations during the life of each CBA and incorporates these principles into its operating and budgetary practices.\nADDITIONAL INFORMATION\nThe Company files required annual and quarterly reports on Forms 10-K and 10-Q, current reports on Form 8-K and other information with the Securities and Exchange Commission (SEC or the Commission). The public may read and copy any materials that we file with the Commission at the SECs Public Reference Room at 100 F Street, NE, Washington, DC 20549, on official business days during the hours of 10:00 a.m. to 3:00 p.m. You may obtain information on the operation of the Public Reference Room by calling the Commission at 1-800-SEC-0330. The Commission also maintains an Internet site at http://www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the Commission.\nOther information about the Company can be found on its website www.intgla.com. Reference in this document to that website address does not constitute incorporation by reference of the information contained on the website. Item 1A. Risk Factors.\nAdverse changes in the U.S. and global economies could negatively impact our financial performance.\nDue to a number of factors affecting consumers, the outlook for the lodging industry remains uncertain. These factors have resulted at times in the past and could continue to result in the future in fewer customers visiting, or customers spending less, in San Francisco, as compared to prior periods. The macro-economic situation of a looming US/Global recession has seen business reducing or eliminating typical travel and group meetings in efforts to be conservative in uncertain financial times. Leisure travel and other leisure activities represent discretionary expenditures, and participation in such activities tends to decline during economic downturns, during which consumers generally have less disposable income. As a result, in those times customer demand for the luxury amenities and leisure activities that we offer may decline. Furthermore, during periods of economic contraction, revenues may decrease while some of our costs remain fixed or even increase, resulting in decreased earnings.\nWeakened global economic conditions may adversely affect our industry, business, and results of operations.\nOur overall performance depends in part on worldwide economic conditions, which could adversely affect the tourism industry. According to current economic news reports, the United States and other key international economies may be subject to a recession, characterized by falling demand for a variety of goods and services, restricted credit, going concern threats to financial institutions, major multinational companies and medium and small businesses, poor liquidity, declining asset values, reduced corporate profitability, and volatility in credit, equity and foreign exchange markets. These conditions affect discretionary and leisure spending and could adversely affect our customers ability or willingness to travel to destinations for leisure and cutback on discretionary business travel, which could adversely affect our operating results. In addition, in a weakened economy, companies that have competing properties may reduce room rates and other prices which could also reduce our average revenues and harm our operating results.\nWe operate a single property located in San Francisco and rely on the San Francisco market. Changes adversely impacting this market could have a material effect on our business, financial condition, results of operations, and fair market value of the Hotel.\nOur business in San Francisco and the hospitality industry has a limited base of operations and substantially all of our revenues are currently generated by the Hotel in San Francisco, California. Accordingly, we are subject to greater risks than a more diversified hotel or resort operator and the profitability of our operations is linked to local economic conditions in San Francisco. The combination of a decline in the local economy of San Francisco, reliance on a single location and the significant investment associated with it may cause our operating results to fluctuate significantly and may adversely affect us and materially affect our total profitability.\nWe face intense local and increasingly national competition which could impact our operations and adversely affect our business and the results of operations.\nWe operate in the highly competitive San Francisco hotel industry. The Hotel competes with other high-quality Northern California hotels and resorts. Many of these competitors seek to attract customers to their properties by providing food and beverage outlets, retail stores and other related amenities, in addition to recently renovated hotel accommodations. To the extent that we seek to enhance our revenue base by offering our own various amenities, we compete with the service offerings provided by these competitors.\nMany of the competing properties have themes and attractions which draw a significant number of visitors and directly compete with our operations. Some of these properties are operated by subsidiaries or divisions of large public companies that may have greater name recognition and financial and marketing resources than we do and market to the same target demographic group as we do. Various competitors are expanding and renovating their existing facilities. We believe that competition in the San Francisco hotel and resort industry is based on certain property-specific factors, including overall atmosphere, range of amenities, price, location, technology infrastructure, entertainment attractions, theme and size. Any market perception that we do not excel with respect to such property-specific factors could adversely affect our ability to compete effectively. If we are unable to compete effectively, we could lose market share, which could adversely affect our business and results of operations.\nThe San Francisco hotel and resort industry is capital intensive; financing our renovations and future capital improvements could reduce our cash flow and adversely affect our financial performance.\nThe Hotel has an ongoing need for renovations and other capital improvements to remain competitive, including replacement, from time to time, of furniture, fixtures and equipment. We will also need to make capital expenditures to comply with applicable laws and regulations.\nRenovations and other capital improvements of hotels require significant capital expenditures. In addition, renovations and capital improvements of hotels usually generate little or no cash flow until the projects completion. We may not be able to fund such projects solely from cash provided from our operating activities. Consequently, we will rely upon the availability of debt or equity capital and reserve funds to fund renovations and capital improvements and our ability to carry them out will be limited if we cannot obtain satisfactory debt or equity financing, which will depend on, among other things, market conditions. No assurances can be made that we will be able to obtain additional equity or debt financing or that we will be able to obtain such financing on favorable terms.\nRenovations and other capital improvements may give rise to the following additional risks, among others: construction cost overruns and delays; increased prices of materials due to tariffs; temporary closures of all or a portion of the Hotel to customers; disruption in service and room availability causing reduced demand, occupancy and rates; and possible environmental issues.\nAs a result, renovations and any other future capital improvement projects may increase our expenses, reduce our cash flows and our revenues. If capital expenditures exceed our expectations, this excess would have an adverse effect on our available cash.\nWe have substantial debt, and we may incur additional indebtedness, which may negatively affect our business and financial results.\nWe have substantial debt service obligations. Our substantial debt may negatively affect our business and operations in several ways, including: requiring us to use a substantial portion of our funds from operations to make required payments on principal and interest, which will reduce funds available for operations and capital expenditures, future business opportunities and other purposes; making us more vulnerable to economic and industry downturns and reducing our flexibility in responding to changing business and economic conditions; limiting our flexibility in planning for, or reacting to, changes in the business and the industry in which we operate; placing us at a competitive disadvantage compared to our competitors that have less debt; limiting our ability to borrow more money for operations, capital or to finance acquisitions in the future; and requiring us to dispose of assets, if needed, in order to make required payments of interest and principal.\nThe debt agreement that governs our outstanding indebtedness due January 2024 could result in our being required to repay these borrowings on their due date. If we are forced to refinance these borrowings on less favorable terms or are unable to refinance these borrowings, the Hotel financial condition and results of operations could be adversely affected.\nOur business model involves high fixed costs, including property taxes and insurance costs, which we may be unable to adjust in a timely manner in response to a reduction in our revenues.\nThe costs associated with owning and operating the Hotel are significant. Some of these costs (such as property taxes and insurance costs) are fixed, meaning that such costs may not be altered in a timely manner in response to changes in demand for services. Failure to adjust our expenses may adversely affect our business and results of operations. Our real property taxes may increase as property tax rates change and as the values of properties are assessed and reassessed by tax authorities. Our real estate taxes do not depend on our revenues, and generally we could not reduce them other than by disposing of our real estate assets.\nInsurance premiums have increased significantly in recent years, and continued escalation may result in our inability to obtain adequate insurance at acceptable premium rates. A continuation of this trend would appreciably increase the operating expenses of the Hotel. If we do not obtain adequate insurance, to the extent that any of the events not covered by an insurance policy materialize, our financial condition may be materially adversely affected.\nIn the future, our property may be subject to increases in real estate and other tax rates, utility costs, operating expenses, insurance costs, repairs and maintenance and administrative expenses, which could reduce our cash flow and adversely affect our financial performance. If our revenues decline and we are unable to reduce our expenses in a timely manner, our business and results of operations could be adversely affected.\nRisk of declining market values in marketable securities.\nThe Company invests from time to time in marketable securities. As a result, the Company is exposed to market volatility in connection with these investments. The Companys financial position and financial performance could be adversely affected by worsening market conditions or sluggish performance of such investments.\nIlliquidity risk in nonmarketable securities.\nNonmarketable securities are, by definition, instruments that are not readily salable in the capital markets, and when sold are usually at a substantial discount. Thus, the holder is limited to return on investment from any income producing feature of the instrument, as any sale of such an instrument would be subject to a substantial discount. Thus, a holder may need to hold such instruments for long period of time and not be able to realize a return of their cash investment should there be a need to liquidate to obtain cash at any given time.\nLitigation and legal proceedings could expose us to significant liabilities and thus negatively affect our financial results.\nWe are a party, from time to time, to various litigation claims and legal proceedings, government and regulatory inquiries and/or proceedings, including, but not limited to, intellectual property, premises liability and breach of contract claims. Material legal proceedings are described more fully in Note 17, Commitments and Contingencies, to our consolidated financial statements, included in Item 8 of this Annual Report on Form 10-K.\nLitigation is inherently unpredictable and defending these proceedings can result in significant ongoing expenditures and the diversion of our managements time and attention from the operation of our business, which could have a negative effect on our business operations. Our failure to successfully defend or settle any litigation or legal proceedings could result in liabilities that, to the extent not covered by our insurance, could have a material adverse effect on our financial condition, revenue and profitability.\nThe threat of terrorism could adversely affect the number of customer visits to the Hotel.\nThe threat of terrorism has caused, and may in the future cause, a significant decrease in customer visits to San Francisco due to disruptions in commercial and leisure travel patterns and concerns about travel safety. We cannot predict the extent to which disruptions in air or other forms of travel as a result of any further terrorist act, outbreak of hostilities or escalation of war would adversely affect our financial condition, results of operations or cash flows. The possibility of future attacks may hamper business and leisure travel patterns and, accordingly, the performance of our business and our operations.\nWe depend in part, on third party management companies for the future success of our business and the loss of one or more of their key personnel could have an adverse effect on our ability to manage our business and operate successfully and competitively or could be negatively perceived in the capital markets.\nThe Hotel is managed by Aimbridge. Their ability to manage the Hotel and to operate successfully and competitively is dependent, in part, upon the efforts and continued service of their managers. The departure of key personnel of current or future management companies could have an adverse effect on our business and our ability to operate successfully and competitively, and it could be difficult to find replacements for these key personnel, as competition for such personnel is intense.\nSeasonality and other related factors such as weather can be expected to cause quarterly fluctuations in revenue at the Hotel.\nThe hotel and resort industry are seasonal in nature. This seasonality can tend to cause quarterly fluctuations in revenues at the Hotel. Our quarterly earnings may also be adversely affected by other related factors outside our control, including weather conditions and poor economic conditions. As a result, we may have to enter into short-term borrowings in certain quarters in order to offset these quarterly fluctuations in our revenues.\nThe hotel industry is heavily regulated and failure to comply with extensive regulatory requirements may result in an adverse effect on our business.\nThe hotel industry is subject to extensive regulation and the Hotel must maintain its licenses and pay taxes and fees to continue operations. Our property is subject to numerous laws, including those relating to the preparation and sale of food and beverages, including alcohol. We are also subject to laws governing our relationship with our employees in such areas as minimum wage and maximum working hours, overtime, working conditions, hiring and firing employees and work permits. Also, our ability to remodel, refurbish or add to our property may be dependent upon our obtaining necessary building permits from local authorities. The failure to obtain any of these permits could adversely affect our ability to increase revenues and net income through capital improvements of our property. In addition, we are subject to the numerous rules and regulations relating to state and federal taxation. Compliance with these rules and regulations requires significant management attention. Furthermore, compliance costs associated with such laws, regulations and licenses are significant. Any change in the laws, regulations or licenses applicable to our business or a violation of any current or future laws or regulations applicable to our business or gaming license could require us to make substantial expenditures or could otherwise negatively affect our gaming operations. Any failure to comply with all such rules and regulations could subject us to fines or audits by the applicable taxation authority.\nViolations of laws could result in, among other things, disciplinary action. If we fail to comply with regulatory requirements, this may result in an adverse effect on our business.\nUninsured and underinsured losses could adversely affect our financial condition and results of operations.\nThere are certain types of losses, generally of a catastrophic nature, such as earthquakes and floods or terrorist acts, which may be uninsurable or not economically insurable, or may be subject to insurance coverage limitations, such as large deductibles or co-payments. We will use our discretion in determining amounts, coverage limits, deductibility provisions of insurance and the appropriateness of self-insuring, with a view to maintaining appropriate insurance coverage on our investments at a reasonable cost and on suitable terms. Uninsured and underinsured losses could harm our financial condition and results of operations. We could incur liabilities resulting from loss or injury to the Hotel or to persons at the Hotel. Claims, whether or not they have merit, could harm the reputation of the Hotel or cause us to incur expenses to the extent of insurance deductibles or losses in excess of policy limitations, which could harm our results of operations.\nIn the event of a catastrophic loss, our insurance coverage may not be sufficient to cover the full current market value or replacement cost of our lost investment. Should an uninsured loss or a loss in excess of insured limits occur, we could lose all or a portion of the capital we have invested in the Hotel, as well as the anticipated future revenue from the property. In that event, we might nevertheless remain obligated for any mortgage debt or other financial obligations related to the Hotel. In the event of a significant loss, our deductible may be high, and we may be required to pay for all such repairs and, therefore, it could materially adversely affect our financial condition. Inflation, changes in building codes and ordinances, environmental considerations and other factors might also keep us from using insurance proceeds to replace or renovate the Hotel after it has been damaged or destroyed. Under those circumstances, the insurance proceeds we receive might be inadequate to restore our economic position on the damaged or destroyed property.\nIt has generally become more difficult and expensive to obtain property and casualty insurance, including coverage for terrorism. When our current insurance policies expire, we may encounter difficulty in obtaining or renewing property or casualty insurance on our property at the same levels of coverage and under similar terms. Such insurance may be more limited and for some catastrophic risks (for example, earthquake, flood and terrorism) may not be generally available at current levels. Even if we can renew our policies or to obtain new policies at levels and with limitations consistent with our current policies, we cannot be sure that we will be able to obtain such insurance at premium rates that are commercially reasonable. If we were unable to obtain adequate insurance on the Hotel for certain risks, it could cause us to be in default under specific covenants on certain of our indebtedness or other contractual commitments that require us to maintain adequate insurance on the Hotel to protect against the risk of loss. If this were to occur, or if we were unable to obtain adequate insurance and the Hotel experienced damage which would otherwise have been covered by insurance, it could materially adversely affect our financial condition and the operations of the Hotel.\nIn addition, insurance coverage for the Hotel and for casualty losses does not customarily cover damages that are characterized as punitive or similar damages. As a result, any claims or legal proceedings, or settlement of any such claims or legal proceedings that result in damages that are characterized as punitive or similar damages may not be covered by our insurance. If these types of damages are substantial, our financial resources may be adversely affected.\nYou may lose all or part of your investment.\nThere is no assurance that the Companys initiatives to improve its profitability or liquidity and financial position will be successful.\nThe price of the Companys common stock may fluctuate significantly, which could negatively affect the Company and holders of its common stock.\nThe market price of the Companys common stock may fluctuate significantly from time to time as a result of many factors, including: investors perceptions of the Company and its prospects; investors perceptions of the Companys and/or the industrys risk and return characteristics relative to other investment alternatives; difficulties between actual financial and operating results and those expected by investors and analysts; changes in our capital structure; trading volume fluctuations; actual or anticipated fluctuations in quarterly financial and operational results; volatility in the equity securities market; and sales, or anticipated sales, of large blocks of the Companys common stock.\nThe concentrated beneficial ownership of our common stock and the ability it affords to control our business may limit or eliminate other shareholders ability to influence corporate affairs.\nThe Companys President, Chief Executive Officer, and Chairman of the Board of Directors, John V. Winfield is a 68.6% beneficial shareholder of the Company. Because of this concentrated stock ownership, Mr. Winfield will be able to significantly influence the election of the Companys board of directors and all other decisions on all matters requiring shareholder approval. As a result, the ability of other shareholders to determine the management and policies of the Company is significantly limited. The interests of the Companys largest shareholder may differ from the interests of other shareholders with respect to the issuance of shares, business transactions with or sales to other companies, selection of officers and directors and other business decisions. This level of control may also have an adverse impact on the market value of our shares because our largest shareholder may institute or undertake transactions, policies or programs that may result in losses, may not take any steps to increase our visibility in the financial community and/or may sell enough shares to significantly decrease our price per share. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nSAN FRANCISCO HOTEL PROPERTY\nThe Hotel is owned by Portsmouth through its wholly owned subsidiary, Operating. The Hotel is centrally located in the Financial District in San Francisco, one block from the Transamerica Pyramid. The Embarcadero Center is within walking distance and North Beach is two blocks away. Chinatown is directly across the bridge that runs from the Hotel to Portsmouth Square Park. The Hotel is a 31-story (including parking garage), steel and concrete, A-frame building, built in 1970. The Hotel has 544 well-appointed guest rooms and luxury suites situated on 22 floors. The Hotel has a restaurant, a lounge, and a private dining room on 3,700 square feet; additionally, there are two kitchens to service the restaurant and banquets and a fully equipped gym. The third floor houses the Chinese Culture Center (the CCC), its administrative office, and a grand ballroom. The Hotel has approximately 22,000 square feet of meeting room space, including the grand ballroom. Other features of the Hotel include a 5-level underground parking garage and pedestrian bridge across Kearny Street connecting the Hotel and the CCC with Portsmouth Square Park in Chinatown.\nAs required by its senior lender, Operating will continue to make minimum payments into its furniture, fixtures, and equipment (FF&E) escrow account held by its senior lender of the greatest of 4% of annual revenues or a minimum of $1,952,000 per annum. In the opinion of management, the Hotel is adequately covered by insurance.\nHOTEL FINANCING\nOn December 18, 2013: (i) Justice Operating Company, LLC, a Delaware limited liability company (Operating), entered into a loan agreement (Mortgage Loan Agreement) with Bank of America (Mortgage Lender); and (ii) Justice Mezzanine Company, a Delaware limited liability company (Mezzanine), entered into a mezzanine loan agreement (Mezzanine Loan Agreement and, together with the Mortgage Loan Agreement, the Loan Agreements) with ISBI San Francisco Mezz Lender LLC (Mezzanine Lender and, together with Mortgage Lender, the Lenders). The Company is the sole member of Mezzanine, and Mezzanine is the sole member of Operating.\nThe Loan Agreements provide for a $97,000,000 Mortgage Loan and a $20,000,000 Mezzanine Loan. The proceeds of the Loan Agreements were used to fund the redemption of limited partnership interests and the pay-off of the prior mortgage.\nThe Mortgage Loan is secured by Portsmouths principal asset, the Hotel. The Mortgage Loan bears an interest rate of 5.275% per annum and matures in January 2024. The term of the loan is ten years with interest only due in the first three years and principal and interest payments to be made during the remaining seven years of the loan based on a thirty-year amortization schedule. The Mortgage Loan also requires payments for impounds related to property tax, insurance, and FF&E reserves. As additional security for the Mortgage Loan, there is a limited guaranty (Mortgage Guaranty) executed by Portsmouth in favor of the Mortgage Lender.\nThe Mezzanine Loan is secured by the Operating membership interest held by Mezzanine and is subordinated to the Mortgage Loan. On July 31, 2019, Mezzanine refinanced the Mezzanine Loan by entering into a new mezzanine loan agreement (New Mezzanine Loan Agreement) with Cred Reit Holdco LLC in the amount of $20,000,000. The interest rate on the new mezzanine loan is 7.25% and the loan matures on January 1, 2024. Interest only payments are due monthly. As additional security for the new mezzanine loan, there is a limited guaranty executed by the Company in favor of Cred Reit Holdco LLC (the Mezzanine Guaranty and, together with the Mortgage Guaranty, the Guaranties).\nThe Guaranties are limited to what are commonly referred to as bad boy acts, including: (i) fraud or intentional misrepresentations; (ii) gross negligence or willful misconduct; (iii) misapplication or misappropriation of rents, security deposits, insurance, or condemnation proceeds; and (iv) failure to pay taxes or insurance. The Guaranties are full recourse guaranties under identified circumstances, including failure to maintain single purpose status which is a factor in a consolidation of Operating or Mezzanine in a bankruptcy of another person, transfer, or encumbrance of the Property in violation of the applicable loan documents, Operating or Mezzanine incurring debts that are not permitted, and the Property becoming subject to a bankruptcy proceeding. Pursuant to the Guaranties, the Partnership was required to maintain a certain minimum net worth and liquidity. Effective as of May 12, 2017, InterGroup agreed to become an additional guarantor under the limited guaranty and an additional indemnitor under the environmental indemnity for the $97,000,000 mortgage loan and the $20,000,000 mezzanine loan. Pursuant to the agreement, InterGroup is required to maintain a certain net worth and liquidity. As of June 30, 2023 and 2022, InterGroup is in compliance with both requirements. Justice Operating Company, LLC is not meeting certain of its loan covenants such as the Debt Service Coverage Ratio (DSCR) which would trigger the creation of a lockbox and cash sweep by the Lender for all cash collected by the Hotel, and under certain terms, would allow the Lender to request Operating to replace its hotel management company. The DSCR for Operating had been below 1.00 from third quarter of fiscal year 2023 to fourth quarter of fiscal year 2023 while it is required to maintain a DSCR of at least 1.10 to 1.00 for two consecutive quarters. However, such lockbox has been created and utilized from the loan inception and will be in place up to loan maturity regardless of the DSCR. Justice has not missed any of its debt service payments and does not anticipate missing any debt obligations up to their maturity.\nEach of the Loan Agreements contains customary representations and warranties, events of default, reporting requirements, affirmative covenants, and negative covenants, which impose restrictions on, among other things, organizational changes of the respective borrower, operations of the Property, agreements with affiliates and third parties. Each of the Loan Agreements also provides for mandatory prepayments under certain circumstances (including casualty or condemnation events) and voluntary prepayments, subject to satisfaction of prescribed conditions set forth in the Loan Agreements. The Company is working with various potential lenders to refinance its current senior mortgage and mezzanine debt which will mature on January 1, 2024.\nOn July 2, 2014, the Partnership obtained from InterGroup an unsecured loan in the principal amount of $4,250,000 at 12% per year fixed interest, with a term of 2 years, payable interest only each month. InterGroup received a 3% loan fee. The loan may be prepaid at any time without penalty. The loan was extended to July 31, 2023. On December 16, 2020, the Partnership and InterGroup entered into a loan modification agreement which increased the Partnerships borrowing from InterGroup as needed up to $10,000,000. Upon the dissolution of the Partnership in December 2021, Portsmouth assumed the Partnerships note payable to InterGroup in the amount of $11,350,000. On December 31, 2021, Portsmouth and InterGroup entered into a loan modification agreement which increased Portsmouths borrowing from InterGroup as needed up to $16,000,000. As of June 30, 2023 and 2022, the balance of the loan was $15,700,000 and $14,200,000, net of loan amortization costs of zero, respectively. In July 2023, the note maturity date was extended to July 31, 2025 and the borrowing amount available was increased to $20,000,000. The Company agreed to a 0.5% loan extension and modification fee payable to InterGroup.\nAs a result of the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) signed into law on March 27, 2020, additional avenues of relief may be available to workers and families through enhanced unemployment insurance provisions and to small businesses through programs administered by the Small Business Administration (SBA). The CARES Act includes, among other things, provisions relating to payroll tax credits and deferrals, net operating loss carryback periods, alternative minimum tax credits and technical corrections to tax depreciation methods for qualified improvement property. The CARES Act also established a Paycheck Protection Program (PPP), whereby certain small businesses are eligible for a loan to fund payroll expenses, rent, and related costs. On February 3, 2021, Justice entered into a loan agreement (SBA Loan) with CIBC Bank USA administered by the SBA. Justice received proceeds of $2,000,000 from the SBA Loan. As of June 30, 2021, Justice used all proceeds from the SBA Loan primarily for payroll costs. The SBA Loan was scheduled to mature on February 3, 2026, had a 1.00% interest rate, and was subject to the terms and conditions applicable to loans administered by the U.S. Small Business Administration under the CARES Act. On November 19, 2021, the SBA Loan was forgiven in full and $2,000,000 was recorded as gain on debt extinguishment on the consolidated statement of operations for the fiscal year ending June 30, 2022.\nRENTAL PROPERTIES\nAs June 30, 2023, the Companys investment in real estate consisted of twenty properties located throughout the United States, with a concentration in Texas and Los Angeles County, California. These properties include sixteen apartment complexes, three single-family houses as strategic investments and one commercial real estate property. All properties are operating properties. In addition to the properties, the Company owns approximately 2 acres of unimproved land in Maui, Hawaii. As of June 30, 2023, all the Companys operating real estate properties are managed in-house.\nDescription of Properties\nLas Colinas, Texas. The Las Colinas property is a waterfront apartment community along Beaver Creek that was developed in 1993 with 358 units on approximately 15.6 acres of land. The Company acquired the complex on April 30, 2004 for approximately $27,145,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 27.5 years. Real estate property taxes for the year ended June 30, 2023 were approximately $1,054,000. In October 2021, the Company refinanced its 3.73% existing $15,900,000 mortgage note payable on the property and generated net proceeds of $12,938,000. The outstanding new mortgage balance was $28,800,000 as of June 30, 2023. The annual interest rate on the mortgage is fixed at 2.95% for ten years with interest-only payments for the first five years and 30-year amortization thereafter. The mortgage loan matures in November 2031.\nMorris County, New Jersey. The Morris County property is a two-story garden apartment complex that was completed in June 1964 with 151 units on approximately 8 acres of land. The Company acquired the complex on September 15, 1967 at an initial cost of approximately $1,600,000. Real estate property taxes for the year ended June 30, 2023 were approximately $285,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In April 2020, the Company refinanced its 3.51% and 4.51% existing $8,737,000 and $2,512,000 mortgages and generated net proceeds of $6,814,000. The outstanding new mortgage balance was approximately $17,208,000 at June 30, 2023 with a fixed interest rate of 3.17% per annum and the maturity date of the new mortgage is May 1, 2030.\nSt. Louis, Missouri. The St. Louis property is a two-story project with 264 units on approximately 17.5 acres. The Company acquired the complex on November 1, 1968 at an initial cost of $2,328,000. For the year ended June 30, 2023, real estate property taxes were approximately $134,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. On May 31, 2023, the Company refinanced its $4,823,000 mortgage with a new two-year $5,360,000 mortgage. Interest-only payments are due monthly and commencing on June 10, 2024, the Company will be required to make equal monthly principal installments of $5,500 up to the loan maturity of May 31, 2025. The floating interest rate is based on the one month term SOFR plus 310 bps floating with a SOFR cap of 5.5%. The interest rate of the greater of (a) the Prime Rate for such day and (b) the Federal Funds Rate for plus 0.50%. 5.5% per annum for two years with interest-only payments for the first year. The maturity date of the mortgage is May 31, 2025.\nFlorence, Kentucky. The Florence property is a three-story apartment complex with 157 units on approximately 6.0 acres. The Company acquired the property on December 20, 1972 at an initial cost of approximately $1,995,000. For the year ended June 30, 2023, real estate property taxes were approximately $64,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. The outstanding mortgage balance was approximately $2,917,000 as of June 30, 2023 with a fixed interest rate of 3.875% per annum and the maturity date of the mortgage is April 1, 2025.\nLos Angeles, California. The Company owns one commercial property, twelve apartment complexes, and three single-family houses in the general area of County of Los Angeles, California (Los Angeles).\nThe Companys Los Angeles commercial property is a 5,503 square foot, two story building that served as the Companys corporate offices until it was leased out, effective October 1, 2009 and the Company leased a new space for its corporate office. The Company acquired the building on March 4, 1999 for $1,876,000. Property taxes for the year ended June 30, 2023 were approximately $33,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. As of June 30, 2023, this property was not encumbered by a mortgage.\nThe first Los Angeles apartment complex is a 10,600 square foot two-story apartment with 12 units. The Company acquired the property on July 30, 1999 at an initial cost of approximately $1,305,000. For the year ended June 30, 2023, real estate property taxes were approximately $25,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. The outstanding mortgage balance was approximately $1,974,000 as of June 30, 2023 with a fixed interest rate of 3.59% per annum and the maturity date of the mortgage is June 23, 2026.\nThe second Los Angeles apartment complex is a 12,700 square foot apartment with 14 units. The Company acquired the property on October 20, 1999 at an initial cost of approximately $2,150,000. For the year ended June 30, 2023, real estate property taxes were approximately $38,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In January 2021, the Company refinanced its 5.89% existing $1,597,000 mortgage and generated net proceeds of $1,057,000. The outstanding new mortgage balance was approximately $2,645,000 at June 30, 2023 with a fixed interest rate of 3.05% per annum and the maturity date of the new mortgage is February 1, 2031.\nThe third Los Angeles apartment complex is a 10,500 square foot apartment with 9 units. The Company acquired the property on November 10, 1999 at an initial cost of approximately $1,675,000. For the year ended June 30, 2023, real estate property taxes were approximately $30,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In November 2020, the Company refinanced its 5.89% existing $1,088,000 mortgage and generated net proceeds of $798,000. The outstanding new mortgage balance was approximately $1,891,000 as of June 30, 2023 with a fixed interest rate of 3.05% per annum and the maturity date of the new mortgage is December 1, 2030.\nThe fourth Los Angeles apartment complex is a 26,100 square foot two-story apartment with 31 units. The Company acquired the property on May 26, 2000 at an initial cost of approximately $7,500,000. For the year ended June 30, 2023, real estate property taxes were approximately $127,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In October 2020, the Company refinanced its 4.85% existing $4,800,000 mortgage and generated net proceeds of $3,529,000. The outstanding new mortgage balance was approximately $8,291,000 at June 30, 2023 with a fixed interest rate of 2.52% per annum and the maturity date of the new mortgage is November 1, 2030. The new mortgage requires interest-only payments for the first two years and will amortize over 30 years thereafter.\nThe fifth Los Angeles apartment complex is a 27,600 square foot two-story apartment with 30 units. The Company acquired the property on July 7, 2000 at an initial cost of approximately $4,411,000. For the year ended June 30, 2023, real estate property taxes were approximately $78,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. On June 30, 2022, the Company refinanced its 5.97%, $5,283,000 mortgage note payable on this property and obtained a new mortgage note payable for $5,850,000. The Company received net proceeds of $584,000 because of the refinance. The outstanding new mortgage balance was approximately $5,762,000 at June 30, 2023 with a fixed annual interest rate on the new mortgage at 4.40% for the first five years and 5.44% thereafter. The mortgage loan matures in July 2052.\nThe sixth Los Angeles apartment complex is a 3,000 square foot apartment with 4 units. The Company acquired the property on July 19, 2000 at an initial cost of approximately $1,070,000. For the year ended June 30, 2023, real estate property taxes were approximately $18,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In July 2021, the Company refinanced its 3.75% existing $323,000 mortgage and generated net proceeds of $846,000. The outstanding new mortgage balance was approximately $1,112,000 as of June 30, 2023 with a fixed interest rate of 3.50% per annum and the maturity date of the new mortgage is July 1, 2051.\nThe seventh Los Angeles apartment complex is a 4,500 square foot two-story apartment with 4 units. The Company acquired the property on July 28, 2000 at an initial cost of approximately $1,005,000. For the year ended June 30, 2023, real estate property taxes were approximately $17,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In June 2021, the Company refinanced its 3.75% existing $563,000 mortgage and generated net proceeds of $619,000. The outstanding new mortgage balance was approximately $1,112,000 at June 30, 2023 with a five-year fixed interest rate of 3.5% per annum and adjustable rate thereafter at 2.5% over the 6-month LIBOR Index with semi-annual rate and payment adjustments. Semi-annual rate cap is 1.25% after the initial interest rate change with a floor equal to the start rate and ceiling of 9.95%. The maturity date of the new mortgage is August 1, 2051.\nThe eighth Los Angeles apartment complex is a 7,500 square foot apartment with 7 units. The Company acquired the property on August 9, 2000 at an initial cost of approximately $1,308,000. For the year ended June 30, 2023, real estate property taxes were approximately $23,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. The outstanding mortgage balance was approximately $751,000 as of June 30, 2023 with an interest rate of 4.125% and the maturity date of the mortgage is September 1, 2042.\nThe ninth Los Angeles apartment complex is a 13,000 square foot two-story apartment with 8 units. The Company acquired the property on May 1, 2001 at an initial cost of approximately $1,206,000. For the year ended June 30, 2023, real estate property taxes were approximately $21,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In July 2021, the Company refinanced the propertys existing 3.75%, $416,000 mortgage with a new mortgage for $1,595,000. The Company generated net proceeds of $1,098,000 because of the refinancing. Interest rate on the new mortgage is fixed at 3.50% for five years and the mortgages mature in July 2051. Outstanding mortgage balance was approximately $1,535,000 as of June 30, 2023.\nThe tenth Los Angeles apartment complex, which was owned 100% by the Companys subsidiary Santa Fe, is a 4,200 square foot two-story apartment with 2 units. Santa Fe acquired the property on February 1, 2002 at an initial cost of approximately $785,000. For the year ended June 30, 2023, real estate property taxes were approximately $13,000. Depreciation is recorded on the straight-line method based upon an estimated useful life of 40 years. On November 23, 2020, Santa Fe sold this property to InterGroup for $1,530,000 in exchange for a reduction of $1,196,000 of its obligation to InterGroup. The outstanding mortgage on the property for $334,000 was simultaneously transferred to InterGroup. Santa Fe realized a gain on the sale of approximately $901,000, which was eliminated in consolidation at InterGroup. The sales price of the property represents the current value as of the sale date as appraised by a licensed independent third-party appraiser. The fairness of the sale terms of the transaction were reviewed and approved by the independent directors of Santa Fe and InterGroup, and unanimously approved by the entire Board of Directors of both companies. In July 2021, the Company refinanced the propertys existing 3.75%, $327,000 mortgage with a new mortgage for $700,000. The Company generated net proceeds of $381,000 because of the refinancing. Interest rate on the new mortgage is fixed at 3.50% for five years and the mortgage matures in July 2051. Outstanding mortgage balance was approximately $673,000 as of June 30, 2023.\nThe eleventh apartment which is located in Marina del Rey, California, is a 6,316 square foot two-story apartment with 9 units. The Company acquired the property on April 29, 2011 at an initial cost of approximately $4,000,000. For the year ended June 30, 2023, real estate property taxes were approximately $58,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 27.5 years. In June 2020, the Company refinanced its 5.6% existing $1,303,000 mortgage and generated net proceeds of $1,144,000. The outstanding new mortgage balance was approximately $2,443,000 as of June 30, 2023 with a fixed interest rate of 3.09% per annum and the maturity date of the new mortgage is July 1, 2030.\nThe twelfth Los Angeles apartment complex is a 4,093 square foot apartment with 4 units. In an all-cash transaction, the Company acquired the property on May 14, 2021 at an initial cost of approximately $2,600,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. For the year ended June 30, 2023, real estate property taxes were approximately $32,000. In July 2021, the Company obtained a mortgage on the property for $830,000, generating net proceeds of $836,000. Interest rate on the mortgage is fixed at 3.50% for five years and the mortgage matures in August 2051. Outstanding mortgage balance was approximately $800,000 as of June 30, 2023.\nThe first Los Angeles single-family house is a 2,771 square foot home. The Company acquired the property on November 9, 2000 at an initial cost of approximately $660,000. For the year ended June 30, 2023, real estate property taxes were approximately $11,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In June 2021, the Company refinanced its 3.75% existing $363,000 mortgage and generated net proceeds of $576,000. The outstanding new mortgage balance was approximately $886,000 as of June 30, 2023 with a five-year fixed interest rate of 3.5% per annum adjustable rate thereafter at 2.5% over the 6-month LIBOR Index with semi-annual rate and payment adjustments. Semi-annual rate cap is 1.25% after the initial interest rate change with a floor equal to the start rate and ceiling of 9.95%. The maturity date of the new mortgage is August 1, 2051.\nThe second Los Angeles single-family house is a 2,201 square foot home. The Company acquired the property on August 22, 2003 at an initial cost of approximately $700,000. For the year ended June 30, 2023, real estate property taxes were approximately $13,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In June 2021, the Company refinanced its 3.75% existing $388,000 mortgage and generated net proceeds of $183,000. The outstanding new mortgage balance was approximately $534,000 as of June 30, 2023 with a five-year fixed interest rate of 3.5% per annum adjustable rate thereafter at 2.5% over the 6-month LIBOR Index with semi-annual rate and payment adjustments. Semi-annual rate cap is 1.25% after the initial interest rate change with a floor equal to the start rate and ceiling of 9.95%. The maturity date of the new mortgage is August 1, 2051.\nThe third Los Angeles single-family house is a 2,387 square foot home. The company acquired the property in July of 2015 as a strategic asset for $1,975,000. For the year ended June 30, 2023, real estate property taxes were approximately $26,000. Depreciation is recorded on the straight-line method, based upon an estimated useful life of 40 years. In September 2021, the Company refinanced the propertys existing 4.75% per annum mortgage and reduced the rate to five-year fixed at 3.5% per annum, adjustable thereafter at 2.5% over the 6-month LIBOR Index with semi-annual rate and payment adjustments. Semi-annual rate cap is 1.25% after the initial interest rate change with a floor equal to the start rate and ceiling of 9.95%. The outstanding mortgage balance was approximately $934,000 as of June 30, 2023 and the maturity date of the mortgage is October 1, 2048.\nMaui, Hawaii. In August 2004, the Company purchased an approximately two-acre parcel of unimproved land in Kihei, Maui, Hawaii for $1,467,000. Upon the recent wildfires in the area the land was not impacted. As of June 30, 2023, this property is not encumbered by a mortgage.\nMORTGAGES\nFurther information with respect to mortgage notes payable of the Company is set forth in Note 10 of the Notes to Consolidated Financial Statements.\nECONOMIC AND PHYSICAL OCCUPANCY RATES\nThe Company leases units in its residential rental properties on a short-term basis, with no lease extending beyond one year. The economic occupancy (gross potential less rent below market, vacancy loss, bad debt, discounts and concessions divided by gross potential rent) and the physical occupancy (gross potential rent less vacancy loss divided by gross potential rent) for each of the Companys operating properties for fiscal year ended June 30, 2023 are provided below.\nProperty Economic\nOccupancy Physical\nOccupancy\n1. Las Colinas, TX 100 % 99 %\n2. Morris County, NJ 92 % 97 %\n3. St. Louis, MO 68 % 66 %\n4. Florence, KY 80 % 92 %\n5. Los Angeles, CA (1) 92 % 95 %\n6. Los Angeles, CA (2) 96 % 89 %\n7. Los Angeles, CA (3) 96 % 79 %\n8. Los Angeles, CA (4) 81 % 93 %\n9. Los Angeles, CA (5) 100 % 97 %\n10. Los Angeles, CA (6) 98 % 100 %\n11. Los Angeles, CA (7) 100 % 100 %\n12. Los Angeles, CA (8) 100 % 94 %\n13. Los Angeles, CA (9) 100 % 100 %\n14. Los Angeles, CA (10) 75 % 75 %\n15. Los Angeles, CA (11) 97 % 100 %\n16. Los Angeles, CA (12) 62 % 62 %\n17. Los Angeles, CA (13) 100 % 100 %\n18. Los Angeles, CA (14) 100 % 100 %\n19. Los Angeles, CA (15) 69 % 94 %\nThe Companys Los Angeles, California properties are subject to various rent control laws, ordinances and regulations which impact the Companys ability to adjust and achieve higher rental rates. In February 2022, the Los Angeles County Board of Supervisors extended the majority of the eviction moratorium to 2022 and parts of it until 2023. The Countys non-payment COVID-19 tenant eviction protection resolution expired on March 31, 2023. Landlords in California are not allowed to evict tenants for unpaid rent prior to March 2023 and are not allowed to file a civil complaint for such rent until 2025. The Company will file civil complaints as soon as it is allowed by statue in an effort to collect any unpaid rent prior to March 2023. Item 3. Legal Proceedings.\nThe Company may be subject to legal proceedings, claims, and litigation arising in the ordinary course of business. The Company will defend itself vigorously against any such claims. Management does not believe that the impact of such matters will have a material effect on the financial conditions or result of operations when resolved. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Common Equity and Related Stockholder Matters.\nMARKET INFORMATION\nThe Companys Common Stock is listed and trades on the NASDAQ Capital Market tier of the NASDAQ Stock Market, LLC under the symbol: INTG. As of June 30, 2023, the approximate number of holders of record of the Companys Common Stock was 165. Such number of owners was determined from the Companys shareholders records and does not include beneficial owners of the Companys Common Stock whose shares are held in names of various brokers, clearing agencies or other nominees.\nDIVIDENDS\nThe Company has not declared any cash dividends on its common stock and does not foresee issuing cash dividends in the near future.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS.\nThis information appears in Part III, Item 12 of this report.\nISSUER PURCHASES OF EQUITY SECURITIES\nThe following table reflects purchases of InterGroups common stock made by The InterGroup Corporation, for its own account, during the fourth quarter of its fiscal year ending June 30, 2023.\nSMALL BUSINESS ISSUER PURCHASES OF EQUITY SECURITIES\nFiscal 2023 Period (a) Total\nNumber of\nShares\nPurchased\n(b)\nAverage\nPrice Paid\nPer Share\n(c) Total Number of Shares Purchased\nas Part of Publicly\nAnnounced Plans\nor Programs\n(d) Maximum Number of shares that May\nYet be Purchased\nUnder the Plans\nor Programs\nMonth #1 (April 1- April 30) $ 41.94 91,218\nMonth #2 (May 1- May 31) $ 36.60 91,028\nMonth #3 (June 1- June 30) $ 36.20 90,731\nTOTAL: 1,017 $ 37.94 1,017 90,731\nThe Company has only one stock repurchase program. The program was initially announced on January 13, 1998 and was amended on February 10, 2003 and October 12, 2004. The total number of shares authorized to be repurchased pursuant to those prior authorizations was 870,000, adjusted for stock splits. On June 3, 2009, the Board of Directors authorized the Company to purchase up to an additional 125,000 shares of Companys common stock. On November 15, 2012, the Board of Directors authorized the Company to purchase up to an additional 100,000 shares of Companys common stock. On September 23, 2019, the Board of Directors authorized the Company to purchase up to an additional 120,000 shares of Companys common stock. On December 20, 2021, the Board of Directors authorized the Company to purchase up to an additional 125,000 shares of Companys common stock. The purchases will be made, in the discretion of management, from time to time, in the open market or through privately negotiated third party transactions depending on market conditions and other factors. The Companys repurchase program has no expiration date and can be amended and increased, from time to time, in the discretion of the Board of Directors. No plan or program expired during the period covered by the table. Item 6. Selected Financial Data.\nNot required for smaller reporting companies. Item 7. Management Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the accompanying consolidated financial statements, related notes included thereto and Item 1A., Risk Factors, appearing elsewhere in this Annual Report on Form 10-K. For the discussion and analysis of our 2022 financial condition and results of operations compared to 2023, refer to Item 7., Managements Discussion and Analysis of Financial Condition and Results of Operations of our Annual Report on Form 10-K for the year ended June 30, 2023.\nNEGATIVE EFFECTS OF CIVIL AUTHORITY ACTIONS ON OUR BUSINESS\nThere are several factors at play that are having a negative impact on our business and the entire hospitality community in San Francisco. The constant doom loop of negative headlines picked up in main stream media, particularly outlets like Fox News that have made San Francisco their punching back and find ways to amplify any negative story line in the city. The macro economic situation of a looming US/Global recession have seen business reducing or eliminating typical travel and group meetings in efforts to be conservative in uncertain financial times. The micro economic situation specific to San Francisco and Bay Area is many of the worlds largest tech companies have taken even more drastic cost cutting measures laying off hundreds of thousands of workers in the area and have reduced business travel, group meetings and even major citywides to cancel like Meta, Red Hat and VMWare. The ongoing conditions of the streets in regards to cleanliness, safety and homelessness problems have driven many other citywide customers to rethink hosting meetings in San Francisco and have relocated to other major markets like Las Vegas, Orlando and San Diego. Even factors like the recent culture wars that are dividing much of the country are impacting San Francisco harder than other areas as the city have long been known as the LGBTQ capital of the US, and made recent headlines after Mayor London Breeds office named the first ever Drag Laureate to an 18 month term as ambassador.\nAs a result of the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) signed into law on March 27, 2020, additional avenues of relief may be available to workers and families through enhanced unemployment insurance provisions and to small businesses through programs administered by the Small Business Administration (SBA). The CARES Act includes, among other things, provisions relating to payroll tax credits and deferrals, net operating loss carryback periods, alternative minimum tax credits and technical corrections to tax depreciation methods for qualified improvement property. The CARES Act also established a Paycheck Protection Program (PPP), whereby certain small businesses are eligible for a loan to fund payroll expenses, rent, and related costs.\nOn February 3, 2021, Justice entered into a loan agreement (SBA Loan) with CIBC Bank USA administered by the SBA. Justice received proceeds of $2,000,000 from the SBA Loan. As of June 30, 2021, Justice used all proceeds from the SBA Loan primarily for payroll costs. The SBA Loan was scheduled to mature on February 3, 2026, had a 1.00% interest rate, and was subject to the terms and conditions applicable to loans administered by the U.S. Small Business Administration under the CARES Act. On November 19, 2021, the SBA Loan was forgiven in full and $2,000,000 was recorded as gain on debt extinguishment on the consolidated statement of operations for the fiscal year ended June 30, 2022.\nRESULTS OF OPERATIONS\nAs of June 30, 2023, the Company owned approximately 75.7% of the common shares of Portsmouth Square, Inc. The Companys principal sources of revenue are revenues from the hotel owned by Portsmouth, rental income from its investments in multi-family and commercial real estate properties, and income received from investment of its cash and securities assets.\nPortsmouths primary asset is a 544-room hotel property located at 750 Kearny Street, San Francisco, California 94108, known as the Hilton San Francisco Financial District (the Hotel or the Property) and related facilities, including a five-level underground parking garage. The financial statements of Portsmouth have been consolidated with those of the Company.\nIn addition to the operations of the Hotel, the Company also generates income from the ownership and management of its real estate. Properties include sixteen apartment complexes, one commercial real estate property, and three single-family houses as strategic investments. The properties are located throughout the United States but are concentrated in Texas and Southern California. The Company also has an investment in unimproved real property in Hawaii.\nThe Company acquires its investments in real estate and other investments utilizing cash, securities or debt, subject to approval or guidelines of the Board of Directors. The Company also invests in income-producing instruments, equity and debt securities and will consider other investments if such investments offer growth or profit potential.\nFiscal Year Ended June 30, 2023 Compared to Fiscal Year Ended June 30, 2022\nThe Company had a net loss of $9,932,000 for the year ended June 30, 2023 compared to a net loss of $10,616,000 for the year ended June 30, 2022. Income from operations was $4,336,000 for the year ended June 30, 2023 and income from operations was $3,671,000 for fiscal year ended June 30, 2022. The Company recorded gains of $58,000 from marketable securities transactions during fiscal year ended June 30, 2023 as compared to losses of $8,101,000 during fiscal year ended June 30, 2022. Gain on insurance recovery of $2,692,000 was recorded during fiscal year ended June 30, 2023. Gain on debt forgiveness was $2,000,000 during fiscal year ended June 30, 2022.\nHotel Operations\nThe Company had net loss of $1,612,000 from Hotel operations for the year ended June 30, 2023 compared to net loss of $2,776,000 for the year ended June 30, 2022. The change was primarily attributable to the $10,493,000 increase in Hotel revenue, offset by $7,006,000 increase in operating expenses and the $2,000,000 gain on forgiveness of debt during period ended June 30, 2022.\nThe following tables set forth a more detailed presentation of Hotel operations for the years ended June 30, 2023 and 2022.\nFor the year ended June 30,\nHotel revenues:\nHotel rooms $ 35,684,000 $ 26,599,000\nFood and beverage 2,625,000 1,471,000\nGarage 2,790,000 3,112,000\nOther operating departments 928,000 352,000\nTotal hotel revenues 42,027,000 31,534,000\nOperating expenses excluding depreciation and amortization (34,457,000 ) (27,451,000 )\nOperating income interest, depreciation and amortization 7,570,000 4,083,000\nAnd gain on forgiveness of debt - 2,000,000\nInterest expense - mortgage (6,467,000 ) (6,549,000 )\nDepreciation and amortization expense (2,815,000 ) (2,310,000 )\nNet loss from Hotel operations $ (1,712,000 ) $ (2,776,000 )\nFor the year ended June 30, 2023, the Hotel had operating income of $7,570,000 before non-recurring charges, interest, depreciation, and amortization on total operating revenues of $42,027,000. The year over year increase in all areas, except garage revenues, are result of recovery from the business interruption attributable to a variety of responses by federal, state, and local civil authority to the COVID-19 outbreak since March 2020. The following table sets forth the monthly average occupancy percentage of the Hotel for the fiscal years ended June 30, 2023 and 2022.\nMonth Jul Aug Sep Oct Nov Dec Jan Feb Mar Apr May Jun Fiscal Year\nYear 2022 2023 2023 2022 - 2023\nAverage Occupancy % 93 % 94 % 95 % 89 % 82 % 77 % 76 % 77 % 81 % 65 % 80 % 83 % 83 %\nYear 2021 2022 2022 2021 - 2022\nAverage Occupancy % 82 % 77 % 76 % 79 % 72 % 74 % 68 % 74 % 81 % 87 % 90 % 95 % 80 %\nBeginning in November 2022, the occupancy of our hotel has been reduced by approximately 13% every month to reflect the out-of-order rooms that are being renovated at any given time. The guestroom renovation is scheduled to be completed by the end of March 31, 2024. Additionally, 14 guest rooms will be added to inventory as a result of renovating such rooms which had been repurposed for administrative offices in past years.\nTotal operating expenses increased by $7,006,000 due to increase in rooms, food and beverage, salaries and wages, utilities, credit card commissions, and franchise fees.\nThe following table sets forth the average daily room rate, average occupancy percentage and room revenue per available room (RevPAR) of the Hotel for the year ended June 30, 2023 and 2022.\nFor the Year Ended June 30, Average\nDaily Rate\nAverage\nOccupancy %\nRevPAR\n$ 217 83 % $ 180\n$ 168 80 % $ 134\nThe Hotels revenues increased by 33% year over year. Average daily rate increased by $49, average occupancy increased 3%, and RevPAR increased by $46 for the twelve months ended June 30, 2023 compared to the twelve months ended June 30, 2022. As previously mentioned, our occupancy is lowered by approximately 13% beginning November 2022 when we began to take three levels out of service in order to complete our guestroom renovations. Had the Hotel been able to sell the additional 13% of rooms that were out of order, the RevPar would have been approximately $192.\nAfter taking advantage of softer demand to refresh all public spaces and meeting rooms, the Hotel is now deep into a renovation of the guest rooms and suites. The Hotel started its full renovation of all guest rooms and suites mid-November 2022 and is over half way complete as of fiscal year end 2023. This includes new carpet, vinyl wall covering, headboards, end tables, wall sconces, art, soft seating and refinish of existing desks and doors. The Hotel removed the existing armoire and has built a closet to replace it. After this project is completed early calendar year 2024, the Hotel will add 14 additional guest rooms bringing back the old Justice offices, spa, and accounting offices to their original purpose. This will all be funded from the Hotels cash from operations through the Hotels furniture, fixture, and equipment reserve account with our senior lender.\nReal Estate Operations\nRevenues from real estate operations were consistent year over year for June 30, 2023 and 2022 at $15,580,000 and $15,685,000 respectively. Real estate operating expenses increased to $10,017,000 from $8,694,000 primarily due to increased insurance expense of over $1,000,000 year over year. Management continues to review and analyze the Companys real estate operations to improve occupancy and rental rates and to reduce expenses and improve efficiencies.\nInvestment Transactions\nThe Company had a net income on marketable securities of $1,126,000 for the year ended June 30, 2023 compared to a net loss on marketable securities of $7,614,000 for the year ended June 30, 2022. For the year ended June 30, 2022, the Company had a net realized loss of $2,581,000 related to the Companys investment in the common stock of Comstock Mining Inc. (Comstock - NYSE MKT: LODE).\nFor the year ended June 30, 2023, the Company had a net realized loss of $1,712,000 and a net unrealized gain of $2,838,000. For the year ended June 30, 2022, the Company had a net realized loss of $2,206,000 and a net unrealized loss of $5,408,000.\nGains and losses on marketable securities may fluctuate significantly from period to period in the future and could have a significant impact on the Companys results of operations. However, the amount of gain or loss on marketable securities for any given period may have no predictive value and variations in amount from period to period may have no analytical value. For a more detailed description of the composition of the Companys marketable securities see the Marketable Securities section below.\nDuring the years ended June 30, 2023 and 2022, the Company performed an impairment analysis of its other investments and determined that its investments had other than temporary impairment and recorded impairment losses of zero and $41,000, respectively.\nThe Company and its subsidiary Portsmouth compute and file income tax returns and prepare discrete income tax provisions for financial reporting. An income tax benefit was recorded for the year ended June 30, 2022, for the pre-tax loss. However, for the year ended June 30, 2023, an expense was booked on the pre-tax loss due to the set up of a valuation allowance on all of Portsmouth (standalone) deferred tax assets.\nMARKETABLE SECURITIES AND OTHER INVESTMENTS\nAs of June 30, 2023 and 2022, the Company had investments in marketable equity securities of $18,345,000 and $11,049,000, respectively. The following table shows the composition of the Companys marketable securities portfolio by selected industry groups:\nAs of June 30, 2023\nIndustry Group Fair Value % of Total\nInvestment\nSecurities\nREITs and real estate companies $ 6,985,000 38.1 %\nTechnology 2,779,000 15.1 %\nT-Notes 2,093,000 11.4 %\nFinancial services 1,865,000 10.2 %\nConsumer cyclical 1,689,000 9.2 %\nBasic materials 1,047,000 5.7 %\nHealthcare 739,000 4.0 %\nCommunications Services 566,000 3.1 %\nIndustrial 485,000 2.7 %\nUtilities 97,000 0.5 %\n$ 18,345,000 100.0 %\nAs of June 30, 2022\nIndustry Group\nFair Value % of Total\nInvestment\nSecurities\nREITs and real estate companies $ 3,289,000 29.8 %\nCommunication Services 2,787,000 25.2 %\nFinancial Services 1,755,000 15.9 %\nTechnology 815,000 7.4 %\nBasic materials 769,000 7.0 %\nConsumer cyclical 693,000 6.3 %\nIndustrial 385,000 3.5 %\nEnergy 279,000 2.5 %\nOther 277,000 2.4 %\n$ 11,049,000 100.0 %\nAs of June 30, 2023, the Companys investment portfolio is diversified with 59 different equity positions. The Company holds one equity security that comprised more than 10% of the equity value of the portfolio. The three largest security position represent 19%, 4%, and 4% of the portfolio and consists of the common stock of American Realty Investors, Inc. (NASDAQ: ARL), Ouster Inc - Common Stock (NASDAQ: OUST), and Bank Hawaii Corp (NASDAQ: BOH), which are included in the REITs and real estate companies, Financial Services, and Financial Services industry groups, respectively.\nAs of June 30, 2022, the Companys investment portfolio is diversified with 38 different equity positions. The Company holds three equity securities that comprised more than 10% of the equity value of the portfolio. The three largest security positions represent 23%, 20%, and 13% of the portfolio and consists of the common stock of Paramount Global - Preferred Stock (NASDAQ: PARAP), American Realty Investors, Inc. (NASDAQ: ARL), and BlackRock Muni holdings California Quality Fund Inc. (NASDAQ: MUC), which are included the Communications, REITs and real estate companies, and Financial Services industry groups, respectively.\nThe following table shows the net gain (loss) on the Companys marketable securities and the associated margin interest and trading expenses for the respective years.\nFor the years ended June 30,\nNet gain (loss) on marketable securities $ 1,126,000 $ (7,614,000\nImpairment loss on other investments - (41,000 )\nDividend and interest income 485,000 980,000\nMargin interest expense (848,000 ) (851,000 )\nTrading expenses (705,000 ) (575,000 )\nTotal $ 58,000 $ (8,101,000 )\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL SOURCES\nThe Company had cash and cash equivalents of $5,960,000 and $14,367,000 as of June 30, 2023 and 2022, respectively. The Company had restricted cash of $6,914,000 and $8,982,000 as of June 30, 2023 and 2022, respectively. The Company had marketable securities, net of margin due to securities brokers and obligations for securities sold of $15,328,000 and $10,110,000 as of June 30, 2023 and 2022, respectively. These marketable securities are short-term investments and liquid in nature.\nOn December 16, 2020, Justice and InterGroup entered into a loan modification agreement which increased Justices borrowing from InterGroup as needed up to $10,000,000 and extended the maturity date of the loan to July 31, 2021. As of the date of this report, the maturity date was extended to July 31, 2025. Upon the dissolution of Justice in December 2021, Portsmouth assumed Justices note payable to InterGroup in the amount of $11,350,000. On December 31, 2021, Portsmouth and InterGroup entered into a loan modification agreement which increased Portsmouths borrowing from InterGroup as needed up to $16,000,000. During the fiscal year ending June 30, 2023 and 2022, InterGroup advanced to the Hotel $1,500,000 and $7,550,000, respectively, bringing the total amount due to InterGroup to $15,700,000 and $14,200,000 as of June 30, 2023 and 2022, respectively. In July 2023, Portsmouth and InterGroup entered into a new loan modification agreement which increased Portsmouths borrowing from InterGroup up to $20,000,000. The Company could amend its by-laws and increase the number of authorized shares to issue additional shares to raise capital in the public markets if needed.\nDuring the fiscal year ending June 30, 2023, we completed the refinancing on our St. Louis, Missouri property $4.9 million loan and obtain a $5,360,000 new two-year loan at a floating interest rate of 3.1% over the cap 5.5% SOFR. During the fiscal year ending June 30, 2022, we refinanced six of our properties existing mortgages and obtained a mortgage note payable on one of our California properties, generating net proceeds totaling $16,683,000. We are currently evaluating other refinancing opportunities and we could refinance additional multifamily properties should the need arise, or should management consider the interest rate environment favorable.\nOn April 9, 2020, Justice entered into a loan agreement (SBA Loan) with CIBC Bank USA under the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) administered by the U.S. Small Business Administration (the SBA). On February 3, 2021, Justice entered into a loan agreement (SBA Loan) with CIBC Bank USA administered by the SBA. Justice received proceeds of $2,000,000 from the SBA Loan. As of June 30, 2021, Justice used all proceeds from the SBA Loan primarily for payroll costs. The SBA Loan was scheduled to mature on February 3, 2026, had a 1.00% interest rate, and was subject to the terms and conditions applicable to loans administered by the U.S. Small Business Administration under the CARES Act. On November 19, 2021, the SBA Loan was forgiven in full and $2,000,000 was recorded as gain on debt extinguishment on the consolidated statement of operations for the fiscal year ending June 30, 2022.\nOur known short-term liquidity requirements primarily consist of funds necessary to pay for operating and other expenditures, including management and franchise fees, corporate expenses, payroll and related costs, taxes, interest and principal payments on our outstanding indebtedness, and repairs and maintenance of the Hotel.\nOur long-term liquidity requirements primarily consist of funds necessary to pay for scheduled debt maturities and capital improvements of the Hotel. We will continue to finance our business activities primarily with existing cash, including from the activities described above, and cash generated from our operations. After considering our approach to liquidity and accessing our available sources of cash, We believe that our cash on hand, along with other potential sources of liquidity that management may be able to obtain, will be sufficient to fund our working capital needs, as well as our capital lease and debt obligations for at least the next twelve months and beyond even if current levels of occupancy and revenue per occupied room (RevPAR, calculated by multiplying the hotels average daily room rate by its occupancy percentage) were to persist. The objectives of our cash management policy are to maintain existing leverage levels and the availability of liquidity, while minimizing operational costs. However, there can be no guarantee that management will be successful with its plan.\nGoing Concern\nThe Hotel financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. As discussed in Note 10 - Mortgage Notes Payable, as of June 30, 2023, the outstanding balance consists of a senior mortgage loan and mezzanine loan totaling $107,117,000. Both loans mature on January 1, 2024. In addition, the Hotel has recurring losses and has an accumulated deficit of $105,727,000.\nDue to these factors and the Hotels ability to successfully refinance the debt on favorable terms in the current lending environment gives rise to substantial doubt about the Hotels ability to continue as a going concern for one year after the financial statement issuance date.\nThe Hotel is exploring the possibility of refinancing its senior mortgage and mezzanine debt with potential lenders. Alternatively, the Hotel is also exploring the possibility of a loan modification or extension to the existing debt with the current lenders, however, the Hotel may be unable to access further financing when needed. As such, there can be no assurance that the Company will be able to obtain additional liquidity when needed or under acceptable terms, if at all. During 2021 and first part of calendar 2022, the Hotel took advantage of the slow periods to make certain capital improvements including complete refinishing of all guest room furniture, resurfacing half of the hotel bathtubs that needed repair, refreshed meeting space and lobby paint and vinyl, replaced all bed frames and socks, and completed the carpet and wall covering corridor installation. In November 2022, began guestroom renovation and had completed approximately 200 guestrooms as of June 30, 2023. Hotel improvements are ongoing to remain competitive and we anticipate completing the guestroom renovations by the end March 2024. Once the Hotel completes its full renovation, management anticipates its high occupancy to continue and its average daily rates to increase as it completes renovation up to the point of generating a positive cash flows.\nThe financial statements do not include any adjustments to the carrying amounts of assets, liabilities, and reported expenses that may be necessary if the Hotel were unable to continue as a going concern.\nMATERIAL CONTRACTUAL OBLIGATIONS\nThe following table provides a summary as of June 30, 2023, the Companys material financial obligations which also includes interest payments.\nYear Year Year Year Year\nTotal 2027 Thereafter\nMortgage and subordinated notes payable $ 192,870,000 $ 108,420,000 $ 9,318,000 $ 1,168,000 $ 3,299,000 $ 1,771,000 $ 68,894,000\nOther notes payable 2,956,000 567,000 567,000 567,000 463,000 317,000 475,000\nInterest 25,577,000 3,849,000 2,898,000 2,390,000 2,284,000 2,286,000 11,870,000\nTotal $ 221,403,000 $ 112,836,000 $ 12,783,000 $ 4,125,000 $ 6,046,000 $ 4,374,000 $ 81,239,000\nOFF-BALANCE SHEET ARRANGEMENTS\nThe Company has no material off balance sheet arrangements.\nIMPACT OF INFLATION\nHotel room rates are typically impacted by supply and demand factors, not inflation, since rental of a hotel room is usually for a limited number of nights. Room rates can be, and usually are, adjusted to account for inflationary cost increases. Since Aimbridge has the power and ability under the terms of its management agreement to adjust Hotel room rates on an ongoing basis, there should be minimal impact on partnership revenues due to inflation. For the two most recent fiscal years, the impact of inflation on the Companys income is not viewed by management as material.\nThe Companys residential rental properties provide income from short-term operating leases and no lease extends beyond one year. Rental increases are expected to offset anticipated increased property operating expenses.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nCritical accounting policies are those that are most significant to the portrayal of our financial position and results of operations and require judgments by management in order to make estimates about the effect of matters that are inherently uncertain. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts in our consolidated financial statements. We evaluate our estimates on an on-going basis, including those related to the consolidation of our subsidiaries, to our revenues, allowances for bad debts, accruals, asset impairments, other investments, income taxes and commitments and contingencies. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. The actual results may differ from these estimates, or our estimates may be affected by different assumptions or conditions.\nINCOME TAXES\nJudgment is required in addressing the future tax consequences of events that have been recognized in our consolidated financial statements or tax returns (e.g., realization of deferred tax assets, changes in tax laws, or interpretations thereof). In addition, we are subject to examination of our income tax returns by the IRS and other tax authorities. A change in the assessment of the outcomes of such matters could materially impact our consolidated financial statements. We evaluate tax positions taken or expected to be taken on a tax return to determine whether they are more likely than not of being sustained, assuming that the tax reporting positions will be examined by taxing authorities with full knowledge of all relevant information, prior to recording the related tax benefit in our consolidated financial statements. If a position does not meet the more likely than not standard, the benefit cannot be recognized. Assumptions, judgment, and the use of estimates are required in determining if the more likely than not standard has been met when developing the provision for income taxes. A change in the assessment of the more likely than not standard with respect to a position could materially impact our consolidated financial statements.\nDEFERRED INCOME TAXES - VALUATION ALLOWANCE\nWe assess the realizability of our deferred tax assets quarterly and recognize a valuation allowance when it is more likely than not that some or all of our deferred tax assets are not realizable. This assessment is completed by tax jurisdiction and relies on the weight of both positive and negative evidence available, with significant weight placed on recent financial results. Cumulative pre-tax losses for the three-year period are considered significant objective negative evidence that some or all of our deferred tax assets may not be realizable. Cumulative reported pre-tax income is considered objectively verifiable positive evidence of our ability to generate positive pre-tax income in the future. In accordance with GAAP, when there is a recent history of pre-tax losses, there is little or no weight placed on forecasts for purposes of assessing the recoverability of our deferred tax assets. When necessary, we use systematic and logical methods to estimate when deferred tax liabilities will reverse and generate taxable income and when deferred tax assets will reverse and generate tax deductions. Assumptions, judgment, and the use of estimates are required when scheduling the reversal of deferred tax assets and liabilities, and the exercise is inherently complex and subjective. However, significant judgment will be required to determine the timing and amount of any reversal of the valuation allowance in future periods.\nHOTEL ASSETS AND DEFINITE-LIVED INTANGIBLE ASSETS\nWe evaluate property and equipment, and definite-lived intangible assets for impairment quarterly, and when events or circumstances indicate the carrying value may not be recoverable, we evaluate the net book value of the assets by comparing to the projected undiscounted cash flows of the assets. We use judgment to determine whether indications of impairment exist and consider our knowledge of the hospitality industry, historical experience, location of the property, market conditions, and property-specific information available at the time of the assessment. The results of our analysis could vary from period to period depending on how our judgment is applied and the facts and circumstances available at the time of the analysis. When an indicator of impairment exists, judgment is also required in determining the assumptions and estimates to use within the recoverability analysis and when calculating the fair value of the asset or asset group, if applicable. Changes in economic and operating conditions impacting the judgments used could result in impairments to our long-lived assets in future periods. Historically, changes in estimates used in the property and equipment and definite-lived intangible assets impairment assessment process have not resulted in material impairment charges in subsequent periods as a result of changes made to those estimates. There were no indicators of impairment on its hotel investments or intangible assets and accordingly no impairment losses recorded for the years ended June 30, 2023 and 2022. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nNot required for smaller reporting companies. Item 8. Financial Statements and Supplementary Data.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS PAGE\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets - June 30, 2023 and 2022\nConsolidated Statements of Operations - For years ended June 30, 2023 and 2022\nConsolidated Statements of Shareholders Deficit - For years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows - For years ended June 30, 2023 and 2022\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders,\nThe InterGroup Corporation:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of The InterGroup Corporation and its subsidiaries (the Company) as of June 30, 2023 and 2022, and the related consolidated statements of operations, shareholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended June 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the entity will continue as a going concern. As discussed in Note 1, the outstanding balance as of June 30, 2023 of the mortgage notes payable consists of a senior mortgage loan and mezzanine loan totaling $107,117,000. Both loans mature on January 1, 2024 In addition, the Company has recurring losses and has an accumulated deficit. Due to these factors and the Companys ability to successfully refinance the debt on favorable terms in the current lending environment gives rise to substantial doubt about the Companys ability to continue as a going concern for one year after the financial statement issuance date. Managements plans in regard to this matter are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which they relate.\nDescription of the Matters: Deferred Tax Asset Valuation Allowance\nAs discussed in Note 13 to the consolidated financial statements, it was determined that it is more likely than not that a significant portion of the deferred tax assets at June 30, 2023 are not realizable and thus a valuation allowance of $33,784,000 has been recorded.\nWe identified the deferred tax asset valuation allowance as a critical audit matter due to the uncertainty, subjectivity, estimates and judgments required by management when forecasting future profitability and determining whether or not it is likely that the deferred tax assets will be realized.\nHow We Addressed the Matters in Our Audit\nTo test the Companys conclusions about their deferred tax valuation allowance, we obtained an analysis about their plans and reviewed all the positive and negative conditions. In addition to considering the impact of any subsequent events, we received the Companys five-year income projection. We examined the forecast for reasonableness in addition to reviewing managements plans and considered whether it is likely that the Companys projected future profitability will allow them to realize their current deferred tax assets.\n/s/ WithumSmith+Brown, PC\nWe have served as the Companys auditor since 2022.\nEast Brunswick, NJ\nOctober 13, 2023\nPCAOB ID Number 100\nTHE INTERGROUP CORPORATION\nCONSOLIDATED BALANCE SHEETS\nAs of June 30,\nASSETS\nInvestment in Hotel, net $ 40,318,000 $ 37,267,000\nInvestment in real estate, net 48,057,000 48,025,000\nInvestment in marketable securities 18,345,000 11,049,000\nCash and cash equivalents 5,960,000 14,367,000\nRestricted cash 6,914,000 8,982,000\nOther assets 2,764,000 2,744,000\nDeferred tax asset - 3,612,000\nTotal assets $ 122,358,000 $ 126,046,000\nLIABILITIES AND SHAREHOLDERS DEFICIT\nLiabilities:\nAccounts payable and other liabilities $ 2,574,000 $ 2,715,000\nAccounts payable and other liabilities - Hotel 11,616,000 7,508,000\nDue to securities broker 1,601,000 490,000\nObligations for securities sold 1,416,000 449,000\nOther notes payable 2,954,000 3,521,000\nFinance leases - 183,000\nDeferred tax liability 4,927,000 -\nMortgage notes payable - Hotel 107,117,000 108,747,000\nMortgage notes payable - real estate 84,757,000 85,437,000\nTotal liabilities 216,962,000 209,050,000\nCommitments and contingencies - Note 17\nShareholders deficit:\nPreferred stock, $.01 par value, 100,000 shares authorized; none issued - -\nCommon stock, $.01 par value, 4,000,000 shares authorized; 3,459,888 and 3,459,888 issued; 2,205,927 and 2,236,180 outstanding as of June 30, 2023 and 2022, respectively 33,000 33,000\nAdditional paid-in capital 2,445,000 3,277,000\nAccumulated deficit (52,835,000 ) (46,116,000 )\nTreasury stock, at cost, 1,253,961 and 1,223,708 shares as of June 30, 2023 and 2022, respectively (20,794,000 ) (19,324,000 )\nTotal InterGroup shareholders deficit (71,151,000 ) (62,130,000 )\nNon-controlling interest (23,453,000 ) (20,874,000 )\nTotal shareholders deficit (94,604,000 ) (83,004,000 )\nTotal liabilities and shareholders deficit $ 122,358,000 $ 126,046,000\nThe accompanying notes are an integral part of these consolidated financial statements.\nTHE INTERGROUP CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the years ended June 30,\nRevenues:\nHotel $ 42,027,000 $ 31,534,000\nReal estate 15,580,000 15,685,000\nTotal revenues 57,607,000 47,219,000\nCosts and operating expenses:\nHotel operating expenses (34,457,000 ) (27,451,000 )\nReal estate operating expenses (10,017,000 ) (8,694,000 )\nDepreciation and amortization expense (5,464,000 ) (4,754,000 )\nGeneral and administrative expense (3,333,000 ) (2,649,000 )\nTotal costs and operating expenses (53,271,000 ) (43,548,000 )\nIncome from operations 4,336,000 3,671,000\nOther (expense) income:\nInterest expense - mortgages (8,585,000 ) (8,881,000 )\nNet realized (loss) gain on marketable securities (1,712,000 ) 375,000\nNet realized loss on marketable securities - Comstock - (2,581,000 )\nNet unrealized gain (loss) on marketable securities 2,838,000 (5,408,000 )\nGain on debt forgiveness - 2,000,000\nLoss on debt extinguishment - (335,000 )\nGain on insurance recovery 2,692,000 -\nImpairment loss on other investments - (41,000 )\nDividend and interest income 485,000 980,000\nTrading and margin interest expense (1,553,000 ) (1,426,000 )\nNet other expense (5,835,000 ) (15,317,000 )\nLoss before income taxes (1,499,000 ) (11,646,000 )\nIncome tax (expense) benefit (8,433,000 ) 1,030,000\nNet loss (9,932,000 ) (10,616,000 )\nLess: Net loss attributable to the noncontrolling interest 3,213,000 1,893,000\nNet loss attributable to InterGroup $ (6,719,000 ) $ (8,723,000 )\nNet loss per share\nBasic $ (4.77 ) $ (4.77 )\nDiluted N/A $N/A\nNet loss per share attributable to InterGroup\nBasic $ (3.92 ) $ (3.92 )\nDiluted N/A $N/A\nWeighted average number of common shares outstanding 2,215,258 2,224,293\nWeighted average number of diluted shares outstanding N/A N/A\nThe accompanying notes are an integral part of these consolidated financial statements.\nTHE INTERGROUP CORPORATION\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS DEFICIT\nCommon Stock Additional Paid-in Accumulated Treasury InterGroup\nShareholders\nNon-controlling Total\nShareholders\nShares Amount Capital Deficit Stock Deficit Interest Deficit\nBalance at July 1, 2021 3,404,982 $ 33,000 $ 2,172,000 $ (36,394,000 ) $ (17,370,000 ) $ (51,559,000 ) $ (19,677,000 ) $ (71,236,000 )\nNet Loss - - - (8,723,000 ) - (8,723,000 ) (1,893,000 ) (10,616,000 )\nIssuance of stock from exercise of stock options 54,906 - - - - - - -\nStock options expense - - 4,000 - - 4,000 - 4,000\nDistribution from Santa Fe - - 1,159,000 - - 1,159,000 - 1,159,000\nReclassify non-controlling interest due to purchase of Justice - - - (999,999 ) - (999,999 ) 999,999 -\nInvestment in Portsmouth - - (58,000 ) - - (58,000 ) 41,000 (17,000 )\nPurchase of Partnership interest - - - - - - (344,000 ) (344,000 )\nPurchase of treasury stock - - - - (1,954,000 ) (1,954,000 ) - (1,954,000 )\nBalance at June 30, 2022 3,459,888 $ 33,000 $ 3,277,000 $ (46,116,000 ) $ (19,324,000 ) $ (62,130,000 ) $ (20,874,000 ) $ (83,004,000 )\nNet Loss - - - (6,719,000 ) - (6,719,000 ) (3,213,000 ) (9,932,000 )\nInvestment in Portsmouth - - (832,000 ) - - (832,000 ) 634,000 (198,000 )\nPurchase of treasury stock - - - - (1,470,000 ) (1,470,000 ) - (1,470,000 )\nBalance at June 30, 2023 3,459,888 $ 33,000 $ 2,445,000 $ (52,835,000 ) $ (20,794,000 ) $ (71,151,000 ) $ (23,453,000 ) $ (94,604,000 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nTHE INTERGROUP CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the years ended June 30,\nCash flows from operating activities:\nNet loss $ (9,932,000 ) $ (10,616,000 )\nAdjustments to reconcile net loss to net cash (used in) provided by operating activities:\nNet unrealized (gain) loss on marketable securities (2,838,000 ) 5,408,000\nDeferred taxes 8,539,000 (1,472,000 )\nGain on insurance recovery (2,692,000 ) -\nGain from debt forgiveness - (2,000,000 )\nImpairment loss on other investments - 41,000\nDepreciation and amortization 5,464,000 4,754,000\nAmortization of loan cost 352,000 432,000\nAmortization of other notes payable (567,000 ) (567,000 )\nStock compensation expense - 4,000\nChanges in assets and liabilities:\nInvestment in marketable securities (4,458,000 ) 19,335,000\nOther assets (20,000 ) (1,123,000 )\nAccounts payable and other liabilities (141,000 ) (642,000 )\nAccounts payable and other liabilities - Hotel 4,108,000 764,000\nDue to securities broker 1,111,000 (7,427,000 )\nObligations for securities sold 967,000 (5,970,000 )\nNet cash (used in) provided by operating activities (107,000 ) 921,000\nCash flows from investing activities:\nCapital expenditures for property and equipment - Hotel (5,866,000 ) (1,926,000 )\nCapital expenditures for property and equipment - real estate (2,314,000 ) (2,760,000 )\nDistribution from Santa Fe - 1,159,000\nInvestment in Portsmouth (198,000 ) (17,000 )\nInvestment in Justice - (344,000 )\nInsurance proceeds for property damage claims 2,325,000 -\nNet cash used in investing activities (6,053,000 ) (3,888,000 )\nCash flows from financing activities:\nPayments of mortgage, finance leases and other notes payable (8,205,000 ) (3,698,000 )\nProceeds from mortgage and other notes payable 5,360,000 16,683,000\nIssuance cost from refinance of long-term debt - (107,000 )\nPurchase of treasury stock (1,470,000 ) (1,954,000 )\nNet cash provided by (used in) financing activities (4,315,000 ) 10,924,000\nNet (decrease) increase in cash, cash equivalents and restricted cash: (10,475,000 ) 7,957,000\nCash, cash equivalents and restricted cash at the beginning of the year 23,349,000 15,392,000\nCash, cash equivalents and restricted cash at the end of the year $ 12,874,000 $ 23,349,000\nSupplemental information:\nIncome taxes paid $ 74,000 $ 1,975,000\nInterests paid $ 7,708,000 $ 7,663,000\nThe Company had cash and cash equivalents of $5,960,000 and $14,367,000 as of June 30, 2023 and 2022, respectively. The Company had restricted cash of $6,914,000 and $8,982,000 as of June 30, 2023 and 2022, respectively.\nThe accompanying notes are an integral part of these consolidated financial statements.\nTHE INTERGROUP CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - BUSINESS AND SIGNIFICANT ACCOUNTING POLICIES AND PRACTICES\nDescription of the Business\nThe InterGroup Corporation, a Delaware corporation, (InterGroup or the Company) was formed to buy, develop, operate and dispose of real property and to engage in various investment activities to benefit the Company and its shareholders.\nEffective February 19, 2021, the Companys 83.7% owned subsidiary, Santa Fe Financial Corporation (Santa Fe), a public company (OTCBB: SFEF), was liquidated and all of its assets including its 68.8% interest in Portsmouth Square, Inc. (Portsmouth), a public company (OTCBB: PRSI) were distributed to its shareholders in exchange for their Santa Fe common stock. In June 2022, InterGroup received distribution of $1,159,000 of from Santa Fe as the entity received federal and state tax refunds from previously filed final tax returns.As of June 30, 2023, InterGroup owns approximately 75.7% of the outstanding common shares of Portsmouth and the Companys President, Chairman of the Board and Chief Executive Officer, John V. Winfield, owns approximately 2.5% of the outstanding common shares of Portsmouth. Mr. Winfield also serves as the Chairman of the Board and Chief Executive Officer of Portsmouth.\nPortsmouths primary business was conducted through its general and limited partnership interest in Justice Investors Limited Partnership, a California limited partnership (Justice or the Partnership). Effective July 15, 2021, Portsmouth completed the purchase of 100% of the limited partnership interest of Justice through the acquisition of the remaining 0.7% non-controlling interest. Effective December 23, 2021, the partnership was dissolved. The financial statements of Justice were consolidated with those of Portsmouth.\nPrior to its dissolution effective December 23, 2021, Justice owned and operated a 544-room hotel property located at 750 Kearny Street, San Francisco California, known as the Hilton San Francisco Financial District (the Hotel) and related facilities including a five-level underground parking garage through its subsidiaries Justice Operating Company, LLC (Operating) and Justice Mezzanine Company, LLC (Mezzanine). Mezzanine was a wholly owned subsidiary of the Partnership; Operating is a wholly owned subsidiary of Mezzanine. Effective December 23, 2021, Portsmouth replaced Justice as the single member of Mezzanine. Mezzanine is the borrower under certain mezzanine indebtedness of Justice, and in December 2013, the Partnership conveyed ownership of the Hotel to Operating. The Hotel is a full-service Hilton brand hotel pursuant to a Franchise License Agreement with HLT Franchise Holding LLC (Hilton) through January 31, 2030.\nAimbridge Hospitality (Aimbridge) manages the Hotel, along with its five-level parking garage, under certain Hotel management agreement (HMA) with Operating. The term of the management agreement is for an initial period of ten years commencing on the February 3, 2017 date and automatically renews for successive one (1) year periods, to not exceed five years in the aggregate, subject to certain conditions. Under the terms on the HMA, base management fee (Basic Fee) payable to Aimbridge shall be one and seven-tenths percent (1.70%) of total Hotel revenue. In addition to the Basic Fee, Aimbridge shall be entitled to an annual incentive fee for each fiscal year equal to ten percent (10%) of the amount by which Gross Operating Profit in the current fiscal year exceeds the previous fiscal years Gross Operating Profit.\nIn addition to the operations of the Hotel, the Company also generates income from the ownership of real estate and investments in marketable securities. Properties include apartment complexes, commercial real estate, and three single-family houses as strategic investments. The properties are located throughout the United States, but are concentrated in Texas and Southern California. The Company also has investments in unimproved real property. All of the Companys residential rental properties are managed in-house.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and Portsmouth. All significant inter-company transactions and balances have been eliminated.\nInvestment in Hotel, Net\nProperty and equipment are stated at cost. Building improvements are depreciated on a straight-line basis over their useful lives ranging from 3 to 39 years. Furniture, fixtures, and equipment are depreciated on a straight-line basis over their useful lives ranging from 3 to 7 years.\nRepairs and maintenance are charged to expense as incurred. Costs of significant renewals and improvements are capitalized and depreciated over the shorter of its remaining estimated useful life or life of the asset. The cost of assets sold or retired, and the related accumulated depreciation are removed from the accounts; any resulting gain or loss is included in other income (expenses).\nThe Company reviews property and equipment for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable in accordance with generally accepted accounting principles (GAAP). If the carrying amount of the asset, including any intangible assets associated with that asset, exceeds its estimated undiscounted net cash flow, before interest, the Company will recognize an impairment loss equal to the difference between the assets carrying amount and its estimated fair value. If impairment is recognized, the reduced carrying amount of the asset will be accounted for as its new cost. For a depreciable asset, the new cost will be depreciated over the assets remaining useful life. Generally, fair values are estimated using discounted cash flow, replacement cost or market comparison analyses. The process of evaluating for impairment requires estimates as to future events and conditions, which are subject to varying market and economic factors. Therefore, it is reasonably possible that a change in estimate resulting from judgments as to future events could occur which would affect the recorded amounts of the property. No impairment losses were recorded for the years ended June 30, 2023 and 2022.\nInvestment in Real Estate, Net\nRental properties are stated at cost less accumulated depreciation. Depreciation of rental property is provided on the straight-line method based upon estimated useful lives of 5 to 40 years for buildings and improvements and 5 to 10 years for equipment. Expenditures for repairs and maintenance are charged to expense as incurred and major improvements are capitalized.\nThe Company also reviews its rental property assets for impairment. No impairment losses on the investment in real estate have been recorded for the years ended June 30, 2023 and 2022.\nThe fair value of the tangible assets of an acquired property, which includes land, building and improvements, is determined by valuing the property as if they were vacant, and incorporates costs during the lease-up periods considering current market conditions and costs to execute similar leases such lost rental revenue and tenant improvements. The value of tangible assets is depreciated using straight-line method based upon the assets estimated useful lives.\nInvestment in Marketable Securities\nMarketable securities are stated at fair value as determined by the most recently traded price of each security at the balance sheet date. Marketable securities are classified as trading securities with all unrealized gains and losses on the Companys investment portfolio recorded through the consolidated statements of operations.\nOther Investments, Net\nOther investments include non-marketable securities (carried at cost, net of any impairments loss) and non-marketable debt instruments. The Company has no significant influence or control over the entities that issue these investments. These investments are reviewed on a periodic basis for other-than-temporary impairment. The Company reviews several factors to determine whether a loss is other-than-temporary. These factors include but are not limited to: (i) the length of time an investment is in an unrealized loss position, (ii) the extent to which fair value is less than cost, (iii) the financial condition and near-term prospects of the issuer and (iv) our ability to hold the investment for a period of time sufficient to allow for any anticipated recovery in fair value. For the years ended June 30, 2023 and 2022, the Company recorded impairment losses related to other investments of zero and $41,000, respectively.\nCash and Cash Equivalents\nCash equivalents consist of highly liquid investments with an original maturity of three months or less when purchased and are carried at cost, which approximates fair value. As of June 30, 2023 and 2022, the Company does not have any cash equivalents.\nRestricted Cash\nRestricted cash is comprised of amounts held by lenders for payment of real estate taxes, insurance, replacement and capital addition reserves for the Hotel.\nOther Assets\nOther assets include prepaid insurance, accounts receivable, prepaid expenses, and other miscellaneous assets.\nAccounts receivable from the Hotel and rental property customers are carried at cost less an allowance for doubtful accounts that is based on managements assessment of the collectability of accounts receivable. The Company had accounts receivable, net of $634,000 at July 1, 2022. As of June 30, 2023, and 2022, the allowance for doubtful accounts was $486,000 and $110,000, respectively. The Company extends unsecured credit to its customers but mitigates the associated credit risk by performing ongoing credit evaluations of its customers. The temporary eviction moratorium imposed by the federal and state governmental authorities had delayed evictions during fiscal years 2022 and 2023.\nDue to Securities Broker\nThe Company may utilize margin for its marketable securities purchases through the use of standard margin agreements with national brokerage firms. Various securities brokers have advanced funds to the Company for the purchase of marketable securities under standard margin agreements. These advanced funds are recorded as a liability.\nObligation for Securities Sold\nObligation for securities sold represents the fair market value of shares sold with the promise to deliver that security at some future date and the fair market value of shares underlying the written call options with the obligation to deliver that security when and if the option is exercised. The obligation may be satisfied with current holdings of the same security or by subsequent purchases of that security. Unrealized gains and losses from changes in the obligation are included in the statement of operations.\nAccounts Payable and Other Liabilities\nAccounts payable and other liabilities include trade payables, advanced customer deposits, accrued wages, accrued real estate taxes, and other liabilities.\nTreasury Stock\nThe Company records the acquisition of treasury stock under the cost method. During the years ended June 30, 2023 and 2022, the Company purchased 30,253 and 41,645 shares of treasury stock, respectively.\nFair Value of Financial Instruments\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability (i.e., the exit price) in an orderly transaction between market participants at the measurement date. Accounting standards for fair value measurement establishes a hierarchy for inputs used in measuring fair value that maximizes the use of observable inputs and minimizes the use of unobservable inputs by requiring that the most observable inputs be used when available. Observable inputs are inputs that market participants would use in pricing the asset or liability developed based on market data obtained from sources independent of the Company. Unobservable inputs are inputs that reflect the Companys assumptions about the assumptions market participants would use in pricing the asset or liability developed based on the best information available in the circumstances. The hierarchy is broken down into three levels based on the observability of inputs as follows:\nLevel 1-inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2-inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the assets or liability, either directly or indirectly, for substantially the full term of the financial instruments.\nLevel 3-inputs to the valuation methodology are unobservable and significant to the fair value.\nRevenue Recognition\nPerformance obligations\nWe identified the following performance obligations for which revenue is recognized as the respective performance obligations are satisfied, which results in recognizing the amount we expect to be entitled to for providing the goods or services:\n● Cancelable room reservations or ancillary services are typically satisfied as the good or service is transferred to the hotel guest, which is generally when the room stay occurs.\n● Non-cancelable room reservations and banquet or conference reservations represent a series of distinct goods or services provided over time and satisfied as each distinct good or service is provided, which is reflected by the duration of the room reservation.\n● Other ancillary goods and services are purchased independently of the room reservation at standalone selling prices and are considered separate performance obligations, which are satisfied when the related good or service is provided to the hotel guest.\n● Components of package reservations for which each component could be sold separately to other hotel guests are considered separate performance obligations and are satisfied as set forth above.\nHotel revenue primarily consists of hotel room rentals, revenue from accommodations sold in conjunction with other services (e.g., package reservations), food and beverage sales and other ancillary goods and services (e.g., parking). Revenue is recognized when rooms are occupied or goods and services have been delivered or rendered, respectively. Payment terms typically align with when the goods and services are provided. For package reservations, the transaction price is allocated to the performance obligations within the package based on the estimated standalone selling prices of each component.\nWe do not disclose the value of unsatisfied performance obligations for contracts with an expected length of one year or less. Due to the nature of our business, our revenue is not significantly impacted by refunds. Cash payments received in advance of guests staying at our hotel are refunded to hotel guests if the guest cancels within the specified time period, before any services are rendered. Refunds related to service are generally recognized as an adjustment to the transaction price at the time the hotel stay occurs or services are rendered. See Note 3 - Revenue.\nRevenue recognition from apartment rental commences when an apartment unit is placed in service and occupied by a rent-paying tenant. Apartment units are leased on a short-term basis, with no lease extending beyond one year.\nAdvertising Costs\nAdvertising costs are expensed as incurred and are included in Hotel operating expenses in the consolidated statements of operations. Advertising costs were $130,000 and $61,000 for the years ended June 30, 2023 and 2022, respectively.\nIncome Taxes\nDeferred income taxes are calculated under the liability method. Deferred income tax assets and liabilities are based on differences between the financial statement and tax basis of assets and liabilities at the current enacted tax rates. Changes in deferred income tax assets and liabilities are included as a component of income tax expense. Changes in deferred income tax assets and liabilities attributable to changes in enacted tax rates are charged or credited to income tax expense in the period of enactment. Valuation allowances are established for certain deferred tax assets where realization is not likely.\n$0 and $1,665,000 of unrecognized tax benefits as of June 30, 2022 and June 30, 2023, respectively, would impact the effective tax rate if recognized. The unrecognized tax benefit is not expected to reverse in the next 12 months. Interest and penalties related to income tax matters are classified as a component of income tax expense. As of June 30, 2022 and June 30, 2023, no interest and penalties were recorded.\nAssets and liabilities are established for uncertain tax positions taken or positions expected to be taken in income tax returns when such positions are judged to not meet the more-likely-than-not threshold based on the technical merits of the positions.\nEarnings Per Share\nBasic net income (loss) per share is computed by dividing net income (loss) available to common stockholders by the weighted average number of common shares outstanding. The computation of diluted net income per share is similar to the computation of basic net income per share except that the weighted-average number of common shares is increased to include the number of additional common shares that would have been outstanding if potential dilutive common shares had been issued. The basic and diluted earnings per share are the same for the fiscal year ended June 30, 2023 and 2022 because the Company had a net loss.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires the use of estimates and assumptions regarding certain types of assets, liabilities, revenues, and expenses. Actual results may differ from those estimates. Management considers new evidence, both positive and negative, that could affect its view of the future realization of deferred tax assets and when appropriate, records tax valuation allowances based on that evidence and estimates. Such estimates primarily relate to the recording of allowance for doubtful accounts which are based on managements assessment of the collectability of accounts receivable as of the end of the fiscal year As of June 30, 2023 based on taxable income that may be available under tax law the deferred taxed asset is not more likely than not to be realized.\nReclassifications\nCertain line items on the balance sheet as of June 30, 2023, for the years ended June 30, 2023 and 2022 have been reclassified to conform to the current period presentation. The related party relationship has been disclosed separately in the financial statements than the other debt obligations the Company has.\nDebt Issuance Costs\nDebt issuance costs related to a recognized debt liability are presented in the consolidated balance sheets as a direct deduction from the carrying amount of the debt liability and are amortized over the life of the debt. Loan amortization costs are included in interest expense in the consolidated statement of operations.\nRecently Issued and Adopted Accounting Pronouncements\nAs of June 30, 2023, there was no material impact from the recent adoption of new accounting pronouncements, nor expected material impact from recently issued accounting pronouncements yet to be adopted, on the Companys consolidated financial statements.\nGoing Concern\nThe Hotel financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. As discussed in Note 10 - Mortgage Notes Payable, as of June 30, 2023, the outstanding balance consists of a senior mortgage loan and mezzanine loan totaling $107,117,000. Both loans mature on January 1, 2024. In addition, the Hotel has recurring losses and has an accumulated deficit of $105,727,000.\nDue to these factors and the Hotels ability to successfully refinance the debt on favorable terms in the current lending environment gives rise to substantial doubt about the Hotels ability to continue as a going concern for one year after the financial statement issuance date.\nThe Hotel is exploring the possibility of refinancing its senior mortgage and mezzanine debt with potential lenders. Alternatively, the Hotel is also exploring the possibility of a loan modification or extension to the existing debt with the current lenders, however, the Hotel may be unable to access further financing when needed. As such, there can be no assurance that the Company will be able to obtain additional liquidity when needed or under acceptable terms, if at all. During 2021 and first part of calendar 2022, the Hotel took advantage of the slow periods to make certain capital improvements including complete refinishing of all guest room furniture, resurfacing half of the hotel bathtubs that needed repair, refreshed meeting space and lobby paint and vinyl, replaced all bed frames and socks, and completed the carpet and wall covering corridor installation. In November 2022, began guestroom renovation and had completed approximately 200 guestrooms as of June 30, 2023. Hotel improvements are ongoing to remain competitive and we anticipate completing the guestroom renovations by the end March 2024. Once the Hotel completes its full renovation, management anticipates its high occupancy to continue and its average daily rates to increase as it completes renovation up to the point of generating a positive cash flows.\nThe financial statements do not include any adjustments to the carrying amounts of assets, liabilities, and reported expenses that may be necessary if the Hotel were unable to continue as a going concern.\nNOTE 2 - LIQUIDITY\nHistorically, our cash flows have been primarily generated from our Hotel and real estate operations. However, the dealings by federal, state, and local civil authorities have a material detrimental impact on our liquidity. For the fiscal year ended June 30, 2023, our net cash flow used by operations was $107,000. We have taken several steps to preserve capital and increase liquidity at our Hotel, including implementing strict cost management measures to eliminate non-essential expenses, renegotiating certain reoccurring expenses, and temporarily closing certain hotel services and outlets. As the hospitality and travel environment continues to recover, the Company will continue to evaluate what services the Company brings back. During the fiscal year ended June 30, 2023, the Company continued to make capital improvements to the hotel in the amount of $5,866,000 and anticipates continuing its guest room upgrade program during the fiscal year 2024.\nThe Company had cash and cash equivalents of $5,960,000 and $14,367,000 as of June 30, 2023 and 2022, respectively. The Company had restricted cash of $6,914,000 and $8,982,000 as of June 30, 2023 and 2022, respectively. The Company had marketable securities, net of margin due to securities brokers, of $15,328,000 and $10,110,000 as of June 30, 2023 and 2022, respectively. These marketable securities are short-term investments and liquid in nature.\nOn December 16, 2020, Justice and InterGroup entered into a loan modification agreement which increased Justices borrowing from InterGroup as needed up to $10,000,000 and extended the maturity date of the loan to July 31, 2021. On July 7, 2021, the maturity date was extended to July 31, 2022. Upon the dissolution of Justice in December 2021, Portsmouth assumed Justices note payable to InterGroup in the amount of $11,350,000. On December 31, 2021, Portsmouth and InterGroup entered into a loan modification agreement which increased Portsmouths borrowing from InterGroup as needed up to $16,000,000. As of June 30, 2023 and 2022, the balance of the loan was $15,700,000 and $14,200,000, net of loan amortization costs of zero, respectively. In July 2023, the note maturity date was extended to July 31, 2025 and the borrowing amount available was increased to $20,000,000. The Company agreed to a 0.5% loan extension and modification fee payable to InterGroup. All funds advanced to the Hotel have been eliminated in consolidated financial statements at June 30, 2023 and 2022.\nOn May 31, 2023, the Company refinanced its St. Louis, Missouri $4,823,000 mortgage with a two-year $5,360,000 mortgage with a floating monthly rate of the 30-day SOFR (capped at 5.5%) plus SOFR margin of 3.10%, interest-only payments are due for the first 12 months and $5,500 principal paydowns commencing in June 2024. During the fiscal year ending June 30, 2022, we refinanced six of our properties existing mortgages and obtained a mortgage note payable on one of our California properties, generating net proceeds totaling $16,683,000. We are currently evaluating other refinancing opportunities and we could refinance additional multifamily properties should the need arise, or should management consider the interest rate environment favorable.\nOn February 3, 2021, Justice entered into a loan agreement (SBA Loan) with CIBC Bank USA administered by the SBA. Justice received proceeds of $2,000,000 from the SBA Loan. As of June 30, 2021, Justice used all proceeds from the SBA Loan primarily for payroll costs. The SBA Loan was scheduled to mature on February 3, 2026, had a 1.00% interest rate, and was subject to the terms and conditions applicable to loans administered by the U.S. Small Business Administration under the CARES Act. On November 19, 2021, the SBA Loan was forgiven in full and $2,000,000 was recorded as gain on debt extinguishment on the consolidated statement of operations for the fiscal year ending June 30, 2022.\nOur known short-term liquidity requirements primarily consist of funds necessary to pay for operating and other expenditures, including management and franchise fees, corporate expenses, payroll and related costs, taxes, interest and principal payments on our outstanding indebtedness, and repairs and maintenance at all of our properties.\nOur long-term liquidity requirements primarily consist of funds necessary to pay for scheduled debt maturities and capital improvements of the Hotel and our real estate properties. We will continue to finance our business activities primarily with existing cash, including from the activities described above, and cash generated from our operations. The objectives of our cash management policy are to maintain existing leverage levels and the availability of liquidity, while minimizing operational costs. However, there can be no guarantee that management will be successful with its plan.\nThe following table provides a summary as of June 30, 2023, the Companys material financial obligations which also includes interest payments.\nYear Year Year Year Year\nTotal 2027 Thereafter\nMortgage and subordinated notes payable $ 192,870,000 $ 108,420,000 $ 9,318,000 $ 1,168,000 $ 3,299,000 $ 1,771,000 $ 68,894,000\nRelated party notes payable 2,956,000 567,000 567,000 567,000 463,000 317,000 475,000\nInterest 25,577,000 3,849,000 2,898,000 2,390,000 2,284,000 2,286,000 11,870,000\nTotal $ 221,403,000 $ 112,836,000 $ 12,783,000 $ 4,125,000 $ 6,046,000 $ 4,374,000 $ 81,239,000\nNOTE 3 - REVENUE\nOur revenue from real estate is primarily rental income from residential and commercial property leases which is recorded when due from residents and is recognized monthly as earned. The revenue recognition rules under ASC 606 specifically eliminates rental revenue from the accounting standard.\nThe following table presents our Hotel revenue disaggregated by revenue streams.\nFor the year ended June 30,\nHotel revenues:\nHotel rooms $ 35,684,000 $ 26,599,000\nFood and beverage 2,625,000 1,471,000\nGarage 2,790,000 3,112,000\nOther operating departments 928,000 352,000\nTotal Hotel revenue $ 42,027,000 $ 31,534,000\nContract assets and liabilities\nWe do not have any material contract assets as of June 30, 2023 and 2022, other than trade and other receivables, net on our consolidated balance sheets. Our receivables are primarily the result of contracts with customers, which are reduced by an allowance for doubtful accounts that reflects our estimate of amounts that will not be collected.\nWe record contract liabilities when cash payments are received or due in advance of guests staying at our hotel, which are presented within accounts payable and other liabilities on our consolidated balance sheets and had a balance of $493,000 at July 1, 2022. During the year ended June 30, 2023, the entire $493,000 was recognized as revenue. Contract liabilities decreased to $290,000 as of June 30, 2023. The decrease as of June 30, 2023, was primarily driven by a decrease in advance deposits received from customers for services to be performed after June 30, 2023.Contract liabilities increased to $493,000 as of June 30, 2022 from $161,000 as of June 30, 2021. The increase for the twelve months ended June 30, 2022 was primarily driven by advance deposits received from customers for services to be performed after June 30, 2022.\nContract costs\nWe consider sales commissions earned to be incremental costs of obtaining a contract with our customers. As a practical expedient, we expense these costs as incurred as our contracts with customers are less than one year.\nNOTE 4 - INVESTMENT IN HOTEL, NET\nInvestment in Hotel consisted of the following as of:\nAccumulated Net Book\nJune 30, 2023 Cost Depreciation Value\nLand $ 2,738,000 $ - $ 2,738,000\nFinance lease ROU assets 1,805,000 (1,239,000 ) 566,000\nFurniture and equipment 38,727,000 (29,682,000 ) 9,045,000\nBuilding and improvements 64,665,000 (36,696,000 ) 27,969,000\nInvestment in Hotel, net $ 107,935,000 $ (67,617,000 ) $ 40,318,000\nAccumulated Net Book\nJune 30, 2022 Cost Depreciation Value\nLand $ 2,738,000 $ - $ 2,738,000\nFinance lease ROU assets 1,805,000 (922,000 ) 883,000\nFurniture and equipment 32,860,000 (28,567,000 ) 4,293,000\nBuilding and improvements 64,665,000 (35,312,000 ) 29,353,000\nInvestment in Hotel, net $ 102,068,000 $ (64,801,000 ) $ 37,267,000\nNOTE 5 - INVESTMENT IN REAL ESTATE, NET\nAt June 30, 2023, the Companys investment in real estate consisted of twenty properties located throughout the United States. These properties include sixteen apartment complexes, three single-family houses as strategic investments, and one commercial real estate property. The Company also owns unimproved land located in Maui, Hawaii.\nInvestment in real estate included the following:\nAs of June 30,\nLand $ 22,998,000 $ 22,998,000\nBuildings, improvements and equipment 73,151,000 70,933,000\nAccumulated depreciation (50,022,000 ) (47,374,000 )\n46,127,000 46,557,000\nLand held for development 1,930,000 1,468,000\nInvestment in real estate, net $ 48,057,000 $ 48,025,000\nNOTE 6 - INVESTMENT IN MARKETABLE SECURITIES\nThe Companys investment in marketable securities consists primarily of corporate equities. The Company has also periodically invested in corporate bonds and income producing securities, which may include interests in real estate-based companies and REITs, where financial benefit could inure to its shareholders through income and/or capital gain.\nAt June 30, 2023 and 2022, all of the Companys marketable securities are classified as trading securities. The change in the unrealized gains and losses on these investments are included in earnings. Trading securities are summarized as follows:\nGross Gross Net\nInvestment Cost Unrealized\nGain\nUnrealized\nLoss\nUnrealized\nGain (Loss)\nFair\nValue\nAs of June 30, 2023\nCorporate Equities $ 15,419,000 $ 3,713,000 $ (787,000 ) $ 2,926,000 $ 18,345,000\nAs of June 30, 2022\nCorporate Equities $ 11,150,000 $ 1,474,000 $ (1,575,000 ) $ (101,000 ) $ 11,049,000\nNet gain (loss) on marketable securities on the statement of operations is comprised of realized and unrealized gains (losses). Below is the composition of the two components for the years ended June 30, 2023 and 2022, respectively.\nFor the year ended June 30,\nRealized (loss) gain on marketable securities $ (1,712,000 ) $ 375,000\nRealized loss on marketable securities related to Comstock - (2,581,000 )\nUnrealized gain (loss) on marketable securities 2,838,000 (5,408,000 )\nNet gain (loss) on marketable securities $ 1,126,000 $ (7,614,000 )\nNOTE 7 - FAIR VALUE MEASUREMENTS\nThe carrying values of the Companys financial instruments not required to be carried at fair value on a recurring basis approximate fair value due to their short maturities (i.e., accounts receivable, other assets, accounts payable and other liabilities, due to securities broker and obligations for securities sold) or the nature and terms of the obligation (i.e., other notes payable and mortgage notes payable).\nThe assets measured at fair value on a recurring basis are as follows:\nAs of June 30, 2023 Level 1\nAssets:\nInvestment in marketable securities:\nREITs and real estate companies $ 6,985,000\nTechnology 2,779,000\nT-Notes 2,093,000\nFinancial services 1,865,000\nConsumer cyclical 1,689,000\nBasic materials 1,047,000\nHealthcare 739,000\nCommunication services 566,000\nIndustrial 485,000\nUtilities 97,000\n$ 18,345,000\nAs of June 30, 2022 Level 1\nAssets:\nInvestment in marketable securities:\nREITs and real estate companies $ 3,289,000\nCommunication services 2,787,000\nFinancial services 1,755,000\nTechnology 815,000\nBasic material 769,000\nConsumer cyclical 693,000\nIndustrial 385,000\nEnergy 279,000\nOther 277,000\n$ 11,049,000\nThe fair values of investments in marketable securities are determined by the most recently traded price of each security at the balance sheet date.\nFinancial assets that are measured at fair value on a non-recurring basis and are not included in the tables above are Other investments in non-marketable securities, that were initially measured at cost and have been written down to fair value as a result of impairment or adjusted to record the fair value of new instruments received (i.e., preferred shares) in exchange for old instruments (i.e., debt instruments). The following table shows the fair value hierarchy for these assets measured at fair value on a non-recurring basis as follows:\nNet loss for the\nAssets Level 3 June 30, 2022 year ended\nJune 30, 2022\nOther non-marketable investments $ - $ - $ (41,000 )\nFor fiscal years ended June 30, 2023 and 2022, we received distribution from other non-marketable investments of zero and $41,000, respectively.\nOther investments in non-marketable securities are carried at cost net of any impairment loss. The Company has no significant influence or control over the entities that issue these investments. These investments are reviewed on a periodic basis for other-than-temporary impairment. When determining the fair value of these investments on a non-recurring basis, the Company uses valuation techniques such as the market approach and the unobservable inputs include factors such as conversion ratios and the stock price of the underlying convertible instruments. The Company reviews several factors to determine whether a loss is other-than-temporary. These factors include but are not limited to: (i) the length of time an investment is in an unrealized loss position, (ii) the extent to which fair value is less than cost, (iii) the financial condition and near-term prospects of the issuer and (iv) our ability to hold the investment for a period of time sufficient to allow for any anticipated recovery in fair value.\nNOTE 8 - OTHER ASSETS\nOther assets consist of the following as of June 30:\nAccounts receivable, net $ 631,000 $ 634,000\nPrepaid expenses 648,000 775,000\nMiscellaneous assets 681,000 652,000\nPrepaid taxes 697,000 683,000\nTotal other assets $ 2,657,000 $ 2,744,000\nNOTE 9 -OTHER FINANCING TRANSACTIONS\nThe following summarizes the balances of other notes payable as of June 30, 2023 and 2022, respectively.\nAs of June 30,\nNote payable - Hilton $ 2,058,000 $ 2,375,000\nNote payable - Aimbridge 896,000 1,146,000\nTotal other notes payable $ 2,954,000 $ 3,521,000\nNote payable to Hilton (Franchisor) is a self-exhausting, interest free development incentive note which is reduced by approximately $317,000 annually through 2030 by Hilton if the Partnership is still a Franchisee with Hilton.\nOn February 1, 2017, Operating entered an HMA with Ambridge to manage the Hotel with an effective takeover date of February 3, 2017. The term of the management agreement is for an initial period of 10 years commencing on the takeover date and automatically renews for an additional year not to exceed five years in aggregate subject to certain conditions. The HMA also provides for Ambridge to advance a key money incentive fee to the Hotel for capital improvements in the amount of $2,000,000 under certain terms and conditions described in a separate key money agreement. The key money contribution shall be amortized in equal monthly amounts over an eight (8) year period commencing on the second anniversary of the takeover date. During the first quarter of fiscal year 2021, the Hotel obtained approval from Ambridge to use the key money for hotel operations and the funds were exhausted by December 31, 2020. The unamortized portion of the key money in the amount of $896,000 and $1,146,000 are included in other notes payable in the consolidated balance sheets at June 30, 2023 and 2022, respectively.\nOn April 9, 2020, Justice entered into a loan agreement (SBA Loan - Justice) with CIBC Bank USA under the CARES Act administered by the U.S. Small Business Administration (the SBA). On February 3, 2021, Justice entered into a loan agreement (SBA Loan) with CIBC Bank USA administered by the SBA. Justice received proceeds of $2,000,000 from the SBA Loan. Justice used all proceeds from the SBA Loan primarily for payroll costs. The SBA Loan was scheduled to mature on February 3, 2026, had a 1.00% interest rate, and was subject to the terms and conditions applicable to loans administered by the U.S. Small Business Administration under the CARES Act. On November 19, 2021, the SBA Loan was forgiven in full and $2,000,000 was recorded as gain on debt extinguishment on the consolidated statement of operations for the fiscal year ended June 30, 2022.\nFuture minimum principal payments for all other financing transactions are as follows:\nFor the year ending June 30,\n$ 567,000\n567,000\n567,000\n463,000\n317,000\nThereafter 475,000\n$ 2,956,000\nTo fund the redemption of limited partnership interests and to repay the prior mortgage of $42,940,000, Justice obtained a $97,000,000 mortgage loan and a $20,000,000 mezzanine loan in December 2013. The mortgage loan is secured by the Partnerships principal asset, the Hotel. The mortgage loan bears an interest rate of 5.275% per annum with interest only payments due through January 2017. Beginning in February 2017, the loan began to amortize over a thirty-year period through its maturity date of January 2024. Outstanding principal balance on the loan was $89,114,000 and $90,745,000 as of June 30, 2023 and 2022, respectively. As additional security for the mortgage loan, there is a limited guaranty executed by Portsmouth in favor of the mortgage lender. The mezzanine loan is secured by the Operating membership interest held by Mezzanine and is subordinated to the Mortgage Loan. The mezzanine interest only loan had an interest rate of 9.75% per annum and a maturity date of January 1, 2024. As additional security for the mezzanine loan, there is a limited guaranty executed by Portsmouth in favor of the mezzanine lender. On July 31, 2019, Mezzanine refinanced the mezzanine loan by entering into a new mezzanine loan agreement (New Mezzanine Loan Agreement) with Cred Reit Holdco LLC in the amount of $20,000,000. The prior Mezzanine Loan which had a 9.75% per annum interest rate was paid off. Interest rate on the new mezzanine loan is 7.25% and the loan matures on January 1, 2024. Interest only payments are due monthly.\nEffective May 11, 2017, InterGroup agreed to become an additional guarantor under the limited guaranty and an additional indemnitor under the environmental indemnity for Justice Investors limited partnerships $97,000,000 mortgage loan and the $20,000,000 mezzanine loan. Pursuant to the agreement, InterGroup is required to maintain certain net worth and liquidity. As of June 30, 2023, InterGroup is in compliance with both requirements. Justice Operating Company, LLC has not been meeting certain of its loan covenants such as the Debt Service Coverage Ratio (DSCR) which would trigger the creation of a lockbox by the Lender for all cash collected by the Hotel. However, such lockbox has been created and utilized from the loan inception and will be in place up to loan maturity regardless of the DSCR.\nOn July 2, 2014, the Partnership obtained from InterGroup an unsecured loan in the principal amount of $4,250,000 at 12% per year fixed interest, with a term of 2 years, payable interest only each month. InterGroup received a 3% loan fee. The loan may be prepaid at any time without penalty. The loan was extended to July 31, 2023. On December 16, 2020, the Partnership and InterGroup entered into a loan modification agreement which increased the Partnerships borrowing from InterGroup as needed up to $10,000,000. Upon the dissolution of the Partnership in December 2021, Portsmouth assumed the Partnerships note payable to InterGroup in the amount of $11,350,000. On December 31, 2021, Portsmouth and InterGroup entered into a loan modification agreement which increased Portsmouths borrowing from InterGroup as needed up to $16,000,000. As of June 30, 2023 and 2022, the balance of the loan was $15,700,000 and $14,200,000, net of loan amortization costs of zero, respectively. In July 2023, the note maturity date was extended to July 31, 2025 and the borrowing amount available was increased to $20,000,000. The Company agreed to a 0.5% loan extension and modification fee payable to InterGroup.\nAs disclosed in its Definitive Information Statement on Schedule 14C, filed with the SEC on January 25, 2021, Santa Fe received shareholder approval to distribute its assets, as described and subsequently dissolve, all as set forth in the Information Statement. As InterGroup formerly owned 83.7% of the outstanding common stock of Santa Fe, the Company received cash of $5,013,000 and 422,998 shares of Portsmouth common stock in March 2021 as a result of the liquidation of Santa Fe. As a former 3.7% shareholder of Santa Fe, the Companys President, Chairman of the Board and Chief Executive Officer, John Winfield, received cash of $221,000 and 18,641 shares of Portsmouth common stock in March 2021 as a result of the liquidation of Santa Fe. On April 12, 2021, Santa Fe received a filed stamped copy of its Articles of Dissolution from the State of Nevada, and Santa Fe is effectively fully dissolved and no longer in legal existence. In June 2022, InterGroup received distribution of $1,159,000 of from Santa Fe as the entity received federal and state tax refunds from previously filed final tax returns.\nFour of the Portsmouth directors serve as directors of InterGroup. The Companys Vice President Real Estate was elected President of Portsmouth in May 2021. The Companys director and Chairman of the Audit Committee, William J. Nance, serves as Comstocks director and Chairman of the Audit and Finance, Compensation and Nominating and Governance Committees of Comstock.\nAs Chairman of the Executive Strategic Real Estate and Securities Investment Committee, the Companys President and Chief Executive Officer (CEO), John V. Winfield, directs the investment activity of the Company in public and private markets pursuant to authority granted by the Board of Directors. Mr. Winfield also serves as Chief Executive Officer and Chairman of the Board of Portsmouth and oversees the investment activity of Portsmouth. Effective June 2016, Mr. Winfield became the Managing Director of Justice and served in that position until the dissolution of Justice in December 2021. Depending on certain market conditions and various risk factors, the Chief Executive Officer and Portsmouth may, at times, invest in the same companies in which the Company invests. Such investments align the interests of the Company with the interests of related parties because it places the personal resources of the Chief Executive Officer and the resources of Portsmouth, at risk in substantially the same manner as the Company in connection with investment decisions made on behalf of the Company.\nNOTE 10 - MORTGAGE NOTES PAYABLE\nOn December 18, 2013: (i) Justice Operating Company, LLC, a Delaware limited liability company (Operating), entered into a loan agreement (Mortgage Loan Agreement) with Bank of America (Mortgage Lender); and (ii) Justice Mezzanine Company, a Delaware limited liability company (Mezzanine), entered into a mezzanine loan agreement (Mezzanine Loan Agreement and, together with the Mortgage Loan Agreement, the Loan Agreements) with ISBI San Francisco Mezz Lender LLC (Mezzanine Lender and, together with Mortgage Lender, the Lenders). The Partnership was the sole member of Mezzanine until its dissolution in December 2021 when Portsmouth replaced the Partnership as the sole member of Mezzanine. Mezzanine is the sole member of Operating.\nThe Loan Agreements provide for a $97,000,000 Mortgage Loan and a $20,000,000 Mezzanine Loan. The proceeds of the Loan Agreements were used to fund the redemption of limited partnership interests and the pay-off of the prior mortgage.\nThe Mortgage Loan is secured by Operatings principal asset, the Hilton San Francisco-Financial District (the Property). The Mortgage Loan bears an interest rate of 5.275% per annum and matures in January 2024. The term of the loan is 10 years with interest only due in the first three years and principal and interest on the remaining seven years of the loan based on a thirty-year amortization schedule. The Mortgage Loan also requires payments for impounds related to property tax, insurance and capital improvement reserves. As additional security for the Mortgage Loan, there is a limited guaranty (Mortgage Guaranty) executed by Portsmouth in favor of the Mortgage Lender.\nThe Mezzanine Loan is secured by the Operating membership interest held by Mezzanine and is subordinated to the Mortgage Loan. The Mezzanine Loan had an interest rate of 9.75% per annum and a maturity date of January 1, 2024. Interest only payments were due monthly. On July 31, 2019, Mezzanine refinanced the Mezzanine Loan by entering into a new mezzanine loan agreement (New Mezzanine Loan Agreement) with Cred Reit Holdco LLC in the amount of $20,000,000. The prior Mezzanine Loan was paid off. Interest rate on the new mezzanine loan is 7.25% and the loan matures on January 1, 2024. Interest only payments are due monthly. As additional security for the new mezzanine loan, there is a limited guaranty executed by Portsmouth in favor of Cred Reit Holdco LLC (the Mezzanine Guaranty and, together with the Mortgage Guaranty, the Guaranties).\nThe Guaranties are limited to what are commonly referred to as bad boy acts, including: (i) fraud or intentional misrepresentations; (ii) gross negligence or willful misconduct; (iii) misapplication or misappropriation of rents, security deposits, insurance, or condemnation proceeds; and (iv) failure to pay taxes or insurance. The Guaranties are full recourse guaranties under identified circumstances, including failure to maintain single purpose status which is a factor in a consolidation of Operating or Mezzanine in a bankruptcy of another person, transfer, or encumbrance of the Property in violation of the applicable loan documents, Operating or Mezzanine incurring debts that are not permitted, and the Property becoming subject to a bankruptcy proceeding. Pursuant to the Guaranties, the Partnership was required to maintain a certain minimum net worth and liquidity. Effective as of May 12, 2017, InterGroup agreed to become an additional guarantor under the limited guaranty and an additional indemnitor under the environmental indemnity for the $97,000,000 mortgage loan and the $20,000,000 mezzanine loan. Pursuant to the agreement, InterGroup is required to maintain a certain net worth and liquidity. As of June 30, 2023 and 2022, InterGroup is in compliance with both requirements. Justice Operating Company, LLC is not meeting certain of its loan covenants such as the Debt Service Coverage Ratio (DSCR) which would trigger the creation of a lockbox and cash sweep by the Lender for all cash collected by the Hotel, and under certain terms, would allow the Lender to request Operating to replace its hotel management company. The DSCR for Operating had been below 1.00 from third quarter of fiscal year 2023 to fourth quarter of fiscal year 2023 while it is required to maintain a DSCR of at least 1.10 to 1.00 for two consecutive quarters. However, such lockbox has been created and utilized from the loan inception and will be in place up to loan maturity regardless of the DSCR. Justice has not missed any of its debt service payments and does not anticipate missing any debt obligations for at least the next twelve months and beyond. Additionally, Operatings DSCR for the fourth quarter of fiscal year 2023 was 0.23 for the Mortgage Loan and 0.19 for the Mezzanine Loan.\nEach of the Loan Agreements contains customary representations and warranties, events of default, reporting requirements, affirmative covenants and negative covenants, which impose restrictions on, among other things, organizational changes of the respective borrower, operations of the Property, agreements with affiliates and third parties. Each of the Loan Agreements also provides for mandatory prepayments under certain circumstances (including casualty or condemnation events) and voluntary prepayments, subject to satisfaction of prescribed conditions set forth in the Loan Agreements.\nIn July 2021, the Company refinanced three of its California properties existing mortgages totaling $1,065,000 with three new mortgages totaling $3,450,000. The Company generated net proceeds totaling $2,325,000 as a result of the refinancing. Interest rate on the three new mortgages is fixed at 3.50% for five years and the mortgages mature in July 2051. In July 2021, the Company obtained an $830,000 mortgage note payable on one of its unencumbered California properties and received net proceeds of $826,000. The interest rate on the mortgage is fixed at 3.50% for five years and the mortgage note payable matures in August 2051.\nOn October 14, 2021, the Company refinanced its $15,900,000 mortgage note payable on its 358-unit apartment complex in Irving, Texas and obtained a new mortgage note payable for $28,800,000. The Company received net proceeds of $12,938,000 as a result of the refinance. The annual interest rate on the mortgage is fixed at 2.95% for ten years with interest-only payments for the first five years and 30-year amortization thereafter. The mortgage loan matures in November 2031.\nOn June 30, 2022, the Company refinanced its $5,283,000 mortgage note payable on its 30-unit apartment complex in West Los Angeles, California and obtained a new mortgage note payable for $5,850,000. The Company received net proceeds of $522,000 as a result of the refinance. The annual interest rate on the mortgage is fixed at 4.4% for the first five years and 5.44% thereafter. The mortgage loan matures in July 2052.\nOn May 31, 2023, the Company refinanced its St. Louis, Missouri $4,823,000 mortgage with a two-year $5,360,000 mortgage with a floating monthly rate of the 30-day SOFR (capped at 5.5%) plus SOFR margin of 3.10%, interest-only payments are due for the first 12 months and $5,500 principal paydowns commencing in June 2024.\nEach mortgage notes payable is secured by real estate or the Hotel. As of June 30, 2023 and 2022, the mortgage notes payables are summarized as follows:\nAs of June 30, 2023\nNumber Note Note Mortgage Interest\nProperty of Units Origination Date Maturity Date Balance Rate\nSF Hotel 544 rooms December 2013 January 2024 $ 87,240,000 5.28 %\nSF Hotel 544 rooms July 2019 January 2024 20,000,000 7.25 %\nMortgage notes payable - Hotel 107,240,000\nDebt issuance costs\n(123,000 )\nTotal mortgage notes payable - Hotel $ 107,117,000\nFlorence March 2015 April 2025 $ 2,917,000 3.87 %\nLas Colinas October 2021 November 2031 28,800,000 2.95 %\nMorris County April 2020 May 2030 17,208,000 3.17 %\nSt. Louis May 2023 May 2025 5,360,000 8.60 %\nLos Angeles July 2021 July 2051 1,112,000 3.50 %\nLos Angeles July 2021 July 2051 674,000 3.50 %\nLos Angeles June 2021 August 2051 886,000 3.50 %\nLos Angeles October 2020 November 2030 8,291,000 2.52 %\nLos Angeles June 2022 July 2052 5,762,000 4.40 %\nLos Angeles January 2021 February 2031 2,645,000 3.05 %\nLos Angeles June 2016 June 2026 1,974,000 3.59 %\nLos Angeles June 2020 July 2030 2,443,000 3.09 %\nLos Angeles November 2020 December 2030 1,891,000 3.05 %\nLos Angeles July 2021 July 2051 1,535,000 3.50 %\nLos Angeles August 2012 September 2042 751,000 3.75 %\nLos Angeles June 2021 August 2051 1,112,000 3.50 %\nLos Angeles June 2021 August 2051 534,000 3.50 %\nLos Angeles July 2021 August 2051 800,000 3.50 %\nLos Angeles September 2018 October 2048 934,000 3.50 %\nMortgage notes payable - real estate 85,629,000\nDebt issuance costs\n(872,000 )\nTotal mortgage notes payable - real estate $ 84,757,000\nAs of June 30, 2022\nNumber Note Note Mortgage Interest\nProperty of Units Origination Date Maturity Date Balance Rate\nSF Hotel 544 rooms December 2013 January 2024 $ 89,114,000 5.28 %\nSF Hotel 544 rooms July 2019 January 2024 20,000,000 7.25 %\nMortgage notes payable - Hotel 109,114,000\nDebt issuance costs\n(367,000 )\nTotal mortgage notes payable - Hotel $ 108,747,000\nFlorence March 2015 April 2025 $ 2,998,000 3.87 %\nLas Colinas October 2021 November 2031 28,801,000 2.95 %\nMorris County April 2020 May 2030 17,598,000 3.17 %\nSt. Louis May 2013 May 2023 4,958,000 4.05 %\nLos Angeles July 2021 July 2051 1,135,000 3.50 %\nLos Angeles July 2021 July 2051 688,000 3.50 %\nLos Angeles June 2021 August 2051 904,000 3.50 %\nLos Angeles October 2020 November 2030 8,400,000 2.52 %\nLos Angeles June 2022 July 2052 5,850,000 4.40 %\nLos Angeles January 2021 February 2031 2,704,000 3.05 %\nLos Angeles June 2016 June 2026 2,026,000 3.59 %\nLos Angeles June 2020 July 2030 2,498,000 3.09 %\nLos Angeles November 2020 December 2030 1,934,000 3.05 %\nLos Angeles July 2021 July 2051 1,567,000 3.50 %\nLos Angeles August 2012 September 2042 774,000 3.75 %\nLos Angeles June 2021 August 2051 1,135,000 3.50 %\nLos Angeles June 2021 August 2051 545,000 3.50 %\nLos Angeles July 2021 August 2051 816,000 3.50 %\nLos Angeles September 2018 October 2048 956,000 4.75 %\nMortgage notes payable - real estate 86,287,000\nDebt issuance costs\n(850,000 )\nTotal mortgage notes payable - real estate $ 85,437,000\nFuture minimum payments for all mortgage notes payable are as follows:\nFor the year ending June 30,\n$ 108,420,000\n9,318,000\n1,168,000\n3,299,000\n1,771,000\nThereafter 68,894,000\n$ 192,870,000\nNOTE 11 - MANAGEMENT AGREEMENTS\nOperating entered into a hotel management agreement (HMA) with Aimbridge Hospitality (Aimbridge) to manage the Hotel, along with its five-level parking garage, with an effective date of February 3, 2017. The term of the management agreement is for an initial period of ten years commencing on the February 3, 2017 date and automatically renews for successive one (1) year periods, not to exceed five years in the aggregate, subject to certain conditions. Under the terms on the HMA, base management fee (Basic Fee) payable to Aimbridge shall be one and seven-tenths percent (1.70%) of total Hotel revenue. In addition to the Basic Fee, Aimbridge shall be entitled to an annual incentive fee for each fiscal year equal to ten percent (10%) of the amount by which Gross Operating Profit in the current fiscal year exceeds the previous fiscal years Gross Operating Profit.\nFor the fiscal years ended June 30, 2023 and 2022, hotel management fees were $711,000 and $530,000, and incentive fees of $505,000 and $525,000, respectively, offset by key money amortization of $250,000 for both years and are included in Hotel operating expenses in the consolidated statements of operations. As part of the Hotel management agreement, Aimbridge, through the Companys wholly owned subsidiary, Kearny Street Parking LLC, manages the parking garage in-house.\nNOTE 12 - CONCENTRATION OF CREDIT RISK\nAs of June 30, 2023 and 2022, receivables related to Hotel customers were $419,000 and $377,000, respectively. Usually, credit extended to the Companys tenants at its rental properties is of low risk as leases do not extend beyond one year and if tenants become delinquent, local eviction laws are used to evict tenants. However, as of June 30, 2023 and 2022 accounts receivable from the Companys rental properties was $698,000 and $366,000, respectively and allowance for doubtful accounts was $486,000 and $110,000, respectively. This unusual large gross receivable amounts from our rental properties was due to temporary eviction moratorium imposed by the federal and state governmental authorities since the beginning of the COVID19 pandemic. Under the eviction moratorium, the Company was not allowed to evict tenants for non-payment of rent. In the State of California, the Los Angeles Countys COVID-19 Tenant Protection Resolution expired on March 31, 2023, thereby lifting the eviction moratorium but allowing the tenants additional time to for their past due rent. For tenants that owe rent from March 1, 2020 through September 30, 2021, tenants must pay by August 1, 2023; for tenants that owe rent from October 1, 2021 through January 31, 2023, tenants must pay by February 1, 2024. The Company will continue to pursue its collections to the full extent allowed by the various governmental housing authorities around the country.\nThe Company maintains its cash and cash equivalents and restricted cash with various financial institutions that are monitored regularly for credit quality. At times, such cash and cash equivalents holdings may be in excess of the Federal Deposit Insurance Corporation (FDIC) or other federally insured limits. Any loss incurred or a lack of access to such funds could have significant adverse impact on the Companys financial condition, results of operations, and cash flows.\nNOTE 13 - INCOME TAXES\nThe provision for the Companys income tax (expense) benefit is comprised of the following:\nFor the years ended June 30,\nFederal\nCurrent tax $ (116,000 ) $ (113,000 )\nDeferred tax 6,420,000 884,000\n6,304,000 771,000\nState\nCurrent tax 9,000 (330,000 )\nDeferred tax 2,121,000 589,000\n2,130,000 259,000\nIncome Tax (expense) benefit $ (8,434,000 ) $ 1,030,000\nThe provision for income taxes differs from the amount of income tax computed by applying the federal statutory income tax rate to income before taxes as a result of the following differences:\nFor the years ended June 30,\nStatutory federal tax rate $ (315,000 ) $ 2,446,000\nState income taxes, net of federal tax benefit (375,000 ) 204,000\nDividend received deduction (18,000 ) 103,000\nPPP Loan forgiveness - 1,391,000\nProvision to return adjustment (334,000 ) 634,000\nDeferral true up - Justice difference in basis of fixed\nassets - 11,621,000\nNet operating loss true up (275,000 ) 32,000\nValuation allowance 10,232,000 (15,201,000 )\nPayable true up (249,000 ) (311,000 )\nState rate change impact (352,000 ) -\nOther 120,000 111,000\n$ (8,434,000 ) $ 1,030,000\nThe components of the deferred tax asset and liabilities are as follows:\nJune 30, 2023 June 30, 2022\nDeferred tax assets:\nNet operating loss carryforwards $ 13,187,000 $ 11,075,000\nDeferred gains on real estate sale and depreciation 15,054,000 10,418,000\nCapital loss carryforwards 1,919,000 1,322,000\nAccruals and reserves 843,000 831,000\nInterest expense 3,185,000 2,231,000\nTax credits 566,000 566,000\nState taxes 139,000 -\nOther 204,000 247,000\nDeferred Tax Asset before Valuation Allowance 35,097,000 26,690,000\nValuation Allowance (33,784,000 ) (22,775,000 )\nDeferred Tax Asset after Valuation Allowance 1,313,000 3,915,000\nDeferred tax liabilities:\nDeferred gains on real estate sale and depreciation (4,796,000 ) -\nUnrealized gain on marketable securities (746,000 ) (9,000 )\nGain on insurance claim (696,000 ) -\nOther - -\nState taxes - (294,000 )\nDeferred Tax Liability (6,238,000 ) (303,000 )\nNet deferred tax (liability) asset $ (4,925,000 ) $ 3,612,000\nManagement considers new evidence, both positive and negative, that could affect its view of the future realization of deferred tax assets. As of June 30, 2023, it has been determined that it is more likely than not that the deferred tax asset will not be recognized. Thus, there is a valuation allowance of $33,784,000 as of June 30, 2023. This was an increase of $11,009,000 from June 30, 2022.\nAs of June 30, 2023, the Company had net operating loss carryforwards (NOL) available for carryforward of approximately $41,835,000 and $51,289,000 for federal and state purposes, respectively. Of the $41,835,000 federal NOL carryforwards, $14,707,000 expire in varying amounts through 2037 and $27,128,000 of post-2017 NOLs can be carried forward indefinitely. Note that the post-2017 NOLs may only offset 80% of future taxable income. The Company had capital loss carryforwards of $6,936,000 for federal and state purposes. The capital losses begin to expire in 2024 for both federal and state purposes. There are immaterial California state tax credits of $524,000 which expire in various years.\nBelow is the breakdown of the net operating losses for Intergroup and Portsmouth.\nFederal State\nInterGroup $ - $ 2,789,000\nPortsmouth 41,835,000 48,500,000\n$ 41,835,000 $ 51,289,000\nAs of June 30, 2022, the Company had net operating loss (NOL) carryforwards of approximately $35,483,000 and $41,238,000 for federal and state purposes, respectively. Of the $35,483,000 federal NOLs carryforwards, $14,697,000 expire in varying amount through 2037 and $20,786,000 of post 2017 NOLs can be carried forward indefinitely. Note that the post 2017 NOLs may only offset 80% of future taxable income. The Company had federal and state capital loss carryforwards of $3,985,000 and $5,547,000, respectively. The capital losses begin to expire in 2024 for both federal and state purposes. There are immaterial California state tax credits of $524,000 which expire in various years.\nUtilization of certain tax attributes may be subject a substantial annual limitation if it should be determined that there has been a change in the ownership of more than 50 percent of the value of the Companys stock, pursuant to Section 382 of the Internal Revenue Code of 1986 and similar state provisions. The annual limitation may result in the expiration of net operating losses before utilization.\nThe corporation files tax returns as prescribed by the tax laws of the jurisdictions in which it operates and is subject to examination by federal, state, and local jurisdictions, where applicable.\nAs of June 30, 2023, tax years beginning in fiscal 2019 and 2018 remain open to examination by the federal and state tax jurisdictions, respectively, and are subject to the statute of limitations.\nUncertain Tax Positions\nThe Company regularly evaluates the likelihood of realizing the benefit from income tax positions that it has taken in various federal, state, and foreign filings by considering all relevant facts, circumstances and information available. If the Company determines it is more likely than not that the position will be sustained, a benefit will be recognized at the largest amount that it believes is cumulatively greater than 50% likely to be realized. The following table summarizes changes in the amount of the Companys unrecognized tax benefits for uncertain tax positions:\nUnrecognized Tax Benefits at June 30, 2022 $ -\nIncrease in tax positions taken 1,665,000\nDecrease in tax positions taken -\nUnrecognized Tax Benefits at June 30, 2023 $ 1,665,000\n$0 and $1,665,000 of unrecognized tax benefits as of June 30, 2022 and June 30, 2023, respectively, would impact the effective tax rate if recognized. The unrecognized tax benefit is not expected to reverse in the next 12 months. Interest and penalties related to income tax matters are classified as a component of income tax expense. As of June 30, 2022 and June 30, 2023, no interest and penalties were recorded.\nNOTE 14 - SEGMENT INFORMATION\nThe Company operates in three reportable segments, the operation of the Hotel (Hotel Operations), the operation of its multi-family residential properties (Real Estate Operations) and the investment of its cash in marketable securities and other investments (Investment Transactions). These three operating segments, as presented in the financial statements, reflect how management internally reviews each segments performance. Management also makes operational and strategic decisions based on this information.\nInformation below represents reported segments for the years ended June 30, 2023 and 2022. Segment income from Hotel operations consists of the operation of the Hotel and operation of the garage. Segment income from real estate operations consists of the operation of the rental properties. Loss from investments consists of net investment gain (loss), dividend and interest income and investment related expenses.\nAs of and for the year ended Hotel Real Estate Investment\nJune 30, 2023 Operations Operations Transactions Other Total\nRevenues $ 42,027,000 $ 15,580,000 $ - $ - $ 57,607,000\nSegment operating expenses (34,457,000 ) (10,017,000 ) - (3,333,000 ) (47,807,000 )\nSegment income (loss) from operations 7,570,000 5,563,000 - (3,333,000 ) 9,800,000\nInterest expense - mortgages (6,467,000 ) (2,118,000 ) - - (8,585,000 )\nGain on insurance recovery - 2,692,000 - - 2,692,000\nDepreciation and amortization expense (2,815,000 ) (2,649,000 ) - - (5,464,000 )\nGain from investments - - 58,000 - 58,000\nIncome tax expense - - - (8,433,000 ) (8,433,000 )\nNet income (loss) $ (1,712,000 ) $ 3,488,000 $ 58,000 $ (11,766,000 ) $ (9,932,000 )\nTotal assets $ 46,393,000 $ 48,057,000 $ 18,345,000 $ 9,563,000 $ 122,358,000\nAs of and for the year ended Hotel Real Estate Investment\nJune 30, 2022 Operations Operations Transactions Other Total\nRevenues $ 31,534,000 $ 15,685,000 $ - $ - $ 47,219,000\nSegment operating expenses (27,451,000 ) (8,694,000 ) - (2,651,000 ) (38,796,000 )\nSegment income (loss) from operations 4,083,000 6,991,000 - (2,651,000 ) 8,423,000\nInterest expense - mortgage (6,549,000 ) (2,332,000 ) - - (8,881,000 )\nGain on debt forgiveness 2,000,000 (335,000 ) - - 1,665,000\nDepreciation and amortization expense (2,310,000 ) (2,444,000 ) - - (4,754,000 )\nLoss from investments - - (8,101,000 ) - (8,101,000 )\nIncome tax benefit - - - 1,030,000 1,030,000\nNet income (loss) $ (2,776,000 ) $ 1,880,000 $ (8,101,000 ) $ (1,621,000 ) $ (10,618,000 )\nTotal assets $ 46,847,000 $ 48,025,000 $ 11,049,000 $ 21,125,000 $ 126,046,000\nNOTE 15 - STOCK-BASED COMPENSATION PLANS\nThe Company follows the Statement of Financial Accounting Standards 123 (Revised), Share-Based Payments (SFAS No. 123R), which was primarily codified into ASC Topic 718 Compensation - Stock Compensation, which addresses accounting for equity-based compensation arrangements, including employee stock options and restricted stock units.\nThe Company currently has one equity compensation plan, which is the Intergroup 2010 Omnibus Employee Incentive Plan. The plan has been approved by the Companys stockholders and are described below. Any outstanding options issued under the Key Employee Plan or the Non-Employee Director Plan remain effective in accordance with their terms.\nAs of June 30, 2023 and 2022, there were no RSUs outstanding.\nIntergroup Corporation 2010 Omnibus Employee Incentive Plan\nOn February 24, 2010, the shareholders of the Company approved The Intergroup Corporation 2010 Omnibus Employee Incentive Plan (the 2010 Incentive Plan), which was formally adopted by the Board of Directors following the annual meeting of shareholders. The Company believes that such awards better align the interests of its employees with those of its shareholders. Option awards are generally granted with an exercise price equal to the market price of the Companys stock at the date of grant; those option awards generally vest based on 5 years of continuous service. Certain option and share awards provide for accelerated vesting if there is a change in control, as defined in the 2010 Incentive Plan. The 2010 Incentive plan as modified in December 2013, authorizes a total of up to 400,000 shares of common stock to be issued as equity compensation to officers and employees of the Company in an amount and in a manner to be determined by the Compensation Committee in accordance with the terms of the 2010 Incentive Plan. The 2010 Incentive Plan authorizes the awards of several types of equity compensation including stock options, stock appreciation rights, performance awards and other stock-based compensation. The 2010 Incentive Plan had an original expiration date of February 23, 2020, if not terminated sooner by the Board of Directors upon recommendation of the Compensation Committee. Any awards issued under the 2010 Incentive Plan will expire under the terms of the grant agreement.\nThe shares of common stock to be issued under the 2010 Incentive Plan have been registered under the Securities Act, pursuant to a registration statement filed on Form S-8 by the Company on June 16, 2010. Once received, shares of common stock issued under the Plan will be freely transferable subject to any requirements of Section 16 (b) of the Exchange Act.\nOn March 16, 2010, the Compensation Committee authorized the grant of 100,000 stock options to the Companys Chairman, President and Chief Executive, John V. Winfield to purchase up to 100,000 shares of the Companys common stock pursuant to the 2010 Incentive Plan. The exercise price of the options is $10.30, which is 100% of the fair market value of the Companys Common Stock as determined by reference to the closing price of the Companys Common Stock as reported on the NASDAQ Capital Market on March 16, 2010, the date of grant. The options had an original expiration date ten years from the date of grant, unless terminated earlier in accordance with the terms of the 2010 Incentive Plan. The options shall be subject to both time and market-based vesting requirements, each of which must be satisfied before options are fully vested and eligible to be exercised. Pursuant to the time vesting requirements, the options vest over a period of five years, with 20,000 options vesting upon each one-year anniversary of the date of grant. Pursuant to the market vesting requirements, the options vest in increments of 20,000 shares upon each increase of $2.00 or more in the market price of the Companys common stock above the exercise price ($10.30) of the options. To satisfy this requirement, the common stock must trade at that increased level for a period of at least ten trading days during any one quarter. As of June 30, 2022, all the market vesting requirements have been met.\nOn December 28, 2019, the Compensation Committee of the Board of Directors recommended to the Board amendments to the 2010 Incentive Plan which would amend Section 1.3 to extend the term from ten years to sixteen years, and Section 6.4 to change tenth (10th) anniversary date to twentieth (20th) anniversary date. This would increase the term of the 2010 Incentive Plan to twenty years (expiring in February 2030 instead of February 2020) and also permit the existence of options with a term longer than ten years. The purpose of the amendment to the term is to extend its existence as our only incentive plan. The purpose of amendment of the allowable term of options is so that the Board may extend the term of the 100,000 options granted to John Winfield on March 16, 2010 from ten years to sixteen years so that these options will terminate on March 16, 2026 instead of on March 16, 2020, in recognition of Mr. Winfields contributions to and leadership of our Company. The recommended amendments were approved by shareholders on February 25, 2020.\nIn February 2012, the Compensation Committee awarded 90,000 stock options to the Companys Chairman, President and Chief Executive, John V. Winfield to purchase up to 90,000 shares of common stock. The per share exercise price of the options is $19.77 which is the fair value of the Companys Common Stock as reported on NASDAQ on February 28, 2012. The options expire ten years from the date of grant. The options are subject to both time and market-based vesting requirements, each of which must be satisfied before the options are fully vested and eligible to be exercised. Pursuant to the time vesting requirements, the options vest over a period of five years, with 18,000 options vesting upon each one-year anniversary of the date of grant. Pursuant to the market vesting requirements, the options vest in increments of 18,000 shares upon each increase of $2.00 or more in the market price of the Companys common stock above the exercise price ($19.77) of the options. To satisfy this requirement, the common stock must trade at that increased level for a period of at least ten trading days during any one quarter. On January 21, 2022, Mr. Winfield exercised 90,000 of his vested stock options by surrendering 35,094 shares of the Companys common stock at fair value as payment of the exercise price, resulting in a net issuance to him of 54,906 shares. No additional compensation expense was recorded related to the issuance. This intrinsic value of the cashless exercise of 54,906 stock options was approximately $2,784,000 at January 21, 2022 when the Companys stock closing stock price was $50.70.\nOn December 26, 2013, the Compensation Committee authorized, subject to shareholder approval, a grant of non-qualified and incentive stock options for an aggregate of 160,000 shares (the Option Grant) to the Companys President and Chief Executive Officer, John V. Winfield. The stock option grant was approved by shareholders on February 19, 2014. The grant of stock options was made pursuant to, and consistent with, the 2010 Incentive Plan, as proposed to be amended. The non-qualified stock options are for 133,195 shares and have a term of ten years, expiring on December 26, 2023, with an exercise price of $18.65 per share. The incentive stock options are for 26,805 shares and have a term of five years, expiring on December 26, 2018, with an exercise price of $20.52 per share. In accordance with the terms of the 2010 Incentive Plan, the exercise prices were based on 100% and 110%, respectively, of the fair market value of the Companys common stock as determined by reference to the closing price of the Companys common stock as reported on the NASDAQ Capital Market on the date of grant. The stock options are subject to time vesting requirements, with 20% of the options vesting annually commencing on the first anniversary of the grant date. In December 2018, Mr. Winfield exercised the 26,805 vested incentive stock options by surrendering 17,439 shares of the Companys common stock at fair value as payment of the exercise price, resulting in a net issuance to him of 9,366 shares. No additional compensation expense was recorded related to the issuance.\nIn March 2017, the Compensation Committee awarded 18,000 stock options to the Companys Chief Operating Officer, David C. Gonzalez, to purchase up to 18,000 shares of common stock. The per share exercise price of the options is $27.30 which is the fair value of the Companys Common Stock as reported on NASDAQ Capital Market on March 2, 2017. The options expire ten years from the date of grant. Pursuant to the time vesting requirements, the options vest over a period of five years, with 3,600 options vesting upon each one-year anniversary of the date of grant. All 18,000 shares are vested as of June 30, 2022.\nDuring the years ended June 30, 2023 and 2022, the Company recorded stock option compensation expense of zero and $4,000, respectively, related to stock options previously issued. As of June 30, 2023, all compensation related to stock options has been fully amortized.\nOption-pricing models require the input of various subjective assumptions, including the options expected life, estimated forfeiture rates and the price volatility of the underlying stock. The expected stock price volatility is based on analysis of the Companys stock price history. The Company has selected to use the simplified method for estimating the expected term. The risk-free interest rate is based on the U.S. Treasury interest rates whose term is consistent with the expected life of the stock options. No dividend yield is included as the Company has not issued any dividends and does not anticipate issuing any dividends in the future.\nThe following table summarizes the stock options activity from July 1, 2021 through June 30, 2023:\nNumber of Weighted Average Weighted Average Aggregate\nShares Exercise Price Remaining Life Intrinsic Value\nOutstanding at July 1, 2021 341,195 $ 16.95 2.83 years $ 8,890,000\nGranted\n- - - -\nExercised\n(90,000 ) 19.77 - -\nForfeited\n- - - -\nExchanged\n- - - -\nOutstanding at June 30, 2022 251,195 $ 15.95 2.60 years $ 6,628,000\nExercisable at June 30, 2022 251,195 $ 15.95 2.60 years $ 6,628,000\nVested at June 30, 2022 251,195 $ 15.95 2.60 years $ 6,628,000\nOutstanding at July 1, 2022 251,195 $ 15.95 2.60 years $ 6,628,000\nGranted\n- - - -\nExercised\n- - - -\nForfeited\n- - - -\nExchanged\n- - - -\nOutstanding at June 30, 2023 251,195 $ 15.95 1.60 years $ 4,957,000\nExercisable at June 30, 2023 251,195 $ 15.95 1.60 years $ 4,957,000\nVested and expected\nto vest at June 30, 2023 251,195 $ 15.95 1.60 years $ 4,957,000\nNOTE 16 - RELATED PARTY TRANSACTIONS\nAs discussed in Note 9 - Related Party and Other Financing Transactions, upon the dissolution of Justice in December 2021, Portsmouth assumed Justices note payable to InterGroup in the amount of $11,350,000. On December 31, 2021, Portsmouth and InterGroup entered into a loan modification agreement which increased Portsmouths borrowing from InterGroup as needed up to $16,000,000. As of June 30, 2023 and 2022, the balance of the loan was $15,700,000 and $14,200,000, respectively, net of loan amortization costs of zero, respectively, and are eliminated in the consolidated balance sheets of InterGroup. In July 2023, the note maturity date was extended to July 31, 2025 and the borrowing amount available was increased to $20,000,000. The Company agreed to a 0.5% loan extension and modification fee payable to InterGroup.\nAs of June 30, 2023, InterGroup owns approximately 75.7% of the outstanding common shares of Portsmouth. As of June 30, 2023, the Companys President, Chairman of the Board and Chief Executive Officer, John Winfield, owns approximately 2.5% of the outstanding common shares of Portsmouth. Mr. Winfield also serves as the Chairman of the Board and Chief Executive Officer of Portsmouth.\nAs Chairman of the Executive Strategic Real Estate and Securities Investment Committee, the Companys President and Chief Executive Officer (CEO), John V. Winfield, directs the investment activity of the Company in public and private markets pursuant to authority granted by the Board of Directors. Mr. Winfield also serves as Chief Executive Officer and Chairman of the Board of Portsmouth and oversees the investment activity of Portsmouth. Effective June 2016, Mr. Winfield became the Managing Director of Justice and served in that position until the dissolution of Justice in December 2021. Depending on certain market conditions and various risk factors, the Chief Executive Officer and Portsmouth may, at times, invest in the same companies in which the Company invests. Such investments align the interests of the Company with the interests of related parties because it places the personal resources of the Chief Executive Officer and the resources of Portsmouth, at risk in substantially the same manner as the Company in connection with investment decisions made on behalf of the Company.\nNOTE 17 - COMMITMENTS AND CONTINGENCIES\nCash Management Agreement\nAs part of the Hotel refinancing effective December 18, 2013, Operating entered into a Cash Management Agreement with Bank of America, N.A. (Lender) and Wells Fargo Bank, N.A. (Cash Management Bank) whereby all cash received by Operating is to be deposited into a business checking account controlled by the Cash Management Bank up to the loan maturity date. Additionally, other terms of the Cash Management Agreement provide that effective February 2019 or upon a Property Improvement Plan (PIP) requirement by Hilton (Franchisor) deemed the Cash Sweep Period during which all excess cash generated by Operating beyond the monthly budgeted expenses and debt services including principal and interest, insurance reserves, real estate taxes reserve, Furniture, fixtures, and equipment (FF&E) reserves, for the senior and mezzanine loans, will be held by the Cash Management Bank for future hotel improvements as required by the date or a PIP. Currently, any and all funds are being controlled by the Cash Management Bank according to the Cash Management Agreement.\nFranchise Agreements\nThe Partnership entered into a Franchise License Agreement (the License Agreement) with the HLT Existing Franchise Holding LLC (Hilton) on December 10, 2004. The term of the License agreement was for an initial period of 15 years commencing on the date the Hotel began operating as a Hilton hotel, with an option to extend the License Agreement for another five years, subject to certain conditions. On June 26, 2015, Operating and Hilton entered into an amended franchise agreement which amongst other things extended the License Agreement through 2030, and also provided the Partnership certain key money cash incentives to be earned through 2030.\nSince the opening of the Hotel as a full brand Hilton in January 2006, Justice has incurred monthly royalties, program fees and information technology recapture charges equal to a percentage of the Hotels gross room revenue. Fees for such services during fiscal year 2023 and 2022 totaled approximately $3,029,000 and $2,107,000, respectively.\nEmployees\nThe Companys corporate office and multifamily operations had 32 employees and the hotel operations had 187 employees as of June 30, 2023. On February 3, 2017, Aimbridge assumed all labor union agreements and provides all funding for all payroll and related costs. As of June 30, 2023, approximately 90% of those employees were represented by one of three labor unions, and their terms of employment were determined under various collective bargaining agreements (CBAs) to which Aimbridge was a party. CBA for Local 2 (Hotel and Restaurant Employees) expired on August 13, 2022 and a new Memorandum of Understanding (MOU) was signed June 26, 2023. CBA for Local 856 (International Brotherhood of Teamsters) expired on December 31, 2022 and a new agreement was signed on April 26, 2023. CBA for Local 39 (Stationary Engineers) will expire on July 31, 2024.\nNegotiation of collective bargaining agreements, which includes not just terms and conditions of employment, but scope and coverage of employees, is a regular and expected course of business operations for the Company and Aimbridge. The Company expects and anticipates that the terms of conditions of CBAs will have an impact on wage and benefit costs, operating expenses, and certain hotel operations during the life of each CBA and incorporates these principles into its operating and budgetary practices.\nLegal Matters\nPortsmouth Square, Inc., through its operating company Justice Investors Operating Company, LLC, a Delaware limited liability company (the Company), is the owner of the real property located at 750 Kearny Street in San Francisco, currently improved with a 27 - story building which houses a Hilton Hotel (the Property). The Property was purchased and improved pursuant to the terms of a series of agreements with the City and County of San Francisco (the City) in the early 1970s. The terms of the agreements and subsequent approvals and permits included a condition by which the Company was required to construct an ornamental overhead pedestrian bridge across Kearny Street, connecting the Property to a nearby City park and underground parking garage known as Portsmouth Square (the Bridge). Included in the approval process was the Citys issuance of a Major Encroachment Permit (Permit) allowing the Bridge to span over Kearney Street. As of May 24, 2022, the City has purported to revoke the Permit and on June 13, 2022, has directed the Company to submit a general bridge removal and restoration plan (the Plan) at the Companys expense. The Company disputes the legality of the purported revocation of the Permit. The Company further disputes the existence of any legal or contractual obligation to remove the Bridge at its expense. In particular, representatives of the Company participated in meetings with the City on and at various times after August 1, 2019, to discuss a collaborative process for the possible removal of the Bridge. Until the purported revocation of the Permit in 2022, the City representatives repeatedly and consistently promised and agreed that the City will pay for the associated costs of any Bridge removal. Nevertheless, without waiving any rights, in an effort to understand all of the available options, and to provide a response to the Citys directives, the Company has engaged a Project Manager, a structural engineering firm and an architect to advise on the development of a Plan for the Bridge removal, as well as the reconstruction of the front of the Hilton Hotel. The Company has been working cooperatively with the City on the process for removal of the Bridge and its related physical encroachments, including obtaining regulatory approvals and permits. A final Plan is currently not expected to be completed until late calendar year of 2023, and permits are unlikely to be obtained until mid-2024 at the earliest. The Company is currently in discussion with the City regarding both the process and financial responsibility for the implementation of the Plan and reconstruction of the impacted portions of the Hotel. Those discussions are expected to continue through the Autumn of 2023.\nThe Company may be subject to legal proceedings, claims, and litigation arising in the ordinary course of business. The Company will defend itself vigorously against any such claims. Management does not believe that the impact of such matters will have a material effect on the financial conditions or result of operations when resolved.\nNOTE 18 - SUBSEQUENT EVENTS\nThe Company evaluated subsequent events through the date that the accompanying financial statements were issued, and has determined that no material subsequent events exist through the date of this filing. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThere were no disagreements on any matter of accounting principles or practices, financial statement disclosure, nor auditing scope or procedure. Item 9A. Controls and Procedures.\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nDisclosure controls are procedures that are designed with the objective of ensuring that information required to be disclosed in our reports filed under the Exchange Act is recorded, processed, summarized, and reported within the time period specified in the SECs rules and forms. Disclosure controls are also designed with the objective of ensuring that such information is accumulated and communicated to our management, including the chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure.\nAs of June 30, 2023, as required by Rules 13a-15 and 15d-15 under the Exchange Act, our principal executive officer and principal financial and accounting officer carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures. Based upon their evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) were not effective because of a material weakness in our internal control over financial reporting. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. Specifically, the Companys management has concluded that our control around the interpretation and accounting for the deferred tax asset valuation allowance was not effectively designed or maintained. In light of this material weakness, we performed additional analysis as deemed necessary to ensure that our financial statements were prepared in accordance with GAAP. Accordingly, management believes that the financial statements included in this Annual Report on Form 10-K present fairly in all material respects our financial position, results of operations and cash flows for the period presented.\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nAs required by SEC rules and regulations implementing Section 404 of the Sarbanes-Oxley Act, our management is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our consolidated financial statements for external reporting purposes in accordance with U.S. GAAP. Our internal control over financial reporting includes those policies and procedures that:\n1. pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of our company,\n2. provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors, and\n3. provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect errors or misstatements in our consolidated financial statements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree or compliance with the policies or procedures may deteriorate. Management assessed the effectiveness of our internal control over financial reporting as of June 30, 2023. In making these assessments, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on our assessments and those criteria, management determined that our internal controls over financial reporting were not effective as of June 30, 2023.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nOther than the material weakness identified above, there were no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) during the most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth certain information with respect to the Directors and Executive Officers of the Company as of June 30, 2023:\nName\nPosition with the Company\nAge\nTerm to Expire\nClass A Directors:\nJohn V. Winfield (4)\nChairman of the Board; President and Chief Executive Officer\nFiscal 2023 Annual Meeting\nSteve Grunwald (3) (5)\nDirector\nFiscal\nClass B Directors:\nYvonne L. Murphy (1) (2) (4)\nDirector\nFiscal 2025 Annual Meeting\nWilliam J. Nance (2) (3) (4)\nDirector\nFiscal 2025 Annual Meeting\nClass C Director:\nJohn C. Love (1) (2) (3)\nDirector\nFiscal 2023 Annual Meeting\nExecutive Officers:\nDavid C. Gonzalez (4)\nChief Operating Officer, Advisor of Executive Strategic Real Estate and Securities Investment Committee, and President of Portsmouth\nN/A\nJolie Kahn\nSecretary\nN/A\nAnn Marie Blair\nTreasurer, Controller (Principal Financial Officer). Ms. Blair appointed effective July 6, 2023\nN/A\nDanfeng Xu\nTreasurer, Controller (Principal Financial Officer), and Secretary Resigned effective August 31, 2022\nN/A\n(1) Member of the Nominating Committee\n(2) Member of the Compensation Committee\n(3) Member of the Audit Committee\n(4) Member of the Executive Strategic Real Estate and Securities Investment Committee\nBusiness Experience:\nThe principal occupation and business experience during the last five years for each of the Directors and Executive Officers of the Company are as follows:\nJohn V. Winfield - Mr. Winfield was first appointed to the Board in 1982. He currently serves as the Companys Chairman of the Board, President and Chief Executive Officer, having first been appointed as such in 1987. Mr. Winfield also serves as Chairman and Chief Executive Officer of the Companys subsidiary Portsmouth, a public company. Effective June 2016, Mr. Winfield became the Managing Director of Justice and served in that position until the dissolution of Justice in December 2021. On May 24, 2021, Mr. Winfield resigned effective immediately as President of Portsmouth. Mr. Winfields extensive experience as an entrepreneur and investor, as well as his managerial and leadership experience from serving as a chief executive officer and director of public companies, led to the Boards conclusion that he should serve as a director of the Company.\nYvonne L. Murphy - Mrs. Murphy was elected to the Board of InterGroup in February 2014 and to the Board of Portsmouth, a subsidiary of the Company, in February 2019. She resigned from the Board of Portsmouth in December 2019. Mrs. Murphy was elected to the Board of Portsmouth in October 2022 and served as a director at Portsmouth from March to December 2019. Mrs. Murphy took the place of Director Babin upon his passing in October 2022. Mrs. Murphy has impressive experiences in corporate management, legal research, and legislative lobbying for over 30 years. She was a member of Governor Kenny C. Guinns executive staff in Nevada, and was employed for years by the prestigious Jones Vargas law firm in Reno, Nevada. She served in nine legislative sessions during the most challenging years in Nevadas history. Prior to starting her own lobbying firm, Ms. Murphy worked for RR Partners in its corporate office in Las Vegas, Nevada and in the Government Affairs Division in Reno. She has a Doctorate and a Masters in Business Administration from the California Pacific University. Mrs. Murphys impressive experience in corporate management, legal research and legislative lobbying led to the Boards conclusion that she should serve as a director of the Company.\nWilliam J. Nance - Mr. Nance is a Certified Public Accountant and private consultant to the real estate and banking industries. He is also President of Century Plaza Printers Inc. Mr. Nance was first elected to the Board in 1984. He served as the Companys Chief Financial Officer from 1987 to 1990 and as Treasurer from 1987 to June 2002. Mr. Nance is also a Director of Santa Fe and Portsmouth. Mr. Nance also serves as a director of Comstock Mining, Inc. Mr. Nances extensive experience as a CPA and in numerous phases of the real estate industry, his business and management experience gained in running his own businesses, his service as a director and audit committee member for other public companies and his knowledge and understanding of finance and financial reporting, led to the Boards conclusion that he should serve as a director of the Company.\nJohn C. Love - Mr. Love was appointed to the Board in 1998. Mr. Love is an international hospitality and tourism consultant. He is a retired partner in the national CPA and consulting firm of Pannell Kerr Forster and, for the last 30 years, a lecturer in hospitality industry management control systems and competition & strategy at Golden Gate University and San Francisco State University. He is Chairman Emeritus of the Board of Trustees of Golden Gate University and the Executive Secretary of the Hotel and Restaurant Foundation. Mr. Love is also a Director of Portsmouth and served on the Board of Santa Fe from March 1998 to December 2019. Mr. Loves extensive experience as a CPA and in the hospitality industry, including teaching at the university level for the last 30 years in management control systems, and his knowledge and understanding of finance and financial reporting, led to the Boards conclusion that he should serve as a director of the Company.\nJerold R. Babin - Mr. Babin was first appointed as a director of the Company in February 1996. Mr. Babin is also a director of Portsmouths parent company, InterGroup. Mr. Babin was a retail securities broker. From 1974 to 1989, he worked at Drexel Burnham, and from 1989 to 2010, he worked for Prudential Securities (later Wachovia Securities and now Wells Fargo Advisors), where he held the title of First Vice President. Mr. Babin retired from his position at Wells Fargo advisors in June 2010. Mr. Babin had also served as an arbitrator for FINRA (formerly NASD) for over 20 years. Mr. Babins extensive experience in the securities and financial markets, as well as his involvement in the securities and public company regulatory industry, led to the Boards conclusion that he should serve as a director of the Company. Mr. Babin served as a Board Member up to the time of his passing in October 2022.\nDavid C. Gonzalez - Mr. Gonzalez was appointed Chief Operating Officer of the Company on May 31, 2023 and previously was the Vice President Real Estate of the Company since January 31, 2001. Since 1989, Mr. Gonzalez has served in numerous capacities with the Company, including Controller and Director of Real Estate. Mr. Gonzalez was appointed advisor of the Executive Strategic Real Estate and Securities Investment Committee of the Company and Portsmouth in February 2020. The Board of Directors of Portsmouth Square, Inc. elected Mr. Gonzalez as President of Portsmouth Square Inc. effective May 24, 2021.\nAnn Marie Blair - Ms. Blair was appointed as Treasurer and Controller of the Company on July 6, 2023. Ms. Blair also serves as Treasurer and Controller of InterGroup, having been appointed to the position on July 6, 2023. Prior to joining the Company, she had served as Chief Financial Officer in the advertising technology industry. She obtained her Bachelor of Science degree in Accounting and her Master of Business Administration from Cumberland University.\nDanfeng Xu - Ms. Xu was appointed as Treasurer and Controller of the Company on October 16, 2017. Ms. Xu also serves as Treasurer and Controller of Portsmouth and Santa Fe, having been appointed to those positions on October 16, 2017. On June 1, 2018, she was appointed Secretary of the Company, Portsmouth and Santa Fe. Prior to joining the Company, she had served as Controller and worked in other positions at the Hotel from July 2010 to February 2017. She obtained her Bachelor of Science degree in Business Administration, Accounting and Finance from The Ohio State University and her Master of Professional Accounting, with a concentration in Audit and Assurance from University of Washington. Ms. Xu resigned effective August 31, 2022.\nFamily Relationships: There are no family relationships among directors, executive officers, or persons nominated or chosen by the Company to become directors or executive officers.\nInvolvement in Certain Legal Proceedings: No director or executive officer, or person nominated or chosen to become a director or executive officer, was involved in any legal proceeding requiring disclosure.\nCompliance with Section 16(a) of the Securities Exchange Act of 1934\nSection 16(a) of the Securities Exchange Act of 1934 requires the Companys officers and directors, and each beneficial owner of more than ten percent of the Common Stock of the Company, to file reports of ownership and changes in ownership with the Securities and Exchange Commission. Officers, directors and greater than ten-percent shareholders are required by SEC regulations to furnish the Company with copies of all Section 16(a) forms they file.\nBased solely on its review of the copies of Forms 3 and 4 and amendments thereto furnished to the Company during its most recent fiscal year and Forms 5 and amendments thereto furnished to the Company with respect to its most recent fiscal year, or written representations from certain reporting persons that no Forms 5 were required for those persons, the Company believes that during fiscal year 2023 all filing requirements applicable to its officers, directors, and greater than ten-percent beneficial owners were complied with.\nCode of Ethics.\nThe Company has adopted a Code of Ethics that applies to its principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions, including its Board of Directors. A copy of the Code of Ethics is posted on the Companys website at www.intgla.com. The Company will provide to any person without charge, upon request, a copy of its Code of Ethics by sending such request to: The InterGroup Corporation, Attn: Treasurer, 1516 S. Bundy Drive, Suite 200, Los Angeles, California 90025. The Company will promptly disclose any amendments or waivers to its Code of Ethics on Form 8-K and will post such information on its website.\nBOARD AND COMMITTEE INFORMATION\nInterGroups common stock is listed on the NASDAQ Capital Market tier of the NASDAQ Stock Market, LLC (NASDAQ). InterGroup is a Smaller Reporting Company under the rules and regulations of the Securities and Exchange Commission (SEC). With the exception of the Companys President and CEO, John V. Winfield, all of InterGroups Board of Directors consists of independent directors as independence is defined by the applicable rules of the SEC and NASDAQ.\nNominating Committee\nThe Companys Nominating Committee is comprised of two independent directors as independence is defined by the applicable rules of the SEC and NASDAQ. Directors Love and Murphy serve as the current members of the Nominating Committee. The Company has not established a charter for the Nominating Committee, and the Committee has no policy with regard to consideration of any director candidates recommended by security holders. As a smaller reporting company whose directors own in excess of sixty percent of the voting shares of the Company, InterGroup has not deemed it appropriate to institute such a policy. There have not been any material changes to the procedures by which security holders may recommend nominees to the Companys board of directors.\nAudit Committee and Audit Committee Financial Expert\nThe Company is a Smaller Reporting Company under SEC rules and regulations. The Companys Audit Committee is currently comprised of three members: Directors Nance (Chairperson), Babin and Love, each of whom meets the independence requirements of the SEC and NASDAQ as modified or supplemented from time to time. The Companys Board of Directors has determined that Directors Nance and Love also meet the Audit Committee Financial Expert requirement as defined by the SEC and NASDAQ based on their qualifications and business experience discussed above in this Item 10.\nCompensation Committee\nThe Companys Compensation Committee (the Compensation Committee) is comprised of three independent members of the Board of Directors as independence is defined by the applicable rules of the SEC and NASDAQ. Mr. Nance serves as Chairman of the Compensation Committee. The Company has not established a charter for the Compensation Committee. The Compensation Committee reviews and recommends to the Board of Directors the compensation for the Companys Chief Executive Officer and other executive officers, including equity or performance-based compensation and plans. The Compensation Committee seeks to design and set compensation to attract and retain highly qualified executive officers and to align their interests with those of long-term owners of the Company. The Compensation Committee may also make recommendations to the Board of Directors as to the amount and form of director compensation. The Compensation Committee has not engaged any compensation consultants in determining the amount or form of executive of director compensation but does review and monitor published compensation surveys and studies. The Compensation Committee may delegate to the Companys Chief Executive Officer the authority to determine the compensation of certain executive officers. The Compensation Committee also oversees the Companys 2010 Incentive Plan. Item 11. Executive Compensation\nThe following table provides certain summary information concerning compensation awarded to, earned by, or paid to the Companys principal executive officer and other named executive officers of the Company whose total compensation exceeded $100,000 for all services rendered to the Company and its subsidiaries for each of the Companys last two completed fiscal years ended June 30, 2023 and 2022. There was no non-equity incentive plan compensation or nonqualified deferred compensation earnings. There are currently no employment contracts with the executive officers.\nSUMMARY COMPENSATION TABLE\nName and Position Fiscal\nYear Salary Bonus Other\nCompensation Total\nJohn V. Winfield $ 838,000 (1) $ 600,000 $ 59,000 (2) $ 1,497,000 (3)\nChairman, President and $ 838,000 (1) $ - $ 59,000 (2) $ 897,000 (3)\nChief Executive Officer\nDavid C. Gonzalez $ 444,000 $ 600,000 $ - $ 1,044,000 (4)\nChief Operating Officer $ 409,000 $ - $ - $ 409,000 (4)\nDanfeng Xu $ 39,000 $ - $ - $ 39,000 (3)\nTreasurer and Controller $ 171,000 $ 10,000 $ - $ 181,000 (3)\n(Principal Financial Officer,\nresigned August 2022)\n(1) Mr. Winfield also serves as Chairman of the Board of Portsmouth. During fiscal year 2023, Mr. Winfield received salary of $433,000 from Portsmouth. The amounts include directors fees totaling $6,000 and $6,000 for the fiscal years 2023 and 2022, respectively.\n(2) Compensation for a portion of the salary of an assistant to Mr. Winfield.\n(3) Compensation is allocated approximately 50% to the Company and 50% to Portsmouth.\n(4) Mr. Gonzalez also serves as the President of Portsmouth. Compensation is allocated 67% to the company and 33% to Portsmouth.\nOutstanding Equity Awards at Fiscal Year Ended June 30, 2023\nThe following table sets forth information concerning option awards and stock awards for each named executive officer that were outstanding as of the end of the Companys last completed fiscal year ended June 30, 2023. There were no other equity incentive plan awards that were outstanding.\nOption Awards\nNumber of\nNumber of\nsecurities\nsecurities\nunderlying\nunderlying\nunexercised\nunexercised\nOption\nOption\noptions (#)\noptions (#)\nexercise\nexpiration\nName\nexercisable\nUn-exercisable\nprice $\ndate\nJohn V. Winfield\n100,000 (1)\n-\n$ 10.30\n3/16/26\nJohn V. Winfield\n133,195 (2)\n-\n$ 18.65\n12/26/23\nDavid C. Gonzalez\n18,000 (3)\n-\n$ 27.30\n3/2/27\n(1) Stock options issued to Mr. Winfield pursuant to the Companys 2010 Incentive Plan are subject to both time and performance-based vesting requirements, each of which must be satisfied before the options are fully vested and eligible to be exercised. Pursuant to the time vesting requirements, the options vest over a period of five years, with 20,000 options vesting upon each one-year anniversary of the date of grant, March 16, 2010. Pursuant to the performance vesting requirements, the options vest in increments of 20,000 shares upon each increase of $2.00 or more in the market price of the Companys common stock above the exercise price ($10.30) of the options. To satisfy this requirement, the common stock must trade at that increased level for a period of at least ten trading days during any one quarter. As of June 30, 2023, the performance vesting requirements of the options were satisfied.\n(2) On December 26, 2013, the Compensation Committee authorized, subject to shareholder approval, a grant of non-qualified and incentive stock options for an aggregate of 160,000 shares (the Option Grant) to the Companys President and Chief Executive Officer, John V. Winfield. The stock option grant was approved by shareholders on February 19, 2014. The grant of stock options was made pursuant to, and consistent with, the 2010 Incentive Plan, as proposed to be amended. The non-qualified stock options are for 133,195 shares and have a term of ten years, expiring on December 26, 2023, with an exercise price of $18.65 per share. The incentive stock options are for 26,805 shares and have a term of five years, expiring on December 26, 2018, with an exercise price of $20.52 per share. In accordance with the terms of the 2010 Incentive Plan, the exercise prices were based on 100% and 110%, respectively, of the fair market value of the Companys common stock as determined by reference to the closing price of the Companys common stock as reported on the NASDAQ Capital Market on the date of grant. The stock options are subject to time vesting requirements, with 20% of the options vesting annually commencing on the first anniversary of the grant date. In December 2018, Mr. Winfield exercised the 26,805 vested incentive stock options by surrendering 17,439 shares of the Companys common stock at fair value as payment of the exercise price, resulting in a net issuance to him of 9,366 shares. No additional compensation expense was recorded related to the issuance.\n(3) Mr. Gonzalezs stock options vest over a period of five years, with 3,600 options vesting upon each one-year anniversary of the date of grant, March 2, 2017.\nInternal Revenue Code Limitations\nSection 162(m) of the Internal Revenue Code of 1986, as amended (the Code), provides that, in the case of a publicly held corporation, the corporation is not generally allowed to deduct remuneration paid to its chief executive officer and certain other highly compensated officers to the extent that such remuneration exceeds $1,000,000 for the taxable year. Certain remuneration, however, is not subject to disallowance, including compensation paid on a commission basis and, if certain requirements prescribed by the Code are satisfied, other performance-based compensation. Since InterGroup and Portsmouth are both public companies, the $1,000,000 limitation applies separately to the compensation paid by each entity. Stock option expenses are also amortized over a several years. For fiscal years 2023 and 2022, no compensation paid by the Company to its CEO or other executive officers was subject the deduction disallowance prescribed by Section 162(m) of the Code.\nEQUITY COMPENSATION PLANS\nThe Company currently has one equity compensation plan, which has been approved by the Companys stockholders. However, any outstanding stock options issued under the Companys prior equity compensation plans remain effective in accordance with their terms.\nThe purpose of the Companys equity compensation plans is to provide a means whereby officers, directors and key employees of the Company develop a sense of proprietorship and personal involvement in the development and financial success of the Company, and to encourage them to devote their best efforts to the business of the Company, thereby advancing the interests of the Company and its shareholders. A further purpose of these plans is to provide a means through which the Company may attract able individuals to become employees or serve as directors of the Company and to provide a means for such individuals to acquire and maintain stock ownership in the Company, thereby strengthening their concern for the welfare of the Company.\nThe InterGroup Corporation 2010 Omnibus Employee Incentive Plan\nOn February 24, 2010, the shareholders of the Company approved The InterGroup Corporation 2010 Omnibus Employee Incentive Plan (the 2010 Incentive Plan), which was formally adopted by the Board of Directors following the annual meeting of shareholders. The 2010 Incentive Plan as modified in December 2013, authorizes a total of up to 400,000 shares of common stock to be issued as equity compensation to officers and employees of the Company in an amount and in a manner to be determined by the Compensation Committee in accordance with the terms of the Plan. The 2010 Incentive Plan authorizes the awards of several types of equity compensation including stock options, stock appreciation rights, performance awards and other stock-based compensation. The 2010 Incentive Plan had an original expiration date of February 23, 2020, if not terminated sooner by the Board of Directors upon recommendation of the Compensation Committee. Any awards issued under the Plan will expire under the terms of the grant agreement.\nThe shares of common stock to be issued under the 2010 Incentive Plan have been registered under the Securities Act, pursuant to a registration statement filed on Form S-8 by the Company on June 16, 2010. Once received, shares of common stock issued under the Plan will be freely transferable subject to any requirements of Section 16(b) of the Exchange Act.\nOn March 16, 2010, the Compensation Committee authorized the grant of 100,000 stock options to the Companys Chairman, President and Chief Executive, John V. Winfield to purchase up to 100,000 shares of the Companys common stock pursuant to the 2010 Incentive Plan. The exercise price of the options is $10.30, which is 100% of the fair market value of the Companys Common Stock as determined by reference to the closing price of the Companys Common Stock as reported on the NASDAQ Capital Market on March 16, 2010, the date of grant. The options had an original expiration date ten years from the date of grant, unless terminated earlier in accordance with the terms of the 2010 Incentive Plan. The options shall be subject to both time and market-based vesting requirements, each of which must be satisfied before options are fully vested and eligible to be exercised. Pursuant to the time vesting requirements, the options vest over a period of five years, with 20,000 options vesting upon each one-year anniversary of the date of grant. Pursuant to the market vesting requirements, the options vest in increments of 20,000 shares upon each increase of $2.00 or more in the market price of the Companys common stock above the exercise price ($10.30) of the options. To satisfy this requirement, the common stock must trade at that increased level for a period of at least ten trading days during any one quarter. As of June 30, 2023, all the market vesting requirements have been met.\nOn December 28, 2019, the Compensation Committee of the Board of Directors recommended to the Board amendments to the 2010 Incentive Plan which would amend Section 1.3 to extend the term from ten years to sixteen years, and Section 6.4 to change tenth (10th) anniversary date to twentieth (20th) anniversary date. This would increase the term of the 2010 Incentive Plan to twenty years (expiring in February 2030 instead of February 2020) and also permit the existence of options with a term longer than ten years. The purpose of the amendment to the term is to extend its existence as our only incentive plan. The purpose of amendment of the allowable term of options is so that the Board may extend the term of the 100,000 options granted to John Winfield on March 16, 2010 from ten years to sixteen years so that these options will terminate on March 16, 2026 instead of on March 16, 2020, in recognition of Mr. Winfields contributions to and leadership of our Company. The recommended amendments were approved by shareholders on February 25, 2020.\nIn February 2012, the Compensation Committee awarded 90,000 stock options to the Companys Chairman, President and Chief Executive, John V. Winfield to purchase up to 90,000 shares of common stock. The per share exercise price of the options is $19.77 which is the fair value of the Companys Common Stock as reported on NASDAQ on February 28, 2012. The options expire ten years from the date of grant. The options are subject to both time and market-based vesting requirements, each of which must be satisfied before the options are fully vested and eligible to be exercised. Pursuant to the time vesting requirements, the options vest over a period of five years, with 18,000 options vesting upon each one-year anniversary of the date of grant. Pursuant to the market vesting requirements, the options vest in increments of 18,000 shares upon each increase of $2.00 or more in the market price of the Companys common stock above the exercise price ($19.77) of the options. To satisfy this requirement, the common stock must trade at that increased level for a period of at least ten trading days during any one quarter. On January 21, 2022, Mr. Winfield exercised 90,000 of his vested stock options by surrendering 35,094 shares of the Companys common stock at fair value as payment of the exercise price, resulting in a net issuance to him of 54,906 shares. No additional compensation expense was recorded related to the issuance.\nOn December 26, 2013, the Compensation Committee authorized, subject to shareholder approval, a grant of non-qualified and incentive stock options for an aggregate of 160,000 shares (the Option Grant) to the Companys President and Chief Executive Officer, John V. Winfield. The stock option grant was approved by shareholders on February 19, 2014. The grant of stock options was made pursuant to, and consistent with, the 2010 Incentive Plan, as proposed to be amended. The non-qualified stock options are for 133,195 shares and have a term of ten years, expiring on December 26, 2023, with an exercise price of $18.65 per share. The incentive stock options are for 26,805 shares and have a term of five years, expiring on December 26, 2018, with an exercise price of $20.52 per share. In accordance with the terms of the 2010 Incentive Plan, the exercise prices were based on 100% and 110%, respectively, of the fair market value of the Companys common stock as determined by reference to the closing price of the Companys common stock as reported on the NASDAQ Capital Market on the date of grant. The stock options are subject to time vesting requirements, with 20% of the options vesting annually commencing on the first anniversary of the grant date. In December 2018, Mr. Winfield exercised the 26,805 vested incentive stock options by surrendering 17,439 shares of the Companys common stock at fair value as payment of the exercise price, resulting in a net issuance to him of 9,366 shares. No additional compensation expense was recorded related to the issuance.\nIn March 2017, the Compensation Committee awarded 18,000 stock options to the Companys Vice President of Real Estate, David C. Gonzalez, to purchase up to 18,000 shares of common stock. The per share exercise price of the options is $27.30 which is the fair value of the Companys Common Stock as reported on NASDAQ Capital Market on March 2, 2017. The options expire ten years from the date of grant. Pursuant to the time vesting requirements, the options vest over a period of five years, with 3,600 options vesting upon each one-year anniversary of the date of grant.\nCompensation of Directors\nEffective as of fiscal year ended June 30, 2011, annual cash compensation payable to non-employee directors has been $12,000. With the exception of members of the Audit Committee, non-employee directors do not receive any additional fees for attending Board or Committee meetings but are entitled to reimbursement of their reasonable expenses to attend such meetings. Members of the Audit Committee are paid a fee of $1,000 per quarter, with the Chair of that Committee to receive $1,500 per quarter. As an executive officer, the Companys Chairman has elected to forego his annual board fees.\nThe following table sets forth the compensation paid to directors during the fiscal year ended June 30, 2023:\nDIRECTOR COMPENSATION\nFees Earned or\nAll Other\nName\nPaid in Cash*\nStock Awards\nCompensation\nTotal\nJohn C. Love\n$ 46,000 (1)\n-\n-\n$ 46,000\nWilliam J. Nance\n$ 48,000 (2)\n-\n-\n$ 48,000\nSteve Grunwald\n$ 18,000\n-\n-\n$ 18,000\nJerold R. Babin\n$ 44,000 (3)\n-\n-\n$ 44,000\nYvonne L. Murphy\n$ 34,000\n-\n-\n$ 34,000\nJohn V. Winfield (4)\n-\n-\n-\n* Amounts shown include board retainer fees, committee fees and meeting fees.\n(1) Mr. Love also serves as director of the Companys subsidiary, Portsmouth. Amounts shown include $8,000 in regular board and audit committee fees paid by Portsmouth.\n(2) Mr. Nance also serves as a director of the Companys subsidiary, Portsmouth. Amounts shown include $8,000 in regular board and audit committee fees paid by Portsmouth.\n(3) Mr. Babin also served as a director of Portsmouth up to his passing away in October 2022. Amounts shown include $6,000 in regular board fees paid by Portsmouth.\n(4) As Chief Executive Officer, the Companys Chairman, John V. Winfield, was not paid any board, committee or meetings fees. Mr. Winfield received $6,000 in regular board fees from Portsmouth, which is reported on the Summary Compensation Table.\nChange in Control or Other Arrangements\nExcept for the foregoing, there are no other arrangements for compensation of Directors and there are no employment contracts between the Company and its Directors or any change in control arrangements. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners.\nThe following table sets forth, as of August 21, 2023, certain information with respect to the beneficial ownership of Common Stock of the Company owned by those persons or groups known by the Company to own more than five percent of the outstanding shares of Common Stock.\nName and Address of Beneficial Owner Amount and Nature of\nBeneficial Ownership (1)\nPercent\nof Class (2)\nJohn V. Winfield 1,686,374 (3) 68.6 %\n1516 S. Bundy Drive, Suite 200 Los Angeles, California 90025\n(1) Unless otherwise indicated and subject to applicable community property laws, each person has sole voting and investment power with respect to the shares beneficially owned.\n(2) Percentages are calculated on the basis of 2,205,527 shares of Common Stock outstanding as of August 21, 2023, plus any securities that person has the right to acquire within 60 days pursuant to options, warrants, conversion privileges or other rights.\n(3) Includes 233,195 shares that Mr. Winfield has a right to acquire pursuant to vested stock options.\nSecurity Ownership of Management.\nThe following table sets forth, as of August 21, 2023, certain information with respect to the beneficial ownership of Common Stock of the Company owned by (i) each Director and each of the named Executive Officers, and (ii) all Directors and Executive Officers as a group.\nName of Beneficial Owner\nAmount and Nature of Beneficial Ownership (1)\nPercent\nof Class (2)\nJohn V. Winfield\n1,686,374\n(3)\n.0 %\nWilliam J. Nance\n47,946\n2.0 %\nJohn C. Love\n8,561\n*\nDavid C. Gonzalez\n44,769 (4)\n1.8 %\nYvonne L. Murphy\n2,282\n*\nAll Directors and Executive Officers as a Group (5 persons)\n1,789,932\n72.9 %\n* Ownership does not exceed 1%.\n(1) Unless otherwise indicated and subject to applicable community property laws, each person has sole voting and investment power with respect to the shares beneficially owned.\n(2) Percentages are calculated on the basis of 2,205,527 shares of Common Stock outstanding at August 21, 2023, plus any securities that person has the right to acquire within 60 days pursuant to options, warrants, conversion privileges or other rights.\n(3) Includes 233,195 shares that Mr. Winfield has a right to acquire pursuant to vested stock options.\n(4) Includes 18,000 shares that Mr. Gonzalez has a right to acquire pursuant to vested stock options.\nChanges in Control.\nThere are no arrangements that may result in a change in control of the Company.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS.\nThe following table sets forth information as of June 30, 2023 with respect to compensation plans (including individual compensation arrangements) under which equity securities of the Company are authorized for issuance, aggregated as follows:\nPlan category Number of\nsecurities\nto be issued upon\nexercise of\noutstanding\noptions, warrants\nand rights Weighted average\nexercise price of\noutstanding options\nwarrants and\nrights\nRemaining available for\nfuture issuance under\nequity compensation\nplans (excluding\nsecurities\nreflected in column (a))\n(a) (b) (c)\nEquity compensation plans approved by security holders 251,195 $ 15.95 None\nEquity compensation plans not approved by security holders None N/A None\nTotal 251,195 $ 15.95 None\n(a) There were 251,195 stock options outstanding as of June 30, 2023.\n(b) Reflects the weighted average exercise price of all outstanding options. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nMr. Winfield owns 2.5% of Portsmouth. Director William Nance is a director and Chairman of the Audit Committee of Comstock Mining, Inc., since 2005.\nTwo general partners provided services to the Partnership through December 17, 2013. On December 18, 2013, the Partnership redeemed Evons partnership interest and Portsmouth Square became the sole general partner. The Partnerships obligation to pay Evon, Justices former general partner, terminated as of December 18, 2013. Under the terms of the Justice Partnership Agreement, its general partner, Portsmouth, received annual compensation of one percent of Hotel Revenue up to the dissolution of the Partnership in December 2021. During each of the years ended June 30, 2023 and 2022, total compensation earned by Portsmouth under the new and previous agreements were $130,000 and $146,000, respectively. Amounts earned by Portsmouth are eliminated in consolidation. Effective with the dissolution of the Partnership, the compensation to Portsmouth from the hotel was terminated.\nAs Chairman of the Executive Strategic Real Estate and Securities Investment Committee, the Companys President and Chief Executive Officer (CEO), John V. Winfield, directs the investment activity of the Company in public and private markets pursuant to authority granted by the Board of Directors. Mr. Winfield also serves as Chief Executive Officer and Chairman of the Portsmouth, and oversees the investment activity of Portsmouth. Effective June 2016, Mr. Winfield became the Managing Director of Justice and served in that position until the dissolution of Justice in December 2021. Depending on certain market conditions and various risk factors, the Chief Executive Officer and Portsmouth may, at times, invest in the same companies in which the Company invests. Such investments align the interests of the Company with the interests of related parties because it places the personal resources of the Chief Executive Officer and the resources of Portsmouth, at risk in substantially the same manner as the Company in connection with investment decisions made on behalf of the Company.\nDirector Independence\nInterGroups common stock is listed on the NASDAQ Capital Market tier of the NASDAQ Stock Market LLC. InterGroup is a Smaller Reporting Company under the rules and regulations of the SEC. The Board of Directors of InterGroup currently consists of five members. With the exception of the Companys President and CEO, John V. Winfield, all of InterGroups Board of Directors consists of independent directors as independence is defined by the applicable rules of the SEC and NASDAQ. There are no members of the Companys compensation, nominating or audit committees that do not meet those independence standards. Item 14. Principal Accounting Fees and Services\nOn January 31, 2022, the Audit Committee retained WithumSmith+Brown, PC, PCAOB ID: 100 (Withum) as the Companys new independent registered public accounting firm upon the resignation of Moss Adams LLP, Irvine CA, PCAOB ID: 659 (Moss Adams) in December 2021. The aggregate fees billed for each of the last two fiscal years ended June 30, 2023 and 2022 for professional services rendered by Withum and Moss Adams are set forth in the table below. These fees were billed for audit of the Companys annual financial statements, review of financial statements included in the Companys Form 10-Q reports, and services provided in connection with statutory and regulatory filings and engagements for those fiscal years.\nFiscal Year\nAudit fees - Withum $ 215,000 $ 52,000\nTax fees - Withum 131,000 31,000\nAudit fees - Moss Adams - 207,000\nTax fees - Moss Adams - 95,000\nTOTAL: $ 346,000 $ 385,000\nAudit Committee Pre-Approval Policies\nThe Audit Committee shall pre-approve all auditing services and permitted non-audit services (including the fees and terms thereof) to be performed for the Company by its independent registered public accounting firm, subject to any de minimis exceptions that may be set for non-audit services described in Section 10A(i)(1)(B) of the Exchange Act which are approved by the Committee prior to the completion of the audit. The Committee may form and delegate authority to subcommittees consisting of one or more members when appropriate, including the authority to grant pre-approvals of audit and permitted non-audit services, provided that decisions of such subcommittee to grant pre-approvals shall be presented to the full Committee at its next scheduled meeting. All of the services described herein were approved by the Audit Committee pursuant to its pre-approval policies.\nNone of the hours expended on the independent registered public accounting firms engagement to audit the Companys financial statements for the most recent fiscal year were attributed to work performed by persons other than the independent registered public accounting firms full-time permanent employees.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a)(1) Financial Statements\nThe following financial statements of the Company are included in Part II, Item 8 of this Report at pages 32 through 64:\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets - June 30, 2023 and 2022\nConsolidated Statements of Operations for Years Ended June 30, 2023 and 2022\nConsolidated Statements of Shareholders Deficit for Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for Years Ended June 30, 2023 and 2022\nNotes to the Consolidated Financial Statements\n(a)(2) Financial Statement Schedules\nAll other schedules for which provision is made in Regulation S-X have been omitted because they are not required or are not applicable or the required information is shown in the consolidated financial statements or notes to the consolidated financial statements.\n(a)(3) Exhibits\nSet forth below is an index of applicable exhibits filed with this report according to exhibit table number.\nExhibit Number\nDescription\n3.(i)\nArticles of Incorporation:\n3.1\nCertificate of Incorporation, dated September 11, 1985, incorporated by reference to Exhibit 3.1 of the Companys Registration Statement on Form S-4, filed on September 6, 1985 (Registration No. 33-00126) and Amendment 1 to that Registration Statement filed on October 23, 1985.\n3.2\nRestated Certificate of Incorporation, dated March 9, 1998, incorporated by reference to Exhibit 3 of the Companys Amended Quarterly Report on Form 10-QSB/A for the period ended March 31, 1998, as filed on May 19, 1998.\n3.3\nCertificate of Amendment to Certificate of Incorporation, dated October 2, 1998, incorporated by reference to Exhibit 3 of the Companys Quarterly report on Form 10-QSB for the period ended September 30, 1998, as filed on November 13, 1998.\n3.4\nCertificate of Amendment of Certificate of Incorporation filed with the Delaware Secretary of State on August 6, 2007, incorporated by reference to Exhibit 3.4 of the Companys Annual Report on Form 10-KSB for the year ended June 30, 2007 as filed on September 28, 2007.\n3.(ii)\nAmended and Restated By-Laws of The InterGroup Corporation, effective as of December 10, 2007, incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K as filed on December 12, 2007.\n4.\nInstruments defining the rights of security holders including indentures*\n9.\nVoting Trust Agreement: Voting Trust Agreement dated June 30, 1998 between John V. Winfield and The InterGroup Corporation is incorporated by reference to the Companys Annual Report on Form 10-KSB filed with the Commission on September 28, 1998.\n10.\nMaterial Contracts:\n10.1\n1998 Stock Option Plan for Non-Employee Directors approved by the Board of Directors on December 8, 1998 and ratified by the shareholders on January 27, 1999 (incorporated by reference to the Companys Proxy Statement on Schedule 14A filed with the Commission on December 21, 1998).\n10.2\n1998 Stock Option Plan for Selected Key Officers, Employees and Consultants approved by the Board of Directors on December 8, 1998 and ratified by the shareholders on January 27, 1999 (incorporated by reference to the Companys Proxy Statement on Schedule 14A filed with the Commission on December 21, 1998).\n10.3\nThe InterGroup Corporation 2007 Stock Compensation Plan for Non-Employee Directors (incorporated by reference to the Companys Proxy Statement on Schedule 14A filed with the Commission on January 26, 2007).\n10.4\nAmended and Restated Agreement of Limited Partnership of Justice Investors, effective November 30, 2010 (incorporated by reference to Exhibit 10.1 to the Companys Form 10-Q Report for the quarterly period ended December 31, 2010, filed with the Commission on February 11, 2011).\n10.5\nGeneral Partner Compensation Agreement, dated December 1, 2008 (incorporated by reference to Exhibit 10.2 to Companys Form 10-Q Report for the quarterly period ended December 31, 2008, filed with the Commission on February 13, 2009).\n10.6\nThe InterGroup Corporation 2008 Restricted Stock Unit Plan, adopted by the Board of Directors on December 3, 2008, and ratified by the shareholders on February 18, 2009 (incorporated by reference to the Companys Proxy Statement on Schedule 14A, filed with the Commission on January 21, 2009).\n10.7\nRestricted Stock Unit Agreement, dated February 18, 2009, between The InterGroup Corporation and John V. Winfield (incorporated by reference to Exhibit 10.7 of the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2009, as filed with the Commission on October 13, 2009).\n10.8\nThe InterGroup Corporation 2010 Omnibus Employee Incentive Plan, approved by the shareholders and adopted by the Board of Directors on February 24, 2010 (incorporated by reference to the Companys Proxy Statement on Schedule 14A, filed with the Commission on January 27, 2010).\n10.9\nEmployee Stock Option Agreement, dated March 16, 2010, between The InterGroup Corporation and John V. Winfield (incorporated by reference to Exhibit 10.9 of the Companys report on Form 10-K for the fiscal year ended June 30, 2010, as filed with the Commission on September 27, 2010).\n10.10\nFranchise License Agreement, dated December 10, 2004, between Justice Investors and Hilton Hotels (incorporated by reference to Exhibit 10.10 of the Companys amended report on Form 10-K/A for the fiscal year ended June 30, 2011, as filed with the Commission on August 24, 2012).\n10.13\nEmployee Stock Option Agreement, dated February 28, 2012, between The InterGroup Corporation and John V. Winfield (incorporated by reference to Exhibit 10.13 of the Companys annual report on Form 10-K for the fiscal year ended June 30, 2014, as filed with the Commission on September 20, 2012).\n10.16\nManagement Agreement, dated February 1, 2017, between Justice Operating Company, LLC and Aimbridge Management Company, LLC. (incorporated by reference to Exhibit 10.5 of the Companys Form 10-K Report for the fiscal year ended June 30, 2017, as filed with the Commission on October 13, 2017). *\nCode of Ethics (filed herewith).\nSubsidiaries (filed herewith).\n23.1\nConsent of Independent Registered Public Accounting Firm Withum Smith+Brown, PC\n31.1\nCertification of Principal Executive Officer Pursuant to Section 302 of the Sarbones-Oxley Act of 2002\n31.2\nCertification of Principal Financial Officer Pursuant to Section 302 of the Sarbones-Oxley Act of 2002\n32.1\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350 (filed herewith).\n32.2\nCertification of Principal Financial Officer Pursuant to 18 U.S.C. Section 1350 (filed herewith).\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DFE\nInline XBRL Taxonomy Extension definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* All Exhibits marked by one asterisk are incorporated herein by reference to the Trusts Registration Statement on Form S-4 as filed with the Securities and Exchange Commission on September 6, 1985, Amendment No. 1 to Form S-4 as filed with the Securities and Exchange Commission on October 23, 1985, Exhibit 14 to Form 8 Amendment No. 1 to Form 8 filed with the Securities & Exchange Commission November 1987 and Form 8 Amendment No. 1 Item 4 filed with the Securities & Exchange Commission October 1988.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTHE INTERGROUP CORPORATION\n(Registrant)\nDate:\nOctober 13, 2023\nby /s/ John V. Winfield\nJohn V. Winfield, President,\nChairman of the Board and\nChief Executive Officer\nDate:\nOctober 13, 2023\nby /s/ Ann Marie Blair\nAnn Marie Blair,\nPrincipal Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignatures\nTitle and Position\nDate\n/s/ John V Winfield\nPresident, Chief Executive Officer and\nOctober 13, 2023\nJohn V. Winfield\nChairman of the Board (Principal Executive Officer)\n/s/ David C. Gonzalez\nChief Operating Officer\nOctober 13, 2023\nDavid C. Gonzalez\n/s/ John C. Love\nDirector\nOctober 13, 2023\nJohn C. Love\n/s/ Steve Grunwald\nDirector\nOctober 13, 2023\nSteve Grunwald\n/s/ Yvonne L. Murphy\nDirector\nOctober 13, 2023\nYvonne L. Murphy\n/s/ William J. Nance\nDirector\nOctober 13, 2023\nWilliam J. Nance"
}