{
    "cik": "6955",
    "company": "ENERPAC TOOL GROUP CORP",
    "filing_type": "10-K",
    "filing_date": "2023-10-20",
    "period_of_report": "2023-08-31",
    "sic": "3590",
    "state_of_inc": "WI",
    "state_location": "WI",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/6955/0000006955-23-000034-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/6955/000000695523000034/epac-20230831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/6955/0000006955-23-000034.txt",
    "filename": "6955_10K_2023_0000006955-23-000034.htm",
    "content": "Item 1. Business\nGeneral\nEnerpac Tool Group Corp. is a premier industrial tools, services, technology and solutions company serving a broad and diverse set of customers in more than 100 countries. Enerpac Tool Group's businesses are global leaders of high pressure hydraulic tools, controlled force products and solutions for precise positioning of heavy loads that help customers around the world safely, reliably and efficiently tackle some of the most challenging, complex, and often hazardous jobs. The Company was founded in 1910 and is headquartered in Menomonee Falls, Wisconsin. The Company has one reportable segment, the Industrial Tools & Services Segment (\"IT&S\"). The IT&S segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools and in providing services and tool rental to the industrial, maintenance, infrastructure, oil & gas, alternative energy and other markets. Financial information related to the Company's reportable segment is included in Note 15, \"Business Segment, Geographic and Customer Information\" in the notes to the consolidated financial statements. Our businesses provide an array of products and services across multiple markets and geographies, which results in significant diversification. The IT&S segment and the Company are well-positioned to drive shareholder value through a sustainable business strategy built on well-established brands, broad global distribution and end markets, with a clear focus on the core tools and services business, and disciplined capital deployment.\nDuring the fourth quarter of fiscal 2019, we entered into a Securities Purchase Agreement (\"SPA\") to sell the remaining businesses within our legacy Engineered Components & Systems (\"EC&S\") segment. We closed the transaction during our first quarter of fiscal 2020. The divestiture of the EC&S segment was a strategic shift to become a pure-play industrial tools and services company. As such, retained liabilities associated with the former EC&S segment are considered discontinued operations in all periods presented herein.\nOur Business Model\nOur long-term goal is to create sustainable returns for our shareholders through above-market growth in our core business, expanding our margins, generating strong cash flow, and being disciplined in the deployment of our capital. We intend to grow through execution of our organic growth strategy, focused on key vertical markets that benefit from long-term macro trends, driving customer driven innovation, expansion of our digital ecosystem to acquire and engage customers, and an expansion in emerging markets such as Asia Pacific. In addition to organic growth, we also focus on margin expansion through operational efficiency techniques, including lean, continuous improvement and 80/20, to drive productivity and lower costs, as well as\noptimizing our selling, general and administrative expenses through consolidation and shared service implementation. We also apply these techniques and pricing actions to offset commodity increases and inflationary pricing. Finally, cash flow generation is critical to achieving our financial and long-term strategic objectives. We believe driving profitable growth and margin expansion will result in cash flow generation, which we seek to supplement through minimizing primary working capital. We intend to allocate the cash flow that results from the execution of our strategy in a disciplined way toward investment in our businesses, maintaining our strong balance sheet, disciplined M&A and opportunistically returning capital to shareholders. We anticipate the compounding effect of reinvesting in our business will fuel further growth and profitable returns.\nIn March 2022, the Company announced the start of its ASCEND transformation program (ASCEND). ASCENDs key initiatives include accelerating organic growth strategies, improving operational excellence and production efficiency by utilizing a Lean approach, and driving greater efficiency and productivity in selling, general and administrative expense by better leveraging resources to create a more efficient and agile organization. In support of the ASCEND initiatives, the Company anticipates investing approximately $70-$75 million over the life of the program, which is expected to be fully implemented by the end of the fourth quarter of fiscal 2024, with an expected annual operating profit improvement from the program in the range of $50-$60 million. Through the end of fiscal 2023, the Company has realized approximately $54 million of annual operating profit from the execution of the ASCEND program and had invested approximately $60 million as part of the program.\nIn June 2022, the Company approved a restructuring plan in connection with the initiatives identified as part of the ASCEND transformation program (see Note 3, ASCEND Transformation Program in the notes to the consolidated financial statements) to drive greater efficiency and productivity in global selling, general and administrative resources. The total costs of this plan were then estimated at $6 to $10 million, constituting predominately severance and other employee-related costs to be incurred as cash expenditures and impacting both IT&S and Corporate. On September 23, 2022, the Company approved an updated restructuring plan. The costs of this updated plan (which includes the amounts for the plan approved in June 2022) are estimated at $10 to $15 million. These costs are expected to be incurred over the expected duration of the transformation program, ending in the fourth quarter of fiscal 2024.\nDescription of Business Segments\nIndustrial Tools & Services Reportable Segment\nIT&S is a global supplier of both products and services to a broad array of end markets, including infrastructure, industrial maintenance, repair and operations, oil & gas, mining, alternative and renewable energy, and civil construction markets.\nOur primary products include branded tools, cylinders, pumps, hydraulic torque wrenches and highly engineered heavy lifting technology solutions. Examples of our products include high-force hydraulic and mechanical tools (cylinders, pumps, valves, bolt tensioners, specialty tools and other miscellaneous products), which are designed to allow users to apply controlled force and motion to increase productivity, reduce labor costs and make work safer and easier to perform. These tools operate at very high pressures of approximately 5,000 to 12,000 pounds per square inch. With our products used in a wide variety of end markets, they are often deployed in harsh operating conditions, such as machining, infrastructure maintenance and repair, and oil & gas production, where safety is a key differentiator. As a result, we hold ourselves to a world-class safety standard to protect both our employees and those using our products and services.\nOn the services side of the segment, our highly trained technicians provide maintenance and manpower services on customer assets to meet their specific needs including bolting, machining, and joint integrity. We also provide rental services for certain of our products.\nOur branded tools and services are primarily marketed through the Enerpac, Hydratight, Larzep and Simplex brand names.\nThe segment delivers products and services primarily through our world-class, global network of distributors, as well as direct sales to OEMs and select end users. Examples of industrial distributors include W.W. Grainger, MSC and Blackwoods.\nOther Operating Segment\nThe Cortland Industrial and Medical operating segments, which primarily design and manufacture high performance synthetic ropes and biomedical textiles, do not meet the quantitative or qualitative thresholds to be considered reportable segments, and together represent the Other operating segment. Therefore, the results are not disclosed separately as would be required if the Other operating segment were considered a reportable segment, and as the business is not closely related to the IT&S segment, results are not aggregated to be included in the results of the IT&S reportable segment. On July 11, 2023, the Company completed the sale of the Cortland Industrial business (see Note 5, \"Discontinued Operations and Other Divestiture Activities\" in the notes to the consolidated financial statements). Certain information related to the Other operating segment is disclosed within Note 15, \"Business Segment, Geographic, and Customer Information\" in the notes to the consolidated financial\nstatements in order to comply with requirements under generally accepted accounting principles in the United States (\"US GAAP\") to reconcile certain required disclosures to the Consolidated Financial Statements.\nAcquisitions and Divestitures\nFor a summary of recent divestiture transactions impacting continuing operations, see Note 5, \"Discontinued Operations and Other Divestiture Activities\" in the notes to the consolidated financial statements.\nInternational Business\nOur products and services are generally available globally, with our principal markets outside the United States being Europe, the Middle East and Asia. In fiscal 2023, we derived 39% of our net sales from the United States, 25% from Europe, 14% from the Middle East, 12% from Asia and 10% from other geographic areas. We have operations around the world that allow us to draw on the skills of a global workforce, provide flexibility to our operations, drive economies of scale, provide revenue streams that may help offset economic trends that are specific to individual countries, and facilitate access to new markets. Although international operations are subject to certain risks, we continue to believe that a global presence is key to maintaining strong relationships with many of our global customers and suppliers. Financial information related to the Company's geographic footprint of our continuing operations is included in Note 15, \"Business Segment, Geographic and Customer Information\" in the notes to the consolidated financial statements.\nProduct Development and Engineering\nWe conduct research and development activities to develop new products and to enhance the functionality, effectiveness, ease of use and reliability of our existing products. We believe that our engineering and research and development efforts have been, and continue to be, key drivers of our success in the marketplace. Our advanced design and engineering capabilities contribute to the development of innovative and highly engineered products, maintain our technological leadership and enhance our ability to provide customers with unique and customized solutions and products. We anticipate that we will continue to make significant expenditures for research and development as we seek to provide new innovative tools and services to grow our market share. Research and development (\"R&D\") costs are expensed as incurred. R&D costs were $9 million in fiscal 2023, $7 million in fiscal 2022 and $7 million in fiscal 2021.\nThe Company holds numerous patents and trademarks. While no individual patent is believed to be of such importance that its termination would have a material adverse effect on our business, the termination of certain of our trademarks, including ENERPAC®, SIMPLEX®, HYDRATIGHT® and LARZEP & DESIGN®, could have a material adverse effect on our business.\nCompetition\nThe markets for our products are highly competitive. We provide a diverse and broad range of industrial products and services to numerous global end markets, many of which are highly fragmented. Although we face larger competitors in several served markets, some of our competition is comprised of smaller companies which may lack the footprint or financial resources to serve global customers. We compete for business principally on the basis of customer service, product quality and availability, engineering and research and development expertise. In addition, we believe that our cost structure, strategic global sourcing capabilities and global distribution support our competitive position.\nManufacturing and Operations\nWhile we do have manufacturing capabilities including machining and fabrication, our manufacturing consists primarily of light assembly of components we source from a network of global suppliers. We have implemented single piece flow processes in most of our plants, which reduces inventory levels, lowers re-work costs and shortens lead times to customers. Components are built to our highly engineered specifications by a variety of suppliers in best-cost locations including various countries in Asia. We have built strong relationships with our key suppliers and, while we single source certain of our components, in many cases there are several qualified alternative sources.\nRaw Material Costs, Inflation and Tariffs\nWe source materials and components from a network of global suppliers. These items are typically available from multiple suppliers. Raw materials that go into the components we source, such as steel, aluminum, plastic resin, brass, steel wire and rubber, are subject to price fluctuations and tariffs, which could have an impact on our results. We have been able to offset the impact of inflation with pricing actions, manufacturing efficiencies and other cost reductions. In addition, several of our products have been subject to tariffs, but to date we have been able to offset the majority of additional costs from tariffs through price increases. We continue to manage our supply chain to mitigate ongoing risks associated with the evolving political and inflationary environments.\nOrder Backlogs and Seasonality\nOur operating segments have a relatively short order-to-ship cycle. We had order backlogs of $54 million and $72 million at August 31, 2023 and 2022, respectively. The decrease in our order backlog during the fiscal year was primarily due to alleviated pressure on the supply chain. Assuming no significant supply chain constraints arise after the date of this report, substantially all of the backlog at August 31, 2023 is expected to be filled within twelve months.\nWhile we typically experience a stronger second half to our fiscal year, our consolidated sales are not subject to significant seasonal fluctuations.\nPercentages of Sales by Fiscal Quarter\n2023 2022\nQuarter 1 (September - November) 23% 23%\nQuarter 2 (December - February) 24% 24%\nQuarter 3 (March - May) 26% 27%\nQuarter 4 (June - August) 27% 26%\n100% 100%\nHuman Capital Management\nThe goal of human capital management strategy and practices is for Enerpac to be considered an employer of choice, and our initiatives and programs are predicated on making this objective a reality.\nThe talent that makes up our workforce (approximately 2,100 employees as of August 31, 2023) is critical to the success of our company and the ability to deliver shareholder value. Our talent development framework is built around a robust performance management and development structure. Together with their leaders, employees establish annual goals and objectives that align directly with our organizational commitments. We monitor progress throughout the year, with candid and frequent dialogue encouraged along the way, and, new for fiscal 2024, a formal check-in process to facilitate a clear understanding of goals and the status of progress toward achieving those goals. Bi-annually, our Executive Leadership Team (\"ELT\") reviews the skills we require to execute our corporate strategy and key role requirements to identify development opportunities for our emerging talent. Annually, we conduct performance review and succession planning, and we promote a long-term career development view by encouraging the creation of unique individual development plans. Training opportunities for all levels of the organization are available and focus on skill, competency and leadership development. We believe in coaching and the sharing of perspectives, and we facilitate mentorship opportunities for the benefit of our workforce. We are committed to devoting the time, resources and planning necessary to maximize the potential of our employees' career development, as well as address the future skill needs of our organization.\nWe offer competitive compensation and benefits tailored to the geographical markets and industries in which we operate. In the U.S., employees who work more than 30 hours per week are eligible for a comprehensive menu of benefits, including paid time off, healthcare (health, dental, and vision) coverage, short and long-term disability, life and accidental disability insurance, a 401(k) retirement plan with a Company match and immediate vesting, access to our employee assistance program, an annual bonus program with broad participation, equity incentive programs, an employee stock ownership plan that allows employees to buy company shares at a discount, flexible work arrangements, and up to 12 weeks of parental leave, of which six weeks are paid at an employee's full salary. In fiscal 2023, we increased our tuition reimbursement to $5,250 for associate and undergraduate programs and $7,500 for graduate programs, while also offering the same level of reimbursement to part time workers as full-time workers. During fiscal 2023, we expanded our supplemental life and spousal insurance offering. We continue to evaluate enhancements to our compensation and benefit programs in all locations to ensure we remain competitive and meet the needs of our employees.\nDiversity, Equity, Inclusion & Belonging. Diversity, Equity, Inclusion & Belonging (\"DEIB\") remains a core tenet of our organizational ethos, championed by our ELT and management at all levels. Our unwavering commitment to fostering an inclusive culture of belonging is reflected in our four key DEIB pillars: prioritize cultivating a diverse and inclusive workplace culture, support education and skill building opportunities for our employees, broaden our talent acquisition efforts to attract diversity, and empower employees through employee resource groups (\"ERGs\").\nWe include diverse representation in our slates for all positions and will continue to do so. At the end of fiscal 2023, our board of directors includes three female (30%) and one racially diverse (10%) individual. We firmly believe that embedding diversity into our core strategy not only aligns with our values but also provides a competitive advantage, attracting exceptional talent, leveraging diverse perspectives, and ultimately driving value creation for our shareholders.\nEmployee Safety. The safety, health, and well-being of our employees, contractors, and visitors at our sites globally is our top priority and a principle that is deeply embedded in our culture. Our leaders and employees at all levels embrace our health,\nsafety, security, environment, and quality (HSSEQ) programs, which translates into an enterprise-wide obligation to provide healthy, safe and productive work environments for our employees and deliver high standards of safety and quality in the products, services and solutions for our customers and end-users. At the heart of our HSSEQ efforts is a desire to foster a culture of continuous improvement and employee empowerment through training, frequent and constructive management engagement, a risk-based evaluation of business activities and behaviors, and the deployment of programs and resources to mitigate those risks. We continually track and report our performance, including thorough reviews of incidents, near-misses, and quality issues; and management accountability and discussion of these improvement opportunities is a cornerstone of all business reviews. We finished the year with a total case incident rate (TCIR) of 0.64. This is up slightly year-over-year as fiscal 2022 had a TCIR of 0.61. This puts our performance in the top quartile in comparison to the BLS NAICS bracket for Machinery Manufacturing (333) for companies with greater than 1,000 employees.\nExecutive Officers of the Registrant\nThe names, ages and positions of all of the executive officers of the Company as of October 15, 2023 are listed below.\nName Age Position\nPaul E. Sternlieb 51 President and Chief Executive Officer\nAnthony P. Colucci 53 Executive Vice President and Chief Financial Officer\nJames P. Denis 49 Executive Vice President, General Counsel, Company Secretary & Chief Compliance Counsel\nMarkus Limberger 53 Executive Vice President, Operations\nBenjamin J. Topercer 46 Executive Vice President and Chief Human Resource Officer\nPaul Sternlieb, President and Chief Executive Officer, was appointed President and Chief Executive Officer of the Company in October 2021. Prior to joining the Company, Mr. Sternlieb served as Executive Vice President (\"EVP\") and President, Protein, at John Bean Technologies Corporation (\"JBT\") since October 2017. Prior to JBT, Mr. Sternlieb was Group President, Global Cooking in the Food Equipment Group at Illinois Tool Works since 2014. He served as a Vice President & General Manager with Danaher from 2011 to 2014. Before Danaher, he held management roles with the H.J. Heinz Company, a leading food production company and was a consultant with McKinsey & Company.\nAnthony Colucci, EVP and Chief Financial Officer, joined the Company in that capacity in May of 2022, and leads global Finance and Information Technology. From June 2020 until joining the Company, Mr. Colucci served as Executive Vice President and Chief Finance and Administrative Officer of Robertshaw Industries, a global engineering and manufacturing company focused on controls and solutions for residential white goods and commercial appliances. Prior to joining Robertshaw, Mr. Colucci served as Senior Vice President and Chief Financial Officer of Hayward Industries, Inc., a manufacturer of pool equipment and controls products, from May 2018 to May 2020, and in various positions with Honeywell International since September 2006, including as Vice President and Chief Financial Officer of Honeywell Performance Materials & Technologies from March 2016 to May 2018 and Vice President and Chief Financial Officer of Honeywell Sensing & Productivity Solutions from September 2011 to March 2016. Mr. Colucci served in various financial roles with AT&T Wireless from September 1997 until he joined Honeywell.\nJames Denis, EVP, General Counsel, Company Secretary & Chief Compliance Counsel, has served in this capacity since September 2022. He joined the Company in 2013 as our Global Litigation Counsel and was promoted to Regional General Counsel for the Americas and APAC in October 2018 and Assistant General Counsel in March 2020. In December 2021, he was appointed Acting General Counsel and Corporate Secretary. Before joining the Company, Mr. Denis was a shareholder with the law firm of Reinhart Boerner Van Deuren s.c., where he was a member of the firms Products Liability and Insurance Risk Management Teams.\nMarkus Limberger, EVP, Operations, joined the Company in September of 2022, with responsibilities for manufacturing, distribution, and procurement. Mr. Limberger served as Vice President Global Operations for Leica Microsystems GmbH, a subsidiary of Danaher Corporation and manufacturer of microscopy equipment, from September 2018 until he joined Enerpac. Prior to that, Mr. Limberger was with Leica Camera AG, serving as Head of Operations from January 2011 to July 2011 and then as Chief Operating Officer until August 2018. Before joining Leica Camera, Mr. Limberger served as Head of Production from August 2007 to January 2008 and then as Managing Director until December 2010 of Uwe Weller Feinwerktechnik GmbH, a metal processing company. Prior to that, he held operations, logistics and dispatching management positions with a number of other manufacturing firms. His background includes a strong focus on operational excellence and in developing and executing operations strategies to achieve sustained improvements in performance, with extensive experience in Lean and continuous improvement principles. On September 26, 2023, Mr. Limberger resigned his position as Executive Vice President, Operations effective December 1, 2023, when by mutual agreement he will be placed on leave but will continue as an employee, at the same salary with the same benefits, through his contractual notice period until March 31, 2024.\nBenjamin Topercer, EVP and Chief Human Resource Officer, joined the Company in February 2022 and leads the global human resources function, including our global HSSEQ organization, as well as our DEIB initiatives and communications function. From June 2016 until he joined Enerpac, Mr. Topercer was the Chief Human Resource Officer for Vantage Specialty Chemicals, a manufacturer of specialty chemicals and ingredients included in consumer and industrial products. Prior to joining Vantage, he served in various human resources management roles for Premier Farnell Corporation, a distributor of electronic components, including as Global Head of HR for its sales, marketing, e-commerce and technology groups and specified business units, from September 2013 to June 2016. Prior to that, Mr. Topercer served as Director, Human Resources for Eaton Corporation, and its predecessor, Cooper Industries, from July 2011 to September 2013. Prior to that, he served in positions of progressive responsibility in the human resources group of Henkel Corporation from September 2004 to July 2011 and at Rexam Sussex from March 2000 to September 2004. Item 1A. Risk Factors\nThe risks and uncertainties described below are those that we have identified as material but are not the only risks and uncertainties facing the Company. If any of the events contemplated by the following risks occurs, our business, financial condition, or results of operations could be materially adversely affected. Additional risks and uncertainties not currently known to us, or that we currently believe are immaterial, also may adversely impact our business, including our ability to execute our strategic growth and profitability objectives.\nRisks Related to Economic Conditions\nSupply chain issues, including shortages of adequate component supply, that increase our costs or cause delays in our ability to fulfill orders, or a failure by us to estimate customer demand properly, could have an adverse impact on our business and operating results and our relationships with customers.\nWe are reliant on our supply chain for components and raw materials to manufacture our products and provide services to our customers, and this reliance could have an adverse impact on our business and operating results. We may experience a reduction or interruption in supply due to factors beyond our control, including as a geopolitical conflicts and the imposition of international sanctions in response thereto, a significant natural disaster, pandemics, or shortages in global freight capacity. Our vendors may be unable to meet our demand for raw materials or components, or significantly increase lead times for deliveries, which may be unable to offset through alternate sources of supply, or impose significant increases in the price of critical components and raw materials that we may be unable to pass along to our customers. In addition, a failure by us to appropriately forecast or adjust our requirements for components or raw materials based on our business needs and volatility in demand for our products may impact our ability to timely procure raw materials and components necessary to maintain desired productivity in our operations. These supply chain issues could materially adversely affect our business, operating results, and financial condition and could materially damage customer relationships.\nWe procure certain components for our products from single or limited suppliers. In the event of supply disruptions from these suppliers, we may not be able to diversify our supply base for such components in a timely manner or may experience quality issues with alternate sources. Further, we procure a significant portion of our components from suppliers located in China, and we are therefore exposed to potential disruptions in deliveries from these suppliers due to political tensions with China, geopolitical risks, government-mandated facility closures in China due to public health matters (such as the COVID-19 outbreaks), energy shortages or other causes. Our growth and ability to meet customer demand depend in large part on our ability to obtain timely deliveries of components and raw materials from our suppliers, and significant disruptions in their supply could materially adversely affect our business, operating results, and financial condition and could materially damage customer relationships.\nWe have in the recent past experienced supply shortages and inflationary pressures for certain components and raw materials that were important to our manufacturing process due to a number of the factors described above. Growth in the global economy may exacerbate these pressures on us and our suppliers, and we expect these supply chain challenges and cost impacts may continue to impact us in the future. Although we have generally secured additional supply from existing or alternate suppliers or taken other mitigating actions when such disruptions have occurred in past periods, there is no guarantee we can continue to do so in the future, and our business, results of operations, and financial condition could be adversely affected. When facing component supply-related challenges, we may also increase our inventories and purchase commitments to shorten lead times and ensure adequate inventories to meet customer expectations. If the demand for our products is less than our expectations or if we otherwise fail to anticipate customer demand properly, an oversupply of components could result in inventory levels that could also lead to significant excess and obsolete inventory charges and affect our operating and financial results.\nDeterioration of, or instability in, the domestic and international economy and challenging end-market conditions could impact our ability to grow the business and adversely impact our ability to execute our strategy, financial condition, results of operations and cash flows.\nOur businesses and operating results have been, and will continue to be, affected by domestic and international economic conditions. The level of demand for our products is affected by general economic and business conditions in our served end markets. A substantial portion of our revenues is derived from customers in cyclical industries (such as the industrial and oil & gas sectors) that typically are adversely affected in periods of economic contraction or volatility. In such periods, our customers may experience deterioration of their businesses, which may reduce or delay our sales. We have experienced contraction and challenging demand conditions in many of our served markets historically, and it is reasonably possible that we could experience such conditions in the future which may adversely affect our ability to execute our strategy, financial condition, results of operations and cash flows.\nDisruptions in global oil markets have adversely affected our business and results of operations and similar events in the future may adversely affect our business and results.\nA portion of our revenues is derived from customers in the midstream and downstream oil & gas industry. Disruptions in the global oil & gas markets (such as those due to the COVID-19 pandemic and the Ukraine/Russia conflict and the resulting international sanctions) and other changes in demand for oil can negatively affect oil prices and negatively affect cash flows for many of those customers. This has resulted in, and in the future could result in, lower capital expenditures and project modifications, delays or cancellations by those customers, reducing the demand for certain of our products serving that end market, which could adversely affect our results of operations and financial condition.\nUncertainty over global tariffs, or the financial impact of tariffs, may negatively affect our results.\nChanges in U.S. domestic and global tariff frameworks have increased our costs of producing goods and resulted in additional risks to our supply chain. We have developed and implemented strategies to mitigate previously implemented and, in some cases, proposed tariff increases, but there is no assurance we will be able to continue to mitigate prolonged tariffs. Further, uncertainties about future tariff changes could result in mitigation actions that prove to be ineffective or detrimental to our business.\nRisks Related to Our Business and Operations\nWe may not be able to fully realize expected cost savings from our ASCEND transformation program and from restructuring actions.\nOn March 23, 2022, we announced the launch of ASCEND, a transformation program focused on driving accelerated earnings growth and efficiency across the business with the goal of delivering improved annual operating profit once fully implemented. The ASCEND program has focused on the following key initiatives: (i) accelerating organic growth strategies, (ii) improving operational excellence and production efficiency by utilizing a lean approach and (iii) driving greater efficiency and productivity in selling, general and administrative expenses. In addition, from time to time, we implement other plans that incur restructuring costs to (i) eliminate redundancies in our corporate or regional structures (ii) eliminate excess capacity in our facilities as a result of integration of acquisitions or divestitures of product lines, or (iii) eliminate product or service lines that do not meet targeted profitability metrics. Although we expect that the improved operating profit, cost savings and realization of efficiencies will offset the related costs of these initiatives and provide additional annual benefit, we may not fully achieve the expected benefits of these efforts (see Note 4, \"Restructuring Charges,\" Note 3. \"ASCEND Transformation Program\" in the notes to the consolidated financial statements and \"Business Update\" within Item 7 for further discussion of the ASCEND program and other current restructuring activities).\nLogistics challenges, including global freight capacity shortages, could increase our freight costs or cause delays in our ability to fulfill orders and could have an adverse impact on our business and operating results.\nThe Companys ability to import products in a timely and cost-effective manner has been, and may continue to be, adversely affected by shortages of freight capacity, delays at ports, port strikes, and other issues that otherwise affect transportation and warehousing providers. These issues could delay importation of products or require the Company to locate alternative ports or warehousing providers to avoid disruption to customers. These alternatives may not be available on short notice or could result in higher freight and logistics costs, which could have an adverse impact on the Companys business and financial condition.\nCollection risk for receivables in foreign jurisdictions.\nWe sell products and services through distributors and agents. In certain jurisdictions, those third parties represent a significant portion of our sales in their respective country. Collection times for receivables in many foreign jurisdictions may often be substantially longer than those in the United States (though less than one year). Further, for certain of our services business agency relationships, we utilize intermediary agents and are dependent on our agents to collect payment on our behalf. The indirect sales channels expose us to the credit risk of both our channel partners and end customers and increase the risk of delayed payments or uncollectible balances. A liquidity event or dispute involving one of these channel partners may adversely affect our results of operations and financial condition.\nIf we fail to retain the agents and distributors upon whom we rely to market our products and services, we may be unable to effectively market our products and services and our revenue and profitability may decline.\nThe marketing success of many of our businesses in the U.S. and abroad depends largely upon our independent agents and distributors sales and service expertise and relationships with customers in our end markets. Many of these agents have developed strong ties to existing and potential customers because of their detailed knowledge of our products. A loss of a significant number of these agents or distributors, or of a particular agent or distributor in a key market or with key customer relationships, could significantly inhibit our ability to effectively market our products, which could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nCybersecurity vulnerabilities, threats and more sophisticated and targeted computer crime could pose a risk to our systems, networks, operations, products, solutions, services and data.\nIncreased global cybersecurity threats, computer viruses and more sophisticated and targeted cyber-related attacks, as well as cybersecurity failures resulting from human error, vulnerabilities and technological errors pose a risk to our systems, including third-party vendor operated systems, operations and products and potentially those of our business partners. An attack also could result in losses due to ransomware payments, security breaches, theft, lost or corrupted data, misappropriation of sensitive, confidential or personal data or information, loss of trade secrets and commercially valuable information, production downtimes and operational disruptions. We attempt to mitigate these risks by employing measures including employee training, network monitoring and testing, maintenance of protective systems, contingency planning, and the engagement of third-party experts but we remain potentially vulnerable to additional known or unknown threats. There is no assurance the financial or operational impact from such threats will not be material.\nA material disruption at a significant manufacturing facility could adversely affect our ability to generate sales and result in increased costs that we cannot recover.\nOur financial performance could be adversely affected due to our inability to meet customer demand for our products or services in the event of a material disruption at one of our significant manufacturing or services facilities. Equipment failures, natural disasters, health issues (including pandemics like COVID-19), power outages, fires, explosions, terrorism, adverse weather conditions, labor disputes or other influences could create a material disruption. Interruptions to production could increase our cost of sales, harm our reputation and adversely affect our ability to attract or retain our customers. Our business continuity plans may not be sufficient to address disruptions attributable to such risks. Any interruption in production capability could require us to make substantial capital expenditures to remedy the situation, which could adversely affect our financial condition and results of operations.\nOur business operates in highly competitive markets, so we may be forced to cut prices or incur additional costs.\nOur business generally faces substantial competition, domestically and internationally, in our end markets. We may lose market share in certain businesses or be forced to reduce prices or incur increased costs to maintain existing business. We compete globally on the basis of product design, quality, availability, performance and customer service. Present or future competitors in our markets may have new technologies or more attractive products and services or greater financial, technical or other resources which could put us at a competitive disadvantage. In addition, some of our competitors may be willing to reduce prices and accept lower margins to compete with us.\nOur international operations pose political, currency and other risks.\nWe expect sales from and into foreign markets to continue to represent a significant portion of our revenue. In addition, many of our manufacturing operations and suppliers are located outside the United States, including China, the United Kingdom and the Netherlands. Our sales and operating activities outside of the U.S. are, and will continue to be, subject to a number of risks, including:\nunfavorable fluctuations in foreign currency exchange rates;\nadverse changes in foreign tax, legal and regulatory requirements;\nexport and import restrictions and controls on repatriation of cash;\npolitical and economic instability;\ndifficulty in protecting intellectual property;\ngovernment embargoes, tariffs and trade protection measures, such as anti-dumping duties applicable to classes of products, and import or export licensing requirements, as well as the imposition of trade sanctions against a class of products imported from or sold and exported to, or the loss of normal trade relations status with, countries in which we conduct business, that could significantly increase our cost of products or otherwise reduce our sales and harm our business;\ncultural norms and expectations that may sometimes be inconsistent with our Code of Conduct and our requirements about the manner in which our employees, agents and distributors conduct business;\ndiffering labor regulations; and\nacts of hostility, terror or war.\nOur operations outside the United States require us to comply with a number of United States and international regulations. For example, we are subject to the Foreign Corrupt Practices Act (the FCPA), which prohibits United States companies or their agents and employees from providing anything of value to a foreign official for the purposes of influencing any act or decision of these individuals in their official capacity to help obtain or retain business, direct business to any person or corporate entity, or obtain any unfair advantage. Our activities in countries outside the United States create the risk of unauthorized payments or offers of payments by one of our employees or agents that could be in violation of the FCPA, even though these parties are not always subject to our control. We have internal control policies and procedures and have implemented training and compliance programs with respect to the FCPA. However, we cannot assure that our policies, procedures and programs always will protect us from reckless or criminal acts committed by our employees or agents. In the event that we believe or have reason to believe that our employees or agents have or may have violated applicable anti-corruption laws, including the FCPA, we may be required to investigate or have outside counsel investigate the relevant facts and circumstances. In addition, we are subject to and must comply with all applicable export controls and economic sanctions laws and embargoes imposed by the United States and other various governments. Changes in export control or trade sanctions laws may restrict our business practices, including cessation of business activities in sanctioned countries or with sanctioned entities, and may result in modifications to compliance programs and increase compliance costs, and violations of these laws or regulations may subject us to fines, penalties and other sanctions, such as loss of authorizations needed to conduct aspects of our international business or debarments from export privileges. Violations of the FCPA or export controls or sanctions laws and regulations may result in severe criminal or civil sanctions, and we may be subject to other liabilities, which could negatively affect our business, financial condition, results of operations, and cash flows.\nWe intend to continue to pursue international growth opportunities, which could increase our exposure to risks associated with international sales and operations. As we expand our international operations, we may also encounter new risks that could adversely affect our revenues and profitability. Failure to properly manage these risks could adversely affect our business, financial condition, results of operations and cash flows. In addition, United States tax reform has significantly changed how foreign operations are taxed in the United States. Therefore, we continue to review our organizational structure, and changes to where income is generated, may have a material adverse effect on our liquidity and results of operations.\nOur customers and other business partners often require terms and conditions that expose us to significant risks and liabilities.\nWe operate in end markets and industries in which our customers and business partners seek to contractually shift significant risks associated with their operations or projects to us. We structure our commercial and contracting practices to assess and manage the risks we are assuming, but we cannot assure that material liabilities will not arise from our contracts with our business partners. Also, our contracting standards may be more stringent than those of certain competitors, and as a result, we may experience market share losses or the reduction in growth opportunities.\nImposition of climate-related laws and regulations that disadvantage the oil & gas industry compared to other industries or consumer behavior that reduces demand for petroleum products may have an adverse impact on our results of operations.\nA significant portion of our revenues are derived from the sale of products and services to end users in the oil & gas industry. Accordingly, our results of operations may be adversely affected by the imposition of climate-related laws and regulations that disadvantage the oil & gas industry compared to other industries and have the effect of reducing the production of petroleum products. In addition, a reduction in the production of petroleum products as a result of consumer behavior that embraces alternative sources of energy over oil & gas could similarly adversely affect our results of operations by reducing the demand for our products and services.\nRisks Related to the Execution of Our Strategy\nIf we fail to develop new products, or customers do not accept our new products, our business could be adversely affected.\nOur ability to develop innovative new products can affect our competitive position and often requires the investment of significant resources. Difficulties or delays in research, development, production or commercialization of new products, or failure to gain market acceptance of new products and technologies, may reduce future sales and adversely affect our competitive position. There can be no assurance that we will have sufficient resources to make such investments, that we will be able to make the technological advances necessary to maintain competitive advantages or that we can recover major research and development expenses. If we fail to make innovations, launch products with quality problems, experience development cost overruns, or the market does not accept our new products, then our financial condition, results of operations, cash flows and liquidity could be adversely affected.\nOur growth strategy includes strategic acquisitions, which we may not be able to consummate or successfully integrate.\nWe plan to make acquisitions to grow our business, enhance our global market position and broaden our industrial tools product offerings. Our ability to successfully execute acquisitions will be impacted by factors including the availability of financing on terms acceptable to us, the potential reduction of our ability or willingness to incur debt to fund acquisitions, the reluctance of target companies to sell in current markets, our ability to identify acquisition candidates that meet our valuation parameters and increased competition for acquisitions. The process of integrating acquired businesses into our existing operations also may result in unforeseen operating difficulties and may require additional financial resources and attention from management that would otherwise be available for the ongoing development or expansion of our existing operations. Although we expect to successfully integrate any acquired businesses, we may not achieve the desired net benefit in the timeframe planned. Failure to effectively execute our acquisition strategy or successfully integrate the acquired businesses could have an adverse effect on our competitive position, reputation, financial condition, results of operations, cash flows and liquidity.\nWe may not be able to realize planned benefits from acquired companies.\nWe may not be able to realize planned benefits from acquired companies. Achieving those benefits depends on the timely, efficient and successful execution of a number of post-acquisition events, including integrating the acquired business into the Company. Factors that could affect our ability to achieve these benefits include:\ndifficulties in integrating and managing personnel, financial reporting and other systems used by the acquired businesses;\nthe failure of acquired businesses to perform in accordance with our expectations;\nfailure to achieve anticipated synergies between our business units and the business units of acquired businesses;\nthe loss of customers of acquired businesses;\nthe loss of key managers and employees of acquired businesses; or\nother material adverse events in the acquired businesses.\nIf acquired businesses do not operate as we anticipate, it could materially impact our business, financial condition and results of operations.\nThe indemnification provisions of acquisition agreements may result in unexpected liabilities.\nCertain acquisition agreements from past acquisitions require the former owners to indemnify us against certain liabilities related to the operation of each of their companies. In most of these agreements, the liability of the former owners is limited to specific warranties given in the agreement as well as in amount and duration. Certain former owners also may not be able to meet their indemnification responsibilities. We may be subject to the same risk with respect to future acquisitions as well. As a result of those limitations, we may face unexpected liabilities that adversely affect our profitability and financial position.\nDivestitures and discontinued operations could negatively impact our business, and retained liabilities from businesses that we have sold could adversely affect our financial results.\nIn connection with the execution of our strategy to become a pure-play industrial tools and services company, we have completed several divestitures, including the divestiture of our former EC&S segment. These divestitures pose risks and challenges that could negatively impact our business, including retained liabilities related to divested businesses, obligations to indemnify buyers against contingent liabilities and potential disputes with buyers.\nIf we do not realize the expected benefits of these divestitures or our post-completion liabilities and continuing obligations are substantial and exceed our expectations, our financial position, results of operations and cash flows could be negatively impacted. Any divestiture may result in a dilutive impact to our future earnings if we are unable to offset the dilutive impact from the loss of revenue and profits associated with the divestiture, as well as significant write-offs, including those related to goodwill and other intangible assets, which could have a material adverse effect on our results of operations and financial condition.\nOur goodwill and other intangible assets represent a substantial amount of our total assets.\nOur total assets reflect substantial intangible assets, primarily goodwill. As of August 31, 2023, goodwill and other intangible assets totaled $304 million, or 40% of our total assets. The goodwill results from acquisitions, representing the excess of the purchase price over the fair value of the net tangible and other identifiable intangible assets we have acquired. We assess annually, and more frequently if a triggering event occurs, whether there has been impairment in the value of our goodwill or indefinite-lived intangible assets. If future operating performance at one or more of our reporting units were to fall below current levels, we could be required to recognize a non-cash charge to operating earnings to impair the related goodwill or other intangible assets. We recognized $1 million in impairment charges in fiscal 2022 related to the goodwill in our Cortland Industrial operating segment (Other Segment) (see Note 6, \"Goodwill, Intangible Assets and Long-Lived Assets\" in the notes to the consolidated financial statements and \"Critical Accounting Estimates\" for further discussion on goodwill, intangible asset and long-lived asset impairments). Any future goodwill or intangible asset impairments could negatively affect our financial condition and results of operations.\nRisks Related to Legal, Compliance and Regulatory Matters\nWe are subject to many laws and regulations that may change in ways that are detrimental to our competitiveness or results.\nOur businesses are subject to regulation under a broad range of U.S. and foreign laws and regulations. Some of those laws and regulations may change in ways that will require us to modify our business practices and objectives in ways that adversely impact our financial condition or results of operations, including by restricting existing activities and products, subjecting our operations to escalating costs or prohibiting us from operating in certain jurisdictions. Examples of laws or regulations that may have an adverse effect on our operations, financial condition and growth strategies include tax law, export and import controls, anti-corruption law, competition law, data privacy regulations, currency controls and economic or political sanctions. In addition, changes in laws or regulations, for example, the proposed regulations of the Securities and Exchange Commission with respect to climate-related disclosures, may significantly increase our costs, adversely affecting our results of operations.\nLegal compliance risks could result in significant costs to our business or cause us to restrict current activities or curtail growth plans.\nWe directly or indirectly operate in industries, markets and jurisdictions in which we are exposed to compliance risks and that are subject to significant scrutiny by regulators, governmental authorities and other persons. We structure and strengthen our risk management and compliance programs to mitigate such risks and foster compliance with all applicable laws, but our practices may not be sufficient to eliminate these risks. The global and diverse nature of our operations, the complex and high-risk nature of some of our markets, our reliance on third-party agents and representatives to support sales and other business activities, and increasingly stringent laws and enforcement activities could result in violations of law, enforcement actions or private litigation resulting in significant defense and investigation costs, fines and penalties, and a broad range of remedial actions, including potential restrictions on our operations and other adverse changes to our business plans. See Note 16, \"Commitments and Contingencies\" in the notes to the consolidated financial statements for additional information about compliance risks.\nHealth, safety and environmental laws and regulations may result in additional costs.\nWe are subject to federal, state, local and foreign laws and regulations governing public and worker health and safety. Violations of these laws could result in significant harm and financial liabilities that could adversely affect our operating results and reputation. Pursuant to such laws, governmental authorities have required us to contribute to the cost of investigating or remediating certain matters at current or previously owned and operated sites. In addition, we have provided environmental indemnities for previously owned operations in connection with the sale of certain businesses and product lines. Liability as an owner or operator, or as an arranger for the treatment or disposal of hazardous substances, can be joint and several and can be imposed without regard to fault. There is a risk that costs relating to these matters could be greater than what we currently expect or exceed our insurance coverage, or that additional remediation and compliance obligations could arise which require us to make material expenditures. More stringent environmental laws, unanticipated remediation requirements or the discovery of previously unknown conditions could materially harm our financial condition and operating results. We are also required to comply with environmental laws and regulations to maintain operating permits and licenses, some of which are subject to discretionary renewal from time to time, for many of our businesses, and our business operations could be restricted if we are unable to renew existing permits or to obtain any additional permits that we may require.\nUnfavorable tax law changes may adversely affect results.\nWe are subject to income taxes in the United States and in various foreign jurisdictions. Domestic and international tax liabilities are subject to the allocation of income among various tax jurisdictions. Our effective tax rate could be adversely affected by changes in tax law (including a potential increase in the U.S. federal income tax rate), the mix of earnings among countries with differing statutory tax rates, or changes in the valuation allowance of deferred tax assets.\nCosts and liabilities arising from legal proceedings could be material and adversely impact our financial results.\nWe are subject to legal and regulatory proceedings, including litigation asserting product liability and warranty claims. We maintain insurance and have established reserves for these matters as appropriate and in accordance with applicable accounting standards and practices. Insurance coverage, to the extent it is available, may not cover all losses arising from such contingencies. Also, estimating legal reserves or possible losses involves significant judgment and may not reflect the full range of uncertainties and unpredictable outcomes inherent in litigation and investigations, and the actual losses arising from particular matters may exceed our current estimates and adversely affect our results of operations. We also expect that additional legal proceedings and other contingencies will arise from time to time, and we cannot predict the occurrence, magnitude and outcome of such additional matters. Moreover, we operate in jurisdictions where claims involving us may be adjudicated within legal systems that are less developed and less reliable than those of the U.S. or other more developed markets, and this can create additional uncertainty about the outcome of proceedings before courts or other governmental bodies in such markets.\nRisks Related to Our Capital Structure\nOur indebtedness could harm our operating flexibility and competitive position.\nWe have incurred, and may in the future incur, significant indebtedness in connection with acquisitions or other strategic growth initiatives. While at current debt levels we have significant flexibility on our financial debt covenants, should we incur additional indebtedness to fund acquisitions or other strategic growth initiatives, our level of debt and the limitations imposed on us by our debt agreements could adversely affect our operating flexibility and put us at a competitive disadvantage.\nOur ability to make scheduled principal and interest payments, refinance our indebtedness and satisfy our other debt and lease obligations will depend upon our future operating performance and credit market conditions, which could be adversely affected by factors beyond our control. In addition, there can be no assurance that future borrowings or equity financings will be available to us on favorable terms, or at all, for the payment or refinancing of our indebtedness. If we are unable to service our indebtedness, our business, financial condition and results of operations will be adversely affected.\nThe financial and other covenants in our debt agreements may adversely affect us.\nOur senior credit facility contains financial and other restrictive covenants. These covenants could limit our financial and operating flexibility as well as our ability to plan for and react to market conditions, meet our capital needs and support our strategic priorities and initiatives should we take on additional indebtedness for acquisition or other strategic objectives. Our failure to comply with these covenants also could result in events of default which, if not cured or waived, could require us to repay indebtedness before its due date, and we may not have the financial resources or otherwise be able to arrange alternative financing to do so. Our compliance with the covenants of our senior credit facility may be adversely affected by severe market contractions or disruptions to the extent they reduce our earnings for a prolonged period and we are not able to reduce our debt levels or cost structure accordingly. Borrowings under our senior credit facility are secured by most domestic personal property assets and are guaranteed by most of our domestic subsidiaries and by a pledge of the stock of most of our domestic and certain foreign subsidiaries. If borrowings under our senior credit facility were declared or became due and payable immediately as the\nresult of an event of default and we were unable to repay or refinance those borrowings, our lenders could foreclose on the pledged assets and stock. Any event that requires us to repay any of our debt before it is due could require us to borrow additional amounts at unfavorable borrowing terms, cause a significant reduction in our liquidity and impair our ability to pay amounts due on our indebtedness. Moreover, if we are required to repay any of our debt before it becomes due, we may be unable to borrow additional amounts or otherwise obtain the cash necessary to repay that debt, when due, which could have a material adverse effect on our business, financial condition and liquidity.\nWe may incur increased interest expense as a result of our variable rate debt.\nBorrowings under our revolving line of credit and our $200 million term loan incur interest which is variable based on fluctuations in the referenced SOFR (\"Secured Overnight Financing Rate\"). Increases in the referenced SOFR will increase our borrowing costs and negatively impact financial results and cash flows.\nRisks Related to Ownership of Our Common Stock\nThe market price of our common stock may be volatile.\nA relatively small number of shares are normally traded in any one day and higher volumes could have a significant effect on the market price of our common stock. The market price of our common stock could fluctuate significantly for many reasons, including in response to the risks described in this section and elsewhere in this report or for reasons unrelated to our operations, such as reports by industry analysts, investor perceptions or negative announcements by our customers, competitors or suppliers regarding their own performance, as well as industry conditions and general financial, economic and political instability.\nBecause our quarterly revenues and operating results may vary significantly in future periods, our stock price may fluctuate.\nOur revenue and operating results may vary significantly from quarter to quarter. A high proportion of our costs are fixed, due in part to significant selling and manufacturing costs. Small declines in revenues could disproportionately affect operating results in a quarter and the price of our common stock may fall. Other factors that could significantly affect quarterly operating results include, but are not limited to:\ndemand for our products and services;\nthe timing of sales of our products and services;\nchanges in foreign currency exchange rates;\nchanges in applicable tax rates;\nan impairment of goodwill or other intangible assets;\nthe occurrence of restructuring charges;\nunanticipated delays or problems in introducing new products;\nannouncements by competitors of new products, services or technological innovations;\nchanges in our pricing policies or the pricing policies of our competitors;\nincreased expenses, whether related to sales and marketing, raw materials or supplies, labor matters, product development or administration;\nmajor changes in the level of economic activity in major regions of the world in which we do business;\ncosts related to possible future acquisitions or divestitures of technologies or businesses;\nan increase in the number or magnitude of product liability or environmental claims; and\nour ability to expand our operations and the amount and timing of expenditures related to expansion of our operations, particularly outside the U.S.\nVarious provisions and laws could delay or prevent a change of control.\nThe anti-takeover provisions of our articles of incorporation and bylaws and provisions of Wisconsin corporation law could delay or prevent a change of control or may impede the ability of the holders of our common stock to change our management. In particular, our articles of incorporation and bylaws, among other things:\nrequire a supermajority shareholder vote to approve a merger of the Company with another entity;\nregulate how shareholders may present proposals or nominate directors for election at shareholders meetings; and\nauthorize our board of directors to issue preferred stock in one or more series, without shareholder approval.\nGeneral Risk Factors\nGeopolitical unrest and terrorist activities may cause the economic conditions in the U.S. or abroad to deteriorate, which could harm our business.\nTerrorist attacks against targets in the U.S. or abroad, rumors or threats of war, other geopolitical activity or trade disruptions, such as those caused by the Russia-Ukraine conflict, the armed conflict involving Hamas and Israel, or any conflict or threatened conflict between China and Taiwan, may cause general economic conditions in the U.S. or abroad to deteriorate. The occurrence of any of these events could result in a prolonged economic slowdown or recession in the U.S. or in other areas and could have a significant impact on our business, financial condition or results of operations.\nOur inability to attract, develop and retain qualified employees could have a material adverse impact on our operations.\nOur ability to deliver financial results and drive growth and pursue competitive advantages in our business substantially depends on our ability to retain key employees and continually attract new talent to the business. If we experience losses of key employees, such as our executives, or experience significant delays or difficulty in replacing them, our operations, competitive position and financial results may be adversely affected. Competition for highly qualified personnel is intense, and our competitors and other employers may attempt to hire our skilled and key employees. Additionally, we need qualified managers and skilled employees with technical and manufacturing industry experience to operate our businesses successfully. From time to time there may be shortages of skilled labor which may make it more difficult and expensive for us to attract and retain qualified employees or lead to increased labor costs.\nOur intellectual property portfolio may not prevent competitors from developing products and services similar to or duplicative to ours, and the value of our intellectual property may be negatively impacted by external dependencies.\nOur patents, trademarks and other intellectual property may not prevent competitors from independently developing or selling products and services functionally equivalent or superior to our own or adequately deter misappropriation or improper use of our innovations and technology. In addition, further steps we take to protect our intellectual property, including non-disclosure agreements, may not prevent the misappropriation of our business critical secrets and information. In such circumstances, our competitive position and the value of our brand may be negatively impacted.\nOur competitors or other persons could assert that we have infringed their intellectual property rights.\nWe may be the target of enforcement of patents or other intellectual property rights by third parties. We have implemented legal reviews and other controls in our new product development and marketing processes system to mitigate the risk of infringing third-party rights, but those controls may not prove adequate or deter all claims. Responding to infringement claims, regardless of their merits, can be expensive and time consuming. If we are found to infringe any third-party rights, we could be required to pay substantial damages or we could be enjoined from offering some of our current products and services. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of August 31, 2023, we owned or leased the following facilities (square footage in thousands):\nNumber of Locations Square Footage\nDistribution /\nSales /\nAdmin\nManufacturing Total Owned Leased Total\nIndustrial Tools & Services 9 36 45 132 1,053 1,185\nCorporate and Other 2 1 3 26 117 143\n11 37 48 158 1,170 1,328\nWe consider our facilities suitable and adequate for the purposes for which they are used and do not anticipate difficulty in renewing existing leases as they expire or in finding alternative facilities. Our largest facilities are located in the United States, the United Kingdom, the Netherlands, China and Spain. We also maintain a presence in Algeria, Australia, Brazil, France, Germany, Kazakhstan, India, Italy, Japan, Norway, Poland, Saudi Arabia, Singapore, South Africa, South Korea and the United Arab Emirates. See Note 10, Leases in the notes to the consolidated financial statements for information regarding our lease commitments. Item 3. Legal Proceedings\nWe are a party to various legal proceedings that have arisen in the normal course of business. These legal proceedings typically include product liability, breaches of contract, employment, personal injury and other disputes.\nWe have recorded reserves for estimated losses based on the specific circumstances of each case. Such reserves are recorded when it is probable that a loss has been incurred as of the balance sheet date and the amount of the loss can be reasonably estimated. In our opinion, the resolution of these contingencies is not likely to have a material adverse effect on our financial condition, results of operations or cash flows. Information with respect to contingencies arising from legal proceedings, including governmental investigations, set forth in Note 16, Commitments and Contingencies in the notes to the consolidated financial statements is incorporated by reference. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities\nThe Companys Class A common stock is traded on the New York Stock Exchange under the symbol EPAC. As of September 30, 2023, there were 873 shareholders of record of the Company's Class A common stock.\nDividends\nIn fiscal 2023, the Company declared a dividend of $0.04 per share of Class A common stock payable on October 18, 2023 to shareholders of record on October 6, 2023. In fiscal 2022, the Company declared a dividend of $0.04 per share of Class A common stock payable on October 17, 2022 to shareholders of record on October 7, 2022.\nShare Repurchases\nThe Company's Board of Directors has authorized the repurchase of shares of the Company's common stock under publicly announced share repurchase programs. Since the inception of the initial share repurchase program in fiscal 2012, the Company has repurchased 28,772,715 shares of common stock for $801 million. In March 2022, the Company's Board of Directors rescinded its prior share repurchase authorization and approved a new share repurchase program authorizing the repurchase of a total of 10,000,000 shares of the Company's outstanding common stock. As of August 31, 2023, the maximum number of shares that may yet be purchased under this authorization is 4,026,515 shares. The following table summarizes share repurchases during the fourth quarter of fiscal 2023, all of which were purchased under publicly announced share repurchase programs.\nPeriod Shares Repurchased Average Price Paid per Share Maximum Number of Shares That May Yet Be Purchased Under the Program\nJune 1 to June 30, 2023 419,018 $ 26.65 4,977,558\nJuly 1 to July 31, 2023 366,787 26.93 4,610,771\nAugust 1 to August 31, 2023 584,256 26.32 4,026,515\n1,370,061 $ 26.62\nPerformance Graph\nThe graph and table below compare the cumulative 5-year total return of the Company's common stock with the cumulative total returns of the Russell 2000 Index and the S&P 600 Industrial Index. They assume that the value of the investment in our common stock for the last trading day of each fiscal year, in each index, and in the peer group (in each case, including reinvestment of dividends) was $100 on August 31, 2018 and tracks it through August 31, 2023.\n*$100 Invested on 8/31/18 in stock or index, including reinvestment of dividends.\nFiscal year ending August 31.\nCopyright© 2023 Standard & Poor's, a division of S&P Global. All rights reserved.\nCopyright© 2023 Russell Investment Group. All rights reserved.\n8/18 8/19 8/20 8/21 8/22 8/23\nEnerpac Tool Group Corp. $ 100.00 $ 75.52 $ 70.86 $ 85.90 $ 66.36 $ 89.80\nRussell 2000 Index 100.00 87.11 92.35 135.83 111.54 116.73\nS&P 600 Industrial Index 100.00 86.12 89.51 129.60 120.21 145.45\nThe stock price performance included in this graph is not necessarily indicative of future stock price performance. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following Managements Discussion and Analysis is intended to assist the reader in understanding our results of operations and financial condition. Managements Discussion and Analysis is provided as a supplement to, and should be read in conjunction with, our audited consolidated financial statements included in Item 8. \"Financial Statements and Supplementary Data\".\nBackground\nThe Company has one reportable segment, Industrial Tools & Service (\"IT&S\"), and an Other operating segment, which does not meet the criteria to be considered a reportable segment. The IT&S segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools, as well as providing services and tool rental to the industrial, maintenance, infrastructure, oil & gas, alternative energy and other markets. Financial information related to the Company's reportable segment is included in Note 15, \"Business Segment, Geographic and Customer Information\" in the notes to the consolidated financial statements.\nBusiness Update\nOur businesses provide an array of products and services across multiple markets and geographies which results in significant diversification. The IT&S segment and the Company are well-positioned to drive shareholder value through a sustainable business strategy built on well-established brands, broad global distribution and end markets, clear focus on the core tools and services business and disciplined capital deployment.\nOur Business Model\nOur long-term goal is to create sustainable returns for our shareholders through above-market growth in our core business, expanding our margins, generating strong cash flow and being disciplined in the deployment of our capital. We intend to grow through execution of our organic growth strategy, focused on key vertical markets that benefit from long-term macro trends, driving customer driven innovation, expansion of our digital ecosystem to acquire and engage customers, and expansion in emerging markets such as Asia Pacific. In addition to organic growth, we also focus on margin expansion through operational efficiency techniques, including lean, continuous improvement and 80/20, to drive productivity and lower costs, as well as optimizing our selling, general and administrative expenses through consolidation and shared service implementation. We also apply these techniques and pricing actions to offset commodity increases and inflationary pricing. Finally, cash flow generation is critical to achieving our financial and long-term strategic objectives. We believe driving profitable growth and margin expansion will result in cash flow generation, which we seek to supplement through minimizing primary working capital. We intend to allocate the cash flow that results from the execution of our strategy in a disciplined way toward investment in our businesses, maintaining our strong balance sheet, disciplined M&A and opportunistically returning capital to shareholders. We anticipate the compounding effect of reinvesting in our business will fuel further growth and profitable returns.\nGeneral Business Update\nIn March 2022, the Company announced the start of its ASCEND transformation program (ASCEND). ASCENDs key initiatives include accelerating organic growth strategies, improving operational excellence and production efficiency by utilizing a Lean approach, and driving greater efficiency and productivity in selling, general and administrative expense by better leveraging resources to create a more efficient and agile organization. In support of the ASCEND initiatives, we anticipate investing approximately $70-$75 million over the life of the program, which is expected to be fully implemented by the end of the fourth quarter of fiscal 2024, with the expected annual operating profit improvement from the program in the range of $50-$60 million. Through the end of fiscal 2023, we invested approximately $60 million as part of the program, with operating profit improving by approximately $54 million in fiscal 2023 compared to the prior fiscal year.\nIn June 2022, the Company approved a restructuring plan in connection with the initiatives identified as part of the ASCEND transformation program (see Note 3, ASCEND Transformation Program in the notes to the consolidated financial statements) to drive greater efficiency and productivity in global selling, general and administrative resources. The total costs of this plan were then estimated at $6 to $10 million, constituting predominately severance and other employee-related costs to be incurred as cash expenditures and impacting both IT&S and Corporate. On September 23, 2022, the Company approved an updated restructuring plan. The costs of this updated plan (which includes the amounts for the plan approved in June 2022) are estimated at $10 to $15 million. These costs are expected to be incurred over the expected duration of the transformation program, ending in the fourth quarter of fiscal 2024. For fiscal 2024, we expect to incur $10 to $15 million of ASCEND transformation program costs, this range is inclusive of $3 to $5 million of restructuring costs.\nCommencing in February 2022, in response to the armed conflict in Ukraine, many countries, including the member countries of NATO initiated a variety of sanctions and export controls targeting Russia and associated entities. Approximately 1% of our historical annual sales are to customers and distributors associated with Russia and we had approximately $0.5 million of receivables associated with those customers and distributors as of February 28, 2022. The sanctions currently in place limit our ability to provide goods to those customers and distributors and banking sanctions effectively negate our ability to collect those receivables; as such, we recorded a full allowance for doubtful accounts against those receivables as of February 28, 2022 and indefinitely suspended doing business in Russia. We will continue to monitor the situation with Russia to assess when and if we are able to resume business with those customers and distributors, including collection of the outstanding receivables. We also continue to monitor and manage the ancillary impact of the Russia crisis on our business, which is primarily related to supply chain, increased commodity and energy costs, foreign exchange rate volatility and dealer confidence particularly in Europe.\nDuring the year ended August 31, 2022, the Company recorded through bad debt expense (included in \"Selling, general and administrative expenses\" in the Condensed Consolidated Statements of Earnings) a reserve of $13 million to fully reserve for the outstanding accounts receivable balance for an agent in our Middle East/North Africa/Caspian (\"MENAC\") region. The allowance for doubtful accounts for this particular agent remains unchanged during fiscal 2023 and represents management's best estimate of the probable amount of collection and considers various factors with respect to this matter, including, but not limited to, (i) the lack of payment by the agent since the fiscal quarter ended February 28, 2021, (ii) our due diligence on balances due to the agent from its end customers related to sales of our services and products and the known markup on those sales from the agent to end customers, (iii) the status of ongoing negotiations with the agent to secure payments and (iv) legal recourse available to us to secure payment. Actual collections from the agent may differ from the Company's estimate. We have completely ceased our relationship with this agent and have transitioned to serving our regional customers through recently created direct operations within the region.\nOn October 31, 2019, the Company completed the sale of its former EC&S segment to wholly owned subsidiaries of BRWS Parent LLC, a Delaware limited liability company and affiliate of One Rock Capital Partners II, LP, for a purchase price of approximately $216 million (inclusive of final working capital adjustments), with approximately $3 million which was due in four equal quarterly installments, the last of which was received in the first quarter of fiscal 2021. The EC&S segment is treated as discontinued operations in our financial statements for all periods.\nOn July 11, 2023, the Company completed the sale of the Cortland Industrial business, for net proceeds of $20.1 million. The Company recorded a net gain of $6.2 million, see additional discussion in Note 5, \"Discontinued Operations and Other Divestiture Activities\" in the notes to the consolidated financial statements.\nHistorical Financial Data\nThe following table and corresponding year-over-year analysis sets forth our results of continuing operations (dollars in millions, except per share amounts):\nYear Ended August 31,\n2023 2022 2021\nStatements of Earnings Data: (1)\nNet sales $ 598 100 % $ 571 100 % $ 529 100 %\nCost of products sold 303 51 % 306 54 % 286 54 %\nGross profit 295 49 % 265 46 % 243 46 %\nSelling, general and administrative expenses 205 34 % 217 38 % 175 33 %\nAmortization of intangible assets 5 1 % 7 1 % 8 2 %\nRestructuring charges 7 1 % 8 1 % 3 1 %\nImpairment & divestiture (benefit) charges (6) (1) % 2 - % 6 1 %\nOperating profit 84 14 % 31 5 % 51 10 %\nFinancing costs, net 12 2 % 4 1 % 5 1 %\nOther expense, net 3 1 % 2 - % 2 - %\nEarnings before income tax expense 69 12 % 24 4 % 44 8 %\nIncome tax expense 15 3 % 4 1 % 4 1 %\nNet earnings $ 54 9 % $ 20 3 % $ 40 8 %\nOther Financial Data: (1)\nDepreciation $ 11 $ 12 $ 13\nCapital expenditures 9 8 12\n(1) Results are from continuing operations and exclude the financial results of previously divested businesses reported as discontinued operations. Except per share amounts, the summation of the individual components may not equal the total due to rounding.\nFiscal 2023 compared to Fiscal 2022\nConsolidated net sales for fiscal 2023 were $598 million, 5% higher than the prior-year sales of $571 million. The impact of foreign currency rates unfavorably impacted fiscal 2023 sales by approximately $11 million or 2% and the divestiture of the Cortland Industrial business during the fourth quarter of fiscal 2023 unfavorably impacted sales by approximately $6 million or 1%, management refers to sales adjusted for these items as \"core sales\". Product sales growth was 8% with foreign currency and the divestiture of the Cortland Industrial business both unfavorably impacting sales by $9 million or 3% and $6 million or 1%, respectively. The product sales growth was primarily due to pricing actions, with some volume contribution. Service sales declined 8%, unfavorably impacted by $2 million or 1% of foreign currency and our reduced activity in the MENAC region following implementation of an 80/20 analysis that drove a more selective process for quoting projects, with a focus on more differentiated solutions.\nGross profit as a percentage of sales was approximately 49% in fiscal 2023, 3% higher than fiscal 2022. The increased gross profit is primarily attributed to the pricing actions, with some volume contribution noted above and production efficiencies implemented as part of the ASCEND transformation program partially offset by additional costs associated with the ASCEND transformation program.\nOperating profit for fiscal 2023 was $84 million, approximately $53 million higher than the prior fiscal year of $31 million. Operating profit was impacted by the increased gross profit noted above, as well as a reduction of Selling, general & administrative (\"SG&A\") expense of $12 million compared to the prior year. The SG&A decrease was primarily due to personnel savings from the actions taken in the ASCEND transformation program, as well as prior-year charges including MENAC agent specific reserve ($13 million) and leadership transition charges ($7 million), reduction of business review charges related to external support for the deep dive holistic business review ($3 million). These reductions were partially offset by increased incentive compensation expense and expense from the ASCEND transformation program ($21 million) compared to the prior year. Restructuring charges in fiscal 2023 decreased by $1 million to $7 million compared to fiscal 2022. Impairment and divestitures charges (benefit) improved by $9 million due to the gain on sale recorded from the Cortland Industrial divestiture in the fourth quarter of fiscal 2023.\nFiscal 2022 compared to Fiscal 2021\nConsolidated net sales from continuing operations in fiscal 2022 were $571 million, 8% higher than the prior-year sales of $529 million. The impact from foreign currency rates unfavorably impacted sales by roughly $15 million or 3%. Sales growth was from product pricing actions that the Company took beginning in late fiscal 2021 and during fiscal 2022 in response to significant inflationary pressures on commodities, freight and energy costs coupled with year-over-year product volume growth largely in the first half of fiscal 2022, as prior year fiscal 2021 first half sales were still impacted by the COVID-19 pandemic, were the primary drivers of the increase in net sales.\nGross profit as a percentage of net sales in fiscal 2022 of 46% remained relatively flat with fiscal 2021, with improved gross profit margins on product sales primarily due to the aforementioned pricing actions outweighing the impact of inflation and improved productivity in our manufacturing facilities being offset by lower service gross profit margins due to lower service utilization as a result of the Russia-Ukraine conflict and the mix of service work performed year-over-year.\nOperating profit was $20 million lower in fiscal 2022 as compared to fiscal 2021 predominantly due to $42 million of incremental SG&A expenses offset by a $22 million increase in gross profit, as described above. The increase in SG&A was due to ASCEND transformation program charges of $14 million related primarily to the use of external services for the support in the design, development and execution of the program; discrete bad debt charges of approximately $14 million associated with the significant delinquency in payments from a MENAC region agent and for Russian customers and distributors; incremental leadership transition charges of $8 million; charges of $3 million related to external support for the deep-dive holistic business review prior to the launch of the ASCEND program; and roughly $3 million of higher travel and entertainment costs tied to more commercial and leadership travel as we exited the COVID-19 pandemic. Restructuring charges increased $6 million as compared to the prior period as a result of charges to streamline and flatten the organizational structure ($3 million), as well as ASCEND-related restructuring expenses ($3 million).\nSegment Results\nIT&S Segment\nThe IT&S segment is a global supplier of branded hydraulic and mechanical tools and services to a broad array of end markets, including infrastructure, industrial maintenance, repair, and operations, oil & gas, mining, alternative and renewable energy, and civil construction markets. Its primary products include branded tools, cylinders, pumps, hydraulic torque wrenches, highly engineered heavy lifting technology solutions and other tools (Product product line). The segment provides maintenance and manpower services to meet customer-specific needs and rental capabilities for certain of our products (Service & Rental product line). The following table sets forth the results of operations for the IT&S segment (dollars in millions):\nYear Ended August 31,\n2023 2022 2021\nNet Sales $ 555 $ 527 $ 493\nOperating Profit 136 79 82\nOperating Profit % 24.5 % 14.9 % 16.6 %\nFiscal 2023 compared to Fiscal 2022\nFiscal 2023 net sales were $555 million, an increase of 5% or $28 million from fiscal 2022 sales of $527 million, with foreign currency rates unfavorably impacting sales by approximately $11 million or 3%. The increase in sales was predominately driven by growth in the product business primarily due to pricing actions, with some volume contribution, which were partially offset by the decline in the service business due to the implementation of 80/20 analysis and a more selective process for quoting projects in the MENAC region, with a focus on more differentiated solutions in the MENAC region.\nFiscal 2023 operating profit increased $57 million to $136 million. This increase was driven by the aforementioned pricing actions, with some volume contribution and a reduction in SG&A expenses. The reduction of SG&A expense was a result of $13 million of discrete bad debt charges in fiscal 2022 from our MENAC agent and personnel savings from ASCEND actions, which were partially offset by increased incentive compensation expense and higher costs for the ASCEND transformation program in fiscal 2023.\nFiscal 2022 compared to Fiscal 2021\nFiscal 2022 IT&S segment net sales increased by $34 million (7%) from fiscal 2021 to $527 million, which included a $15 million or 3% unfavorable impact on sales due to changes in foreign currency exchange rates. The increase in sales was predominantly attributable to the continued global market recovery from the COVID-19 pandemic resulting in incremental product volume growth largely in the first half of fiscal 2022 coupled with the impact from pricing actions taken in late fiscal 2021 and during fiscal 2022 due to the significant inflation affecting commodity, freight and energy costs.\nFiscal 2022 operating profit decreased $3 million (4%) from the prior year. The operating profit decrease was a result of a $14 million increase in SG&A expense primarily due to discrete bad debt charges of approximately $14 million associated with the significant delinquency in payments from a MENAC region agent and for Russian customers and distributors offset by a $15 million increase in gross profit due to pricing actions outweighing the impact of inflation and improved productivity in our manufacturing facilities being offset by lower service gross profit margins due to lower service utilization as a result of the Russia-Ukraine conflict and the mix of service work performed year over year.\nCorporate\nCorporate consists of selling, general and administrative costs and expenses, including executive, legal, finance, human resources, and information technology, that are not allocated to the segments based on their nature. Corporate expenses were $63 million in fiscal 2023 which is $14 million higher than the fiscal 2022 expenses of $49 million. This increase was primarily from ASCEND transformation program expenses ($15 million) and incentive compensation expense. Additional expense was offset by a decrease in leadership transition charges ($7 million) and external support for the deep dive-holistic business review ($3 million).\nCorporate expenses were $49 million in fiscal 2022 compared to $20 million in fiscal 2021. The increase of $29 million is a result of the ASCEND transformation program charges ($13 million), business review charges related to external support for the deep dive-holistic business review prior to the launch of ASCEND ($3 million), leadership transition & board search charges ($8 million) and an increase in restructuring charges to streamline and flatten the corporate structure ($1 million), as well as ASCEND-related restructuring expenses ($1 million).\nNet financing costs were $12 million, $4 million and $5 million in fiscal years 2023, 2022 and 2021, respectively. The increase in net financing costs in fiscal 2023 as compared to fiscal 2022 was due to the year-over-year increase in interest rates and debt mix during the year. The decrease in net financing costs in fiscal 2022 as compared to fiscal 2021 was due to the year-over-year increase in interest income due to greater short-term investment of excess cash in fiscal 2022.\nIncome Tax Expense\nThe Company's income tax expense is impacted by a number of factors, including, among others, the amount of taxable earnings generated in foreign jurisdictions with tax rates that are different than the U.S. federal statutory rate, permanent items, state tax rates, changes in tax laws, acquisitions and divestitures and the ability to utilize various tax credits and net operating loss carryforwards. Income tax expense also includes the impact of provision to tax return adjustments, changes in valuation allowances and reserve requirements for unrecognized tax benefits. Pre-tax earnings, income tax expense and effective income tax rate from continuing operations for the past three fiscal years were as follows (dollars in thousands):\nYear Ended August 31,\n2023 2022 2021\nEarnings before income tax expense $ 68,898 $ 23,992 $ 43,975\nIncome tax expense 15,249 4,401 3,763\nEffective income tax rate 22.1 % 18.3 % 8.6 %\nThe comparability of pre-tax earnings, income tax expense and the related effective income tax rates are impacted by impairment and other divestiture charges and benefits as well as the Coronavirus Aid, Relief and Economic Security Act (CARES Act), which was enacted on March 27, 2020. Fiscal 2023 results included a $6 million impairment and divestiture benefit, whereas fiscal 2022 and fiscal 2021 results included $2 million and $6 million of impairment and divestiture charges, respectively. A substantial portion of these charges (benefits) do not result in a tax expense or benefit. The fiscal 2023 tax provision included a tax benefit of $2 million related to global tax planning initiatives. The fiscal 2022 tax provision included a tax benefit of $3 million related to global tax planning initiatives resulting from certain prior-year business losses for which no benefits were previously recognized as compared to a $3 million and $4 million benefit in fiscal 2021 related to the lapse of statute of limitations on uncertain tax positions and the net operating loss carryback provision of the CARES Act, respectively.\nBoth the fiscal 2023 and prior-year income tax provisions were impacted by the mix of earnings in foreign jurisdictions with income tax rates different than the U.S. federal income tax rate and income tax benefits from global tax planning initiatives. The fiscal 2023 effective tax rate was 22.1%, which is higher than the fiscal 2022 effective tax rate of 18.3% primarily due to one-time benefits in fiscal 2022. The fiscal 2023 effective tax rate was slightly higher than the statutory 21% primarily as a result of state income taxes and taxes in foreign jurisdictions with rates higher than the U.S. which were partially offset by one-time tax benefits related to global tax planning initiatives that will not repeat in future periods due to certain tax attributes that are no longer available.\nLiquidity and Capital Resources\nAt August 31, 2023, cash and cash equivalents were $154 million, comprised of $148 million of cash held by foreign subsidiaries and $6 million held domestically. The following table summarizes the cash flow attributable to operating, investing and financing activities (in millions):\nYear Ended August 31,\n2023 2022 2021\nCash provided by operating activities $ 78 $ 52 $ 54\nCash provided by (used in) investing activities 11 (7) 13\nCash used in financing activities (53) (52) (82)\nEffect of exchange rate changes on cash (2) (12) 2\nNet increase (decrease) from cash and cash equivalents $ 34 $ (20) $ (12)\nCash flow provided by operations was $78 million for fiscal 2023 and $52 million for fiscal 2022. The $26 million increase in cash flow from operations was primarily the result of $34 million of higher earnings from continuing operations offset by increases in incentive compensation of $10 million. We had approximately $11 million of cash provided by investing activities from continuing operations due to the proceeds from the sale of the Cortland Industrial business in the fourth quarter of fiscal 2023 (see Note 5, \"Discontinued Operations and Other Divestiture Activities\" in the notes to the consolidated financial statements for further detail on the divestiture), as year-over-year cash used for investing in capital expenditures was nearly flat. Cash used in financing activities was $53 million, nearly flat to prior year use of $52 million; however the mix of usage in each fiscal year was different. In fiscal 2023 we entered into a new debt agreement (see Note 7, \"Debt\" in the notes to the consolidated financial statements for further details of the senior credit facility) resulting in a change of debt mix with the repayment of our outstanding revolver and proceeds received from the issuance of a term loan. In fiscal 2023 we had lower treasury share purchases than the prior year. During fiscal 2023 we paid $1 million on our term loan.\nCash flow provided by operations was $52 million and $54 million in fiscal 2022 and 2021, respectively. The decrease of $2 million in cash flow provided by operations was the result of $19 million lower net earnings from continuing operations offset by approximately $14 million of incremental receivable reserves to reconcile net earnings from continuing operations to net cash provided by operating activities. We used $7 million of cash in investing activities in fiscal 2022 as compared to $13 million cash provided by investing activities in fiscal 2021. The cash used in fiscal 2022 was primarily used for capital expenditures. The cash provided by investing activities in fiscal 2021 was largely generated due to the receipt of proceeds from the sale of our manufacturing facility in China ($22 million) and the death benefit for life insurance on legacy officers of the Company ($3 million), offset by approximately $12 million of capital expenditures. In fiscal 2022, our cash used in financing activities was primarily from the purchase of treasury shares of $75 million and the paydown of principal on our revolving credit facility of $60 million partially offset by the borrowing on the revolving credit facility of $85 million. The cash used in financing activities in fiscal 2021 was primarily for the paydown of $90 million of principal on our outstanding credit facility with cash provided by operating activities and excess cash on hand.\nDuring fiscal 2023, the Company refinanced its credit facility resulting in an updated senior credit facility (the \"Senior Credit Facility\") of $600 million, comprised of a $400 million revolving line of credit and a $200 million term loan, which will mature in September 2027. Prior to this, the Company's senior credit facility was comprised of a $400 million revolving line of credit and a $200 million term loan which were scheduled to mature in March 2024. The Senior Credit Facility contains restrictive covenants and financial covenants see Note 7, \"Debt\" in the notes to the consolidated financial statements for further details of the Senior Credit Facility. The Company was in compliance with all covenants, including the financial covenants, under the Senior Credit facility at August 31, 2023. The unused credit line and amount available for borrowing under the revolving line of credit of the Senior Credit Facility was $382 million at August 31, 2023.\nWe believe that the revolving credit facility under the Senior Credit Facility, combined with our existing cash on hand and anticipated operating cash flows, will be adequate to meet operating, debt service, acquisition and capital expenditure funding requirements for the foreseeable future.\nPrimary Working Capital Management\nWe use primary working capital as a percentage of sales as a key metric for working capital efficiency. We define this metric as the sum of net accounts receivable and net inventory less accounts payable, divided by the past three months' sales annualized. The following table shows the components of our primary working capital (dollars in millions):\nAugust 31, 2023 August 31, 2022\n$ PWC % $ PWC %\nAccounts receivable, net $ 98 15 % $ 107 18 %\nInventory, net 75 12 % 84 13 %\nAccounts payable (51) (8) % (73) (11) %\nNet primary working capital $ 122 19 % $ 118 20 %\nTotal primary working capital was $122 million at August 31, 2023, which increased from $118 million at August 31, 2022. The primary working capital increase related to decreased accounts receivable from increased collections during fiscal 2023 and due to $9 million of lower inventory as we continue to work through SKU rationalization. This decrease as well as payments related to our ASCEND transformation program was the driver of the $22 million decrease in accounts payable as of August 31, 2023 compared to August 31, 2022.\nCapital Expenditures\nThe majority of our manufacturing activities consist of assembly operations. We believe that our capital expenditure requirements are not as extensive as other industrial companies given the nature of our operations. Capital expenditures associated with continuing operations were $9 million, $8 million and $12 million in fiscal 2023, 2022 and 2021, respectively.\nCommitments and Contingencies\nGiven our desire to allocate cash flow and revolver availability to fund growth initiatives, we have historically leased most of our facilities and some operating equipment. We lease certain facilities, computers, equipment and vehicles under various operating lease agreements, generally over periods ranging from one to twenty years. Under most arrangements, we pay the property taxes, insurance, maintenance and expenses related to the leased property. Many of our leases include provisions that enable us to renew the leases at contractually agreed rates or, less commonly, based upon market rental rates on the date of expiration of the initial leases.\nWe had outstanding letters of credit totaling $9 million and $11 million at August 31, 2023 and 2022, respectively, the majority of which relate to commercial contracts and self-insured workers' compensation programs.\nAdditional detail regarding contingencies is included in Note 16, \"Commitments and Contingencies\" in the notes to the consolidated financial statements, which is incorporated by reference.\nContractual Obligations\nOur predominant sources of contractual obligations include the payment of interest and principal on our outstanding line of credit, our operating lease portfolio, certain employee-related benefit plans and agreements with certain suppliers related to the procurement of inventory.\nThe timing of principal payments associated with our revolving line of credit are disclosed in Note 7, \"Debt\" in the notes to the consolidated financial statements. We pay interest monthly based on prevailing interest rates at the time and the balance outstanding on our revolving line of credit.\nOur lease contracts are primarily for real estate leases, vehicle leases, IT and manufacturing leases, information technology services and telecommunications services. See Note 10, \"Leases\" in the notes to the consolidated financial statements for future minimum lease payments associated with our lease portfolio.\nWe have long-term obligations related to our deferred compensation, pension and postretirement plans that are summarized in Note 11, Employee Benefit Plans in the notes to the consolidated financial statements.\nAs part of our global sourcing strategy, we have entered into agreements with certain suppliers that require the supplier to maintain minimum levels of inventory to support certain products for which we require a short lead time to fulfill customer orders. We have the ability to notify the supplier that they no longer need to maintain the minimum level of inventory should we discontinue manufacturing a product during the contract period; however, we must purchase the remaining minimum\ninventory levels the supplier was required to maintain within a defined period of time. These contracts allow for us to terminate with appropriate notice so long as we utilize the remaining inventory on hand at the supplier and there are no overall minimum volumes in these contracts other than what the supplier is required to maintain on hand at any given point in time.\nCritical Accounting Estimates\nWe prepare our consolidated financial statements in conformity with US GAAP. This requires management to make estimates and assumptions that affect reported amounts and related disclosures. Actual results could differ from those estimates. The following estimates are considered by management to be the most critical in understanding judgments involved in the preparation of our consolidated financial statements and uncertainties that could impact our results of operations, financial position and cash flow.\nAccounts receivable, net: Accounts receivable, net is recorded based on the contractual value of our accounts receivable, net of an estimated allowance for doubtful accounts representing managements best estimate of the amount of receivables that are not probable of collection. Accounts receivable, net was $98 million as of August 31, 2023, which is net of a $17 million allowance for doubtful accounts. Our customer base generally consists of financially reputable distributors, agents, OEMs, and other customers with whom we have long standing relationships, and historically we have not experienced significant write off of accounts receivables as a percentage of our annual net sales (accounts receivable written off as a percentage of net sales was less than 0.5% for each the years ended August 31, 2023, 2022, and 2021, respectively). As of August 31, 2023, the Company was exposed to a concentration of credit risk with an agent as a result of its continued payment delinquency. During the year ended August 31, 2022, the Company recorded through bad debt expense (included in SG&A expenses in the Condensed Consolidated Statements of Earnings) a reserve of $13 million for this agent based on the consideration of the factors listed below, which fully reserves for this agent's outstanding account receivable balance. The allowance for doubtful accounts for this particular agent remained unchanged as of August 31, 2023 and continues to represent management's best estimate of the amount probable of collection and considers various factors with respect to this matter, including, but not limited to, (i) the lack of payment by the agent since the fiscal quarter ended February 28, 2021, (ii) our due diligence on balances due to the agent from its end customers related to sales of our services and products and the known markup on those sales from the agent to end customer, (iii) the status of ongoing negotiations with the agent to secure payments and (iv) legal recourse available to secure payment. Actual collections from the agent may differ from the Company's estimate.\nInventories: Inventory cost is determined using the last-in, first-out (LIFO) method for a portion of U.S. owned inventory (approximately 48% and 52% of total inventories at August 31, 2023 and 2022, respectively). If the LIFO method were not used, inventory balances would be higher than amounts presented in the Consolidated Balance Sheet by $18 million and $19 million at August 31, 2023 and 2022, respectively. We perform an analysis on historical sales usage of individual inventory items on hand and record a reserve to adjust inventory cost to net realizable value, if necessary. The inventory valuation assumptions used are based on historical experience. We believe that such estimates are made based on consistent and appropriate methods; however, actual results may differ from these estimates under different assumptions or conditions.\nGoodwill and Indefinite-lived intangibles:\nGoodwill Impairment Review and Estimates: A considerable amount of management judgment is required in performing the impairment tests, principally in determining the fair value of each reporting unit and the indefinite-lived intangible assets. While we believe our judgments and assumptions are reasonable, different assumptions could change the estimated fair values and, therefore, impairment charges could be required. Significant negative industry or economic trends, disruptions to the Company's business, loss of significant customers, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in use of the assets or in entity structure and divestitures may adversely impact the assumptions used in the valuations and ultimately result in future impairment charges.\nIn estimating the fair value of a reporting unit, we generally use a discounted cash flow model, which calculates fair value as the sum of the projected discounted cash flows over a discrete six-year period plus an estimated terminal value. Significant assumptions include forecasted revenues, operating profit margins, and discount rates applied to the future cash flows based on the respective reporting unit's estimated weighted average cost of capital. In certain circumstances, we also may review a market approach in which a trading multiple is applied to either forecasted EBITDA (earnings before interest, income taxes, depreciation and amortization) or anticipated proceeds of the reporting unit to arrive at the estimated fair value. If the fair value of a reporting unit is less than its carrying value, an impairment loss is recorded. The estimated fair value represents the amount we believe a reporting unit could be bought or sold for in a current transaction between willing parties on an arms-length basis.\nFiscal 2023 Impairment Charges: The fiscal 2023 annual review of reporting units performed in the fourth quarter did not result in an impairment. All reporting units exceeded the carrying value by more than 65%.\nFiscal 2022 Impairment Charges: In the fourth quarter of fiscal 2022, in conjunction with our annual goodwill impairment assessment, we recorded a $1 million goodwill impairment charge associated with the Cortland Industrial reporting unit. All other reporting units exceeded the carrying value by more than 60%.\nIndefinite-lived intangibles (tradenames): Indefinite-lived intangible assets are also subject to annual impairment testing. On an annual basis or more frequently if a triggering event occurs, the fair value of indefinite-lived intangible assets, based on a relief of royalty valuation approach, are evaluated to determine if an impairment charge is required.\nNo impairment was recorded in fiscal 2023 and no material impairment was recorded in fiscal 2022 as a result of triggering events or the annual impairment review of indefinite-lived intangible assets.\nA considerable amount of management judgment is required in performing impairment tests, principally in determining the fair value of each reporting unit and the indefinite-lived intangible assets. While we believe our judgments and assumptions are reasonable, different assumptions, could change the estimated fair values and, therefore, future additional impairment charges could be required. Prolonged weakening industry or economic trends, disruptions to our business, loss of significant customers, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in the use of the assets or in entity structure and divestitures may adversely impact the assumptions used in the valuations and ultimately result in future impairment charges.\nBusiness Combinations and Purchase Accounting: Business combinations are accounted for using the acquisition method of accounting, and accordingly, the assets and liabilities of the acquired business are recorded at their respective fair values. The excess of the purchase price over the estimated fair value is recorded as goodwill. Assigning fair market values to the assets acquired and liabilities assumed at the date of an acquisition requires knowledge of current market values and the values of assets in use, and often requires the application of judgment regarding estimates and assumptions. While the ultimate responsibility resides with management, for certain acquisitions we retain the services of certified valuation specialists to assist with assigning estimated values to certain acquired assets and assumed liabilities, including intangible assets and tangible long-lived assets. Acquired intangible assets, excluding goodwill, are valued using discounted cash flow methodology based on future cash flows specific to the type of intangible asset purchased. This methodology incorporates various estimates and assumptions, the most significant being projected revenue growth rates, profit margins and forecasted cash flows based on discount rates and terminal growth rates.\nDefined Benefit Plans: We provide a variety of benefits to employees and former employees including, in some cases, pensions and postretirement health care. Plan assets and obligations are recorded based on an August 31 measurement date utilizing various actuarial assumptions such as discount rates, assumed rates of return on plan assets and health care cost trend rates. We determine the discount rate assumptions by referencing high-quality, long-term bond rates that are matched to the duration of our benefit obligations, with appropriate consideration of local market factors, participant demographics and benefit payment forecasts. At August 31, 2023 and 2022, the discount rates on domestic benefit plans were 5.4% and 4.8%, respectively. In estimating the expected return on plan assets, we consider historical returns, forward-looking considerations, inflation assumptions and the asset-allocation strategy in investing such assets. Domestic benefit plan assets consist primarily of participating units in mutual funds with equity based strategies, mutual funds with fixed income based strategies, and U.S treasury securities. The expected return on domestic benefit plan assets was 5.7% and 5.45% for the fiscal years ended August 31, 2023 and 2022, respectively. A 25 basis point change in the assumptions for the discount rate or expected return on plan assets would not have materially changed the fiscal 2023 domestic benefit plan expense.\nWe review actuarial assumptions on an annual basis and make modifications based on current rates and trends, when appropriate. As required by US GAAP, the effects of any modifications are recorded currently or amortized over future periods. Based on information provided by independent actuaries and other relevant sources, we believe that the assumptions used are reasonable; however, changes in these assumptions could impact our financial position, results of operations or cash flow. See Note 11, Employee Benefit Plans in the notes to the consolidated financial statements for further discussion.\nIncome Taxes: Judgment is required to determine the annual effective income tax rate, deferred tax assets and liabilities, reserves for unrecognized tax benefits and any valuation allowances recorded against net deferred tax assets. Our effective income tax rate is based on annual income, statutory tax rates, tax planning opportunities available in the various jurisdictions in which we operate and other adjustments. Our annual effective income tax rate includes the impact of discrete income tax matters including adjustments to reserves for uncertain tax positions and the benefits of various income tax planning activities. Tax regulations require items to be included in our tax returns at different times than these same items are reflected in our consolidated financial statements. As a result, the effective income tax rate in our consolidated financial statements differs from that reported in our tax returns. Some of these differences are permanent, such as expenses that are not tax deductible, while others are temporary differences, such as amortization and depreciation expenses.\nTemporary differences create deferred tax assets and liabilities, which are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. We establish valuation allowances for our deferred tax assets when the amount of expected future taxable income is not large enough to utilize the entire deduction or credit. Relevant factors in determining the realizability of deferred tax assets include future taxable income, the expected timing of the reversal of temporary differences, tax planning strategies and the expiration dates of the various tax attributes. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nThe diverse nature of our business activities necessitates the management of various financial and market risks, including those related to changes in interest rates, foreign currency exchange rates and commodity costs.\nInterest Rate Risk-As of August 31, 2023, long term debt consisted of $16 million of borrowings under the revolving line of credit (variable rate debt) and $200 million of term loan debt bearing interest on SOFR (variable rate). An interest-rate swap effectively converts the SOFR-based rate of $60 million of term borrowings under our credit facility to a fixed rate. A ten percent increase in the average costs of our variable rate debt would have resulted in a $1 million increase in financing costs for the fiscal year ended August 31, 2023.\nForeign Currency Risk-We maintain operations in the U.S. and various foreign countries. Our more significant non-U.S. operations are located in Australia, the Netherlands, the United Kingdom, United Arab Emirates and China, and we have foreign currency risk relating to receipts from customers, payments to suppliers and intercompany transactions denominated in foreign currencies. Under certain conditions, we enter into hedging transactions (primarily foreign currency exchange contracts) that enable us to mitigate the potential adverse impact of foreign currency exchange rate risk (see Note 9, Derivatives in the notes to the consolidated financial statements for further information). We do not engage in trading or other speculative activities with these transactions, as established policies require that these hedging transactions relate to specific currency exposures.\nThe strengthening of the U.S. dollar can have an unfavorable impact on our results of operations and financial position as foreign denominated operating results are translated into U.S. dollars. To illustrate the potential impact of changes in foreign currency exchange rates on the translation of our results of operations, annual sales and operating profit were remeasured assuming a ten percent reduction in foreign exchange rates compared to the U.S. dollar. Under this assumption, annual sales would have been $26 million lower and operating profit would have been $2 million lower for the fiscal year ended August 31, 2023. This sensitivity analysis assumes that each exchange rate would change in the same direction relative to the U.S. dollar and excludes the potential effects that changes in foreign currency exchange rates may have on actual sales or price levels. Similarly, a ten percent decline in foreign currency exchange rates relative to the U.S. dollar on our August 31, 2023 financial position would result in a $38 million reduction to equity (accumulated other comprehensive loss), as a result of non-U.S. dollar denominated assets and liabilities being translated into U.S. dollars, our reporting currency.\nCommodity Risk-We source a wide variety of materials and components from a network of global suppliers. While such materials are typically available from numerous suppliers, commodity raw materials, such as steel and plastic resin are subject to price fluctuations which could have a negative impact on our results. We strive to timely pass along such commodity price increases to customers to avoid profit margin erosion. Item 8. Financial Statements and Supplementary Data\nPage\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReports of Independent Registered Public Accounting Firm (Ernst & Young LLP: PCAOB ID 42)\nConsolidated Statements of Earnings for the years ended August 31, 2023, 2022 and 2021\nConsolidated Statements of Comprehensive Income (Loss) for the years ended August 31, 2023, 2022 and 2021\nConsolidated Balance Sheets as of August 31, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended August 31, 2023, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the years ended August 31, 2023, 2022 and 2021\nNotes to consolidated financial statements\nINDEX TO FINANCIAL STATEMENT SCHEDULE\nSchedule II-Valuation and Qualifying Accounts for the years ended August 31, 2023, 2022 and 2021\nAll other schedules are omitted because they are not applicable, not required or because the required information is included in the consolidated financial statements or notes thereto.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Enerpac Tool Group Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Enerpac Tool Group and Subsidiaries (the Company) as of August 31, 2023 and August 31, 2022, the related consolidated statements of earnings, comprehensive statement of income (loss), shareholders equity and cash flows for each of the three years in the period ended August 31, 2023, and the related notes and financial statement schedule listed in the index at Item 15(a)(2) (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at August 31, 2023 and August 31, 2022, and the results of its operations and its cash flows for each of the three years in the period ended August 31, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated October 20, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nValuation of Goodwill within the IT&S Segment\nDescription of\nthe Matter\nAt August 31, 2023, the Companys consolidated goodwill balance was $266.5 million. Goodwill associated with the IT&S segment was $255.3 million. As disclosed in Note 1 to the financial statements, Management tests goodwill for impairment annually during the fourth quarter, or more frequently if events or changes in circumstances indicate that goodwill might be impaired. In estimating fair value, management utilizes a discounted cash flow model, which is dependent on a number of assumptions, most significantly forecasted revenues and operating profit margins, and the weighted average cost of capital.\nAuditing managements goodwill impairment test within the IT&S segment was complex and highly judgmental due to the significant estimation required to determine the fair value of certain reporting units. In particular, the fair value estimate was sensitive to significant assumptions over forecasted revenues, operating profit margins, and the weighted average cost of capital.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Companys goodwill impairment review process, including controls over management's review of the significant assumptions used to develop the fair value estimates and controls over the completeness and accuracy of the underlying data used in the valuation.\nTo test the estimated fair value of the Companys reporting units within the IT&S segment, we performed audit procedures that included, among others, assessing methodologies and testing the significant assumptions discussed above and the completeness and accuracy of the underlying data used by the Company in its analysis. We also involved our valuation specialists to review certain significant assumptions. We compared the significant assumptions used by management to current industry and economic trends. We assessed the historical accuracy of managements estimates and performed sensitivity analyses of significant assumptions to evaluate the changes in the fair value of the reporting units that would result from changes in the assumptions. We reconciled the fair value of the reporting units in the IT&S segment to their carrying value and tested the Companys determination of the assets and liabilities used within the reporting units that are the basis for the carrying value. In addition, we tested managements reconciliation of the fair value of all the reporting units to the market capitalization of the Company and assessed the adequacy of the Companys goodwill valuation disclosures.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2020.\nMilwaukee, Wisconsin\nOctober 20, 2023\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Enerpac Tool Group Corp.\nOpinion on Internal Control over Financial Reporting\nWe have audited Enerpac Tool Group Corp. and Subsidiaries internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Enerpac Tool Group Corp. and Subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of August 31, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of August 31, 2023 and August 31, 2022, and the related consolidated statements of earnings, comprehensive income (loss), shareholders equity and cash flows for each of the three years in the period ended August 31, 2023, and the related notes and financial statement schedule listed in the accompanying index at Item 15(a)(2) and our report dated October 20, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nMilwaukee, Wisconsin\nOctober 20, 2023\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF EARNINGS\n(in thousands, except per share amounts)\nYear Ended August 31,\n2023 2022 2021\nNet sales\nProduct $ 490,629 $ 454,126 $ 411,888\nService & rental 107,575 117,097 116,772\nTotal net sales 598,204 571,223 528,660\nCost of products sold\nProduct 235,403 232,497 216,442\nService & rental 67,762 73,338 69,062\nTotal cost of products sold 303,165 305,835 285,504\nGross profit 295,039 265,388 243,156\nSelling, general and administrative expenses 205,064 216,874 175,277\nAmortization of intangible assets 5,112 7,306 8,176\nRestructuring charges 7,096 8,135 2,392\nImpairment & divestiture (benefit) charges (6,155) 2,413 6,198\nOperating profit 83,922 30,660 51,113\nFinancing costs, net 12,389 4,386 5,266\nOther expense, net 2,635 2,282 1,872\nEarnings before income tax expense 68,898 23,992 43,975\nIncome tax expense 15,249 4,401 3,763\nNet earnings from continuing operations 53,649 19,591 40,212\nLoss from discontinued operations, net of income taxes (7,088) (3,905) (2,135)\nNet earnings $ 46,561 $ 15,686 $ 38,077\nEarnings per share from continuing operations\nBasic $ 0.95 $ 0.33 $ 0.67\nDiluted $ 0.94 $ 0.33 $ 0.67\nLoss per share from discontinued operations\nBasic $ (0.13) $ (0.07) $ (0.04)\nDiluted $ (0.12) $ (0.07) $ (0.04)\nEarnings per share\nBasic $ 0.82 $ 0.26 $ 0.63\nDiluted $ 0.82 $ 0.26 $ 0.63\nWeighted average common shares outstanding\nBasic 56,680 59,538 60,024\nDiluted 57,117 59,909 60,403\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(in thousands)\nYear Ended August 31,\n2023 2022 2021\nNet income $ 46,561 $ 15,686 $ 38,077\nOther comprehensive income (loss), net of tax\nForeign currency translation adjustments 12,887 (46,092) 5,910\nCash flow hedges (375) - -\nPension and other postretirement benefit plans 1,239 4,115 1,830\nTotal other comprehensive income (loss), net of tax 13,751 (41,977) 7,740\nComprehensive income (loss) $ 60,312 $ (26,291) $ 45,817\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share and per share amounts)\nAugust 31,\n2023 2022\nA S S E T S\nCurrent assets\nCash and cash equivalents $ 154,415 $ 120,699\nAccounts receivable, net 97,649 106,747\nInventories, net 74,765 83,672\nOther current assets 28,811 31,262\nTotal current assets 355,640 342,380\nProperty, plant and equipment, net 38,968 41,372\nGoodwill 266,494 257,949\nOther intangible assets, net 37,338 41,507\nOther long-term assets 64,157 74,104\nTotal assets $ 762,597 $ 757,312\nL I A B I L I T I E S A N D S H A R E H O L D E R S E Q U I T Y\nCurrent Liabilities\nTrade accounts payable $ 50,483 $ 72,524\nAccrued compensation and benefits 33,194 21,390\nCurrent maturities of long-term debt 3,750 -\nShort-term debt - 4,000\nIncome taxes payable 3,771 4,594\nOther current liabilities 56,922 50,680\nTotal current liabilities 148,120 153,188\nLong-term debt, net 210,337 200,000\nDeferred income taxes 5,667 7,355\nPension and postretirement benefit liabilities 10,247 11,941\nOther long-term liabilities 61,606 66,217\nTotal liabilities 435,977 438,701\nCommitments and contingencies (Note 16)\nShareholders equity\nClass A common stock, $0.20 par value per share, authorized 168,000,000 shares, issued 83,760,798 and 83,397,458 shares, respectively 16,752 16,679\nAdditional paid-in capital 220,472 212,986\nTreasury stock, at cost, 28,772,715 and 26,558,965 shares, respectively (800,506) (742,844)\nRetained earnings 1,011,112 966,751\nAccumulated other comprehensive loss (121,210) (134,961)\nStock held in trust (3,484) (3,209)\nDeferred compensation liability 3,484 3,209\nTotal shareholders' equity 326,620 318,611\nTotal liabilities and shareholders' equity $ 762,597 $ 757,312\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear Ended August 31,\n2023 2022 2021\nOperating Activities\nNet earnings $ 46,561 $ 15,686 $ 38,077\nLess: Net loss from discontinued operations (7,088) (3,905) (2,135)\nNet earnings from continuing operations 53,649 19,591 40,212\nAdjustments to reconcile net earnings from continuing operations to net cash provided by operating activities - continuing operations:\nImpairment & divestiture (benefit) charges, net of tax effect (6,155) 2,413 5,586\nDepreciation and amortization 16,313 19,600 21,611\nStock-based compensation expense 8,574 13,619 9,215\nProvision (benefit) for deferred income taxes 460 (5,291) 9,639\nAmortization of debt issuance costs 902 480 480\nProvision for bad debts 803 13,856 -\nOther non-cash charges (benefits) 1,569 (344) (9,172)\nChanges in components of working capital and other, excluding acquisitions and divestitures:\nAccounts receivable 5,169 (23,753) (19,113)\nInventories 4,539 (16,036) (5,857)\nTrade accounts payable (21,867) 9,658 16,695\nPrepaid expenses and other assets (3,764) 12,545 (18,812)\nIncome tax accounts 9,933 4,022 (4,293)\nAccrued compensation and benefits 11,288 1,267 3,631\nOther accrued liabilities (2,840) 619 5,038\nCash provided by operating activities - continuing operations 78,573 52,246 54,860\nCash used in operating activities - discontinued operations (970) (510) (677)\nCash provided by operating activities 77,603 51,736 54,183\nInvesting Activities\nCapital expenditures (9,400) (8,417) (12,019)\nProceeds from sale of property, plant and equipment 685 1,176 22,409\nProceeds from company owned life insurance policies - - 2,911\nProceeds from sale of business, net of transaction costs 20,057 - -\nCash provided by (used in) investing activities - continuing operations 11,342 (7,241) 13,301\nCash provided by (used in) investing activities 11,342 (7,241) 13,301\nFinancing Activities\nBorrowings on revolving credit facility 69,000 85,000 10,000\nPrincipal repayments on revolving credit facility (53,000) (60,000) (90,000)\nSwingline (repayments) borrowings, net (4,000) 4,000 -\nPrincipal repayments on term loan (1,250) - -\nProceeds from issuance of term loan 200,000 - -\nPayment for redemption of revolver (200,000) - -\nPayment of debt issuance costs (2,486) - -\nPurchase of treasury shares (57,662) (75,112) -\nStock options, taxes paid related to the net share settlement of equity awards & other (1,458) (3,681) 128\nPayment of cash dividend (2,274) (2,409) (2,394)\nCash used in financing activities - continuing operations (53,130) (52,202) (82,266)\nCash provided by financing activities - discontinued operations - - 750\nCash used in financing activities (53,130) (52,202) (81,516)\nEffect of exchange rate changes on cash (2,099) (11,946) 2,214\nNet increase (decrease) from cash and cash equivalents 33,716 (19,653) (11,818)\nCash and cash equivalents - beginning of period 120,699 140,352 152,170\nCash and cash equivalents - end of period $ 154,415 $ 120,699 $ 140,352\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(in thousands)\nCommon Stock Additional\nPaid-in\nCapital Treasury\nStock Retained\nEarnings Accumulated\nOther\nComprehensive\nLoss Stock Held In Trust Deferred\nCompensation\nLiability Total\nShareholders\nEquity\nIssued\nShares Amount\nBalance at August 31, 2020 82,594 $ 16,519 $ 193,492 $ (667,732) $ 917,671 $ (100,724) $ (2,562) $ 2,562 $ 359,226\nNet earnings - - - - 38,077 - - - 38,077\nOther comprehensive income, net of tax - - - - - 7,740 - - 7,740\nStock contribution to employee benefit plans and other 17 4 359 - - - - - 363\nVesting of equity awards 282 56 (56) - - - - - -\nCash dividend ($0.04 per share) - - - - (2,409) - - - (2,409)\nStock based compensation expense - - 9,215 - - - - - 9,215\nStock option exercises 104 20 2,188 - - - - - 2,208\nTax effect related to net share settlement of equity awards - - (2,445) - - - - - (2,445)\nStock issued to, acquired for and distributed from rabbi trust 25 5 218 - - - (505) 505 223\nBalance at August 31, 2021 83,022 16,604 202,971 (667,732) 953,339 (92,984) (3,067) 3,067 412,198\nNet earnings - - - - 15,686 - - - 15,686\nOther comprehensive loss, net of tax - - - - - (41,977) - - (41,977)\nStock contribution to employee benefit plans and other 15 3 266 - - - - - 269\nVesting of equity awards 350 70 (70) - - - - - -\nCash dividend ($0.04 per share) - - - - (2,274) - - - (2,274)\nTreasury stock repurchases - - - (75,112) - - - - (75,112)\nStock based compensation expense - - 13,619 - - - - - 13,619\nTax effect related to net share settlement of equity awards - - (3,950) - - - - - (3,950)\nStock issued to, acquired for and distributed from rabbi trust 10 2 150 - - - (142) 142 152\nBalance at August 31, 2022 83,397 16,679 212,986 (742,844) 966,751 (134,961) (3,209) 3,209 318,611\nNet earnings - - - - 46,561 - - - 46,561\nOther comprehensive income, net of tax - - - - - 13,751 - - 13,751\nStock contribution to employee benefit plans and other 9 2 191 - - - - - 193\nVesting of equity awards 273 54 (54) - - - - - -\nCash dividend ($0.04 per share) - - - - (2,200) - - - (2,200)\nTreasury stock repurchases - - - (57,662) - - - - (57,662)\nStock based compensation expense - - 8,699 - - - - - 8,699\nStock option exercises 43 8 965 - - - - - 973\nTax effect related to net share settlement of equity awards - - (2,624) - - - - - (2,624)\nStock issued to, acquired for and distributed from rabbi trust 39 9 309 - - - (275) 275 318\nBalance at August 31, 2023 83,761 $ 16,752 $ 220,472 $ (800,506) $ 1,011,112 $ (121,210) $ (3,484) $ 3,484 $ 326,620\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. Summary of Significant Accounting Policies\nNature of Operations: Enerpac Tool Group Corp. (the Company) is a premier industrial tools, services, technology and solutions company serving a broad and diverse set of customers in more than 100 countries. The Company has one reportable segment, Industrial Tools & Services (\"IT&S\"), and an Other operating segment, which does not meet the criteria to be considered a reportable segment. The IT&S segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools and in providing services and tool rental to the infrastructure, industrial maintenance, repair and operations, oil & gas, mining, alternative and renewable energy, civil construction and other markets.\nConsolidation and Presentation: The consolidated financial statements include the accounts of the Company and its subsidiaries, all of which are wholly owned. The results of companies acquired or disposed of during the year are included in the consolidated financial statements from the effective date of acquisition or until the date of divestiture. All intercompany balances, transactions and profits have been eliminated in consolidation. The terms the \"Company,\" \"we,\" and \"our\" refer to Enerpac Tool Group Corp. and its subsidiaries, unless the context requires that such terms refer only to Enerpac Tool Group Corp. Reference to fiscal years, such as \"fiscal 2023,\" are to the fiscal year ending on August 31 of the specified year.\nOn October 31, 2019, as part of our overall strategy to become a pure-play industrial tools and services company, the Company completed the sale of the businesses comprising its former Engineered Components & Systems (\"EC&S\") segment.This divestiture represented a strategic shift in our operations,and accordingly the results of the former EC&S segment through the date of divestiture and subsequent impacts to the financial results from retained liabilities are recorded in \"Loss from discontinued operations, net of income taxes\" within the Consolidated Statements of Earnings.\nOn July 11, 2023, the Company completed the sale of the Cortland Industrial business, which had been included in the Other operating segment.\nCash Equivalents: The Company considers all highly liquid investments with original maturities of 90 days or less to be cash equivalents.\nInventories: Inventories are comprised of material, direct labor and manufacturing overhead. A portion of inventory is recorded on the first-in, first-out or average cost method and is stated at the lower of cost or net realizable value. A portion of U.S. owned inventory is determined using the last-in, first-out (LIFO) method (48.1% and 51.7% of total inventories as of August 31, 2023 and 2022, respectively). If the LIFO method were not used, inventory balances would be higher than reported amounts in the consolidated balance sheets by $17.6 million and $19.0 million at August 31, 2023 and 2022, respectively.\nThe nature of the Companys products is such that they generally have a very short production cycle. Consequently, the amount of work-in-process at any point in time is minimal. In addition, many parts or components are ultimately either sold individually or assembled with other parts making a distinction between raw materials and finished goods impractical to determine. Certain locations maintain and manage their inventories using a job cost system where the distinction of categories of inventory by state of completion is also not available. As a result of these factors, it is neither practical nor cost effective to segregate the amounts of raw materials, work-in-process or finished goods inventories at the respective balance sheet dates, as segregation would only be possible as the result of physical inventories which are taken at dates different from the balance sheet dates.\nProperty, Plant and Equipment: Property, plant and equipment are stated at cost. Plant and equipment are depreciated on a straight-line basis over the estimated useful lives of the assets, ranging from ten to forty years for buildings and improvements and two to fifteen years for machinery and equipment. Equipment includes assets which are rented to customers of the IT&S segment. Leasehold improvements are amortized over the shorter of the life of the related asset or the term of the lease. Depreciation expense was $11.2 million, $12.3 million and $13.4 million for the years ended August 31, 2023, 2022 and 2021, respectively. The following is a summary of the Company's components of property, plant and equipment (in thousands):\nAugust 31,\n2023 2022\nLand, buildings and improvements $ 14,070 $ 14,121\nMachinery and equipment 136,566 141,571\nGross property, plant and equipment 150,636 155,692\nLess: Accumulated depreciation (111,668) (114,320)\nProperty, plant and equipment, net $ 38,968 $ 41,372\nLeases: We determine if an arrangement contains a lease in whole or in part at the inception of the contract and identify classification of the lease as financing or operating. We account for the underlying operating lease asset at the individual lease level. Operating leases are recorded as operating lease right-of-use (ROU) assets in Other long-term assets and operating lease liabilities in Other current liabilities and Other long-term liabilities on the Consolidated Balance Sheets.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nAll leases greater than 12 months result in recognition of a ROU asset and a liability at the lease commencement date and are recorded at the present value of the future minimum lease payments over the lease term. The lease term is equal to the initial term at commencement plus any renewal or extension options that the Company is reasonably certain will be exercised. ROU assets at the date of commencement are equal to the amount of the initial lease liability, the initial direct costs incurred by the Company and any prepaid lease payments less any incentives received. Lease expense for operating leases is recognized on a straight-line basis over the lease term or remaining useful life. As most of our leases do not provide the information required to determine the implicit rate, we utilize a consolidated group incremental borrowing rate for all leases as the Company has centralized treasury operations. The incremental borrowing rate is derived through a combination of inputs such as the Company's credit rating, impact of collaborated borrowing capabilities and lease term.\nLeases with the duration of less than one-year are not recognized on the balance sheet and are expensed on a straight-line basis over the lease term. In addition, we do not separate lease components from non-lease components for all asset classes.\nGoodwill and Other Intangible Assets: Goodwill and other intangible assets with indefinite lives are not subject to amortization, but are subject to annual impairment testing. Other intangible assets with definite lives, consisting primarily of purchased customer relationships, patents, trademarks and tradenames, are amortized over periods from one to twenty-five years.\nThe Companys goodwill is tested for impairment annually, during the fourth quarter, or more frequently if events or changes in circumstances indicate that goodwill might be impaired. The Company performs impairment reviews for its reporting units using a fair value method based on managements judgments and assumptions. In estimating the fair value, the Company utilizes a discounted cash flow model, which is dependent on a number of assumptions, most significantly forecasted revenues and operating profit margins, and the weighted average cost of capital, or a market value approach if appropriate information is available as of the goodwill impairment assessment date. The estimated fair value of the reporting unit is compared to the carrying amount of the reporting unit, including goodwill. If the carrying value of the reporting unit exceeds its fair value, an impairment loss is recorded and should not exceed the total amount of the goodwill allocated to the reporting unit. Indefinite-lived intangible assets are also subject to an annual impairment test. On an annual basis, or more frequently if events or changes in circumstances indicate that the asset might be impaired, the fair value of the indefinite-lived intangible assets are evaluated by the Company to determine if an impairment charge is required. A considerable amount of management judgment is required in performing impairment tests, principally in determining the fair value of each reporting unit and the indefinite-lived intangible assets.\nProduct Warranty Costs: The Company generally offers its customers an assurance warranty on products sold, although warranty periods may vary by product type and application. The reserve for future warranty claims, which is recorded within the \"Other current liabilities\" line on the Consolidated Balance Sheets, is based on historical claim rates and current warranty cost experience. The following is a roll-forward of the changes in product warranty reserves for fiscal 2023 and 2022 (in thousands):\n2023 2022\nBeginning balance $ 1,140 $ 1,300\nProvision for warranties 418 887\nWarranty payments and costs incurred (723) (911)\nWarranty activity for divested businesses (10) -\nImpact of changes in foreign currency rates 31 (136)\nEnding balance $ 856 $ 1,140\nRevenue from Contracts with Customers: The Company recognizes revenue when it satisfies a performance obligation in a contract by transferring control of a distinct good or service to a customer. A contracts transaction price is allocated to each distinct performance obligation and revenue is measured based on the consideration that the Company expects to be entitled to in exchange for the goods or services transferred. When contracts include multiple products or services to be delivered to the customer, the consideration for each element is generally allocated on the standalone transaction prices of the separate performance obligations, using the adjusted market assessment approach.\nUnder normal circumstances, the Company invoices the customer once transfer of control has occurred and has a right to payment. The typical payment terms vary based on the customer and the types of goods and services in the contract. The period of time between invoicing and when payment is due is not significant, as our standard payment terms are less than one year. Amounts billed and due from customers are classified as receivables on the Consolidated Balance Sheets.\nCustomer sales are recorded net of allowances for returns and discounts, which are recognized as a deduction from sales at the time of sale. The Company commits to one-time or on-going trade discounts and promotions with customers that require the Company to estimate and accrue the ultimate costs of such programs. The Company generally does not require collateral or other security for receivables and provides for an allowance for doubtful accounts based on historical experience and a review\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nof its existing receivables. Accounts receivable are stated net of an allowance for doubtful accounts of $16.8 million and $17.5 million at August 31, 2023 and 2022, respectively.\nTaxes Collected: Taxes collected by the Company from a customer concurrent with revenue-producing activities are excluded from \"Net sales\" within the Consolidated Statements of Earnings.\nShipping and Handling Costs: The Company records costs associated with shipping its products after control over a product has transferred to a customer and are accounted for as fulfillment costs. These costs are reported in the Consolidated Statements of Earnings in \"Cost of products sold.\"\nResearch and Development Costs: Research and development costs consist primarily of engineering and development resources and are expensed as incurred. Such costs incurred in the development of new products or significant improvements to existing products were $9.0 million, $7.3 million and $7.4 million in fiscal 2023, 2022 and 2021, respectively. The Company also incurs significant costs in connection with fulfilling custom orders and developing solutions for unique customer needs which are not included in these research and development expense totals.\nOther Income/Expense: Other income and expense primarily consists of net foreign currency exchange transaction losses of $2.1 million, $1.5 million and $1.8 million in fiscal 2023, 2022 and 2021, respectively.\nFinancing Costs: Financing costs represent interest expense, financing fees and amortization of debt issuance costs, net of interest income. Interest income was $2.6 million, $1.3 million and $0.7 million for fiscal 2023, 2022 and 2021, respectively.\nIncome Taxes: The provision for income taxes includes federal, state, local and non-U.S. taxes on income. Tax credits, primarily for non-U.S. earnings, are recognized as a reduction of the provision for income taxes in the year in which they are available for U.S. tax purposes. Deferred taxes are provided on temporary differences between assets and liabilities for financial and tax reporting purposes as measured by enacted tax rates expected to apply when temporary differences are settled or realized. Future tax benefits are recognized to the extent that realization of those benefits is considered to be more likely than not. A valuation allowance is established for deferred tax assets for which realization is not more likely than not of being realized. The Company has not provided for any residual U.S. income taxes on unremitted earnings of non-U.S. subsidiaries, as such earnings are intended to be indefinitely reinvested to the extent the remittance does not result in an incremental U.S. tax liability. The Company recognizes interest and penalties related to unrecognized tax benefits in income tax expense and treats any taxes due on future U.S. inclusions in taxable income under the Global Intangible Low-Taxed Income (\"GILTI\") provision as a current period tax expense.\nForeign Currency Translation: The financial statements of the Companys foreign operations are translated into U.S. dollars using the exchange rate at each balance sheet date for assets and liabilities and an appropriate weighted average exchange rate for each applicable period within the Consolidated Statements of Earnings. Translation adjustments are reflected in the Consolidated Balance Sheets and Consolidated Statements of Shareholders' Equity caption Accumulated other comprehensive loss.\nAccumulated Other Comprehensive Loss: The following is a summary of the components included within accumulated other comprehensive loss (in thousands):\nAugust 31,\n2023 2022\nForeign currency translation adjustments $ 102,268 $ 116,078\nPension and other postretirement benefit plans 18,394 18,883\nCash flow hedges 548 -\nAccumulated other comprehensive loss $ 121,210 $ 134,961\nUse of Estimates: The preparation of financial statements in conformity with generally accepted accounting principles in the United States (\"US GAAP\") requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting periods. The Company regularly evaluates the estimates and assumptions related to the allowance for doubtful accounts, inventory valuation, warranty reserves, goodwill, intangible and long-lived asset valuations, employee benefit plan liabilities, over-time revenue recognition, income tax liabilities, deferred tax assets and related valuation allowances, uncertain tax positions, restructuring reserves, and litigation and other loss contingencies.\nThe Company manages the profitability of its product and service & rental categories on a combined basis given the complexity of the business model. This model includes providing integrated product and service solutions resulting in facilities that generate revenues from both product and service & rental categories, which also have indirect and facility overhead costs included in cost of sales. As such, judgment and estimates are required to disaggregate product and service & rental cost of\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nsales including allocating indirect and facility overhead costs between cost of product sales and the cost of service & rental sales. Changes in these judgments and estimates could materially change the allocation of the indirect and facility overhead costs to the different sales categories and the resulting ratio of cost of sales to net sales by category. Because the sales mix heavily favors the product category, a change in the mix of cost of sales between the sales categories would have a more significant impact on the ratio of cost of sales to net sales for the service & rental category.\nNote 2. Revenue from Contracts with Customers\nNature of Goods and Services\nThe Company generates its revenue under two principal activities, which are discussed below:\nProduct Sales: Sales of tools, heavy-lifting solutions, and rope solutions are recorded when control is transferred to the customer (i.e., performance obligation has been satisfied). For the majority of the Companys product sales, revenue is recognized at a point in time when control of the product is transferred to the customer, which generally occurs when the product is shipped from the Company to the customer. For certain other products that are highly customized and have a limited alternative use, and for which the Company has an enforceable right of reimbursement for performance completed to date, revenue is recognized over time. We consider the input measure (efforts-expended or cost-to-cost) or output measure as a fair measure of progress for the recognition of over-time revenue associated with these custom products. For a majority of these customized products, machine hours and labor hours (efforts-expended measurement) are used as a measure of progress.\nService & Rental Sales: Service contracts consist of providing highly trained technicians to perform bolting, technical services, machining and joint-integrity work for our customers. These revenues are recognized over time as our customers simultaneously receive and consume the benefits provided by the Company. We consider the input measure (efforts-expended or cost-to-cost) or output measure as a fair measure of progress for the recognition of over-time revenue associated with service contracts. For a majority of the Companys service contracts, labor hours (efforts-expended measurement) is used as the measure of progress when it is determined to be a better depiction of the transfer of control to the customer due to the timing and pattern of labor hours incurred. Revenue from rental contracts (less than one year and non-customized products) is generally recognized ratably over the contract term, depicting the customers consumption of the benefit related to the rental equipment.\nDisaggregated Revenue and Performance Obligations\nThe Company disaggregates revenue from contracts with customers by reportable segment and product line and by the timing of when goods and services are transferred. See Note 15, \"Business Segment, Geographic and Customer Information\" for information regarding our revenue disaggregation by reportable segment and product line.\nThe following table presents information regarding revenues disaggregated by the timing of when goods and services are transferred (in thousands):\nYear Ended August 31,\n2023 2022 2021\nRevenues recognized at point in time $ 482,506 $ 442,832 $ 396,457\nRevenues recognized over time 115,698 128,391 132,203\nTotal $ 598,204 $ 571,223 $ 528,660\nContract Balances\nThe Company's contract assets and liabilities are as follows (in thousands):\nAugust 31,\n2023 2022\nReceivables, which are included in accounts receivable, net $ 97,649 $ 106,747\nContract assets, which are included in other current assets 3,989 2,397\nContract liabilities, which are included in other current liabilities 2,927 2,804\nReceivables: The Company performs its obligations under a contract with a customer by transferring goods or services in exchange for consideration from the customer. The Company typically invoices its customers as soon as control of an asset is transferred and a receivable for the Company is established. Accounts receivable, net is recorded at face amount of customer receivables less an allowance for doubtful accounts. The Company maintains an allowance for doubtful accounts for expected losses as a result of customers inability to make required payments. Management evaluates the aging of customer receivable balances, the financial condition of its customers, historical trends and the time outstanding of specific balances to estimate the\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\namount of receivables that will not be collected in the future and records the appropriate provision. The allowance for doubtful accounts was $16.8 million and $17.5 million at August 31, 2023 and 2022, respectively.\nAs indicated in the \"Concentration of Credit Risk\" section below, as of August 31, 2023 and 2022, the Company was exposed to a concentration of credit risk with an agent as a result of its continued payment delinquency. During the year ended August 31, 2022, the Company recorded through bad debt expense (included in \"Selling, general and administrative expenses\" (\"SG&A expenses\") in the Condensed Consolidated Statements of Earnings) a reserve of $13.2 million based on the consideration of the factors listed below, which fully reserves for the outstanding account receivable balance for this agent. The allowance for doubtful accounts for this particular agent as of August 31, 2023 represents management's best estimate of the amount probable of collection and considers various factors with respect to this matter, including, but not limited to, (i) the lack of payment by the agent since the fiscal quarter ended February 28, 2021, (ii) our due diligence on balances due to the agent from its end customers related to sales of our services and products and the known markup on those sales from the agent to end customer, (iii) the status of ongoing negotiations with the agent to secure payments and (iv) legal recourse available to secure payment. Actual collections from the agent may differ from the Company's estimate.\nConcentration of Credit Risk: The Company sells products and services through distributors and agents. In certain jurisdictions, those third parties represent a significant portion of our sales in their respective country which can pose a concentration of credit risk if these larger distributors or agents are not timely in their payments. As of August 31, 2023 the Company was exposed to a concentration of credit risk as a result of the payment delinquency of one of our agents whose accounts receivable represent 11.3% of the Company's outstanding accounts receivable. As of August 31, 2023, the Company has fully reserved for the amounts due from this agent.\nContract Assets: Contract assets relate to the Companys rights to consideration for work completed but not billed as of the reporting date on contracts with customers. The contract assets are transferred to receivables when the rights become unconditional. The Company has contract assets on contracts that are generally long-term and have revenues that are recognized over time.\nContract Liabilities: As of August 31, 2023, the Company had certain contracts where there were unsatisfied performance obligations and the Company had received cash consideration from customers before the performance obligations were satisfied. The majority of these contracts relate to long-term customer contracts (project durations of greater than three months) and are recognized over time. The Company estimates that the $2.9 million will be recognized in net sales from satisfying those performance obligations within the next twelve months.\nTiming of Performance Obligations Satisfied at a Point in Time: The Company evaluates when the customer obtains control of the product based on shipping terms, as control will transfer, depending upon such terms, at different points between the Company's manufacturing facility or warehouse and the customers location. The Company considers control to have transferred upon shipment or delivery because (i) the Company has a present right to payment at that time; (ii) the legal title has been transferred to the customer; (iii) the Company has transferred physical possession of the product to the customer; and (iv) the customer has significant risks and rewards of ownership of the product.\nVariable Consideration: The Company estimates whether it will be subject to variable consideration under the terms of the contract and includes its estimate of variable consideration in the transaction price based on the expected value method when it is deemed probable of being realized based on historical experience and trends. Types of variable consideration may include rebates, incentives and discounts, among others, which are recorded as a reduction to net sales at the time when control of a performance obligation is transferred to the customer.\nPractical Expedients & Exemptions: The Company elected to expense the incremental cost to obtaining a contract when the amortization period for such contracts would be one year or less. The Company does not disclose the value of unperformed obligations for (i) contracts with an original expected length of one year or less and (ii) contracts for which it recognizes revenue at the amount to which it has the right to invoice for services performed.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nNote 3. ASCEND Transformation Program\nIn March 2022, the Company announced the launch of ASCEND, a new transformation program focused on driving accelerated earnings growth and efficiency across the business with the goal of delivering an estimated incremental $40 to $50 million of annual operating profit once fully implemented. In March 2023, the Company announced this estimate had been revised to an incremental $50 to $60 million of annual operating profit as a result of additional ASCEND initiatives and high success rate. As part of ASCEND, the Company is focusing on the following key initiatives: (i) accelerating organic growth go-to-market strategies, (ii) improving operational excellence and production efficiency by utilizing a lean approach and (iii) driving greater efficiency and productivity in SG&A expenses by better leveraging resources to create a more efficient and agile organization.\nThe Company is implementing the program and originally anticipated investing approximately $60 to $65 million and in March 2023 anticipated that this investment would increase to $70 to $75 million (as disclosed in Note 4, \"Restructuring Charges,\" approximately $10 to $15 million of these investments will be in the form of restructuring charges) over the life of the program, which is expected to be finalized as we exit fiscal 2024. Elements of these investments could include such cash costs as capital expenditures, restructuring costs, third-party support, and incentive costs (which incentives are not available for the senior management team). Total program expenses were approximately $43.1 million and $16.7 million for the year ended August 31, 2023 and 2022. Of the total ASCEND program expenses for the year ended August 31, 2023, $34.5 million were recorded within SG&A expenses and $0.9 million recorded within cost of goods sold and $7.7 million were recorded within restructuring expenses (see Note 4, \"Restructuring Charges,\" below). Of the total ASCEND program expenses for the year ended August 31, 2022, $13.6 million were recorded within SG&A expenses and $3.1 million were recorded within restructuring expenses (see Note 4, \"Restructuring Charges,\" below). For fiscal 2024, we expect to incur $10 to $15 million of ASCEND transformation program costs, this range is inclusive of $3 to $5 million of restructuring costs.\nNote 4. Restructuring Charges\nThe Company has undertaken or committed to various restructuring initiatives, including workforce reductions, leadership changes, plant consolidations to reduce manufacturing overhead, satellite office closures, the continued movement of production and product sourcing to low-cost alternatives and the centralization and standardization of certain administrative functions. Liabilities for severance are generally to be paid within twelve months, while future lease payments related to facilities vacated as a result of restructuring are to be paid over the underlying remaining lease terms.\nDuring fiscal 2019, the Company announced a restructuring plan focused on (i) the integration of the Enerpac and Hydratight businesses (IT&S segment), (ii) the strategic exit of certain commodity-type services in our North America Services operations (IT&S segment) and (iii) driving efficiencies within the overall corporate structure. In the third quarter of fiscal 2020, the Company announced the expansion and revision of this plan, which further simplified and flattened the corporate structure through elimination of redundancies between the segment and corporate functions, while enhancing our commercial and marketing processes to become even closer to our customers. Upon assessment of the Company's operating structure by the Company's new President & Chief Executive Officer (hired effective October 2021), the Company recorded a benefit of less than $0.1 million and $5.2 million of charges for the year ended August 31, 2023, and 2022, respectively, in order to further simplify and streamline the organizational structure. Restructuring charges associated with the fiscal 2019 plan were $2.1 million for the year ended August 31, 2021. The total cumulative charges for the 2019 plan, which ended in the third quarter of fiscal 2022, were $18.0 million.\nOn June 27, 2022, the Company approved a new restructuring plan in connection with the initiatives identified as part of the ASCEND transformation program (see Note 3, ASCEND Transformation Program) to drive greater efficiency and productivity in global selling, general and administrative resources. The total costs of this plan were then estimated at $6 to $10.0 million, constituting predominately severance and other employee-related costs to be incurred as cash expenditures impacting both IT&S and Corporate. On September 23, 2022, the Company approved an updated restructuring plan. The costs of this updated plan (which includes the amounts for the plan approved in June) are estimated at $10 to $15 million. These costs are expected to be incurred over the expected duration of the transformation program, ending in the fourth quarter of fiscal 2024. For the year ended August 31, 2023 and 2022, the Company recorded $7.7 million and $3.1 million of restructuring charges associated with the ASCEND transformation program.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following summarizes restructuring reserve activity for the IT&S segment and Corporate (which for the year ended August 31, 2023 excludes $0.6 million of charges associated with ASCEND transformation plan for Corporate, and for the year ended August 31, 2022 excludes $0.8 million and $0.5 million of charges associated with the 2019 Plan for IT&S and Corporate, respectively, associated with the accelerated vesting of equity awards which has no impact on the restructuring reserve) (in thousands):\nYear Ended August 31, 2023\n2019 Plan ASCEND Plan\nIT&S Corporate IT&S Corporate\nBalance as of August 31, 2022 $ 212 $ 6 $ 2,008 $ 797\nRestructuring charges (32) (6) 6,035 1,054\nCash payments (99) - (5,453) (1,779)\nOther non-cash uses of reserve (84) - (498) -\nImpact of changes in foreign currency rates 3 - 146 2\nBalance as of August 31, 2023 $ - $ - $ 2,238 $ 74\nYear Ended August 31, 2022\n2019 Plan ASCEND Plan\nIT&S Corporate IT&S Corporate\nBalance as of August 31, 2021 $ 1,737 $ 26 $ - $ -\nRestructuring charges 2,812 1,052 2,228 824\nCash payments (4,212) (1,072) (220) (27)\nImpact of changes in foreign currency rates (125) - - -\nBalance as of August 31, 2022 $ 212 $ 6 $ 2,008 $ 797\nTotal restructuring charges (inclusive of the Other operating segment) for the year ended August 31, 2023 were $7.7 million which included approximately $0.6 million of charges being reported in the Consolidated Statements of Operations in \"Cost of products sold,\" with the balance of the charges reported on \"Restructuring charges.\" Total restructuring charges (inclusive of the Other operating segment) being reported in \"Restructuring charges\" were $8.1 million and $2.4 million for the year ended August 31, 2022 and 2021, respectively.\nNote 5. Discontinued Operations and Other Divestiture Activities\nDiscontinued Operations\nOn October 31, 2019, as part of our overall strategy to become a pure-play industrial tools and services company, the Company completed the sale of the businesses comprising its former EC&S segment. This divestiture was considered part of our strategic shift to become a pure-play industrial tools and services company, and therefore, the results of operations are recorded as a component of \"Loss from discontinued operations, net of income taxes\" in the Condensed Consolidated Statements of Earnings for all periods presented. All discontinued operations activity included within the Condensed Consolidated Statements of Earnings and the Condensed Consolidated Statements of Cash Flows for the periods presented relate to impacts from certain retained liabilities.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following represents the detail of \"Loss from discontinued operations, net of income taxes\" within the Consolidated Statements of Earnings (in thousands):\nYear Ended August 31,\n2023 2022 2021\nSelling, general and administrative expenses 10,069 4,842 1,456\nImpairment & divestiture benefit (1,530) - -\nOperating loss (8,539) (4,842) (1,456)\nOther income, net 372 - -\nLoss before income tax benefit (8,911) (4,842) (1,456)\nIncome tax (benefit) loss (1,823) (937) 679\nLoss from discontinued operations, net of income taxes $ (7,088) $ (3,905) $ (2,135)\nOther Divestiture Activities\nOn July 11, 2023, the Company completed the sale of the Cortland Industrial business, which had been included in the Other operating segment, for net cash proceeds of $20.1 million. In connection with the completion of the sale, the Company recorded a net gain of $6.2 million. The historical results of the Cortland Industrial business (which had net sales of $22.7 million, $26.2 million, and $23.7 million for the year ended August 31, 2023, 2022 and 2021, respectively) are not material to the consolidated financial results.\nNote 6. Goodwill, Intangible Assets and Long-Lived Assets\nChanges in the gross carrying value of goodwill and intangible assets result from changes in foreign currency exchange rates, business acquisitions, divestitures and impairment charges. The changes in the carrying amount of goodwill for the years ended August 31, 2023 and 2022 by operating segment are as follows (in thousands):\nIT&S Other Total\nBalance as of August 31, 2021 $ 265,087 $ 12,506 $ 277,593\nImpairment charge - (1,297) (1,297)\nImpact of changes in foreign currency rates (18,347) - (18,347)\nBalance as of August 31, 2022 246,740 11,209 257,949\nImpact of changes in foreign currency rates 8,546 - 8,546\nBalance as of August 31, 2023 $ 255,285 $ 11,209 $ 266,494\nThe gross carrying value and accumulated amortization of the Companys intangible assets are as follows (in thousands):\nWeighted Average Amortization Period (Year) August 31, 2023 August 31, 2022\nGross Accumulated Amortization Net Book Value Gross Accumulated Amortization Net Book Value\nAmortizable intangible assets:\nCustomer relationships 14 $ 108,292 $ 95,395 $ 12,897 $ 135,101 $ 117,275 $ 17,826\nPatents 13 9,769 9,210 559 13,708 13,104 604\nTrademarks and tradenames 14 2,734 2,197 537 3,132 2,329 803\nIndefinite lived intangible assets:\nTradenames N/A 23,345 - 23,345 22,274 - 22,274\n$ 144,140 $ 106,802 $ 37,338 $ 174,215 $ 132,708 $ 41,507\nThe Company estimates amortization expense for future years to be: $3.3 million in fiscal 2024, $2.9 million in fiscal 2025, $1.9 million in fiscal 2026, $1.8 million in fiscal 2027, $1.6 million in fiscal 2028 and $2.5 million in aggregate thereafter. The future amortization expense amounts represent estimates and may be impacted by future acquisitions, divestitures or changes in foreign currency exchange rates, among other causes.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nFiscal 2023 Impairment Charges\nIn conjunction with our annual goodwill impairment assessment, the Company did not record any charges in fiscal 2023.\nFiscal 2022 Impairment Charges\nThe carryover effects from the COVID-19 pandemic coupled with current year labor, supply chain and inflation challenges had a more than anticipated effect on the Cortland Industrial business. Therefore, in conjunction with our annual goodwill impairment assessment, the Company recognized a $1.3 million goodwill impairment charge associated with the Cortland Industrial reporting unit (Other operating segment) within \"Impairment & divestiture (benefit) charges\" in the Consolidated Statements of Earnings.\nIn addition, during fiscal 2022, the Company recorded an impairment charge of $1.1 million on indefinite lived intangible assets; $0.8 million of which was related to a customer relationship intangible asset whereby the Company ceased operations in the country associated with said customers and $0.3 million of which was related to tradename intangible asset on a discontinued secondary brand.\nNote 7. Debt\nThe following is a summary of the Companys indebtedness (in thousands):\nAugust 31,\n2023 2022\nPrevious Senior Credit Facility\nShort-term debt $ - $ 4,000\nRevolver - 200,000\nNew Senior Credit Facility\nRevolver 16,000 -\nTerm Loan 198,750 -\nTotal Senior Indebtedness 214,750 204,000\nLess: Current maturities of long-term debt (3,750) -\nShort-term debt - (4,000)\nDebt issuance costs (663) -\nTotal long-term debt, less current maturities $ 210,337 $ 200,000\nSenior Credit Facility\nOn September 9, 2022, the Company refinanced its previous senior credit facility with a new $600 million senior credit facility, comprised of a $400 million revolving line of credit and a $200 million term loan, which will mature in September 2027. The Company has the option to request up to $300 million of additional revolving commitments and/or term loans under the new facility, subject to customary conditions, including the commitment of the participating lenders. The new facility replaces LIBOR with adjusted term SOFR as the interest rate benchmark and provides for interest rate margins above adjusted term SOFR ranging from 1.125% to 1.875% per annum depending on the Companys net leverage ratio. In addition, a non-use fee is payable quarterly on the average unused amount of the revolving line of credit under the previous senior credit facility ranging from 0.15% to 0.3% per annum, based on the Company's net leverage. Borrowings under the new facility initially bore interest at adjusted term SOFR plus 1.125% per annum.\nThe new facility contains financial covenants requiring the Company to not permit (i) the net leverage ratio, determined as of the end of each of its fiscal quarters, to exceed 3.75 to 1.00 (or, at the Companys election and subject to certain conditions, 4.25 to 1.00 for the covenants period during which certain material acquisitions occur and the next succeeding four testing periods) or (ii) the interest coverage ratio, determined as of the end of each of its fiscal quarters, to be less than 3.00 to 1.00. Borrowings under the new facility are secured by substantially all personal property assets of the Company and its domestic subsidiary guarantors (other than certain specified excluded assets) and certain of the equity interests of certain subsidiaries of the Company. The Company was in compliance with all financial covenants under the new facility at August 31, 2023.\nThe previous senior credit facility provided the option for future expansion, subject to certain conditions, through a $300 million accordion. Borrowings under the previous senior credit facility bore interest at a variable rate based on LIBOR or a base rate, ranging from 1.125% to 2.00% in the case of loans bearing interest at LIBOR and from 0.125% to 1.00% in the case of loans bearing interest at the base rate. In addition, a non-use fee was payable quarterly on the average unused amount of the revolving line of credit under the previous senior credit facility ranging from 0.15% to 0.3% per annum, based on the Company's net leverage.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nAt August 31, 2023, under the new senior credit facility, there were $200 million in borrowings outstanding under the term loans, $16.0 million in borrowings outstanding under the revolving line of credit and $381.5 million available for borrowing under the revolving line of credit facility after reduction for $2.5 million of outstanding letters of credit issued under the facility.\nPrior to this refinancing, the Company's previous senior credit facility matured in March 2024, and provided a $400 million revolving line of credit, a $200 million term loan and the option for expansion, subject to certain conditions, through a $300 million accordion. Borrowings bore interest at a variable rate based on LIBOR or a base rate, ranging from 1.125% to 2.00% in the case of loans bearing interest at LIBOR and from 0.125% to 1.00% in the case of loans bearing interest at the base rate. In addition, a non-use fee was payable quarterly on the average unused amount of the revolving line of credit ranging from 0.15% to 0.3% per annum, based on the Company's net leverage. The previous senior credit facility contained two financial covenants, which were a maximum leverage ratio of 3.75:1 and a minimum interest coverage ratio of 3.5:1. Certain transactions resulted in adjustments to the underlying ratios, including an increase to the leverage ratio from 3.75 to 4.25 during the four fiscal quarters after a significant acquisition.\nCash Paid for Interest\nThe Company made cash interest payments of $10.6 million, $3.1 million and $3.7 million in fiscal 2023, 2022 and 2021, respectively.\nNote 8. Fair Value Measurements\nThe Company assesses the inputs used to measure the fair value of financial assets and liabilities using a three-tier hierarchy. Level 1 inputs include unadjusted quoted prices for identical instruments and are the most observable. Level 2 inputs include quoted prices for similar assets and observable inputs such as interest rates, foreign currency exchange rates, commodity rates and yield curves. Level 3 inputs are not observable in the market and include managements own judgments about the assumptions market participants would use in pricing an asset or liability.\nThe fair value of the Companys cash and cash equivalents, accounts receivable, accounts payable and variable rate long-term debt approximated book value at both August 31, 2023 and 2022 due to their short-term nature and the fact that the interest rates approximated market rates. Foreign currency exchange contracts and interest rate swaps are recorded at fair value. The fair value of the Company's foreign currency exchange contracts was a net liability of less than $0.1 million at both August 31, 2023 and 2022. The fair value of the Company's interest rate swap (see Note 9, Derivatives, for further information on the Company's interest rate swap) was an asset of $0.7 million at August 31, 2023. The fair value of the Company's net investment hedge (see Note 9, Derivatives for further information on the Company's net investment hedge) was a liability of $1.2 million at August 31, 2023. The fair value of all derivative contracts were based on quoted inactive market prices and therefore classified as Level 2 within the valuation hierarchy.\nAs discussed in Note 6, Goodwill, Intangible Assets and Long-Lived Assets, the Company recorded impairments to intangibles and goodwill in the years ended August 31, 2023 and 2022. The fair value of the goodwill, tradenames, customer relationships and patents acquired and/or impaired were determined utilizing generally accepted valuation techniques, specifically, forecasting future revenues and/or using a market royalty rate. The fair value of property, plant and equipment were also determined utilizing generally accepted valuation techniques, specifically utilizing an approach of assessing the replacement/reproduction cost of a new asset and adjusting for the asset's current physical deterioration. These valuations represent Level 3 assets measured at fair value on a nonrecurring basis.\nNote 9. Derivatives\nAll derivatives are recognized in the balance sheet at their estimated fair value. The Company does not enter into derivatives for speculative purposes. Changes in the fair value of derivatives (not designated as hedges) are recorded in earnings along with the gain or loss on the hedged asset or liability.\nThe Company is exposed to market risk for changes in foreign currency exchange rates due to the global nature of its operations. In order to manage this risk, the Company utilizes foreign currency exchange contracts to reduce the exchange rate risk associated with recognized non-functional currency balances. The effects of changes in exchange rates are reflected concurrently in earnings for both the fair value of the foreign currency exchange contracts and the related non-functional currency asset or liability. These derivative gains and losses offset foreign currency gains and losses from the related revaluation of non-functional currency assets and liabilities (amounts included in \"Other expense, net\" in the Consolidated Statements of Earnings). The U.S. dollar equivalent notional value of these short duration foreign currency exchange contracts was $13.8 million and $16.7 million at August 31, 2023 and 2022, respectively. The fair value of outstanding foreign currency exchange contracts was a net liability of less than $0.1 million at August 31, 2023 and 2022. Net foreign currency loss (gain)\n(included in \"Other expense, net\" in the Consolidated Statements of Earnings) related to these derivative instruments are as follows (in thousands):\nYear Ended August 31,\n2023 2022 2021\nForeign Currency loss (gain) $ 945 $ (319) $ (63)\nDuring December 2022, the Company entered into an interest rate swap for the notional amount of $60.0 million at a fixed interest rate of 4.022% to hedge the floating interest rate of the Company's term loan with a maturity date of November 30, 2025. The interest rate swap was designated and qualified as a cash flow hedge. The Company uses the interest rate swap for the management of interest rate risk exposure, as an interest rate swap effectively converts a portion of the Company's debt from a floating to a fixed rate.\nThe Company records the fair value of the interest rate swap as an asset or liability on its balance sheet. The change in the fair value of the interest rate swap, a net gain of $0.5 million for the year ended August 31, 2023, is recorded in other comprehensive income (loss).\nThe Company also uses interest-rate derivatives to hedge portions of our net investments in non-U.S. subsidiaries (net investment hedge) against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. For derivatives that are designated and qualify as a net investment hedge in a foreign operation the net gains or losses attributable to the hedge changes are recorded in other comprehensive income (loss) where they offset gains and losses recorded on our net investments where the entity has non-U.S. dollar functional currency. As of August 31, 2023, the notional amount of cross-currency swaps designated as net investment hedges was $30.5 million. The change in the fair value of the net investment hedge, a net loss of $0.9 million for the year ended August 31, 2023, is recorded in other comprehensive income (loss).\nThe Company was the fixed-rate payor on an interest rate swap contract that fixed the LIBOR-based index used to determine the interest rates charged on a total of $100.0 million of the Company's LIBOR-based variable rate borrowings on the revolving line of credit under its prior senior credit facility. The contract carried a fixed rate of 0.259% and expired in August 2021. The swap agreement qualified as a hedging instrument and was designated as a cash flow hedge of forecasted LIBOR-based interest payments. The change in the fair value of the interest rate swap, a gain of $0.1 million in the year ended August 31, 2021 was recorded in other comprehensive income (loss).\nNote 10. Leases\nAs of August 31, 2023, the Company had operating leases for real estate, vehicles, manufacturing equipment, IT equipment and office equipment. The Company did not have significant finance leases during the year ended August 31, 2023. Our leases typically range in term from 3 to 15 years and may contain renewal options for periods up to 5 years at our discretion. Our leases generally contain payments that are primarily fixed; however, certain lease arrangements contain variable payments, which are expensed as incurred and not included in the measurement of ROU assets and lease liabilities. These amounts include payments affected by changes in the Consumer Price Index and executory costs (such as real estate taxes, utilities and common-area maintenance), which are based on usage or performance. In addition, our leases generally do not include material residual value guarantees or material restrictive covenants.\nDuring the year ended August 31, 2021, the Company sold and subsequently leased back a portion of its manufacturing facility in China as part of a global footprint rationalization initiative. In connection with the transaction, the Company recognized a gain of $10.0 million. The gain is recorded in \"Selling, general and administrative expenses\" within the Consolidated Statements of Earnings and in \"Other non-cash charges (benefits)\" within the Consolidated Statements of Cash Flows. The Company also incurred $4.6 million of closing related costs and value-added and land taxes associated with this transaction also included in \"Selling, general and administrative expenses\" within the Consolidated Statements of Earnings.\nThe components of lease expense for the year ended August 31, 2023 and 2022 were as follows (in thousands):\nYear Ended August 31,\n2023 2022 2021\nLease Cost:\nOperating lease cost $ 13,155 $ 14,316 $ 15,170\nShort-term lease cost 2,318 1,714 1,611\nVariable lease cost 4,411 3,609 3,086\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nSupplemental cash flow and other information related to leases for the year ended August 31, 2023 and 2022 were as follows (in thousands):\nYear Ended August 31,\n2023 2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases $ 13,153 $ 14,166 $ 15,240\nRight-of-use assets obtained in exchange for new lease liabilities:\nOperating leases 1,654 4,584 9,197\nSupplemental balance sheet information related to leases at August 31, 2023 and 2022 were as follows (in thousands):\nAugust 31,\n2023 2022\nOperating leases:\nOther long-term assets $ 37,714 $ 43,273\nOther current liabilities 9,786 10,709\nOther long-term liabilities 29,245 33,477\nTotal operating lease liabilities $ 39,031 $ 44,186\nWeighted Average Remaining Lease Term:\nOperating leases 6.5 years 6.4 years\nWeighted Average Discount Rate:\nOperating leases 5.0 % 4.4 %\nA summary of the future minimum lease payments due under operating leases with terms of more than one year at August 31, 2023 is as follows (in thousands):\nOperating Leases\n2024 $ 11,368\n2025 9,533\n2026 6,650\n2027 3,687\n2028 3,131\nThereafter 11,540\nTotal minimum lease payments 45,909\nLess imputed interest (6,878)\nPresent value of net minimum lease payments $ 39,031\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nNote 11. Employee Benefit Plans\nU.S. Defined Benefit Pension Plans\nAll of the U.S. defined benefit pension plans are frozen, and as a result, plan participants no longer earn additional benefits. The following table provides detail of changes in the projected benefit obligations, the fair value of plan assets and the funded status of the Companys U.S. defined benefit pension plans as of the respective August 31 measurement date (in thousands):\n2023 2022\nReconciliation of benefit obligations:\nBenefit obligation at beginning of year $ 37,135 $ 47,147\nInterest cost 1,694 1,165\nActuarial (gain) loss (2,337) (8,197)\nBenefits paid (3,288) (2,980)\nBenefit obligation at end of year $ 33,204 $ 37,135\nReconciliation of plan assets:\nFair value of plan assets at beginning of year $ 31,166 $ 39,696\nActual return on plan assets 545 (5,658)\nCompany contributions 108 108\nBenefits paid from plan assets (3,289) (2,980)\nFair value of plan assets at end of year 28,530 31,166\nFunded status of the plans (underfunded) $ (4,674) $ (5,969)\nThe following table provides detail on the Companys domestic net periodic benefit expense (in thousands):\nYear ended August 31,\n2023 2022 2021\nInterest cost $ 1,694 $ 1,165 $ 1,156\nExpected return on assets (1,984) (2,060) (1,610)\nAmortization of actuarial loss 878 1,219 1,322\nNet periodic benefit expense $ 588 $ 324 $ 868\nAs of August 31, 2023 and 2022, $16.9 million and $18.3 million, respectively, of pension plan actuarial losses, which have not yet been recognized in net periodic benefit cost, were included in accumulated other comprehensive loss, net of income taxes. During fiscal 2024, $0.9 million of these actuarial losses are expected to be recognized in net periodic benefit cost.\nWeighted-average assumptions used to determine U.S. pension plan obligations as of August 31 and weighted-average assumptions used to determine net periodic benefit cost for the years ended August 31 are as follows:\n2023 2022 2021\nAssumptions for benefit obligations:\nDiscount rate 5.40 % 4.75 % 2.55 %\nAssumptions for net periodic benefit cost:\nDiscount rate 4.75 % 2.55 % 2.40 %\nExpected return on plan assets 5.70 % 5.45 % 4.20 %\nThe Company's objective for its pension plan is to achieve an asset and liability duration match so that interim fluctuations in funded status should be limited by increasing the correlation between assets and liabilities. As such, the plan assets are invested to maintain funded ratios over the long term, while managing the risk that funded ratios fall meaningfully below 100%. In fiscal 2023, the plan assets were invested in a mix of 60% duration-matched fixed income securities and 40% equity securities. During fiscal 2022, the plan portfolio was invested in 50% fixed income securities and 50% equity securities. Cash balances are maintained at levels adequate to meet near-term plan expenses and benefit payments. Investment risk is measured and monitored on an ongoing basis. At August 31, 2023, the Companys overall expected long-term rate of return for assets in U.S. pension plans was 5.70%. The expected long-term rate of return is based on the portfolio as a whole and not on the sum of the returns on individual asset categories. The target return is based on historical returns adjusted to reflect the current view of the long-term investment market and our 50% investment mix between fixed income and equity securities.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe U.S. pension plan investment allocations by asset category were as follows (dollars in thousands):\nYear Ended August 31,\n2023 % 2022 %\nCash and cash equivalents $ 51 0.2 % $ - - %\nIncome receivable 40 0.1 31 0.1\nFixed income securities:\nU.S. Treasury Securities 4,659 16.3 4,852 15.6\nCorporate Bonds - - - -\nMutual funds 11,269 39.5 11,395 36.6\n15,928 55.8 16,247 52.2\nEquity securities:\nMutual funds 12,511 43.9 14,888 47.7\nTotal plan assets $ 28,530 100.0 % $ 31,166 100.0 %\nThe fair value of mutual funds are based on unadjusted quoted market prices and therefore are classified as Level 1 within the fair value hierarchy under US GAAP. U.S. Treasury Securities and Corporate Bonds are valued using Level 2 inputs, as defined in Note 8, Fair Value Measurements.\nProjected benefit payments from plan assets to participants in the Companys U.S. pension plans are $2.9 million for fiscal 2024, $3.0 million per year for each of the next three years, $2.9 million for fiscal 2028 and $13.4 million in aggregate for the following five years. The Company plans to make a contribution of $0.4 million to the U.S. pension plans in September of fiscal 2024. The Company did not make a contribution to the plan in fiscal 2023 or fiscal 2022.\nForeign Defined Benefit Pension Plans\nThe Company has seven significant foreign defined benefit pension plans which cover certain existing and former employees of businesses outside the U.S. Most of the participants in the foreign defined benefit pension plans are inactive and no longer earning additional benefits. The following table provides detail of changes in the projected benefit obligations, the fair value of plan assets and the funded status of the Companys significant foreign defined benefit pension plans as of the respective August 31 measurement date (in thousands):\n2023 2022\nReconciliation of benefit obligations:\nBenefit obligation at beginning of year $ 8,017 $ 14,421\nEmployer service costs 60 90\nInterest cost 306 159\nActuarial gain (494) (3,859)\nBenefits paid (256) (200)\nSettlements (213) (480)\nCurrency impact 665 (2,114)\nBenefit obligation at end of year $ 8,085 $ 8,017\nReconciliation of plan assets:\nFair value of plan assets at beginning of year $ 6,208 $ 9,396\nActual return on plan assets (359) (1,159)\nCompany contributions 286 44\nBenefits paid from plan assets (469) (680)\nCurrency impact 529 (1,393)\nFair value of plan assets at end of year 6,195 6,208\nFunded status of the plans (underfunded) $ (1,889) $ (1,808)\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following table provides detail on the Companys foreign net periodic benefit expense (in thousands):\nYear ended August 31,\n2023 2022 2021\nEmployer service costs $ 60 $ 90 $ 116\nInterest cost 306 159 198\nExpected return on assets (245) (316) (347)\nAmortization of net prior service credit 3 3 4\nAmortization of net loss 10 112 139\nSettlement 37 145 -\nNet periodic benefit expense $ 171 $ 193 $ 110\nThe weighted average discount rate utilized for determining the benefit obligation at August 31, 2023 and 2022 was 4.3% and 3.6%, respectively. The plan assets of these foreign pension plans consist primarily of participating units in fixed income and equity securities and insurance contracts. The Companys overall expected long-term rate of return on these investments is 3.7%. During fiscal 2024, the Company does not anticipate contributing to these pension plans.\nProjected benefit payments to participants in the these foreign plans are $0.3 million in each fiscal 2024, 2025, 2026 and 2027, $0.4 million in fiscal 2028 and $2.2 million in aggregate for the following five years.\nOther Postretirement Health Benefit Plans\nThe Company provides other postretirement health benefits (OPEB) to certain existing and former employees of domestic businesses it acquired, who were entitled to such benefits prior to acquisition. These unfunded plans had a benefit obligation of $1.7 million and $1.9 million at August 31, 2023 and 2022, respectively. These obligations are determined utilizing assumptions consistent with those used for our U.S. pension plans and a health care cost trend rate of 7.0%, trending downward to 5.0% by the year 2026, and remaining level thereafter. Net periodic benefit costs for other postretirement benefits was income of $0.1 million in both years ended August 31, 2023 and 2022 and $0.2 million for the year ended August 31, 2021. Benefit payments from the plan are funded through participant contributions and Company contributions. Benefit payments are projected to be $0.2 million in fiscal 2024.\nDefined Contribution Benefit Plans\nThe Company maintains a 401(k) plan for substantially all full time U.S. employees (the 401(k) Plan). Under plan provisions, the Company can fund either cash or issue new shares of Class A common stock for its contributions. Amounts are allocated to accounts set aside for each employees retirement. Employees generally may contribute up to 50% of their compensation to individual accounts within the 401(k) Plan.\nWhile contributions vary, the Company's match contribution is $0.50 for every $1 contributed by employees, up to 8% of the employees' eligible pay. These match contributions are made on every payroll run, meaning the contribution is immediately 100% vested. In addition, the Company may make an annual, discretionary contribution of up to 3% of employees' eligible pay to employees employed as of the end of the plan year. The discretionary contribution has a three-year vesting period. The Company elected not to provide a discretionary contribution for the year ended August 31, 2023. The Company also maintains a Restoration Plan that allows eligible highly compensated employees (as defined by the Internal Revenue Code) to receive a core contribution as if no IRS limits were in place. Company contributions to the Restoration Plan are made in the form of its Class A common stock and contributed into each eligible participants deferred compensation plan. The Company has not contributed in fiscal 2023, 2022 or fiscal 2021. Expense recognized related to the 401(k) plan totaled $2.1 million, $2.2 million and $1.1 million for the years ended August 31, 2023, 2022 and 2021, respectively.\nIn addition to the 401(k) plan, the Company sponsors a non-qualified supplemental executive retirement plan (the SERP Plan). The SERP Plan is an unfunded defined contribution plan that covers certain current and former executive employees and has an annual contribution formula based on age and years of service (with Company contributions ranging from 3% to 6% of eligible wages). This unfunded plan had a $1.0 million and $1.1 million obligation at August 31, 2023 and 2022, respectively. Expense recognized for the SERP Plan was $0.2 million in each of fiscal 2023 and 2022 and $0.1 million in fiscal 2021.\nDeferred Compensation Plan\nThe Company maintains a deferred compensation plan to allow eligible U.S. employees to defer receipt of current cash compensation and restricted stock units vesting in order to provide future savings benefits. Eligibility is limited to employees who earn compensation that exceeds certain pre-defined levels. Participants have the option to invest their deferrals in a fixed income investment, a defined set of mutual funds, and/or, with respect to deferrals of restricted stock units, in Company\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\ncommon stock. The fixed income and mutual fund portion of the plan is unfunded, and therefore all compensation deferred under the plan is held by the Company and commingled with its general assets. Liabilities of $11.0 million and $12.9 million are included in the Consolidated Balance Sheets at August 31, 2023 and 2022, respectively, to reflect the unfunded portion of the deferred compensation liability. The Company recorded expense in \"Financing costs, net\" of $0.9 million, $0.7 million and $1.2 million for the years ended August 31, 2023, 2022 and 2021, respectively, for the non-funded return on participant deferrals. Company common stock contributions to fund the plan are held in a rabbi trust, accounted for in a manner similar to treasury stock and are recorded at cost in Stock held in trust within shareholders equity on the Consolidated Balance Sheets with the corresponding deferred compensation liability also recorded within shareholders equity on the Consolidated Balance Sheets. Because no investment diversification is permitted within the trust, changes in fair value of the Company's common stock are not recognized.\nNote 12. Income Taxes\nEarnings before income taxes from continuing operations, are summarized as follows (in thousands):\nYear Ended August 31,\n2023 2022 2021\nDomestic $ 26,442 $ 10,176 $ 1,292\nForeign 42,456 13,816 42,683\n$ 68,898 $ 23,992 $ 43,975\nBoth domestic and foreign pre-tax earnings from continuing operations are impacted by changes in operating earnings, acquisition and divestiture activities, restructuring charges and the related benefits, growth investments, debt levels and the impact of changes in foreign currency exchange rates. In fiscal 2023, domestic earnings included non-cash impairment and other divestiture benefits of $6.2 million. In fiscal 2022, domestic and foreign earnings included non-cash impairment and other divestiture charges of $1.3 million and $1.1 million, respectively. In fiscal 2021, domestic and foreign earnings included $4.7 million and $1.5 million of non-cash impairment and other divestiture benefits, respectively. Substantially all of the non-cash impairment and other divestiture charges (benefits) did not result in a tax expense (benefit).\nIncome tax expense from continuing operations is summarized as follows (in thousands):\nYear ended August 31,\n2023 2022 2021\nCurrently payable:\nFederal $ 5,181 $ 1,765 $ (18,243)\nForeign 9,240 7,824 12,441\nState 319 164 539\n14,740 9,753 (5,263)\nDeferred:\nFederal (2,935) 1,580 9,677\nForeign 3,806 (7,538) 185\nState (362) 606 (836)\n509 (5,352) 9,026\nIncome tax expense $ 15,249 $ 4,401 $ 3,763\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nIncome tax expense from continuing operations recognized in the accompanying consolidated statements of earnings differs from the amounts computed by applying the federal income tax rate to earnings from continuing operations before income tax expense. A reconciliation of income taxes at the federal statutory rate to the effective tax rate is summarized in the following table:\nYear ended August 31,\n2023 2022 2021\nFederal statutory rate 21.0 % 21.0 % 21.0 %\nState income taxes, net of Federal effect 0.7 2.3 (0.2)\nTax on foreign earnings (1)\n6.0 1.3 2.8\nForeign derived intangible income deduction (3.1) (4.5) (3.2)\nCompensation adjustment 1.5 6.6 3.1\nImpairment and other divestiture charges - 1.1 1.6\nValuation allowance additions and releases (0.8) 2.1 7.1\nChanges in liability for unrecognized tax benefits (0.1) 3.4 (18.5)\nU.S. legislative changes, net impact - - (9.8)\nTaxable liquidation of subsidiaries (2)\n0.1 (11.4) -\nForeign non-deductible expenses 1.7 8.5 1.2\nChanges in tax rates (2.0) (3.6) (3.4)\nAudits and adjustments (3)\n(2.9) (6.7) 8.0\nResearch and development tax credit (0.7) (2.5) (1.8)\nOther items 0.7 0.7 0.7\nEffective income tax rate 22.1 % 18.3 % 8.6 %\n(1) The Company generated $1.6 million, $0.2 million and $1.1 million of U.S. tax on non-U.S. earnings, net of foreign tax credits for fiscal 2023, 2022 and 2021, respectively.\n(2) During fiscal 2022, the Company generated a net benefit of $2.7 million as a result of taxable liquidations of subsidiaries.\n(3) During fiscal 2023 and fiscal 2022, the Company generated $2.0 million and $1.6 million of tax benefit related to audits and adjustments as compared to a tax expense of $3.5 million in fiscal 2021.\nTemporary differences and carryforwards that gave rise to deferred tax assets and liabilities include the following items (in thousands):\nAugust 31,\n2023 2022\nDeferred income tax assets:\nOperating loss and tax credit carryforwards $ 70,933 $ 78,717\nCompensation related liabilities 7,372 6,002\nPostretirement benefits 5,224 5,995\nInventory 1,715 2,780\nLease liabilities 8,594 9,637\nResearch and development capitalization 4,544 -\nBook reserves and other items 6,548 9,873\nTotal deferred income tax assets 104,930 113,004\nValuation allowance (61,432) (61,630)\nNet deferred income tax assets 43,498 51,374\nDeferred income tax liabilities:\nDepreciation and amortization (23,844) (30,149)\nLease assets (8,594) (9,637)\nOther items (1,020) (1,024)\nDeferred income tax liabilities (33,458) (40,810)\nNet deferred income tax asset (1)\n$ 10,040 $ 10,564\n(1) The net deferred income tax asset is reflected on the balance sheet in two categories: an asset of $15.7 million and $17.9 million for fiscal 2023 and 2022, respectively, is included in \"Other long-term assets\" and a liability of $5.7 million and $7.3 million for fiscal 2023 and 2022, respectively, is included in \"Deferred income taxes\".\nThe Company has $68.6 million and $2.5 million of gross state net operating loss and credit carryforwards, respectively, which are available to reduce future state tax liabilities. These state net operating loss carryforwards expire at various times through 2043. The Company also has $79.4 million and $7.7 million of foreign loss and credit carryforwards, respectively, and $1.8 million of U.S. credit carryforwards which are available to reduce certain future foreign and U.S. tax liabilities. The\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nmajority of the foreign loss carryforwards are not subject to any expiration dates, while the other balances expire at various times through 2030. The U.S. credit carryforwards expire at various times through 2033. The valuation allowance represents a reserve for deferred tax assets, including loss carryforwards and foreign tax credits, for which utilization is uncertain.\nThe Companys policy is to remit earnings from foreign subsidiaries only to the extent the remittance does not result in an incremental U.S. tax liability. The Company does not currently provide for the additional U.S. and foreign income taxes that would become payable upon remission of undistributed earnings of foreign subsidiaries. If all undistributed earnings were remitted, an additional income tax provision of $2.6 million would have been necessary as of August 31, 2023.\nChanges in the Companys gross liability for unrecognized tax benefits, excluding interest and penalties, are as follows (in thousands):\n2023 2022 2021\nBeginning balance $ 15,380 $ 15,658 $ 23,205\nIncreases based on tax positions related to the current year 279 433 381\nIncrease for tax positions taken in a prior period - 1,084 7\nDecrease for tax positions taken in a prior period (56) (57) -\nDecrease due to lapse of statute of limitations (951) (1,271) (7,931)\nDecrease due to settlements - (31) -\nChanges in foreign currency exchange rates 102 (436) (4)\nEnding balance $ 14,754 $ 15,380 $ 15,658\nSubstantially all of these unrecognized tax benefits, if recognized, would impact the effective income tax rate. As of August 31, 2023, 2022 and 2021, the Company recognized $5.2 million, $4.5 million and $3.9 million, respectively, for interest and penalties related to unrecognized tax benefits. The Company recognizes interest and penalties related to underpayment of income taxes as a component of income tax expense. With few exceptions, the Company is no longer subject to U.S. federal, state and foreign income tax examinations by tax authorities in major tax jurisdictions for years prior to fiscal 2011. The Company believes it is reasonably possible that the total amount of unrecognized tax benefits could decrease by up to $3.1 million throughout fiscal 2024.\nCash paid for income taxes, net of refunds, totaled $2.7 million, $5.7 million and $7.8 million during the years ended August 31, 2023, 2022 and 2021, respectively.\nNote 13. Capital Stock and Share Repurchases\nThe authorized common stock of the Company as of August 31, 2023 consisted of 168,000,000 shares of Class A common stock, $0.20 par value, of which 83,760,798 and 54,988,083 shares were issued and outstanding, respectively; 1,500,000 shares of Class B common stock, $0.20 par value, none of which are outstanding; and 160,000 shares of cumulative preferred stock, $1.00 par value (preferred stock), none of which have been issued. Holders of both classes of the Companys common stock are entitled to dividends, as the Companys Board of Directors may declare out of funds legally available, subject to any contractual restrictions on the payment of dividends or other distributions on the common stock. If the Company were to issue any of its preferred stock, no dividends could be paid or set apart on shares of common stock, unless paid in common stock, until dividends on all of the issued and outstanding shares of preferred stock had been paid or set apart for payment and provision had been made for any mandatory sinking fund payments.\nThe Company's Board of Directors approved four separate authorizations (September 2011, March 2014, October 2014 and March 2015) to repurchase up to 7,000,000 shares each of the Companys outstanding common stock. The Company suspended the initial share repurchase program in response to the COVID-19 pandemic in the third quarter of fiscal 2020. In March 2022, the Company's Board of Directors rescinded its prior share repurchase authorization and approved a new share repurchase program authorizing the repurchase of a total of 10,000,000 shares of the Company's outstanding common stock. The Company repurchased 2,213,750 shares of its common stock for $57.7 million during the year ended August 31, 2023. As of August 31, 2023, the maximum number of shares that may yet be purchased under this new program is 4,026,515. Since the inception of the initial share repurchase program in fiscal 2012, the Company has repurchased 28,772,715 shares of common stock for $800.5 million.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nEarnings Per Share\nThe reconciliation between basic and diluted earnings per share is as follows (in thousands, except per share amounts):\nYear Ended August 31,\n2023 2022 2021\nNumerator:\nNet earnings from continuing operations $ 53,649 $ 19,591 $ 40,212\nNet loss from discontinued operations (7,088) (3,905) (2,135)\nNet earnings $ 46,561 $ 15,686 $ 38,077\nDenominator:\nWeighted average common shares outstanding - basic 56,680 59,538 60,024\nNet effect of dilutive securities - stock based compensation plans 437 371 379\nWeighted average common shares outstanding - diluted 57,117 59,909 60,403\nEarnings per common share from continuing operations:\nBasic $ 0.95 $ 0.33 $ 0.67\nDiluted $ 0.94 $ 0.33 $ 0.67\nLoss per common share from discontinued operations:\nBasic $ (0.13) $ (0.07) $ (0.04)\nDiluted $ (0.12) $ (0.07) $ (0.04)\nEarnings per common share:\nBasic $ 0.82 $ 0.26 $ 0.63\nDiluted $ 0.82 $ 0.26 $ 0.63\nAnti-dilutive securities- stock based compensation plans (excluded from earnings per share calculation) 891 946 880\nNote 14. Stock Plans\nShare based awards may be granted to key employees and directors under the Enerpac Tool Group Corp. 2017 Omnibus Incentive Plan (as amended and restated November 9, 2020) (the Plan). A total of 7,825,000 shares of Class A common stock have been authorized for issuance under the Plan (including 3,500,000 shares that were authorized for issuance at the January 2021 annual meeting) plus shares, if any, that become issuable, pursuant to the terms of the Plan, upon the expiration, cancellation or forfeiture of awards under our previously registered stock plans outstanding at the time the Plan was first approved by the Company's shareholders. At August 31, 2023, 3,365,219 shares were available for future award grants. The Plan permits the Company to grant share-based awards, including stock options, restricted stock, restricted stock units and performance shares (the \"Performance Shares\") to employees and directors. Options generally have a maximum term of ten years, an exercise price equal to 100% of the fair market value of the Companys common stock at the date of grant and generally vest 50% after three years and 100% after five years. The Companys restricted stock grants prior to fiscal 2017 generally have similar vesting provisions as options, while grants thereafter generally vest in equal installments over a three-year period. The Performance Shares include a three-year performance period. For awards of Performance Shares granted in the year ended August 31, 2021, payout under the awards is based on the Companys total shareholder return (\"TSR\") relative to the S&P 600 SmallCap Industrial index. For the awards of Performance Shares granted in the year ended August 31, 2022, payout under the awards is based 50% on the relative TSR metric and 50% on the Company's three-year average return on invested capital. For awards of Performance Shares granted in the year ended August 31, 2023, payout under the awards is based 33.3% on the relative TSR metric, 33.3% on the Company's adjusted earnings per share and 33.3% on the Company's three-year average return on invested capital. The provisions of share-based awards may vary by individual grant with respect to vesting period, dividend and voting rights, performance conditions and forfeitures.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nA summary of restricted stock units and performance shares activity during fiscal 2023 is as follows:\nNumber of\nShares Weighted-Average Fair Value at Grant Date (Per Share)\nOutstanding on August 31, 2022 1,098,026 $20.73\nGranted 571,830 25.42\nForfeited (218,158) 22.18\nVested (412,162) 20.72\nOutstanding on August 31, 2023 1,039,536 $22.26\nA summary of stock option activity during fiscal 2023 is as follows:\nShares Weighted-Average\nExercise Price\n(Per Share) Weighted-Average\nRemaining Contractual\nTerm Aggregate\nIntrinsic Value\nOutstanding on September 1, 2022 947,807 $ 26.85\nGranted - -\nExercised (43,633) 22.30\nForfeited - -\nExpired (274,767) 26.83\nOutstanding on August 31, 2023 629,407 $ 27.18 2.2 $ 950,887\nExercisable on August 31, 2023 629,407 $ 27.18 2.2 $ 950,887\nIntrinsic value is the difference between the market value of the stock at August 31, 2023 and the exercise price which is aggregated for all options outstanding and exercisable. A summary of the total intrinsic value of options exercised and cash receipts from options exercised is summarized below (in thousands, except per share amounts):\nYear Ended August 31,\n2023 2022 2021\nIntrinsic value of options exercised $ 169 $ - $ 587\nCash receipts from exercise of options 973 - 2,208\nThe Company generally records compensation expense over the vesting period for restricted stock unit awards based on the market value of the Company's Class A common stock on the grant date and utilized an expected forfeiture rate of 12% for each of the years ended for the years ended August 31, 2023, 2022 and 2021. The fair value of Performance Shares with market vesting conditions, which includes the Performance Shares awarded in fiscal 2023, 2022 and 2021, is determined utilizing a Monte Carlo simulation model.\nAs of August 31, 2023, there was $9.4 million of total unrecognized compensation cost related to share-based awards, including stock options, restricted stock, restricted stock units and Performance Shares, which will be recognized over a weighted average period of 1.6 years. The total fair value of share-based awards that vested during the fiscal years ended August 31, 2023 and 2022 was $9.8 million and $11.8 million, respectively.\nNote 15. Business Segment, Geographic and Customer Information\nThe Company is a global manufacturer of a broad range of industrial products and solutions. The IT&S reportable segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools and in providing services and tool rental to the infrastructure, industrial maintenance, repair and operations, oil & gas, mining, alternative and renewable energy, civil construction and other markets. The Other operating segment is included for purposes of reconciliation of the respective balances below to the consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following tables summarize financial information by reportable segment and product line (in thousands):\nYear Ended August 31,\n2023 2022 2021\nNet Sales by Reportable Segment & Product Line\nIT&S Segment\nProduct $ 447,603 $ 410,245 $ 376,353\nService & Rental 107,575 117,097 116,772\n555,178 527,342 493,125\nOther Segment 43,026 43,881 35,535\n$ 598,204 $ 571,223 $ 528,660\nOperating Profit (Loss)\nIT&S Segment $ 135,883 $ 78,735 $ 81,683\nOther Segment 10,954 729 (10,420)\nGeneral Corporate (62,915) (48,804) (20,150)\n$ 83,922 $ 30,660 $ 51,113\nDepreciation and Amortization:\nIT&S Segment $ 12,329 $ 14,498 $ 15,856\nOther Segment 3,164 3,664 3,568\nGeneral Corporate 820 1,438 2,187\n$ 16,313 $ 19,600 $ 21,611\nCapital Expenditures:\nIT&S Segment $ 7,779 $ 7,139 $ 10,918\nOther Segment 599 710 768\nGeneral Corporate 1,022 568 333\n$ 9,400 $ 8,417 $ 12,019\nAugust 31,\n2023 2022\nAssets:\nIT&S Segment $ 632,113 $ 618,412\nOther Segment 28,127 46,428\nGeneral Corporate 102,357 92,472\n$ 762,597 $ 757,312\nIn addition to the impact of changes in foreign currency exchange rates, the comparability of segment and product line information is impacted by acquisition/divestiture activities, impairment and divestiture charges, restructuring costs and related benefits. Corporate assets, which are not allocated, principally represent cash and cash equivalents, property, plant, and equipment, ROU assets, capitalized debt issuance costs and deferred income taxes.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following tables summarize net sales and property, plant and equipment by geographic region (in thousands):\nYear Ended August 31,\n2023 2022 2021\nNet Sales:\nUnited States of America $ 231,093 $ 226,020 $ 188,070\nUnited Kingdom 34,085 29,316 39,896\nGermany 29,926 28,004 28,456\nCanada 29,643 19,651 17,348\nAustralia 28,607 26,667 24,990\nSaudi Arabia 25,762 20,892 16,715\nBrazil 20,523 16,517 13,937\nFrance 14,606 14,854 13,368\nChina 14,081 15,434 16,927\nAll Other 169,877 173,868 168,953\n$ 598,204 $ 571,223 $ 528,660\nAugust 31,\n2023 2022\nProperty, Plant and Equipment, net:\nUnited States $ 15,081 $ 16,743\nUnited Kingdom 7,543 8,212\nUAE 4,004 4,407\nBrazil 3,197 2,873\nNetherlands 2,423 1,965\nSpain 1,484 1,413\nAll other 5,235 5,761\n$ 38,968 $ 41,372\nThe Companys largest customer accounted for approximately 3% of sales in each of the last three fiscal years. Export sales from domestic operations were 9.9%, 9.8% and 7.2% of total net sales from continuing operations in fiscal 2023, 2022 and 2021, respectively.\nNote 16. Commitments and Contingencies\nThe Company had outstanding letters of credit of $8.6 million and $10.7 million at August 31, 2023 and 2022, respectively, the majority of which relate to commercial contracts and self-insured workers' compensation programs.\nAs part of the Company's global sourcing strategy, we have entered into agreements with certain suppliers that require the supplier to maintain minimum levels of inventory to support certain products for which we require a short lead time to fulfill customer orders. We have the ability to notify the supplier that they no longer need maintain the minimum level of inventory should we discontinue manufacturing of a product during the contract period; however, we must purchase the remaining minimum inventory levels the supplier was required to maintain within a defined period of time.\nThe Company is a party to various legal proceedings that have arisen in the normal course of business. These legal proceedings include regulatory matters, product liability, breaches of contract, employment, personal injury and other disputes. The Company has recorded reserves for loss contingencies based on the specific circumstances of each case. Such reserves are recorded when it is probable a loss has been incurred and can be reasonably estimated. The Company maintains a policy to exclude from such reserves an estimate of legal defense costs. In the opinion of management, resolution of these contingencies is not expected to have a material adverse effect on the Companys financial position, results of operations or cash flows.\nThe Company has facilities in numerous geographic locations that are subject to environmental laws and regulations. Environmental expenditures over the past three years have not been material. Soil and groundwater contamination has been identified at certain facilities that we operate or formerly owned or operated. We are also a party to certain state and local environmental matters, have provided environmental indemnifications for certain divested businesses and retain responsibility\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nfor certain potential environmental liabilities. Management believes that such costs will not have a material adverse effect on the Companys financial position, results of operations or cash flows.\nAdditionally, in fiscal 2019, the Company provided voluntary self-disclosures to both Dutch and U.S. authorities related to sales of products and services linked to the Crimea region of Ukraine, which sales potentially violated European Union and U.S. sanctions provisions. Although the U.S. investigation closed without further implication, the Dutch investigation continued. The Dutch Investigator concluded his investigation in March 2022 and provided the results to the Public Prosecutor's office for review. Specifically, the Investigator concluded that the sales transactions violated EU sanctions. The conclusion in the Investigator's report was consistent with the Company's understanding of what could be stated in the report and supported the Company to record an expense in the fiscal year-ended August 31, 2021, representing the low end of a reasonable range of financial penalties the Company may incur as no other point within the range was deemed more probable. The Company has not adjusted its estimate of financial penalties as a result of the completion of the investigation in the year ended August 31, 2023. While there can be no assurance of the ultimate outcome of the matter, the Company currently believes that there will be no material adverse effect on the Company's financial position, results of operations or cash flows from this matter.\nENERPAC TOOL GROUP CORP.\nSCHEDULE II-VALUATION AND QUALIFYING ACCOUNTS\n(in thousands)\nAdditions Deductions\nBalance at\nBeginning of\nPeriod Charged to\nCosts and\nExpenses (Income) Acquisition/ (Divestiture) Accounts\nWritten Off\nLess\nRecoveries Other Balance at\nEnd of\nPeriod\nAllowance for losses-Trade accounts receivable\nAugust 31, 2023 $ 17,504 $ 1,177 $ (32) $ (2,230) $ 362 $ 16,781\nAugust 31, 2022 4,235 14,277 - (350) (658) 17,504\nAugust 31, 2021 4,991 8 - (845) 81 4,235\nValuation allowance-Income taxes\nAugust 31, 2023 $ 61,630 $ 3,305 $ - $ (3,503) $ - $ 61,432\nAugust 31, 2022 66,155 925 - (5,450) - 61,630\nAugust 31, 2021 70,414 4,886 - (9,145) - 66,155 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nThe Companys management, with the participation of the Companys Chief Executive Officer and Chief Financial Officer, have evaluated the effectiveness of the Companys disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) as of the end of the period covered by this report. Based on such evaluation, the Companys Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, the Companys disclosure controls and procedures are effective in recording, processing, summarizing, and reporting, and reporting, within the time periods specified in the SEC's rules and forms, information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act, and that such information is accumulated and communicated to the Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely discussions regarding required disclosure.\nManagements Report on Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The Companys management, with the participation of the Companys Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the Companys internal control over financial reporting based on the framework in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, the Companys management has concluded that, as of August 31, 2023, the Companys internal control over financial reporting was effective.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness to future periods are subject to the risk that the controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nErnst & Young, LLP, an independent registered public accounting firm, has audited the Companys internal control over financial reporting as of August 31, 2023, as stated in their report which is included herein.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting during the fourth quarter of fiscal 2023 that materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information\nDuring the three months ended August 31, 2023, none of the Companys directors or officers (as defined in Rule 16a-1(f) of the Exchange Act) adopted or terminated a Rule 10b5-1 trading arrangement or a non-Rule 10b5-1 trading arrangement (as such terms are defined in Item 408 of Regulation S-K).\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors; Executive Officers and Corporate Governance\nInformation about the Companys directors is incorporated by reference from the Proposal I: Election of Directors section of the Companys Proxy Statement for its Annual Meeting of Shareholders to be held on January 25, 2024 (the 2024 Annual Meeting Proxy Statement). Information about the Companys Audit Committee, including the members of the committee, and the Companys Audit Committee financial experts, is incorporated by reference from the Proposal I: Election of Directors and Corporate Governance Matters sections of the Companys 2024 Annual Meeting Proxy Statement. Information with respect to the timeliness of filings by directors and executive officers of reports required under Section 16(a) of the Securities Exchange Act of 1934, as amended, is incorporated by reference from the \"Other Information-Delinquent Section 16(a) Reports\" section of the 2024 Annual Meeting Proxy Statement. Information about the Companys executive officers required by this item is contained in the discussion entitled Executive Officers of the Registrant in Part I hereof.\nThe Company has adopted a code of ethics that applies to its senior executive team, including its Chief Executive Officer, Chief Financial Officer and Corporate Controller. The code of ethics is posted on the Companys website and is available free of charge at www.enerpactoolgroup.com. The Company intends to satisfy the requirements under Item 5.05 of Form 8-K regarding disclosure of amendments to, or waivers from, provisions of its code of ethics that apply to the Chief Executive Officer, Chief Financial Officer or Corporate Controller by posting such information on the Companys website. Item 11. Executive Compensation\nThe information required by this item is incorporated by reference from the Election of Directors, Corporate Governance Matters, Executive Compensation (other than the information appearing under the heading \"Pay Versus Performance\") and \"Non-Employee Director Compensation\" sections of the 2024 Annual Meeting Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated by reference from the Certain Beneficial Owners and Executive Compensation-Equity Compensation Plan Information sections of the 2024 Annual Meeting Proxy Statement. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference from the Corporate Governance Matters-Certain Relationships and Related Party Transactions section of the 2024 Annual Meeting Proxy Statement. Item 14. Principal Accountant Fees and Services\nThe information required by this item is incorporated by reference from the Other Information-Independent Public Accountants section of the 2024 Annual Meeting Proxy Statement.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) Documents filed as part of this report:\n1. Consolidated Financial Statements\nSee Index to Consolidated Financial Statements set forth in Item 8, Financial Statements and Supplementary Data for a list of financial statements filed as part of this report.\n2. Financial Statement Schedules\nSee Index to Financial Statement Schedule set forth in Item 8, Financial Statements and Supplementary Data.\n3. Exhibits\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n2.1\nSecurities Purchase Agreement, dated as of July 8, 2019, by and between Actuant Corporation, BRWS Parent LLC, Actuant France SAS and Actuant Holdings AB. Exhibit 2.1 to the Registrant's Current Report on Form 8-K filed on July 9, 2019\n3.1 (a) Amended and Restated Articles of Incorporation\nExhibit 4.9 to the Registrant's Form 10-Q for the quarter ended February 28, 2001\n(b) Amendment to Amended and Restated Articles of Incorporation\nExhibit 3.1(b) of the Registrant's Form 10-K for the fiscal year ended August 31, 2003\n(c) Amendment to Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 10-K for the fiscal year ended August 31, 2004\n(d) Amendment to Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 8-K filed on July 18, 2006\n(e) Amendment of Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 8-K filed on January 14, 2010\n(f) Amendment of Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 8-K/A filed on January 30, 2020\n3.2\nAmended and Restated Bylaws, as amended Exhibit 3.1 of the Registrant's Form 8-K filed on August 1, 2022\n4.1\nDescription of Registered Securities Exhibit 4.1 to the Registrant's Form 10-K for the fiscal year ended August 31, 2020\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n10.1\nCredit Agreement dated as of September 9, 2022 among Enerpac Tool Group Corp., the initial subsidiary borrowers party thereto, the guarantors party thereto, the lenders party thereto, and PNC Bank, National Association, as administrative agent Exhibit 10.1 to the Registrant's Current Report on Form 8-K filed on September 15, 2022\n10.2*\nOutside Directors Deferred Compensation Plan (as amended and restated effective July 23, 2021) Exhibit 10.2 to the Registrant's Form 10-K for the fiscal year ended August 31, 2021\n10.3*\nDeferred Compensation Plan (conformed through the fourth amendment) Exhibit 10.2 to the Registrant's Form 10-Q for the quarter ended November 30, 2014\n10.4*\nNon-Qualified Deferred Compensation Plan (conformed through the first amendment) Exhibit 10.4 to the Registrant's Form 10-K for the fiscal year ended August 31, 2020\n10.5*\n2010 Employee Stock Purchase Plan Exhibit B to the Registrant's Definitive Proxy Statement, dated December 4, 2009\n10.6*\nEnerpac Tool Group Corp. 2017 Omnibus Incentive Plan (as amended and restated November 9, 2020) Appendix A to the Proxy Statement on Schedule 14A filed by Enerpac Tool Group Corp. on December 4, 2020\n10.7**\n2009 Omnibus Incentive Plan, conformed through the Second Amendment thereto Exhibit 99.1 to the Registrant's Form 8-K filed on January 17, 2013\n10.8* (a) Amended and Restated 2001 Outside Directors Stock Plan\nExhibit A to the Registrant's Definitive Proxy Statement, dated December 5, 2005\n(b) First Amendment to the Amended and Restated 2001 Outside Directors Stock Plan dated December 25, 2008\nExhibit 10.10 to the Registrant's Form 10-Q for the quarter ended November 30, 2008\n10.9*\nSupplemental Executive Retirement Plan (conformed through the first amendment) Exhibit 10.3 to the Registrant's Form 10-Q for the quarter ended November 30, 2014\n10.10*\nSenior Officer Severance Plan Exhibit 10.1 to the Registrant's Current Report on Form 8-K filed on July 31, 2019\n10.11*\nForm of Indemnification Agreement for Directors and Officers Exhibit 10.1 to the Registrant's Form 8-K filed on August 2, 2018\n10.12*\nForm of Amended and Restated Change in Control Agreement Exhibit 10.1 to the Registrants Form 8-K filed on August 1, 2017\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n10.13*\nExecutive Officer Bonus Plan Exhibit B to the Registrant's Definitive Proxy Statement dated December 3, 2012\n10.14* (a) Form of NQSO Award (Director) under the 2009 Omnibus Incentive Plan*\nExhibit 10.1(a) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n(b) Form of NQSO Award (Officer) under the 2009 Omnibus Incentive Plan*\nExhibit 10.1(b) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n10.15* (a) Form RSA Award (Director) under the 2009 Omnibus Incentive Plan*\nExhibit 10.2(a) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n(b) Form of RSA Award (Officer) under the 2009 Omnibus Incentive Plan*\nExhibit 10.2(b) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n10.16* (a) Form of RSU Award (Director) under the 2009 Omnibus Incentive Plan*\nExhibit 10.3(a) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n(b) Form of RSU Award (Officer) under the 2009 Omnibus Incentive Plan*\nExhibit 10.3(b) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n10.17*\n(a) Form RSA Award (Director) under the 2017 Omnibus Incentive Plan Exhibit 10.14 to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n10.18* (a) Form of RSU Award (Director) under the 2017 Omnibus Incentive Plan*\nExhibit 10.15(a) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n(b) Form of RSU Award (Officer) under the 2017 Omnibus Incentive Plan*\nExhibit 10.15(b) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n10.19* (a) Form of PSU Award - Total Shareholder Return (Officer) under the 2017 Omnibus Incentive Plan*\nExhibit 10.16(a) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n(b) Form of PSU Award - Free Cash Flow (Officer) under the 2017 Omnibus Incentive Plan*\nExhibit 10.16(b) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n10.20* (a) Form of Restricted Stock Unit (RSU) agreement under the 2017 Omnibus Incentive Plan (Special Executive Grant)\nExhibit 10.1 to the Registrant's Form 8-K filed on September 1, 2023\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n(b) Form of Performance Share Award agreement under the 2017 Omnibus Incentive Plan (Special Executive Grant)\nExhibit 10.2 to the Registrant's Form 8-K filed on September 1, 2023\n10.21*\nLetter agreement dated September 22, 2021 between Paul E. Sternlieb and Enerpac Tool Group Corp. Exhibit 10.1 to the Registrant's Current Report on Form 8-K filed on September 29, 2021\n10.22*\nLetter agreement dated May 4, 2022 between Anthony P. Colucci and Enerpac Tool Group Corp.\n10.23*\nLetter agreement dated January 19, 2022 between Benjamin J. Topercer and Enerpac Tool Group Corp. Exhibit 10.23 to the Registrant's Form 10-K for the fiscal year ended August 31, 2022\n10.24*\nAgreement dated May 27, 2022 between Markus Limberger and Actuant GmbH X\nCode of Ethics Applicable to Senior Financial Executives Exhibit 14 of the Registrants Form 10-K for the fiscal year ended August 31, 2017\nSubsidiaries of the Registrant X\n23 Consent of Ernst & Young LLP\nX\nPower of Attorney See signature page of this report\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 X\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 X\n32.1\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 X\n32.2\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 X\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\nThe following materials from the Enerpac Tool Group Corp. Form 10-K for the year ended August 31, 2023 formatted in Inline Extensible Business Reporting Language (Inline XBRL): (i) the Consolidated Statements of Earnings, (ii) the Consolidated Statements of Comprehensive Income (Loss), (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Cash Flows and (v) the Notes to Consolidated Financial Statements. X\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in the Interactive Data Files submitted as Exhibit 101) X\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nENERPAC TOOL GROUP CORP.\n(Registrant)\nBy: /S/ ANTHONY P. COLUCCI\nAnthony P. Colucci\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\nDated: October 20, 2023\nPOWER OF ATTORNEY\nKNOWN ALL MEN BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Paul E. Sternlieb, Anthony P. Colucci and James P. Denis, and each of them, his true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him and in his name, place and stead, in any and all capacities, to sign any and all amendments to this report, and to file the same, with all and any other regulatory authority, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents or any of them, or their substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.*\nSignature Title\n/s/ PAUL E. STERNLIEB President and Chief Executive Officer, Director\nPaul E. Sternlieb\n/s/ ALFREDO ALTAVILLA Director\nAlfredo Altavilla\n/s/ JUDY ALTMAIER Director\nJudy Altmaier\n/s/ J. PALMER CLARKSON Director\nJ. Palmer Clarkson\n/s/ DANNY L. CUNNINGHAM Director\nDanny L. Cunningham\n/s/ E. JAMES FERLAND Chairman of the Board of Directors\nE. James Ferland\n/s/ COLLEEN M. HEALY Director\nColleen M. Healy\n/s/ RICHARD D. HOLDER Director\nRichard D. Holder\n/s/ LYNN C. MINELLA Director\nLynn C. Minella\n/s/ SIDNEY S. SIMMONS Director\nSidney S. Simmons\n/s/ ANTHONY P. COLUCCI Executive Vice President and Chief Financial Officer (Principal Financial Officer and Principal Accounting Officer)\nAnthony P. Colucci\n* Each of the above signatures is affixed as of October 20, 2023."
}