{
    "cik": "6955",
    "company": "ENERPAC TOOL GROUP CORP",
    "filing_type": "10-K",
    "filing_date": "2022-10-25",
    "period_of_report": "2022-08-31",
    "sic": "3590",
    "state_of_inc": "WI",
    "state_location": "WI",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/6955/0000006955-22-000031-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/6955/000000695522000031/epac-20220831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/6955/0000006955-22-000031.txt",
    "filename": "6955_10K_2022_0000006955-22-000031.htm",
    "content": "Item 1. Business\nGeneral\nEnerpac Tool Group Corp. is a premier industrial tools and services company serving a broad and diverse set of customers in more than 100 countries. The Company is a global leader in the engineering and manufacturing of high pressure hydraulic tools, controlled force products and solutions for precise positioning of heavy loads that help customers safely and reliably tackle some of the most challenging jobs around the world. The Company was founded in 1910 and is headquartered in Menomonee Falls, Wisconsin. The Company has six operating segments, Industrial Tools & Service (\"IT&S\") Americas, IT&S Europe/Sub Sahara Africa/India (IT&S ESSAI), IT&S Asia Pacific/Australia/China (IT&S APAC), IT&S Middle East/North Africa/Caspian (IT&S MENAC), Cortland Industrial and Cortland Medical. In accordance with generally accepted accounting principles in the United States (US GAAP), the IT&S operating segments met the criterion for aggregation and have been aggregated into IT&S, our only reportable segment. The IT&S segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools and in providing services and tool rental to the industrial, maintenance, infrastructure, oil & gas, alternative energy and other markets. Financial information related to the Company's reportable segment is included in Note 16, \"Business Segment, Geographic and Customer Information\" in the notes to the consolidated financial statements.\nDuring the fourth quarter of fiscal 2019, we entered into a Securities Purchase Agreement (\"SPA\") to sell the remaining businesses within our legacy Engineered Components & Systems (\"EC&S\") segment. We closed the transaction during our first quarter of fiscal 2020. The divestiture of the EC&S segment was a strategic shift to become a pure-play industrial tools and services company. As such, the results of the EC&S segment are considered discontinued operations in all periods presented herein.\nOur Business Model\nOur long-term goal is to create shareholder value and best in class returns through growth of our core businesses, driving efficiency and profitability, generating strong cash flow, and being disciplined in the deployment of our capital. We intend to leverage our strong brand, market positions, and dealer and distribution networks to generate organic core sales growth that exceeds end-market growth rates. Our plan is to accomplish organic growth through a combination of market share capture and product innovation, as well as market expansion into new vertical markets, emerging industries and new geographic regions. In addition to organic growth, we also focus on profit margin expansion by utilizing continuous improvement techniques to drive productivity and lower costs and by enacting routine pricing initiatives to generate price realization and offset cost increases, such as commodity and tariff increases and general inflation. Finally, cash flow generation is critical to achieving our financial\nand long-term strategic objectives. We expect to achieve strong cash flow generation by maximizing returns on assets and minimizing primary working capital needs. The cash flow that results from efficient asset management and improved profitability is used to fund internal growth opportunities, strategic acquisitions, paydown of debt and opportunistic returns to shareholders.\nIn March 2022, the Company announced the start of its ASCEND transformation program (ASCEND). ASCENDs key initiatives include accelerating organic growth go-to-market strategies, improving operational excellence and production efficiency by utilizing a Lean approach, and driving greater efficiency and productivity in selling, general and administrative expense by better leveraging resources to create a more efficient and agile organization. The Company expects that it will deliver an incremental $40-$50 million of annual operating profit from the execution of ASCEND, with the full run rate of operating profit expected to be reflected in its results as it exits fiscal 2024 and fully incorporated into its fiscal 2025 projections. Enerpac anticipates investing approximately $60-$65 million over the life of the program to support the ASCEND initiatives.\nDescription of Business Segments\nIndustrial Tools & Services Reportable Segment\nIT&S is a global supplier of both products and services to a broad array of end markets, including infrastructure, industrial maintenance, repair and operations, oil & gas, mining, alternative and renewable energy, and civil construction markets.\nOur primary products include branded tools, cylinders, pumps, hydraulic torque wrenches and highly engineered heavy lifting technology solutions. Examples of our products include high-force hydraulic and mechanical tools (cylinders, pumps, valves and specialty tools), which are designed to allow users to apply controlled force and motion to increase productivity, reduce labor costs and make work safer and easier to perform, bolt tensioners and other miscellaneous products. These tools operate at very high pressures of approximately 5,000 to 12,000 pounds per square inch. With our products used in a wide variety of end markets, they are often deployed in harsh operating conditions, such as machining, infrastructure maintenance and repair, and oil & gas production, where safety is a key differentiator. As a result, we hold ourselves to a world-class safety standard to protect both our employees and those using our products and services.\nOn the services side of the segment, our highly trained technicians provide maintenance and manpower services on customer assets to meet their specific needs including bolting, machining, and joint integrity. We also provide rental capabilities for certain of our products.\nOur branded tools and services are primarily marketed through the Enerpac, Hydratight, Larzep and Simplex brand names.\nThe segment delivers products and services primarily through our world-class, global network of distributors, as well as direct sales to OEMs and select end users. Examples of industrial distributors include W.W. Grainger, MSC and Blackwoods.\nOther Operating Segment\nThe Cortland Industrial and Medical operating segments, which primarily design and manufacture high performance synthetic ropes and biomedical textiles, respectively, do not meet the quantitative or qualitative thresholds, individually or collectively, to be considered reportable segments, and together represent the Other operating segment. Therefore, the results are not disclosed separately as would be required if the Other operating segment were considered a reportable segment, and as the business is not closely related to the IT&S segment, results are not aggregated to be included in the results of the IT&S reportable segment. Certain information related to the Other operating segment is disclosed within Note 16, \"Business Segment, Geographic, and Customer Information\" in order to comply with US GAAP requirements to reconcile certain required disclosures to the Consolidated Financial Statements.\nAcquisitions and Divestitures\nFor a summary of recent acquisition and divestiture transactions impacting continuing operations, see Note 5, \"Acquisitions\" and Note 6, \"Discontinued Operations and Other Divestiture Activities\" in the notes to the consolidated financial statements.\nInternational Business\nOur products and services are generally available globally, with our principal markets outside the United States being Europe, the Middle East and Asia. In fiscal 2022, we derived 40% of our net sales from the United States, 24% from Europe, 14% from the Middle East, 14% from Asia and 8% from other geographic areas. We have operations around the world that allow us to draw on the skills of a global workforce, provide flexibility to our operations, drive economies of scale, provide revenue streams that may help offset economic trends that are specific to individual countries and access new markets. Although international operations are subject to certain risks, we continue to believe that a global presence is key to maintaining strong relationships with many of our global customers and suppliers. Financial information related to the Company's\ngeographic footprint of our continuing operations is included in Note 16, \"Business Segment, Geographic and Customer Information\" in the notes to the consolidated financial statements.\nProduct Development and Engineering\nWe conduct research and development activities to develop new products and to enhance the functionality, effectiveness, ease of use and reliability of our existing products. We believe that our engineering and research and development efforts have been, and continue to be, key drivers of our success in the marketplace. Our advanced design and engineering capabilities contribute to the development of innovative and highly engineered products, maintain our technological leadership and enhance our ability to provide customers with unique and customized solutions and products. We anticipate that we will continue to make significant expenditures for research and development as we seek to provide new innovative tools and services to grow our market share. Research and development (\"R&D\") costs are expensed as incurred. R&D costs were $7.3 million in fiscal 2022, a decrease of 1% from $7.4 million in fiscal 2021 and an increase of 1% from $7.3 million in fiscal 2020.\nThe Company holds numerous patents and trademarks; however, no individual patent or trademark is believed to be of such importance that its termination would have a material adverse effect on our business.\nCompetition\nThe markets for our products are highly competitive. We provide a diverse and broad range of industrial products and services to numerous global end markets, many of which are highly fragmented. Although we face larger competitors in several served markets, some of our competition is comprised of smaller companies which may lack the footprint or financial resources to serve global customers. We compete for business principally on the basis of customer service, product quality and availability, engineering and research and development expertise. In addition, we believe that our cost structure, strategic global sourcing capabilities and global distribution support our competitive position.\nManufacturing and Operations\nWhile we do have manufacturing capabilities including machining and fabrication, our manufacturing consists primarily of light assembly of components we source from a network of global suppliers. We have implemented single piece flow processes in most of our plants, which reduces inventory levels, lowers re-work costs and shortens lead times to customers. Components are built to our highly engineered specifications by a variety of suppliers, including those in best-cost countries such as China and India. We have built strong relationships with our key suppliers and, while we single source certain of our components, in many cases there are several qualified alternative sources.\nRaw Material Costs, Inflation and Tariffs\nWe source materials and components from a network of global suppliers. These items are typically available from multiple suppliers. Raw materials that go into the components we source, such as steel, aluminum, plastic resin, brass, steel wire and rubber, are subject to price fluctuations and tariffs, which could have an impact on our results. We have been able to offset the impact of inflation with pricing actions, manufacturing efficiencies and other cost reductions. In addition, several of our products have been subject to tariffs, but to date we have been able to offset the majority of additional costs from tariffs through price increases. We continue to manage our supply chain to mitigate ongoing risks associated with the evolving political and inflationary environments.\nOrder Backlogs and Seasonality\nOur operating segments have a relatively short order-to-ship cycle. We had order backlogs of $72 million and $55 million at August 31, 2022 and 2021, respectively. The increase in our order backlog year over year was primarily due to a combination of strong orders and supply chain challenges putting pressure on past due backlog. The supply chain challenges, including logistical constraints, are a result of the demand surge following the lessening of the COVID-19 pandemic at the end of fiscal 2021. Exclusive of further deterioration of our supply chain, substantially all of the backlog at August 31, 2022 is expected to be filled within twelve months. While we typically experience a stronger second half to our fiscal year, our consolidated sales are not subject to significant seasonal fluctuations.\nPercentages of Sales by Fiscal Quarter\n2022 2021\nQuarter 1 (September - November) 23 % 23 %\nQuarter 2 (December - February) 24 % 23 %\nQuarter 3 (March - May) 27 % 27 %\nQuarter 4 (June - August) 26 % 27 %\n100 % 100 %\nHuman Capital Management\nThe goal of human capital management strategy and practices is for Enerpac to be considered an employer of choice, and our initiatives and programs are predicated on making this objective a reality.\nThe talent and skills of our workforce (approximately 2,200 employees as of August 31, 2022) are critical to our future success and ability to deliver shareholder value. Our development framework starts with robust performance management. Together with their leaders, employees establish annual goals and objectives that clearly align with our organizational commitments. We monitor progress throughout the year, with candid and frequent dialogue encouraged along the way. Annually, our senior leadership team reviews the skills we require to execute our corporate strategy and key roles to identify development opportunities for our emerging talent and perform succession planning. We promote a longer-term view by inviting employees to work with leaders to create their own unique individual development plan. Training programs in many different manners are available for all levels throughout Enerpac, addressing a wide variety of skills and competencies, both general and technical. We believe in coaching and the sharing of perspectives and facilitate mentorship opportunities for the benefit of our workforce. We are committed to devoting the time, resources and planning necessary to maximize the potential of our employees.\nWe offer competitive compensation and benefits tailored to the geographical markets and industries in which we operate. In the U.S., employees who work more than 30 hours per week are eligible for a comprehensive menu of benefits, including paid time off, healthcare (health, dental, and vision), short and long-term disability, life and accidental disability insurance, a 401(k) retirement plan with a Company match, access to our Employee Assistance Program, an annual bonus program with broad participation, equity incentive programs, an Employee Stock Ownership Plan that allows employees to buy company shares at a discount, flexible work arrangements and up to 12 weeks of paternal leave. We also offer annual tuition reimbursement of up to $3,500 for undergraduate programs and $5,000 for graduate programs for all U.S. full-time employees and $1,000 for part-time employees who work more than 20 hours per month. During 2022, we expanded paid parental leave, adoption assistance, medical coverage for fertility treatments and expanded short-term disability benefits for hourly employees. We continue to evaluate enhancements to our compensation and benefit programs in all locations to ensure we remain competitive and meet the needs of our employees. Consistent with this desire, we are enhancing or adding several benefits for our U.S. employees beginning in calendar 2023, including enriching our tuition reimbursement programs and adding voluntary benefits including critical illness, accident insurance, identity protection and certain legal services.\nDiversity, Equity, & Inclusion. Our senior leadership team and management at all levels are dedicated to creating a culture of inclusion and belonging and a workplace where all employees can thrive and do their best work, and senior management reports to the Board on the Companys progress in these areas on a regular basis. Over the past year, we have significantly enhanced our focus on Diversity, Equity & Inclusion (\"DE&I\") and have incorporated these objectives into our core strategy. Our DE&I objectives include: (i) a focus on our culture, (ii) supporting education for disadvantaged groups in our communities, and (iii) broadening our recruiting efforts to reach and attract more diverse employees. Because of the strategic importance of DE&I, and to embed it into our strategy, DE&I initiatives are under the responsibility of our EVP & Human Resource Officer. To date, as part of our strategy execution, we have hired a leader of DE&I for Enerpac, leveraged the efforts of a third-party consulting firm to assist in the execution of our priorities, created DE&I councils in our four operating regions, and formed the Women of Enerpac, our first employee resource group. Our DE&I initiatives have strong ties into the broader organization to ensure we are successful in achieving our goals. In 2023, we will be adding further employee resource groups, including a multicultural resource group.\nWe also believe diversity at the executive and Board level is key to the long-term success of the Company and to promote diversity and inclusion in our workplace. At the end of fiscal 2022, our executive officers included one female (17% of the membership of that committee). At the end of fiscal 2022, our board of directors included two females (25%) and one racially diverse individual (13%). We believe that valuing diversity as part of our core strategy will provide greater opportunity for Enerpac to attract and retain talent, benefit from diverse points of view and ultimately assist in achieving our goals to drive shareholder value creation.\nEmployee Safety. The safety, health, and well-being of our employees, contractors, and visitors at our sites globally is our top priority and a principle that is deeply embedded in our culture. Our health, safety, security, environment, and quality\n(HSSEQ) programs are fully embraced by our leaders and employees at all levels and translate into an enterprise-wide obligation to provide healthy, safe and productive work environments for our employees and deliver high standards of safety and quality in the products, services and solutions for our customers and end-users. At the heart of our HSSEQ efforts is a desire to foster a culture of continuous improvement and employee empowerment through training, frequent and constructive management engagement, a risk-based evaluation of business activities and behaviors, and the deployment of programs and resources to mitigate those risks. We continually track and report our performance, including through reviews of incidents, near-misses, and quality issues; and management accountability and discussion of these improvement opportunities is a cornerstone of all business reviews. We finished the year with a Total Case Incident Rate (TCIR) of 0.61. This is up slightly year over year as fiscal year 2021 had a TCIR of 0.56. This puts us right at the top quartile performance (less than 0.6) in comparison to the BLS NAICS bracket for Machinery Manufacturing (333) for companies with greater than 1,000 employees.\nExecutive Officers of the Registrant\nThe names, ages and positions of all of the executive officers of the Company as of October 15, 2022 are listed below.\nName Age Position\nPaul E. Sternlieb 50 President and Chief Executive Officer\nBarbara G. Bolens 61 Executive Vice President and Chief Strategy Officer\nAnthony P. Colucci 52 Executive Vice President and Chief Financial Officer\nJames P. Denis 48 Executive Vice President, General Counsel, Company Secretary & Chief Compliance Counsel\nMarkus Limberger 52 Executive Vice President, Operations\nBenjamin J. Topercer 45 Executive Vice President and Chief Human Resource Officer\nScott Vuchetich 53 Executive Vice President, Marketing and President - Americas\nPaul Sternlieb, President and Chief Executive Officer, was appointed President and Chief Executive Officer of the Company in October 2021. Prior to joining the Company, Mr. Sternlieb served as Executive Vice President (\"EVP\") and President, Protein, at John Bean Technologies Corporation (\"JBT\") since October 2017. Prior to JBT, Mr. Sternlieb was Group President, Global Cooking in the Food Equipment Group at Illinois Tool Works since 2014. He served as a Vice President (\"VP\") & General Manager with Danaher from 2011 to 2014. Before Danaher, he held management roles with the H.J. Heinz Company, a leading food production company and was a consultant with McKinsey & Company.\nBarbara Bolens, EVP and Chief Strategy Officer, joined the Company in August 2018 as VP of Investor Relations and Corporate Strategy and was appointed EVP and Chief Strategy Officer in October 2019. Prior to joining the Company, Ms. Bolens spent over six years at Komatsu Mining Corporation (formerly Joy Global Inc.) as its Vice President and Treasurer. Prior to Komatsu, she held financial leadership positions of progressive responsibility at several other multinational corporations as well as early career leadership roles in sales and marketing.\nAnthony Colucci, EVP and Chief Financial Officer (\"CFO\"), joined the Company in that capacity in May of 2022, and leads global Finance and IT. From June 2020 until joining the Company, Mr. Colucci served as Executive Vice President and Chief Finance and Administrative Officer of Robertshaw Industries, a global engineering and manufacturing company focused on controls and solutions for residential white goods and commercial appliances. Prior to joining Robertshaw, Mr. Colucci served as Senior Vice President and Chief Financial Officer of Hayward Industries, Inc., a manufacturer of pool equipment and controls products, from May 2018 to May 2020, and in various positions with Honeywell International since September 2006, including as Vice President and Chief Financial Officer of Honeywell Performance Materials & Technologies from March 2016 to May 2018 and Vice President and Chief Financial Officer of Honeywell Sensing & Productivity Solutions from September 2011 to March 2016. Mr. Colucci served in various financial roles with AT&T Wireless from September 1997 until he joined Honeywell.\nJames Denis, EVP, General Counsel, Company Secretary & Chief Compliance Counsel, has served in this capacity since September 2022. He joined the Company in 2013 as our Global Litigation Counsel and was promoted to Regional General Counsel for the Americas and APAC in October 2018 and Assistant General Counsel in March 2020. In December 2021, he was appointed Acting General Counsel and Corporate Secretary. Before joining the Company, Mr. Denis was a shareholder with the law firm of Reinhart Boerner Van Deuren s.c., where he was a member of the firms Products Liability and Insurance Risk Management Teams.\nMarkus Limberger, EVP, Operations, joined the Company in September of 2022, with responsibilities for manufacturing, distribution, and procurement. Mr. Limberger served as Vice President Global Operations for Leica Microsystems GmbH, a subsidiary of Danaher Corporation and manufacturer of microscopy equipment, from September 2018 until he joined Enerpac. Prior to that, Mr. Limberger was with Leica Camera AG, serving as Head of Operations from January 2011 to July 2011 and then as Chief Operating Officer until August 2018. Before joining Leica Camera, Mr. Limberger served as Head of Production from August 2007 to January 2008 and then as Managing Director until December 2010 of Uwe Weller Feinwerktechnik\nGmbH, a metal processing company. Prior to that, he held operations, logistics and dispatching management positions with a number of other manufacturing firms. His background includes a strong focus on operational excellence and in developing and executing operations strategies to achieve sustained improvements in performance, with extensive experience in Lean and continuous improvement principles.\nBenjamin Topercer, EVP and Chief Human Resource Officer, joined the Company in February 2022 and leads the global HR function, including our global Health, Safety, Security, Environment, and Quality (HSSEQ) organization, as well as the Diversity, Equity, and Inclusion (DE&I) initiatives. From June 2016 until he joined Enerpac, Mr. Topercer was the Chief Human Resource Officer for Vantage Specialty Chemicals, a manufacturer of specialty chemicals and ingredients included in consumer and industrial products. Prior to joining Vantage, he served in various human resources management roles for Premier Farnell Corporation, a distributor of electronic components, including as Global Head of HR for its sales, marketing, e-commerce and technology groups and specified business units, from September 2013 to June 2016. Prior to that, Mr. Topercer served as Director, Human Resources for Eaton Corporation, and its predecessor, Cooper Industries, from July 2011 to September 2013. Prior to that, he served in positions of progressive responsibility in the human resources group of Henkel Corporation from September 2004 to July 2011 and at Rexam Sussex from March 2000 to September 2004.\nScott Vuchetich, EVP, Marketing and President - Americas, joined the Company in December 2021. Prior to joining Enerpac, he served Brady Corporation, a global manufacturer of safety, identification and compliance products, in roles of progressive responsibility from January 2015, including as Vice President & General Manager of the People ID division from April 2018 until December 2021. Prior to joining Brady Corporation, he was an independent operations, strategy, diligence and restructuring consultant providing both project support and interim executive services to a variety of corporate clients from August 2012 to December 2014 and also from September 2007 to October 2009. He served as Senior Vice President and General Manager, Food Systems of Tate & Lyle from May 2010 to July 2012 and as Senior Vice President, Policy, Planning & Analysis of Swift & Company from July 2005 to July 2007. Earlier in his career, Mr. Vuchetich was a consultant with Bain & Company, Inc. for approximately six years. Item 1A. Risk Factors\nThe risks and uncertainties described below are those that we have identified as material but are not the only risks and uncertainties facing the Company. If any of the events contemplated by the following risks occurs, our business, financial condition, or results of operations could be materially adversely affected. Additional risks and uncertainties not currently known to us, or that we currently believe are immaterial, also may adversely impact our business, including our ability to execute our strategic growth and profitability objectives.\nRisks Related to Economic Conditions\nSupply chain issues, including shortages of adequate component supply that increase our costs or cause delays in our ability to fulfill orders, and our failure to estimate customer demand properly may result or could have an adverse impact on our business and operating results and our relationships with customers.\nWe are reliant on our supply chain for components and raw materials to manufacture our products and provide services to our customers, and this reliance could have an adverse impact on our business and operating results. A reduction or interruption in supply, including disruptions due to the COVID-19 pandemic, geopolitical conflicts such as the invasion of Ukraine by Russia and the imposition of international sanctions in response thereto, a significant natural disaster, shortages in global freight capacity, significant increases in the price of critical components and raw materials, a failure to appropriately forecast or adjust our requirements for components or raw materials based on our business needs, or volatility in demand for our products could materially adversely affect our business, operating results, and financial condition and could materially damage customer relationships. Our vendors also may be unable to meet our demand, significantly increase lead times for deliveries, or impose significant price increases that we may be unable to offset through alternate sources of supply, price increases to our customers or increased productivity in our operations.\nWe procure certain components for our products from single or limited suppliers. In the event of supply disruptions from these suppliers, we may not be able to diversify our supply base for such components in a timely manner or may experience quality issues with alternate sources. Further, we procure a significant portion of our components from suppliers located in China, and we are therefore exposed to potential disruptions in deliveries from these suppliers due to political tensions with China, geopolitical risks, government-mandated facility closures in China due to COVID-19 outbreaks, energy shortages or other causes. Our growth and ability to meet customer demand depend in large part on our ability to obtain timely deliveries of components and raw materials from our suppliers, and significant disruptions in their supply could materially adversely affect our business, operating results, and financial condition and could materially damage customer relationships.\nWe currently are experiencing supply shortages and inflationary pressures for certain components and raw materials that are important to our manufacturing process. Growth in the global economy may exacerbate these pressures on us and our\nsuppliers, and we expect these supply chain challenges and cost impacts to continue for the foreseeable future. Although we have generally secured additional supply from existing or alternate suppliers or taken other mitigating actions when such disruptions have occurred in past periods, there is no guarantee we can continue to do so in the future, and our business, results of operations, and financial condition could be adversely affected. When facing component supply-related challenges, we may also increase our inventories and purchase commitments to shorten lead times and ensure adequate inventories to meet customer expectations. If the demand for our products is less than our expectations or if we otherwise fail to anticipate customer demand properly, an oversupply of components could result in inventory levels that could also lead to significant excess and obsolete inventory charges and affect our operating and financial results.\nDeterioration of, or instability in, the domestic and international economy and challenging end-market conditions could impact our ability to grow the business and adversely impact our ability to execute our strategy, financial condition, results of operations and cash flows.\nOur businesses and operating results have been, and will continue to be, affected by domestic and international economic conditions. The level of demand for our products is affected by general economic and business conditions in our served end markets. A substantial portion of our revenues is derived from customers in cyclical industries (such as the industrial and oil & gas sectors) that typically are adversely affected in periods of economic contraction or volatility. In such periods, our customers may experience deterioration of their businesses, which may reduce or delay our sales. We have experienced contraction and challenging demand conditions in many of our served markets historically, and it is reasonably possible that we could experience such conditions in the future which may adversely affect the results of our operations and financial condition.\nDisruptions in global oil markets have adversely affected our business and results of operations and similar events in the future may adversely affect our business and results.\nA portion of our revenues is derived from customers in the midstream and downstream oil & gas industry. Changes in demand for oil due to the disruption caused by the COVID-19 pandemic, the Russia-Ukraine conflict and related sanctions, or other factors can negatively affect oil prices, and negatively affect cash flows for many of those customers. This has resulted in, and in the future could result in, lower capital expenditures and project modifications, delays or cancellations in that end market that may adversely affect the results of our operations and financial condition.\nUncertainty over global tariffs, or the financial impact of tariffs, may negatively affect our results.\nChanges in U.S. domestic and global tariff frameworks have increased our costs of producing goods and resulted in additional risks to our supply chain. We have developed and implemented strategies to mitigate previously implemented and, in some cases, proposed tariff increases, but there is no assurance we will be able to continue to mitigate prolonged tariffs. Further, uncertainties about future tariff changes could result in mitigation actions that prove to be ineffective or detrimental to our business.\nRisks Related to Our Business and Operations\nWe may not be able to fully realize expected cost savings from our ASCEND transformation program and from restructuring actions.\nOn March 23, 2022, we announced the launch of ASCEND, a new transformation program focused on driving accelerated earnings growth and efficiency across the business with the goal of delivering improved annual operating profit once fully implemented. The ASCEND program focuses on the following key initiatives: (i) accelerating organic growth go-to-market strategies, (ii) improving operational excellence and production efficiency by utilizing a lean approach and (iii) driving greater efficiency and productivity in selling, general and administrative expenses. In addition, from time to time, we implement other plans that incur restructuring costs to (i) eliminate redundancies in our corporate or regional structures (ii) eliminate excess capacity in our facilities as a result of integration of acquisitions or divestitures of product lines, or (iii) eliminate product or service lines that do not meet targeted profitability metrics. Although we expect that the improved operating profit, cost savings and realization of efficiencies will offset the related costs of these initiatives and provide additional annual benefit, we may not fully achieve the expected benefits of these efforts (see Note 4, \"Restructuring Charges,\" Note 3. \"ASCEND Transformation Program\" in the notes to the consolidated financial statements and \"Business Update\" within Item 7 for further discussion of the ASCEND program and other current restructuring activities).\nLogistics challenges, including global freight capacity shortages or significant increases in freight costs, could continue to increase our freight costs or cause delays in our ability to fulfill orders and could have an adverse impact on our business and operating results.\nThe Companys ability to import products in a timely and cost-effective manner has been, and may continue to be, adversely affected by the current global shortage of freight capacity, delays at ports, port strikes, and other issues that otherwise affect transportation and warehousing providers. These issues could delay importation of products or require the Company to locate alternative ports or warehousing providers to avoid disruption to customers. These alternatives may not be available on\nshort notice or could result in higher freight and logistics costs, which could have an adverse impact on the Companys business and financial condition.\nCollection risk for receivables in foreign jurisdictions.\nWe sell products and services through distributors and agents. In certain jurisdictions, those third parties represent a significant portion of our sales in their respective country. Collection times for receivables in many foreign jurisdictions may often be substantially longer than those in the United States (though less than one year). Further, for certain of our services business agency relationships, we utilize an intermediary agent and are dependent on our agents to collect payment on our behalf. The indirect sales channels expose us to the credit risk of both our channel partners and end customers and increase the risk of delayed payments or uncollectible balances. A liquidity event or dispute involving one of these channel partners may adversely affect our results of operations and financial condition.\nCybersecurity vulnerabilities, threats and more sophisticated and targeted computer crime could pose a risk to our systems, networks, operations, products, solutions, services and data.\nIncreased global cybersecurity threats, computer viruses and more sophisticated and targeted cyber-related attacks, as well as cybersecurity failures resulting from human error, vulnerabilities and technological errors pose a risk to our systems, operations and products and potentially those of our business partners. An attack also could result in losses due to ransomware payments, security breaches, theft, lost or corrupted data, misappropriation of sensitive, confidential or personal data or information, loss of trade secrets and commercially valuable information, production downtimes and operational disruptions. We attempt to mitigate these risks by employing measures including employee training, network monitoring and testing, maintenance of protective systems, contingency planning, and the engagement of third-party experts but we remain potentially vulnerable to additional known or unknown threats. There is no assurance the financial or operational impact from such threats will not be material.\nA material disruption at a significant manufacturing facility could adversely affect our ability to generate sales and result in increased costs that we cannot recover.\nOur financial performance could be adversely affected due to our inability to meet customer demand for our products or services in the event of a material disruption at one of our significant manufacturing or services facilities. Equipment failures, natural disasters, health issues (including COVID-19), power outages, fires, explosions, terrorism, adverse weather conditions, labor disputes or other influences could create a material disruption. Interruptions to production could increase our cost of sales, harm our reputation and adversely affect our ability to attract or retain our customers. Our business continuity plans may not be sufficient to address disruptions attributable to such risks. Any interruption in production capability could require us to make substantial capital expenditures to remedy the situation, which could adversely affect our financial condition and results of operations.\nOur business operates in highly competitive markets, so we may be forced to cut prices or incur additional costs.\nOur business generally faces substantial competition, domestically and internationally, in our end markets. We may lose market share in certain businesses or be forced to reduce prices or incur increased costs to maintain existing business. We compete globally on the basis of product design, quality, availability, performance and customer service. Present or future competitors in our markets may have new technologies or more attractive products and services or greater financial, technical or other resources which could put us at a competitive disadvantage. In addition, some of our competitors may be willing to reduce prices and accept lower margins to compete with us.\nOur international operations pose political, currency and other risks.\nWe expect sales from and into foreign markets to continue to represent a significant portion of our revenue. In addition, many of our manufacturing operations and suppliers are located outside the United States, including China, the United Kingdom and the Netherlands. Our international operations present significant and varied risks, such as from political tensions among China and the United States, potential temporary closures of our manufacturing and sourcing operations in China, currency exchange rate fluctuations, exposure to local economic and political conditions, export and import restrictions and controls on repatriation of cash. Foreign currency exchange rates result in volatility in our financial results, as over one-third of our sales are generated outside of the United States in currencies other than the U.S. dollar. In addition, United States tax reform has significantly changed how foreign operations are taxed in the United States. Therefore, we continue to review our organizational structure, and changes to where income is generated, may have a material adverse effect on our liquidity and results of operations. To the extent that we expand our international presence, these risks may increase.\nOur customers and other business partners often require terms and conditions that expose us to significant risks and liabilities.\nWe operate in end markets and industries in which our customers and business partners seek to contractually shift significant risks associated with their operations or projects to us. We structure our commercial and contracting practices to\nassess and manage the risks we are assuming, but we cannot assure that material liabilities will not arise from our contracts with our business partners. Also, our contracting standards may be more stringent than those of certain competitors, and as a result, we may experience market share losses or the reduction in growth opportunities.\nImposition of climate-related laws and regulations that disadvantage the oil & gas industry compared to other industries or consumer behavior that reduces demand for petroleum products may have an adverse impact on our results of operations.\nA significant portion of our revenues are derived from the sale of products and services to end users in the oil & gas industry. Accordingly, our results of operations may be adversely affected by the imposition of climate-related laws and regulations that disadvantage the oil & gas industry compared to other industries and have the effect of reducing the production of petroleum products. In addition, a reduction in the production of petroleum products as a result of consumer behavior that embraces alternative sources of energy over oil & gas could similarly adversely affect our results of operations by reducing the demand for our products and services.\nRisks Related to COVID-19\nWe have been and continue to be negatively impacted by the COVID-19 pandemic and its related impacts to our employees, operations, customers and suppliers.\nThe COVID-19 pandemic first had a significant impact on our global operations in the third quarter of fiscal 2020, continues to adversely impact our business and may continue to affect our business in the future. Such impacts include, and could continue to include, reductions in demand for certain of our products and services, the inability of our global teams and suppliers to meet our customers demand, other disruptions of supply chain, restrictions on our employees ability to visit customers, our service technicians ability to travel to job sites, or labor constraints resulting from employee turnover or departures due to resistance to vaccine mandates. Other adverse effects could result from government-imposed mandatory closures of job sites, manufacturing facilities or other important business locations, work-from-home orders, or other such restrictions. Should such conditions occur, persist or increase in severity, they could materially affect our ability to adequately staff and maintain our operations and impact our financial results.\nThe duration and ultimate impact of the COVID-19 pandemic on our business, results of operations and financial condition, including liquidity, capital and financing resources, will depend on numerous evolving factors and future developments. Such factors and developments may include the geographic spread, severity and duration of the COVID-19 pandemic, including whether there are periods of increased COVID-19 cases, disruption to our operations resulting from employee illnesses, the long-term efficacy of vaccines or their effectiveness against variants such as the Omicron variant, governmental responses to outbreaks including health and safety measures, such as mandatory facility closures of non-essential businesses, stay-at-home orders or similar restrictions, social distancing mandates and travel bans, and import and export restrictions, which could disrupt our relationship with customers. If we are unable to respond to and manage the impact of these events, our business and results of operations may be adversely affected.\nAlthough our current accounting estimates contemplate current and expected future conditions, as applicable, it is reasonably possible that actual conditions could differ from our expectations, which could materially affect our results of operations and financial position. In particular, a number of estimates have been and will continue to be affected by the ongoing COVID-19 pandemic. The severity, magnitude and duration of the pandemic, as well as its economic consequences, are uncertain, result in significant volatility for our business and are difficult to predict. As a result, our accounting estimates and assumptions may change over time in response to COVID-19. Such changes could result in future impairments of goodwill, intangible assets, long-lived assets, incremental credit losses on accounts receivable, the valuation of our inventory, or a decrease in the carrying amount of our deferred tax assets. Any of these events could amplify the other risks and uncertainties described herein and could have an adverse effect on our business and financial results.\nRisks Related to the Execution of Our Strategy\nIf we fail to develop new products, or customers do not accept our new products, our business could be adversely affected.\nOur ability to develop innovative new products can affect our competitive position and often requires the investment of significant resources. Difficulties or delays in research, development, production or commercialization of new products, or failure to gain market acceptance of new products and technologies, may reduce future sales and adversely affect our competitive position. There can be no assurance that we will have sufficient resources to make such investments, that we will be able to make the technological advances necessary to maintain competitive advantages or that we can recover major research and development expenses. If we fail to make innovations, launch products with quality problems, experience development cost overruns, or the market does not accept our new products, then our financial condition, results of operations, cash flows and liquidity could be adversely affected.\nOur growth strategy includes strategic acquisitions, which we may not be able to consummate or successfully integrate.\nWe plan to make acquisitions to grow our business, enhance our global market position and broaden our industrial tools product offerings. Our ability to successfully execute acquisitions will be impacted by factors including the availability of financing on terms acceptable to us, the potential reduction of our ability or willingness to incur debt to fund acquisitions, the reluctance of target companies to sell in current markets, our ability to identify acquisition candidates that meet our valuation parameters and increased competition for acquisitions. The process of integrating acquired businesses into our existing operations also may result in unforeseen operating difficulties and may require additional financial resources and attention from management that would otherwise be available for the ongoing development or expansion of our existing operations. Although we expect to successfully integrate any acquired businesses, we may not achieve the desired net benefit in the timeframe planned. Failure to effectively execute our acquisition strategy or successfully integrate the acquired businesses could have an adverse effect on our competitive position, reputation, financial condition, results of operations, cash flows and liquidity.\nWe may not be able to realize planned benefits from acquired companies.\nWe may not be able to realize planned benefits from acquired companies. Achieving those benefits depends on the timely, efficient and successful execution of a number of post-acquisition events, including integrating the acquired business into the Company. Factors that could affect our ability to achieve these benefits include:\ndifficulties in integrating and managing personnel, financial reporting and other systems used by the acquired businesses;\nthe failure of acquired businesses to perform in accordance with our expectations;\nfailure to achieve anticipated synergies between our business units and the business units of acquired businesses;\nthe loss of customers of acquired businesses;\nthe loss of key managers and employees of acquired businesses; or\nother material adverse events in the acquired businesses.\nIf acquired businesses do not operate as we anticipate, it could materially impact our business, financial condition and results of operations.\nThe indemnification provisions of acquisition agreements may result in unexpected liabilities.\nCertain acquisition agreements from past acquisitions require the former owners to indemnify us against certain liabilities related to the operation of each of their companies. In most of these agreements, the liability of the former owners is limited to specific warranties given in the agreement as well as in amount and duration. Certain former owners also may not be able to meet their indemnification responsibilities. We may be subject to the same risk with respect to future acquisitions as well. As a result of those limitations, we may face unexpected liabilities that adversely affect our profitability and financial position.\nDivestitures and discontinued operations could negatively impact our business, and retained liabilities from businesses that we have sold could adversely affect our financial results.\nIn connection with the execution of our strategy to become a pure-play industrial tools and services company, we have completed several divestitures, including the divestiture of our former EC&S segment. These divestitures pose risks and challenges that could negatively impact our business, including retained liabilities related to divested businesses, obligations to indemnify buyers against contingent liabilities and potential disputes with buyers.\nIf we do not realize the expected benefits of these divestitures or our post-completion liabilities and continuing obligations are substantial and exceed our expectations, our financial position, results of operations and cash flows could be negatively impacted. Any divestiture may result in a dilutive impact to our future earnings if we are unable to offset the dilutive impact from the loss of revenue and profits associated with the divestiture, as well as significant write-offs, including those related to goodwill and other intangible assets, which could have a material adverse effect on our results of operations and financial condition.\nOur goodwill and other intangible assets represent a substantial amount of our total assets.\nOur total assets reflect substantial intangible assets, primarily goodwill. As of August 31, 2022, goodwill and other intangible assets totaled $299 million, or 40% of our total assets. The goodwill results from acquisitions, representing the excess of the purchase price over the fair value of the net tangible and other identifiable intangible assets we have acquired. We assess annually, and more frequently if a triggering event occurs, whether there has been impairment in the value of our goodwill or indefinite-lived intangible assets. If future operating performance at one or more of our reporting units were to fall below current levels, we could be required to recognize a non-cash charge to operating earnings to impair the related goodwill or other intangible assets. We recognized $1 million and $6 million in impairment charges in fiscal 2022 and 2021, respectively, related to the goodwill in our Cortland Industrial operating segment (Other Segment) (see Note 7, \"Goodwill, Intangible Assets and Long-Lived Assets\" in the notes to the consolidated financial statements and \"Critical Accounting Estimates\" for further discussion on goodwill, intangible asset and long-lived asset impairments). Any future goodwill or intangible asset impairments could negatively affect our financial condition and results of operations.\nRisks Related to Legal, Compliance and Regulatory Matters\nWe are subject to many laws and regulations that may change in ways that are detrimental to our competitiveness or results.\nOur businesses are subject to regulation under a broad range of U.S. and foreign laws and regulations. Some of those laws and regulations may change in ways that will require us to modify our business practices and objectives in ways that adversely impact our financial condition or results of operations, including by restricting existing activities and products, subjecting our operations to escalating costs or prohibiting us from operating in certain jurisdictions. Examples of laws or regulations that may have an adverse effect on our operations, financial condition and growth strategies include tax law, export and import controls, anti-corruption law, competition law, data privacy regulations, currency controls and economic or political sanctions. In addition, changes in laws or regulations, for example, the proposed regulations of the Securities and Exchange Commission with respect to climate-related disclosures, may significantly increase our costs, adversely affecting our results of operations.\nLegal compliance risks could result in significant costs to our business or cause us to restrict current activities or curtail growth plans.\nWe directly or indirectly operate in industries, markets and jurisdictions in which we are exposed to compliance risks and that are subject to significant scrutiny by regulators, governmental authorities and other persons. We structure and strengthen our risk management and compliance programs to mitigate such risks and foster compliance with all applicable laws, but our practices may not be sufficient to eliminate these risks. The global and diverse nature of our operations, the complex and high-risk nature of some of our markets, our reliance on third-party agents and representatives to support sales and other business activities, and increasingly stringent laws and enforcement activities could result in violations of law, enforcement actions or private litigation resulting in significant defense and investigation costs, fines and penalties, and a broad range of remedial actions, including potential restrictions on our operations and other adverse changes to our business plans. See Note 17, \"Commitments and Contingencies\" in the notes to the consolidated financial statements for additional information about compliance risks.\nHealth, safety and environmental laws and regulations may result in additional costs.\nWe are subject to federal, state, local and foreign laws and regulations governing public and worker health and safety. Violations of these laws could result in significant harm and financial liabilities that could adversely affect our operating results and reputation. Pursuant to such laws, governmental authorities have required us to contribute to the cost of investigating or remediating certain matters at current or previously owned and operated sites. In addition, we have provided environmental indemnities for previously owned operations in connection with the sale of certain businesses and product lines. Liability as an owner or operator, or as an arranger for the treatment or disposal of hazardous substances, can be joint and several and can be imposed without regard to fault. There is a risk that costs relating to these matters could be greater than what we currently expect or exceed our insurance coverage, or that additional remediation and compliance obligations could arise which require us to make material expenditures. More stringent environmental laws, unanticipated remediation requirements or the discovery of previously unknown conditions could materially harm our financial condition and operating results. We are also required to comply with environmental laws and regulations to maintain operating permits and licenses, some of which are subject to discretionary renewal from time to time, for many of our businesses, and our business operations could be restricted if we are unable to renew existing permits or to obtain any additional permits that we may require.\nUnfavorable tax law changes may adversely affect results.\nWe are subject to income taxes in the United States and in various foreign jurisdictions. Domestic and international tax liabilities are subject to the allocation of income among various tax jurisdictions. Our effective tax rate could be adversely affected by changes in tax law (including a potential increase in the U.S. federal income tax rate), the mix of earnings among countries with differing statutory tax rates, or changes in the valuation allowance of deferred tax assets.\nCosts and liabilities arising from legal proceedings could be material and adversely impact our financial results.\nWe are subject to legal and regulatory proceedings, including litigation asserting product liability and warranty claims. We maintain insurance and have established reserves for these matters as appropriate and in accordance with applicable accounting standards and practices. Insurance coverage, to the extent it is available, may not cover all losses arising from such contingencies. Also, estimating legal reserves or possible losses involves significant judgment and may not reflect the full range of uncertainties and unpredictable outcomes inherent in litigation and investigations, and the actual losses arising from particular matters may exceed our current estimates and adversely affect our results of operations. We also expect that additional legal proceedings and other contingencies will arise from time to time, and we cannot predict the occurrence, magnitude and outcome of such additional matters. Moreover, we operate in jurisdictions where claims involving us may be adjudicated within legal systems that are less developed and less reliable than those of the U.S. or other more developed markets, and this can create additional uncertainty about the outcome of proceedings before courts or other governmental bodies in such markets.\nRisks Related to Our Capital Structure\nOur indebtedness could harm our operating flexibility and competitive position.\nWe have incurred, and may in the future incur, significant indebtedness in connection with acquisitions or other strategic growth initiatives. While at current debt levels we have significant flexibility on our financial debt covenants, should we incur additional indebtedness to fund acquisitions or other strategic growth initiatives, our level of debt and the limitations imposed on us by our debt agreements could adversely affect our operating flexibility and put us at a competitive disadvantage.\nOur ability to make scheduled principal and interest payments, refinance our indebtedness and satisfy our other debt and lease obligations will depend upon our future operating performance and credit market conditions, which could be adversely affected by factors beyond our control. In addition, there can be no assurance that future borrowings or equity financings will be available to us on favorable terms, or at all, for the payment or refinancing of our indebtedness. If we are unable to service our indebtedness, our business, financial condition and results of operations will be adversely affected.\nThe financial and other covenants in our debt agreements may adversely affect us.\nOur senior credit facility contains financial and other restrictive covenants. These covenants could limit our financial and operating flexibility as well as our ability to plan for and react to market conditions, meet our capital needs and support our strategic priorities and initiatives should we take on additional indebtedness for acquisition or other strategic objectives. Our failure to comply with these covenants also could result in events of default which, if not cured or waived, could require us to repay indebtedness before its due date, and we may not have the financial resources or otherwise be able to arrange alternative financing to do so. Our compliance with the covenants of our senior credit facility may be adversely affected by severe market contractions or disruptions to the extent they reduce our earnings for a prolonged period and we are not able to reduce our debt levels or cost structure accordingly. Borrowings under our senior credit facility are secured by most domestic personal property assets and are guaranteed by most of our domestic subsidiaries and by a pledge of the stock of most of our domestic and certain foreign subsidiaries. If borrowings under our senior credit facility were declared or became due and payable immediately as the result of an event of default and we were unable to repay or refinance those borrowings, our lenders could foreclose on the pledged assets and stock. Any event that requires us to repay any of our debt before it is due could require us to borrow additional amounts at unfavorable borrowing terms, cause a significant reduction in our liquidity and impair our ability to pay amounts due on our indebtedness. Moreover, if we are required to repay any of our debt before it becomes due, we may be unable to borrow additional amounts or otherwise obtain the cash necessary to repay that debt, when due, which could have a material adverse effect on our business, financial condition and liquidity.\nGeneral Risk Factors\nGeopolitical unrest and terrorist activities may cause the economic conditions in the U.S. or abroad to deteriorate, which could harm our business.\nTerrorist attacks against targets in the U.S. or abroad, rumors or threats of war, other geopolitical activity or trade disruptions, such as those caused by the Russia-Ukraine conflict or any conflict or threatened conflict between China and Taiwan, may cause general economic conditions in the U.S. or abroad to deteriorate. The occurrence of any of these events could result in a prolonged economic slowdown or recession in the U.S. or in other areas and could have a significant impact on our business, financial condition or results of operations.\nOur inability to attract, develop and retain qualified employees could have a material adverse impact on our operations.\nOur ability to deliver financial results and drive growth and pursue competitive advantages in our business substantially depends on our ability to retain key employees and continually attract new talent to the business. If we experience losses of key employees, such as our executives, or experience significant delays or difficulty in replacing them, our operations, competitive position and financial results may be adversely affected. Competition for highly qualified personnel is intense, and our competitors and other employers may attempt to hire our skilled and key employees. Additionally, we need qualified managers and skilled employees with technical and manufacturing industry experience to operate our businesses successfully. From time to time there may be shortages of skilled labor which may make it more difficult and expensive for us to attract and retain qualified employees or lead to increased labor costs.\nOur intellectual property portfolio may not prevent competitors from developing products and services similar to or duplicative to ours, and the value of our intellectual property may be negatively impacted by external dependencies.\nOur patents, trademarks and other intellectual property may not prevent competitors from independently developing or selling products and services functionally equivalent or superior to our own or adequately deter misappropriation or improper use of our innovations and technology. In addition, further steps we take to protect our intellectual property, including non-disclosure agreements, may not prevent the misappropriation of our business critical secrets and information. In such circumstances, our competitive position and the value of our brand may be negatively impacted.\nOur competitors or other persons could assert that we have infringed their intellectual property rights.\nWe may be the target of enforcement of patents or other intellectual property rights by third parties. We have implemented legal reviews and other controls in our new product development and marketing processes system to mitigate the risk of infringing third-party rights, but those controls may not prove adequate or deter all claims. Responding to infringement claims, regardless of their merits, can be expensive and time consuming. If we are found to infringe any third-party rights, we could be required to pay substantial damages or we could be enjoined from offering some of our current products and services. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of August 31, 2022, we owned or leased the following facilities (square footage in thousands):\nNumber of Locations Square Footage\nDistribution /\nSales /\nAdmin\nManufacturing Total Owned Leased Total\nIndustrial Tools & Services 9 32 41 132 962 1,094\nCorporate and Other 4 1 5 26 235 261\n13 33 46 158 1,197 1,355\nWe consider our facilities suitable and adequate for the purposes for which they are used and do not anticipate difficulty in renewing existing leases as they expire or in finding alternative facilities. Our largest facilities are located in the United States, the United Kingdom, the Netherlands, China and Spain. We also maintain a presence in Algeria, Australia, Brazil, France, Germany, Kazakhstan, India, Italy, Japan, Norway, Poland, Saudi Arabia, Singapore, South Africa, South Korea and the United Arab Emirates. See Note 11, Leases in the notes to the consolidated financial statements for information regarding our lease commitments. Item 3. Legal Proceedings\nWe are a party to various legal proceedings that have arisen in the normal course of business. These legal proceedings typically include product liability, breaches of contract, employment, personal injury and other disputes.\nWe have recorded reserves for estimated losses based on the specific circumstances of each case. Such reserves are recorded when it is probable that a loss has been incurred as of the balance sheet date and the amount of the loss can be reasonably estimated. In our opinion, the resolution of these contingencies is not likely to have a material adverse effect on our financial condition, results of operations or cash flows. Information with respect to contingencies arising from legal proceedings, including governmental investigations, set forth in Note 17, Commitments and Contingencies in the notes to the consolidated financial statements is incorporated by reference. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities\nThe Companys Class A common stock is traded on the New York Stock Exchange under the symbol EPAC. As of September 30, 2022, there were 934 shareholders of record of the Company's Class A common stock.\nDividends\nIn fiscal 2022, the Company declared a dividend of $0.04 per share of Class A common stock payable on October 17, 2022 to shareholders of record on October 7, 2022. In fiscal 2021, the Company declared a dividend of $0.04 per share of Class A common stock payable on October 18, 2021 to shareholders of record on October 1, 2021.\nShare Repurchases\nThe Company's Board of Directors has authorized the repurchase of shares of the Company's common stock under publicly announced share repurchase programs. Since the inception of the initial share repurchase program in fiscal 2012, the Company has repurchased 26,558,965 shares of common stock for $743 million. In March 2022, the Company's Board of Directors rescinded its prior share repurchase authorization and approved a new share repurchase program authorizing the repurchase of a total of 10,000,000 shares of the Company's outstanding common stock. As of August 31, 2022, the maximum number of shares that may yet be purchased under this authorization is 6,240,265 shares. The following table summarizes share repurchases during the fourth quarter of fiscal 2022, all of which were purchased under publicly announced share repurchase programs.\nPeriod Shares Repurchased Average Price Paid per Share Maximum Number of Shares That May Yet Be Purchased Under the Program\nJune 1 to June 30, 2022 689,768 $ 19.94 7,555,157\nJuly 1 to July 31, 2022 1,314,892 19.01 6,240,265\nAugust 1 to August 31, 2022 - - 6,240,265\n2,004,660 $ 19.36\nPerformance Graph:\nThe graph and table below compare the cumulative 5-year total return of the Company's common stock with the cumulative total returns of the Russell 2000 Index and the S&P 600 Industrial Index. They assume that the value of the investment in our common stock for the last trading day of each fiscal year, in each index, and in the peer group (in each case, including reinvestment of dividends) was $100 on August 31, 2017 and tracks it through August 31, 2022.\n*$100 Invested on 8/31/17 in stock or index, including reinvestment of dividends.\nFiscal year ending August 31.\nCopyright© 2022 Standard & Poor's, a division of S&P Global. All rights reserved.\nCopyright© 2022 Russell Investment Group. All rights reserved.\n8/17 8/18 8/19 8/20 8/21 8/22\nEnerpac Tool Group Corp. $ 100.00 $ 122.64 $ 92.63 $ 86.90 $ 105.35 $ 81.39\nRussell 2000 Index 100.00 125.45 109.27 115.85 170.40 139.92\nS&P 600 Industrial Index 100.00 137.90 118.75 123.44 178.72 165.78\nThe stock price performance included in this graph is not necessarily indicative of future stock price performance. Item 6. Reserved Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following Managements Discussion and Analysis is intended to assist the reader in understanding our results of operations and financial condition. Managements Discussion and Analysis is provided as a supplement to, and should be read in conjunction with, our audited consolidated financial statements that are included in Item 8. \"Financial Statements and Supplementary Data\".\nBackground\nThe Company has one reportable segment, Industrial Tools & Service (\"IT&S\"). This segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools, as well as providing services and tool rental to the industrial, maintenance, infrastructure, oil & gas, alternative energy and other markets. Financial information related to the Company's reportable segment is included in Note 16, \"Business Segment, Geographic and Customer Information\" in the notes to the consolidated financial statements.\nBusiness Update\nOur businesses provide an array of products and services across multiple markets and geographies which results in significant diversification. The IT&S segment and the Company are well-positioned to drive shareholder value through a sustainable business strategy built on well-established brands, broad global distribution and end markets, clear focus on the core tools and services business and disciplined capital deployment.\nOur Business Model\nOur long-term goal is to create shareholder value and best in class returns through growth of our core businesses, driving efficiency and profitability, generating strong cash flow, and being disciplined in the deployment of our capital. We intend to leverage our strong brand, market positions, and dealer and distribution networks to generate organic core sales growth that exceeds end-market growth rates. our plan is to accomplish organic growth through a combination of market-share capture and product innovation, as well as market expansion into new vertical markets, emerging industries and new geographic regions. In addition to organic growth, we also focus on profit margin expansion by utilizing continuous improvement techniques to drive productivity and lower costs and by enacting routine pricing initiatives to generate price realization and offset cost increases, such as commodity and tariff increases and general inflation. Finally, cash flow generation is critical to achieving our financial and long-term strategic objectives. We expect to achieve strong cash flow generation by maximizing returns on assets and minimizing primary working capital needs. The cash flow that results from efficient asset management and improved profitability is used to fund internal growth opportunities, pay down of debt, opportunistic returns for shareholders, and strategic acquisitions.\nGeneral Business Update\nIn March 2022, the Company announced the start of its ASCEND transformation program (ASCEND). ASCENDs key initiatives include accelerating organic growth go-to-market strategies, improving operational excellence and production efficiency by utilizing a Lean approach, and driving greater efficiency and productivity in selling, general and administrative expense by better leveraging resources to create a more efficient and agile organization. The program is expected to be executed over roughly 24 to 36 months. The Company expects that it will deliver an incremental $40-$50 million of annual operating profit from the execution of ASCEND, with the full run rate of operating profit expected to be reflected in its results as it exits fiscal 2024 and fully incorporated into its fiscal 2025 projections. Enerpac anticipates investing approximately $60-$65 million over the life of the program to support the ASCEND initiatives. Such investment is expected to include consulting costs to aid in the development and execution of the program, capital expenditures and restructuring costs.\nIn June 2022, the Company approved a restructuring plan in connection with the initiatives identified as part of the ASCEND transformation program (see Note 3, ASCEND Transformation Program in the notes to the consolidated financial statements) to drive greater efficiency and productivity in global selling, general and administrative resources. The total costs of this plan were then estimated at $6 to $10 million, constituting predominately severance and other employee-related costs to be incurred as cash expenditures and impacting both IT&S and Corporate. On September 23, 2022, the Company approved an updated restructuring plan. The costs of this updated plan (which includes the amounts for the plan approved in June) are estimated at $10 to $15 million. These costs are expected to be incurred over the expected duration of the transformation program, ending in the fourth quarter of fiscal year 2024.\nCommencing in February 2022, in response to the armed conflict in Ukraine, many countries, including the member countries of NATO initiated a variety of sanctions and export controls targeting Russia and associated entities. Approximately 1% of our historical annual sales are to customers and distributors associated with Russia and we had approximately $0.5\nmillion of receivables associated with those customers and distributors as of February 28, 2022. The sanctions currently in place limit our ability to provide goods to those customers and distributors and banking sanctions effectively negate our ability to collect those receivables; as such, we recorded a full allowance for doubtful accounts against those receivables as of February 28, 2022 and indefinitely suspended doing business in Russia. We will continue to monitor the situation with Russia to assess when and if we are able to resume business with those customers and distributors, including collection of the outstanding receivables. We also continue to monitor and manage the ancillary impact of the Russia crisis on our business, which is primarily related to supply chain, increased commodity and energy costs, foreign exchange rate volatility and dealer confidence particularly in Europe.\nDuring the year ended August 31, 2022, the Company recorded through bad debt expense (included in \"Selling, general and administrative expenses\" in the Condensed Consolidated Statements of Earnings) a reserve of $13.2 million to fully reserve for the outstanding accounts receivable balance for an agent in our Middle East/North Africa/Caspian (\"MENAC\") region. The allowance for doubtful accounts for this particular agent as of August 31, 2022 represents management's best estimate of the probable amount of collection and considers various factors with respect to this matter, including, but not limited to, (i) the lack of payment by the agent since the fiscal quarter ended February 28, 2021, (ii) our due diligence on balances due to the agent from its end customers related to sales of our services and products and the known markup on those sales from the agent to end customers, (iii) the status of ongoing negotiations with the agent to secure payments and (iv) legal recourse available to us to secure payment. Actual collections from the agent may differ from the Company's estimate. We have completely ceased our relationship with this agent and have transitioned to serving our regional customers through recently created direct operations within the region.\nDuring largely the second half of fiscal 2020 and through the first three quarters of fiscal 2021, our business, like many others around the world, experienced significant negative financial impacts from the COVID-19 pandemic. Beginning in the third quarter of fiscal 2021, we returned to year-over-year core growth in all regions. Throughout fiscal 2022, we experienced strong growth in most regions that we operate, however, there were still regions that were impacted by the lingering effects of the pandemic, most notably on our European service business and Chinese operations in the second quarter and third quarter of fiscal 2022, respectively. Our key manufacturing facilities continue to operate with additional precautions in place to ensure the safety of our employees and prevent production disruptions. Increased demand due to global economies returning to more normalized levels and pandemic-related factors significantly stressed the global supply chain and created challenges in freight lines and the overall logistics environment. This led to increased raw material, components and logistics costs, as well as longer lead times on orders. We continue to closely monitor our supply chain in order to ensure we can maintain competitive lead times and deliver products to customers timely.\nOn October 31, 2019, the Company completed the previously announced sale of its former EC&S segment to wholly owned subsidiaries of BRWS Parent LLC, a Delaware limited liability company and affiliate of One Rock Capital Partners II, LP, for a purchase price of approximately $216 million (inclusive of final working capital adjustments), with approximately $3 million which was due in four equal quarterly installments, the last of which was received in the first quarter of 2021. The EC&S segment is treated as discontinued operations in our financial statements for all periods.\nDespite pandemic-related demand challenges, the supply chain and logistics challenges we are currently experiencing, and the impact of the Ukraine conflict and the associated sanctions on Russia, our balance sheet remains strong and the Company continues to focus on the execution of our strategic growth initiatives in the markets we serve. We remain focused on new product development, driving organic growth and pursuing disciplined acquisition opportunities.\nHistorical Financial Data (dollars in millions)\nYear Ended August 31,\n2022 2021 2020\nStatements of Earnings Data: (1)\nNet sales $ 571 100 % $ 529 100 % $ 493 100 %\nCost of products sold 306 54 % 286 54 % 276 56 %\nGross profit 265 46 % 243 46 % 217 44 %\nSelling, general and administrative expenses 217 38 % 175 33 % 181 37 %\nAmortization of intangible assets 7 1 % 8 2 % 8 2 %\nRestructuring charges 8 1 % 3 1 % 7 1 %\nImpairment & divestiture charges (benefit) 2 0 % 6 1 % (3) (1) %\nOperating profit 31 5 % 51 10 % 24 5 %\nFinancing costs, net 4 1 % 5 1 % 19 4 %\nOther expense (income), net 2 0 % 2 0 % (3) (1) %\nEarnings before income tax expense 24 4 % 44 8 % 8 2 %\nIncome tax expense 4 1 % 4 1 % 2 0 %\nNet earnings $ 20 3 % $ 40 8 % $ 6 1 %\nOther Financial Data: (1)\nDepreciation $ 12 $ 13 $ 12\nCapital expenditures 8 12 12\n(1) Results are from continuing operations and exclude the financial results of previously divested businesses reported as discontinued operations. Except per share amounts, the summation of the individual components may not equal the total due to rounding.\nFiscal 2022 compared to Fiscal 2021\nConsolidated net sales from continuing operations in fiscal 2022 were $571 million, 8% higher than the prior-year sales of $529 million with the impact from foreign currency rates unfavorably impacting sales by roughly $15 million or 3%. \"Core sales,\" which excludes the impact of foreign currency changes and the impact from recent acquisitions and divestitures to net sales, increased $57 million or 11%. The product pricing actions that the Company took beginning in late fiscal 2021 and during fiscal 2022 in response to significant inflationary pressures on commodities, freight and energy costs coupled with year-over-year product volume growth largely in the first half of fiscal 2022, as prior year fiscal 2021 first half sales were still impacted by the COVID-19 pandemic, were the primary drivers of the increase in net sales. Gross profit as a percentage of net sales in fiscal 2022 of 46% remained relatively flat with fiscal 2021, with improved gross profit margins on product primarily due to the aforementioned pricing actions outweighing the impact of inflation and improved productivity in our manufacturing facilities being offset by lower service gross profit margins due to lower service utilization as a result of the Russia-Ukraine conflict and the mix of service work performed year over year.\nOperating profit was $20 million lower in fiscal 2022 as compared to fiscal 2021 predominantly due to $42 million of incremental selling, general and administrative (\"SG&A\") expenses offset by a $22 million increase in gross profit, as described above. The increase in SG&A is due to ASCEND transformation program charges of $14 million related primarily to the use of external services for the support in the design, development and execution of the program; discrete bad debt charges of approximately $14 million associated with the significant delinquency in payments from a MENAC region agent and for Russian customers and distributors; incremental leadership transition & board search charges of $8 million; charges of $3 million related to external support for the deep-dive holistic business review prior to the launch of the ASCEND program; and roughly $3 million of higher travel and entertainment costs tied to more commercial and leadership travel as we exited the COVID-19 pandemic. Restructuring charges increased $6 million as compared to the prior period as a result of charges to streamline and flatten the organizational structure ($3 million), as well as ASCEND-related restructuring expenses ($3 million).\nFiscal 2021 compared to Fiscal 2020\nConsolidated net sales from continuing operations in fiscal 2021 were $529 million, 7% higher than the prior-year sales of $493 million. Core sales increased $27 million (5%) and divested product lines and the strategic exits of certain service offerings, net of sales from acquisitions, decreased net sales $2 million (1%), while the impact from foreign currency rates favorably impacted sales by 2%. The COVID-19 pandemic had a detrimental impact on our core sales in the third and fourth quarter of fiscal 2020. Sales in the first and second quarter of fiscal 2021 still were COVID-19 impacted, however, not to the same extent as we saw in the third and fourth quarters of fiscal 2020. The third and fourth quarter of fiscal 2021 saw more of a return to normalcy in our core product sales, driving the overall increase in core sales from fiscal 2020 to fiscal 2021. Gross profit margins increased 2% year over year as a result of the increase in volumes, leading to greater absorption of overhead, and a strong mix of product and service sales. Operating profit was $27 million higher in fiscal 2021 as compared to fiscal 2020 predominantly as a result of the $26 million increase in gross profit. SG&A also decreased approximately $6 million, leading to the increase in operating profit, as a result of the recognition of a gain on the sale of a manufacturing facility in China. Restructuring savings realized in fiscal 2021 were able to offset the short-term cost reduction actions taken in the third and fourth quarter of fiscal 2020 in response to the COVID-19 pandemic (i.e., termination of our fiscal 2020 bonus program and furloughs and other temporary wage reduction programs.) The savings in SG&A were nearly offset by an increase in impairment and divestiture charges recorded in fiscal 2021, specifically the $6 million goodwill impairment charge associated with the Cortland Industrial reporting unit (Other Segment). Financing costs also decreased in fiscal 2021 due to continued benefit from the cash pay off of our outstanding term loan in fiscal 2020, the rate benefit from the retirement of our senior notes in the fourth quarter of fiscal 2020 through drawing on our revolving credit facility, and the paydown of $56 million of principal on our outstanding credit facility in fiscal 2021 through utilization of cash from operations.\nSegment Results\nIT&S Segment\nThe IT&S segment is a global supplier of branded hydraulic and mechanical tools and services to a broad array of end markets, including infrastructure, industrial maintenance, repair, and operations, oil & gas, mining, alternative and renewable energy, and civil construction markets. Its primary products include branded tools, cylinders, pumps, hydraulic torque wrenches, highly engineered heavy lifting technology solutions and other tools (Product product line). On the service and rental side, the segment provides maintenance and manpower services to meet customer-specific needs and rental capabilities for certain of our products (Service & Rental product line). The following table sets forth the results of operations for the IT&S segment (dollars in millions):\nYear Ended August 31,\n2022 2021 2020\nNet Sales $ 527 $ 493 $ 455\nOperating Profit 79 82 66\nOperating Profit % 14.9 % 16.6 % 14.4 %\nFiscal 2022 compared to Fiscal 2021\nFiscal 2022 IT&S segment net sales increased by $34 million (7%) from fiscal 2021 to $527 million, which included a $15 million or 3% unfavorable impact on sales due to changes in foreign currency exchange rates. Core sales increased $49 million (10%) year-over-year. The increase in core sales was predominantly attributable to the continued global market recovery from the COVID-19 pandemic resulting in incremental product volume growth largely in the first half of the fiscal year coupled with the impact from pricing actions taken in late fiscal 2021 and during fiscal 2022 due to the significant inflation affecting commodity, freight and energy costs.\nFiscal 2022 operating profit decreased $3 million (4%) from the prior year. The operating profit decrease was a result of a $14 million increase in SG&A primarily due to discrete bad debt charges of approximately $14 million associated with the significant delinquency in payments from a MENAC region agent and for Russian customers and distributors offset by a $15 million increase in gross profit due to pricing actions outweighing the impact of inflation and improved productivity in our manufacturing facilities being offset by lower service gross profit margins due to lower service utilization as a result of the Russia-Ukraine conflict and the mix of service work performed year over year.\nFiscal 2021 compared to Fiscal 2020\nFiscal 2021 IT&S segment net sales increased by $38 million (8%) from fiscal 2020 to $493 million. Core sales increased $29 million (7%) year-over-year. The net sales increase included a $2 million (1%) decrease from strategic exits and divestitures of non-core product lines, acquisitions in fiscal 2021, and a 2% favorable impact on sales due to changes in foreign currency exchange rates. The 10% increase in core sales was predominantly a result of broad-based market recovery, as our largest regions of the world returned to more normalized levels of activity in the second half of fiscal 2021.\nFiscal 2021 operating profit increased $16 million (25%) from the prior year. The operating profit increase was a result of a $24 million increase in gross profit as a result of the increased sales volumes, offset by the $8 million increase in SG&A expenses. The increase in SG&A expenses resulted from increased sales commissions, the cost of our fiscal 2021 bonus plan (the fiscal 2020 bonus plan was eliminated in response to the COVID-19 pandemic) and other discretionary spending cuts and government subsidy programs that provided a benefit in fiscal 2020, partially offset by the benefit of the restructuring plan first announced in March 2019 and expanded in fiscal 2020.\nCorporate\nCorporate consists of selling, general and administrative costs and expenses, including executive, legal, finance, human resources, and information technology, that are not allocated to the segments based on their nature. Corporate expenses were $49 million in fiscal 2022 compared to $20 million in fiscal 2021. The increase of $29 million is a result of the ASCEND transformation program charges ($13 million), business review charges related to external support for the deep dive-holistic business review prior to the launch of ASCEND ($3 million), leadership transition & board search charges ($8 million) and an increase in restructuring charges to streamline and flatten the corporate structure ($1 million), as well as ASCEND-related restructuring expenses ($1 million).\nCorporate expenses were $20 million in fiscal 2021 as compared to $38 million in fiscal 2020. The decrease of $18 million is a result of the realization of savings from restructuring actions, the elimination of costs retained after the EC&S divestiture that were required to support the transition services agreement entered into as part of that sale, the reduction in business development costs and the gain, net of transaction costs and value-added taxes, resulting from the sale of our facility in China.\nNet financing costs were $4 million, $5 million and $19 million in fiscal 2022, 2021 and 2020, respectively. The decrease in net financing costs in fiscal 2022 as compared to fiscal 2021 was due to the year-over-year increase in interest income due to greater short-term investment of excess cash in fiscal 2022. Fiscal 2021 net financing costs decreased as a result of the cash pay off of our outstanding term loan in November 2019, the retirement of the 5.625% senior notes in June 2020 through drawing on our revolving line of credit, resulting in a lower interest rate on our outstanding long-term debt, and the reduction of the principal on our outstanding credit facility by $56 million in fiscal 2021 through utilization of cash from operations.\nIncome Tax Expense\nThe Company's income tax expense is impacted by a number of factors, including, among others, the amount of taxable earnings generated in foreign jurisdictions with tax rates that are different than the U.S. federal statutory rate, permanent items, state tax rates, changes in tax laws, acquisitions and divestitures and the ability to utilize various tax credits and net operating loss carryforwards. Income tax expense also includes the impact of provision to tax return adjustments, changes in valuation allowances and reserve requirements for unrecognized tax benefits. Pre-tax earnings, income tax expense and effective income tax rate from continuing operations for the past three fiscal years were as follows (dollars in thousands):\nYear Ended August 31,\n2022 2021 2020\nEarnings before income tax expense $ 23,992 $ 43,975 $ 7,849\nIncome tax expense 4,401 3,763 2,292\nEffective income tax rate 18.3 % 8.6 % 29.2 %\nThe comparability of pre-tax earnings, income tax expense and the related effective income tax rates are impacted by impairment and other divestiture charges and benefits as well as the Coronavirus Aid, Relief and Economic Security Act (CARES Act), which was enacted on March 27, 2020. Fiscal 2022 and 2021 results included $2 million and $6 million of impairment and divestiture charges, respectively, and a $3 million impairment and divestiture benefit in fiscal 2020. A substantial portion of these charges (benefits) do not result in a tax expense or benefit. The fiscal 2022 tax provision included a tax benefit of $3 million related global tax planning initiatives resulting from certain prior-year business losses for which no benefits were previously recognized. The fiscal 2021 tax provision included a tax benefit of $8 million related to the lapse of statute of limitations on uncertain tax positions and a $4 million tax benefit related to the net operating loss carryback provision of the CARES Act as compared to a $3 million tax benefit in fiscal 2020 driven by legislative changes.\nBoth the fiscal 2022 and prior-year income tax provisions were impacted by the mix of earnings in foreign jurisdictions with income tax rates different than the U.S. federal income tax rate and income tax benefits from global tax planning initiatives. The fiscal 2022 effective tax rate was 18.3%, which is significantly higher than the fiscal 2021 effective tax rate of 8.6%. The fiscal 2022 effective tax rate was lower than the statutory 21% primarily as a result of the one-time tax benefits related to global tax planning initiatives that will not repeat in future periods due to certain tax attributes that are no longer available.\nItems Impacting Comparability\nOn January 7, 2020, the Company acquired the stock of HTL Group (\"HTL\"), a provider of controlled bolting products, calibration and repair services, and tool rental services, which contributed net sales of $11 million, $14 million and $6 million in fiscal 2022, 2021 and 2020, respectively. During fiscal 2020, the Company completed the sale of the UNI-LIFT and Connectors product lines, as well as the Milwaukee Cylinder business, which contributed combined net sales of $3 million for the year ended August 31, 2020.\nLiquidity and Capital Resources\nAt August 31, 2022, cash and cash equivalents were $121 million, comprised of $119 million of cash held by foreign subsidiaries and $2 million held domestically. The following table summarizes the cash flow attributable to operating, investing and financing activities (in millions):\nYear Ended August 31,\n2022 2021 2020\nNet cash provided by (used in) operating activities $ 52 $ 54 $ (3)\nNet cash (used in) provided by investing activities (7) 13 176\nNet cash used in financing activities (52) (82) (239)\nEffect of exchange rate changes on cash (12) 2 7\nNet decrease in cash and cash equivalents $ (20) $ (12) $ (59)\nCash flow provided by operations was $52 million and $54 million in fiscal 2022 and 2021, respectively. The decrease of $2 million in cash flow provided by operations was the result of $19 million lower net earnings from continuing operations offset by approximately $14 million of incremental receivable reserves to reconcile net earnings from continuing operations to net cash provided by operating activities. We used $7 million of cash in investing activities in the current year as compared to $13 million cash provided by investing activities in the prior-year period. The cash used in fiscal 2022 was primarily used for capital expenditures. The cash provided by investing activities in fiscal 2021 was largely generated due to the receipt of proceeds from the sale of our manufacturing facility in China ($22 million) and the death benefit for life insurance on legacy officers of the Company ($3 million), offset by approximately $12 million of capital expenditures. In fiscal 2022, our cash used in financing activities was primarily from the purchase of treasury shares of $75 million and the paydown of principal on our revolving credit facility of $60 million partially offset by the borrowing on the revolving credit facility of $85 million. The cash used in financing activities in fiscal 2021 was primarily for the paydown of $90 million of principal on our outstanding credit facility with cash provided by operating activites and excess cash on hand.\nCash flow provided by operations was $54 million in fiscal 2021, an increase of $57 million from the prior year due to a\n$20 million increase in cash flows from discontinued operations driven by the timing of the divestiture of the EC&S segment in\nfiscal 2020 and an increase in net earnings from continuing operations of $35 million year over year. We generated $13 million\nof cash from investing activities in the current year as compared to $176 million in the prior-year period. The cash provided in\nfiscal 2020 was primarily generated from the sale of our EC&S segment as well as our Connectors and UNI-LIFT product lines,\nslightly offset by cash used for capital expenditures. In fiscal 2021, we sold our manufacturing facility in China for\napproximately $22 million and received approximately $3 million in proceeds associated with the death benefit for life\ninsurance on legacy officers of the Company, which was offset by approximately $12 million of capital expenditures in the\nfiscal year. In fiscal 2021, our cash used in financing activities was primarily from the paydown of $80 million of principal on\nour outstanding credit facility with cash from operations and excess cash on hand.\nThe Company's senior credit facility is comprised of a $400 million revolving line of credit and a $200 million term loan which were scheduled to mature in March 2024 (see Note 8, \"Debt\" in the notes to the consolidated financial statements for further details of the senior credit facility). The Company paid off the outstanding principal balance on the term loan in November 2019. In June 2020, the Company borrowed $295 million under the senior credit facility revolving line of credit to fund the redemption of all of its then outstanding Senior Notes at par, plus the remaining accrued and unpaid interest, to reduce interest costs. Outstanding borrowings under the senior credit facility revolving line of credit were $200 million as of August 31, 2022. The unused credit line and amount available for borrowing under the revolving line of credit was $191 million at August 31, 2022.\nOn September 9, 2022, the Company refinanced its credit facility resulting in a new $600 million senior credit facility, comprised of a $400 million revolving line of credit and a $200 million term loan, which will mature in September 2027. See Note 18, \"Subsequent Event\" in the notes to the consolidated financial statements for further details.\nWe believe that the revolver, combined with our existing cash on hand and anticipated operating cash flows, will be adequate to meet operating, debt service, acquisition and capital expenditure funding requirements for the foreseeable future.\nPrimary Working Capital Management\nWe use primary working capital as a percentage of sales as a key metric for working capital efficiency. We define this metric as the sum of net accounts receivable and net inventory less accounts payable, divided by the past three months' sales annualized. The following table shows the components of our primary working capital (dollars in millions):\nAugust 31, 2022 August 31, 2021\n$ PWC % $ PWC %\nAccounts receivable, net $ 107 18 % $ 103 18 %\nInventory, net 84 14 % 75 13 %\nAccounts payable (73) (12) % (62) (11) %\nNet primary working capital $ 118 20 % $ 116 20 %\nTotal primary working capital was $118 million at August 31, 2022, which increased from $116 million at August 31, 2021. The primary working capital increase related to increased accounts receivable as a result of higher sales in the fourth quarter of fiscal 2022 compared to the fourth quarter of fiscal 2021 and due to $9 million of higher inventory as we continue to work through supply chain issues. Higher inventory levels, specifically the purchase of inventory, was the driver of the $11 million of incremental accounts payable as of August 31, 2022 compared to August 31, 2021.\nCapital Expenditures\nThe majority of our manufacturing activities consist of assembly operations. We believe that our capital expenditure requirements are not as extensive as other industrial companies given the nature of our operations. Capital expenditures associated with continuing operations were $8 million for 2022 and $12 million in both fiscal 2021 and 2020.\nCommitments and Contingencies\nGiven our desire to allocate cash flow and revolver availability to fund growth initiatives, we have historically leased most of our facilities and some operating equipment. We lease certain facilities, computers, equipment and vehicles under various operating lease agreements, generally over periods ranging from one to twenty years. Under most arrangements, we pay the property taxes, insurance, maintenance and expenses related to the leased property. Many of our leases include provisions that enable us to renew the leases at contractually agreed rates or, less commonly, based upon market rental rates on the date of expiration of the initial leases.\nWe are contingently liable for certain lease payments under leases within businesses we previously divested or spun-off. If any of these businesses do not fulfill their future lease payment obligations under a lease, we could be liable for such obligations, however, the Company does not believe it is probable that it will be required to satisfy these obligations. Future minimum lease payments for these leases at August 31, 2022 were $4 million with monthly payments extending to fiscal 2025.\nWe had outstanding letters of credit totaling $11 million and $12 million at August 31, 2022 and 2021, respectively, the majority of which relate to commercial contracts and self-insured workers' compensation programs.\nAdditional detail regarding contingencies is included in Note 17, \"Commitments and Contingencies\" in the notes to the consolidated financial statements, which is incorporated by reference.\nContractual Obligations\nOur predominant sources of contractual obligations include the payment of interest and principal on our outstanding line of credit, our operating lease portfolio, certain employee-related benefit plans and agreements with certain suppliers related to the procurement of inventory.\nThe timing of principal payments associated with our revolving line of credit are disclosed in Note 8, \"Debt\" in the notes to the consolidated financial statements. We pay interest monthly based on prevailing interest rates at the time and the balance outstanding on our revolving line of credit.\nOur lease contracts are primarily for real estate leases, vehicle leases, IT and manufacturing leases, information technology services and telecommunications services. See Note 11, \"Leases\" in the notes to the consolidated financial statements for future minimum lease payments associated with our lease portfolio.\nWe have long-term obligations related to our deferred compensation, pension and postretirement plans that are summarized in Note 12, Employee Benefit Plans in the notes to the consolidated financial statements.\nAs part of our global sourcing strategy, we have entered into agreements with certain suppliers that require the supplier to maintain minimum levels of inventory to support certain products for which we require a short lead time to fulfill customer orders. We have the ability to notify the supplier that they no longer need to maintain the minimum level of inventory should\nwe discontinue manufacturing a product during the contract period, however, we must purchase the remaining minimum inventory levels the supplier was required to maintain within a defined period of time. These contracts allow for us to terminate with appropriate notice so long as we utilize the remaining inventory on hand at the supplier and there are no overall minimum volumes in these contracts other than what the supplier is required to maintain on hand at any given point in time.\nCritical Accounting Estimates\nWe prepare our consolidated financial statements in conformity with US GAAP. This requires management to make estimates and assumptions that affect reported amounts and related disclosures. Actual results could differ from those estimates. The following estimates are considered by management to be the most critical in understanding judgments involved in the preparation of our consolidated financial statements and uncertainties that could impact our results of operations, financial position and cash flow.\nAccounts receivable, net: Accounts receivable, net is recorded based on the contractual value of our accounts receivable, net of an estimated allowance for doubtful accounts representing managements best estimate of the amount of receivables that are not probable of collection. Accounts receivable, net was $107 million as of August 31, 2022, which is net of a $18 million allowance for doubtful accounts. Our customer base generally consists of financially reputable distributors, agents, OEMs, and other customers with whom we have long standing relationships, and historically we have not experienced significant write off of accounts receivables as a percentage of our annual net sales (accounts receivable written off as a percentage of net sales was 0.1% for each the years ended August 31, 2022, 2021, and 2020, respectively). As of August 31, 2022, the Company was exposed to a concentration of credit risk with an agent as a result of its continued payment delinquency. During the year ended August 31, 2022, the Company recorded through bad debt expense (included in SG&A in the Condensed Consolidated Statements of Earnings) a reserve of $13 million for this agent based on the consideration of the factors listed below, which fully reserves for this agent's outstanding account receivable balance. The allowance for doubtful accounts for this particular agent as of August 31, 2022 represents management's best estimate of the amount probable of collection and considers various factors with respect to this matter, including, but not limited to, (i) the lack of payment by the agent since the fiscal quarter ended February 28, 2021, (ii) our due diligence on balances due to the agent from its end customers related to sales of our services and products and the known markup on those sales from the agent to end customer, (iii) the status of ongoing negotiations with the agent to secure payments and (iv) legal recourse available to secure payment. Actual collections from the agent may differ from the Company's estimate.\nInventories: Inventory cost is determined using the last-in, first-out (LIFO) method for a portion of U.S. owned inventory (approximately 52% and 48% of total inventories at August 31, 2022 and 2021, respectively). If the LIFO method were not used, inventory balances would be higher than amounts presented in the Consolidated Balance Sheet by $19 million and $16 million at August 31, 2022 and 2021, respectively. We perform an analysis on historical sales usage of individual inventory items on hand and record a reserve to adjust inventory cost to net realizable value. The inventory valuation assumptions used are based on historical experience. We believe that such estimates are made based on consistent and appropriate methods; however, actual results may differ from these estimates under different assumptions or conditions.\nGoodwill and Long-lived Assets:\nGoodwill Impairment Review and Estimates: A considerable amount of management judgment is required in performing the impairment tests, principally in determining the fair value of each reporting unit and the indefinite-lived intangible assets. While we believe our judgments and assumptions are reasonable, different assumptions could change the estimated fair values and, therefore, impairment charges could be required. Significant negative industry or economic trends, disruptions to the Company's business, loss of significant customers, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in use of the assets or in entity structure and divestitures may adversely impact the assumptions used in the valuations and ultimately result in future impairment charges.\nIn estimating the fair value of a reporting unit, we generally use a discounted cash flow model, which calculates fair value as the sum of the projected discounted cash flows over a discrete seven-year period plus an estimated terminal value. Significant assumptions include forecasted revenues, operating profit margins, and discount rates applied to the future cash flows based on the respective reporting unit's estimated weighted average cost of capital. In certain circumstances, we also review a market approach in which a trading multiple is applied to either forecasted EBITDA (earnings before interest, income taxes, depreciation and amortization) or anticipated proceeds of the reporting unit to arrive at the estimated fair value. If the fair value of a reporting unit is less than its carrying value, an impairment loss is recorded. The estimated fair value represents the amount we believe a reporting unit could be bought or sold for in a current transaction between willing parties on an arms-length basis.\nFiscal 2022 Impairment Charges: In the fourth quarter of fiscal 2022, in conjunction with our annual goodwill impairment assessment, we recorded a $1 million goodwill impairment charge associated with the Cortland Industrial reporting unit. See Note 7, \"Goodwill, Intangible Assets, and Long-Lived Assets\" in the notes to the consolidated financial statements for further discussion. In addition, the annual goodwill impairment assessment resulted in two reporting units having an estimated fair\nvalue that exceeded the carrying value by less than 110%. The combined goodwill for these reporting units as of August 31, 2022, was approximately $140 million.\nFiscal 2021 Impairment Charges: In the fourth quarter of fiscal 2021, the Cortland Industrial business lagged behind our IT&S segment with respect to recovery in demand from the COVID-19 pandemic. Further, though volumes did increase from previous quarters, it became clear that we were not on track to realize the annual savings from our footprint optimization actions at the pace initially projected. Therefore, in conjunction with our annual goodwill impairment assessment, we recorded a $6 million goodwill impairment charge associated with the Cortland Industrial reporting unit. See Note 7, \"Goodwill, Intangible Assets, and Long-Lived Assets\" in the notes to the consolidated financial statements for further discussion. The fiscal 2021 annual review of other reporting units performed in the fourth quarter did not result in any reporting units having an estimated fair value that exceeded the carrying value (expressed as a percentage of the carrying value) by less than 100%.\nIndefinite-lived intangibles (tradenames): Indefinite-lived intangible assets are also subject to annual impairment testing. On an annual basis or more frequently if a triggering event occurs, the fair value of indefinite-lived intangible assets, based on a relief of royalty valuation approach, are evaluated to determine if an impairment charge is required.\nNo material impairments were recorded in fiscal 2022 or fiscal 2021 as a result of triggering events or the annual impairment review of indefinite-lived intangible assets.\nA considerable amount of management judgment is required in performing impairment tests, principally in determining the fair value of each reporting unit and the indefinite-lived intangible assets. While we believe our judgments and assumptions are reasonable, different assumptions, could change the estimated fair values and, therefore, future additional impairment charges could be required. Prolonged weakening industry or economic trends, disruptions to our business, loss of significant customers, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in the use of the assets or in entity structure and divestitures may adversely impact the assumptions used in the valuations and ultimately result in future impairment charges.\nLong-lived assets (fixed assets and amortizable intangible assets): We also review long-lived assets for impairment when events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable. If such indicators are present, we perform undiscounted operating cash flow analyses to determine if impairment exists. If impairment is determined to exist, any related impairment loss is calculated based on fair value.\nNo long-lived asset impairment charges were recorded in fiscal 2022 or fiscal 2021. In both fiscal 2022 and 2021, the fact that the fair value of the Cortland Industrial reporting unit was less than its net book value was considered a triggering event, however, no impairments were recorded on the long-lived assets based on the results of the undiscounted cash flow analyses performed.\nSignificant management judgment is required in performing impairment tests, principally in determining the fair value of long-lived assets. While we believe our judgments and assumptions are reasonable, different assumptions could change the estimated fair values and, therefore, future additional impairment charges could be required. Prolonged weakening industry or economic trends, disruptions to our business, loss of significant customers, inability to effectively integrate acquired businesses, unexpected significant changes or planned changes in the use of the assets or in entity structure and divestitures may adversely impact the assumptions used in the valuations and ultimately result in future impairment charges.\nBusiness Combinations and Purchase Accounting: Business combinations are accounted for using the acquisition method of accounting, and accordingly, the assets and liabilities of the acquired business are recorded at their respective fair values. The excess of the purchase price over the estimated fair value is recorded as goodwill. Assigning fair market values to the assets acquired and liabilities assumed at the date of an acquisition requires knowledge of current market values and the values of assets in use, and often requires the application of judgment regarding estimates and assumptions. While the ultimate responsibility resides with management, for certain acquisitions we retain the services of certified valuation specialists to assist with assigning estimated values to certain acquired assets and assumed liabilities, including intangible assets and tangible long-lived assets. Acquired intangible assets, excluding goodwill, are valued using discounted cash flow methodology based on future cash flows specific to the type of intangible asset purchased. This methodology incorporates various estimates and assumptions, the most significant being projected revenue growth rates, profit margins and forecasted cash flows based on discount rates and terminal growth rates.\nEmployee Benefit Plans: We provide a variety of benefits to employees and former employees including, in some cases, pensions and postretirement health care. Plan assets and obligations are recorded based on an August 31 measurement date utilizing various actuarial assumptions such as discount rates, assumed rates of return on plan assets and health care cost trend rates. We determine the discount rate assumptions by referencing high-quality, long-term bond rates that are matched to the duration of our benefit obligations, with appropriate consideration of local market factors, participant demographics and benefit payment forecasts. At August 31, 2022 and 2021, the discount rates on domestic benefit plans were 4.8% and 2.6%, respectively. In estimating the expected return on plan assets, we consider historical returns, forward-looking considerations,\ninflation assumptions and the asset-allocation strategy in investing such assets. Domestic benefit plan assets consist primarily of participating units in mutual funds with equity based strategies, mutual funds with fixed income based strategies, and U.S treasury securities. The expected return on domestic benefit plan assets was 5.5% and 4.2% for the fiscal years ended August 31, 2022 and 2021, respectively. A 25 basis point change in the assumptions for the discount rate or expected return on plan assets would not have materially changed the fiscal 2022 domestic benefit plan expense.\nWe review actuarial assumptions on an annual basis and make modifications based on current rates and trends, when appropriate. As required by US GAAP, the effects of any modifications are recorded currently or amortized over future periods. Based on information provided by independent actuaries and other relevant sources, we believe that the assumptions used are reasonable; however, changes in these assumptions could impact our financial position, results of operations or cash flow. See Note 12, Employee Benefit Plans in the notes to the consolidated financial statements for further discussion.\nIncome Taxes: Judgment is required to determine the annual effective income tax rate, deferred tax assets and liabilities, reserves for unrecognized tax benefits and any valuation allowances recorded against net deferred tax assets. Our effective income tax rate is based on annual income, statutory tax rates, tax planning opportunities available in the various jurisdictions in which we operate and other adjustments. Our annual effective income tax rate includes the impact of discrete income tax matters including adjustments to reserves for uncertain tax positions and the benefits of various income tax planning activities. Tax regulations require items to be included in our tax returns at different times than these same items are reflected in our consolidated financial statements. As a result, the effective income tax rate in our consolidated financial statements differs from that reported in our tax returns. Some of these differences are permanent, such as expenses that are not tax deductible, while others are temporary differences, such as amortization and depreciation expenses.\nTemporary differences create deferred tax assets and liabilities, which are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. We establish valuation allowances for our deferred tax assets when the amount of expected future taxable income is not large enough to utilize the entire deduction or credit. Relevant factors in determining the realizability of deferred tax assets include future taxable income, the expected timing of the reversal of temporary differences, tax planning strategies and the expiration dates of the various tax attributes. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to market risk from changes in foreign currency exchange rates and interest rates and, to a lesser extent, commodities. To reduce such risks, we selectively use financial instruments and other proactive management techniques. All hedging transactions are authorized and executed pursuant to clearly defined policies and procedures, which strictly prohibit the use of financial instruments for trading or speculative purposes. A discussion of our accounting policies for derivative financial instruments is included within Note 10, Derivatives in the notes to the consolidated financial statements.\nForeign Currency Risk-We maintain operations in the U.S. and various foreign countries. Our non-U.S. operations, the largest of which are located in the Netherlands (and other countries whose functional currency is the Euro), the United Kingdom, Australia, the United Arab Emirates and China, have foreign currency risk relating to receipts from customers, payments to suppliers and intercompany transactions denominated in foreign currencies. Under certain conditions, we enter into hedging transactions, primarily forward foreign currency swaps, that enable us to mitigate the potential adverse impact of foreign currency exchange rate risk (see Note 10, Derivatives in the notes to the consolidated financial statements for further information). We do not engage in trading or other speculative activities with these transactions, as established policies require that these hedging transactions relate to specific currency exposures.\nThe strengthening of the U.S. dollar can have an unfavorable impact on our results of operations and financial position as foreign denominated operating results are translated into U.S. dollars. To illustrate the potential impact of changes in foreign currency exchange rates on the translation of our results of operations, annual sales and operating profit were remeasured assuming a ten percent reduction in foreign exchange rates compared to the U.S. dollar. Under this assumption, annual sales would have been $24 million lower and operating profit would have been relatively flat for the twelve months ended August 31, 2022. This sensitivity analysis assumes that each exchange rate would change in the same direction relative to the U.S. dollar and excludes the potential effects that changes in foreign currency exchange rates may have on actual sales or price levels. Similarly, a ten percent decline in foreign currency exchange rates relative to the U.S. dollar on our August 31, 2022 financial position would result in a $40 million reduction to equity (accumulated other comprehensive loss), as a result of non-U.S. dollar denominated assets and liabilities being translated into U.S. dollars, our reporting currency.\nInterest Rate Risk-As of August 31, 2022, long term debt consisted of $200 million of borrowings under the revolving line of credit (variable rate debt). A ten percent increase in the average costs of our variable rate debt would have resulted in less than $0.1 million increase in financing costs for the year ended August 31, 2022.\nCommodity Risk-We source a wide variety of materials and components from a network of global suppliers. While such materials are typically available from numerous suppliers, commodity raw materials, such as steel, aluminum, plastic resin, brass, steel wire and rubber are subject to price fluctuations which could have a negative impact on our results. We strive to timely pass along such commodity price increases to customers to avoid profit margin erosion. Item 8. Financial Statements and Supplementary Data\nPage\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReports of Independent Registered Public Accounting Firm (Ernst & Young LLP: PCAOB ID 42)\nReport of Independent Registered Public Accounting Firm (PricewaterhouseCoopers LLP: PCAOB ID 238)\nConsolidated Statements of Earnings for the years ended August 31, 2022, 2021 and 2020\nConsolidated Statements of Comprehensive (Loss) Income for the years ended August 31, 2022, 2021 and 2020\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2022, 2021 and 2020\nConsolidated Statements of Shareholders Equity for the years ended August 31, 2022, 2021 and 2020\nNotes to consolidated financial statements\nINDEX TO FINANCIAL STATEMENT SCHEDULE\nSchedule II-Valuation and Qualifying Accounts for the years ended August 31, 2022, 2021 and 2020\nAll other schedules are omitted because they are not applicable, not required or because the required information is included in the consolidated financial statements or notes thereto.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Enerpac Tool Group Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Enerpac Tool Group and Subsidiaries (the Company) as of August 31, 2022 and August 31, 2021, the related consolidated statements of earnings, comprehensive income (loss), shareholders' equity and cash flows for the years ended August 31, 2022, and August 31, 2021 and the related notes and financial statement schedule listed in the Index at Item 15(a)(2) (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at August 31, 2022 and August 31, 2021, and the results of its operations and its cash flows for the years ended August 31, 2022, and August 31, 2021 , in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated October 25, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nValuation of Goodwill within the IT&S Segment\nDescription of\nthe Matter\nAt August 31, 2022, the Companys consolidated goodwill balance was $257.9 million. Goodwill associated with the IT&S segment was $246.7 million. As disclosed in Note 1 to the financial statements, Management tests goodwill for impairment annually during the fourth quarter, or more frequently if events or changes in circumstances indicate that goodwill might be impaired. In estimating fair value, management utilizes a discounted cash flow model, which is dependent on a number of assumptions, most significantly forecasted revenues and operating profit margins, and the weighted average cost of capital.\nAuditing managements goodwill impairment test within the IT&S segment was complex and highly judgmental due to the significant estimation required to determine the fair value of certain reporting units. In particular, the fair value estimate was sensitive to significant assumptions over forecasted revenues, operating profit margins, and the weighted average cost of capital.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Companys goodwill impairment review process, including controls over management's review of the significant assumptions used to develop the fair value estimates and controls over the completeness and accuracy of the underlying data used in the valuation.\nTo test the estimated fair value of the Companys reporting units within the IT&S segment, we performed audit procedures that included, among others, assessing methodologies and testing the significant assumptions discussed above and the completeness and accuracy of the underlying data used by the Company in its analysis. We also involved our valuation specialists to review certain significant assumptions. We compared the significant assumptions used by management to current industry and economic trends. We assessed the historical accuracy of managements estimates and performed sensitivity analyses of significant assumptions to evaluate the changes in the fair value of the reporting units that would result from changes in the assumptions. We reconciled the fair value of the reporting units in the IT&S segment to their carrying value and tested the Companys determination of the assets and liabilities used within the reporting units that are the basis for the carrying value. In addition, we tested managements reconciliation of the fair value of all the reporting units to the market capitalization of the Company and assessed the adequacy of the Companys goodwill valuation disclosures.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2020.\nMilwaukee, Wisconsin\nOctober 25, 2022\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Enerpac Tool Group Corp.\nOpinion on Internal Control over Financial Reporting\nWe have audited Enerpac Tool Group Corp. and Subsidiaries internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Enerpac Tool Group Corp. and Subsidiaries (the Company) maintained, in all material respects, effective internal control over financial reporting as of August 31, 2022, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of August 31, 2022 and August 31, 2021, the related consolidated statements of earnings, comprehensive income (loss), stockholders equity and cash flows for the years ended August 31, 2022, and August 31, 2021, and the related notes and financial statement schedule listed in the accompanying index and our report dated October 25, 2022 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nMilwaukee, Wisconsin\nOctober 25, 2022\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Enerpac Tool Group Corp.\nOpinion on the Financial Statements\nWe have audited the consolidated statements of earnings, of comprehensive (loss) income, of shareholders equity and of cash flows of Enerpac Tool Group Corp. and its subsidiaries (the Company) for the year ended August 31, 2020, including the related notes and schedule of valuation and qualifying accounts for the year ended August 31, 2020 listed in the accompanying index (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the results of operations and cash flows of the Company for the year ended August 31, 2020 in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit of these consolidated financial statements in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ PricewaterhouseCoopers LLP\nMilwaukee, Wisconsin\nOctober 26, 2020\nWe served as the Company's auditor from 1997 to 2020.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF EARNINGS\n(in thousands, except per share amounts)\nYear Ended August 31,\n2022 2021 2020\nNet sales\nProduct $ 454,126 $ 411,888 $ 379,899\nService & rental 117,097 116,772 113,393\nTotal net sales 571,223 528,660 493,292\nCost of products sold\nProduct 232,497 216,442 204,524\nService & rental 73,338 69,062 71,575\nTotal cost of products sold 305,835 285,504 276,099\nGross profit 265,388 243,156 217,193\nSelling, general and administrative expenses 216,874 175,277 180,513\nAmortization of intangible assets 7,306 8,176 8,323\nRestructuring charges 8,135 2,392 7,335\nImpairment & divestiture charges (benefit) 2,413 6,198 (3,159)\nOperating profit 30,660 51,113 24,181\nFinancing costs, net 4,386 5,266 19,218\nOther expense (income), net 2,282 1,872 (2,886)\nEarnings before income tax expense 23,992 43,975 7,849\nIncome tax expense 4,401 3,763 2,292\nNet earnings from continuing operations 19,591 40,212 5,557\nLoss from discontinued operations, net of income taxes (3,905) (2,135) (4,834)\nNet earnings $ 15,686 $ 38,077 $ 723\nEarnings per share from continuing operations\nBasic $ 0.33 $ 0.67 $ 0.09\nDiluted $ 0.33 $ 0.67 $ 0.09\nLoss per share from discontinued operations\nBasic $ (0.07) $ (0.04) $ (0.08)\nDiluted $ (0.07) $ (0.04) $ (0.08)\nEarnings per share\nBasic $ 0.26 $ 0.63 $ 0.01\nDiluted $ 0.26 $ 0.63 $ 0.01\nWeighted average common shares outstanding\nBasic 59,538 60,024 59,952\nDiluted 59,909 60,403 60,269\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE (LOSS) INCOME\n(in thousands)\nYear Ended August 31,\n2022 2021 2020\nNet income $ 15,686 $ 38,077 $ 723\nOther comprehensive (loss) income, net of tax\nForeign currency translation adjustments (46,092) 5,910 23,224\nRecognition of foreign currency translation losses from divested businesses - - 51,994\nPension, other postretirement benefit plans, and cash flow hedges 4,115 1,830 (603)\nTotal other comprehensive (loss) income, net of tax (41,977) 7,740 74,615\nComprehensive (loss) income $ (26,291) $ 45,817 $ 75,338\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share and per share amounts)\nAugust 31,\n2022 2021\nA S S E T S\nCurrent assets\nCash and cash equivalents $ 120,699 $ 140,352\nAccounts receivable, net 106,747 103,233\nInventories, net 83,672 75,347\nOther current assets 31,262 38,503\nTotal current assets 342,380 357,435\nProperty, plant and equipment, net 41,372 48,590\nGoodwill 257,949 277,593\nOther intangible assets, net 41,507 54,545\nOther long-term assets 74,104 82,084\nTotal assets $ 757,312 $ 820,247\nL I A B I L I T I E S A N D S H A R E H O L D E R S E Q U I T Y\nCurrent Liabilities\nTrade accounts payable $ 72,524 $ 61,958\nAccrued compensation and benefits 21,390 21,597\nShort-term debt 4,000 -\nIncome taxes payable 4,594 5,674\nOther current liabilities 50,680 45,535\nTotal current liabilities 153,188 134,764\nLong-term debt, net 200,000 175,000\nDeferred income taxes 7,355 4,397\nPension and postretirement benefit liabilities 11,941 17,783\nOther long-term liabilities 66,217 76,105\nTotal liabilities 438,701 408,049\nCommitments and contingencies (Note 17)\nShareholders equity\nClass A common stock, $0.20 par value per share, authorized 168,000,000 shares, issued 83,397,458 and 83,021,654 shares, respectively 16,679 16,604\nAdditional paid-in capital 212,986 202,971\nTreasury stock, at cost, 26,558,965 and 22,799,230 shares, respectively (742,844) (667,732)\nRetained earnings 966,751 953,339\nAccumulated other comprehensive loss (134,961) (92,984)\nStock held in trust (3,209) (3,067)\nDeferred compensation liability 3,209 3,067\nTotal shareholders' equity 318,611 412,198\nTotal liabilities and shareholders' equity $ 757,312 $ 820,247\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear Ended August 31,\n2022 2021 2020\nOperating Activities\nNet earnings $ 15,686 $ 38,077 $ 723\nLess: Net loss from discontinued operations (3,905) (2,135) (4,834)\nNet earnings from continuing operations 19,591 40,212 5,557\nAdjustments to reconcile net earnings from continuing operations to net cash provided by operating activities - continuing operations:\nImpairment & divestiture charges (benefit), net of tax effect 2,413 5,586 (2,506)\nDepreciation and amortization 19,600 21,611 20,720\nStock-based compensation expense 13,619 9,215 9,624\n(Benefit) provision for deferred income taxes (5,291) 9,639 (7,819)\nAmortization of debt issuance costs 480 480 2,549\nProvision for bad debts 13,856 - -\nOther non-cash (benefits) charges (344) (9,172) 1,204\nChanges in components of working capital and other, excluding acquisitions and divestitures:\nAccounts receivable (23,753) (19,113) 44,749\nInventories (16,036) (5,857) 8,960\nTrade accounts payable 9,658 16,695 (32,081)\nPrepaid expenses and other assets 12,545 (18,812) 7,828\nIncome tax accounts 4,022 (4,293) (7,306)\nAccrued compensation and benefits 1,267 3,631 (9,845)\nOther accrued liabilities 619 5,038 (23,635)\nCash provided by operating activities - continuing operations 52,246 54,860 17,999\nCash used in operating activities - discontinued operations (510) (677) (21,158)\nCash provided by (used in) operating activities 51,736 54,183 (3,159)\nInvesting Activities\nCapital expenditures (8,417) (12,019) (12,053)\nProceeds from sale of property, plant and equipment 1,176 22,409 708\nProceeds from company owned life insurance policies - 2,911 -\nCash paid for business acquisitions, net of cash acquired - - (33,298)\nProceeds from sale of business, net of transaction costs - - 10,226\nOther investing activities - - (710)\nCash (used in) provided by investing activities - continuing operations (7,241) 13,301 (35,127)\nCash provided by investing activities - discontinued operations - - 211,200\nCash (used in) provided by investing activities (7,241) 13,301 176,073\nFinancing Activities\nBorrowings on revolving credit facility 85,000 10,000 395,000\nPrincipal repayments on revolving credit facility (60,000) (90,000) (140,000)\nSwingline borrowings/repayments, net 4,000 - -\nPrincipal repayments on term loan - - (175,000)\nRedemption of 5.625% Senior Notes - - (287,559)\nPurchase of treasury shares (75,112) - (27,520)\nStock options, taxes paid related to the net share settlement of equity awards & other (3,681) 128 (1,428)\nPayment of cash dividend (2,409) (2,394) (2,419)\nCash used in financing activities - continuing operations (52,202) (82,266) (238,926)\nCash provided by financing activities - discontinued operations - 750 -\nCash used in financing activities (52,202) (81,516) (238,926)\nEffect of exchange rate changes on cash (11,946) 2,214 7,031\nNet decrease in cash and cash equivalents (19,653) (11,818) (58,981)\nCash and cash equivalents - beginning of period 140,352 152,170 211,151\nCash and cash equivalents - end of period $ 120,699 $ 140,352 $ 152,170\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(in thousands)\nCommon Stock Additional\nPaid-in\nCapital Treasury\nStock Retained\nEarnings Accumulated\nOther\nComprehensive\nLoss Stock Held In Trust Deferred\nCompensation\nLiability Total\nShareholders\nEquity\nIssued\nShares Amount\nBalance at August 31, 2019 81,919 $ 16,384 $ 181,213 $ (640,212) $ 915,466 $ (171,672) $ (3,070) $ 3,070 $ 301,179\nNet earnings - - - - 723 - - - 723\nOther comprehensive income, net of tax - - - - - 74,615 - - 74,615\nStock contribution to employee benefit plans and other 23 5 456 - - - - - 461\nVesting of equity awards 484 96 (96) - - - - - -\nCash dividend ($0.04 per share) - - - - (2,391) - - - (2,391)\nTreasury stock repurchases - - - (27,520) - - - - (27,520)\nStock based compensation expense - - 13,309 - - - - - 13,309\nStock option exercises 145 29 2,602 - - - - - 2,631\nTax effect related to net share settlement of equity awards - - (4,286) - - - - - (4,286)\nStock issued to, acquired for and distributed from rabbi trust 23 5 294 - - - 508 (508) 299\nAdoption of accounting standards - - - - 3,873 (3,667) - - 206\nBalance at August 31, 2020 82,594 16,519 193,492 (667,732) 917,671 (100,724) (2,562) 2,562 359,226\nNet earnings - - - - 38,077 - - - 38,077\nOther comprehensive income, net of tax - - - - - 7,740 - - 7,740\nStock contribution to employee benefit plans and other 17 4 359 - - - - - 363\nVesting of equity awards 282 56 (56) - - - - - -\nCash dividend ($0.04 per share) - - - - (2,409) - - - (2,409)\nStock based compensation expense - - 9,215 - - - - - 9,215\nStock option exercises 104 20 2,188 - - - - - 2,208\nTax effect related to net share settlement of equity awards - - (2,445) - - - - - (2,445)\nStock issued to, acquired for and distributed from rabbi trust 25 5 218 - - - (505) 505 223\nBalance at August 31, 2021 83,022 16,604 202,971 (667,732) 953,339 (92,984) (3,067) 3,067 412,198\nNet earnings - - - - 15,686 - - - 15,686\nOther comprehensive loss, net of tax - - - - - (41,977) - - (41,977)\nStock contribution to employee benefit plans and other 15 3 266 - - - - - 269\nVesting of equity awards 350 70 (70) - - - - - -\nCash dividend ($0.04 per share) - - - - (2,274) - - - (2,274)\nTreasury stock repurchases - - - (75,112) - - - - (75,112)\nStock based compensation expense - - 13,619 - - - - - 13,619\nTax effect related to net share settlement of equity awards - - (3,950) - - - - - (3,950)\nStock issued to, acquired for and distributed from rabbi trust 10 2 150 - - - (142) 142 152\nBalance at August 31, 2022 83,397 $ 16,679 $ 212,986 $ (742,844) $ 966,751 $ (134,961) $ (3,209) $ 3,209 $ 318,611\nThe accompanying notes are an integral part of these consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. Summary of Significant Accounting Policies\nNature of Operations: Enerpac Tool Group Corp. (the Company), is a global manufacturer of a broad range of industrial products and solutions, organized into six operating segments. In accordance with generally accepted accounting principle in the United States (\"US GAAP\"), four of these operating segments have been aggregated into the Company's only reportable segment, the Industrial Tools & Services segment (\"IT&S\"). IT&S is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools and in providing services and tool rental to the infrastructure, industrial maintenance, repair, and operations, oil & gas, mining, alternative and renewable energy, and civil construction markets.\nConsolidation and Presentation: The consolidated financial statements include the accounts of the Company and its subsidiaries, all of which are wholly owned. The results of companies acquired or disposed of during the year are included in the consolidated financial statements from the effective date of acquisition or until the date of divestiture. All intercompany balances, transactions and profits have been eliminated in consolidation.\nAt August 31, 2019, the Company's former Engineered Components & Systems (\"EC&S\") segment was considered held for sale and was subsequently divested on October 31, 2019. As the divestiture represented a strategic shift in our operations, the results of the former segment through the date of divestiture and subsequent impacts to the financial results from retained liabilities are recorded in \"Loss from discontinued operations, net of income taxes\" within the Consolidated Statements of Earnings.\nCash Equivalents: The Company considers all highly liquid investments with original maturities of 90 days or less to be cash equivalents.\nInventories: Inventories are comprised of material, direct labor and manufacturing overhead. A majority of inventory is recorded on the first-in, first-out or average cost method and is stated at the lower of cost or net realizable value. A portion of U.S. owned inventory is determined using the last-in, first-out (LIFO) method (51.7% and 48.4% of total inventories as of August 31, 2022 and 2021, respectively). If the LIFO method were not used, inventory balances would be higher than reported amounts in the consolidated balance sheets by $19.0 million and $15.9 million at August 31, 2022 and 2021, respectively.\nThe nature of the Companys products is such that they generally have a very short production cycle. Consequently, the amount of work-in-process at any point in time is minimal. In addition, many parts or components are ultimately either sold individually or assembled with other parts making a distinction between raw materials and finished goods impractical to determine. Certain locations maintain and manage their inventories using a job cost system where the distinction of categories of inventory by state of completion is also not available. As a result of these factors, it is neither practical nor cost effective to segregate the amounts of raw materials, work-in-process or finished goods inventories at the respective balance sheet dates, as segregation would only be possible as the result of physical inventories which are taken at dates different from the balance sheet dates.\nProperty, Plant and Equipment: Property, plant and equipment are stated at cost. Plant and equipment are depreciated on a straight-line basis over the estimated useful lives of the assets, ranging from ten to forty years for buildings and improvements and two to fifteen years for machinery and equipment. Equipment includes assets which are rented to customers of our IT&S segment. Leasehold improvements are amortized over the shorter of the life of the related asset or the term of the lease. Depreciation expense was $12.3 million, $13.4 million and $12.4 million for the years ended August 31, 2022, 2021 and 2020, respectively. The following is a summary of the Company's components of property, plant and equipment (in thousands):\nAugust 31, 2022 August 31, 2021\nLand, buildings and improvements $ 14,121 $ 16,617\nMachinery and equipment 141,571 145,541\nGross property, plant and equipment 155,692 162,158\nLess: Accumulated depreciation (114,320) (113,568)\nProperty, plant and equipment, net $ 41,372 $ 48,590\nLeases: We determine if an arrangement contains a lease in whole or in part at the inception of the contract and identify classification of the lease as financing or operating. We account for the underlying operating lease asset at the individual lease level. Operating leases are recorded as operating lease right-of-use (ROU) assets in Other long-term assets and operating lease liabilities in Other current liabilities and Other long-term liabilities on the Consolidated Balance Sheets.\nAll leases greater than 12 months result in recognition of a ROU asset and a liability at the lease commencement date and are recorded at the present value of the future minimum lease payments over the lease term. The lease term is equal to the initial term at commencement plus any renewal or extension options that the Company is reasonably certain will be exercised. ROU assets at the date of commencement are equal to the amount of the initial lease liability, the initial direct costs incurred by the\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nCompany and any prepaid lease payments less any incentives received. Lease expense for operating leases is recognized on a straight-line basis over the lease term or remaining useful life. As most of our leases do not provide the information required to determine the implicit rate, we utilize a consolidated group incremental borrowing rate for all leases as the Company has centralized treasury operations. The incremental borrowing rate is derived through a combination of inputs such as the Company's credit rating, impact of collaborated borrowing capabilities and lease term.\nLeases with the duration of less than one-year are not recognized on the balance sheet and are expensed on a straight-line basis over the lease term. In addition, we do not separate lease components from non-lease components for all asset classes.\nGoodwill and Other Intangible Assets: Goodwill and other intangible assets with indefinite lives are not subject to amortization, but are subject to annual impairment testing. Other intangible assets with definite lives, consisting primarily of purchased customer relationships, patents, trademarks and tradenames, are amortized over periods from one to twenty-five years.\nThe Companys goodwill is tested for impairment annually, during the fourth quarter, or more frequently if events or changes in circumstances indicate that goodwill might be impaired. The Company performs impairment reviews for its reporting units using a fair value method based on managements judgments and assumptions. In estimating the fair value, the Company utilizes a discounted cash flow model, which is dependent on a number of assumptions, most significantly forecasted revenues and operating profit margins, and the weighted average cost of capital, or a market value approach if appropriate information is available as of the goodwill impairment assessment date. The estimated fair value of the reporting unit is compared to the carrying amount of the reporting unit, including goodwill. If the carrying value of the reporting unit exceeds its fair value, an impairment loss is recorded and should not exceed the total amount of the goodwill allocated to the reporting unit. Indefinite-lived intangible assets are also subject to an annual impairment test. On an annual basis, or more frequently if events or changes in circumstances indicate that the asset might be impaired, the fair value of the indefinite-lived intangible assets are evaluated by the Company to determine if an impairment charge is required. A considerable amount of management judgment is required in performing impairment tests, principally in determining the fair value of each reporting unit and the indefinite-lived intangible assets.\nProduct Warranty Costs: The Company generally offers its customers an assurance warranty on products sold, although warranty periods may vary by product type and application. The reserve for future warranty claims, which is recorded within the \"Other current liabilities\" line on the Consolidated Balance Sheets, is based on historical claim rates and current warranty cost experience. The following is a rollforward of the changes in product warranty reserves for fiscal years 2022 and 2021 (in thousands):\n2022 2021\nBeginning balance $ 1,300 $ 892\nProvision for warranties 887 1,580\nWarranty payments and costs incurred (911) (1,171)\nImpact of changes in foreign currency rates (136) (1)\nEnding balance $ 1,140 $ 1,300\nRevenue from Contracts with Customers: The Company recognizes revenue when it satisfies a performance obligation in a contract by transferring control of a distinct good or service to a customer. A contracts transaction price is allocated to each distinct performance obligation and revenue is measured based on the consideration that the Company expects to be entitled to in exchange for the goods or services transferred. When contracts include multiple products or services to be delivered to the customer, the consideration for each element is generally allocated on the standalone transaction prices of the separate performance obligations, using the adjusted market assessment approach.\nUnder normal circumstances, the Company invoices the customer once transfer of control has occurred and has a right to payment. The typical payment terms vary based on the customer and the types of goods and services in the contract. The period of time between invoicing and when payment is due is not significant, as our standard payment terms are less than one year. Amounts billed and due from customers are classified as receivables on the Consolidated Balance Sheets.\nCustomer sales are recorded net of allowances for returns and discounts, which are recognized as a deduction from sales at the time of sale. The Company commits to one-time or on-going trade discounts and promotions with customers that require the Company to estimate and accrue the ultimate costs of such programs. The Company generally does not require collateral or other security for receivables and provides for an allowance for doubtful accounts based on historical experience and a review of its existing receivables. Accounts receivable are stated net of an allowance for doubtful accounts of $17.5 million and $4.2 million at August 31, 2022 and 2021, respectively.\nTaxes Collected: Taxes collected by the Company from a customer concurrent with revenue-producing activities are excluded from \"Net sales\" within the Consolidated Statements of Earnings.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nShipping and Handling Costs: The Company records costs associated with shipping its products after control over a product has transferred to a customer and are accounted for as fulfillment costs. These costs are reported in the Consolidated Statements of Earnings in \"Cost of products sold.\"\nResearch and Development Costs: Research and development costs consist primarily of engineering and development resources and are expensed as incurred. Such costs incurred in the development of new products or significant improvements to existing products were $7.3 million, $7.4 million and $7.3 million in fiscal 2022, 2021 and 2020, respectively. The Company also incurs significant costs in connection with fulfilling custom orders and developing solutions for unique customer needs which are not included in these research and development expense totals.\nOther Income/Expense: Other income and expense primarily consists of net foreign currency exchange transaction losses of $1.5 million, $1.8 million and $2.6 million in fiscal 2022, 2021 and 2020, respectively. In addition, as a result of the EC&S divestiture and the transition services agreement entered into with the buyer, the Company recorded $4.9 million of other income from providing the agreed upon services in fiscal 2020.\nFinancing Costs: Financing costs represent interest expense, financing fees and amortization of debt issuance costs, net of interest income. Interest income was $1.3 million, $0.7 million and $0.8 million for fiscal 2022, 2021 and 2020, respectively.\nIncome Taxes: The provision for income taxes includes federal, state, local and non-U.S. taxes on income. Tax credits, primarily for non-U.S. earnings, are recognized as a reduction of the provision for income taxes in the year in which they are available for U.S. tax purposes. Deferred taxes are provided on temporary differences between assets and liabilities for financial and tax reporting purposes as measured by enacted tax rates expected to apply when temporary differences are settled or realized. Future tax benefits are recognized to the extent that realization of those benefits is considered to be more likely than not. A valuation allowance is established for deferred tax assets for which realization is not more likely than not of being realized. The Company has not provided for any residual U.S. income taxes on unremitted earnings of non-U.S. subsidiaries, as such earnings are intended to be indefinitely reinvested to the extent the remittance does not result in an incremental U.S. tax liability. The Company recognizes interest and penalties related to unrecognized tax benefits in income tax expense and treats any taxes due on future U.S. inclusions in taxable income under the Global Intangible Low-Taxed Income (\"GILTI\") provision as a current period tax expense.\nForeign Currency Translation: The financial statements of the Companys foreign operations are translated into U.S. dollars using the exchange rate at each balance sheet date for assets and liabilities and an appropriate weighted average exchange rate for each applicable period within the Consolidated Statements of Earnings. Translation adjustments are reflected in the Consolidated Balance Sheets and Consolidated Statements of Shareholders' Equity caption Accumulated other comprehensive loss.\nAccumulated Other Comprehensive Loss: The following is a summary of the components included within accumulated other comprehensive loss (in thousands):\nAugust 31,\n2022 2021\nForeign currency translation adjustments $ 116,078 $ 69,986\nPension and other postretirement benefit plans 18,883 22,998\nAccumulated other comprehensive loss $ 134,961 $ 92,984\nUse of Estimates: The preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting periods. The Company regularly evaluates the estimates and assumptions related to the allowance for doubtful accounts, inventory valuation, warranty reserves, goodwill, intangible and long-lived asset valuations, employee benefit plan liabilities, over-time revenue recognition, income tax liabilities, deferred tax assets and related valuation allowances, uncertain tax positions, restructuring reserves, and litigation and other loss contingencies.\nThe Company manages the profitability of its product and service & rental categories on a combined basis given the complexity of the business model. This model includes providing integrated product and service solutions resulting in facilities that generate revenues from both product and service & rental categories, which also have indirect and facility overhead costs included in cost of sales. As such, judgment and estimates are required to disaggregate product and service & rental cost of sales including allocating indirect and facility overhead costs between cost of product sales and the cost of service & rental sales. Changes in these judgments and estimates could materially change the allocation of the indirect and facility overhead costs to the different sales categories and the resulting ratio of cost of sales to net sales by category. Because the sales mix heavily favors the product category, a change in the mix of cost of sales between the sales categories would have a more significant impact on the ratio of cost of sales to net sales for the service & rental category.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nRecently Adopted Accounting Pronouncements\nIn December 2019, the Financial Accounting Standards Board (\"FASB\") issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The amendments in this update simplify the accounting for income taxes by removing certain exceptions and amending and clarifying existing guidance. The Company adopted this guidance on September 1, 2021. The adoption did not have a material effect on our consolidated financial statements.\nRecently Issued Accounting Pronouncements\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which amends ASC 805 to require an acquirer to, at the date of acquisition, recognize and measure contract assets and contract liabilities acquired in accordance with ASU 2014-9, Revenue from Contracts with Customers (Topic 606) as if the entity had originated the contracts. The guidance is effective for fiscal years beginning after December 15, 2022. The Company will adopt this guidance in the event of a business combination subsequent to the effective date of the guidance.\nIn March 2020, the FASB issued ASU 2020-4, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting, which provides optional expedients and exceptions for a limited time to ease the potential burden of accounting for reference rate reform on financial reporting. This guidance applies to contracts, hedging relationships and other transactions affected by the discontinuation of the London Interbank Offered Rate (LIBOR) and other interbank offered rates. The guidance is effective beginning on March 12, 2020 through December 31, 2022. In January 2021, the FASB issued ASU 2021-01 allowing entities to apply certain aspects of ASC 848 (previously ASU 2020-4) to all derivative instruments that undergo a modification of the interest rate used for discounting, margining or contract price alignment as a result of the reference reform. The guidance is also effective through December 31, 2022. The Company has not utilized any of the optional expedients or exceptions available under this guidance. The Company will continue to assess whether this guidance is applicable throughout the effective period.\nNote 2. Revenue from Contracts with Customers\nNature of Goods and Services\nThe Company generates its revenue under two principal activities, which are discussed below:\nProduct Sales: Sales of tools, heavy-lifting solutions, and rope solutions are recorded when control is transferred to the customer (i.e., performance obligation has been satisfied). For the majority of the Companys product sales, revenue is recognized at a point in time when control of the product is transferred to the customer, which generally occurs when the product is shipped from the Company to the customer. For certain other products that are highly customized and have a limited alternative use, and for which the Company has an enforceable right of reimbursement for performance completed to date, revenue is recognized over time. We consider the input measure (efforts-expended or cost-to-cost) or output measure as a fair measure of progress for the recognition of over-time revenue associated with these custom products. For a majority of the Companys custom products, machine hours and labor hours (efforts-expended measurement) are used as a measure of progress.\nService & Rental Sales: Service contracts consist of providing highly trained technicians to perform bolting, technical services, machining and joint-integrity work for our customers. These revenues are recognized over time as our customers simultaneously receive and consume the benefits provided by the Company. We consider the input measure (efforts-expended or cost-to-cost) or output measure as a fair measure of progress for the recognition of over-time revenue associated with service contracts. For a majority of the Companys service contracts, labor hours (efforts-expended measurement) is used as the measure of progress when it is determined to be a better depiction of the transfer of control to the customer due to the timing and pattern of labor hours incurred. Revenue from rental contracts (less than a year and non-customized products) is generally recognized ratably over the contract term, depicting the customers consumption of the benefit related to the rental equipment.\nDisaggregated Revenue and Performance Obligations\nThe Company disaggregates revenue from contracts with customers by reportable segment and product line and by the timing of when goods and services are transferred. See Note 16, \"Business Segment, Geographic and Customer Information\" for information regarding our revenue disaggregation by reportable segment and product line.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following table presents information regarding revenues disaggregated by the timing of when goods and services are transferred (in thousands):\nYear Ended August 31,\n2022 2021\nRevenues recognized at point in time $ 442,832 $ 396,457\nRevenues recognized over time 128,391 132,203\nTotal $ 571,223 $ 528,660\nContract Balances\nThe Company's contract assets and liabilities are as follows (in thousands):\nAugust 31,\n2022 2021\nReceivables, which are included in accounts receivable, net $ 106,747 $ 103,233\nContract assets, which are included in other current assets 2,397 8,551\nContract liabilities, which are included in other current liabilities 2,804 3,410\nReceivables: The Company performs its obligations under a contract with a customer by transferring goods or services in exchange for consideration from the customer. The Company typically invoices its customers as soon as control of an asset is transferred and a receivable for the Company is established. Accounts receivable, net is recorded at face amount of customer receivables less an allowance for doubtful accounts. The Company maintains an allowance for doubtful accounts for expected losses as a result of customers inability to make required payments. Management evaluates the aging of customer receivable balances, the financial condition of its customers, historical trends and the time outstanding of specific balances to estimate the amount of receivables that will not be collected in the future and records the appropriate provision. The allowance for doubtful accounts was $17.5 million and $4.2 million at August 31, 2022 and 2021, respectively.\nAs indicated in the \"Concentration of Credit Risk\" section below, as of August 31, 2022, the Company was exposed to a concentration of credit risk with an agent as a result of its continued payment delinquency. During the year ended August 31, 2022, the Company recorded through bad debt expense (included in SG&A in the Condensed Consolidated Statements of Earnings) a reserve of $13.2 million based on the consideration of the factors listed below, which fully reserves for the outstanding account receivable balance for this agent. The allowance for doubtful accounts for this particular agent as of August 31, 2022 represents management's best estimate of the amount probable of collection and considers various factors with respect to this matter, including, but not limited to, (i) the lack of payment by the agent since the fiscal quarter ended February 28, 2021, (ii) our due diligence on balances due to the agent from its end customers related to sales of our services and products and the known markup on those sales from the agent to end customer, (iii) the status of ongoing negotiations with the agent to secure payments and (iv) legal recourse available to secure payment. Actual collections from the agent may differ from the Company's estimate.\nConcentration of Credit Risk: The Company sells products and services through distributors and agents. In certain jurisdictions, those third parties represent a significant portion of our sales in their respective country which can pose a concentration of credit risk if these larger distributors or agents are not timely in their payments. As of August 31, 2022 the Company was exposed to a concentration of credit risk as a result of the payment delinquency of one of our agents whose accounts receivable represent 10.6% of the Company's outstanding accounts receivable.\nContract Assets: Contract assets relate to the Companys rights to consideration for work completed but not billed as of the reporting date on contracts with customers. The contract assets are transferred to receivables when the rights become unconditional. The Company has contract assets on contracts that are generally long-term and have revenues that are recognized over time.\nContract Liabilities: As of August 31, 2022, the Company had certain contracts where there were unsatisfied performance obligations and the Company had received cash consideration from customers before the performance obligations were satisfied. The majority of these contracts relate to long-term customer contracts (project durations of greater than three months) and are recognized over time. The Company estimates that the $2.8 million will be recognized in net sales from satisfying those performance obligations within the next twelve months with an immaterial amount recognized in periods thereafter.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nTiming of Performance Obligations Satisfied at a Point in Time: The Company evaluates when the customer obtains control of the product based on shipping terms, as control will transfer, depending upon such terms, at different points between the Company's manufacturing facility or warehouse and the customers location. The Company considers control to have transferred upon shipment or delivery because (i) the Company has a present right to payment at that time; (ii) the legal title has been transferred to the customer; (iii) the Company has transferred physical possession of the product to the customer; and (iv) the customer has significant risks and rewards of ownership of the product.\nVariable Consideration: The Company estimates whether it will be subject to variable consideration under the terms of the contract and includes its estimate of variable consideration in the transaction price based on the expected value method when it is deemed probable of being realized based on historical experience and trends. Types of variable consideration may include rebates, incentives and discounts, among others, which are recorded as a reduction to net sales at the time when control of a performance obligation is transferred to the customer.\nPractical Expedients & Exemptions: The Company elected to expense the incremental cost to obtaining a contract when the amortization period for such contracts would be one year or less. The Company does not disclose the value of unperformed obligations for (i) contracts with an original expected length of one year or less and (ii) contracts for which it recognizes revenue at the amount to which it has the right to invoice for services performed.\nNote 3. ASCEND Transformation Program\nIn March 2022, the Company announced the launch of ASCEND, a new transformation program focused on driving accelerated earnings growth and efficiency across the business with the goal of delivering an incremental $40 to $50 million of annual operating profit once fully implemented. As part of ASCEND, the Company is focusing on the following key initiatives: (i) accelerating organic growth go-to-market strategies, (ii) improving operational excellence and production efficiency by utilizing a lean approach and (iii) driving greater efficiency and productivity in SG&A by better leveraging resources to create a more efficient and agile organization.\nThe Company is implementing the program and anticipates investing approximately $60 to $65 million (as disclosed in Note 4, \"Restructuring Charges,\" approximately $10 to $15 million of these investments will be in the form of restructuring charges) over the life of the program, which is expected to be finalized as we exit fiscal 2024. Elements of these investments could include such cash costs as capital expenditures, restructuring costs, third-party support, and incentive costs. Total program expenses were approximately $17 million for the year ended August 31, 2022, of which $14 million were recorded within SG&A expenses and were largely comprised of third party support costs and $3 million were recorded within restructuring expenses (see Note 4, \"Restructuring Charges,\" below).\nNote 4. Restructuring Charges\nThe Company has undertaken or committed to various restructuring initiatives, including workforce reductions, leadership changes, plant consolidations to reduce manufacturing overhead, satellite office closures, the continued movement of production and product sourcing to low-cost alternatives and the centralization and standardization of certain administrative functions. Liabilities for severance are generally to be paid within twelve months, while future lease payments related to facilities vacated as a result of restructuring are to be paid over the underlying remaining lease terms.\nDuring fiscal 2019, the Company announced a restructuring plan focused on (i) the integration of the Enerpac and Hydratight businesses (IT&S segment), (ii) the strategic exit of certain commodity-type services in our North America Services operations (IT&S segment) and (iii) driving efficiencies within the overall corporate structure. In the third quarter of fiscal 2020, the Company announced the expansion and revision of this plan, which further simplified and flattened the corporate structure through elimination of redundancies between the segment and corporate functions, while enhancing our commercial and marketing processes to become even closer to our customers. Upon assessment of the Company's operating structure by the Company's new President & Chief Executive Officer (hired effective October 2021), the Company recorded $5.2 million of charges for the year ended August 31, 2022 in order to further simplify and streamline the organizational structure. Restructuring charges associated the fiscal 2019 plan were $2.1 million and $6.6 million for the year ended August 31, 2021 and 2020, respectively. The total cumulative charges for the 2019 plan, which ended in the third quarter of fiscal year 2022, were $18.0 million.\nOn June 27, 2022, the Company approved a new restructuring plan in connection with the initiatives identified as part of the ASCEND transformation program (see Note 3, ASCEND Transformation Program) to drive greater efficiency and productivity in global selling, general and administrative resources. The total costs of this plan were then estimated at $6 to $10 million, constituting predominately severance and other employee-related costs to be incurred as cash expenditures impacting both IT&S and Corporate. On September 23, 2022, the Company approved an updated restructuring plan. The costs of this updated plan (which includes the amounts for the plan approved in June) are estimated at $10 to $15 million. These costs are expected to be incurred over the expected duration of the transformation program, ending in the fourth quarter of fiscal year\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\n2024. For the year ended August 31, 2022, the Company recorded $3.0 million of restructuring charges associated with the ASCEND transformation program.\nThe following summarizes restructuring reserve activity (which for the year ended August 31, 2022 excludes $0.8 million and $0.5 million of charges associated with the 2019 Plan for IT&S and Corporate, respectively, associated with the accelerated vesting of equity awards which has no impact on the restructuring reserve) for the IT&S segment and Corporate (in thousands):\nYear Ended August 31, 2022\n2019 Plan ASCEND Plan\nIT&S Corporate IT&S Corporate\nBalance as of August 31, 2021 $ 1,737 $ 26 $ - $ -\nRestructuring charges 2,812 1,052 2,228 824\nCash payments (4,212) (1,072) (220) (27)\nImpact of changes in foreign currency rates (125) - - -\nBalance as of August 31, 2022 $ 212 $ 6 $ 2,008 $ 797\nYear Ended August 31, 2021\n2019 Plan\nIT&S Corporate\nBalance as of August 31, 2020 $ 1,443 $ 267\nRestructuring charges 2,096 9\nCash payments (1,791) (250)\nImpact of changes in foreign currency rates (11) -\nBalance as of August 31, 2021 $ 1,737 $ 26\nTotal restructuring charges (inclusive of the Other segment) being reported in \"Restructuring charges\" were $8.1 million and $2.4 million for the years ended August 31, 2022 and 2021, respectively.\nThere was a restructuring benefit of less than $0.1 million related to the Other Segment in the year ended August 31, 2022 and restructuring charges of $0.3 million in the year ended August 31, 2021. Restructuring reserves for the Other Segment were negligible for both the years ended August 31, 2022 and 2021.\nNote 5. Acquisitions\nOn January 7, 2020, the Company acquired 100% of the stock of HTL Group (\"HTL\"), a provider of controlled bolting products, calibration and repair services, and tool rental services. The acquisition of HTL provided the Company with a complete line of bolting products and enhanced our European rental capabilities. The Company acquired all of the assets and assumed certain liabilities of HTL for a final purchase price of $33.3 million. The final purchase price allocation resulted in $11.3 million of goodwill (which is not deductible for tax purposes), $16.1 million of intangible assets, and $6.7 million of property, plant and equipment. The intangible assets were comprised of $3.3 million of indefinite-lived tradenames, $12.1 million of amortizable customer relationships and $0.7 million of amortizable patents. The impact on the remaining balance sheet line items was not material.\nThis acquisition generated net sales of $11.0 million, $13.6 million and $6.3 million for the year ended August 31, 2022, 2021 and 2020, respectively, which are reported within the IT&S reportable segment. This acquisition does not meet the significance tests to require pro forma financial information otherwise required for acquisitions.\nNote 6. Discontinued Operations and Other Divestiture Activities\nDiscontinued Operations\nOn October 31, 2019, as part of our overall strategy to become a pure-play industrial tools and services company, the Company completed the sale of the businesses comprising its former EC&S segment to wholly owned subsidiaries of BRWS Parent LLC, a Delaware limited liability company and affiliate of One Rock Capital Partners II, LP, for a sales price of approximately $215.8 million, inclusive of $1.3 million of purchase price from the customary finalization of working capital negotiations. Approximately $3.0 million of the purchase price was to be paid in four equal quarterly installments after closing, of which $0.7 million was received in the year ended August 31, 2021 (this final payment was received greater than one year from the divestiture date and, as such, is reflected in \"Cash provided by financing activities - discontinued operations\" within\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nthe Consolidated Statements of Cash Flows). In connection with the completion of the sale and after consideration of working capital adjustments, the Company recorded, in fiscal 2020, a net loss of $4.7 million comprised of a loss of $23.0 million representing the excess of the net assets (exclusive of deferred tax assets and liabilities associated with subsidiaries of the Company whose stock was sold as part of the transaction) as compared to the purchase price less costs to sell and the recognition in earnings of the cumulative effect of foreign currency exchange gains and losses during the year largely offset by an income tax benefit of $18.3 million associated with the write off of the net deferred tax liability on subsidiaries of the EC&S segment for which the stock was divested. The Company also recognized in conjunction with the completion of the sale an additional $3.3 million of impairment & divestiture costs associated with the accelerated vesting of restricted stock awards associated with employees terminated as part of the transaction and $2.7 million of additional divestiture charges which were necessary to complete the transaction. The Company maintains financial exposure associated with this divestiture due to certain retained liabilities of which said activity is recorded in \"loss from discontinued operations, net of income taxes\" within the Consolidated Statements of Earnings for the periods subsequent to the divestiture.\nThe following represents the detail of \"Loss from discontinued operations, net of income taxes\" within the Consolidated Statements of Earnings (in thousands):\nYear Ended August 31,\n2022 2021 2020 *\nNet sales $ - $ - $ 67,010\nCost of products sold - - 49,749\nGross profit - - 17,261\nSelling, general and administrative expenses 4,842 1,456 11,561\nRestructuring benefit - - (11)\nImpairment & divestiture charges - - 28,972\nOperating loss (4,842) (1,456) (23,261)\nFinancing costs, net - - 14\nOther income, net - - (104)\nLoss before income tax (benefit) expense (4,842) (1,456) (23,171)\nIncome tax (benefit) expense (937) 679 (18,337)\nNet loss from discontinued operations $ (3,905) $ (2,135) $ (4,834)\n* \"Loss from discontinued operations, net of income taxes\" for the year ended August 31, 2020 presented in the table above includes the results of the EC&S segment for the two months ended October 31, 2019 (the divestiture date) as well as the ancillary impacts from certain retained liabilities subsequent to the divestiture. As a result of the classification of the segment as assets and liabilities held for sale for the two months ended October 31, 2019, the Company did not record amortization or depreciation expense in the results of operations in accordance with US GAAP. Furthermore, the Company excluded EC&S segment employees from the fiscal 2020 bonus compensation plan, accordingly there are no expenses associated with the plan for that period.\nOther Divestiture Activities\nOn September 20, 2019, the Company completed the sale of the UNI-LIFT product line, a component of our Milwaukee Cylinder business (IT&S segment), for net cash proceeds of $7.5 million (inclusive of the settlement of working capital adjustments and the buyer achieving certain criteria which met the requirement for payment of $1.5 million of contingent proceeds). The transaction resulted in an impairment & divestiture benefit of $6.3 million for the year ended August 31, 2020 recorded as an \"Impairment & divestiture benefit\" within the Consolidated Statements of Earnings.\nAfter the sale of the UNI-LIFT product line, the Company determined that the remaining Milwaukee Cylinder business was a non-core asset, did not align with the strategic objectives of the Company and, as a result, the Company committed to a plan to sell this business. The Company completed the divestiture of the Milwaukee Cylinder business on December 2,\n2019 for a negligible amount. The Company recorded impairment & divestiture charges of $4.5 million for the year ended August 31, 2020 comprised of impairment charges of $2.5 million representing the excess of net assets held for sale compared to the anticipated proceeds less costs to sell, $1.7 million associated with our withdrawal from the multi-employer pension plan associated with that business and $0.3 million of other divestiture related charges and true-ups of retained liabilities.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe historical results of the Milwaukee Cylinder business, inclusive of the UNI-LIFT product line, (which had net sales of $2.9 million in the year ended August 31, 2020) are not material to the consolidated financial results.\nOn October 22, 2019, the Company completed the sale of the Connectors product line (IT&S segment) for net cash proceeds of $2.7 million, which resulted in an impairment & divestiture benefit of $1.0 million in the year ended August 31, 2020. The historical results of the Connectors product line (which had net sales of $0.2 million for the year ended August 31, 2020) are not material to the consolidated financial results.\nNote 7. Goodwill, Intangible Assets and Long-Lived Assets\nChanges in the gross carrying value of goodwill and intangible assets result from changes in foreign currency exchange rates, business acquisitions, divestitures and impairment charges. The changes in the carrying amount of goodwill for the years ended August 31, 2022 and 2021 by operating segment are as follows (in thousands):\nIT&S Other Total\nBalance as of August 31, 2020 $ 263,537 $ 17,617 $ 281,154\nImpairment charge - (5,656) (5,656)\nImpact of changes in foreign currency rates 1,550 545 2,095\nBalance as of August 31, 2021 265,087 12,506 277,593\nImpairment charge - (1,297) (1,297)\nImpact of changes in foreign currency rates (18,347) - (18,347)\nBalance as of August 31, 2022 $ 246,740 $ 11,209 $ 257,949\nThe gross carrying value and accumulated amortization of the Companys intangible assets are as follows (in thousands):\nWeighted Average Amortization Period (Year) August 31, 2022 August 31, 2021\nGross Accumulated Amortization Net Book Value Gross Accumulated Amortization Net Book Value\nAmortizable intangible assets:\nCustomer relationships 14 $ 135,101 $ 117,275 $ 17,826 $ 142,453 $ 114,463 $ 27,990\nPatents 11 13,708 13,104 604 14,492 13,688 804\nTrademarks and tradenames 12 3,132 2,329 803 3,307 2,391 916\nIndefinite lived intangible assets:\nTradenames N/A 22,274 - 22,274 24,835 - 24,835\n$ 174,215 $ 132,708 $ 41,507 $ 185,087 $ 130,542 $ 54,545\nThe Company estimates that amortization expense for future years is estimated to be: $5.2 million in fiscal 2023, $3.6 million in fiscal 2024, $3.0 million in fiscal 2025, $1.8 million in fiscal 2026, $1.7 million in fiscal 2027 and $4.0 million in aggregate thereafter. The future amortization expense amounts represent estimates and may be impacted by future acquisitions, divestitures or changes in foreign currency exchange rates, among other causes.\nFiscal 2022 Impairment Charges\nThe carryover effects from the COVID-19 pandemic coupled with current year labor, supply chain and inflation challenges had a more than anticipated effect on the Cortland Industrial business. Therefore, in conjunction with our annual goodwill impairment assessment, the Company recognized a $1.3 million goodwill impairment charge associated with the Cortland Industrial reporting unit (Other Segment) within \"Impairment & divestiture charges (benefit)\" in the Consolidated Statements of Earnings.\nIn addition, during fiscal 2022, the Company recorded \"Impairment & divestiture charges\" of $1.1 million on indefinite lived intangible assets; $0.8 million was related to a customer relationship intangible asset whereby the Company ceased operations in the country associated with said customers and $0.3 million was related to tradename intangible asset on a discontinued secondary brand.\nFiscal 2021 Impairment Charges\nIn the fourth quarter of fiscal 2021, the Cortland Industrial business lagged behind our IT&S segment with respect to recovery in demand from the COVID-19 pandemic. Further, though volumes did increase from previous quarters, it became clear that the business was not on track to realize the annual savings from the prior years' footprint optimization actions at the\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\npace initially projected. Therefore, in conjunction with our annual goodwill impairment assessment, the Company recognized a $5.7 million goodwill impairment charge associated with the Cortland Industrial reporting unit (Other Segment) within \"Impairment & divestiture charges (benefit)\" in the Consolidated Statements of Earnings.\nNote 8. Debt\nThe following is a summary of the Companys indebtedness (in thousands):\nAugust 31,\n2022 2021\nShort-term debt $ 4,000 $ -\nSenior Credit Facility\nRevolver 200,000 175,000\nTotal Debt $ 204,000 $ 175,000\nSenior Credit Facility\nIn March 2019, the Company entered into a senior credit facility (the \"Senior Credit Facility\") with a syndicate of banks, to among other things, (i) expand the multi-currency revolving line of credit from $300 million to $400 million, (ii) extend the maturity of the Company's Senior Credit Facility from May 2020 to March 2024 (no required principal payments prior to maturity) and (iii) modify certain other provisions of the credit agreement including a reduction in pricing. The Senior Credit Facility was initially comprised of a $400 million revolving line of credit and a $200 million term loan.\nAt August 31, 2022, there were $200 million borrowings under the revolving line of credit and $190.8 million of available borrowing capacity under the revolving line of credit. Additionally, at August 31, 2022, there was $4 million borrowings against our Credit Facility swingline, which has been reflected as \"Short-term debt\" on the Consolidated Balance Sheets.\nThe Senior Credit Facility provided the option for future expansion, subject to certain conditions, through a $300 million accordion and/or a $200 million incremental term loan. Borrowings under the Senior Credit Facility bore interest at a variable rate based on LIBOR or a base rate, ranging from 1.125% to 2.00% in the case of loans bearing interest at LIBOR and from 0.125% to 1.00% in the case of loans bearing interest at the base rate. In addition, a non-use fee was payable quarterly on the average unused amount of the revolving line of credit ranging from 0.15% to 0.3% per annum, based on the Company's net leverage.\nThe Senior Credit Facility contained two financial covenants which are a maximum leverage ratio of 3.75:1 and a minimum interest coverage ratio of 3.5:1. The Senior Credit Facility provided for adjustments to the underlying ratios in connection with certain transaction, including an increase to the leverage ratio from 3.75 to 4.25 during the four fiscal quarters after a significant acquisition.\nThe Company was in compliance with all financial covenants at August 31, 2022. Borrowings under the Senior Credit Facility were secured by substantially all personal property assets of the Company and its domestic subsidiary guarantors and certain equity interests owned by the foreign law pledgors.\nOn September 9, 2022, the Company refinanced the Senior Credit Facility with a new $600 million senior credit facility, comprised of a $400 million revolving line of credit and a $200 million term loan, which will mature in September 2027. See Note 18, \"Subsequent Event\" in the notes to the consolidated financial statements for further details.\nCash Paid for Interest\nThe Company made cash interest payments of $3.1 million, $3.7 million and $18.7 million in fiscal 2022, 2021 and 2020, respectively.\nNote 9. Fair Value Measurements\nThe Company assesses the inputs used to measure the fair value of financial assets and liabilities using a three-tier hierarchy. Level 1 inputs include unadjusted quoted prices for identical instruments and are the most observable. Level 2 inputs include quoted prices for similar assets and observable inputs such as interest rates, foreign currency exchange rates, commodity rates and yield curves. Level 3 inputs are not observable in the market and include managements own judgments about the assumptions market participants would use in pricing an asset or liability.\nThe fair value of the Companys cash and cash equivalents, accounts receivable, accounts payable and variable rate long-term debt approximated book value at both August 31, 2022 and 2021 due to their short-term nature and the fact that the interest rates approximated market rates. Foreign currency exchange contracts and interest rate swaps are recorded at fair value.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe fair value of the Company's foreign currency exchange contracts was a net asset of less than $0.1 million at August 31, 2022 and a net liability of less than $0.1 million at August 31, 2021. The fair value of the foreign currency exchange contracts were based on quoted inactive market prices and therefore classified as Level 2 within the valuation hierarchy.\nAs discussed in Note 5, \"Acquisitions\", the Company acquired HTL Group in the year ended August 31, 2020 and recorded the assets acquired and liabilities assumed at fair value, of which the most significant judgments were associated with intangible assets (including tradenames, customer relationships and patents) and property, plant and equipment. As discussed in Note 7, Goodwill, Intangible Assets and Long-Lived Assets, the Company recorded impairments to goodwill in the years ended August 31, 2022 and 2021. The fair value of the goodwill, tradenames, customer relationships and patents acquired and/or impaired were determined utilizing generally accepted valuation techniques, specifically, forecasting future revenues and/or using a market royalty rate. The fair value of property, plant and equipment were also determined utilizing generally accepted valuation techniques, specifically utilizing an approach of assessing the replacement/reproduction cost of a new asset and adjusting for the asset's current physical deterioration. These valuations represent Level 3 assets measured at fair value on a nonrecurring basis.\nNote 10. Derivatives\nAll derivatives are recognized in the balance sheet at their estimated fair value. The Company does not enter into derivatives for speculative purposes. Changes in the fair value of derivatives (not designated as hedges) are recorded in earnings along with the gain or loss on the hedged asset or liability.\nThe Company is exposed to market risk for changes in foreign currency exchange rates due to the global nature of its operations. In order to manage this risk, the Company utilizes foreign currency exchange contracts to reduce the exchange rate risk associated with recognized non-functional currency balances. The effects of changes in exchange rates are reflected concurrently in earnings for both the fair value of the foreign currency exchange contracts and the related non-functional currency asset or liability. These derivative gains and losses offset foreign currency gains and losses from the related revaluation of non-functional currency assets and liabilities (amounts included in \"Other (income) expense\" in the Consolidated Statements of Earnings). The U.S. dollar equivalent notional value of these short duration foreign currency exchange contracts was $16.7 million and $16.0 million at August 31, 2022 and 2021, respectively. The fair value of outstanding foreign currency exchange contracts was an asset less than $0.1 million at August 31, 2022 and a liability of less than $0.1 million at August 31, 2021. Net foreign currency losses (included in \"Other expense (income)\" in the Consolidated Statements of Earnings) related to these derivative instruments are as follows (in thousands):\nYear Ended August 31,\n2022 2021 2020\nForeign Currency losses $ (319) $ (63) $ (594)\nThe Company was the fixed-rate payor on an interest rate swap contract that fixed the LIBOR-based index used to determine the interest rates charged on a total of $100.0 million of the Company's LIBOR-based variable rate borrowings on the revolving line of credit. The contract carried a fixed rate of 0.259% and expired in August 2021. The swap agreement qualified as a hedging instrument and was designated as a cash flow hedge of forecasted LIBOR-based interest payments. The change in the fair value of the interest rate swap, a gain of $0.1 million in the year ended August 31, 2021 was recorded in other comprehensive income.\nNote 11. Leases\nAs of August 31, 2022, the Company had operating leases for real estate, vehicles, manufacturing equipment, IT equipment and office equipment. The Company did not have significant finance leases during the year ended August 31, 2022. Our leases typically range in term from 3 to 15 years and may contain renewal options for periods up to 5 years at our discretion. Our leases generally contain payments that are primarily fixed; however, certain lease arrangements contain variable payments, which are expensed as incurred and not included in the measurement of ROU assets and lease liabilities. These amounts include payments affected by changes in the Consumer Price Index and executory costs (such as real estate taxes, utilities and common-area maintenance), which are based on usage or performance. In addition, our leases generally do not include material residual value guarantees or material restrictive covenants.\nDuring the year ended August 31, 2021, the Company sold and subsequently leased back a portion of its manufacturing facility in China as part of a global footprint rationalization initiative. In connection with the transaction, the Company recognized a gain of $10.0 million. The gain is recorded in \"Selling, general and administrative expenses\" within the Consolidated Statements of Earnings and in \"Other non-cash (benefits) charges\" within the Consolidated Statements of Cash\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nFlows. The Company also incurred $4.6 million of closing related costs and value-added and land taxes associated with this transaction also included in \"Selling, general and administrative expenses\" within the Consolidated Statements of Earnings.\nThe components of lease expense for the year ended August 31, 2022 and 2021 were as follows (in thousands):\nYear Ended August 31,\n2022 2021\nLease Cost:\nOperating lease cost $ 14,316 $ 15,170\nShort-term lease cost 1,714 1,611\nVariable lease cost 3,609 3,086\nSupplemental cash flow and other information related to leases for the year ended August 31, 2022 and 2021 were as follows (in thousands):\nYear Ended August 31,\n2022 2021\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases $ 14,166 $ 15,240\nRight-of-use assets obtained in exchange for new lease liabilities:\nOperating leases 4,584 9,197\nSupplemental balance sheet information related to leases at August 31, 2022 and 2021 were as follows (in thousands):\nAugust 31, 2022 August 31, 2021\nOperating leases:\nOther long-term assets $ 43,273 $ 51,589\nOther current liabilities 10,709 11,917\nOther long-term liabilities 33,477 40,568\nTotal operating lease liabilities $ 44,186 $ 52,485\nWeighted Average Remaining Lease Term:\nOperating leases 6.4 years 6.7 years\nWeighted Average Discount Rate:\nOperating leases 4.4 % 4.3 %\nA summary of the future minimum lease payments due under operating leases with terms of more than one year at August 31, 2022 is as follows (in thousands):\nOperating Leases\n2023 $ 12,283\n2024 10,273\n2025 8,131\n2026 5,531\n2027 3,195\nThereafter 11,569\nTotal minimum lease payments 50,982\nLess imputed interest (6,796)\nPresent value of net minimum lease payments $ 44,186\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nNote 12. Employee Benefit Plans\nU.S. Defined Benefit Pension Plans\nAll of the U.S. defined benefit pension plans are frozen, and as a result, plan participants no longer earn additional benefits. The following table provides detail of changes in the projected benefit obligations, the fair value of plan assets and the funded status of the Companys U.S. defined benefit pension plans as of the respective August 31 measurement date (in thousands):\n2022 2021\nReconciliation of benefit obligations:\nBenefit obligation at beginning of year $ 47,147 $ 49,640\nInterest cost 1,165 1,156\nActuarial (gain) loss (8,197) (729)\nBenefits paid (2,980) (2,920)\nBenefit obligation at end of year $ 37,135 $ 47,147\nReconciliation of plan assets:\nFair value of plan assets at beginning of year $ 39,696 $ 39,935\nActual return on plan assets (5,658) 1,990\nCompany contributions 108 691\nBenefits paid from plan assets (2,980) (2,920)\nFair value of plan assets at end of year 31,166 39,696\nFunded status of the plans (underfunded) $ (5,969) $ (7,451)\nThe following table provides detail on the Companys domestic net periodic benefit expense (in thousands):\nYear ended August 31,\n2022 2021 2020\nInterest cost $ 1,165 $ 1,156 $ 1,331\nExpected return on assets (2,060) (1,610) (1,770)\nAmortization of actuarial loss 1,219 1,322 1,212\nNet periodic benefit expense $ 324 $ 868 $ 773\nAs of August 31, 2022 and 2021, $18.3 million and $19.5 million, respectively, of pension plan actuarial losses, which have not yet been recognized in net periodic benefit cost, were included in accumulated other comprehensive loss, net of income taxes. During fiscal 2023, $0.9 million of these actuarial losses are expected to be recognized in net periodic benefit cost.\nWeighted-average assumptions used to determine U.S. pension plan obligations as of August 31 and weighted-average assumptions used to determine net periodic benefit cost for the years ended August 31 are as follows:\n2022 2021 2020\nAssumptions for benefit obligations:\nDiscount rate 4.75 % 2.55 % 2.40 %\nAssumptions for net periodic benefit cost:\nDiscount rate 2.55 % 2.40 % 2.90 %\nExpected return on plan assets 5.45 % 4.20 % 4.60 %\nThe Company's objective for its pension plan is to achieve an asset and liability duration match so that interim fluctuations in funded status should be limited by increasing the correlation between assets and liabilities. As such, the plan assets are invested to maintain funded ratios over the long term, while managing the risk that funded ratios fall meaningfully below 100%. In fiscal 2022, the plan assets were invested in a mix of 50% duration-matched fixed income securities and 50% equity securities. During fiscal 2021, the plan portfolio was invested in 70% fixed income securities and 30% equity securities. Cash balances are maintained at levels adequate to meet near-term plan expenses and benefit payments. Investment risk is measured and monitored on an ongoing basis. At August 31, 2022, the Companys overall expected long-term rate of return for assets in U.S. pension plans was 5.70%. The expected long-term rate of return is based on the portfolio as a whole and not on the sum of the returns on individual asset categories. The target return is based on historical returns adjusted to reflect the current view of the long-term investment market and our updated 50% investment mix between fixed income and equity securities.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe U.S. pension plan investment allocations by asset category were as follows (dollars in thousands):\nYear Ended August 31,\n2022 % 2021 %\nCash and cash equivalents $ - - % $ - - %\nIncome receivable 31 0.1 49 0.1\nFixed income securities:\nU.S. Treasury Securities 4,852 15.6 4,825 12.2\nCorporate Bonds - - - -\nMutual funds 11,395 36.6 23,564 59.3\n16,247 52.2 28,389 71.5\nEquity securities:\nMutual funds 14,888 47.7 11,258 28.4\nTotal plan assets $ 31,166 100.0 % $ 39,696 100.0 %\nThe fair value of mutual funds are based on unadjusted quoted market prices and therefore are classified as Level 1 within the fair value hierarchy under US GAAP. U.S. Treasury Securities and Corporate Bonds are valued using Level 2 inputs, as defined in Note 9, Fair Value Measurements.\nProjected benefit payments from plan assets to participants in the Companys U.S. pension plans are $3.0 million for fiscal 2023 and $3.1 million per year for each of the next four years and $14.1 million in aggregate for the following five years. The Company made a contribution of $0.1 million to the U.S. pension plans in September of fiscal 2022. The Company does not plan to make a contribution to the plan in fiscal 2023.\nForeign Defined Benefit Pension Plans\nThe Company has eight significant foreign defined benefit pension plans which cover certain existing and former employees of businesses outside the U.S. Most of the participants in the foreign defined benefit pension plans are inactive and no longer earning additional benefits. The following table provides detail of changes in the projected benefit obligations, the fair value of plan assets and the funded status of the Companys significant foreign defined benefit pension plans as of the respective August 31 measurement date (in thousands):\n2022 2021\nReconciliation of benefit obligations:\nBenefit obligation at beginning of year $ 14,421 $ 14,297\nEmployer service costs 90 116\nInterest cost 159 198\nActuarial (gain)/loss (3,859) 51\nBenefits paid (200) (293)\nSettlements (480) -\nCurrency impact (2,114) 52\nBenefit obligation at end of year $ 8,017 $ 14,421\nReconciliation of plan assets:\nFair value of plan assets at beginning of year $ 9,396 $ 8,980\nActual return on plan assets (1,159) 532\nCompany contributions 44 56\nBenefits paid from plan assets (680) (293)\nCurrency impact (1,393) 121\nFair value of plan assets at end of year 6,208 9,396\nFunded status of the plans (underfunded) $ (1,808) $ (5,025)\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following table provides detail on the Companys foreign net periodic benefit expense (in thousands):\nYear ended August 31,\n2022 2021 2020\nEmployer service costs $ 90 $ 116 $ 284\nInterest cost 159 198 171\nExpected return on assets (316) (347) (357)\nAmortization of net prior service credit 3 4 (18)\nAmortization of net loss 112 139 205\nSettlement 145 - -\nIncome of special events - - (728)\nNet periodic benefit expense (income) $ 193 $ 110 $ (443)\nThe weighted average discount rate utilized for determining the benefit obligation at August 31, 2022 and 2021 was 3.6% and 1.3%, respectively. The plan assets of these foreign pension plans consist primarily of participating units in fixed income and equity securities and insurance contracts. The Companys overall expected long-term rate of return on these investments is 3.9%. During fiscal 2023, the Company does not anticipate contributing to these pension plans.\nIn fiscal 2020, the Company moved certain employees in a foreign pension plan into a multi-employer pension plan which triggered a curtailment. The curtailment resulted in a reduction to the projected benefit obligation of that plan of $1.7 million, of which $0.7 million was recorded as a component of Other expense (income), net within the Consolidated Statements of Earnings and the remaining $1.0 million was recorded through Other comprehensive income on the Consolidated Statements of Comprehensive Income (Loss).\nProjected benefit payments to participants in the these foreign plans are $0.3 million in fiscal 2023, $0.2 million in each fiscal 2024, 2025 and 2026, $0.3 million in fiscal 2027 and $1.8 million in aggregate for the following five years.\nOther Postretirement Health Benefit Plans\nThe Company provides other postretirement health benefits (OPEB) to certain existing and former employees of domestic businesses it acquired, who were entitled to such benefits prior to acquisition. These unfunded plans had a benefit obligation of $1.9 million and $2.3 million at August 31, 2022 and 2021, respectively. These obligations are determined utilizing assumptions consistent with those used for our U.S. pension plans and a health care cost trend rate of 6.3%, trending downward to 5.0% by the year 2026, and remaining level thereafter. Net periodic benefit costs for other postretirement benefits was income of $0.1 million, $0.2 million and $0.3 million for the year ended August 31, 2022, 2021 and 2020, respectively. Benefit payments from the plan are funded through participant contributions and Company contributions. Benefit payments are projected to be $0.2 million in fiscal 2023.\nDefined Contribution Benefit Plans\nThe Company maintains a 401(k) plan for substantially all full time U.S. employees (the 401(k) Plan). Under plan provisions, the Company can fund either cash or issue new shares of Class A common stock for its contributions. Amounts are allocated to accounts set aside for each employees retirement. Employees generally may contribute up to 50% of their compensation to individual accounts within the 401(k) Plan.\nWhile contributions vary, the Company's match contribution is $0.50 for every $1 contributed by employees, up to 8% of the employees' eligible pay. These match contributions are made on every payroll run, meaning the contribution is immediately 100% vested. In response to the COVID-19 pandemic, the Company temporarily suspended its 401(k) match in May 2020 (fiscal 2020) and reinstated the 401(k) match in January 2021 (fiscal 2021). In addition, the Company may make an annual, discretionary contribution of up to 3% of employees' eligible pay to employees employed as of the end of the plan year. The discretionary contribution has a three-year vesting period. The Company elected not to provide a discretionary contribution for the year ended August 31, 2022. The Company also maintains a Restoration Plan that allows eligible highly compensated employees (as defined by the Internal Revenue Code) to receive a core contribution as if no IRS limits were in place. Company contributions to the Restoration Plan are made in the form of its Class A common stock and contributed into each eligible participants deferred compensation plan. The Company has not contributed in fiscal 2022, 2021 or fiscal 2020. Expense recognized related to the 401(k) plan totaled $2.2 million, $1.1 million and $1.4 million for the year ended August 31, 2022, 2021 and 2020, respectively.\nIn addition to the 401(k) plan, the Company sponsors a non-qualified supplemental executive retirement plan (the SERP Plan). The SERP Plan is an unfunded defined contribution plan that covers certain current and former executive employees\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nand has an annual contribution formula based on age and years of service (with Company contributions ranging from 3% to 6% of eligible wages). This unfunded plan had a $1.1 million and $1.3 million obligation at August 31, 2022 and 2021, respectively. Expense recognized for the SERP Plan was $0.2 million, $0.1 million and $0.3 million for fiscal 2022, 2021 and 2020, respectively.\nDeferred Compensation Plan\nThe Company maintains a deferred compensation plan to allow eligible U.S. employees to defer receipt of current cash compensation and restricted stock units vesting in order to provide future savings benefits. Eligibility is limited to employees who earn compensation that exceeds certain pre-defined levels. Participants have the option to invest their deferrals in a fixed income investment, a defined set of mutual funds, and/or, with respect to deferrals of restricted stock units, in Company common stock. The fixed income and mutual fund portion of the plan is unfunded, and therefore all compensation deferred under the plan is held by the Company and commingled with its general assets. Liabilities of $12.9 million and $14.5 million are included in the Consolidated Balance Sheets at August 31, 2022 and 2021, respectively, to reflect the unfunded portion of the deferred compensation liability. The Company recorded expense in \"Financing costs, net\" of $0.7 million, $1.2 million and $1.1 million for the years ended August 31, 2022, 2021 and 2020, respectively, for the non-funded return on participant deferrals. Company common stock contributions to fund the plan are held in a rabbi trust, accounted for in a manner similar to treasury stock and are recorded at cost in Stock held in trust within shareholders equity on the Consolidated Balance Sheets with the corresponding deferred compensation liability also recorded within shareholders equity on the Consolidated Balance Sheets. Because no investment diversification is permitted within the trust, changes in fair value of Enerpac Tool Group common stock are not recognized.\nNote 13. Income Taxes\nEarnings (loss) before income taxes from continuing operations, are summarized as follows (in thousands):\nYear Ended August 31,\n2022 2021 2020\nDomestic $ 10,176 $ 1,292 $ (9,058)\nForeign 13,816 42,683 16,907\n$ 23,992 $ 43,975 $ 7,849\nBoth domestic and foreign pre-tax earnings from continuing operations are impacted by changes in operating earnings, acquisition and divestiture activities, restructuring charges and the related benefits, growth investments, debt levels and the impact of changes in foreign currency exchange rates. In fiscal 2022, domestic and foreign earnings included non-cash impairment and other divestiture charges of $1.3 million and $1.1 million, respectively. In fiscal 2021, domestic and foreign earnings included non-cash impairment and other divestiture charges of $4.7 million and $1.5 million, respectively. In fiscal 2020, domestic and foreign earnings included $(2.6) million and $(0.6) million of non-cash impairment and other divestiture benefits.\nIncome tax expense from continuing operations is summarized as follows (in thousands):\nYear ended August 31,\n2022 2021 2020\nCurrently payable:\nFederal $ 1,765 $ (18,243) $ (35)\nForeign 7,824 12,441 10,004\nState 164 539 142\n9,753 (5,263) 10,111\nDeferred:\nFederal 1,580 9,677 (7,791)\nForeign (7,538) 185 (1,632)\nState 606 (836) 1,604\n(5,352) 9,026 (7,819)\nIncome tax expense $ 4,401 $ 3,763 $ 2,292\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nIncome tax expense from continuing operations recognized in the accompanying consolidated statements of earnings differs from the amounts computed by applying the federal income tax rate to earnings from continuing operations before income tax expense. A reconciliation of income taxes at the federal statutory rate to the effective tax rate is summarized in the following table:\nYear ended August 31,\n2022 2021 2020\nFederal statutory rate 21.0 % 21.0 % 21.0 %\nState income taxes, net of Federal effect 2.3 (0.2) (0.6)\nTax on foreign earnings (1)\n1.3 2.8 38.7\nForeign derived intangible income deduction (4.5) (3.2) -\nCompensation adjustment 6.6 3.1 6.6\nImpairment and other divestiture charges (2)\n1.1 1.6 3.3\nValuation allowance additions and releases (3)\n2.1 7.1 (8.1)\nChanges in liability for unrecognized tax benefits 3.4 (18.5) (5.3)\nU.S. legislative changes, net impact - (9.8) (32.5)\nTaxable liquidation of subsidiaries (4)\n(11.4) - 52.6\nForeign non-deductible expenses 8.5 1.2 7.4\nChanges in tax rates (3.6) (3.4) (9.0)\nAudits and adjustments (5)\n(6.7) 8.0 (27.4)\nResearch and development tax credit (2.5) (1.8) (11.5)\nOther items 0.7 0.7 (6.0)\nEffective income tax rate 18.3 % 8.6 % 29.2 %\n(1) The Company generated $1.3 million, $1.7 million and $5.4 million of withholding tax expense for fiscal 2022, 2021 and 2020, respectively, and $2.3 million, $4.6 million and $4.0 million of foreign-derived tax credits for fiscal 2022, 2021 and 2020, respectively.\n(2) Fiscal 2022, 2021 and 2020 pretax earnings include $2.4 million, $6.2 million and $(3.2) million, respectively, in impairment & divestiture charges (benefits) related to goodwill, intangible assets, tangible assets and the cumulative effect of foreign currency rate changes of which $1.3 million, $3.5 million and $0.3 million, respectively, are not deductible for income tax purposes.\n(3) Incremental valuation allowances of $0.9 million and $4.9 million and $9.4 million were recorded in fiscal 2022, 2021 and 2020, respectively, due to uncertainty regarding realization of tax assets, which were offset by a reduction of $5.5 million, $9.1 million and $12.3 million of valuation allowances for fiscal 2022, 2021 and 2020, respectively.\n(4) During fiscal 2022 and 2020, the Company generated a net benefit of $2.7 million and a net expense of $4.1 million, respectively, as a result of taxable liquidations of subsidiaries.\n(5) During fiscal 2022, the Company generated $1.6 million of tax benefit related to audits and adjustments as compared to a tax expense of $3.5 million in fiscal 2021 and a tax benefit of $2.2 million in fiscal 2020.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nTemporary differences and carryforwards that gave rise to deferred tax assets and liabilities include the following items (in thousands):\nAugust 31,\n2022 2021\nDeferred income tax assets:\nOperating loss and tax credit carryforwards $ 78,717 $ 77,691\nCompensation related liabilities 6,002 6,110\nPostretirement benefits 5,995 8,364\nInventory 2,780 3,177\nLease liabilities 9,637 11,609\nBook reserves and other items 9,873 11,471\nTotal deferred income tax assets 113,004 118,422\nValuation allowance (61,630) (66,155)\nNet deferred income tax assets 51,374 52,267\nDeferred income tax liabilities:\nDepreciation and amortization (30,149) (29,444)\nLease assets (9,637) (11,609)\nOther items (1,024) (781)\nDeferred income tax liabilities (40,810) (41,834)\nNet deferred income tax asset (1)\n$ 10,564 $ 10,433\n(1) The net deferred income tax asset is reflected on the balance sheet in two categories: an asset of $17.9 million and $14.8 million for fiscal 2022 and 2021, respectively, is included in \"Other long-term assets\" and a liability of $7.3 million and $4.4 million for fiscal 2022 and 2021, respectively, is included in \"Deferred income taxes\".\nThe Company has $72.7 million and $2.5 million of gross state net operating loss and credit carryforwards, respectively, which are available to reduce future state tax liabilities. These state net operating loss carryforwards expire at various times through 2041. The Company also has $93.4 million and $6.7 million of foreign loss and credit carryforwards, respectively, and $2.5 million of U.S. credit carryforwards which are available to reduce certain future foreign and U.S. tax liabilities. Over half of the foreign loss carryforwards are not subject to any expiration dates, while the other balances expire at various times through 2032. The U.S. credit carryforwards expire at various times through 2032. The valuation allowance represents a reserve for deferred tax assets, including loss carryforwards and foreign tax credits, for which utilization is uncertain.\nThe Companys policy is to remit earnings from foreign subsidiaries only to the extent the remittance does not result in an incremental U.S. tax liability. The Company does not currently provide for the additional U.S. and foreign income taxes which would become payable upon remission of undistributed earnings of foreign subsidiaries. If all undistributed earnings were remitted, an additional income tax provision of $3.5 million would have been necessary as of August 31, 2022.\nChanges in the Companys gross liability for unrecognized tax benefits, excluding interest and penalties, are as follows (in thousands):\n2022 2021 2020\nBeginning balance $ 15,658 $ 23,205 $ 24,167\nIncreases based on tax positions related to the current year 433 381 869\nIncrease for tax positions taken in a prior period 1,084 7 304\nDecrease for tax positions taken in a prior period (57) - -\nDecrease due to lapse of statute of limitations (1,271) (7,931) (2,334)\nDecrease due to settlements (31) - -\nChanges in foreign currency exchange rates (436) (4) 199\nEnding balance $ 15,380 $ 15,658 $ 23,205\nSubstantially all of these unrecognized tax benefits, if recognized, would impact the effective income tax rate. As of August 31, 2022, 2021 and 2020, the Company recognized $4.5 million, $3.9 million and $4.5 million, respectively, for interest and penalties related to unrecognized tax benefits. The Company recognizes interest and penalties related to underpayment of income taxes as a component of income tax expense. With few exceptions, the Company is no longer subject to U.S. federal, state and foreign income tax examinations by tax authorities in major tax jurisdictions for years prior to fiscal 2010. The\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nCompany believes it is reasonably possible that the total amount of unrecognized tax benefits could decrease by up to $2.2 million throughout fiscal 2023.\nCash paid for income taxes, net of refunds, totaled $5.7 million, $7.8 million and $13.2 million during the years ended August 31, 2022, 2021 and 2020, respectively.\nNote 14. Capital Stock and Share Repurchases\nThe authorized common stock of the Company as of August 31, 2022 consisted of 168,000,000 shares of Class A common stock, $0.20 par value, of which 83,397,458 and 56,838,493 shares were issued and outstanding, respectively; 1,500,000 shares of Class B common stock, $0.20 par value, none of which are outstanding; and 160,000 shares of cumulative preferred stock, $1.00 par value (preferred stock), none of which have been issued. Holders of both classes of the Companys common stock are entitled to dividends, as the Companys Board of Directors may declare out of funds legally available, subject to any contractual restrictions on the payment of dividends or other distributions on the common stock. If the Company were to issue any of its preferred stock, no dividends could be paid or set apart on shares of common stock, unless paid in common stock, until dividends on all of the issued and outstanding shares of preferred stock had been paid or set apart for payment and provision had been made for any mandatory sinking fund payments.\nThe Company's Board of Directors approved four separate authorizations (September 2011, March 2014, October 2014 and March 2015) to repurchase up to 7,000,000 shares each of the Companys outstanding common stock. The Company suspended the initial share repurchase program in response to the COVID-19 pandemic in the third quarter of fiscal 2020 and, accordingly, did not repurchase shares during the year ended August 31, 2021. In March 2022, the Company's Board of Directors rescinded its prior share repurchase authorization and approved a new share repurchase program authorizing the repurchase of a total of 10,000,000 shares of the Company's outstanding common stock. The Company has repurchased 3,759,735 shares for $75.1 million during the year ended August 31, 2022. As of August 31, 2022, the maximum number of shares that may yet be purchased under this new program is 6,240,265. Since the inception of the initial share repurchase program in fiscal 2012, the Company has repurchased 26,558,965 shares of common stock for $742.8 million.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nEarnings Per Share\nThe reconciliation between basic and diluted earnings per share is as follows (in thousands, except per share amounts):\nYear Ended August 31,\n2022 2021 2020\nNumerator:\nNet earnings from continuing operations $ 19,591 $ 40,212 $ 5,557\nNet loss from discontinued operations (3,905) (2,135) (4,834)\nNet earnings $ 15,686 $ 38,077 $ 723\nDenominator:\nWeighted average common shares outstanding - basic 59,538 60,024 59,952\nNet effect of dilutive securities - stock based compensation plans 371 379 317\nWeighted average common shares outstanding - diluted 59,909 60,403 60,269\nEarnings per common share from continuing operations:\nBasic $ 0.33 $ 0.67 $ 0.09\nDiluted $ 0.33 $ 0.67 $ 0.09\nLoss per common share from discontinued operations:\nBasic $ (0.07) $ (0.04) $ (0.08)\nDiluted $ (0.07) $ (0.04) $ (0.08)\nEarnings per common share:\nBasic $ 0.26 $ 0.63 $ 0.01\nDiluted $ 0.26 $ 0.63 $ 0.01\nAnti-dilutive securities- stock based compensation plans (excluded from earnings per share calculation) 946 880 1,532\nNote 15. Stock Plans\nShare based awards may be granted to key employees and directors under the Enerpac Tool Group Corp. 2017 Omnibus Incentive Plan (as amended and restated November 9, 2020) (the Plan). At August 31, 2022, 7,825,000 shares of Class A common stock were authorized for issuance under the Plan (including 3,500,000 shares that were authorized for issuance at the January 2021 annual meeting) plus an additional 1,800,000 shares being registered to cover shares, if any, that become issuable, pursuant to the terms of the Plan, upon the expiration, cancellation or forfeiture of existing awards under our previously registered stock plans. At August 31, 2022, 3,569,579 shares were available for future award grants. The Plan permits the Company to grant share-based awards, including stock options, restricted stock, restricted stock units and performance shares (the \"Performance Shares\") to employees and directors. Options generally have a maximum term of ten years, an exercise price equal to 100% of the fair market value of the Companys common stock at the date of grant and generally vest 50% after three years and 100% after five years. The Companys restricted stock grants prior to 2017 generally have similar vesting provisions as options, while grants thereafter generally vest in equal installments over a three-year period. The Performance Shares include a three-year performance period. For Performance Shares issued prior to the year ended August 31, 2021, the awards were based 50% on achievement of an absolute free cash flow conversion target and 50% on the Companys total shareholder return (\"TSR\") relative to the S&P 600 SmallCap Industrial index. For the year ended August 31, 2021, all Performance Shares issued were based on the relative TSR metric. For the year ended August 31, 2022, the awards were based 50% on the relative TSR metric and 50% on the Company's three-year average return on invested capital. The provisions of share-based awards may vary by individual grant with respect to vesting period, dividend and voting rights, performance conditions and forfeitures.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nA summary of restricted stock units and performance shares activity during fiscal 2022 is as follows:\nNumber of\nShares Weighted-Average Fair Value at Grant Date (Per Share)\nOutstanding on August 31, 2021 1,017,658 $23.27\nGranted 896,217 19.39\nForfeited (263,234) 22.09\nVested (552,615) 22.34\nOutstanding on August 31, 2022 1,098,026 $20.73\nA summary of stock option activity during fiscal 2022 is as follows:\nShares Weighted-Average\nExercise Price\n(Per Share) Weighted-Average\nRemaining Contractual\nTerm Aggregate\nIntrinsic Value\nOutstanding on September 1, 2021 989,468 $ 26.69\nGranted - -\nExercised - -\nForfeited - -\nExpired (41,661) 22.90\nOutstanding on August 31, 2022 947,807 $ 26.85 2.3 $ -\nExercisable on August 31, 2022 947,807 $ 26.85 2.3 $ -\nIntrinsic value is the difference between the market value of the stock at August 31, 2022 and the exercise price which is aggregated for all options outstanding and exercisable. A summary of the total intrinsic value of options exercised and cash receipts from options exercised is summarized below (in thousands, except per share amounts):\nYear Ended August 31,\n2022 2021 2020\nIntrinsic value of options exercised $ - $ 587 $ 803\nCash receipts from exercise of options - 2,208 2,631\nThe Company generally records compensation expense over the vesting period for restricted stock unit awards based on the market value of the Company's Class A common stock on the grant date and utilized an expected forfeiture rate of 12% for both the years ended for the years ended August 31, 2022 and 2021 and 8% for the year ended August 31, 2020. The fair value of Performance Shares with market vesting conditions is determined utilizing a Monte Carlo simulation model.\nAs of August 31, 2022, there was $10.6 million of total unrecognized compensation cost related to share-based awards, including stock options, restricted stock, restricted stock units and performance shares, which will be recognized over a weighted average period of 1.9 years. The total fair value of share-based awards that vested during the fiscal years ended August 31, 2022 and 2021 was $11.8 million and $9.7 million, respectively.\nNote 16. Business Segment, Geographic and Customer Information\nThe Company is a global manufacturer of a broad range of industrial products and solutions. The IT&S reportable segment is primarily engaged in the design, manufacture and distribution of branded hydraulic and mechanical tools and in providing services and tool rental to the infrastructure, industrial maintenance, repair and operations, oil & gas, mining, alternative and renewable energy, civil construction and other markets. The Other segment is included for purposes of reconciliation of the respective balances below to the consolidated financial statements.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following tables summarize financial information by reportable segment and product line (in thousands):\nYear Ended August 31,\n2022 2021 2020\nNet Sales by Reportable Segment & Product Line\nIT&S Segment\nProduct $ 410,245 $ 376,353 $ 341,470\nService & Rental 117,097 116,772 113,393\n527,342 493,125 454,863\nOther Segment 43,881 35,535 38,429\n$ 571,223 $ 528,660 $ 493,292\nOperating Profit (Loss)\nIT&S $ 78,735 $ 81,683 $ 65,549\nOther Segment 729 (10,420) (3,420)\nGeneral Corporate (48,804) (20,150) (37,948)\n$ 30,660 $ 51,113 $ 24,181\nDepreciation and Amortization:\nIT&S $ 14,498 $ 15,856 $ 14,854\nOther Segment 3,664 3,568 3,620\nGeneral Corporate 1,438 2,187 2,246\n$ 19,600 $ 21,611 $ 20,720\nCapital Expenditures:\nIT&S $ 7,139 $ 10,918 $ 7,282\nOther Segment 710 768 2,625\nGeneral Corporate 568 333 2,146\n$ 8,417 $ 12,019 $ 12,053\nAugust 31,\n2022 2021\nAssets:\nIT&S $ 618,412 $ 641,256\nOther Segment 46,428 52,745\nGeneral Corporate 92,472 126,246\n$ 757,312 $ 820,247\nIn addition to the impact of changes in foreign currency exchange rates, the comparability of segment and product line information is impacted by acquisition/divestiture activities, impairment and divestiture charges, restructuring costs and related benefits. Corporate assets, which are not allocated, principally represent cash and cash equivalents, property, plant, and equipment, ROU assets, capitalized debt issuance costs and deferred income taxes.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe following tables summarize net sales and property, plant and equipment by geographic region (in thousands):\nYear Ended August 31,\n2022 2021 2020\nNet Sales:\nUnited States $ 226,020 $ 188,070 $ 185,279\nUnited Kingdom 29,316 39,896 24,033\nGermany 28,004 28,456 24,401\nAustralia 26,667 24,990 19,332\nSaudi Arabia 20,892 16,715 19,787\nCanada 19,651 17,348 15,924\nBrazil 16,517 13,937 16,413\nChina 15,434 16,927 15,058\nAll other 188,722 182,321 173,065\n$ 571,223 $ 528,660 $ 493,292\nAugust 31,\n2022 2021\nProperty, Plant and Equipment, net:\nUnited States $ 16,743 $ 18,942\nUnited Kingdom 8,212 11,818\nUAE 4,407 6,448\nBrazil 2,873 2,248\nNetherlands 1,965 2,625\nSpain 1,413 1,506\nKazakhstan 1,028 1,552\nAll other 4,731 3,451\n$ 41,372 $ 48,590\nThe Companys largest customer accounted for approximately 3% of sales in each of the last three fiscal years. Export sales from domestic operations were 9.8%, 7.2% and 7.3% of total net sales from continuing operations in fiscal 2022, 2021 and 2020, respectively.\nNote 17. Commitments and Contingencies\nThe Company had outstanding letters of credit of $10.7 million and $11.9 million at August 31, 2022 and 2021, respectively, the majority of which relate to commercial contracts and self-insured workers' compensation programs.\nAs part of the Company's global sourcing strategy, we have entered into agreements with certain suppliers that require the supplier to maintain minimum levels of inventory to support certain products for which we require a short lead time to fulfill customer orders. We have the ability to notify the supplier that they no longer need maintain the minimum level of inventory should we discontinue manufacturing of a product during the contract period; however, we must purchase the remaining minimum inventory levels the supplier was required to maintain within a defined period of time.\nThe Company is a party to various legal proceedings that have arisen in the normal course of business. These legal proceedings include regulatory matters, product liability, breaches of contract, employment, personal injury and other disputes. The Company has recorded reserves for loss contingencies based on the specific circumstances of each case. Such reserves are recorded when it is probable a loss has been incurred and can be reasonably estimated. The Company maintains a policy to exclude from such reserves an estimate of legal defense costs. In the opinion of management, resolution of these contingencies is not expected to have a material adverse effect on the Companys financial position, results of operations or cash flows.\nThe Company remains contingently liable for lease payments under leases of businesses that it previously divested or spun-off in the event that such businesses are unable to fulfill their future lease payment obligations; however, the Company does not believe it is probable that it will be required to satisfy these obligations. Future minimum lease payments for these leases at August 31, 2022 were $3.7 million associated with monthly payments extending to fiscal 2025.\nENERPAC TOOL GROUP CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS-(Continued)\nThe Company has facilities in numerous geographic locations that are subject to environmental laws and regulations. Environmental expenditures over the past three years have not been material. Soil and groundwater contamination has been identified at certain facilities that we operate or formerly owned or operated. We are also a party to certain state and local environmental matters, have provided environmental indemnifications for certain divested businesses and retain responsibility for certain potential environmental liabilities. Management believes that such costs will not have a material adverse effect on the Companys financial position, results of operations or cash flows.\nAdditionally, in fiscal 2019, the Company provided voluntary self-disclosures to both Dutch and U.S. authorities related to sales of products and services linked to the Crimea region of Ukraine, which sales potentially violated European Union and U.S. sanctions provisions. Although the U.S. investigation closed without further implication, the Dutch investigation continued. The Dutch Investigator concluded his investigation in March 2022 and provided the results to the Public Prosecutors office for review. Specifically, the Investigator concluded that the sales transactions violated EU sanctions. The conclusion in the Investigator's report was consistent with the Company's understanding of what could be stated in the report and was the basis to record an expense in the fiscal year ended August 31, 2021, representing the low end of a reasonable range of financial penalties the Company may incur as no other point within the range was deemed more probable. The Company has not adjusted its estimate of financial penalties as a result of the completion of the investigation in the year ended August 31, 2022. While there can be no assurance of the ultimate outcome of the matter, the Company currently believes that there will be no material adverse effect on the Company's financial position, results of operations or cash flows from this matter.\nNote 18. Subsequent Event\nOn September 9, 2022, the Company refinanced its credit facility resulting in a new $600 million senior credit facility, comprised of a $400 million revolving line of credit and a $200 million term loan, which will mature in September 2027. The Company has the option to request up to $300 million of additional revolving commitments and/or term loans under the new facility, subject to customary conditions, including the commitment of the participating lenders. The new facility replaces LIBOR with adjusted term SOFR as the interest rate benchmark and provides for interest rate margins above adjusted term SOFR ranging from 1.125% to 1.875% per annum depending on the Companys net leverage ratio. Borrowings under the new facility initially bear interest at adjusted term SOFR plus 1.125% per annum. In addition, the new facility contains financial covenants requiring the Company to not permit (i) the net leverage ratio, determined as of the end of each of its fiscal quarters, to exceed 3.75 to 1.00 (or, at the Companys election and subject to certain conditions, 4.25 to 1.00 for the testing period during which certain material acquisitions occur and the next succeeding four testing periods) or (ii) the interest coverage ratio, determined as of the end of each of its fiscal quarters, to be less than 3.00 to 1.00. Borrowings under the new facility are secured by substantially all personal property assets of the Company and its domestic subsidiary guarantors (other than certain specified excluded assets) and certain of the equity interests of certain subsidiaries of the Company.\nENERPAC TOOL GROUP CORP.\nSCHEDULE II-VALUATION AND QUALIFYING ACCOUNTS\n(in thousands)\nAdditions Deductions\nBalance at\nBeginning of\nPeriod Charged to\nCosts and\nExpenses (Income) Acquisition/ (Divestiture) Accounts\nWritten Off\nLess\nRecoveries Other Balance at\nEnd of\nPeriod\nAllowance for losses-Trade accounts receivable\nAugust 31, 2022 $ 4,235 $ 14,277 $ - $ (350) $ (658) $ 17,504\nAugust 31, 2021 4,991 8 - (845) 81 4,235\nAugust 31, 2020 5,141 682 (1) (726) (105) 4,991\nValuation allowance-Income taxes\nAugust 31, 2022 $ 66,155 $ 925 $ - $ (5,450) $ - $ 61,630\nAugust 31, 2021 70,414 4,886 - (9,145) - 66,155\nAugust 31, 2020 73,255 9,383 - (12,337) 113 70,414 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nThe Companys management, with the participation of the Companys Chief Executive Officer and Chief Financial Officer, have evaluated the effectiveness of the Companys disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) as of the end of the period covered by this report. Based on such evaluation, the Companys Chief Executive Officer and Chief Financial Officer have concluded that, as of the end of such period, the Companys disclosure controls and procedures are effective in recording, processing, summarizing, and reporting, and reporting, within the time periods specified in the SEC's rules and forms, information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act, and that such information is accumulated and communicated to the Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely discussions regarding required disclosure.\nManagements Report on Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The Companys management, with the participation of the Companys Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the Companys internal control over financial reporting based on the framework in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, the Companys management has concluded that, as of August 31, 2022, the Companys internal control over financial reporting was effective.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of the effectiveness to future periods are subject to the risk that the controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nErnst & Young, LLP, an independent registered public accounting firm, has audited the Companys internal control over financial reporting as of August 31, 2022, as stated in their report which is included herein.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting during the fourth quarter of fiscal 2022 that materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors; Executive Officers and Corporate Governance\nInformation about the Companys directors is incorporated by reference from the Proposal I: Election of Directors section of the Companys Proxy Statement for its Annual Meeting of Shareholders to be held on February 3, 2023 (the 2023 Annual Meeting Proxy Statement). Information about the Companys Audit Committee, including the members of the committee, and the Companys Audit Committee financial experts, is incorporated by reference from the Proposal I: Election of Directors and Corporate Governance Matters sections of the Companys 2023 Annual Meeting Proxy Statement. Information with respect to the timeliness of filings by directors and executive officers of reports required under Section 16(a) of the Securities Exchange Act of 1934, as amended, is incorporated by reference from the \"Delinquent Section 16(a) Reports\" section of the 2023 Annual Meeting Proxy Statement. Information about the Companys executive officers required by this item is contained in the discussion entitled Executive Officers of the Registrant in Part I hereof.\nThe Company has adopted a code of ethics that applies to its senior executive team, including its Chief Executive Officer, Chief Financial Officer and Corporate Controller. The code of ethics is posted on the Companys website and is available free of charge at www.enerpactoolgroup.com. The Company intends to satisfy the requirements under Item 5.05 of Form 8-K regarding disclosure of amendments to, or waivers from, provisions of its code of ethics that apply to the Chief Executive Officer, Chief Financial Officer or Corporate Controller by posting such information on the Companys website. Item 11. Executive Compensation\nThe information required by this item is incorporated by reference from the Election of Directors, Corporate Governance Matters, Executive Compensation and \"Non-Employee Director Compensation\" sections of the 2023 Annual Meeting Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated by reference from the Certain Beneficial Owners and Executive Compensation-Equity Compensation Plan Information sections of the 2023 Annual Meeting Proxy Statement. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated by reference from the Certain Relationships and Related Party Transactions section of the 2023 Annual Meeting Proxy Statement. Item 14. Principal Accountant Fees and Services\nThe information required by this item is incorporated by reference from the Other Information-Independent Public Accountants section of the 2023 Annual Meeting Proxy Statement.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) Documents filed as part of this report:\n1. Consolidated Financial Statements\nSee Index to Consolidated Financial Statements set forth in Item 8, Financial Statements and Supplementary Data for a list of financial statements filed as part of this report.\n2. Financial Statement Schedules\nSee Index to Financial Statement Schedule set forth in Item 8, Financial Statements and Supplementary Data.\n3. Exhibits\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n2.1\nSecurities Purchase Agreement, dated as of July 8, 2019, by and between Actuant Corporation, BRWS Parent LLC, Actuant France SAS and Actuant Holdings AB. Exhibit 2.1 to the Registrant's Current Report on Form 8-K filed on July 9, 2019\n3.1 (a) Amended and Restated Articles of Incorporation\nExhibit 4.9 to the Registrant's Form 10-Q for the quarter ended February 28, 2001\n(b) Amendment to Amended and Restated Articles of Incorporation\nExhibit 3.1(b) of the Registrant's Form 10-K for the fiscal year ended August 31, 2003\n(c) Amendment to Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 10-K for the fiscal year ended August 31, 2004\n(d) Amendment to Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 8-K filed on July 18, 2006\n(e) Amendment of Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 8-K filed on January 14, 2010\n(f) Amendment of Amended and Restated Articles of Incorporation\nExhibit 3.1 to the Registrant's Form 8-K/A filed on January 30, 2020\n3.2\nAmended and Restated Bylaws, as amended Exhibit 3.1 of the Registrant's Form 8-K filed on August 1, 2022\n4.1\nDescription of Registered Securities Exhibit 4.1 to the Registrant's Form 10-K for the fiscal year ended August 31, 2020\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n10.1\nCredit Agreement dated as of September 9, 2022 among Enerpac Tool Group Corp., the initial subsidiary borrowers party thereto, the guarantors party thereto, the lenders party thereto, and PNC Bank, National Association, as administrative agent Exhibit 10.1 to the Registrant's Current Report on Form 8-K filed on September 15, 2022\n10.2*\nOutside Directors Deferred Compensation Plan (as amended and restated effective July 23, 2021) Exhibit 10.2 to the Registrant's Form 10-K for the fiscal year ended August 31, 2021\n10.3*\nDeferred Compensation Plan (conformed through the fourth amendment) Exhibit 10.2 to the Registrant's Form 10-Q for the quarter ended November 30, 2014\n10.4*\nNon-Qualified Deferred Compensation Plan (conformed through the first amendment) Exhibit 10.4 to the Registrant's Form 10-K for the fiscal year ended August 31, 2020\n10.5*\n2010 Employee Stock Purchase Plan Exhibit B to the Registrant's Definitive Proxy Statement, dated December 4, 2009\n10.6*\nEnerpac Tool Group Corp. 2017 Omnibus Incentive Plan (as amended and restated November 9, 2020) Appendix A to the Proxy Statement on Schedule 14A filed by Enerpac Tool Group Corp. on December 4, 2020\n10.7**\n2009 Omnibus Incentive Plan, conformed through the Second Amendment thereto Exhibit 99.1 to the Registrant's Form 8-K filed on January 17, 2013\n10.8* (a) Amended and Restated 2001 Outside Directors Stock Plan\nExhibit A to the Registrant's Definitive Proxy Statement, dated December 5, 2005\n(b) First Amendment to the Amended and Restated 2001 Outside Directors Stock Plan dated December 25, 2008\nExhibit 10.10 to the Registrant's Form 10-Q for the quarter ended November 30, 2008\n10.9*\nSupplemental Executive Retirement Plan (conformed through the first amendment) Exhibit 10.3 to the Registrant's Form 10-Q for the quarter ended November 30, 2014\n10.10*\nSenior Officer Severance Plan Exhibit 10.1 to the Registrant's Current Report on Form 8-K filed on July 31, 2019\n10.11*\nForm of Indemnification Agreement for Directors and Officers Exhibit 10.1 to the Registrant's Form 8-K filed on August 2, 2018\n10.12*\nForm of Amended and Restated Change in Control Agreement Exhibit 10.1 to the Registrants Form 8-K filed on August 1, 2017\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n10.13*\nExecutive Officer Bonus Plan Exhibit B to the Registrant's Definitive Proxy Statement dated December 3, 2012\n10.14* (a) Form of NQSO Award (Director) under the 2009 Omnibus Incentive Plan*\nExhibit 10.1(a) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n(b) Form of NQSO Award (Officer) under the 2009 Omnibus Incentive Plan*\nExhibit 10.1(b) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n10.15* (a) Form RSA Award (Director) under the 2009 Omnibus Incentive Plan*\nExhibit 10.2(a) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n(b) Form of RSA Award (Officer) under the 2009 Omnibus Incentive Plan*\nExhibit 10.2(b) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n10.16* (a) Form of RSU Award (Director) under the 2009 Omnibus Incentive Plan*\nExhibit 10.3(a) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n(b) Form of RSU Award (Officer) under the 2009 Omnibus Incentive Plan*\nExhibit 10.3(b) to the Registrant's Form 10-Q for the quarter ended February 28, 2014\n10.17*\n(a) Form RSA Award (Director) under the 2017 Omnibus Incentive Plan Exhibit 10.14 to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n10.18* (a) Form of RSU Award (Director) under the 2017 Omnibus Incentive Plan*\nExhibit 10.15(a) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n(b) Form of RSU Award (Officer) under the 2017 Omnibus Incentive Plan*\nExhibit 10.15(b) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n10.19* (a) Form of PSU Award - Total Shareholder Return (Officer) under the 2017 Omnibus Incentive Plan*\nExhibit 10.16(a) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n(b) Form of PSU Award - Free Cash Flow (Officer) under the 2017 Omnibus Incentive Plan*\nExhibit 10.16(b) to the Registrant's Form 10-K for the fiscal year ended August 31, 2018\n10.20*\nLetter agreement dated September 22, 2021 between Paul E. Sternlieb and Enerpac Tool Group Corp. Exhibit 10.1 to the Registrant's Current Report on Form 8-K filed on September 29, 2021\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\n10.21*\nLetter agreement dated May 4, 2022 between Anthony P. Colucci and Enerpac Tool Group Corp.\nExhibit 10.1 to the Registrant's Current Report on Form 8-K filed on May 9, 2022\n10.22*\nLetter agreement dated December 6, 2021 between Scott Vuchetich and Enerpac Tool Group Corp. X\n10.23*\nLetter agreement dated January 19, 2022 between Benjamin J. Topercer and Enerpac Tool Group Corp. X\n10.24*\nLetter agreement dated September 23, 2021 between Randal W. Baker and Enerpac Tool Group Corp. Exhibit 10.2 to the Registrant's Current Report on Form 8-K filed on September 29, 2021\n10.25*\nLetter agreement dated January 30, 2022 between Rick T. Dillon and Enerpac Tool Group Corp. Exhibit 10.1 to the Registrant's Current Report 8-K filed on January 31, 2022\nCode of Ethics Applicable to Senior Financial Executives Exhibit 14 of the Registrants Form 10-K for the fiscal year ended August 31, 2017\nSubsidiaries of the Registrant X\n23 (a) Consent of Ernst & Young LLP\nX\n(b) Consent of PricewaterhouseCoopers LLP\nX\nPower of Attorney See signature page of this report\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 X\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 X\n32.1\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 X\n32.2\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 X\nExhibit Description Incorporated Herein By Reference To Filed\nHerewith Furnished Herewith\nThe following materials from the Enerpac Tool Group Corp. Form 10-K for the year ended August 31, 2022 formatted in Inline Extensible Business Reporting Language (Inline XBRL): (i) the Consolidated Statements of Earnings, (ii) the Consolidated Statements of Comprehensive Income (Loss), (iii) the Consolidated Balance Sheets, (iv) the Consolidated Statements of Cash Flows and (v) the Notes to Consolidated Financial Statements. X\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in the Interactive Data Files submitted as Exhibit 101) X\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nENERPAC TOOL GROUP CORP.\n(Registrant)\nBy: /S/ ANTHONY P. COLUCCI\nAnthony P. Colucci\nExecutive Vice President and Chief Financial Officer\n(Principal Financial Officer)\nDated: October 25, 2022\nPOWER OF ATTORNEY\nKNOWN ALL MEN BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Paul E. Sternlieb, Anthony P. Colucci and James P. Denis, and each of them, his true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him and in his name, place and stead, in any and all capacities, to sign any and all amendments to this report, and to file the same, with all and any other regulatory authority, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents or any of them, or their substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.*\nSignature Title\n/s/ PAUL E. STERNLIEB President and Chief Executive Officer, Director\nPaul E. Sternlieb\n/s/ ALFREDO ALTAVILLA Director\nAlfredo Altavilla\n/s/ JUDY ALTMAIER Director\nJudy Altmaier\n/s/ J. PALMER CLARKSON Director\nJ. Palmer Clarkson\n/s/ DANNY L. CUNNINGHAM Director\nDanny L. Cunningham\n/s/ E. JAMES FERLAND Chairman of the Board of Directors\nE. James Ferland\n/s/ LYNN C. MINELLA Director\nLynn C. Minella\n/s/ RICHARD D. HOLDER Director\nRichard D. Holder\n/s/ SIDNEY S. SIMMONS Director\nSidney S. Simmons\n/s/ ANTHONY P. COLUCCI Executive Vice President and Chief Financial Officer (Principal Financial Officer)\nAnthony P. Colucci\n/s/ BRYAN R. JOHNSON Vice President of Finance and Principal Accounting Officer\nBryan R. Johnson\n* Each of the above signatures is affixed as of October 25, 2022."
}