{
    "cik": "704172",
    "company": "PHI GROUP INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "8741",
    "state_of_inc": "WY",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/704172/0001493152-23-037178-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/704172/000149315223037178/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/704172/0001493152-23-037178.txt",
    "filename": "704172_10K_2023_0001493152-23-037178.htm",
    "content": "ITEM 1. BUSINESS OVERVIEW\nINTRODUCTION\nPHI Group, Inc. (n/k/a Philux Global Group Inc) (the Company or PHI) (www.philuxglobal.com) is primarily engaged in mergers and acquisitions, advancing Philux Global Funds, SCA, SICAV-RAIF, a Reserved Alternative Investment Fund (RAIF) under the laws of Luxembourg, and developing the Asia Diamond Exchange in Vietnam. Besides, the Company provides corporate finance services, including merger and acquisition advisory and consulting services for client companies through our wholly owned subsidiary Philux Capital Advisors, Inc. (formerly PHI Capital Holdings, Inc.) (www.philuxcapital.com) and invests in selective industries and special situations aiming to potentially create significant long-term value for our shareholders. Philux Global Funds intends to include a number of sub-funds for investment in select growth opportunities in the areas of renewable energy, real estate, infrastructure, healthcare, agriculture, and the Asia Diamond Exchange in conjunction with the International Financial Center in Vietnam.\nBACKGROUND\nOriginally incorporated on June 8, 1982 as JR Consulting, Inc., a Nevada corporation, the Company applied for a Certificate of Domestication and filed Articles of Domestication to become a Wyoming corporation on September 20, 2017. In the beginning, the Company was foremost engaged in mergers and acquisitions and had an operating subsidiary, Diva Entertainment, Inc., which operated two modeling agencies, one in New York and one in California. In January 2000, the Company changed its name to Providential Securities, Inc., a Nevada corporation, following a business combination with Providential Securities, Inc., a California-based financial services company. In February 2000, the Company then changed its name to Providential Holdings, Inc. In October 2000, Providential Securities withdrew its securities brokerage membership and ceased its financial services business. Subsequently, in April 2009, the Company changed its name to PHI Group, Inc. From October 2000 to October 2011, the Company and its subsidiaries were engaged in various transactions in connection with mergers and acquisitions advisory and consulting services, real estate and hospitality development, mining, oil and gas, telecommunications, technology, healthcare, private equity, and special situations. In October 2011, the Company discontinued the operations of Providential Vietnam Ltd., Philand Ranch Limited, a United Kingdom corporation (together with its subsidiaries Philand Ranch - Singapore, Philand Corporation - US, and Philand Vietnam Ltd. - Vietnam), PHI Gold Corporation (formerly PHI Mining Corporation, a Nevada corporation), and PHI Energy Corporation (a Nevada corporation), and mainly focused on acquisition and development opportunities in energy and natural resource businesses.\nThe Company is currently focused on Philux Global Funds, SCA, SICAV-RAIF by launching Philux Global Select Growth Fund and potentially other sub-funds for investment in real estate, renewable energy, infrastructure, agriculture, healthcare and the International Financial Center and Asia Diamond Exchange in Vietnam. In addition, Philux Capital Advisors, Inc. (formerly Capital Holdings, Inc.), a wholly owned subsidiary of the Company, continues to provide corporate and project finance services, including merger and acquisition (M&A) advisory and consulting services for U.S. and international companies. The Company has also formed Philux Global Advisors, Inc. to serve as the investment advisor to Philux Global Funds and other potential fund clients in the future.\nThe Company had signed agreements to acquire majority equity interests in Kota Construction LLC and Kota Energy Group LLC (KOTA) which are engaged in solar energy business (https://www.kotasolar.com), and Tin Thanh Group, a Vietnamese joint stock company (www.tinthanhgroup.vn) (TTG). Whereas the scheduled closing dates for the KOTA and TTG transactions already expired, the Company has continued to discuss with these companies and intends to renegotiate an revised agreement with each of them when the Company successfully closes one or more of the pending asset management agreements and financing with certain investor groups and lenders. In addition, the Company intends to amend the Purchase and Sale Agreement that was originally signed on January 18, 2022 with Five-Grain Treasure Spirits Co., Ltd., a Chinese baiju distiller, to collaborate in launching American-made baiju products through Empire Spirits, Inc., a subsidiary of the Company. The Company is in the process of establishing a subsidiary in the Dubai Multi-Commodities Centre in United Arab Emirates to replace its former subsidiary CO2-1-0 (CARBON) Corp. to continue engaging in carbon emission mitigation using blockchain and crypto technologies. In May 2023, the company signed a business cooperation agreement with SSE Global JSC, a Vietnamese joint stock company, to establish SSE Global Group, Inc., a Wyoming corporation, (www.sseglobalgroup.com) to commercialize a self-sustainable energy technology. In addition, in June 2023 the Company signed a business cooperation agreement with Saphia Alkali JSC, a Vietnamese joint stock company, to form Sapphire Alkali Global Group in the United States to finance, manufacture, sell and distribute Saphia Alkalis proprietary products on a worldwide basis. These activities are disclosed in greater detail elsewhere in this report. No assurances can be made that the Company will be successful in achieving its plans.\nBUSINESS STRATEGY\nPHIs strategy is to:\n1. Identify, build, acquire, commit and deploy valuable resources with distinctive competitive advantages;\n2. Identify, evaluate, acquire, participate and compete in attractive businesses that have large, growing market potential;\n3. Build an attractive investment that includes points of exit for investors through capital appreciation or spin-offs of business units.\nSUBSIDIARIES:\nAs of October 13, 2023, the Company has the following subsidiaries: (1) Asia Diamond Exchange, Inc., a Wyoming corporation (100%), (2) American Pacific Resources, Inc., a Wyoming corporation (100%, (3) Empire Spirits, Inc., a Nevada corporation (85% - formerly Provimex, Inc.) (4) Philux Global Funds SCA, SICAV-RAIF, a Luxembourg Reserved Alternative Investment Fund (100%), (5) Philux Luxembourg Development S.A., a Luxembourg corporation (100%), (6) PHI Luxembourg Holding SA, a Luxembourg corporation (100%), (7) Philux Global General Partners SA, a Luxembourg corporation (100%), (8) Philux Capital Advisors, Inc., a Wyoming corporation (100%), (9) Philux Global Advisors, Inc., a Wyoming corporation (100%), (10) Philux Global Healthcare, Inc., a Wyoming corporation (100%), (11) Philux Global Trade Inc., a Wyoming corporation (100%), (12) Philux Global Energy Inc., a Wyoming corporation (100%), and (13) Philux Global Vietnam Investment and Development Company Ltd., a Vietnamese limited liability company (100%).\nAMERICAN PACIFIC RESOURCES, INC.\nAmerican Pacific Resources, Inc. (APR) is a Wyoming corporation established in April 2016 as a subsidiary of the Company to serve as a holding company for various natural resource projects. On September 2, 2017, APR entered into an Agreement of Purchase and Sale with Rush Gold Royalty, Inc. (RGR), a Wyoming corporation, to acquire a 51% ownership in twenty-one mining claims over an area of approximately 400 acres in Granite Mining District, Grant County, Oregon, U.S.A., in exchange for a total purchase price of twenty-five million U.S. Dollars ($US 25,000,000) to be paid in a combination of cash, convertible demand promissory note and PHI Group, Inc.s Class A Series II Convertible Cumulative Redeemable Preferred Stock (Preferred Stock). This transaction was closed effective October 3, 2017. Following the first amendment dated April 19, 2018 and the second amendment dated September 29, 2018 retroactively effective April 20, 2018, to the afore-mentioned Agreement of Purchase and Sale, PHI Group, Inc. paid ten million shares of its Class A Series II Convertible Cumulative Redeemable Preferred Stock to Rush Gold Royalty, Inc.. As of June 30, 2020, the Company recorded $462,000 paid for this transaction as expenses for research and development in connection with the Granite Mining Claims project. The value of these mining claims is expected to be adjusted later after a new valuation of these mining assets is conducted by an independent third-party valuator.\nThe Company has passed several resolutions with respect to the declaration of a twenty percent (20%) special stock dividend in American Pacific Resources, Inc. to shareholders of Common Stock of the Company. Due to the continued adverse effects of the coronavirus pandemic and other factors that have delayed the development of APR, it has deemed necessary for the Company to suspend the distribution of the APR special stock dividend until later on in order to allow APR additional time to reach certain milestones that would make the spin-off of APR and this special stock dividend distribution economically beneficial for the Companys shareholders. The Company will provide an update regarding the new Record Date for this special dividend when certain conditions are met.\nASIA DIAMOND EXCHANGE AND INTERNATIONAL FINANCIAL CENTER IN VIETNAM\nAlong with the establishment of Philux Global Funds, the Company has worked with the Authority of Chu Lai Open Economic Zone in Central Vietnam and the Provinces of Quang Nam and Dong Nai, Vietnam, to develop the Asia Diamond Exchange for lab-grown, rough and polished diamond together with a multi-commodities and logistics centers.\nMr. Ben Smet who successfully established the Dubai Diamond Exchange in 2002-2005 has been leading fulltime a group of experts for the setup of the Asian Diamond Exchange since January 2018. He has brought together the 11 main trading players in the rough diamond industry to come to Vietnam. He has established a partnership with the biggest player in the rough trading and polishing group, the Mehta Family Group. Other main international diamond trading groups as the Mody Group, Diamac etc. have joined the overall venture.\nFurthermore, together with the groups, a full Kimberly Process Certification Scheme (KPC) to prevent ‘conflicting diamond trading was established and is aligned from time to time. Also, the new lab grown diamond KPC scheduling is already implemented. A unique and KPC approved structure has been established where under the PHI Vietnam umbrella, in collaboration with KPC Mum- bai (India), a ‘Public-Private-Partnership (PPP) is established in which the Vietnamese authorities hold 15% and PHI (or its local corporate entity) holds 85% of the voting rights. For the lab grown diamond segment, this will be in the Chu Lai Free Economic Zone and for the Rough and Polished Diamond Parcel Trade, this is being planned to be on Thanh Da Island, about 5 kilometers from the center of Ho Chi Minh City, Vietnam.\nThe Company has taken the decision to move the greater part of the ADE rough and polishing venture, first to an Industrial Zone to be established close to the new international Airport in Long Thanh District, Dong Nai Province, Vietnam and this year to the Thanh Da Island. This location change has caused that the entire KPC Process and administration had to be adapted and redone with renewed financial input, mostly carried by Mr. Smet.\nA rough diamond trading export flow to Vietnam was negotiated and concluded by Mr. Smet with the DMCC and Dubai Diamond Exchange. This year, an international diamond trading platform was created by Mr. Smet to unify the trading efforts of Alrosa and De Beers/Bonas. Mr. Smet was advised and counselled thereto by Mr. A. Mehta, the senior board member of the Alrosa Group. Together with Mr. A. Mehta, Mr. Smet has also covered the financial backbone of the diamond trading venture via the setup of a financial institution in Botswana. It is the intention of Mr. Smet to donate 50% of his own voting shares of the institution to PHI the moment all budgets for the venture are arranged by PHI and all financial obligations and reimbursements by PHI to him are met. It is the intention of the parties involved to establish a subsidiary of the financial institution in the ADE Vietnam and have local banking partners join this initiative.\nMr. Smet had also established a collaboration partnership with the Antwerp Diamond Exchange (Belgium), the Dubai Diamond Exchange and the Tel-Aviv Diamond Exchange. Negotiations have started to involve a new economic free-zone in Jordan into the ongoing project.\nRecently, Mr. Smet has started a structuring project, in order for PHI to set up and establish an International Financial Center on the Thanh Da Island in connection with the Asian Diamond Exchange. This will be similar as what Mr. Smet has established successfully for Dubai in 2002-2005 and this now incorporating the international changes of the last decade.\nOnce the Company has effectuated all budgeting and all financial requirements and obligations, the ongoing process will effectively materialize and Mr. Smet then shall transfer the entire venture to Philux Global Group, Inc.\nThe Company has incorporated Asia Diamond Exchange, Inc., a Wyoming corporation, ID number 2021-001010234, as the holding company for the development of the Asia Diamond Exchange in Vietnam.\nCO2-1-0 (CARBON) CORP\nIn August 2022, PHI Group signed a Letter of Intent with Indonesia-based CYFS Group, headed by Mr. Choky Fernando Simanjuntak, to sponsor and co-found CO2-1-0 (CARBON) CORP to implement a new disruptive carbon mitigation initiative through environmentally sustainable projects starting in Indonesia, Vietnam, other ASEAN countries, and worldwide. On September 21, 2022 CO2-1-0 (CARBON) CORP was incorporated as a Wyoming corporation to manage this program. The Company has contributed the development budget for CO2-1-0 (CARBON) CORP) and plans to establish a subsidiary in the Dubai Multi-Commodities Centre to the United Arab Emirates to replace CO2-1-0 (CARBON).\nEMPIRE SPIRITS, INC. (FORMERLY PROVIMEX, INC.)\nProvimex, Inc. was originally incorporated as a Nevada corporation on September 23, 2004, Entity Number C25551-4, as a subsidiary of the Company to engage in international trade. On 9/26/2021, Provimex, Inc. changed its name to Empire Spirits, Inc. as the holding company for the acquisition of a majority ownership in Five-Grain Treasure Spirits Company, Ltd., a baiju distiller in Jilin Province. The Company is in the process of amending the Purchase and Sale Agreement that was originally signed on January 18, 2022 with Five-Grain Treasure Spirits Co. Ltd., to collaborate in launching American-made baiju products through Empire Spirits, Inc.\nBaijiu is a white spirit distilled from sorghum. It is similar to vodka but with a fragrant aroma and taste. It is currently the most consumed spirit in the world. Mainly consumed in China, it is gaining popularity in the rest of the world.\nFive-Grain specializes in the production and sales of spirits and the development of proprietary spirit production processes. It also possesses a patented technology to grow red sorghum for baiju manufacturing. The patented grain produces superior yield and quality. Five-Grain is a reputable bulk alcohol supplier to some of the largest spirits companies in the world.\nPHILUX GLOBAL FUNDS SCA, SICAV-RAIF\nOn June 11, 2020, the Company received the approval from the Luxembourg Commission de Surveillance du Secteur Financier (CSSF) and successfully established and activated PHILUX GLOBAL FUNDS SCA, SICAV-RAIF (the Fund), Registration No. B244952, a Luxembourg bank fund organized as a Reserved Alternative Investment Fund in accordance with the Luxembourg Law of July 23, 2016 relative to reserved alternative investment funds, Law of August 23, 2016 relative to commercial companies, and Modified Law of July 12, 2013 relative to alternative investment fund managers.\nThe following entities had been engaged to support the Funds operations: a) Custodian Bank: Hauck & Aufhauser Privatbankiers AG, b) Administrative Registrar & Transfer Agent: Hauck & Aufhauser Alternative Investment Services S.A., c) Fund Manager: Hauck & Aufhauser Fund Services S.A., d) Fund Attorneys: DLP Law Firm SARL and VCI Legal, e) Investment Advisor: PHILUX Capital Advisors, Inc., f) Fund Auditors: E&Y Luxembourg and E&Y Vietnam, g) Fund Tax Advisor: ATOZ Tax Management, Luxembourg, h) Fund Independent Asset Valuator: Cushman & Wakefield, Vietnam. Currently the Fund is in the process of changing the custodian bank, administrative registrar & transfer agent, investment advisor and the fund manager.\nThe Fund is an umbrella fund intended to contain one or more sub-fund compartments for investing in select opportunities in the areas of real estate, infrastructure, renewable energy, agriculture, healthcare and especially the Asia Diamond Exchange and Multi-Commodities and Logistics Center in Vietnam.\nOther subsidiaries of the Company that are established in conjunction with PHILUX Global Funds include PHI Luxembourg Development S.A., PHILUX Global General Partners SA, and PHI Luxembourg Holding SA. Website: www.philuxfunds.com.\nPHILUX CAPITAL ADVISORS, INC.\nPhilux Capital Advisors, Inc. was originally incorporated under the name of Providential Capital, Inc. in 2004 as a Nevada corporation and wholly owned subsidiary of the Company to provide merger and acquisition (M&A) advisory services, consulting services, project financing, and capital market services to clients in North America and Asia. In May 2010, Providential Capital, Inc. changed its name to PHI Capital Holdings, Inc. It was re-domiciled as a Wyoming corporation on September 20, 2017 and changed its name to PHILUX Capital Advisors, Inc. on June 03, 2020. This subsidiary has successfully managed merger plans for a number of privately held and publicly traded companies and continues to focus on serving the Pacific Rim markets in the foreseeable future. This subsidiary also arranges debt financing for international clients. Website: www.philuxcapital.com.\nPHILUX GLOBAL ADVISORS, INC.\nIncorporated in April 2022 as a Wyoming corporation, Philux Global Advisors, Inc. will serve as the investment advisor for Philux Global Funds SCA SICAV-RAIF.\nPHILUX GLOBAL HEALTHCARE, INC.\nPhilux Global Healthcare, Inc., a Wyoming corporation, was established in February 2023 to replace Phivitae Healthcare, Inc., as a subsidiary of the Company to cooperate with Dr. Dung Anh Hoang of Belgium and his affiliates to develop a software management system for intensive care units in Vietnam and launch medical bioplastic products that have ready buyers in Europe and Africa. The Company intends to use this subsidiary as a holding company to acquire and consolidate targets in the healthcare industry.\nPHILUX GLOBAL ENERGY, INC.\nOn January 3, 2022, the Company filed Profit Corporation Articles of Incorporation with the Wyoming Secretary of State to incorporate PHILUX GLOBAL ENERGY, INC. - Original ID: 2020-001066221, as a wholly-owned subsidiary of the Company to serve as the holding company for the contemplated acquisition of fifty-point one percent (50.10%) ownership in both Kota Energy Group LLC and Kota Construction LLC, both of which are California limited liability companies. The Company intends to develop its energy-related business through this subsidiary in the future.\nPHILUX FIDELITY GLOBAL GROUP\nPhilux Fidelity Global Group is a Wyoming corporation incorporated on June 30, 2022 with the intent to serve as the holding company for business cooperation between Tin Thanh Group (www.tinthanhgroup.vn) and the Company.\nPHILUX GLOBAL TRADE INC.\nEstablished on August 19, 2022 in Wyoming, USA as a subsidiary of the Company to serve as the holding company for the acquisition of Vietnam-based Van Phat Dat JSC, Philux Global Trade Inc. is currently developing trade commerce between Vietnam and other countries. ITEM 1A. RISK FACTORS\nRISK FACTORS\nInvestment in our securities is subject to various risks, including risks and uncertainties inherent in our business. The following sets forth factors related to our business, operations, financial position or future financial performance or cash flows which could cause an investment in our securities to decline and result in a loss.\nGeneral Risks Related to Our Business\nOur success depends on our management team and other key personnel, the loss of any of whom could disrupt our business operations.\nOur future success will depend in substantial part on the continued service of our senior management and certain external experts. The loss of the services of one or more of our key personnel and/or outside experts could impede implementation and execution of our business strategy and result in the failure to reach our goals. We do not carry key person life insurance for any of our officers or employees. Our future success will also depend on the continued ability to attract, retain and motivate highly qualified personnel in the diverse areas required for continuing our operations. We cannot assure that we will be able to retain our key personnel or that we will be able to attract, train or retain qualified personnel in the future.\nRisks Related to Mergers and Acquisitions\nOur strategy in mergers and acquisitions involves a number of risks and we have a limited history of successful acquisitions. Even when an acquisition is completed, we may have to continue our service for integration that may not produce results as positive as management may have projected.\nThe Company continues evaluating various opportunities and negotiating to acquire other companies, assets and technologies. Acquisitions entail numerous risks, including difficulties in the assimilation of acquired operations and products, diversion of managements attention from other business concerns, amortization of acquired intangible assets and potential loss of key employees of acquired companies. We have limited experience in assimilating acquired organizations into our operations. Although potential synergy may be achieved by acquisitions of related technologies and businesses, no assurance can be given as to the Companys ability to integrate successfully any operations, personnel, services or products that have been acquired or might be acquired in the future. Failure to successfully assimilate acquired organizations could have a material adverse effect on the Companys business, financial condition and operating results.\nAcquisitions involve a number of special risks, including:\n● failure of the acquired business to achieve expected results;\n● diversion of managements attention;\n● failure to retain key personnel of the acquired business;\n● additional financing, if necessary and available, could increase leverage, dilute equity, or both;\n● the potential negative effect on our financial statements from the increase in goodwill and other intangibles; and\n● the high cost and expenses of completing acquisitions and risks associated with unanticipated events or liabilities.\nThese risks could have a material adverse effect on our business, results of operations and financial condition since the values of the securities received for the consulting service at the execution of the acquisition depend on the success of the company involved in acquisition. In addition, our ability to further expand our operations through acquisitions may be dependent on our ability to obtain sufficient working capital, either through cash flows generated through operations or financing activities or both. There can be no assurance that we will be able to obtain any additional financing on terms that are acceptable to us, or at all.\nRisks associated with private equity (PE) funds\nThere are, broadly, five key risks to private equity investing:\n1. Operational risk: The risk of loss resulting from inadequate processes and systems supporting the organization. It is a key consideration for investors regardless of the asset classes that funds invest into.\n2. Funding risk: This is the risk that investors are not able to provide their capital commitments and is effectively the ‘investor default risk. PE funds typically do not call upon all the committed investor capital and only draw capital once they have identified investments. Funding risk is closely related to liquidity risk, as when investors are faced with a funding shortfall they may be forced to sell illiquid assets to meet their commitments.\n3. Liquidity risk: This refers to an investors inability to redeem their investment at any given time. PE investors are ‘locked-in for between five and ten years, or more, and are unable to redeem their committed capital on request during that period. Additionally, given the lack of an active market for the underlying investments, it is difficult to estimate when the investment can be realized and at what valuation.\n4. Market risk: There are many forms of market risk affecting PE investments, such as broad equity market exposure, geographical/sector exposure, foreign exchange, commodity prices, and interest rates. Unlike in public markets where prices fluctuate constantly and are marked-to-market, PE investments are subject to infrequent valuations and are typically valued quarterly and with some element of subjectivity inherent in the assessment. However, the market prices of publicly listed equities at the time of sale of a portfolio company will ultimately impact realization value.\n5. Capital risk: The capital at risk is equal to the net asset value of the unrealized portfolio plus the future undrawn commitments. In theory, there is a risk that all portfolio companies could experience a decline in their current value, and in the worst-case drop to a valuation of zero. Capital risk is closely related to market risk. Whilst market risk is the uncertainty associated with unrealized gains or losses, capital risk is the possibility of having a realized loss of the original capital at the end of a funds life.\nThere are two main ways that capital risk brings itself to bear - through the failure of underlying companies within the PE portfolio and suppressed equity prices which make exits less attractive. The former is impacted by the quality of the fund manager, i.e. their ability to select portfolio companies with good growth prospects and to create value, hence why fund manager selection is key for investors. The condition, method, and timing of the exit are all factors that can affect how value can be created for investors.\nRisks Associated with Building and Operating a Diamond Exchange\nFundamentally, the key requirements for a successful diamond exchange include the following:\n1. Supply: One of the most important things for a successful trading hub is the ability to secure ample, stable, and sustainable supply of commodities. In the case of a diamond exchange, adequate supply of rough diamond must be secured to make it successful.\n2. Capital: Besides the infrastructure, facilities, systems, and amenities to operate the diamond exchange, the organizers must be able to arrange very large amounts of capital to facilitate the trade and other business activities related to the exchange.\n3. Participants: The organizers must be able to attract a large number of international diamonteers to participate in the exchange. There is no guarantee that people will come when the exchange is built.\n4. Venue: The venue must be able to provide competitive advantages compared with existing diamond exchanges in the world in terms of (a) modern facilities, latest technologies and state-of-the-art provisions, (b) tax relief, (c) financial facilitating network from big investors, (d) retail banking, lending institutions and foreign exchange facilities, (e) licenses and registrations, (f) global multi-commodities trading flatform, and (g) other amenities.\nRisks Associated with International Markets\nAs some of our business activities are currently involved with international markets, any adverse change to the economy or business environment in these countries could significantly affect our operations, which would lead to lower revenues and reduced profitability.\nSome of our business activities are currently involved with non-US countries. Because of this presence in specific geographic locations, we are susceptible to fluctuations in our business caused by adverse economic or other conditions in this region, including stock market fluctuation. A stagnant or depressed economy in these countries generally, or in any of the other markets that we serve, could adversely affect our business, results of operations and financial condition.\nRisks Related to Our Securities\nInsiders have substantial control over the company, and they could delay or prevent a change in our corporate control, even if our other stockholders wanted such a change to occur.\nThough our executive officers and directors as of the date of this report, in the aggregate, only hold a small portion of our outstanding common stock, we have the majority voting rights associated with the Companys Class B Series I Preferred Stock, which decision may allow the Board of Directors to exercise significant control over all matters requiring stockholder approval, including the election of directors and approval of significant corporate transactions. This could delay or prevent an outside party from acquiring or merging with us even if our other stockholders wanted it to occur.\nThe price at which investors purchase our common stock may not be indicative of the prevailing market price.\nThe stock market often experiences significant price fluctuations that are unrelated to the operating performance of the specific companies whose stock is traded. These market fluctuations could adversely affect the trading price of our shares. Investors may be unable to sell their shares of common stock at or above their purchase price, which may result in substantial losses.\nSince we do not currently meet the requirements for our stock to be quoted on NASDAQ, NYSE MKT LLC or any other senior exchange, the tradability in our securities will be limited under the penny stock regulations.\nUnder the rules of the Securities and Exchange Commission, as the price of our securities on the OTCQB or OTC Markets is below $5.00 per share, our securities are within the definition of a penny stock. As a result, it is possible that our securities may be subject to the penny stock rules and regulations. Broker-dealers who sell penny stocks to certain types of investors are required to comply with the Commissions regulations concerning the transfer of penny stock. These regulations require broker-dealers to:\n*Make a suitability determination prior to selling penny stock to the purchaser;\n*Receive the purchasers written consent to the transaction; and\n*Provide certain written disclosures to the purchaser.\nThese requirements may restrict the ability of broker/dealers to sell our securities, and may affect the ability to resell our securities.\nOur compliance with the Sarbanes-Oxley Act and SEC rules concerning internal controls may be time consuming, difficult and costly for us.\nIt may be time consuming, difficult and costly for us to develop and implement the internal controls and reporting procedures required by the Sarbanes-Oxley Act. We may need to hire additional financial reporting, internal controls and other finance staff in order to develop and implement appropriate internal controls and reporting procedures. If we are unable to comply with the internal controls requirements of the Sarbanes-Oxley Act, we may not be able to obtain the independent accountant certifications that the Sarbanes-Oxley Act requires publicly traded companies to obtain. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. DESCRIPTION OF PROPERTIES\nAs of June 30, 2023, the Company did not own any realty or equipment. ITEM 3. LEGAL PROCEEDINGS\nThe Company is currently not a party to any material pending legal proceedings and, to the best of its knowledge, no such action by or against Company has been threatened. ITEM 4. SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS\nNone\nPART II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nThe Companys Common Stock is currently trading on the OTC Markets under the symbol PHIL. The following sets forth the high and low prices of the Companys Common Stock in the US for the most recent month, two most recent quarters and each quarter during the preceding two fiscal years.\nThe prices for the Companys common stock quoted by brokers are not necessarily a reliable indication of the value of the Companys common stock.\nPer Share Common Stock Prices for the Month High Low\nEnded September 30, 2023 0.0006 0.0004\nPer Share Common Stock Prices for the Quarter High Low\nQuarter Ended June 30, 2023 0.0008 0.0005\nPer Share Common Stock Prices by Quarter\nFor the Fiscal Year Ended June 30, 2023\nHigh Low\nQuarter Ended June 30, 2023 0.0008 0.0005\nQuarter Ended March 31, 2023 0.0025 0.0001\nQuarter Ended December 31, 2022 0.0020 0.0008\nQuarter Ended September 30, 2022 0.0026 0.0005\nPer Share Common Stock Prices by Quarter\nFor the Fiscal Year Ended June 30, 2022\nHigh Low\nQuarter Ended June 30, 2022 0.0019 0.0005\nQuarter Ended March 31, 2022 0.0055 0.0016\nQuarter Ended December 31, 2021 0.0093 0.0047\nQuarter Ended September 30, 2021 0.0150 0.0047\nHolders of Common Equity:\nAs of October 13, 2023 there are approximately 1,605 shareholders of record of the Companys common stock, of which 1,299 are active.\nDividends:\nCash dividend: The Company has not declared or paid a cash dividend to common stock shareholders since the Companys inception. The Board of Directors presently intends to retain any earnings to finance company operations and does not expect to authorize cash dividends to common shareholders in the foreseeable future. Any payment of cash dividends in the future will depend upon Companys earnings, capital requirements and other factors.\nShare dividend: On March 12, 2012 the Board of Directors of the Company declared a special stock dividend to shareholders of Common Stock of the Company with the following stipulations: (a) Declaration date: March 16, 2012; (b) Record date: June 15, 2012; (c) Payment date: September 17, 2012; (d) Dividend ratio: All eligible shareholders of Common Stock of the Company as of the Record date shall receive three new shares of Common Stock of the Company for each share held by such shareholders as of the referenced record date. The purpose of this special stock dividend was to partially mitigate the impact of the dilution in connection with the 1-for-1,500 reverse split of the Common Stock on the Companys long-term shareholders and reward them for staying with the Company. On June 6, 2012, the Companys Board of Directors passed a resolution to change the record date for the special stock dividend to July 31, 2012 and the distribution date to November 30, 2012. The Company has reserved a total of 5,673,327 shares of Common Stock for this special dividend distribution and will reset a new distribution date when the market price of the Companys Common Stock makes the special stock dividend economically meaningful for such shareholders and a registration statement for the dividend shares is declared effective by the Securities and Exchange Commission. ITEM 6. SELECTED FINANCIAL DATA\nJune 30,\nNet revenues $ 25,000.00 $ 30,000 $ 61,000\nIncome (loss) from operations $ (1,000,623.31 ) $ (16,899,928 ) $ (582,616 )\nNet other income (expense) $ (4,608,523.04 ) $ (4,254,515 ) $ (5,700,562 )\nNet income (loss) $ (5,609,146.35 ) $ (21,154,443 ) $ (6,553,178 )\nNet income (loss) per share $ (0.00 ) $ (0.00 ) $ (0.00 )\nTotal assets $ 294,215.12 $ 469,963 $ 927,796\nTotal liabilities $ 8,516,216.62 $ 7,013,465 $ 6,925,185 ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nExcept for the audited historical information contained herein, this report specifies forward-looking statements of management of the Company within the meaning of Section 27a of the Securities Act of 1933 and Section 21e of the Securities Exchange Act of 1934 (forward-looking statements) including, without limitation, forward-looking statements regarding the Companys expectations, beliefs, intentions and future strategies. Forward-looking statements are statements that estimate the happening of future events and are not based on historical facts. Forward- looking statements may be identified by the use of forward-looking terminology, such as could, may, will, expect, shall, estimate, anticipate, probable, possible, should, continue, intend or similar terms, variations of those terms or the negative of those terms. The forward-looking statements specified in this report have been compiled by management of the Company on the basis of assumptions made by management and considered by management to be reasonable. Future operating results of the Company, however, are impossible to predict and no representation, guaranty, or warranty is to be inferred from those forward-looking statements. The assumptions used for purposes of the forward-looking statements specified in this report represent estimates of future events and are subject to uncertainty as to possible changes in economic, legislative, industry, and other circumstances. As a result, the identification and interpretation of data and other information and their use in developing and selecting assumptions from and among reasonable alternatives require the exercise of judgment. To the extent that the assumed events do not occur, the outcome may vary substantially from anticipated or projected results, and, accordingly, no opinion is expressed on the achievability of those forward-looking statements. In addition, those forward-looking statements have been compiled as of the date of this report and should be evaluated with consideration of any changes occurring after the date of this report. No assurance can be given that any of the assumptions relating to the forward-looking statements specified in this report are accurate and the Company assumes no obligation to update any such forward-looking statements.\nRESULTS OF OPERATIONS FOR THE YEARS ENDED JUNE 30, 2023 AND JUNE 30, 2022\nRevenues:\nThe Company received $25,000 from consulting services for the fiscal year ended June 30, 2023 as compared to $30,000 from consulting services for the fiscal year ended June 30, 2022.\nOperating Expenses:\nThe Company incurred total operating expenses of $1,025,623 for the fiscal year ended June 30, 2023 as compared to $16,929,928 for the year ended June 30, 2022. The decrease of operating expenses between the two fiscal periods $15,904,305 includes a decrease of $97,841 in general and administrative expenses, a decrease of $553,803 for the development costs of the Asia Diamond Exchange and a decrease of $15,252,661 in professional services. The amount of professional services during the previous period was mainly due the issuances of the Companys stock for the development and launching of an Asia Diamond Exchange (ADE) blockchain token.\nIncome (loss) from operations:\nThe Company had a loss from operations of $1,000,623 for the fiscal year ended June 30, 2023 as compared to a loss from operations of $16,899,928 for the fiscal year ended June 30, 2022. This represents a decrease of $15,899,305 in loss from operations during the current fiscal year as compared to that of the precious year. This was mainly due to a decrease of $97,841 in general and administrative expenses, a decrease of $553,803 for the development costs of the Asia Diamond Exchange and a decrease of $15,252,661 in professional services as mentioned above.\nOther income (expense):\nThe Company had net other expenses of $4,608,523 for the fiscal year ended June 30, 2023 as compared to net other expenses of $4,254,515 for the fiscal year ended June 30, 2022. The net variance of $354,008 between the two fiscal periods was primarily due to decrease of $1,117,707 in other income, a decrease in interest expenses in the amount of $657,685 and a decrease in other expenses in the amount of $106,014. The Company recognized $488 as other income from gain on sale of security and bank interest. As for other expenses, the Company incurred $3,674,139 under this category during the fiscal year ended June 30, 2023, primarily due to a loss in the amount of $976,290 in connection with cashless warrant exercises, penalties of $500,295 from loans and notes payable, and total financing costs of $1,668,057, as compared to $3,780,153 in other expenses during the previous fiscal year. Interest expenses for the current fiscal year is $934,872 as compared to interest expenses of $1,592,557 for the previous fiscal year.\nNet income (loss):\nThe Company had a net loss of $5,609,146 for the fiscal ended June 30, 2023, as compared to a net loss of $21,154,443 for the fiscal year ended June 30, 2022, representing a variance of $15,545,297 in net loss between the two fiscal years. The net loss per share based on the basic and diluted weighted average number of common shares outstanding for the fiscal years ended June 30, 2023 and June 30, 2022 was both $(0.00).\nCASH FLOWS\nWe had in cash and cash equivalents of $17,765 as of June 30, 2023 as compared to $67,896 in cash and cash equivalents as of June 30, 2022, respectively.\nNet cash used in our operating activities was $1,572,400 for the fiscal year ended June 30, 2023 as compared to cash used in operating activities of $ 1,545,570 for the fiscal year ended June 30, 2022. The variance in cash used in operating activities between the two fiscal periods was $26,830.\nThere was $3,557 cash provided by investing activities during the fiscal year ended June 30, 2023, compared to $410,438 cash used in investing activities during the same period ended June 30, 2022.\nNet cash provided by financing activities was $1,520,712 for the fiscal year ended June 30, 2023 as compared with net cash provided by financing activities of $1,107,288 for the fiscal year ended June 30, 2022. The net cash provided by financing activities for the current fiscal year primarily came from net notes payable in the amount of $29,352 and $1,540,795 from issuances of common stock.\nHISTORICAL FINANCING ARRANGEMENTS\nSHORT TERM NOTES PAYABLE AND ISSUANCE OF COMMON STOCK\nIn the course of its business, the Company has obtained short-term loans from individuals and institutional investors and from time to time raised money by issuing restricted common stock of the Company under the auspices of Rule 144. These notes bear interest rates ranging from 0% to 36% per annum. (Notes 8 & 11).\nCONVERTIBLE PROMISSORY NOTES\nThe Company has also from time to time issued convertible promissory notes to various private investment funds for short-term working capital and special projects. Typically, these notes bear interest rates from 5% to 12% per annum, mature within one year, are convertible to common stock of the Company at a discount ranging from 42% to 50%, and may be repaid within 180 days at a prepayment premium ranging from 130% to 150%. (Note 8)\nCOMPANYS PLAN OF OPERATION FOR THE FOLLOWING 12 MONTHS\nIn the next twelve months the Companys goals are to advance the Philux Global Select Growth Fund under Philux Global Funds SCA, SICAV-RAIF, develop the Asia Diamond Exchange and International Financial Center in Vietnam as well as carry out merger and its acquisition program by acquiring target companies for a roll-up strategy and also invest in special situations. We will also continue to provide advisory and consulting services to international clients through our wholly owned subsidiary Philux Capital Advisors, Inc.\nIn addition, the Company and its subsidiaries have entered into loan financing agreements, asset management agreements, joint venture agreement, and memorandum of understanding with seven international investor groups for a total of six billion four hundred ninety million U.S. dollars, as reported in various 8-K filings with the Securities and Exchange Commission. The Company has been intensely focused on closing some of these transactions and expects to begin receiving capital through these sources in the near future to support its investment programs and merges and acquisitions.\nFINANCIAL PLANS\nMATERIAL CASH REQUIREMENTS: We must raise substantial amounts of capital to fulfill our plans for Philux Global Funds and for acquisitions. We intend to use equity, debt and project financing to meet our capital needs for acquisitions and investments.\nManagement has taken action and formulated plans to meet the Companys operating needs through June 30, 2024 and beyond. The working capital cash requirements for the next 12 months are expected to be generated from operations and additional financing. The Company plans to generate revenues from its consulting services, merger and acquisition advisory services, and acquisitions of target companies with positive cash flows.\nAVAILABLE FUTURE FINANCING ARRANGEMENTS: The Company may use various sources of funds, including short-term loans, long-term debt, equity capital, and project financing as may be necessary. The Company believes it will be able to secure the required capital to implement its business plan.\nEQUITY LINE OF CREDIT WITH INSTITUTIONAL INVESTOR\nOn March 01, 2022, the Company entered into an equity purchase agreement with an institutional investor (The Investor) as follows:\nThe Investor will provide an equity line of up to $10,000,000 to the Company, pursuant to which the Company has the right, but not the obligation, during the 24 months after an effective registration of the underlying shares, to issue a notice to the Investor (each a Drawdown Notice) which shall specify the amount of registered shares of common stock of the Company (the Put Shares) that the Company elects to sell to the Investor, from time to time, up to an aggregate amount equal to $10,000,000.\nThe pricing period of each put will be the 7 trading days immediately following receipt of the Put Shares (the Pricing Period).\nThe purchase price per share shall mean 90% of the average of the 2 lowest volume-weighted average prices of the Common Stock during the Pricing Period, less clearing fees, brokerage fees, other legal, and transfer agent fees incurred in the deposit (the Net Purchase Amount). The Investor shall pay the Net Purchase Amount to the Company by wire for each Drawdown Notice within 2 business days of the end of the Pricing Period.\nThe put amount in each Drawdown Notice shall not be less than $50,000 and shall not exceed the lesser of (i) $500,000 or (ii) 200% of the average dollar trading volume of the Common Stock during the 7 trading days immediately before the Put Date, subject to Beneficial Ownership cap.\nThere shall be a 7 trading day period between the receipt of the Put Shares and the next put.\nThe Company intends to file an S-1 Registration Statement with the Securities and Exchange Commission for this Equity Line of Credit. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe following discussion about PHI Group Inc.s market risk involves forward-looking statements. Actual results could differ materially from those projected in the forward-looking statements.\nCurrency Fluctuations and Foreign Currency Risk\nSome of our acquisition targets and partner companies are located outside of the United States and use currencies other than the U.S. dollar as the official currencies of those countries. The fluctuations of exchange rates in these countries may affect the value of our business.\nInterest Rate Risk\nWe do not have significant interest rate risk, as most of our debt obligations are primarily short-term in nature to individuals, with fixed interest rates.\nValuation of Securities Risk\nSince some of our income in the past was paid with the marketable securities, the value of our assets may fluctuate significantly depending on the market value of the securities we hold. ITEM 8. FINANCIAL STATEMENTS\nPHI GROUP, INC.\nReport of Independent Registered Public Accounting Firm (PCAOB No.:6662)\nBalance Sheet as of June 30, 2023 and June 30, 2022\nStatement of Operations for the fiscal years ended June 30, 2023 and June 30, 2022\nStatement of Cash Flows for the fiscal years ended June 30, 2023 and June 30, 2022\nStatement of Stockholders Equity (Deficit) for the fiscal years ended June 30, 2023 and June 30, 2022\nNotes to Financial Statements\nM.S. Madhava Rao Chartered Accountant\n316, 1st cross, 7th block, 4th phase,\nBSK 3rd Stage, Bengaluru, India 56085\nTel No: +91 8861838006, email: mankalr@yahoo.com\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n(To be provided)\nPHI GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS (AUDITED)\nJune 30, June 30,\nASSETS\nCurrent Assets\nCash and cash equivalents $ 19,765 $ 67,896\nMarketable securities\nOther current assets 241,426 365,360\nTotal current assets 261,611 433,802\nOther assets:\nInvestments 32,604 36,161\nTotal Assets 294,215 469,963\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nAccounts payable 616,245 615,805\nSub-fund obligations 1,624,775 1,574,775\nAccrued expenses 1,485,310 931,417\nShort-term loans and notes payable 1,164,685 676,888\nConvertible Promissory Notes 297,805 756,250\nDue to officers 1,027,782 1,077,218\nAdvances from customers 1,079,038 665,434\nDerivative liabilities and Note Discount 1,220,576 715,677\nTotal Liabilities 8,516,217 7,013,465\nStockholders deficit:\nPreferred Stock, $0.001 par value; 500,000,000 shares authorized. 600,000 shares of Class B Series I issued and outstanding as of 06/30/2023 and 06/30/2022 respectively. Par value:\nAPIC - Class B Series I 1,840 1,840\nTotal Preferred Stock 2,440 2,440\nCommon stock, $0.001 par value; 60 billion shares authorized; 39,414,493,275 shares issued and outstanding on 06/30/2023; 60 billion shares authorized and 31,429,380,453 shares issued and outstanding on 6/30/2022, respectively, adjusted for 1 for 1,500 reverse split effective March 15, 2012. Par value: 39,414,493 31,429,381\nAPIC - Common Stock 32,773,102 34,394,912\nCommon Stock to be issued 22,500 -\nCommon Stock to be cancelled (35,500 ) (35,500 )\nTreasury stock: 484,767 shares as of 6/30/23 and 6/30/22, respectively - cost method. (44,170 ) (44,170 )\nAccumulated deficit (77,319,372 ) (71,717,973 )\nTotal Acc. Other Comprehensive Income (Loss) (3,035,495 ) (572,591 )\nTotal stockholders deficit (8,222,002 ) (6,543,502 )\nTotal liabilities and stockholders deficit $ 294,215 $ 469,963\nThe accompanying notes form an integral part of these audited consolidated financial statements\nPHI GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF OPERATIONS (AUDITED)\nFOR THE YEARS ENDED\nJUNE 30,\nNet revenues\nConsulting, advisory and management services $ 25,000 $ 30,000\nTotal revenues 25,000 30,000\nOperating expenses:\nSalaries and wages 360,000 360,000\nProfessional services, including non-cash compensation 95,242 15,347,903\nAsia Diamond Exchange development costs 464,848 1,018,651\nGeneral and administrative 105,533 203,374\nTotal operating expenses 1,025,623 16,929,928\nIncome (loss) from operations (1,000,623 ) (16,899,928 )\nOther income and expenses\nOther income 1,118,195\nInterest expense (934,872 ) (1,592,557 )\nOther expenses (3,674,139 ) (3,780,153 )\nNet other income (expenses) (4,608,523 ) (4,254,515 )\nNet income (loss) $ (5,609,146 ) $ (21,154,443 )\nNet loss per share:\nBasic $ (0.00 ) $ (0.00 )\nDiluted $ (0.00 ) $ (0.00 )\nWeighted average number of shares outstanding:\nBasic 34,455,935,655 28,448,615,941\nDiluted 34,455,935,655 28,448,615,941\nThe accompanying notes form an integral part of these audited consolidated financial statements\nPHI GROUP, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nAUDITED\nCash flows from operating activities:\nNet income (loss) from operations $ (5,609,146 ) $ (21,154,443 )\nMark-to-market adjustments (2,455,157 ) (659,514 )\nNet change due to non-cash issuance of stock 4,845,007 20,404,740\nFund in transit 9,500 -\nAdjustments to reconcile net income to net cash used in operating activities:\n(Increase) decrease in assets and prepaid expenses\nMarketable securities 384,911\nTotal deferred financing costs 114,434 (355,860 )\nTotal (increase) decrease in assets and prepaid expenses 114,560 29,051\nIncrease (decrease) in accounts payable and accrued expenses\nAccounts payable 7,284\nSub-fund obligations 50,000 90,500\nAccrued expenses 553,893 (1,062,061 )\nAdvances from customers and client deposits 413,604 83,197\nDerivative liabilities 504,899 715,677\nTotal increase (decrease) in accounts payable and accrued expenses 1,522,836 (165,404 )\nNet cash provided by (used in) operating activities (1,572,400 ) (1,545,570 )\nCash flows from investing activities:\nNet cash provided by (used in) investing activities 3,557 410,834\nCash flows from financing activities:\nLoans from Directors/Officers (49,435 ) -\nNotes payable 29,352 1,087,288\nCommon Stock 1,540,795 20,000\nNet cash provided by (used in) financing activities 1,520,712 1,107,288\nNet decrease in cash and cash equivalents (48,131 ) (27,448 )\nCash and cash equivalents, beginning of period 67,896 95,344\nCash and cash equivalents, end of period $ 17,765 $ 67,896\nThe accompanying notes form an integral part of these audited consolidated financial statements\nPHI GROUP, INC. AND SUBSIDIARIES\nSTATEMENT OF STOCKHOLDERS EQUITY (DEFICIT)\nFOR THE YEAR ENDED JUNE 30, 2023 (AUDITED)\nShares Par Value Capital Shares Value Capital Shares Amount cancelled issued Gain (loss) Deficit Deficit\nAdditional Preferred Stock Additional\nCommon Stock Common Stock Other\nTotal\nCommon Stock Paid-in Stock Par Paid-in Treasury Stock to be to be\nComprehensive\nAccumulated Shareholder\nShares Par Value Capital Shares Value Capital Shares Amount cancelled issued Gain (loss) Deficit Deficit\nBalance at Fiscal Year Ended June 30, 2022 31,429,380,289 $ 31,429,381 $ 34,394,912 600,000 $ 600 $ 1,840 (484,767 ) (44,170 ) (35,000 ) $ (572,591 ) $ (71,717,973 ) $ (6,543,502 )\nCommon Shares issued for conversions of promissory notes durng the quarter ended September 30, 2022 392,096,775 392,097 $ (158,483 ) - - - - - - - - - $ 233,614\nCommon Shares issued for exercise of warrants during the quarter ended September 30, 2022 2,279,166,666 2,279,167 $ 115,913\n$ 2,395,080\nCommon Shares cancelled during quarter ended September 30, 2022 -454,758,300 (454,758 ) $ (90,952 )\n$ (545,710 )\nBalance as of December 31, 2022 33,645,885,430 33,645,886 $ 34,261,391 600,000 $ 600 $ 1,840 (484,767 ) (44,170 ) (35,000 ) 16,000 $ (572,022 ) $ (74,155,929 ) $ (6,881,906 )\nCommon Shares issued for conversions of promissory notes durng the quarter ended March 31, 2023 1,909,744,449 1,909,744 (333,569 ) - - - - - - - - - $ 1,576,175\nCommon Shares issued for conversions of promissory notes 1,909,744,449 1,909,744 (333,569 ) - - - - - - - - - $ 1,576,175\nCommon Shares issued for cash during the quarter ended March 31, 2023 609,309,245 609,309 15,556\n$ 624,865\nCommon Shares issued for contractual obligation during the quarter ended March 31, 2023 185,000,000 185,000 -\n$ 185,000\nCommon Shares issued for contractual obligation 185,000,000 185,000 -\n$ 185,000\nBalance as of March 31, 2023 36,349,939,124 36,349,940 33,943,377 60,000 1,840 (484,767 ) (44,170 ) (35,000 ) 396,000 $ (2,966,071 ) $ (75,932,642 ) $ (8,286,628 )\nBalance 36,349,939,124 36,349,940 33,943,377 60,000 1,840 (484,767 ) (44,170 ) (35,000 ) 396,000 $ (2,966,071 ) $ (75,932,642 ) $ (8,286,628 )\nCommon Shares issued for conversion of notes 1,568,970,299 1,568,970 -594,093 - - - - - - - - - 974,877\nCommon Shares issued for cash 1,495,583,852 1,495,584 -576,187\n919,397\nBalance as of June 30, 2023 39,414,493,275 39,414,494 32,773,097 60,000 1,840 (484,767 ) (44,170 ) (35,000 ) 22,500 $ (3,035,495 ) $ (77,319,372 ) $ (8,222,002 )\nBalance 39,414,493,275 39,414,494 32,773,097 60,000 1,840 (484,767 ) (44,170 ) (35,000 ) 22,500 $ (3,035,495 ) $ (77,319,372 ) $ (8,222,002 )\nThe accompanying notes form an integral part of these audited consolidated financial statements.\nPHI GROUP, INC. AND SUBSIDIARIES\n(a/k/a PHILUX GLOBAL GROUP INC)\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - NATURE OF BUSINESS\nPHI Group, Inc. (n/k/a Philux Global Group Inc) (the Company or PHI) (www.philuxglobal.com) is primarily engaged in mergers and acquisitions, advancing Philux Global Funds, SCA, SICAV-RAIF, a Reserved Alternative Investment Fund (RAIF) under the laws of Luxembourg, and developing the Asia Diamond Exchange in Vietnam. Besides, the Company provides corporate finance services, including merger and acquisition advisory and consulting services for client companies through our wholly owned subsidiary Philux Capital Advisors, Inc. (formerly PHI Capital Holdings, Inc.) (www.philuxcapital.com) and invests in selective industries and special situations aiming to potentially create significant long-term value for our shareholders. Philux Global Funds intends to include a number of sub-funds for investment in select growth opportunities in the areas of renewable energy, real estate, infrastructure, healthcare, agriculture and the Asia Diamond Exchange in together with the International Financial Center in Vietnam.\nBACKGROUND\nOriginally incorporated on June 8, 1982 as JR Consulting, Inc., a Nevada corporation, the Company applied for a Certificate of Domestication and filed Articles of Domestication to become a Wyoming corporation on September 20, 2017. In the beginning, the Company was foremost engaged in mergers and acquisitions and had an operating subsidiary, Diva Entertainment, Inc., which operated two modeling agencies, one in New York and one in California. In January 2000, the Company changed its name to Providential Securities, Inc., a Nevada corporation, following a business combination with Providential Securities, Inc., a California-based financial services company. In February 2000, the Company then changed its name to Providential Holdings, Inc. In October 2000, Providential Securities withdrew its securities brokerage membership and ceased its financial services business. Subsequently, in April 2009, the Company changed its name to PHI Group, Inc. From October 2000 to October 2011, the Company and its subsidiaries were engaged in various transactions in connection with mergers and acquisitions advisory and consulting services, real estate and hospitality development, mining, oil and gas, telecommunications, technology, healthcare, private equity, and special situations. In October 2011, the Company discontinued the operations of Providential Vietnam Ltd., Philand Ranch Limited, a United Kingdom corporation (together with its subsidiaries Philand Ranch - Singapore, Philand Corporation - US, and Philand Vietnam Ltd. - Vietnam), PHI Gold Corporation (formerly PHI Mining Corporation, a Nevada corporation), and PHI Energy Corporation (a Nevada corporation), and mainly focused on acquisition and development opportunities in energy and natural resource businesses.\nThe Company is currently focused on Philux Global Funds, SCA, SICAV-RAIF by launching Philux Global Select Growth Fund and potentially other sub-funds for investment in real estate, renewable energy, infrastructure, agriculture, healthcare and the Asia Diamond Exchange and International Financial Center in Vietnam. In addition, Philux Capital Advisors, Inc. (formerly Capital Holdings, Inc.), a wholly owned subsidiary of the Company, continues to provide corporate and project finance services, including merger and acquisition (M&A) advisory and consulting services for U.S. and international companies. The Company has also formed Philux Global Advisors, Inc. to serve as the investment advisor to Philux Global Funds and other potential fund clients in the future.\nThe Company had signed agreements to acquire majority equity interests in Kota Construction LLC and Kota Energy Group LLC (KOTA) which are engaged in solar energy business (https://www.kotasolar.com), and Tin Thanh Group, a Vietnamese joint stock company (www.tinthanhgroup.vn) (TTG). Whereas the scheduled closing dates for the KOTA and TTG transactions already expired, the Company has continued to discuss with these companies and intends to renegotiate an revised agreement with each of them when the Company successfully closes one or more of the pending asset management agreements and financing with certain investor groups and lenders. In addition, the Company intends to amend the Purchase and Sale Agreement that was originally signed on January 18, 2022 with Five-Grain Treasure Spirits Co., Ltd., a Chinese baiju distiller, to collaborate in launching American-made baiju products through Empire Spirits, Inc., a subsidiary of the Company. The Company is in the process of establishing a subsidiary in the Dubai Multi-Commodities Centre in United Arab Emirates to replace its former subsidiary CO2-1-0 (CARBON) Corp. to continue engaging in carbon emission mitigation using blockchain and crypto technologies. In May 2023, the company signed a business cooperation agreement with SSE Global JSC, a Vietnamese joint stock company, to establish SSE Global Group, Inc., a Wyoming corporation, (www.sseglobalgroup.com) to commercialize a self-sustainable energy technology. In addition, in June 2023 the Company signed a business cooperation agreement with Saphia Alkali JSC, a Vietnamese joint stock company, to form Sapphire Alkali Global Group in the United States to finance, manufacture, sell and distribute Saphia Alkalis proprietary products on a worldwide basis. These activities are disclosed in greater detail elsewhere in this report. No assurances can be made that the Company will be successful in achieving its plans.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPRINCIPLES OF CONSOLIDATION\nThe consolidated financial statements include the accounts of (1) PHI Group, Inc., its subsidiaries including (2) PHILUX Global Funds SCA, SICAV-RAIF, a Luxembourg bank fund designed to hold a number of subfund compartments for investing in various selective industries, (3) PHI Luxembourg Development S.A., the mother holding company for PHILUX Global Funds, (4) PHI Luxembourg Holding S.A., (5) PHILUX Global General Partner S.A., (6) Asia Diamond Exchange, Inc., a Wyoming corporation (100%), (7) PHILUX Capital Advisors, Inc., a Wyoming corporation (100%), and (8) CO2-1-0 (CARBON) Corp., collectively referred to as the Company. The other subsidiaries of the Company were not active during the fiscal year ended June 30, 2023. All significant inter-company transactions have been eliminated in consolidation.\nUSE OF ESTIMATES\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCASH AND CASH EQUIVALENTS\nThe Company considers all liquid investments with a maturity of three months or less from the date of purchase that are readily convertible into cash to be cash equivalents.\nMARKETABLE SECURITIES\nThe Companys securities are classified as available-for-sale and, as such, are carried at fair value. Securities classified as available-for-sale may be sold in response to changes in interest rates, liquidity needs, and for other purposes.\nEach investment in marketable securities typically represents less than twenty percent (20%) of the outstanding common stock and stock equivalents of the investee, and each security is quoted on a national exchange or on the OTC Markets. As such, each investment is accounted for in accordance with the provisions of ASC 320 (previously SFAS No. 115).\nUnrealized holding gains and losses for available-for-sale securities are excluded from earnings and reported as a separate component of stockholders equity. Realized gains and losses for securities classified as available-for-sale are reported in earnings based upon the adjusted cost of the specific security sold. On June 30, 2023 and 2022 the marketable securities have been recorded at $420 and $546, respectively, based upon the fair value of the marketable securities at that time.\nACCOUNTS RECEIVABLE\nManagement reviews the composition of accounts receivable and analyzes historical bad debts. There was no account receivable or bad debt during the fiscal ended June 30, 2023.\nIMPAIRMENT OF LONG-LIVED ASSETS\nEffective January 1, 2002, the Company adopted ASC 350 (Previously SFAS 144, Accounting for the Impairment or Disposal of Long-Lived Assets), which addresses financial accounting and reporting for the impairment or disposal of long-lived assets and supersedes SFAS No. 121, Accounting for the Impairment of Long-Lived Assets and for Long-Lived Assets to be Disposed Of, and the accounting and reporting provisions of APB Opinion No. 30, Reporting the Results of Operations for a Disposal of a Segment of a Business. The Company periodically evaluates the carrying value of long-lived assets to be held and used in accordance with ASC 350. ASC 350 requires impairment losses to be recorded on long-lived assets used in operations when indicators of impairment are present and the undiscounted cash flows estimated to be generated by those assets are less than the assets carrying amounts. In that event, a loss is recognized based on the amount by which the carrying amount exceeds the fair market value of the long-lived assets. Loss on long-lived assets to be disposed of is determined in a similar manner, except that fair market values are reduced for the cost of disposal.\nPROPERTY AND EQUIPMENT\nProperty and equipment are stated at cost. Maintenance and repair costs are charged to expense as incurred; costs of major additions and betterments are capitalized. When property and equipment are sold or otherwise disposed of, the cost and related accumulated depreciation are eliminated from the accounts and any resulting gain or loss is reflected in income. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, ranging from three to ten years.\nDEPRECIATION AND AMORTIZATION\nThe cost of property and equipment is depreciated over the estimated useful lives of the related assets. Depreciation and amortization of fixed assets are computed on a straight-line basis.\nNET EARNINGS (LOSS) PER SHARE\nThe Company adopted the provisions of ASC 260 (previously SFAS 128). ASC 260 eliminates the presentation of primary and fully diluted earnings per share (EPS) and requires presentation of basic and diluted EPS. Basic EPS is computed by dividing income (loss) available to common stockholders by the weighted-average number of common shares outstanding for the period. Diluted EPS is based on the weighted-average number of shares of common stock outstanding for the period and common stock equivalents outstanding at the end of the period.\nThe net earnings (loss) per share is computed as follows:\nSCHEDULE OF NET EARNINGS (LOSS) PER SHARE\nBasic and diluted loss per share:\nNumerator:\nNet income (loss): $ (5,609,146 ) $ (21,154,443 )\nDenominator:\nBasic weighted average number of common shares outstanding: 34,455,935,655 28,448,615,941\nBasic net income per share (0.00 ) (0.00 )\nDiluted weighted average number of common shares outstanding: 34,455,935,655 28,448,615,941\nDiluted net income (loss) per share: $ (0.00 ) $ (0.00 )\nSTOCK-BASED COMPENSATION\nEffective July 1, 2006, the Company adopted ASC 718-10-25 (previously SFAS 123R) and accordingly has adopted the modified prospective application method. Under this method, ASC 718-10-25 is applied to new awards and to awards modified, repurchased, or cancelled after the effective date. Additionally, compensation cost for the portion of awards that are outstanding as of the date of adoption for which the requisite service has not been rendered (such as unvested options) is recognized over a period of time as the remaining requisite services are rendered.\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nFair Value - Definition and Hierarchy\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Assets and liabilities measured at fair value are categorized based on whether or not the inputs are observable in the market and the degree that the inputs are observable. The categorization of financial assets and liabilities within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\nA fair value hierarchy for inputs is used in measuring fair value that maximizes the use of observable inputs and minimizes the use of unobservable inputs by requiring that the most observable inputs are to be used when available.\nValuation techniques that are consistent with the market or income approach are used to measure fair value. The fair value hierarchy is categorized into three levels based on the inputs as follows:\nLevel 1 - Valuations based on unadjusted quoted prices in active markets for identical assets or liabilities that the Fund has the ability to access.\nLevel 2 - Valuations based on inputs other than quoted prices included in Level 1 that are observable, either directly or indirectly.\nLevel 3 - Valuations based on inputs that are unobservable and significant to the overall fair value measurement.\nFair value is a market-based measure, based on assumptions of prices and inputs considered from the perspective of a market participant that are current as of the measurement date, rather than an entity-specific measure. Therefore, even when market assumptions are not readily available, the Companys own assumptions are set to reflect those that market participants would use in pricing the asset or liability at the measurement date. The availability of valuation techniques and observable inputs can vary from investment to investment and are affected by a wide variety of factors, including; type of investment, whether the investment is new and not yet established in the marketplace, the liquidity of markets, and other characteristics particular to the transaction.\nTo the extent that valuation is based upon models or inputs that are less observable or unobservable in the market, the determination of fair value requires more judgment. Because of the inherent uncertainty of valuation, those estimated values may be materially higher or lower than the values that would have been used had a ready market for the investments existed. Accordingly, the degree of judgment exercised by the Fund in determining fair value is greatest for investments categorized in Level 3. In certain cases, the inputs used to measure fair value may fall into different levels of the fair value hierarchy. In such cases, the level in the fair value hierarchy in which the fair value measurement falls in its entirety is determined based upon the lowest level input that is significant to the fair value measurement.\nFair Value - Valuation Techniques and Inputs\nThe Company holds and may invest public securities traded on public exchanges or over-the-counter (OTC), private securities, real estate, convertible securities, interest bearing securities and other types of securities and has adopted specific techniques for their respective valuations.\nEquity Securities in Public Companies\nUnrestricted\nThe Company values investments in securities that are freely tradable and listed on major securities exchanges at their last reported sales price as of the valuation date. To the extent these securities are actively traded and valuation adjustments are not applied, they are categorized in Level 1 of the fair value hierarchy.\nSecurities traded on inactive markets or valued by reference to similar instruments are generally categorized in Level 2 or 3 of the fair value hierarchy.\nRestricted\nSecurities traded on public exchanges or over-the-counter (OTC) where there are formal restrictions that limit (i.e. Rule 144 holding periods and underwriters lock-ups) their sale shall be valued at the closing price on the date of valuation less applicable discounts. The Company may apply a discount to securities with Rule 144 restrictions. Additional discounts may be assessed if the Company believes there are other mitigating factors which warrant the additional discounting. When determining potential additional discounts, factors that will be taken into consideration include, but are not limited to; securities trading characteristics, volume, length and overall impact of the restriction as well as other macro-economic factors. Valuations should be discounted appropriately until the securities may be freely traded.\nIf it has been determined that the exchange or OTC listed price does not accurately reflect fair market value, the Company may elect to treat the security as a private company and apply an alternative valuation method.\nInvestments in restricted securities of public companies may be included in Level 2 of the fair value hierarchy. However, to the extent that significant inputs used to determine liquidity discounts are not observable, investments in restricted securities in public companies may be categorized in Level 3 of the fair value hierarchy.\nThe Companys financial instruments primarily consist of cash and cash equivalents, accounts receivable, marketable securities, short-term notes payable, convertible notes, derivative liability and accounts payable.\nAs of the balance sheet dates, the estimated fair values of the financial instruments were not materially different from their carrying values as presented on the balance sheet. This is primarily attributed to the short maturities of these instruments.\nEffective July 1, 2008, the Company adopted ASC 820 (previously SFAS 157), Fair Value Measurements and adopted this Statement for the assets and liabilities shown in the table below. ASC 820 clarifies the definition of fair value, prescribes methods for measuring fair value, establishes a fair value hierarchy based on the inputs used to measure fair value, and expands disclosures about the use of fair value measurements. The adoption of ASC 820 did not have a material impact on our fair value measurements. ASC 820 permits the Company to defer the recognition and measurement of the nonfinancial assets and nonfinancial liabilities until January 1, 2010. At June 30, 2023, the Company did not have any nonfinancial assets or nonfinancial liabilities that are recognized or disclosed at fair value. ASC 820 requires that financial assets and liabilities that are reported at fair value be categorized as one of the types of investments based upon the methodology mentioned in Level 1, Level 2 and Level 3 above for determining fair value.\nAssets measured at fair value on a recurring basis are summarized below. The Company also has convertible notes and derivative liabilities as disclosed in this report that are measured at fair value on a regular basis until paid off or exercised.\nThe Company uses various approaches to measure fair value of available-for-sale securities, while applying the three-level valuation hierarchy for disclosures, specified in ASC 820. Our Level 1 securities were measured using the quoted prices in active markets for identical assets and liabilities.\nThe companys policy regarding the transfers in and/or out of Level 3 depends on the trading activity of the security, the volatility of the security, and other observable units which clearly represents the fair value of the security. If a level 3 security can be measured using a more fairly represented fair value, we will transfer these securities either into Level 1 or Level 2, depending on the type of inputs.\nREVENUE RECOGNITION STANDARDS\nASC 606-10 provides the following overview of how revenue is recognized from an entitys contracts with customers: An entity recognizes revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services.\nStep 1: Identify the contract(s) with a customer.\nStep 2: Identify the performance obligations in the contract.\nStep 3: Determine the transaction price - The transaction price is the amount of consideration in a contract to which an entity expects to be entitled in exchange for transferring promised goods or services to a customer.\nStep 4: Allocate the transaction price to the performance obligations in the contract - Any entity typically allocates the transaction price to each performance obligation on the basis of the relative standalone selling prices of each distinct good or service promised in the contract.\nStep 5: Recognize revenue when (or as) the entity satisfies a performance obligation - An entity recognizes revenue when (or as) it satisfies a performance obligation by transferring a promised good or service to a customer (which is when the customer obtains control of that good or service).\nThe amount of revenue recognized is the amount allocated to the satisfied performance obligation. A performance obligation may be satisfied at a point in time (typically for promises to transfer goods to a customer) or over time (typically for promises to transfer service to a customer). For performance obligations satisfied over time, an entity recognizes revenue over time by selecting an appropriate method for measuring the entitys progress toward complete satisfaction of that performance obligation. (Paragraphs 606-10 25-23 through 25-30).\nIn addition, ASC 606-10 contains guidance on the disclosures related to revenue, and notes the following:\nIt also includes a cohesive set of disclosure requirements that would result in an entity providing users of financial statements with comprehensive information about the nature, amount, timing, and uncertainty of revenue and cash flows arising from the entitys contracts with customers. Specifically, Section 606-10-50 requires an entity to provide information about:\n- Revenue recognized from contracts with customers, including disaggregation of revenue into appropriate categories.\n- Contract balances, including the opening and closing balances of receivables, contract assets, and contract liabilities.\n- Performance obligations, including when the entity typically satisfies its performance obligations and the transaction prices is that is allocated to the remaining performance obligations in a contract.\n- Significant judgments, and changes in judgments, made in applying the requirements to those contracts.\nAdditionally, Section 340-40-50 requires an entity to provide quantitative and/or qualitative information about assets recognized from the costs to obtain or fulfill a contract with a customer.\nThe Companys revenue recognition policies are in compliance with ASC 606-10. The Company recognizes consulting and advisory fee revenues in accordance with the above-mentioned guidelines and expenses are recognized in the period in which the corresponding liability is incurred.\nADVERTISING\nThe Company expenses advertising costs as incurred. Advertising costs for the years ended June 30, 2023 and 2022 were $500 and $8,700, respectively.\nCOMPREHENSIVE INCOME (LOSS)\nASC 220-10-45 (previously SFAS 130, Reporting Comprehensive Income) establishes standards for reporting and display of comprehensive income, its components and accumulated balances. Comprehensive income is defined to include all changes in equity, except those resulting from investments by owners and distributions to owners. Among other disclosures, SFAS No. 130 requires that all items that are required to be recognized under current accounting standards as components of comprehensive income be reported in a financial statement that is displayed with the same prominence as other financial statements. As of June 30, 2023 and 2022, respectively, accumulated other comprehensive income (loss) of $(3,035,495) and $ ($572,591) are presented on the accompanying consolidated balance sheets.\nINCOME TAXES\nThe Company accounts for income taxes in accordance with ASC 740 (previously SFAS No. 109, Accounting for Income Taxes). Deferred taxes are provided on the liability method whereby deferred tax assets are recognized for deductible temporary differences, and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nREPORTING OF SEGMENTS\nASC 280 (previously Statement of Financial Accounting Standards No. 131, Disclosures about Segments of an Enterprise and Related Information), which supersedes Statement of Financial Accounting Standards No. 14, Financial Reporting for Segments of a Business Enterprise, establishes standards for the way that public enterprises report information about operating segments in annual financial statements and requires reporting of selected information about operating segments in interim financial statements regarding products and services, geographic areas and major customers. ASC 280 defines operating segments as components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision maker in deciding how to allocate resources and in assessing performance. The Company operated in one revenue-generating segment during the years ended June 30, 2023 and June 30, 2022.\nRISKS AND UNCERTAINTIES\nIn the normal course of business, the Company is subject to certain risks and uncertainties. The Company provides its service and receives marketable securities upon execution of transactions. Consequently, the value of the securities received from customers can be affected by economic fluctuations and each customers business growth. The actual realized value of these securities could be significantly different than recorded value.\nRECENT ACCOUNTING PRONOUNCEMENTS\nIn August 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2020-06-Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40)-Accounting For Convertible Instruments and Contracts in an Entitys Own Equity. The ASU simplifies accounting for convertible instruments by removing major separation models required under current GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument with no separate accounting for embedded conversion features. The ASU removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for it. The ASU also simplifies the diluted net income per share calculation in certain areas. The new guidance is effective for annual and interim periods beginning after December 15, 2021, and early adoption is permitted for fiscal years beginning after December 15, 2020.\nUpdate No. 2018-13 - August 2018\nFair Value Measurement (Topic 820): Changes to the Disclosure Requirements for Fair Value Measurement\nModifications: The following disclosure requirements were modified in Topic 820:\n1. In lieu of a roll-forward for Level 3 fair value measurements, a nonpublic entity is required to disclose transfers into and out of Level 3 of the fair value hierarchy and purchases and issues of Level 3 assets and liabilities.\n2. For investments in certain entities that calculate net asset value, an entity is required to disclose the timing of liquidation of an investees assets and the date when restrictions from redemption might lapse only if the investee has communicated the timing to the entity or announced the timing publicly.\n3. The amendments clarify that the measurement uncertainty disclosure is to communicate information about the uncertainty in measurement as of the reporting date.\nAdditions: The following disclosure requirements were added to Topic 820; however, the disclosures are not required for nonpublic entities:\n1. The changes in unrealized gains and losses for the period included in other comprehensive income for recurring Level 3 fair value measurements held at the end of the reporting period.\n2. The range and weighted average of significant unobservable inputs used to develop Level 3 fair value measurements. For certain unobservable inputs, an entity may disclose other quantitative information (such as the median or arithmetic average) in lieu of the weighted average if the entity determines that other quantitative information would be a more reasonable and rational method to reflect the distribution of unobservable inputs used to develop Level 3 fair value measurements.\nThe amendments in this Update are effective for all entities for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2019.\nUpdate No. 2018-07 - June 2018\nCompensation - Stock Compensation (Topic 718)\nImprovements to Nonemployee Share-Based Payment Accounting\nMain Provisions: The amendments in this Update expand the scope of Topic 718 to include share-based payment transactions for acquiring goods and services from nonemployees. An entity should apply the requirements of Topic 718 to nonemployee awards except for specific guidance on inputs to an option pricing model and the attribution of cost (that is, the period of time over which share-based payment awards vest and the pattern of cost recognition over that period). The amendments specify that Topic 718 applies to all share-based payment transactions in which a grantor acquires goods or services to be used or consumed in a grantors own operations by issuing share-based payment awards. The amendments also clarify that Topic 718 does not apply to share-based payments used to effectively provide (1) financing to the issuer or (2) awards granted in conjunction with selling goods or services to customers as part of a contract accounted for under Topic 606, Revenue from Contracts with Customers.\nThe amendments in this Update are effective for public business entities for fiscal years beginning after December 15, 2018, including interim periods within that fiscal year.\nUpdate No. 2017-13 - September 2017\nRevenue Recognition (Topic 605), Revenue from Contracts with Customers (Topic 606)\nFASB Accounting Standards Updates No. 2014-09, Revenue from Contracts with Customers (Topic 606), issued in May 2014 and codified in ASC Topic 606, Revenue from Contracts with Customers, and No. 2016-02.\nThe transition provisions in ASC Topic 606 require that a public business entity and certain other specified entities adopt ASC Topic 606 for annual reporting 3 periods beginning after December 15, 2017, including interim reporting periods within that reporting period. FN2 All other entities are required to adopt ASC Topic 606 for annual reporting periods beginning after December 15, 2018, and interim reporting periods within annual reporting periods beginning after December 15, 2019.\nUpdate No. 2016-10 - April 2016\nRevenue from Contracts with Customers (Topic 606): Identifying Performance Obligations and Licensing\nThe core principle of the guidance in Topic 606 is that an entity should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. To achieve that core principle, an entity should apply the following steps:\n1. Identify the contract(s) with a customer.\n2. Identify the performance obligations in the contract.\n3. Determine the transaction price.\n4. Allocate the transaction price to the performance obligations in the contract.\n5. Recognize revenue when (or as) the entity satisfies a performance obligation.\nThe amendments in this Update do not change the core principle of the guidance in Topic 606. Rather, the amendments in this Update clarify the following two aspects of Topic 606: identifying performance obligations and the licensing implementation guidance, while retaining the related principles for those areas.\nThe Company has either evaluated or is currently evaluating the implications, if any, of each of these pronouncements and the possible impact they may have on the Companys financial statements. In most cases, management has determined that the implementation of these pronouncements would not have a material impact on the financial statements taken as a whole.\nNOTE 3 - OTHER CURRENT ASSETS\nThe Companys marketable securities are classified as available-for-sale and, as such, are carried at fair value. All of the securities are comprised of shares of common stock of the investee. Securities classified as available-for-sale may be sold in response to changes in interest rates, liquidity needs, and for other purposes. Each investment in marketable securities represents less than twenty percent (20%) of the outstanding common stock and stock equivalents of the investee, and each security is nationally quoted on the National Association of Securities Dealers OTC Bulletin Board (OTCBB) or the OTC Markets. As such, each investment is accounted for in accordance with the provisions of SFAS No. 115.\nMarketable securities owned by the Company and classified as available for sale as of June 30, 2023 consisted of\nshares of Myson Group, Inc. traded on the OTC Markets (Trading symbols MYSN). The fair value of the marketable securities recorded as of June 30, 2023 was $420.42.\nSCHEDULE OF FAIR VALUE OF INVESTMENTS MARKETABLE EQUITY SECURITIES\nSecurities available for sale Level 1 Level 2 Level 3 Total\nJune 30, 2023 $ - $ 420 $ - $ 420\nJune 30, 2022 $ - $ 546 $ - $ 546\nDuring the fiscal year ended June 30, 2023, there was no transfer of securities from level 3 to level 2.\nNOTE 4 - OTHER ASSETS\nThe Other Assets comprise of the following as of June 30, 2023 and 2022\nSCHEDULE OF OTHER ASSETS\nInvestment in Philux Global Funds 32,604 31,161\nInvestment in AQuarius Power, Inc. - 5,000\nTotal Other Assets $ 32,604 $ 36,161\nInvestments as of June 30, 2023 consist of $32,604 in the initial General Partner, Limited and Ordinary Shares of Philux Global Funds SCA, SICAV-RAIF based on the exchange rate as of June 30, 2023. During the fiscal year ended June 30, 2023, the company wrote off $5,000 investment in AQuarius Power, Inc. and recognized a total of $464,849 that was spent for the development of the Asia Diamond Exchanges project as expenses.\nNOTE 5 - PROPERTY AND EQUIPMENT\nAs of June 30, 2023 the Company did not have any property or equipment.\nNOTE 6 - CURRENT LIABILITIES\nCurrent liabilities of the Company consist of the followings as of June 30, 2023 and 2022:\nSCHEDULE OF CURRENT LIABILITIES\nCurrent Liabilities June 30, 23 June 30, 2022\nAccounts payable 616,245 615,805\nSub-fund obligations 1,624,775 1,574,775\nAccrued expenses 1,485,310 931,417\nShort-term loans and notes payable 1,164,685 676,888\nConvertible Promissory Notes 297,805 756,250\nDue to officers 1,027,782 1,077,218\nAdvances from customers and client deposits 1,079,038 665,434\nDerivative liabilities and Note Discount 1,220,576 715,677\nTotal Current Liabilities 8,516,217 7,013,465\nACCRUED EXPENSES: Accrued expenses as of June 30, 2023 consist of $1,028,095 in accrued salaries, $338,591 in accrued interest from notes and loans and $117,625 from administrative fees and penalties.\nNOTES PAYABLE (NET): Notes payable consist of $1,164,685 in short-term notes and loans payable and $297,805 in convertible promissory notes.\nADVANCES FROM CUSTOMERS AND CLIENT DEPOSITS\nAdvances from Customers were $819,038 which included $158,604 in interest charges as of June 30, 2023, and $665,434 as of June 30, 2022, respectively.\nClient deposits were $260,000 as of June 30, 2023.\nSUB-FUND OBILGATIONS: As of June 30, 2023, the Company has received $800,000 from European Plastic Joint Stock Company towards the expenses for setting up the energy sub-fund, $518,409 from Saigon Pho Palace Joint Stock Company and $150,000 from Sinh Nguyen Co., Ltd. towards the expenses for setting up the real estate sub-fund, and $156,366.25 from TECCO Group towards the expenses for setting up the infrastructure sub-fund, respectively, under the master PHILUX Global Funds. The Company recorded these amounts as liabilities until these sub-funds are set up and capitalized, at which time the sub-fund participants will receive 49% of the general partners portion of ownership in the relevant sub-funds for a total contribution of $2,000,000 each. The Company recorded a total of $1,624,775 as of June 30, 2023 and $1,574,775 as of June 30, 2022 as sub-fund obligations.\nNOTE 7- DUE TO OFFICERS AND DIRECTORS\nDue to officer, represents loans and advances made by officers and directors of the Company and its subsidiaries, unsecured and due on demand. As of June 30, 2023 and 2022 , the balances were $1,027,782 and $1,077,218, respectively.\nSCHEDULE OF COMPONENTS OF DUE TO OFFICERS AND DIRECTORS\nOfficers/Directors June 30, 2023 June 30, 2022\nHenry Fahman (Chairman and CEO) 364,432 413,868\nTam Bui (former Director and COO) 663,350 663,350\nTotal $ 1,027,782 $ 1,077,218\nNOTE 8 - LOANS AND PROMISSORY NOTES\nSHORT TERM NOTES PAYABLE:\nIn the course of its business, the Company has obtained short-term loans from individuals and institutional investors and from time to time raised money by issuing restricted common stock of the Company under the auspices of Rule 144. As of June 30, 2023, the Company had $945,598 in short-term notes payable consisting of $901,848 of regular short-term notes and $43,750 SBA loan, and $219,087 merchant cash advance including a deferred interest. These notes bear interest rates ranging from 0% to 36% per annum.\nCONVERTIBLE PROMISSORY NOTES:\nAs of June 30, 2023, the principal balance of the outstanding convertible notes was $297,805 with total derivative liabilities of $1,220,576. The Company relies on professional third-party valuation to record the value of derivative liabilities, discounts, and changes in fair value of derivatives in connection with these convertible notes and warrants, if any, that are related to the convertible notes.\nNOTE 9 - BASIC AND DILUTED NET LOSS PER SHARE\nNet loss per share is calculated in accordance with SFAS No. 128, Earnings per Share. Under the provision of SFAS No. 128, basic net loss per share is computed by dividing the net loss for the period by the weighted-average number of common shares outstanding for the period. Diluted EPS is based on the weighted-average number of shares of common stock outstanding for the period and common stock equivalents outstanding at the end of the period. Basic and diluted weighted average numbers of shares for the year ended June 30, 2023 were the same since the inclusion of Common stock equivalents is anti-dilutive.\nNOTE 10 - DOMESTICATION IN THE STATE OF WYOMING\nOn September 20, 2017, the Company applied for a Certificate of Domestication and filed Articles of Domestication with the office of the Secretary of State of Wyoming to re-domicile the Companys jurisdiction to the State of Wyoming.\nOn September 20, 2017, the Company filed Articles of Amendment with the Wyoming Secretary of State to amend the authorized capital of the Company as follows:\nThe total number of shares into which the authorized capital stock of the corporation is divided is one billion shares, consisting of: nine hundred million shares of voting Common Stock with a par value of $0.001 per share; fifty million shares of non-voting Class A Series I Preferred Stock with a par value of $5.00 per share; twenty-five million shares of non-voting Class A Series II Preferred Stock with a par value of $5.00 per share; twenty million shares of non-voting Class A Series III Preferred Stock with a par value of $5.00 per share and five million shares of voting Class A Series IV Preferred Stock with a par value of $5.00 per share. The relative rights, preferences, limitations and restrictions associated with the afore-mentioned shares of Class A Preferred Stock will be determined by the Board of Directors of the corporation.\nOn June 25, 2020, the Company filed Articles of Amendment with the Wyoming Secretary of State to amend Article 10 of the Articles of Domestication to authorize Forty Billion (40,000,000,000) shares of Common Stock with a par value of $0.001 per share and Five Hundred Million (500,000,000) shares of Preferred Stock with a par value of $0.001 per share and to designate Classes A and B and the Series of those classes of Preferred Stock as following:\nI. Class A Preferred Stock\nA. DESIGNATIONS, AMOUNTS AND DIVIDENDS\n1. Class A Series I Cumulative Convertible Redeemable Preferred Stock\na. Designation: Fifty million (50,000,000) shares of the authorized 500,000,000 shares of Preferred Stock, with a par value of $0.001 per share, are designated as Class A Series I Cumulative Convertible Redeemable Preferred Stock\nb. Number of Shares: The number of shares of Class A Series I Preferred Stock authorized shall be fifty million (50,000,000) shares.\nc. Dividends: Each holder of Class A Series I Preferred Stock is entitled to receive ten percent (10%) non-compounding cumulative dividends per annum, payable semi-annually.\n2. Class A Series II Cumulative Convertible Redeemable Preferred Stock\na. Designation. Two hundred million (200,000,000) shares of the authorized 500,000,000 shares of Preferred Stock, with a par value of $0.001 per share, are designated Class A Series II Cumulative Convertible Redeemable Preferred Stock (the Class A Series II Preferred Stock).\nc. Number of Shares. The number of shares of Class A Series II Preferred Stock authorized shall be two hundred million (200,000,000) shares.\nc. Dividends: Each holder of Class A Series II Preferred Stock is entitled to receive eight percent (8%) cumulative dividends per annum, payable semi-annually.\n3. Class A Series III Cumulative Convertible Redeemable Preferred Stock\na. Designation. Fifty million (50,000,000) shares of the authorized 500,000,000 shares of Preferred Stock, with a par value of $0.001 per share, are designated as Class A Series III Cumulative Convertible Redeemable Preferred Stock (the Class A Series III Preferred Stock).\nb. Number of Shares. The number of shares of Class A Series III Preferred Stock authorized shall be fifty million (50,000,000) shares.\nc. Dividends: Each holder of Class A Series III Preferred Stock is entitled to receive eight percent (8%) cumulative dividends per annum, payable semi-annually.\n4. Class A Series IV Cumulative Convertible Redeemable Preferred Stock\na. Designation. One hundred ninety-nine million (199,000,000) shares of the authorized 500,000,000 shares of Preferred Stock, with a par value of $0.001 per share, are designated as Class A Series IV Cumulative Convertible Redeemable Preferred Stock (the Class A Series IV Preferred Stock).\nb. Number of Shares. The number of shares of Class A Series III Preferred Stock authorized shall be one hundred ninety-nine million (199,000,000) shares.\nc. Dividends: To be determined by the Corporations Board of Directors.\nB. CONVERSION\n1. Conversion of Series I, Series II and/or Series IV Class A Preferred Stock into Common Stock of PHI Group, Inc.\nEach share of the Class A Preferred Stock, either Series I, Series II or Series IV shall be convertible into the Companys Common Stock any time after two years from the date of issuance at a Variable Conversion Price (as defined herein) of the Common Stock. The Variable Conversion Price shall mean 75% multiplied by the Market Price (as defined herein) (representing a discount rate of 25%). Market Price means the average Trading Price for the Companys Common Stock during the ten (10) trading-day period ending one trading day prior to the date the Conversion Notice is sent by the Holder of the Class A Preferred Stock to the Company via facsimile or email (the Conversion Date). Trading Price means, for any security as of any date, the closing price on the OTC Markets, OTCQB, NASDAQ Stock Markets, or applicable trading market as reported by a reliable reporting service (Reporting Service) mutually acceptable to the Company and Holder of the Class A Preferred Stock.\n2. Conversion of Series I, Series II and/or Series IV Class A Preferred Stock into Common Stock of a subsidiary of PHI Group, Inc.s.\nAlternatively, each share of the Class A Preferred Stock, either Series I, Series II and/or Series IV may be convertible into Common Stock of a subsidiary of PHI Group, Inc.s, to be determined by the Companys Board of Directors, any time after such subsidiary has become a fully-reporting publicly traded company for at least three months, at a Variable Conversion Price (as defined herein). The Variable Conversion Price to be used in connection with the conversion into Common Stock of a subsidiary of PHI Group, Inc.s shall mean 50% multiplied by the Market Price (as defined herein), representing a discount rate of 50%, of that Common Stock. Market Price means the average Trading Price for the Common Stock of said subsidiary of PHI Group, Inc.s during the ten (10) trading-day period ending one trading day prior to the date the Conversion Notice is sent by the Holder of the Preferred Stock to the Company via facsimile or email (the Conversion Date). Trading Price means, for any security as of any date, the closing price on the OTC Markets, OTCQB, NASDAQ Stock Markets, NYSE or applicable trading market as reported by a reliable reporting service (Reporting Service) mutually acceptable to the Company, said subsidiary and Holder of the Class A Preferred Stock.\n3. Conversion of Class A Series III Preferred Stock of PHI Group, Inc. into Common Stock of American Pacific Plastics, Inc., a subsidiary of PHI Group, Inc.s.\nThe entire Class A Series III Preferred Stock of PHI Group, Inc. (i.e. fifty million (50,000,000) shares) may be convertible into eighty percent (80%) American Pacific Plastics, Inc.s Common Stock which will have been issued and outstanding immediately after such conversion or exchange on a pro rata basis.\n4. Conversion Shares.\nThe amount of shares of Common Stock of PHI Group, Inc., or alternatively, of a subsidiary of PHI Group, Inc.s, to be received by Holder at the time of conversion of Class A Series I or Series II Preferred Stock of PHI Group, Inc. will be based on the following formula:\nWhere\nCS: Common Shares of PHI Group, Inc.,\nAmount of CS =\nor alternatively, of a subsidiary of PHI Group, Inc.s.\nOIP + AUD\nVCP\nOIP: Original Issue Price of Class A Series I or Series II Preferred Stock of PHI Group, Inc.\nAUD: Accrued and Unpaid Dividends.\nVCP: Variable Conversion Price of PHI Common Stock or of a subsidiary of PHI Group, Inc.s as defined above.\nC. REDEMPTION RIGHTS\nThe Corporation, after a period of two years from the date of issuance, may at any time or from time to time redeem the Class A Preferred Stock, either Series I, Series II, Series III or Series IV in whole or in part, at the option of the Companys Board of Directors, at a price equal to one hundred twenty percent (120%) of the original purchase price of the Class A Preferred Stock or of a unit consisting of any shares of Class A Preferred Stock and any warrants attached thereto, plus, in each case, accumulated and unpaid dividends to the date fixed for redemption.\nD. LIQUIDATION\nUpon the occurrence of a Liquidation Event (as defined below), the holders of Class A Preferred Stock are entitled to receive net assets on a pro rata basis. As used herein, Liquidation Event means (i) the liquidation, dissolution or winding-up, whether voluntary or involuntary, of the Corporation, (ii) the purchase or redemption by the Corporation of shares of any class of stock or the merger or consolidation of the Corporation with or into any other corporation or corporations, unless (a) the holders of the Class A Preferred Stock receive securities of the surviving corporation having substantially similar rights as the Class A Preferred Stock and the stockholders of the Corporation immediately prior to such transaction are holders of at least a majority of the voting securities of the successor corporation immediately thereafter (the Permitted Merger), unless the holders of the shares of Class A Preferred Stock elect otherwise or (b) the sale, license or lease of all or substantially all, or any material part of, the Corporations assets, unless the holders of Class A Preferred Stock elect otherwise.\nE. RANK\nAll shares of the Class A Preferred Stock shall rank (i) senior to the Corporations Common Stock and any other class or series of capital stock of the Corporation hereafter created, (ii) pari passu with any class or series of capital stock of the Corporation hereafter created and specifically ranking, by its terms, on par with the Class A Preferred Stock and (iii) junior to any class or series of capital stock of the Corporation hereafter created specifically ranking, by its terms, senior to the Class A Preferred Stock, in each case as to distribution of assets upon liquidation, dissolution or winding up of the Corporation, whether voluntary or involuntary.\nF. VOTING RIGHTS\n1. Class A Series I, II, III and IV Preferred Stock of PHI Group, Inc. shall have no voting rights.\nG. PROTECTION PROVISIONS\nSo long as any shares of Class A Preferred Stock are outstanding, the Corporation shall not, without first obtaining the majority written consent of the holders of Class A Preferred Stock, alter or change the rights, preferences or privileges of the Class A Preferred Stock so as to affect adversely the holders of Class A Preferred Stock.\nH. MISCELLANEOUS\n1. Status of Redeemed Stock: In case any shares of Class A Preferred Stock shall be redeemed or otherwise repurchased or reacquired, the shares so redeemed, repurchased, or reacquired shall resume the status of authorized but unissued shares of preferred stock, and shall no longer be designated as Class A Preferred Stock.\n2. Lost or Stolen Certificates: Upon receipt by the Corporation of (i) evidence of the loss, theft, destruction or mutilation of any Preferred Stock Certificate(s) and (ii) in the case of loss, theft or destruction, indemnity (with a bond or other security) reasonably satisfactory to the Corporation, or in the case of mutilation, the Preferred Stock Certificate(s) (surrendered for cancellation), the Corporation shall execute and deliver new Preferred Stock Certificates. However, the Corporation shall not be obligated to reissue such lost, stolen, destroyed or mutilated Preferred Stock Certificates if the holder of Class A Preferred Stock contemporaneously requests the Corporation to convert such holders Class A Preferred Stock into Common Stock.\n3. Waiver: Notwithstanding any provision in this Certificate of Designation to the contrary, any provision contained herein and any right of the holders of Class A Preferred granted hereunder may be waived as to all shares of Class A Preferred Stock (and the holders thereof) upon the majority written consent of the holders of the Class A Preferred Stock.\n4. Notices: Any notices required or permitted to be given under the terms hereof shall be sent by certified or registered mail (return receipt requested) or delivered personally, by nationally recognized overnight carrier or by confirmed facsimile transmission, and shall be effective five (5) days after being placed in the mail, if mailed, or upon receipt or refusal of receipt, if delivered personally or by nationally recognized overnight carrier or confirmed facsimile transmission, in each case addressed to a party as set forth below, or such other address and telephone and fax number as may be designated in writing hereafter in the same manner as set forth in this Section.\nIf to the Corporation:\nPHI GROUP, INC.\nN Gould Street, Suite R\nSheridan, WY 82801\nFacsimile: 702-472-8556\nEmail: info@phiglobal.com\nIf to the holders of Class Preferred Stock, to the address to be listed in the Corporations books and Records.\nII. Class B Preferred Stock\n1. Class B Series I Preferred Stock\na. Designation: One million (1,000,000) shares of the authorized 500,000,000 shares of Preferred Stock, with a par value of $0.001 per share, are designated as Class B Series I Preferred Stock.\nb. Number of Shares: The number of shares of Class B Series I Preferred Stock authorized will be one million (1,000,000) shares.\nc. Dividend: None\nd. Voting rights: Except as provided by law, the shares of Class B Series I Preferred Stock shall have the same right to vote or act on all matters on which the holders of Common Stock have the right to vote or act and the holders of the shares of Class B Series I shall be entitled to notice of any stockholders meeting or action as to such matters on the same basis as the holders of Common Stock, and the holders of Common Stock and shares of Class B Series I shall vote together or act together thereon as if a single class on all such matters; provided, in such voting or action each one share of Class B Series I shall be entitled to one hundred thousand (100,000) votes.\nNOTE 11. STOCKHOLDERS EQUITY\nAs of June 30, 2023, the total number of authorized capital stock of the Company consisted of Sixty Billion shares of voting Common Stock with a par value of $0.001 per share and Five Hundred Million shares of Preferred Stock with a par value of $0.001 per share.\nTreasury Stock\nThe balance of treasury stock as of June 30, 2023 was 487,767 shares valued at $44,170 based on cost basis.\nCommon Stock\nDuring the fiscal year ended June 30, 2023, the Company issued/cancelled the following shares of its Common Stock for cash, conversion of promissory notes, loan payments, salaries, warrants, and consulting services:\nSCHEDULE OF CONVERSIONS OF COMMON STOCK\n7/01/2022\nBeginning balance\nIssuances/Cancellations\n31,429,380,289\nIssuances for warrant exercises\n1,879,166,666\nIssuances for conversion of notes\n4,455,811,523\nIssuances for cash to certain current shareholders\n2,104,893,097\nCancellation of shares by lender\n-454,758,300\n6/30/2023\nEnding balance\n39,414,493,275\nAs of June 30, 2023, there were 39,414,493,275 shares of the Companys common stock issued and outstanding.\nPreferred Stock\nAs of June 30, 2023, there were 600,000 shares of Class B Series I Preferred Stock issued and outstanding.\nNOTE 12 - STOCK-BASED COMPENSATION PLANS\nOn February March 18, 2015, the Company adopted an Employee Benefit Plan to set aside 1,000,000 shares of common stock for eligible employees and independent contractors of the Company and its subsidiaries. As of June 30, 2023 the Company has not issued any stock in lieu of cash under this plan.\nOn September 23, 2016, the Company issued incentive stock options and nonqualified stock options to certain key employee(s) (Henry Fahman - CEO/CFO) and directors (Tam Bui, Henry Fahman, and Frank Hawkins constitute the Board of Directors) as deferred compensation. The options allow the holders to acquire the Companys Common Stock at the fair exercise price of the Companys Common Stock on the grant date of each option at $0.24 per share, based on the 10-days volume-weighted average price prior to the grant date. The number of options is equal to a total of 6,520,000. The options terminate seven years from the date of grant and become vested and exercisable after one year from the grant date. The following assumptions were used in the Monte Carlo analysis by Doty Scott Enterprises, Inc., an independent valuation firm, to determine the fair value of the stock options:\nSCHEDULE OF FAIR VALUE OF STOCK OPTION ASSUMPTIONS\nRisk-free interest rate 1.18 %\nExpected life years\nExpected volatility 239.3 %\nVesting is based on a one-year cliff from grant date.\nAnnual attrition rates were used in the valuation since ongoing employment was condition for vesting the options.\nThe fair value of the Companys Stock Options as of issuance valuation date is as follows:\nSCHEDULE OF FAIR VALUE OF STOCK OPTION ISSUANCE DATE\nHolder Issue Date Maturity\nDate\nStock Options Exercise Price Fair Value at\nIssuance\nTam Bui 9/23/2016 9/23/2023 875,000 Fixed price: $0.24 $ 219,464\nFrank Hawkins 9/23/2016 9/23/2023 875,000 Fixed price: $0.24 $ 219,464\nHenry Fahman 9/23/2016 9/23/2023 4,770,000 Fixed price: $0.24 $ 1,187,984\nNOTE 13 -OTHER INCOME (EXPENSE)\nNet Other Income (Expense) for the fiscal year ended June 30, 2023 consists of the following:\nSCHEDULE OF OTHER INCOME (EXPENSE)\nOTHER INCOME (EXPENSES) FY ended\nJune 30, 2023\nInterest expense (934,872 )\nOther income\nNet other income/expense (3,674,139 )\nNET OTHER INCOME (EXPENSES) (4,608,523 )\nNOTE 14 - RELATED PARTY TRANSACTIONS\nThe Company recognized a total of $360,000 in salaries for the President and Chief Executive Officer, the former Chief Operating Officer and the Secretary and Treasurer of the Company during the year ended June 30, 2023.\nAs of June 30, 2023 the members of the Board of Directors and the Secretary and Treasurer of the Company owned a total of 600,000 shares of Class B Series Preferred Stock.\nNOTE 15 - INCOME TAXES\nNo provision was made for income tax since the Company has significant net operating loss carry forward. Through June 30, 2023, the Company incurred net operating losses for tax purposes of approximately $77,319,372. The net operating loss carry forward may be used to reduce taxable income through the year 2036. Net operating loss for carry forwards for the State of California is generally available to reduce taxable income through the year 2026. The availability of the Companys net operating loss carry-forward is subject to limitation if there is a 50% or more positive change in the ownership of the Companys stock.\nUnder section 6501(a) of the Internal Revenue Code (Tax Code) and section 301.6501(a)-1(a) of the Income Tax Regulations (Tax Regulations), the IRS is required to assess tax within 3 years after the tax return was filed with the IRS.\nNOTE 16 - CONTRACTS AND COMMITMENTS\n1. EQUITY LINE OF CREDIT WITH INSTITUTIONAL INVESTOR\nOn March 01, 2022, the Company entered into an equity purchase agreement with Mast Hill Fund LP (The Investor) as follows:\nThe Investor will provide an equity line of up to $10,000,000 to the Company, pursuant to which the Company has the right, but not the obligation, during the 24 months after an effective registration of the underlying shares, to issue a notice to the Investor (each a Drawdown Notice) which shall specify the amount of registered shares of common stock of the Company (the Put Shares) that the Company elects to sell to the Investor, from time to time, up to an aggregate amount equal to $10,000,000.\nThe pricing period of each put will be the 7 trading days immediately following receipt of the Put Shares (the Pricing Period).\nThe purchase price per share shall mean 90% of the average of the 2 lowest volume-weighted average prices of the Common Stock during the Pricing Period, less clearing fees, brokerage fees, other legal, and transfer agent fees incurred in the deposit (the Net Purchase Amount). The Investor shall pay the Net Purchase Amount to the Company by wire for each Drawdown Notice within 2 business days of the end of the Pricing Period.\nThe put amount in each Drawdown Notice shall not be less than $50,000 and shall not exceed the lesser of (i) $500,000 or (ii) 200% of the average dollar trading volume of the Common Stock during the 7 trading days immediately before the Put Date, subject to Beneficial Ownership cap.\nThere shall be a 7 trading day period between the receipt of the Put Shares and the next put.\nThe Company intends to file an S-1 Registration Statement with the Securities and Exchange Commission for this Equity Line of Credit as part of its alternative financing plan.\n2. TERMINATION OF BUSINESS COOPERATION AGREEMENT WITH VINAFILMS JOINT STOCK COMPANY\nOn August 06, 2018, signed a Business Cooperation Agreement with Vinafilms JSC (Công ty Cổ phần Màng Bao Bì Tân Vinh Nam Phát), a Vietnamese joint stock company, with principal business address at Lot G9, Road No. 9, Tan Do Industrial Zone, Duc Hoa Ha Village, Duc Hoa District, Long An Province, Vietnam, hereinafter referred to as VNF and its majority shareholder, to exchange fifty-one percent ownership in VNF for Preferred Stock of PHI. According to the Agreement, PHI will be responsible for filing a S-1 Registration Statement with the Securities and Exchange Commission for American Pacific Plastics, Inc., a subsidiary of PHI that holds the 51% equity ownership in VNF, to become a fully-reporting public company in the U.S. Stock Market.\nOn September 20, 2018, a Stock Swap Agreement was signed by and between Ms. Do Thi Nghieu, the majority shareholder holding 76% of ownership in VNF, and PHI to exchange 3,060,000 shares of ordinary stock of VNF owned by Ms. Do Thi Nghieu for 50 million shares of Class A Series III Cumulative, Convertible, Redeemable Preferred Stock of PHI. Though this transaction was technically closed on September 28, 2018, the Company did not recognize the operations of Vinafilms JSC in its consolidated financial statements as of June 30, 2023.\nOn October 20, 2022, the Company, VNF and Ms. Do Thi Nghieu signed an agreement to terminate said Business Cooperation Agreement and Stock Swap Agreement. The termination of the referenced Business Cooperation Agreement, retroactively effective August 06, 2018, was due to the resultant impact of the Covid-19 pandemic and particular microeconomic conditions which made it infeasible for the Parties herein to continue the originally-planned Business Cooperation Agreement.\n3. AGREEMENT WITH TECCO GROUP FOR PARTICIPATION IN PHILUX INFRASTRUCTURE FUND COMPARTMENT OF PHILUX GLOBAL FUNDS\nOn August 10, 2020, Tecco Group, a Vietnamese company, signed an agreement with PHI Luxembourg Development SA, a subsidiary of the Company, to participate in the proposed infrastructure fund compartment of PHILUX Global Funds SCA, SICAV-RAIF. According to the agreement, Tecco Group will contribute $2,000,000 for 49% ownership of the general partners portion of said infrastructure fund compartment. As of June 30, 2023, Tecco Group has paid a total of $156,366.25 towards the total agreed amount.\n4. INVESTMENT AGREEMENTS AND MEMORANDUM OF UNDERSTANDING\nAs of June 30, 2023, the Company and its subsidiaries have entered into loan financing agreements, asset management agreements, joint venture agreement, and memorandum of understanding with six international investor groups for a total six billion three hundred million U.S. dollars, as reported in various 8-K filings with the Securities and Exchange Commission. The Company has been working regularly with these investor groups and expects to begin receiving capital through these sources in the near future to support its acquisition and investment programs.\n5. DEVELOPMENT OF THE ASIA DIAMOND EXCHANGE IN VIETNAM\nAlong with the establishment of Philux Global Funds, the Company has worked with the Authority of Chu Lai Open Economic Zone in Central Vietnam and the Provinces of Quang Nam and Dong Nai, Vietnam, to develop the Asia Diamond Exchange for lab-grown, rough and polished diamond together with a multi-commodities logistics center.\nMr. Ben Smet, who successfully established the Dubai Diamond Exchange in 2002-2005, has been leading fulltime a group of experts for the setup of the Asian Diamond Exchange since January 2018. He has brought together the 11 main trading players in the rough diamond industry to come to Vietnam. He has established a partnership with the biggest player in the rough trading and polishing group, the Mehta Family Group. Other main international diamond trading groups as the Mody Group, Diamac etc. have joined the overall venture.\nFurthermore, together with the groups, a full Kimberly Process Certification Scheme (KPC) to prevent ‘conflicting diamond trading was established and is aligned from time to time. Also, the new lab grown diamond KPC scheduling is already implemented. A unique and KPC approved structure has been established where under the PHI Vietnam umbrella, in collaboration with KPC Mum- bai (India), a ‘Public-Private-Partnership (PPP) is established in which the Vietnamese authorities hold 15% and PHI (or its local corporate entity) holds 85% of the voting rights. For the lab grown diamond segment, this will be in the Chu Lai Free Economic Zone and for the Rough and Polished Diamond Parcel Trade, this is being planned to be on Thanh Da Island, about 5 kilometers from the center of Ho Chi Minh City, Vietnam.\nThe Company has taken the decision to move the greater part of the ADE rough and polishing venture, first to an Industrial Zone to be established close to the new international Airport in Long Thanh District, Dong Nai Province, Vietnam and this year to the Thanh Da Island. This location change has caused that the entire KPC Process and administration had to be adapted and redone with renewed financial input, mostly carried by Mr. Smet.\nA rough diamond trading export flow to Vietnam was negotiated and concluded by Mr. Smet with the DMCC and Dubai Diamond Exchange. This year, an international diamond trading platform was created by Mr. Smet to unify the trading efforts of Alrosa and De Beers/Bonas. Mr. Smet was advised and counselled thereto by Mr. A. Mehta, the senior board member of the Alrosa Group. Together with Mr. A. Mehta, Mr. Smet has also covered the financial backbone of the diamond trading venture via the setup of a financial institution in Botswana. It is the intention of Mr. Smet to donate 50% of his own voting shares of the institution to PHI the moment all budgets for the venture are arranged by PHI and all financial obligations and reimbursements by PHI to him are met. It is the intention of the parties involved to establish a subsidiary of the financial institution in the ADE Vietnam and have local banking partners join this initiative.\nMr. Smet had also established a collaboration partnership with the Antwerp Diamond Exchange (Belgium), the Dubai Diamond Exchange and the Tel-Aviv Diamond Exchange. Negotiations have started to involve a new economic free-zone in Jordan into the ongoing project.\nRecently, Mr. Smet has started a structuring project, in order for PHI to set up and establish an International Financial Center on the Thanh Da Island in connection with the Asian Diamond Exchange. This will be similar as what Mr. Smet has established successfully for Dubai in 2002-2005 and this now incorporating the international changes of the last decade.\nOnce the Company has effectuated all budgeting and all financial requirements and obligations, the ongoing process will effectively materialize and Mr. Smet then shall transfer the entire venture to Philux Global Group, Inc.\nOn June 04, 2022 the Company incorporated Asia Diamond Exchange, Inc., a Wyoming corporation, ID number 2022-001010234, as the holding company for this venture.\n6. AGREEMENT WITH FIVE-GRAIN TREASURE SPIRITS CO., LTD.\nOn January 18, 2022 PHI Group entered into an Agreement of Purchase and Sale with Five Grain Treasure Spirits Co., Ltd. (FGTS) and the majority shareholders of FGTS (the Majority Shareholders) to acquire seventy percent (70%) of ownership in FGTS for the total purchase price of one hundred million U.S. dollars, to be paid in three tranches. The Company has renegotiated with Five-Grain to revise the Agreement of Purchase and Sale and to cooperate in producing American-made baijiu products through its subsidiary Empire Spirits, Inc. in the US. The details of the renegotiated transactions will be officially announced upon signing by the two parties.\n7. AGREEMENT OF PURCHASE AND SALE WITH KOTA CONSTRUCTION LLC AND KOTA ENERGY GROUP LLC\nEffective January 26, 2022, PHI Group, Inc. signed Agreements of Purchase and Sale with KOTA Construction LLC and KOTA Energy Group LLC, both of which are California limited liability companies (collectively referred to as KOTA), to acquire 50.10% of Kota Energy Group LLC for $12,524,469 and 50.10% of Kota Construction LLC for $51,600,531, totaling $64,125,000, to be paid in cash.\nIn the second and latest amendment signed on August 3, 2022 to the Agreements of Purchase and Sale with KOTA, the concerned parties agreed that PHI Group, Inc. would pay Fifteen Million Six Hundred Fifty-Five Thousand Two Hundred Forty-Eight U.S. Dollars ($15,655,248) to Kota Energy Group LLC (KEG), in exchange for fifty point one percent (50.10%) of the equity ownership in KEG, and Sixty-Four Million Five Hundred Four Thousand Seven Hundred Fifty-Two U.S. Dollars ($64,504,752) to KCCO, in exchange for fifty point one percent (50.10%) of the equity ownership in KCCO.\nWhereas the scheduled closing date for the KOTA transaction already expired, the Company intends to renegotiate an revised agreement for acquisition after the Company has successfully closed one or more of the pending financing and asset management agreements with certain lenders and investor groups.\n8. JOINT VENTURE AGREEMENT WITH DANANG RUBBER JSC AND TIN THANH GROUP\nIn June 2022, the Company signed an joint venture agreement with Danang Rubber Joint Stock Company (DRC) and Tin Thanh Group JSC to cooperate in increasing DRCs tire production and implementing a sales and marketing program. As of the date of this report, the joint venture has not implemented this program.\n9. JOINT VENTURE/PARTNERSHIP AGREEMENT (FUND MANAGEMENT MOU) BETWEEN AN INVESTOR IN THE GULF COOPERATION COUNCIL REGION AND PHILUX GLOBAL GROUP, INC. (A/K/A PHI GROUP, INC.)\nOn July 08, 2022, the registrant signed a Joint Venture/Partnership Agreement (Fund Management MOU) with an investor in the Gulf Cooperation Council region to manage an initial amount of Three Billion United States Dollars (USD 3,000,000,000) for investment in different transactions chosen and advised by the registrant for a period of ten years. According to the Agreement, after the first twenty four months of investment implementation, the registrant will be allocated 40% of the net profit from these investments. As of the date of this report the Company is working with this investor group in order to close this transaction as soon as practical.\n10. AGREEMENT WITH TIN THANH GROUP\nEffective August 13, 2022, the Company signed a Stock Transfer Agreement with Tin Thanh Group Joint Stock Company, a joint stock company organized and existing by virtue of the laws of Socialist Republic of Vietnam, with principal business address at 71 Pho Quang Street, Ward 2, Tan Binh District, Ho Chi Minh City, Vietnam, hereinafter referred to as TTG and Mr. Tran Dinh Quyen, the holder of at least fifty-one percent (51.00%) of equity ownership in TTG (the Majority Shareholder), hereinafter referred to as Seller, to acquire Twenty-Two Million Thirty-Two Thousand (22,032,000) Shares of Ordinary Stock of TTG, which is equivalent to Fifty-One Percent (51.00%) of all the issued and outstanding Ordinary Stock of TTG for a total purchase price of Sixty Million U.S. Dollars ($US 60,000,000) in cash.\nThe closing date of this transaction would be the date on which the closing actually occurs, which was last extended to March 15, 2023 based on the fifth amendment to the Stock Transfer Agreement signed by both parties on February 14, 2023. On March 20, 2023 Tin Thanh Group sent a notice to terminate this Stock Transfer Agreement. However, both companies have continued discussing and agreed to renegotiate an revised agreement whereby the Company will co-invest in Tin Thanhs Smart-tire program in South Carolina, USA and cooperate in other the business activities in Vietnam and abroad when the Company successfully closes one or more of the pending financing and assets management agreements with certain lenders and investor groups.\n11. AGREEMENTS WITH VAN PHAT DAT JOINT STOCK COMPANY\nEffective August 16, 2022, PHI Group, Inc. (a/k/a PHILUX GLOBAL GROUP INC.) (the Registrant) signed an Agreement of Purchase and Sale with Van Phat Dat Export Joint Stock Company, a joint stock company organized and existing by virtue of the laws of Socialist Republic of Vietnam, with principal business address at 316 Le Van Sy Street, Ward 1, Tan Binh District, Ho Chi Minh City, Vietnam, hereinafter referred to as VPD, and the holder of at least fifty-one percent (51.00%) of equity ownership in VPD, hereinafter referred to as Seller, to acquire Five Million One Hundred Thousand (5,100,000) Shares of Ordinary Stock of VPD, which is equivalent to Fifty-One percent (51.00%) of all the issued and outstanding Ordinary Stock of VPD for a total purchase price of Six Million One Hundred Twenty-Seven Thousand Eight Hundred Ninety-Five U.S. Dollars ($US 6,127,895) in form of a convertible promissory note to be issued by Philux Global Trade Inc., a Wyoming corporation and wholly-owned subsidiary of the Registrant. The closing date of this transaction shall be the date on which the closing actually occurs, which is expected to happen as soon as possible within sixty days following the signing of the Agreement of Purchase and Sale, unless extended in writing by the Parties to said Agreement.\nOn September 30, 2022 PHI Group, Inc. entered into a Closing Memorandum for the Agreement of Purchase and Sale dated August 16, 2022 with and among Van Phat Dat Export Joint Stock Company and Mr. Huynh Ngoc Vu, an individual and the majority shareholder of VPD.\nOn June 27, 2023, the Company and Van Phat Dat Export Joint Stock Company signed an Agreement to terminate the referenced Agreement of Purchase and Sale in its entirety, retroactively effective August 16, 2022.\n12. STRATEGIC BUSINESS COOPERATION WITH TIN THANH GROUP AND PETROVIETNAM MARINE SHIPYARD JSC\nOn September 03, 2022, the Company signed a strategic business cooperation with Tin Thanh Group and PetroVietnam Marine Shipyard JSC whereby PetroVietnam Marine Shipyard (PVMS) will increase charter capital to allow Tin Thanh Group and Philux Global Group to become its strategic and majority shareholders. As of the date of this report this plan has not been implemented.\n13. ISSUANCES OF SHORT-TERM CONVERTIBLE NOTES\nOn March 3, 2023, the Company issued a Convertible Promissory Note to 1800 Diagonal Lending LLC, a Virginia limited liability company, for $55,000.00, with interest rate of eight percent (8%) per annum. Any Principal Amount or interest on this Note which is not paid when due shall bear interest at the rate of twenty two percent (22%) from the due date thereof until the same is paid (Default Interest). The per share conversion price into which Principal Amount and interest (including any Default Interest) under this Note shall be convertible into shares of Common Stock hereunder (the Conversion Price) shall equal $0.001 during the one hundred eighty days following the issuance date, or 61% multiplied by the market price any time after the first one hundred eighty days. Market price is defined as the average of the two lowest trading prices for the Companys Common Stock during the ten trading day period ending on the latest trading day prior to the conversion date.\nThis Note was converted into 187,540,984 shares of Common Stock of the Company on September 6, 2023.\nOn March 14, 2023, the Company issued a Convertible Promissory Note to Mast Hill Fund, L.P., a De a Delaware limited partnership, for $185,000.00, with interest rate of twelve percent (12%) per annum. Any Principal Amount or interest on this Note which is not paid when due shall bear interest at the rate of the lesser of (i) sixteen percent (16%) per annum and (ii) the maximum amount permitted by law from the due date thereof until the same is paid (Default Interest). The per share conversion price into which Principal Amount and interest (including any Default Interest) under this Note shall be convertible into shares of Common Stock hereunder (the Conversion Price) shall equal $0.001, subject to adjustment as provided in this Note.\nOn June 1, 2023, the Company issued a Convertible Promissory Note to 1800 Diagonal Lending LLC, a Virginia limited liability company, for $52,805.00, with a one-time interest charge of seventeen percent (17%) to be applied on the issuance date to the principal amount. Any Principal Amount or interest on this Note which is not paid when due shall bear interest at the rate of twenty two percent (22%) from the due date thereof until the same is paid (Default Interest). Accrued, unpaid Interest and outstanding principal, subject to adjustment, shall be paid in eight (8) payments with the first six (6) payments each in the amount of $9,256.17; and the final two (2) payments each in the amount of $2,000.00 (a total payback to the Holder of $59,537.00). At any time following an Event of Default, the Holder shall have the right, to convert all or any part of the outstanding and unpaid amount of this Note into fully paid and non-assessable shares of Common Stock at the conversion price equal to 58% multiplied by the lowest trading price for the Common Stock during the twenty (20) Trading Days prior to the conversion date As of October 13, 2023, the Company has made four payments of $9,256.17 each to the Holder.\n14. AGREEMENT FOR COMPREHENSIVE COOPERATION WITH DR. TRI VIET DO\nOn February 10, 2023, the Company signed an agreement for comprehensive cooperation with Dr. Tri Viet Do, a German-trained expert in electromagnetic energy and quantum physics, to jointly cooperate in the development and commercialization of a number of key products using proprietary intellectual properties already developed by him. The scope of study and development includes: 1) Producing generators using electromagnetic and quantum fields extracted from the energy absorbed from the earth; 2) Producing engines (spaceships, airplanes, ships, cars, trains, motorcycles, etc.) powered by electromagnetic and quantum energy; 3) Machines to kill harmful bacteria and viruses, including covid-19 and variants; 4) Medicines to treat 25 types of infectious diseases and cancers using atomic nuclear energy, super-matter and antimatter; 5) Desalination of seawater, separating minerals, medicines and rare metals from sea water; 6) Environmental technology for treating and sterilizing wastewater to become clean water; 7) Waste treatment by automatic classification of wastes into various categories; 8) Clean agriculture with electromagnetic and quantum fields for use in farming; and 9) Aquatic poultry farming by treating the rearing environment with electromagnetic and quantum fields and providing food energy for poultry and aquatic products.\n15. TERMINATION OF AGREEMENT FOR PARTICIPATION IN INFRASTRUCTURE FUND WITH THANH NAM LONG CONSTRUCTION COMPANY\nOn February 09, 2023, the Company sent a notice to Thanh Nam Long Construction Co., Ltd. (TNLC), a Vietnam limited company, with its main address at Lot C10-18, street No. 5, Tay Bac urban area, Vinh Quang Ward, Rach Gia City, Kien Giang Province, Vietnam, to terminate the Agreement for Participation in PHILUX Infrastructure Fund dated February 02, 2023 due to TNLCs failure to fulfill its obligations as agreed in Article 2 of said Agreement.\n16. Investment Commitment AgreementS WITH Saigon Silicon City JSC\nOn February 21, 2023, Philux Global Group Inc. (a/k/a PHI Group, Inc.) and its subsidiaries Philux Global Funds SCA, SICAV-RAIF and Philux Global Vietnam Investment and Development Company, Ltd., (collectively referred to as the Investor) signed an Investment Commitment Agreement with Saigon Silicon City Joint Stock Company (the Company) whereby the Investor is committed to providing or causing to be provided a total of five hundred million U.S. dollars (USD 500,000,000) for investment in Saigon Silicon City for the first phase of construction and subsequent additional capital as needed to complete the Companys entire development and investment program over a 52-hectare of land at Lot I6 & I7, Road D1, Saigon High Technology Park, Long Thanh My Ward, District 9, Ho Chi Minh City, Vietnam.\nAccording to the Investment Commitment Agreement, within thirty days of the signing of this Agreement, the Investor will provide or cause to be provided fifty million U.S. dollars (USD 50,000,000) for the Company to resume the implementation of its building plan. Additional tranches of fifty million U.S. dollars (USD 50,000,000) will be released to the Company at regular intervals as needed to ensure uninterrupted construction progress. Both Parties shall determine and stipulate the terms and conditions for the Investment Commitment in writing prior to the release of funds to the Company. Upon the signing of this Agreement, the Company shall make a deposit of Five Hundred Thousand U.S. Dollars (USD 500,000) with the Investor as earnest money for legal, administrative and processing fees in connection with the Investment Commitment Agreement. This amount will be fully refundable to the Company if the Investor fails to fulfill its commitment as mentioned in the Agreement. The Investor intends to use a portion of the USD 4,500,000,000 financing commitments from certain international institutional and ultra-high net worth investors which are expected to be released during the first quarter of 2023 for investment in Saigon Silicon City and select projects in Vietnam and elsewhere.\nEffective March 21, 2023, the Company and Saigon Silicon City JSC signed an amendment to amend Article 2 of the afore-mentioned Investment Commitment Agreement as follows: Time frame. Due to additional administrative and legal requirements in connection with the Investors release of funds, within thirty days of the signing of this Amendment, the Investor will provide or cause to be provided fifty million U.S. dollars (USD 50,000,000) for the Company to resume the implementation of its building plan. Additional amounts of capital will be provided to the Company by the Investor at various intervals as needed to ensure uninterrupted construction until the completion of the project.\nOn April 21, 2023, both parties signed an amendment to extend the delivery of the first investment tranche to Saigon Silicon City JSC within forty-five days commencing April 21, 2023.\nOn June 05, 2023, Philux Global Vietnam Investment and Development Co. Ltd., a subsidiary of Philux Global Group Inc. (f/k/a PHI Group, Inc.), and Saigon Silicon City JSC signed an Agreement to terminate the Investment Commitment Agreement previously entered into by the two parties on February 21, 2023 in its entirety.\nOn June 05, 2023 Philux Global Group Inc. (a/k/a PHI Group, Inc.) (the Investor/Provider) signed an Investment Commitment Agreement with Saigon Silicon City Joint Stock Company (the Company) whereby the Investor/Provider is committed to providing or causing to be provided up to one and half billion U.S. dollars (USD 1,500,000,000) as may be needed to complete the Companys entire development and investment program over a 52-hectare of land at Lot I6 & I7, Road D1, Saigon High Technology Park, Long Thanh My Ward, District 9, Ho Chi Minh City, Vietnam.\nAccording to the Investment Commitment Agreement, upon the signing of this Agreement, the Company shall make a deposit of Five Hundred Thousand U.S. Dollars (USD 500,000) with the Investor/Provider as earnest money for legal, administrative and processing fees in connection with the Investment Commitment Agreement. This amount will be fully refundable to the Company if the Investor/Provider fails to fulfill its commitment as mentioned in the Agreement\nWithin thirty days after the deposit of at least two hundred thousand U.S. dollars (USD 200,000) of the refundable earnest money as mentioned above, the Investor/Provider will provide or cause to be provided fifty million U.S. dollars (USD 50,000,000) for the Company to resume the implementation of its building plan. Additional tranches of funds will be released to the Company at regular intervals as needed to ensure uninterrupted construction progress. Both Parties shall determine and stipulate the terms and conditions for the Investment Commitment in writing prior to the release of funds to the Company. The Investor/Provider intends to use a portion of the USD 4,500,000,000 financing commitments from certain international institutional and ultra-high net worth investors for investment in Saigon Silicon City and select projects in Vietnam and elsewhere.\nThe foregoing description of the Investment Commitment Agreement by and between Philux Global Group Inc. and Saigon Silicon City JSC dated June 5, 2023 is qualified in its entirety by reference to the full text of said Agreement, which is filed as Exhibit 10.1 to the Current Report on Form 8-K on June 13, 2023.\n17. Termination of Agreement for Participation in Philux Global Real Estate Fund with AZ Holdings Joint Stock Company\nOn March 24, 2023, the Company sent a notice to AZ Holdings Investment Joint Stock Company, a Vietnamese joint stock company (AZHC), with principal address at No. 36, Sub-alley 3, Alley 83, Nguyen Khang Street, Yen Hoa Ward, Cau Giay District, Hanoi, Vietnam, to terminate the Agreement for Participation in Philux Global Real Estate Fund dated July 18, 2022 due to AZHCs failure to fulfill its obligations as agreed in Article 2 of said Agreement.\n18. PURCHASE AND SALE AGREEMENT WITH JINSHAN LTD. CO.\nOn June 27, 2023, Premier Enterprises Group Inc., a Wyoming corporation and subsidiary of PHI Group, Inc. (/n/k/a Philux Global Group Inc.), (the Registrant) entered into an Agreement of Purchase and Sale with Jinshan Limited Liability Company, a limited liability company organized and existing by virtue of the laws of Socialist Republic of Vietnam, with principal business address at 37 Road No. 4, Do Thanh Housing Complex, Ward 4, District 3, Ho Chi Minh City, Vietnam, hereinafter referred to as JSH, the Majority Member(s) of JSH, hereinafter referred to as the Majority Member(s), (both JSH and the Majority Member(s) are referred to as the Seller), to acquire fifty-one percent (51%) of equity ownership in JSH for a purchase price to be determined as follows:\nThe value of JSHs fifty-one percent (51%) equity ownership as at the date of signing this contract shall be (a) provisionally calculated as Five Million One Hundred Ninety Four Thousand Seven Hundred Fourteen United States Dollars (US$5,194,714), which is equivalent to fifty-one percent (51%) of twice the equity of JSH according to the audit report of JSH issued by Viet Dragon Auditing and Consulting Co., Ltd. made for the year ended December 31, 2022, based on the exchange rate of foreign currency transfer by Eximbank Vietnam as at the end of June 26, 2023, (b) or an amount equivalent to fifty-one percent (51%) of the value of JSH independently valued by a qualified professional valuation firm mutually acceptable on or before the Closing Date of this transaction, whichever is greater, (c) or a number of shares of PEG with a market value of twice the greater amount between the two cases above, based on the average ten-day closing price of PEG shares in the U.S. Stock Market immediately prior to the Closing date after PEG has become a publicly traded company in the U.S. for at least one month, according to the final agreement between the Parties prior to or on the Closing date.\nThe Closing of this transaction is subject to PEGs being listed and traded on a U.S. stock exchange at least one month prior to the Closing date.\nThe foregoing description of the Agreement of Purchase and Sale dated June 27, 2023 among Premier Enterprises Group Inc. , a subsidiary of PHI Group, Inc., Jinshan Limited Liability Company and the Majority Member(s) of JSH is qualified in its entirety by reference to the full text of said Agreement, which was filed as Exhibit 10.1 to the Form 8-K on June 28, 2023.\n19. BUSINESS COOPERATION AGREEMENT WITH SSE GLOBAL JSC\nIn May 2023, the Company signed a Business Cooperation Agreement with SSE Group JSC, a Vietnamese joint stock company, to jointly cooperate in the areas of energy efficiency and mitigation of global greenhouse gas (GHG) emissions by using SSE Groups proprietary technologies.\nAccording to the agreement, SSE Group JSC and Philux Global Group Inc. have incorporated SSE Global Group Inc., a Wyoming corporation, Registration ID 2023-00127, (www.sseglobalgroup.com) to apply SSE Groups breakthrough technologies for the energy industry, especially to improve fuel efficiency and mitigate global GHG emissions.\nGlobal GHG emissions have been steadily increasing over the years, primarily due to human activities such as burning fossil fuels, deforestation, industrial processes, and agriculture. Carbon dioxide (CO2) is the most significant GHG, accounting for the majority of emissions. The main sectors contributing to GHG emissions are energy production, transportation, industry, agriculture, and land use change. Emerging economies, such as China and India, have witnessed significant increases in emissions due to rapid industrialization and urbanization. Rising GHG emissions lead to the greenhouse effect, causing global warming and climate change. This phenomenon contributes to various environmental and socio-economic challenges, including extreme weather events, sea-level rise, disrupted ecosystems, and threats to human health and food security.\nSSE Groups proprietary technologies are a self-sustaining energy system created by absolute interactions with the air condition of the atmosphere. Test results have shown that this system can enhance and extend the burning time of traditional fuels such as gasoline, diesel and coal by 50% or more and eliminate toxic emissions surpassing Euro6 standards of harmful exhaust. It also cleans the carbon in the internal combustion engine and stabilizes the burning temperature of the engine chamber for optimal performance. For use in vehicles, the installation is fast and inexpensive and does not require any additional power supply or batteries. SSE Global Group intends to launch products for internal combustion engines and fossil fuel power plants to save input fuels and eliminate toxic emissions.\n20. AGREEMENT FOR PARTICIPATION IN PHILUX GLOBAL INDUSTRIAL ZONE REAL ESTATE FUND\nOn May 22, 2023, Hoang Duc Thien Group JSC, a Vietnamese joint stock company, signed an agreement with the Company to join Philux Global Industrial Zone Real Estate Fund, a Luxembourg-based fund to be organized for the development and implementation of industrial zone real estate projects in Vietnam. According to the agreement, Hoang Duc Thien Co. will pay $2 million to participate in the Industrial Zone sub-fund under the framework of Philux Global Funds SCA, SICAV-RAIF as a general partner. As of the date of this report, the Company has given Hoang Duc Thien Co. a final extension to fulfill its contractual obligation under this agreement.\n21. BUSINESS COOPERATION AGREEMENT WITH SAPHIA ALKALI JOINT STOCK COMPANY\nOn June 27, 2023, SAPHIA ALKALI JOINT STOCK COMPANY, a Vietnamese joint stock company with principal business address at No 27, Sub-alley 1, Alley 104, Viet Hung Street, Viet Hung Ward, Long Bien District, Hanoi City, Vietnam, represented by Mrs. Nguyen Phuong Dung, its Chairperson, hereinafter referred to as SAP, and PHI GROUP INC. (/n/k/a PHILUX GLOBAL GROUP INC, hereinafter referred to as PGG, signed a Business Cooperation Agreement and agreed to undertake the followings:\n- SAP and PGG agree to jointly cooperate primarily in the areas of alkali technologies as well as any other business that may be considered mutually beneficial.\n- Specifically, SAP and PGG will initially focus on forming a company in the United States (NewCo) to finance, manufacture, sell and distribute SAPs proprietary alkali products on a worldwide basis, except Vietnam and certain territories that are handled directly by SAP.\n- SAP will initially make available and transfer certain technologies as may be needed to NewCo to serve the needs of this Business Cooperation Agreement.\n- The relationship established between SAP and PGG by this Agreement shall be exclusive with respect to the areas of SAPs proprietary technologies outside of Vietnam.\n- The Parties shall agree on the roles, responsibilities and benefits of each party in connection with NewCo or other particular business undertakings, which shall be detailed in a separate definitive agreement.\n- In particular, PGG will be responsible for providing or causing to be provided three hundred million U.S. dollars (USD 300,000,000), or more, from time to time to NewCo as may be needed to implement the latters business plan in connection with this Business Cooperation Agreement. Hereby, a group of shareholders appointed by PGG will own 40% of NewCos equity interest and a group of shareholders appointed by SAP will own 60% of NewCos equity interest.\n- The parties herein shall determine the capital structure of NewCo in a separate subsequent addendum to this Business Cooperation Agreement.\n- The Business Cooperation Agreement shall be effective upon signing and shall terminate in writing by the Parties.\nThe foregoing description of the Business Cooperation Agreement dated June 27, 2023 between Saphia Alkali Joint Stock Company and Philux Global Group Inc. is qualified in its entirety by reference to the full text of said Agreement, which was filed as Exhibit 10.1 to the Current Report on Form 8-K July 3, 2023.\n22. EXTENSION FOR REPURCHASE OF THE COMPANYS COMMON STOCK\nOn June 29, 2023, the Companys Board of Directors passed a corporate resolution to extend the time period for the repurchase of its own shares of common stock from the open market from time to time in accordance with the terms mentioned below and subject to liquidity conditions, satisfaction of certain open contractual obligations and the judgment of the Companys Board of Directors and Management with respect to optimal use of potentially available funds in the future:\n1. Purpose of Repurchase: To enhance future shareholder returns.\n2. Details of Planned Repurchase:\na. Class of shares to be repurchased: Common Stock of PHI Group, Inc. (n/k/a Philux Global Group Inc.)\nb. Amount of repurchasable shares: As many as economically conducive and optimal for the Company.\nc. Total repurchase dollar amount: To be determined by prevalent market prices at the times of transaction.\nd. Methods of repurchase: Open market purchase and/or negotiated transactions.\ne. Repurchase period: As soon as practical until December 31, 2023.\nf. The Company intends to fund the proposed share repurchase program with proceeds from long-term financing programs, future earnings, disposition of non-core assets and other potential sources, subject to liquidity, availability of funds, comparative judgment of optimal use of available cash in the future, and satisfaction of certain open contractual obligations.\ng. The share repurchase program will be in full compliance with state and federal laws and certain covenants with the Companys creditors and may be terminated at any time based on future circumstances and judgment of the Company.\n23. COMMON STOCK TO BE ISSUED\nAs of June 30, 2023, the Company recorded $22,500 as Common Stock to be issued for cash amounts that the Company has received from certain current shareholders of the Company in connection with stock purchase agreements under Rule 144.\nNOTE 17 - GOING CONCERN UNCERTAINTY\nAs shown in the accompanying consolidated financial statements, the Company has accumulated deficit of $77,319,372 and total stockholders deficit of $8,222,002 as of June 30, 2023. These factors as well as the uncertain conditions that the Company faces in its day-to-day operations with respect to cash flows create an uncertainty as to the Companys ability to continue as a going concern. The financial statements do not include any adjustments that might be necessary should the Company be unable to continue as a going concern. Management has taken action to strengthen the Companys working capital position and generate sufficient cash to meet its operating needs through June 30, 2023 and beyond.\nNOTE 18 - SUBSEQUENT EVENTS\nThese financial statements were approved by management and available for issuance on October 13, 2023. Subsequent events have been evaluated through this date.\n1. APPOINTMENT OF NEW MEMBER OF THE BOARD OF DIRECTORS\nEffective July 01, 2023, the Companys Board of Directors appointed Mr. Steve Truong as a new member of the Board of Directors.\nBiographical information about Mr. Steve Truong:\nBorn in 1960, Mr. Truong brings to the Company a wealth of comprehensive knowledge in the areas of operation, finance, general management, strategic research and analysis, policy development and investigation. He holds a Bachelor of Economics from the University of Waterloo, a Bachelor of Business Administration from Simon Fraser University, a Master of Business Administration from Taft University, and is currently pursuing a Doctor of Business Administration from California Southern University.\nMr. Truong has work experience in both private and public sectors. He has held various senior positions during his career. Previously, as a Naval Officer with the Royal Canadian Navy, he coordinated, liaised, and provided logistical support to operational and administrative military units at a national and international level, including the Canadian Armed Forces United Nations (UN) taskings.\nMr. Truong has been actively involved in negotiating and arranging debt financing and equity investment, between international lenders and investment institutions and for clients seeking funding for projects. He has also been assisting in mergers and acquisition activities, as well as assisting private companies to get listed in the US Stock Markets. He holds a Series 65 license - Uniform Investment Advisers from the North American Securities Administrators Associations. He currently serves as a member of the Board of Directors and Secretary of Sports Pouch Beverage Company, Inc., a Nevada corporation, and a member of the Board of Directors, Vice President and Secretary of Chinh Picasso Global Group, Inc., a Wyoming corporation.\n2. ISSUANCES OF COMMON STOCK DURING THE QUARTER ENDED SEPTEMBER 30, 2023\nDuring the quarter ended September 30, 2023, the Company issued 359,102,844 shares of Common Stock under Rule 144 to two corporate lenders for conversion of promissory notes and 2,931,619,052 shares of Common Stock to Mast Hill Fund LP for exercises of warrants in connection with convertible promissory notes and equity line of credit dated March 1, 2022.\n3. PRIVATE STOCK PURCHASE AGREEMENTS UNDER RULE 144\nFrom July 1, 2023 to the date of this report, certain current shareholders of the Company have entered into private stock purchase agreements with the Company under Rule 144 to purchase a total of approximately 2.5 billion shares of Common Stock of the Company at fifty percent discount to the latest 10-day closing average immediately prior to each pertinent transaction for investment purposes. The Company used the proceeds from these transactions primarily for processing and documentation fees in connection with the financing programs, development of the Asia Diamond Exchange, partial repayments of loans and notes and general corporate purposes. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nAs required by Rule 13a-15(b) under the Securities Exchange Act of 1934, as amended (the Exchange Act), our management carried out an evaluation, with the participation of our Chief Executive Officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) of the Exchange Act), as of the period covered by this report. Disclosure controls and procedures are defined as controls and other procedures that are designed to ensure that information required to be disclosed by us in reports filed with the SEC under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and (ii) accumulated and communicated to the Companys management, including its principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure. Based upon their evaluation, our management (including our Chief Executive Officer) concluded that our disclosure controls and procedures were not effective as of June 30, 2023, based on the material weaknesses defined below.\nInternal Control over Financial Reporting\nManagements Annual Report on Internal Control of Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a set of processes designed by, or under the supervision of, a companys principal executive and principal financial officers, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that:\n● pertain to the maintenance of records that in reasonable detail accurately and fairly reflect our transactions and dispositions of our assets,\n● provide reasonable assurance that our transactions are recorded as necessary to permit preparation of our financial statements in accordance with GAAP, and that receipts and expenditures are being made only in accordance with authorizations of our management and directors, and\n● provide reasonable assurance regarding prevention or timely detection of authorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. It should be noted that any system of internal control, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system will be met. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of management, including its principal executive officer and principal financial officer, the Companys management assessed the design and operating effectiveness of internal control over financial reporting as of June 30, 2023 based on the framework set forth in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe have identified material weaknesses in our internal control over financial reporting.\nIf we fail to develop and maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results in a timely manner, which may adversely affect investor confidence in our company.\nThe material weaknesses related to a lack of a full segregation of duties and to our lack of sufficient personnel in our accounting and financial reporting functions with sufficient experience and expertise with respect to the application of U.S. GAAP and related financial reporting.\nBased on this assessment, management concluded that the Companys internal control over financial reporting was not effective as of June 30, 2023.\nManagements Remediation Plan\nWe plan to take steps to enhance and improve the design of our internal control over financial reporting. During the period covered by this annual report on Form 10-K, we have not been able to remediate the material weaknesses identified above. To remediate such weaknesses, we plan to implement the following changes in the future:\n(i) appoint additional qualified personnel to address inadequate segregation of duties and ineffective risk management; and\n(ii) adopt sufficient written policies and procedures for accounting and financial reporting.\nThe remediation efforts set out in (i) are largely dependent upon our company securing additional financing to cover the costs of implementing the changes required. If we are unsuccessful in securing such funds, remediation efforts may be adversely affected in a material manner. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake.\nManagement believes that despite our material weaknesses set forth above, our consolidated financial statements for the fiscal year ended June 30, 2023 are fairly stated, in all material respects, in accordance with US GAAP.\nAttestation Report of the Registered Accounting Firm\nThis Annual Report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to Rule 308(b) of Regulation S-K, which permits the Company to provide only managements report in this Annual Report.\nChanges in Internal Control over Financial Reporting\nNo changes in the Companys internal control over financial reporting have come to managements attention during the Companys last fiscal quarter that have materially affected, or are likely to materially affect, the Companys internal control over financial reporting. ITEM 9B. OTHER MATTERS\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, PROMOTERS AND CONTROL PERSONS, COMPLIANCE WITH SECTION 16(A) OF THE EXCHANGE ACT\nThe following table sets forth certain information as of June 30, 2023, with respect to the Directors and Executive Officers of the Company.\nNAME\nAGE\nPOSITION\nHenry D. Fahman\nChairman of the Board, President, Acting CFO\nTina T. Phan\nTreasurer, Secretary\nTam T. Bui\nDirector\nFrank Hawkins\nDirector\nDirectors are elected at the annual meeting of shareholders and hold office until the following annual meeting and until their successors are elected and qualified. All Executive Officers serve at the discretion of the Board of Directors. The Companys securities are not registered under Section 12(g) of the Exchange Act. Accordingly, the Directors and Executive Officers of the Company are not required to file reports under Section 16(a) of that act.\nHenry D. Fahman has more than 30 years experience in general management, finance, investments and corporate strategy. He has been President and Chairman of the Board of PHI Group, Inc. since January 2000, and is currently Acting Financial Officer of the Company. Mr. Fahman served as President and Chairman of the Board of Providential Securities, Inc. from its inception in October 1992 to October 2000. He holds a B.S., magna cum laude, in business administration from the University of California at Berkeley, with emphasis in finance and economic analysis and policy, and is a graduate of the Advanced Management Program (AMP166) from Harvard Business School. He has also attended other Executive Education programs at Harvard Business School and Stanford University, including Mergers and Acquisitions, Creating Competitive Advantage, and Advanced General Management. Previously, he served as a Resettlement Coordinator for the United Nations High Commissioner for Refugees. Mr. Fahman also serves as Chairman/Managing Director of PHILUX Capital Advisors, Inc., a wholly owned subsidiary of the Company, Chairman of PHILUX Global Funds SCA, SICAV-RAIF, and interim Chief Executive Officer of American Laser Healthcare Corporation, a Delaware corporation. Mr. Fahman is the husband of Tina T. Phan, our Secretary and Treasurer.\nTam Bui has been a Director of the Company since April 2009 and served as a Chief Technology Officer from May 2002 to April 2009. Mr. Bui holds Bachelor and Master of Science degrees from the University of Minnesota and has attended continuing Education at the University of California, Los Angeles. He has over 25 years of experience with Northrop Grumman, Honeywell, Inc. and TRW in various capacities such Project Director, Project Manager, Department Manager, Program Manager and Implementation Manager. One of Mr. Buis major responsibilities has been the construction of dual Emergency Command Control Communication (ECCC) centers and implementation of the Los Angeles Police Department ECCC Systems. He has a broad knowledge and experience in the areas of information technology, intranet/internet technology, inventory management, material resource planning, enterprise resource planning, human resource management, investment management, real estate, and international business. Mr. Bui also serves as Vice-Chairman of PHILUX Capital Advisors, Inc., a wholly-owned subsidiary of the Company and a member of the Board of Directors of PHILUX Global Funds, a Luxembourg bank fund. Mr. Bui was appointed to serve as Chief Operating Officer for the Company effective July 01, 2021.\nEffective July 01, 2023, Mr. Bui resigned from his positions a Member of the Board of Directors and Chief Operating Officer of the Company. There were no disagreements with the Companys management regarding policies or operations which lead to Mr. Buis resignation decision.\nFrank Hawkins, Director has been a Director of the Company since April 2009 and Mr. Hawkins is a founder and CEO of Hawk Associates with 30 years of award-winning investor relations experience, Mr. Hawkins has earned the wide respect of Wall Streets investment community for straight talk and integrity. He was formerly vice president/corporate relations and planning and head of the investor relations program at Knight-Ridder, Inc. in Miami. Mr. Hawkins started his career as an agent handler in clandestine collection operations for the Defense Intelligence Agency in Germany and went on to become a foreign and war correspondent, international businessman, senior corporate executive and president of the Access Asia Group in Hong Kong. He has lived in eight countries. He has been involved in stock listings in Tokyo and Frankfurt and company presentations in London, Zurich, Geneva and Singapore. Fluent in German, he is a graduate of Cornell University and author of Ritters Gold, an adventure novel published in several languages by the New American Library. He is a member of the Association of Former Intelligence Officers and the Audubon Society and is listed in Whos Who in America and Whos Who in the World. He serves on the board of the Florida Keys Electric Cooperative.\nTina T. Phan has been Treasurer of the Company since April 2009. She served as a Director and Secretary of the Company from January 2000 to April 10, 2009 and was Vice President of Operations of Providential Securities, Inc. from 1995 to 2000. Mrs. Phan holds a B.S. in management information system from California State University, Los Angeles. Currently Mrs. Phan serves as Treasurer and Secretary of the Company and a member of the Board of Directors of PHI Luxembourg Development S.A., the mother holding company of PHILUX Global Funds. Mrs. Phan is the wife of Henry D. Fahman. ITEM 11. EXECUTIVE COMPENSATION\n(a) Any compensation received by officers, directors, and management personnel of the Company will be determined and approved from time to time by the Board of Directors of the Company as it deems appropriate and reasonable. Officers, directors, and management personnel of the Company will be reimbursed for any out-of-pocket expenses incurred on behalf of the Company.\nExcept for any non-cash payments mentioned in this report, there was no monetary compensation paid to any officers of the Company during the year ended June 30, 2023.\n(b) There are no annuity, pension or retirement benefits proposed to be paid to officers, directors, or employees of the Company in the event of retirement at normal retirement date as there is no existing plan provided for or contributed to by the Company.\n(c) All members of the Companys Board of Directors, whether officers of the Company or not, may receive an amount yet to be determined annually for their participation in meetings of the Board and will be required to attend a minimum of four meetings per fiscal year. The Company reimburses all expenses for meeting attendance or out of pocket expenses connected directly with their Board participation. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\n1. The following table sets forth information regarding the beneficial ownership of shares of the Companys common stock as of June 30, 2023 by (i) all shareholders known to the Company to be beneficial owners of more than 5% of the outstanding common stock; and (ii) all directors and executive officers of the Company, and as a group (out of 39,414,493,275 shares issued and outstanding):\nTitle of Class Name and Address of Beneficial Owner (1) Amount of\nBeneficial Ownership\nPercent of Class\nCommon Stock Henry D. Fahman (2) 15272\nFlintridge Lane Huntington\nBeach, CA 92647 405,000,000 1.12 %\nCommon Stock Natalie Bui (3)\n9132 Helm Avenue\nFountain Valley, CA 92708 1,032,502 *\nCommon Stock Tam Bui\n9132 Helm Avenue\nFountain Valley, CA 92708 956,881 *\nCommon Stock Tina T. Phan (4)\n15272 Flintridge Lane Huntington\nBeach, CA 92647 76,887,055 *\nCommon Stock Frank Hawkins\n18649 Royal Hammock Blvd.\nNaples, FL 34114\n*\nCommon Stock Shares of all directors\nand executive officers as a group (4\npersons): 483,876,638 1.43 %\n(1) Each person has sole voting power and sole dispositive power as to all of the shares shown as beneficially owned by them.\n(2)\nCertain of these shares have been pledged to secure certain obligations of the Company.\n(3)\nNatalie Bui is the spouse of Tam Bui.\n(4)\nTina Phan is the spouse of Henry D Fahman.\n*: Less than 1%.\n2. The following table sets forth information regarding the beneficial ownership of shares of the Companys Class B Series I Preferred Stock as of June 30, 2023 by (i) all Preferred Shareholders known to the Company to be beneficial owners of more than 5% of the outstanding Preferred Stock; and (ii) all directors and executive officers of the Company, and as a group (out of 600,000 shares of Class B Series I Preferred Stock).\nTitle of Class Name and Address of Beneficial Owner (1) Amount of\nBeneficial Ownership\nPercent of Class\nClass B Series I\nPreferred Stock Tam Bui\n9132 Helm Avenue\nFountain Valley, CA 92708 155,000 25.83 %\nClass B Series I\nPreferred Stock Henry D Fahman\n15272 Flintridge Lane\nHuntington Beach, CA 92647 155,000 25.83 %\nClass B Series I\nPreferred Stock Frank Hawkins\n18649 Royal Hammock Blvd.\nNaples, FL 34114 155,000 25.83 %\nClass B Series I\nPreferred Stock Tina Phan (2)\n15272 Flintridge Lane\nHuntington Beach, CA 92647 135,000 22.50 %\nPreferred Shares of all Directors and\nExecutive Officers as a group (four persons) 600,000 100 %\n(1) Each person has sole voting power and sole dispositive power as to all of the shares shown as beneficially owned by them.\n(2) Tina Phan is the spouse of Henry D Fahman. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nHenry D. Fahman, Chairman and Chief Executive Officer of the Company, has from time to time made cash advances to the Company. The advances are unsecured, interest free and payable on demand.\nCertain of the officers and directors of the Company are engaged in other businesses, either individually or through partnerships and corporations in which they have an interest, hold an office, or serve on a board of directors. As a result, certain conflicts of interest may arise between the Company and its officers and directors. The Company will attempt to resolve such conflicts of interest in favor of the Company. The officers and directors of the Company are accountable to it and its shareholders as fiduciaries, which require that such officers and directors exercise good faith and integrity in handling the Companys affairs. A shareholder may be able to institute legal action on behalf of the Company or on behalf of itself and other similarly situated shareholders to recover damages or for other relief in cases of the resolution of conflicts is in any manner prejudicial to the Company. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nAudit Fees\nThe negotiated package fees billed by M.S. Madhava Rao, an independent accountancy firm, are $26,000 for the audit of the Companys annual consolidated financial statements for the fiscal year ended June 30, 2023 and for the review of unaudited financial statements for the quarters ending 9/30/2023, 12/31/2023 and 3/31/2024.\nAll Other Fees\nThe Company did not pay M.S. Madhava Rao any fees that are not related to audit and/or review of its financial statements for fiscal year 2023 or 2022.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENTS SCHEDULES\nFinancial Statements\nThe following consolidated financial statements of PHI Group, Inc. and its subsidiaries are included:\nReport of Independent Registered Public Accounting Firm M.S. Madhava Rao\nConsolidated Balance Sheets - June 30, 2023 and 2022\nConsolidated Statements of Operations - For the fiscal years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows - For the fiscal years ended June 30, 2023 and 2022\nConsolidated Statements of Changes in Owners Equity - For the fiscal years ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nEXHIBIT INDEX\nExhibit No.\nExhibit Description\n2.1\nPlan of Exchange between the Company and Prima Eastwest Model Management, Inc. (incorporated by reference to Exhibit 2 to the Form 8-K filed on March 1, 1996)\n2.2\nCorporate Combination Agreement between the Company and Providential Securities, Inc., effective on January 14, 2000 (incorporated by reference to Exhibit 10.12 to the Form 10-KSB filed on January 10, 2000).\n3.1\nArticles of Incorporation (1)\n3.2\nAmendment to Articles of Incorporation (incorporated by reference to Exhibit 3.1 of the Form 10-KSB for the fiscal year ended June 30, 1995).\n3.3\nAmendment to Articles of Incorporation (6)\n3.4\nCertificate of Amendment to Articles of Incorporation (6)\n3.5\nBylaws, as amended (6)\n4.1\nForm of Series 1 Bridge Notes Purchase and Security Agreement between the Company and investors, dated March 27, 2000 (6)\n4.2\nForm of Series 1 Bridge Note executed by the Company issued by the Company to Investors. (6)\n4.3\nForm of Common Stock Purchase Warrant issued by the Company to investors. (6)\n4.4\nForm of Re-pricing Warrant issued by the Company to investors. (6)\n4.5\nForm of Registration Rights Agreement between the Company and investors, dated March 27, 2000 (6)\n4.6\nForm of Common Stock Purchase Warrant to be issued by the Company to Sovereign Capital Advisors, LLC (6)\n4.7\nForm of Convertible Promissory Note issued by the Company to preferred shareholders of Providential Securities, Inc. (6)\n5.1\nOpinion Re Validity of Agreements (6) 10.1 Benatone Exchange Agreement, with Creditors (2)\n10.2\nBenatone Share Acquisition Agreement (for Weldnow Enterprise, Ltd.) (2)\n10.3\nBenatone Share Acquisition Agreement (Dynedeem Limited) (2)\n10.4\nBenatone Exchange Agreement (2)\n10.5\nBenatone Asset Sale Agreement (2)\n10.6\nBenatone Royalty Agreement (2)\n10.7\nBenatone Consultancy Agreement (2)\n10.8\nBenatone Deed (2)\n10.9\nAutokraft Stock Purchase Agreement (3)\n10.10\nAutokraft Stock Subscription Agreement (3)\n10.11\nPrima Agreement and Plan of Merger (4)\n10.12\nEscrow Agreement between the Company and Warshaw Burstein Cohen Schelsinger & Kuh, LLP, dated March 28, 2000. (6)\n10.13\nPlacement Agency Agreement between the Company and Sovereign Capital Advisors, LLC, dated March 28, 2000. (6)\n10.14\nGuaranty Agreement between Henry Fahman and SovCap Equity Partners, Ltd, dated March 28, 2000. (6)\n10.15\nPledge Agreement between Henry Fahman and SovCap Equity Partners, Ltd, dated March 28, 2000. (6)\n10.16\nPartnership Purchase Agreement between the Company and Holt Collins, dated May 31, 2000. (6)\n10.17\nMemorandum of Agreement between DataLogic Consulting, Inc. and PHI Group, Inc., dated April 25, 2001. (5)\n10.18.1\nLetter of Intent between PHI Group, Inc. and Epicenter, Inc., dated October 30, 2000. (5)\n10.18.2\nAmendment to Letter of Intent between PHI Group, Inc. and Epicenter, Inc., dated November 30, 2000. (5)\n10.18.3\nAmendment to Letter of Intent between PHI Group, Inc. and Epicenter, Inc., dated January 12, 2001. (5)\n10.18.4\nAmendment to Letter of Intent between PHI Group, Inc. and Epicenter, Inc., dated June 26, 2001. (5)\n10.18.5\nAmendment to Letter of Intent between PHI Group, Inc. and Epicenter, Inc., dated October 02, 2001. (5)\n10.19\nJoint Venture Agreement between Providential Holdings, Inc and Boxo, Inc., dated January 1, 2001. (5)\n10.20\nLicense of Manna Technologies Joint Venture Company, dated March 21, 2001. (5)\n10.21\nMemorandum of Agreement between International Consulting and Training Center, Ministry of Trade, Vietnam and the Company, dated March 24, 2001. (5)\n10.22\nMemorandum of Agreement among General Transportation Company No. 5, Chu Lai Industrial Zone and the Company, dated March 25, 2001. (5)\n10.23\nLetter of Intent between PHI Group, Inc. and Global Systems and Technologies, Corp. dated October 18, 2001. (6)\n10.24\nLetter of Intent between PHI Group, Inc. and Estate Planning and Investment Company dated November 7, 2001. (6)\n10.25\nJoint Venture Agreement between PHI Group, Inc. and Mimi Ban dated November 23, 2001. (6)\n10.26\nPlan of acquisition of Nettel Global Communication Corp. (incorporated by reference to the Companys Current Report on Form 8-K filed May 3, 2002)\n10.27\nJoint Venture Agreement with Vietnams Minh Hieu Joint Stock Company. (7)\n10.28\nMemorandum of Agreement with HDT Enterprises, LLC dated March 15, 2002. (7)\n10.29\nMemorandum of Agreement and Principal Contract with Vietnams Center of Telecom Technology. (7)\n10.30\nStock Purchase Agreement with SlimTech, Inc. (incorporated by reference to the Companys Current Report on Form 8-K, filed May 1, 2002).\n10.31\nStock Purchase Agreement with ATC Technology Corp. (incorporated by reference to the Companys Current Report on Form 8-K, Filed September 17, 2002)\n10.32\nMutual Rescission of Stock Purchase Agreement with Nettel Global Communication Corp. (8).\n10.33\nBusiness Consulting Agreement with Nettel Global Communication Corp. (8)\n10.34\nBusiness Consulting Agreement with Medical Career College (8)\n10.35\nMutual Rescission of Stock Purchase Agreement with SlimTech (8)\n10.36\nMutual Rescission of Stock Purchase Agreement with Clear Pass, Inc. (8).\n10.37\nMutual Rescission of Joint Venture Agreement with HTV CO, Ltd. (8).\n10.38\nMutual Rescission of Stock Purchase Agreement with Real ID Technology (8).\n10.39\nBusiness Consulting Agreement with Lexor Incorporated (8).\n10.40\nAmended Closing Memorandum with ATC Technology Corp. (8)\n10.41\nStock Purchase Agreement with Tangshan YutianSaw Corporation (incorporated by reference to the Companys Current Report on Form 8-K filed June 15, 2004)\n10.42\nAsset Purchase Agreement with Western Medical, Inc. (incorporated by reference to the Companys Current Report on Form 8-K, file June 2, 2006)\n10.43\nPrinciple Business Cooperation Agreement with Cavico Vietnam Joint Stock Corporation (incorporated by reference to the Companys Current Report on Form 8-K, filed October 2, 2006)\n16.1\nNotification of Change of Accountants, Kabani & Co. appointed (incorporated by reference to exhibits filed with Form 8-K/A, filed September 10, 2001)\n17.1\nResignation of Nhi T. Le as director and officer and appointment of Thorman Hwinn as Director (incorporated by reference to exhibits filed with Form 8-K, filed July 9, 2001)\n17.2\nResignation of Tam Bui as Director (incorporated by reference to the Companys Current Report on Form 8-K, filed September 30, 2004).\n17.3\nResignation of Gene M. Bennett as Chief Financial Officer (incorporated by reference to the Companys Current Report on Form 8-K, filed March 23, 2005).\n17.4\nResignation of Robert Stevenson as Director (incorporated by reference to the Companys Current Report on Form 8-K, filed July 18, 2006).\n17.5\nResignation of Ghanshyam Dass as Director (incorporated by reference to the Companys Current Report on Form 8-K, filed September 29, 2010).\n17.6\nResignation of Paul Nguyen as Director (incorporated by reference to the Companys Annual Report for the Fiscal Year ended June 30, 2012 as filed with the Securities and Exchange Commission on June 2, 2014).\n17.7\nUnregistered Sale of Equity Securities (incorporated by reference to Companys Current Report on Form 8-K, filed on December 23, 2016).\n17.8\nUnregistered Sale of Equity Securities (incorporated by reference to Companys Current Report on Form 8-K, filed on December 29, 2016).\n17.9\nInvestment Agreement with Azure Capital (incorporated by reference to Companys Current Report on Form 8-K, filed on March 7, 2017).\n17.10\nUnregistered Sale of Equity Securities (incorporated by reference to Companys Current Report on Form 8-K, filed on April 10, 2017).\n17.11\nPrivate Stock Purchase and Sale Agreement with Maxagro Farm SRL (incorporated by reference to Companys Current Report on Form 8-K, filed on June 1, 2017).\n17.12\nContract for Transfer of Shares to purchase 51% of equity ownership in Constructii SA (incorporated by reference to Companys Current Report on Form 8-K, filed on June 30, 2017).\n17.13\nUnregistered Sale of Equity Securities (incorporated by reference to Companys Current Report on Form 8-K, filed on July 27, 2017).\n17.14\nAmendment to Private Stock Purchase and Sale Agreement with Maxagro Farm SRL (incorporated by reference to Companys Current Report on Form 8-K, filed on August 9, 2017).\n17.15\nAgreement of Purchase and Sale with Rush Gold Royalty Inc, a Wyoming corporation, to acquire a 51% ownership in twenty-one mining claims over an area of approximately 400 acres in Granite Mining District, Grant County, Oregon, U.S.A. (incorporated by reference to Companys Current Report on Form 8-K, filed on September 7, 2017).\n17.16\nRegistration Statements in connection with Azure Capital Investment Agreement (incorporated by reference to Companys S-1 Registration Statement filed on April 3, 2017,\n17.17\nWithdrawal of Registration Statement filed on August 7, 2017, new S-1 Registration Statement filed on August 7, 2017 and S-1/A filed on September 15, 2017).\n17.18\nClosing Memorandum for the Agreement of Purchase and Sale with Rush Gold Royalty Inc, a Wyoming corporation, to acquire a 51% ownership in twenty-one mining claims over an area of approximately 400 acres in Granite Mining District, Grant County, Oregon, U.S.A. (incorporated by reference to Companys Current Report on Form 8-K, filed on October 9, 2017).\n(1) Incorporated by reference to the Companys Registration Statement on Form S-18, declared effective August 10, 1982 (SEC File No. 2-78335-NY), and to the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 1995.\n(2) Incorporated by reference to the Companys Current Report on Form 8-K, dated September 7, 1995\n(3) Incorporated by reference to the Companys Current Report on Form 8-K/A, dated September 12, 1995.\n(4) Incorporated by reference to the Companys Current Report on Form 8-K, dated March 1, 1996.\n(5) Incorporated reference to Form 10KSB for the year ended June 30, 2000 filed October 16, 2001.\n(6) Incorporated by reference to Form 10KSB for the year ended June 30, 2001 filed December 17, 2001.\n(7) Incorporated by reference to Form 10QSB for the quarter ended March 31, 2002 filed May 14, 2002.\n(8) Incorporated by reference to Form 10KSB for the year ended June 30, 2003, filed October 17, 2003.\nEXHIBIT INDEX (CONTINUED).\nIncorporation by reference\nFiled or\nFurnished\nExhibit No.\nExhibit Description\nForm\nFile Number\nExhibit\nFiling Date\nHerewith\n3.6\nArticles of Amendment to Articles of Domestication\n8-K\n001-38255\n10.1; Item 7.01\n2020-06-30\n3.7\nCertificate of Dissolution/Withdrawal from Nevada Secretary of State\n8-K\n001-38255\n10.2; 10.2\n2020-06-30\n3.8\nArticles of Amendment to Articles of Domestication and Designations of Preferred Stock.\n10-K\n001-38255\n3.8\n2021-03-11\n10.44\nEntry Into a Material Definitive Agreement\n8-K\n001-38255\n99.1; 99.2\n2018-07-25\n10.45\nBusiness Cooperation Agreement with Vinafilms Joint Stock Company\n8-K\n001-38255\n10.1; 10.2\n2018-08-10\n10.46\nCompletion of Acquisition or Disposition of Assets - Vinafilms Joint Stock Company\n8-K\n001-38255\n10.1\n2018-10-10\n16.2\nChanges in Registrants Certifying Accountant\n8-K\n001-38255\n16.1\n2018-07-30\n16.3\nChanges in Registrants Certifying Accountant\n8-K\n001-38255\n16.1\n2020-05-07\n16.4\nChanges in Registrants Certifying Accountant\n8-K\n001-38255\n16.1\n2020-09-30\n17.19\nDeclaration of Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2018-05-01\n17.20\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2018-05-31\n17.21\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2018-11-13\n17.22\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2019-02-28\n17.23\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2019-03-01\n17.24\nPHI Group, Inc. Approves Stock Repurchase Program\n8-K\n001-38255\n10.1\n2019-03-26\n17.25\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2019-05-31\n17.26\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1; 10.2\n2019-09-25\n17.27\nExtension of Record Date for Special Common Stock Dividend from Issuers Subsidiary\n8-K\n001-38255\n10.1\n2019-12-30\n17.28\nExtension of Repurchase Date for the Companys Common Stock\n8-K\n001-38255\n10.1\n2020-03-05\n17.29\nRelying on Order for Reporting Relief\n8-K\n001-38255\nN/A\n2020-05-15\n17.30\nExtension of Repurchase Date for the Companys Common Stock and Extension of Record Date For Special Stock Dividend Distribution\n8-K\n001-38255\n10.1; 10.2\n2020-06-30\n17.31\nExtension of Repurchase Date for the Companys Common Stock and Extension of Record Date For Special Stock Dividend Distribution\n8-K\n001-38255\n10.1; 10.2\n2020-12-29\n17.32\nAmendment to Promissory Notes dated April 01, 2019 between Luan Ngo and the Company\n10-K/A\n001-38255\n17.32\n2021-06-30\n17.33\nAmendment to Articles of Domestication\n8-K\n001-38255\n10.1\n2020-06-30\n17.34\nWithdrawal from State of Nevada\n8-K\n001-38255\n10.1; 10.2\n200-06-30\n17.35\nChange in Registrants Certifying Accountant\n8-K\n001-38255\n16.1\n2020-09-30\n17.36\nExtension of Purchase Date for Common Stock and Extension of Record Date for Special Stock Dividend Distribution.\n8-K\n001-38255\n10.1; 10.2\n2021-06-28\n17.37\nMemorandum of Understanding with Five-Grain Treasure Spirits Co., Ltd\n8-K\n001-38255\n10.1; 99.1\n2021-09-17\n17.38\nSecurities to be offered in Employee Benefit Plan\nS-8\n333-259633\n4.1 et al.\n2021-09-17\n17.39\nAsia Diamond Exchange, Inc. and the Asia Diamond Exchange\n8-K\n001-38255\n10.1 et al.\n2021-10-01\n17.40\nName change of Provimex, Inc. to Empire Spirits, Inc.\n8-K\n001-38255\n10.1 et al.\n2021-10-04\n17.41\nFinancing Agreement with Haj Finance Group\n8-K\n001-38255\n10.1\n2021-10-28\n17.42\nLoan Agreement with Neok Financial Incorporated\n8-K\n001-38255\n10.1\n2021-11-22\n17.43\nLetter of Intent with Kota Energy Group LLC and Kota Construction\n8-K\n001-38255\n10.1\n2021-12-10\n17.44\nLoan Approval and Term Sheet With Geza Holding AG\n8-K\n001-38255\n10.1,10.2\n2021-12-20\n17.45\nExtension of Repurchase Date For Registrants Stock\n8-K\n001-38255\n10.1,10.2\n2021-12-30\n17.46\nAmendment to Articles of Domestication to change authorized capital\n8-K\n001-38255\n10.1\n2022-01-06\n17.47\nIncorporation of subsidiary PHILUX GLOBAL ENERGY, INC.\n8-K\n001-38255\n10.1,10.2.\n2022-01-07\n17.48\nRegistration Withdrawal Request\nRW\n33-219769\n2022-01-14\n17.49\nPurchase and Sale Agreement with Five Grain Treasure Spirits Co. Ltd.\n8-K\n001-38255\n10.1\n2022-01-20\n17.50\nMemorandum of Understanding with Al Aqel and Partners Investment LLC and Loan Agreement with Arab League Investment Group\n8-K\n001-38255\n10.1, 10.2.\n2022-01-31\n17.51\nAgreement of Purchase and Sale with Kota Construction LLC and Kota Energy Group LLC\n8-K\n001-38255\n10.1,10.2\n2022-02-01\n17.52\nOffering Statement\n1-A\n024-11801\n2022-02-09\n17.53\nBusiness Cooperation Agreement With Siennalyn Gold Mining Corp.\n8-K\n001-38255\n10.1,99.1\n2022-02-23\n17.54\nExtension of Repurchase Date of Companys Stock\n8-K\n001-38255\n10.1\n2022-04-11\n17.55\nTermination of Loan Agreements with Geza Holdings AG and Neok Financial Incorporated\n8-K\n001-38255\n2022-05-23\n17.56\nAmendments to Articles of Incorporation And Revised Bylaws of Registrant\n8-K\n001-38255\n3.1,3.2\n2022-08-03\n17.57\nSecond Amendment to Purchase and Sale Agreement with Kota Construction LLC and Kota Energy Group LLC\n8-K\n001-38255\n10.1,10.2\n2022-08-04\n17.58\nJoint Venture/Partnership Agreement for Fund Management with Investor in the Middle East\n8-K\n001-38255\n2022-08-22\n17.59\nStock Transfer Agreement with Tin Thanh Group JSC\n8-K\n001-38255\n10.1\n2022-08-23\n17.60\nAgreement of Purchase and Sale with Van Phat Dat JSC\n8-K\n001-38255\n10.1,10.2\n2022-08-24\n17.61\nAmendment to Stock Transfer with Tin Thanh Group JSC\n8-K\n001-38255\n10.1\n2022-10-05\n17.62\nAmended Filing regarding Stock Transfer With Tin Thanh Group JSC\n8-K/A\n001-38255\n10.1\n2022-10-06\n17.63\nClosing of Purchase and Sale Agreement With Van Phat Dat JSC\n8-K\n001-38255\n10.1, 10.2\n2022-10-06\n17.64\nTermination of Business Cooperation Agreement with Vinafilms JSC\n8-K\n001-38255\n10.1\n2022-10-21\n17.65\nSecond Amendment to Stock Transfer Agreement with Tin Thanh Group\n8-K\n001-38255\n10.1\n2022-11-14\n17.66\nAmended Filing regarding Second Amendment to Stock Transfer Agreement with Tin Thanh Group JSC\n8-K/A\n001-38255\n10.1\n2022-11-15\n17.67\nFinancial Investment Management Agreement with UHNW Investor\n8-K\n001-38255\n2023-01-05\n17.68\nOrder Declaring A-1 Offering Statement Abandoned by SEC Staff\nSEC STAFF\n024-11801\n2023-01-06\n21.1\nSubsidiaries of Registrant\nX\n31.1- 32.2\nCertifications in Accordance with Sections 302 and 906 of the Sarbanes-Oxley Act of 2002.\n101.INS Inline XBRL Instance Document\n101.SCH Inline XBRL Taxonomy Extension Schema Document\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nSIGNATURES\nPursuant to the requirement of Section 12 of the Securities Exchange Act of 1934, the registrant has duly caused this registration statement to be signed on its behalf by the undersigned, thereunto duly authorized.\nPHI GROUP, INC.\n(a/k/a PHILUX GLOBAL GROUP INC)\nDated: October 13, 2023\nBy: /s/ Henry D. Fahman\nHenry D. Fahman, President\nIn accordance with the Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nSIGNATURE\nTITLE\nDATE\n/s/ Henry D. Fahman\nChairman/President/Acting Chief Financial Officer\nOctober 13, 2023\nHENRY D. FAHMAN\n/s/ Tina T. Phan\nSecretary/Treasurer\nOctober 13, 2023\nTINA T. PHAN\n/s/ Steve Truong\nDirector\nOctober 13, 2023\nSTEVE TRUONG\n/s/ Frank Hawkins\nDirector\nOctober 13, 2023\nFRANK HAWKINS"
}