{
    "cik": "720500",
    "company": "AMTECH SYSTEMS INC",
    "filing_type": "10-K",
    "filing_date": "2022-11-30",
    "period_of_report": "2022-09-30",
    "sic": "3559",
    "state_of_inc": "AZ",
    "state_location": "AZ",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/720500/0000950170-22-025872-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/720500/000095017022025872/asys-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/720500/0000950170-22-025872.txt",
    "filename": "720500_10K_2022_0000950170-22-025872.htm",
    "content": "ITEM 1. BUSINESS\nOUR COMPANY\nWe are a leading, global manufacturer of capital equipment, including thermal processing and wafer polishing, and related consumables used in fabricating semiconductor devices, such as silicon carbide (SiC) and silicon power devices, analog and discrete devices, electronic assemblies, and light-emitting diodes (LEDs). We sell these products to semiconductor device and module manufacturers worldwide, particularly in Asia, North America and Europe. Our strategic focus is on semiconductor growth opportunities in power electronics, sensors and analog devices leveraging our strength in our core competencies in thermal and substrate processing. We are a market leader in the high-end power chip market (SiC substrates, 300mm horizontal thermal reactors, and electronic assemblies used in power, RF, and other advanced applications), developing, and supplying essential equipment and consumables used in the semiconductor industry.\nWe categorize each of our subsidiaries into one of two reportable segments, based primarily on the industries they serve:\nReportable Segment\n% of 2022\nConsolidated Net\nRevenue\nSemiconductor\n%\nMaterial and Substrate\n%\nThese reportable segments are comprised of the following four wholly-owned subsidiaries:\nSemiconductor:\nBruce Technologies, a Massachusetts corporation based in North Billerica, Massachusetts, acquired in July 2004; and\nBTU, a Delaware corporation based in North Billerica, Massachusetts, with operations in China, Malaysia and the UK, acquired in January 2015.\nMaterial and Substrate:\nPR Hoffman, an Arizona corporation based in Carlisle, Pennsylvania, acquired in July 1997; and\nIntersurface Dynamics, a Connecticut corporation based in Bethel, Connecticut, acquired in March 2021.\nOur strategic focus in the semiconductor industry is the development of equipment for thermal processing and deposition for semiconductor manufacturing, specifically focusing on substrate, fabrication, packaging and surface-mount technology (SMT). The markets we serve are experiencing technological advances and are, historically, cyclical. Therefore, future profitability and growth depend on our ability to invest in, develop and/or acquire and market new technology products and on our ability to adapt to cyclical trends.\nIntegrated circuits, optoelectronic, sensor, and discrete (O-S-D) components, such as power chips, LEDs, and some MEMS, are semiconductor devices fabricated on silicon and compound semiconductor wafer substrates, such as silicon carbide. Semiconductor chips are part of the circuitry of many products including inverters, onboard charging, computers, telecommunications devices, automotive electronics and sensors, consumer electronics, and industrial automation and control systems. LEDs manufactured using our equipment are used in industrial, commercial and residential lighting. Our thermal processing and consumable products currently address the diffusion and deposition steps used in the fabrication of semiconductors, LEDs, MEMS and the polishing of newly sliced silicon and compound semiconductor wafers, as well as the packaging and assembly of the electronic components and assemblies. Our reflow ovens provide key thermal processing steps for both semiconductor packaging and electronics assembly. Key\nend-markets for these packages and assemblies include: electric vehicles and charging infrastructure, renewable energy, communications, automotive electronics and sensors, computing and networking, and consumer and industrial electronics.\nOur Material and Substrate segment provides solutions to the lapping and polishing marketplace for SiC power chip applications, LED, optics, ceramics and photonics. Lapping and polishing are the processes of abrading components with a high degree of precision for flatness, parallelism, and surface finish. Common applications for this technology are silicon wafers for semiconductor products, compound substrates, like silicon carbide wafers, for LED and power device applications, sapphire substrates for LED lighting and mobile devices, various glass and silica components for 3D image transmission, quartz and ceramic components for telecommunications devices, medical device components and optical and photonics applications.\nWe believe our product portfolio, developed through a track record of technological innovation as well as the successful integration of key acquisitions, provides exceptional value to semiconductor manufacturing by increasing yields, efficiency and throughput. We have been providing manufacturing solutions to the semiconductor industry for over 30 years and have leveraged our semiconductor technology and industry presence to capitalize on growth opportunities. Our customers use our equipment to manufacture semiconductor chips, silicon and compound semiconductor wafers and MEMS, which are used in end markets such as telecommunications (5G), consumer and industrial electronics (IoT and embedded devices), computing (data centers), automotive electronics and sensors (xEV), and mobile devices (smart devices). To complement our research and development efforts, we also sell our equipment to, and coordinate certain development efforts with, research institutes, universities and customers.\nThe semiconductor industry is cyclical and historically has experienced significant fluctuations. Our revenue is impacted by these broad industry trends.\nIn March 2020, the outbreak of COVID-19 was recognized as a pandemic by the World Health Organization, and the outbreak became increasingly widespread, including in all of the markets in which we operate. We continue to monitor the impact of COVID-19 on all aspects of our business. We are a company operating in a critical infrastructure industry, as defined by the U.S. Department of Homeland Security. Consistent with federal guidelines and with foreign government, state and local orders to date, we have continued to operate across our footprint throughout the COVID-19 pandemic. Following the onset of COVID-19 and its negative effects on our business, most prominently reflected in our second, third and fourth quarter fiscal 2020 results, global economic conditions improved during fiscal 2021, resulting in increased demand for our products and services, which led to our earnings for fiscal 2021 substantially exceeding our fiscal 2020 results. There remain many unknowns and we continue to monitor the expected trends and related demand for our products and services and have and will continue to adjust our operations accordingly.\nOn March 28, 2022, the Chinese government issued a mandatory shutdown in Shanghai, the location of one of our manufacturing facilities. The factory was allowed to partially reopen in May 2022 and was fully reopened on June 1, 2022. Upon reopening on June 1, 2022, the factory was able to operate at near full capacity for the entire month of June. We were able to make up the shipments missed in the fourth quarter and are now operating at normal capacity levels. Additionally, given the uncertainty surrounding the COVID-19 pandemic and the emergence of variations thereof, there can be no assurance that our Shanghai facility will be allowed to remain open on a consistent basis.\nFor information regarding net revenue, operating income and identifiable assets attributable to each of our two reportable segments, see Note 18 of the Notes to Consolidated Financial Statements included in Item 8. Financial Statements and Supplementary Data and Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations in this Annual Report. For information on the products of each reportable segment, see Semiconductor Products and Material and Substrate Products within this Item 1. Business section. For information regarding risks to our business, see ITEM 1A. RISK FACTORS\nThere are many factors that affect our business, financial condition, operating results and cash flows, as well as the market price for our securities. The following is a description of important factors that may cause our actual results of operations in future periods to differ materially from those currently expected or discussed in forward-looking statements set forth in this Report. The risks and uncertainties described below are not the only risks we face. We operate in a continually changing business environment. Additional risks and uncertainties not presently known to us or that we may currently deem immaterial also may impair our business operations. Forward-looking statements and such risks, uncertainties and other factors speak only as of the date of this Report, and we expressly disclaim any obligation or undertaking to update or revise any forward-looking statement contained herein, to reflect any change in our expectations with regard thereto, or any other change in events, conditions or circumstances on which any such statement is based, except to the extent otherwise required by law. The following risk factors should be read in conjunction with all of the other information in this Annual Report on Form 10-K, including Managements Discussion and Analysis of Financial Condition and Results of Operations and our consolidated financial statements and related notes.\nRisks Related to the Semiconductor Industry\nThere is ongoing volatility in the semiconductor equipment industry.\nThe semiconductor equipment industry is highly cyclical and volatile. As such, demand for, and the profitability of, our products can change significantly from period to period as a result of numerous factors, including the following:\nchanges in global and regional economic conditions;\nthe shift of semiconductor production to Asia, where there often is increased price competition;\ntariffs, quotas and international trade barriers;\nchanges in capacity utilization and production volume of manufacturers of semiconductors, silicon wafers and MEMS;\nthe profitability and capital resources of those manufacturers; and\nchallenges associated with marketing and selling manufacturing equipment and services to a diverse and diffuse customer base.\nThe purchasing decisions of our customers are highly dependent on their capacity utilization, which changes when new facilities are put into production and with the level of demand for our products, as well as our customers capital expenditure budgets. Purchasing decisions are also impacted by changes in the economies of the countries served by our customers, as well as the state of the worldwide industries in which we operate or expect to operate in the future. The timing, length and severity of the up-and-down cycles in the semiconductor equipment industry are difficult to predict. Additionally, we generally experience a one-to-two quarter lag between upturns/downturns experienced by larger equipment manufacturers.\nWhen cyclical fluctuations result in lower than expected revenue levels, our operating results are adversely affected. Cost reduction measures may be necessary in order for us to remain competitive and financially sound. During a down cycle, our operating results may be adversely affected if we are unable to make timely adjustments to our cost and expense structure to correspond to the prevailing market conditions, effectively manage our supply chain, and motivate and retain key employees. In addition, during periods of rapid growth, our operating results may be adversely affected if we are unable to increase manufacturing capacity and personnel to meet customer demand, which may require additional liquidity. We can provide no assurance that we can timely and effectively respond to the industry cycles, and our failure to do so could have a material adverse effect on our business.\nThe semiconductor equipment industry is highly competitive and, because we are relatively small in size and have fewer financial and other resources compared to our competitors, we may not be able to compete successfully with them.\nOur industry includes large manufacturers with substantial resources to support customers worldwide. Our future performance depends, in part, upon our ability to continue to compete successfully in these markets. Some of our competitors are diversified companies with extensive financial resources and research, engineering, manufacturing,\nmarketing and customer service and support capabilities that are greater than ours. We face competition from companies whose strategy is to provide a broad array of products, some of which compete with the products and services we offer. These competitors may bundle their products in a manner that discourages customers from purchasing our products. In addition, we face competition from emerging semiconductor equipment companies whose strategy is to provide a portion of the products and services that we offer often at a lower price than ours and use innovative technology to sell products into specialized markets. We also face competition from Chinese equipment manufacturers that may receive greater support than we do from Chinese customers and governmental agencies because they are locally based. In addition, our local Chinese competitors may offer lower prices and more liberal payment terms than ours. Loss of our competitive position due to any of these factors could impair our prices, customer orders, revenue, gross margin and market share, any of which would negatively affect our business, financial position and results of operations.\nRisks Related to Our Business and Our Operations\nBusiness interruptions, including those related to COVID-19, have had an adverse impact on our operations, including among others, our manufacturing and supply chain, sales and product development, and could have an adverse impact on our business, financial condition and results of operations in future periods.\nThe COVID-19 pandemic and the resulting containment measures have caused economic and financial disruptions globally, including in most of the regions in which we sell our products and conduct our business operations. Beginning in the second half of fiscal 2020, the COVID-19 pandemic negatively impacted consumer and business spending generally and has significantly contributed to deteriorating macroeconomic conditions. We continue to experience significant supply constraints seen industry-wide due to component shortages which have resulted in extended lead times and higher supply chain costs. The magnitude and duration of the disruption, its continuing impact on us, and resulting decline in global business activity is uncertain.\nWhile we continue to monitor and assess the impact on our business from the spread of COVID-19 and related new strains and the ever evolving actions implemented by governments across the globe, our global operations have returned to normal. The degree to which COVID-19 impacts our future business and operations will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the duration, spread and severity of the outbreak, new information which may emerge concerning the severity of COVID-19 and the actions to contain COVID-19 or treat its impact, among others. In particular, the continued spread and/or resurgence of COVID-19 globally and/or the emergence of new strains of COVID-19, such as the Omicron BA.5 variant, could result in a widespread health crisis and/or change in consumer behavior that could adversely affect the global economy and financial markets, resulting in an economic downturn, and could also adversely impact our operations, including, without limitation, our manufacturing and supply chain, sales and product development operations, particularly our prospective sales if the Semiconductor and Material and Substrate segments we seek to serve suffer long-term damage. Such an economic downturn could have an adverse impact on the successful and timely implementation of our strategic growth plan and on our business, financial condition and results of operations. We are similarly unable to predict the extent to which the pandemic impacts our customers, suppliers and other partners and their financial conditions, but adverse effects on these parties could also adversely affect us.\nFinally, the impact of COVID-19 can also exacerbate other risks discussed in this Risk Factors section and throughout this report, which could in turn have a material adverse effect on us. Developments related to COVID-19 have been unpredictable, and additional impacts and risks may arise that we are not aware of or able to respond to appropriately.\nWe may not be able to generate sufficient cash flows or obtain access to external financing necessary to fund existing operations and our growth plan.\nCash flows may be insufficient to provide adequate working capital in the future and we may require additional financing to fund existing operations as well as our growth plan. There is no assurance that any additional financing will be available if and when required, or, even if available, that it would not materially dilute the ownership percentage of our then existing shareholders, result in increased expenses or result in covenants or special rights that would restrict our operations.\nWe may not be able to manage our business successfully through severe business cycles.\nWe may be unable to successfully expand or contract our business to meet fluctuating demands. Market fluctuations place significant strain on our management, personnel, systems and resources. To successfully manage our growth through such market fluctuations, we believe we must effectively:\nmaintain the appropriate number and mix of permanent, part-time, temporary and contract employees to meet the fluctuating demand for our products;\ntrain, integrate and manage personnel, particularly process engineers, field service engineers, sales and marketing personnel, and financial and information technology personnel to maintain and improve skills and morale;\nretain key management and augment our management team, particularly if we lose key members;\ncontinue to enhance our customer resource and manufacturing management systems to maintain high levels of customer satisfaction and efficiencies, including inventory control;\nimplement and improve existing and new administrative, financial and operations systems, procedures and controls;\nexpand and upgrade our technological capabilities; and\nmanage multiple relationships with our customers, suppliers and other third parties.\nWe may encounter difficulties in effectively managing the budgeting, forecasting and other process control issues presented by rapidly changing business cycles. If we are unable to effectively manage our business through these cycles, we may not be able to take advantage of market opportunities, develop new technologies and other products, satisfy customer requirements, execute our business plan or respond to competitive pressures.\nOur inability to attract, train and retain effective employees and management could harm our business.\nOur success depends upon the continued contributions of our executive officers and certain other employees, many of whom have many years of experience with us and would be extremely difficult to replace. We must also attract and retain experienced and highly skilled engineering, sales and marketing and managerial personnel. Competition for qualified personnel is intense in our industry, and we may not be successful in hiring and retaining these people. If we lost the services of our executive officers or our other highly qualified and experienced employees or cannot attract and retain other qualified personnel, our business could suffer as a result of less effective management due to loss of accumulated knowledge of our business or through less successful products due to a reduced ability to design, manufacture and market our products.\nAcquisitions can result in an increase in our operating costs, divert managements attention away from other operational matters and expose us to other risks.\nWe continually evaluate potential acquisitions and consider acquisitions an important part of our future growth strategy. In the past, we have made acquisitions of, or significant investments in, other businesses with synergistic products, services and technologies and plan to continue to do so in the future. Acquisitions involve numerous risks, including, but not limited to:\ndifficulties and increased costs in connection with integration of geographically diverse personnel, operations, technologies and products;\ndisruption of our ongoing operations and diversion of managements attention from other operational matters;\nthe potential loss of our key employees and the key employees of acquired companies or difficulty in integrating employees;\nthe potential loss of our key customers and suppliers and the key customers and suppliers of acquired companies;\ndisagreement with joint venture or strategic alliance partners;\nfailure to comply with laws and regulations as well as industry or technical standards of the overseas markets into which we expand;\nour inability to achieve the intended cost efficiency, level of profitability or other intended strategic goals for the acquisitions, strategic investments, joint ventures or other strategic alliances;\nlack of synergy, or inability to realize expected synergies, resulting from the acquisition;\nthe likelihood that the issuance of our common stock, if any, in an acquisition or merger could be dilutive to our existing shareholders;\nimpairment of acquired assets as a result of technological advancements or worse-than-expected performance of the acquired company;\ninability to complete proposed transactions as anticipated or at all and any ensuing obligation to pay a termination fee and any other associated transaction expenses;\nthe potential impact of the announcement or consummation of a proposed transaction on relationships with third parties;\npotential changes in our credit rating, which could adversely impact our access to and cost of capital;\npotential litigation that may arise in connection with an acquisition;\nreductions in cash balances and/or increases in debt obligations to finance activities associated with a transaction, which reduce the availability of cash flow for general corporate or other purposes;\ninadequacy or ineffectiveness of an acquired companys internal financial controls, disclosure controls and procedures, and/or environmental, health and safety, anti-corruption, human resource or other policies or practices; and\nunknown, underestimated and/or undisclosed commitments or liabilities and other risks associated with acquired businesses or assets.\nAny of these risks could have a material adverse effect on our business, results of operations, financial condition, or cash flows, particularly in the case of a large acquisition. Moreover, our resources are limited and our decision to pursue a transaction has opportunity costs; accordingly, if we pursue a particular transaction, we may need to forgo the prospect of entering into other transactions that could help us achieve our financial or strategic objectives. No assurance can be given that we will be able to successfully complete future strategic acquisitions if we cannot reach agreement on acceptable terms or for other reasons. We may have to incur debt, issue equity securities or a combination of the foregoing to pay for any future acquisitions, the issuance of which could involve the imposition of restrictive covenants or be dilutive to our existing shareholders.\nOur reliance on sales to a few major customers, often on credit terms, places us at financial risk.\nWe currently sell to a relatively small number of customers and expect to do so for the foreseeable future. Therefore, our operating results depend on the ability of these customers to sell products that require our equipment in their manufacture. Many of our customer relationships have developed over a short period of time and certain ones are in the early stages of development. The loss of sales to any of these customers would have a significant negative impact on our business. Additionally, our customers may cancel their agreements with us if we fail to meet certain product specifications, materially breach agreements or encounter insolvency or bankruptcy. They also may seek to renegotiate the terms of current agreements or renewals. We cannot be certain our existing customers will generate significant revenue for us in the future or that these new customer relationships will continue to develop. If we are unable to maintain or expand our customer base, we may not be able to maintain or increase our revenue.\nIn addition to having a relatively limited number of customers, we manufacture a limited number of products for each of our customers. If we lose any of our largest customers (as we have in the past from time to time), experience a significant reduction in sales to any such customers or no longer manufacture a particular product line for one of our largest customers, we would experience a significant reduction in our revenue.\nAs of September 30, 2022, one Semiconductor customer individually represented 12% of our accounts receivable. A concentration of our receivables from one or a small number of customers places us at risk. In such a scenario, a significant change in the liquidity or financial position of any of our customers that purchase large systems could have a material impact on the collectability of our accounts receivable and our future operating results. We attempt to manage this credit risk by requiring significant partial payments prior to shipment, where appropriate, and by actively monitoring collections. We also require letters of credit from certain customers depending on the size of the order, type of customer or its creditworthiness and its country of domicile. Our major customers may seek and, on occasion, may receive pricing, payment or other commercial terms that are less favorable to us than the current terms we\ncustomarily obtain. If any one or more of our major customers were to seek to re-negotiate their agreements on more favorable terms, or not pay us or continue business with us, it could adversely affect our business, financial position and results of operations.\nOur customers could cancel or fail to accept a large system order.\nOur backlog includes orders for large systems, such as our horizontal diffusion furnaces, with system prices of up to and in excess of $1.0 million, depending on the system configuration, options and any other configuration requirements of the customer. Some orders include multiple systems. Because our orders are typically subject to cancellation or delay by the customer, our backlog at any particular point in time is not necessarily representative of actual sales for succeeding periods. Our financial position and results of operations could be materially and adversely affected should any large systems order be canceled prior to shipment or not be accepted by the customer. Cancellations may result in inventory that we may not be able to quickly resell. We have experienced cancellations in the past. We cannot provide any assurance that we will realize revenue or profit from our backlog.\nManufacturing interruptions or delays could affect our ability to meet customer demand and lead to higher costs.\nOur business depends on timely supply of equipment, services and related products that meet the rapidly changing technical and volume requirements of our customers. Some key parts to our products are subject to long lead times and/or are obtainable only from a single supplier or limited group of suppliers. Cyclical industry conditions and the volatility of demand for manufacturing equipment increase capital, technical, operational and other risks for us and for companies throughout our supply chain. Further, these conditions may cause some suppliers to scale back operations, exit businesses, merge with other companies, file for bankruptcy protection or possibly cease operations. We also may experience significant interruptions of our manufacturing operations, delays in our ability to deliver products or services or increased costs as a result of any of the following:\nthe failure or inability of suppliers to deliver sufficient quantities of quality parts on a cost-effective and timely basis;\nvolatility in the availability and cost of materials, including rare earth elements;\ndifficulties or delays in obtaining required import or export approvals;\ninformation technology or infrastructure failures; and\nnatural disasters or other events beyond our control (such as earthquakes, floods or storms, regional economic downturns, pandemics, social unrest, political instability, terrorism, or acts of war), particularly where we conduct manufacturing operations.\nBecause we depend on revenue from international customers, our business may be adversely affected by changes in the economies and policies of the countries or regions in which we do business.\nIn 2022, 64% of our net revenue came from customers outside of North America as follows: Asia - 44% (including China - 17%, Taiwan - 14% and Malaysia - 7%); and Europe - 20%.\nEach geographic region in which we, our customers, and our suppliers operate exhibits unique characteristics that can cause capital equipment investment patterns to vary significantly from period to period. Our business and results of operations could be negatively affected by periodic local or international economic downturns, trade balance issues and political, social and military instability in countries such as China, Russia, India, South Korea, Taiwan, Ukraine and possibly elsewhere. In addition, we face competition from a number of suppliers based in Asia that have certain advantages over suppliers from outside of Asia. These advantages include lower operating, shipping and regulatory costs, proximity to customers, favorable tariffs and other government policies that favor local suppliers. Additionally, the marketing and sale of our products to international markets expose us to a number of risks, including the following:\nincreased costs associated with maintaining the ability to understand the local markets and follow their trends and customs, as well as developing and maintaining an effective marketing and distributing presence;\nlimitations on our ability to require advance payments from our customers;\ndifficulty in providing customer service and support in local markets;\ndifficulty in staffing and managing overseas operations;\nlonger sales cycles and collection periods;\nfewer or weaker legal protections for our intellectual property rights;\nfailure to develop appropriate risk management and internal control structures tailored to overseas operations;\ndifficulty and costs relating to compliance with the different or changing commercial and legal requirements of our overseas markets;\nfluctuations in foreign currency exchange and interest rates;\nfailure to obtain or maintain certifications for our products or services in these markets; and\ninternational trade barriers such as export requirements, tariffs, taxes and other restrictions and expenses.\nOur business may be adversely affected by significant exchange rate fluctuations.\nThough our business has not been materially affected in the past by currency fluctuations, there is a risk that it may be materially adversely affected in the future. Such risk includes possible losses due to currency exchange rate fluctuations, future prohibitions against repatriation of earnings, or proceeds from disposition of investments.\nWe are exposed to risks associated with an uncertain global economy.\nUncertain global economic conditions and slowing growth in China, Europe and the United States, along with difficulties in the financial markets, national debt concerns and government austerity measures in certain regions, pose challenges to the industries in which we operate. Related factors, including unemployment, inflation and fuel prices, exacerbate negative trends in business and consumer spending and may cause our customers to delay, cancel, or refrain from placing orders for equipment or services. These actions may, in turn, reduce our net sales, reduce backlog, and negatively affect our ability to convert backlog to sales. Uncertain market conditions, difficulties in obtaining capital, or reduced profitability also may cause some customers to scale back operations, exit businesses, merge with other manufacturers, or file for bankruptcy protection and potentially cease operations, which can result in lower sales and/or additional inventory or bad debt expense for us. These conditions may similarly affect key suppliers, impairing their ability to deliver parts and potentially causing delays or added costs for delivery of our products. In addition, these conditions may lead to strategic alliances by, or consolidation of, other equipment manufacturers, which could adversely affect our ability to compete effectively. Uncertainty about future economic and industry conditions also makes it more challenging for us to forecast our operating results, make business decisions, and identify and prioritize the risks that may affect our businesses, sources and uses of cash, financial condition and results of operations. We may be required to implement additional cost reduction efforts, including restructuring activities, and/or modify our business model, which may adversely affect our ability to capitalize on opportunities in a market recovery. If we do not timely and appropriately adapt to changes resulting from these uncertain macroeconomic environment and industry conditions, or to difficulties in the financial markets, our business, financial condition and results of operations may be materially and adversely affected.\nIf we fail to maintain optimal inventory levels, our inventory obsolescence costs could increase, our liquidity could be significantly reduced or our revenue could decrease.\nWhile we must maintain sufficient inventory levels to operate our business successfully, meet our customers demands, and mitigate the possible impact of supply chain issues, accumulating excess inventory may have a significant unfavorable impact on our operating results and financial condition. Changing customer demands, supplier lead times and uncertainty surrounding new product launches expose us to risks associated with excess inventory or shortages. Our products are manufactured using a wide variety of purchased parts and raw materials and we must maintain sufficient inventory levels to meet the demand for the products we sell, which can change rapidly and unexpectedly. During peak years of our business, increases in demand for capital equipment result in longer lead times for many important system components. Future increases in demand could cause delays in meeting the shipment requirements or expectations of our customers. Because of the variability and uniqueness of customer orders, we try to avoid maintaining an extensive inventory of materials for manufacturing. However, long lead times for important system components during industry upturns sometimes require us to carry higher levels of inventory and make larger purchase commitments than we otherwise would make. We may be unable to sell sufficient quantities of products in the event that market demand changes, resulting in increased risk of excess inventory that could lead to obsolescence\nor reduced liquidity as we fulfill our purchase commitments. Conversely, if we do not have a sufficient inventory of a product to fulfill customer orders, we may lose orders or customers, which may adversely affect our business, financial condition and results of operations. We may not be able to accurately predict market demand to avoid inventory shortages or build inventories and issue purchase commitments in excess of our current requirements.\nSupplier capacity constraints, supplier production disruptions, supplier quality issues or price increases could increase our operating costs and adversely impact the competitive positions of our products.\nWe use numerous suppliers covering a wide range of materials and services in the production of our products including custom electronic and mechanical components. Key vendors include suppliers of controllers, quartz and silicon carbide for our diffusion systems, steel mills capable of producing the types of steel to the tolerances needed for our wafer carriers, an injection molding machine that molds plastic inserts into our steel carriers, an adhesive manufacturer that supplies the critical glue and a pad supplier that produces a unique material used in the manufacture of our polishing templates. We also rely on third parties for certain machined parts, steel frames and metal panels and other components used particularly in the assembly of our production equipment. Although we strive to ensure that parts are available from multiple suppliers, we procure some key parts from a single supplier or a limited number of suppliers. Thus, at times, certain parts may not be available in sufficient quantities, or on a timely and cost-efficient basis, to adequately meet our needs and the needs of our customers.\nIn the event of supplier capacity constraints, production disruptions, or failure to meet our requirements concerning quality, cost or performance factors, we may transfer our business to alternative sourcing which could lead to further delays, additional costs or other difficulties. If, in the future, we do not receive, in a timely and cost-effective manner, a sufficient quantity and quality of parts to meet our production requirements, our business, financial position and results of operations may be materially and adversely affected.\nOur income taxes are subject to variables beyond our control.\nOur net income and cash flow may be adversely affected by conditions affecting income taxes which are outside our control. Examples of the potential uncontrollable circumstances that could affect our tax rate are as follows:\nWe sell and operate globally in the United States, Europe and Asia. Disagreement could occur on the jurisdiction of income and taxation among different governmental tax authorities. Potential areas of dispute may include transfer pricing, intercompany charges and intercompany balances.\nWe are subject to a Chinese withholding tax on certain non-tangible charges made under our transfer pricing agreements. The interpretation of what charges are subject to the tax and when the liability for the tax occurs has varied and could change in the future.\nTax rates may increase or new tax rates may be implemented (i.e., a global minimum rate), and, therefore, have a material adverse effect on our earnings and cash flows.\nOur officers, directors and largest shareholders could choose to act in their best interests and not necessarily those of our other shareholders.\nOur directors, executive officers and holders of five percent or more of our outstanding common stock and their affiliates represent a significant portion of our common stock held as of September 30, 2022, and, therefore, have significant influence over our management and corporate policies. These shareholders have significant influence over all matters submitted to our shareholders, including the election of our directors and approval of business combinations, and could potentially initiate or delay, deter or prevent a change of control. Circumstances may occur in which the interests of these shareholders may conflict with the interests of Amtech or those of our other shareholders, and these shareholders may cause us to take actions that align with their interests. Should conflicts of interest arise, we can provide no assurance that these shareholders would act in the best interests of our other shareholders or that any conflicts of interest would be resolved in a manner favorable to our other shareholders. In addition, involvement of certain activist shareholders may impact our ability to recruit and retain talent or otherwise distract management or make decisions that we believe are in the long-term interest of all shareholders.\nInformation security breaches or failures of our information technology systems may have a negative impact on our operations and our reputation.\nWe may be subject to information security breaches or failures of our information technology systems caused by advanced persistent threats, unauthorized access, sabotage, vandalism, terrorism or accident. Compromises and failure to our information technology networks and systems could result in unauthorized release of our confidential or proprietary information, or that of our customers and suppliers, as well as employee personal data. The costs to protect against or alleviate breaches and systems failures require significant human and financial capital expenditures, which in turn could potentially disrupt our continuing operations, increase our liability as a result of compromises to personally identifiable information, and may lead to a material and adverse effect on our financial reporting, reputation and business.\nOn April 12, 2021, we detected a data incident in which attackers acquired data and disabled some of the technology systems used by one of our subsidiaries. Following an investigation by our retained external counsel and third-party forensic, incident response, and security professionals, we determined that the unauthorized third-party gained access to certain personal information relating to employees and their beneficiaries for some of our operations. There was no indication of any misuse of this information. Working alongside our security professionals, we were able to bring our subsidiarys systems online with enhanced security controls. We have deployed an advanced next generation anti-virus and endpoint detection and response tool, as well as Managed Detection & Response services. We remain committed to protecting the security of the personal information entrusted to us and providing high-quality products and service to our customers; however, there can be no guarantees that these measures will be successful in preventing future incidents.\nThis incident could still result in future legal claims or proceedings, regulatory investigations or actions, and other types of liability under laws that protect the privacy and security of personal information, including federal, state and foreign data protection and privacy regulations, violations of which could result in significant judgments against us, penalties and fines. The cost of investigating, mitigating and responding to data incidents and complying with any applicable breach notification obligations to individuals, regulators, customers and others, including the April 2021 data incident, could be significant. We recorded approximately $1.1 million of expense related to this incident, which is included in selling, general and administrative expenses, in fiscal 2021. We filed an insurance claim during the fourth quarter of fiscal 2021 related to the incident and during 2022 signed a final settlement agreement with our insurer resulting in total reimbursement of approximately $0.6 million, which has been paid in full. Such insurance may not be available to us in the future on economically reasonable terms, or at all. Further, defending a suit, regardless of its merit, could be costly, divert management attention and harm our reputation.\nNatural disasters, outbreaks of infectious diseases, terrorist attacks, wars and threats of war may negatively impact our operations, revenue, costs, and stock price.\nNatural disasters such as earthquakes, floods, severe weather conditions, outbreaks of infectious diseases in addition to COVID-19 or other catastrophic events may severely affect our operations or those of our suppliers and customers. Acts of terrorism, as well as events occurring in response or connection to them, including potential future terrorist attacks, rumors or threats of war, actual military conflicts or trade disruptions impacting our domestic or foreign customers or suppliers, may negatively impact our operations by causing, among other things, delays, or losses in the delivery of supplies or finished goods and decreased sales of our products. More generally, any of these events could cause consumer confidence and spending to decrease and/or result in increased volatility in the worldwide financial markets and economy. They also could result in economic recession either globally or in the markets in which we operate. Any of these occurrences could have a significant adverse impact on our business, financial position and results of operations.\nThe extended closure of our Shanghai manufacturing facility as a result of the Chinese governments mandatory shutdown of Shanghai may have an adverse impact on our operations, including among others, our ability to manufacture products from that location and meet customer demand and other contractual requirements, and may have an adverse impact on our business, financial condition and results of operations.\nOn March 28, 2022, the Chinese government issued a mandatory shutdown in Shanghai, the location of one of our manufacturing facilities. The factory was allowed to partially reopen in May 2022 and fully reopened on June 1, 2022. After the reopening on June 1, 2022, the factory was able to operate at near full capacity for the entire month of June. We were able to make up the shipments missed in the fourth quarter and are now operating at normal capacity levels. Additionally, there can be no assurance that this facility will be allowed to remain open on a consistent basis. If additional shutdowns occur in the future or if we are unable to establish manufacturing alternatives, our business, financial condition and results of operations may be adversely impacted.\nRisks Related to Regulations and Litigation\nOur business may be adversely affected by changes in or failure to comply with foreign and domestic laws.\nOur operations are subject to numerous foreign and domestic regulatory regimes, including taxation policies, governance and audit requirements, employment and labor laws, transportation regulations, import and export regulations and tariffs, possible foreign exchange restrictions and international monetary fluctuations. Our policies, procedures and internal controls are designed to help us comply with all applicable foreign and domestic laws, accounting and reporting requirements, regulations and tax requirements. We could be subject to legal or regulatory action in the event of our failure to comply with any of the foregoing requirements, which could be expensive to defend and resolve and be disruptive to our business. Any changes in regulations, the imposition of additional regulations or the enactment of any new legislation that affects us may increase the complexity of the legal and regulatory environment in which we operate and the related costs of compliance.\nWe are subject to U.S. and certain non-U.S. anti-corruption/anti-bribery, export and import controls, sanctions, embargoes, anti-money laundering, anti-terrorist financing, and other similar laws and regulations. Compliance with these legal standards could impair our ability to compete in domestic and international markets. We can face criminal liability and other serious consequences for violations of these laws and regulations which can harm our business.\nWe are a U.S.-based multinational company with extensive operations in Asia and elsewhere. We operate in several high-risk jurisdictions, including, but not limited to China. Various U.S. and certain non-U.S. anti-corruption/anti-bribery and other international trade laws and regulations apply to our company entities and businesses. These laws and regulations may include, among others, the Foreign Corrupt Practices Act of 1977, as amended, the U.S. Travel Act, domestic anticorruption laws such as 18 U.S.C. §201, the Money Laundering Control Act of 1986, the USA PATRIOT Act, the U.S. Export Control Reform Act of 2018, the U.S. Export Administration Regulations (15 C.F.R. §§730 et seq.), U.S. sanctions contained in 31 C.F.R. Parts 500-599, the U.S. International Emergency Economic Powers Act, the U.S. Trading with the Enemy Act, the International Boycott Provisions (Section 999) of the U.S. Internal Revenue Code, the UK Bribery Act 2010, the UK Proceeds of Crime Act 2002, and certain other anti-corruption, anti-bribery, anti-kickback, anti-fraud, anti-money laundering, anti-terrorist financing, anti-narcotics, anti-boycott, export control, sanctions, embargo, import control, customs, tax, insider trading, insurance, banking, false claims, anti-racketeering, and other laws, regulations, decrees, government or executive orders, or judicial or administrative decisions or determinations to the extent applicable.\nThese laws and regulations are interpreted very broadly and will impact and raise legal compliance risks for our business in the various jurisdictions where we operate. Violations of any of these laws and regulations may result in substantial civil and/or criminal fines and penalties, imprisonment, the loss of export or import privileges, debarment, tax reassessments, breach of contract and fraud litigation, reputational harm, and other consequences.\nAnti-corruption/anti-bribery and the other laws and regulations referenced above are actively enforced by U.S. and other government agencies. Among various matters, anti-corruption/anti-bribery laws prohibit our companies, subsidiaries, directors, officers, employees, and business partners, as well as third parties acting for or on our behalf, from authorizing, promising, offering, providing, soliciting, or accepting, whether directly or indirectly, improper payments or anything else of value to or from recipients in the public or private sector. We may engage vendors and\nthird-party business partners to sell our products or services and/or to obtain necessary permits, licenses, patent registrations, and other regulatory approvals. We have direct or indirect interactions with officials and employees of government agencies or government-affiliated organizations. These activities raise our anti-corruption/anti-bribery risk exposure. We can be held liable for the corrupt or other illegal activities of our officers, directors, employees, and business partners, as well as the conduct of third parties acting for or on our behalf, even if we do not explicitly authorize or have actual knowledge of their misconduct. The application of these laws to us also may place us at a competitive disadvantage to foreign companies that are not subject to similar laws/regulations.\nThe United States could withdraw from or materially modify certain international trade agreements, or change tariff, trade, or tax provisions related to the global manufacturing and sales of our products in ways that we currently cannot predict.\nA portion of our business activities are conducted in foreign countries, including China, Malaysia and Taiwan. Our business benefits from free trade agreements, and we also rely on various U.S. corporate tax provisions related to international commerce as we build, market and sell our products globally. Changes in U.S. or international social, political, regulatory and economic conditions could impact our business, reputation, financial condition and results of operations. In particular, political and economic instability, geopolitical conflicts, political unrest, civil strife, terrorist activity, acts of war, public corruption, expropriation, nationalism and other economic or political uncertainties in the United States or internationally could interrupt and negatively affect the sale of our products or other business operations. Any negative sentiment toward the United States as a result of any such changes could also adversely affect our business. In addition, changes in laws and policies governing foreign trade, manufacturing, development and investment in the territories or countries where we currently sell our products or conduct our business could adversely affect our business. U.S. presidential administrations have instituted or proposed changes in trade policies that include the negotiation or termination of trade agreements, the imposition of higher tariffs on imports into the U.S., economic sanctions on individuals, corporations or countries, and other government regulations affecting trade between the U.S. and other countries where we conduct our business. It may be time-consuming and expensive for us to alter our business operations in order to adapt to or comply with any such changes. Changes or proposed changes in U.S. or other countries' trade policies may result in restrictions and economic disincentives on international trade. Tariffs and other changes in U.S. trade policy have in the past and could in the future trigger retaliatory actions by affected countries, and certain foreign governments have instituted or are considering imposing retaliatory measures on certain U.S. goods. Further, any emerging protectionist or nationalist trends either in the United States or in other countries could affect the trade environment. Amtech, similar to many other multinational corporations, does a significant amount of business that would be impacted by changes to the trade policies of the United States and foreign countries (including governmental action related to tariffs, international trade agreements, or economic sanctions). Such changes have the potential to adversely impact the U.S. economy or certain sectors thereof or the economy of another country in which we conduct operations, our industry and the global demand for our products, and as a result, could have a material adverse effect on our business, financial condition and results of operations. We are continuing to evaluate the impact of the announced and other proposed tariffs on products that we import from China, and we may experience a material increase in the cost of our products, which may result in our products becoming less attractive relative to products offered by our competitors.\nThese developments, or the perception that any of them could occur, may have a material adverse effect on global economic conditions and the stability of global financial markets, and may significantly reduce global trade and, in particular, trade between the impacted nations and the United States. Any of these factors, or any changes to U.S. corporate tax policies related to international commerce, could depress economic activity and have a material adverse effect on our business, financial condition and results of operations.\nWe are subject to expanded export control restrictions recently adopted by the U.S. Department of Commerces Bureau of Industry and Security that could negatively impact our business in China.\nThe United States and certain other countries in which we do business maintain government controls that may restrict our ability to import or export our products and services or increase the cost of our operations through the imposition of tariffs, new controls, outright bans, or otherwise, that could harm our business and negatively impact our financial position and results of operations. For example, the U.S. Department of Commerce has added numerous China-based entities to the U.S. Entity List, including many entities active in the semiconductor industry in China, restricting our ability to provide products and services to such entities without an export license. Even if we apply for licenses to sell our products or provide services to companies on the U.S. Entity List, there can be no assurance that licenses will be\ngranted. In addition, the U.S. Department of Commerce has imposed new export licensing requirements on exports to China-based customers engaged in development or production in China of advanced semiconductors and supercomputers, military end uses, support for military end users, or where Commerce has determined there is a risk of diversion to a military end use, as well as requiring our customers to obtain export licenses when they use certain semiconductor capital equipment based on U.S. technology to manufacture products connected to certain entities on the U.S. Entity List. The U.S. Department of Commerce has also imposed restrictions on the activities of U.S. persons supporting or facilitating transactions with projects in China for the development or production of advanced semiconductors and supercomputers. To date, these new rules have not significantly impacted our operations, but we are continually monitoring their impact. If additional companies are added to the U.S. Entity List, or other licensing requirements or restrictions are imposed, thereby limiting our ability to sell our products or services to other customers in China, our business could be significantly harmed. Similar actions by the U.S. government or another country could impact our ability to provide our products and services to existing and potential customers.\nWe are subject to environmental regulations, and our inability or failure to comply with these regulations could result in significant costs or the suspension of our ability to operate portions of our business.\nWe are subject to environmental regulations in connection with our business operations, including regulations related to manufacturing and our customers use of our products. From time to time, we receive notices regarding these regulations. It is our policy to respond promptly to these notices and to take any necessary corrective action. Our failure or inability to comply with existing or future environmental regulations could result in significant remediation liabilities, the imposition of fines and/or the suspension or termination of development, manufacturing or use of certain of our products or facilities, each of which could damage our financial position and results of operations.\nWe face a risk of product liability claims or other litigation, which could be expensive and may divert managements attention from running our business.\nAmtech and our subsidiaries are defendants from time to time in actions for matters arising out of our business operations. The manufacture and sale of our products, which, in our customers operations, involve toxic materials and robotic machinery, involve the risk of product liability claims. In addition, a failure of one of our products at a customer site could interrupt the business operations of our customer. Our existing insurance coverage limits may not be adequate to protect us from all liabilities that we might incur in connection with the manufacture and sale of our products if a successful product liability claim or series of product liability claims were brought against us. As of September 30, 2022 and 2021, our accrued warranty costs amounted to $0.9 million and $0.5 million, respectively. Our assumptions regarding the durability and reliability of our products may not be accurate, and because our products have relatively long warranty periods, we cannot assure you that the amount of accrued warranty by us for our products will be adequate in light of the actual performance of our products or that we won't experience higher than expected warranty claims. If we experience a significant increase in warranty claims, we may incur significant repair and replacement costs associated with such claims. Furthermore, widespread product underperformances or failures will damage our reputation and customer relationships and may cause our sales to decline, which in turn could have a material adverse effect on our business, financial condition and results of operations.\nWe also may be involved in other legal proceedings or claims and experience threats of legal action from time to time in the ordinary course of our business. For example, securities class action litigation is often brought against companies following periods of volatility in the market price of its securities or in connection with strategic transactions. We may in the future be the target of securities litigation due to volatility in the market price of our common stock or for other reasons. Any securities litigation could result in substantial costs and could divert the attention and resources of our management.\nWhere appropriate, we intend to vigorously defend all claims. However, any actual or threatened claims, even if not meritorious or material, could result in the expenditure of significant financial and managerial resources. The continued defense of these claims and other types of lawsuits could divert managements attention away from running our business. In addition, amounts required to be paid in settlement of any claims, and the legal fees and other costs associated with their defense or settlement, cannot be estimated and could, individually or in the aggregate, materially harm our financial condition.\nRisks Related to Our Research and Development and Intellectual Property Activities\nWe may not be able to keep pace with the rapid change in the technology needed to meet customer requirements.\nSuccess in the semiconductor equipment industry depends, in part, on continual improvement of existing technologies and rapid innovation of new solutions. For example, the semiconductor industry continues to shrink the size of semiconductor devices. This and other evolving customer needs require us to continually respond with new product developments. Technical innovations are inherently complex and require long development cycles and appropriate professional staffing. Our future business success depends on our ability to develop and introduce new products, or new uses for existing products, that successfully address changing customer needs and win market acceptance. We also must manufacture these new products in a timely and cost-effective manner. To realize future growth through technical innovations in the semiconductor industry, we must acquire the technology through product development, merger and acquisition activity or through the licensing of products from our technology partners. Potential disruptive technologies could have a material adverse effect on our business if we do not successfully develop and introduce new products, technologies or uses for existing products in a timely manner and continually find ways of reducing the cost to produce them in response to changing market conditions or customer requirements.\nOur research and development investments may not result in timely new products that can be sold at favorable prices and obtain market acceptance.\nThe rapid change in technology in our industry requires that we continue to make investments in research and development in order to enhance the performance, functionality and cost of ownership of our products to keep pace with competitors products and to satisfy customer demands for improved performance, features and functionality. We cannot provide assurance that revenue from future products or enhancements will be sufficient to recover the development costs associated with such products or enhancements, or that we will be able to secure the financial resources necessary to fund future development. Research and development costs are typically incurred before we confirm the technical feasibility and commercial viability of a product, and not all development activities result in commercially viable products. We cannot assure that products or enhancements will receive market acceptance, or that we will be able to sell these products at prices that are favorable to us, or at all. If we do not successfully manage our investments in research and development, our business, financial condition and results of operations could be materially and adversely affected.\nThird parties may violate our proprietary rights, in which we have made significant investments, resulting in a loss of value of some of our intellectual property or costly litigation.\nOur success is dependent in part on our technology and other proprietary rights. We own various U.S. and international patents and have additional pending patent applications relating to some of our products and technologies. Protecting and defending our patents domestically, and especially internationally, is costly. In addition, the process of seeking patent protection is lengthy and expensive. Therefore, we cannot be certain that pending or future applications will result in issued patents, or that issued patents will be of sufficient scope or strength to provide meaningful protection or commercial advantage to us. Other companies and individuals, including our larger competitors, may develop technologies that are similar or superior to our technology or design around the patents we own or license. In addition, the patent for the technology that we license and use in our manufacture of insert carriers has expired, which, along with the other risks related to our patents described above, may have the effect of diminishing or eliminating any competitive advantage we may have with respect to our manufacturing process.\nWe also maintain trademarks on certain of our products and claim copyright protection for certain proprietary software and documentation. We can give no assurance, however, that our trademarks and copyrights will be upheld or will successfully deter infringement by third parties.\nWe attempt to protect our trade secrets and other proprietary information through confidentiality agreements with our customers, suppliers, employees and consultants and through other security measures. We also maintain exclusive and non-exclusive licenses with third parties for the technology used in certain products. However, these employees, consultants and third parties may breach these agreements, and we may not have adequate remedies for wrongdoing. In addition, the laws of certain territories, such as China, in which we develop, manufacture or sell our products may not protect our intellectual property rights to the same extent as do the laws of the United States.\nWe may face intellectual property infringement claims that could be time-consuming and costly to defend and could result in our loss of significant rights and the assessment of treble damages.\nFrom time to time, we have received communications from other parties asserting the existence of patent rights or other intellectual property rights that they believe cover certain of our products, processes, technologies or information. Some of these claims may lead to litigation. We cannot assure that we will prevail in these actions, or that other actions alleging misappropriation or misuse by us of third-party trade secrets, infringement by us of third-party patents and trademarks or the validity of our patents, will not be asserted or prosecuted against us. If there is a successful claim of infringement against us, we may be required to pay substantial damages (including treble damages if we were to be found to have willfully infringed a third partys patent) to the party claiming infringement, incur costs to develop non-infringing technology, stop selling or using technology that contains the allegedly infringing intellectual property, or enter into royalty or license agreements that may not be available on acceptable or commercially practical terms, if at all. Intellectual property litigation, regardless of outcome, is expensive and time-consuming, and could divert managements attention from our business. Our failure to successfully defend against infringement claims, or to develop non-infringing technologies or license the proprietary rights on a timely basis, could have a material negative effect on our business, operating results or financial condition.\nRisks Related to Our Common Stock\nWe have experienced, and may continue to experience, significant volatility in our stock price.\nA variety of factors may cause the price of our stock to be volatile. For example, our results of operations are difficult to predict and have fluctuated from time to time in the past. We expect that our results of operations may continue to fluctuate from time to time in the future. It is possible that our results of operations in some reporting periods will be below market expectations. If our results of operations for a particular reporting period are lower than the market expectations for such reporting period, investors may react negatively and, as a result, the price of our stock may materially decline.\nFurthermore, the stock market in general, and the market for shares of high-technology companies in particular, including ours, have experienced extreme price fluctuations, which have often been unrelated to the operating performance of affected companies. During the two-year period ended September 30, 2022, the price of our common stock has ranged from $15.78 to $4.90. The price of our stock may be more volatile than the stock of other companies due to, among other factors, the unpredictable, volatile and seasonal nature of the industries in which we operate, our significant customer concentration, intense competition, our fluctuating backlog and our relatively low daily stock trading volume. As a result, the market price of our common stock is likely to continue to fluctuate significantly in the future, including fluctuations related and unrelated to our performance.\nAdditional factors may affect our stock price, including sales of our common stock by us or our existing shareholders as well as changes to the coverage and/or rating of our stock by securities analysts.\nShareholder activists could cause a disruption to our business.\nAn activist investor may indicate disagreement with our strategic direction or capital allocation policies and may seek representation on our Board of Directors. Our business, operating results or financial condition could be adversely affected and may result in, among other things:\nincreased operating costs, including increased legal expenses, insurance, administrative expenses and associated costs incurred in connection with director election contests;\nuncertainties as to our future direction, which could result in the loss of potential business opportunities and could make it more difficult to attract, retain, or motivate qualified personnel, and strain relationships with investors and customers; and\nreduction or delay in our ability to effectively execute our current business strategy and to implement new strategies.\nThere are provisions in our corporate governing documents that could make an acquisition of the Company more difficult and limit attempts by our shareholders to replace or remove our current management.\nOur amended and restated articles of incorporation and our amended and restated bylaws, as well as Arizona law contain provisions that may have the effect of deterring takeovers or delaying or preventing a change in control of us or changes in our management that a shareholder might deem to be in his or her best interest. Our amended and restated articles of incorporation and amended and restated bylaws contain provisions that:\nauthorize blank check preferred stock, which could be issued by our Board of Directors without shareholder approval and may contain voting, liquidation, dividend and other rights superior to our common stock;\nspecify that special meetings of our shareholders can be called only by our Board of Directors, the Chairperson of our Board of Directors, our Chief Executive Officer, or a majority of the Board of Directors;\nprovide that vacancies on our Board of Directors may be filled only by a majority of directors then in office, though not less than a quorum;\nspecify that only our Board of Directors may change the size of our Board of Directors;\nestablish an advance notice procedure for shareholder proposals to be brought before an annual meeting of our shareholders, including proposed nominations of persons for election to our Board of Directors; and\nexpressly authorize our Board of Directors to modify, alter or repeal our bylaws.\nThese provisions, alone or together, could delay or prevent hostile takeovers and changes in control or changes in our management or our Board of Directors.\nIn addition, because we are incorporated in the State of Arizona, we are governed by the provisions of the Arizona Revised Statutes Section 10-274, which prohibits certain business combinations between us and certain interested shareholders unless specified conditions are met. These provisions may also have the effect of delaying or preventing a change in control of Amtech.\nAny provision of our amended and restated articles of incorporation or amended and restated bylaws or Arizona law that has the effect of delaying or deterring a change in control could limit the opportunity for our shareholders to receive a premium for their shares of our common stock, and could also affect the price that some investors are willing to pay for our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe believe that our properties are adequate for our current needs. In addition, we believe that adequate space can be obtained to meet our foreseeable business needs. The following chart identifies the principal properties which we own or lease.\nLocation\nUse\nOwn or Lease\nSize\nCorporate\nTempe, Arizona\nCorporate Headquarters\nOwn\n15,000 sf\nSemiconductor Segment\nNorth Billerica, Massachusetts\nOffice, Mfg. & Warehouse\nLease\n150,000 sf\nAshvale, Surrey, United Kingdom\nOffice\nLease\n1,900 sf\nShanghai, China\nOffice, Mfg. & Warehouse\nLease\n76,530 sf\nPenang, Malaysia\nOffice\nLease\n1,570 sf\nMaterial and Substrate Segment\nCarlisle, Pennsylvania\nOffice & Mfg.\nLease\n40,500 sf\nBethel, Connecticut\nOffice & Mfg.\nLease\n18,830 sf ITEM 3. LEGAL PROCEEDINGS\nAmtech and its subsidiaries are defendants from time to time in actions for matters arising out of their business operations. We do not believe that any matters or proceedings presently pending will have a material adverse effect on our consolidated financial position, results of operations or liquidity. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET INFORMATION\nOur common stock, par value $0.01 per share (Common Stock), is trading on the NASDAQ Global Select Market, under the symbol ASYS. The stock price details can be obtained from the Nasdaq website at www.nasdaq.com.\nISSUER PURCHASES OF EQUITY SECURITIES\nShare Repurchase Programs\nOn February 10, 2022, the Board approved a stock repurchase program, pursuant to which we may repurchase up to $5 million of our outstanding Common Stock over a one-year period, commencing on February 16, 2022. Repurchases under the program will be made in open market transactions at prevailing market prices, in privately negotiated transactions, or by other means in compliance with the rules and regulations of the SEC; however, we have no obligation to repurchase shares and the timing, actual number, and value of shares to be repurchased is subject to managements discretion and will depend on our stock price and other market conditions. We may, in the sole discretion of the Board, terminate the repurchase program at any time while it is in effect. Repurchased shares may be retired or kept in treasury for further issuance. During the year ended September 30, 2022, we repurchased 143,430 shares of our Common Stock on the open market at a total cost of approximately $1.4 million (an average price of $9.78 per share). All repurchased shares have been retired.\nOn February 9, 2021, the Board approved a stock repurchase program, pursuant to which we may repurchase up to $4 million of our outstanding Common Stock over a one-year period, commencing on February 16, 2021. Repurchases under the program were to be made in open market transactions at prevailing market prices, in privately negotiated transactions, or by other means in compliance with the rules and regulations of the SEC; however, we had no obligation to repurchase shares and the timing, actual number, and value of shares to be repurchased was subject to managements discretion and depended on our stock price and other market conditions. We could have, in the sole discretion of the Board, terminated the repurchase program at any time while it was in effect. Repurchased shares were to be retired or kept in treasury for further issuance. During the quarter ended December 31, 2021, we repurchased 291,383 shares of our Common Stock on the open market at a total cost of approximately $2.7 million (an average price of $9.31 per share). All repurchased shares have been retired. The term of this repurchase program expired during the quarter ended March 31, 2022.\nDuring the three months ended September 30, 2022, we did not repurchase any of our equity securities nor did we sell any equity securities that were not registered under the Securities Act of 1933, as amended. As of September 30, 2022, $3.6 million remains available for repurchases.\nHOLDERS\nAs of November 9, 2022, there were 319 shareholders of record of our Common Stock. Based upon a recent survey of brokers, we estimate there were approximately an additional 6,889 beneficial shareholders who held shares in brokerage or other investment accounts as of that date.\nDIVIDENDS\nWe have never paid dividends on our Common Stock. Our present policy is to apply cash to investments in product development and upgrades, acquisitions or expansion; consequently, we do not expect to pay dividends on our Common Stock in the foreseeable future. However, once the above priorities have been met, we will evaluate the returning of capital to shareholders, as we have done in the past.\nUNREGISTERED SALES OF EQUITY SECURITIES\nThere were no unregistered sales of equity securities in fiscal 2022.\nCOMPARISON OF STOCK PERFORMANCE\nThe following line graph and related information shall not be deemed soliciting material or filed with the SEC, nor shall such information be incorporated by reference into any future filings under the Securities Act of 1933 or the Exchange Act, each as amended, except to the extent that we specifically incorporated by reference it into such filing.\nThe following line graph compares cumulative total shareholder return, assuming reinvestment of dividends, for our Common Stock, the NASDAQ Composite Index and the NASDAQ Industrial Index. Because we did not pay dividends on our Common Stock during the measurement period, the calculation of the cumulative total shareholder return on our Common Stock did not include dividends. The following graph assumes that $100 was invested on October 1, 2017. ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read together with our Consolidated Financial Statements and the accompanying notes included in \"Item 8. Financial Statements and Supplementary Data in this Annual Report on Form 10-K. This discussion contains forward-looking statements, which involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of certain factors including, but not limited to, those described in Risk Factors and elsewhere in this Annual Report on Form 10-K. Please refer to page 5 for further information regarding forward-looking statements and Item 1A. Risk Factors for a description of our risk factors.\nOverview\nWe are a leading, global manufacturer of capital equipment, including thermal processing and wafer polishing and related consumables used in fabricating semiconductor devices, such as silicon carbide (\"SiC\") and silicon power devices, analog and discrete devices, electronic assemblies, and light-emitting diodes (\"LEDs\"). We sell these products to semiconductor device and module manufacturers worldwide, particularly in Asia, North America and Europe.\nWe operate in two reportable segments, based primarily on the industries they serve: (i) Semiconductor and (ii) Material and Substrate. In our Semiconductor segment, we supply thermal processing equipment, including solder reflow ovens, horizontal diffusion furnaces, and custom high-temp belt furnaces for use by semiconductor, electronics and electro/mechanical assembly manufacturers. Our semiconductor customers are primarily manufacturers of integrated circuits and optoelectronic sensors and discrete (\"O-S-D\") components used in analog, power and radio frequency (\"RF\"). In our Material and Substrate segment, we produce substrate consumables, chemicals and machinery for lapping (fine abrading) and polishing of materials, such as silicon wafers for semiconductor products, sapphire wafers for LED applications, and compound substrates, like silicon carbide wafers, for power device applications.\nThe semiconductor industry is cyclical, but not seasonal, and historically has experienced fluctuations. Our revenue is impacted by these broad industry trends.\nStrategy\nWe continue to focus on our plans to profitably grow our business and have developed a strategic growth plan and a capital allocation plan that we believe will support our growth objectives. Our Power Semiconductor strategic growth plan leverages our experience, products and capabilities in pursuit of growth, profitability and sustainability. Our core focus areas are:\nEmerging opportunities in the SiC industry - We believe we are well-positioned to take part in this significant growth area, specifically as it relates to silicon carbide wafer capacity expansion. We are working closely with our customers to understand their SiC growth plans, needs and opportunities. We are investing in our capacity, next generation product development, and in our people. During 2021, we completed the acquisition of Intersurface Dynamics, which added numerous coolants and chemical products to our existing consumable and machine product lines. We believe these investments will help fuel our growth in the emerging growth SiC industry.\n300mm Horizontal Diffusion Furnace - We have a highly successful and proven 300mm horizontal diffusion furnace solution used for power semiconductor device manufacturing applications. We have a strong foundation with the leading 300mm power chip manufacturer, and, in the last three years, we have received 23 orders from top-tier customers. We believe we have a strong opportunity to continue expanding our customer base and grow revenue with our 300mm solution.\nAs the largest revenue contributor to our organization, we expect our subsidiary, BTU, will continue to track semiconductor industry growth cycles for our advanced semi-packaging and SMT products, in addition to specialized custom belt furnaces used in automotive and other specialized industrial applications. We believe that our investments in product innovation will provide BTU with opportunities\nto grow further, especially in high growth applications of consumer and industrial electronics, IoT, electric vehicles and 5G communications.\nWe anticipate future investments will be required to meet the expected demand from our growing served markets to achieve our revenue growth targets, including investments in research and development as well as capital expenditures, which also includes further investments in capacity expansion, talent, and management information systems. In June 2022, we completed the sale of the real property where our manufacturing facility in Massachusetts is located. In connection with this sale, we entered into a two-year leaseback of the facility. This sale-leaseback transaction resulted in a net cash inflow of approximately $14.9 million, after repayment of the existing mortgage and settlement of related sale expenses. During the two-year leaseback period, we will conduct a search for a new manufacturing facility more in line with the needs of our Semiconductor product lines. In the fourth quarter of 2021, we completed the move of our Shanghai facility to a new location. This new location increases our capacity and allows us to streamline our manufacturing processes, thus reducing our lead times. In addition, we are evaluating our management information systems and needs in order to allow for greater efficiencies and to ensure our infrastructure can support our future growth plans. As a capital equipment manufacturer, we will continue to invest in our business to drive future growth.\nIn addition to investments in our organic growth, another key aspect of our capital allocation policy is our plan to grow through acquisitions. We have the expertise and track record to identify complimentary and synergistic acquisition targets in the Semiconductor and SiC growth environments and to execute transactions and integrations to provide for value creating, profitable growth in both the short-term and long-term. On March 3, 2021, we acquired Intersurface Dynamics, a Connecticut-based manufacturer of substrate process chemicals used in various manufacturing processes, including semiconductors, silicon and compound semiconductor wafers, and optics. As of the date of the filing of this Annual Report on Form 10-K, we do not have an agreement to acquire any acquisition target.\nCybersecurity Incident\nOn April 12, 2021, we detected a data incident in which attackers acquired data and disabled some of the technology systems used by one of our subsidiaries. Upon learning of the incident, we immediately engaged external counsel and retained a team of third-party forensic, incident response, and security professionals to investigate and determine the full scope of this incident. We also notified law enforcement officials and confirmed that the incident is covered by our insurance. We have completed the investigation of the data incident with assistance from our outside professionals, and indications were that the unauthorized third-party gained access to certain personal information relating to employees and their beneficiaries for some of our operations. There was no indication of any misuse of this information.\nDespite this disruption, production continued in our facilities. Our previously disabled subsidiary network is now back up and running securely. Working alongside our security professionals, we were able to bring our subsidiarys systems online with enhanced security controls. We have deployed an advanced next generation anti-virus and endpoint detection and response tool, as well as Managed Detection & Response services. We remain committed to protecting the security of the personal information entrusted to us and providing high-quality products and service to our customers.\nWe recorded approximately $1.1 million of expense in 2021 related to this incident, which is included in selling, general and administrative expenses. The expense is primarily related to third-party service providers, including security professionals as well as legal and response teams. We may make additional investments in the future to further strengthen our cybersecurity. We filed an insurance claim during the fourth quarter of fiscal 2021 related to the incident. During the second quarter of 2022, we signed a final settlement agreement with our insurer resulting in total reimbursement of approximately $0.6 million, which included $0.4 million received during the quarter ended December 31, 2021 and $0.2 million received during the quarter ended March 31, 2022. No portion of the reimbursement remains outstanding as of September 30, 2022.\nCOVID-19\nIn March 2020, the outbreak of COVID-19 was recognized as a pandemic by the World Health Organization, and the outbreak became increasingly widespread, including in all of the markets in which we operate. We continue to monitor\nthe impact of COVID-19 on all aspects of our business. We are a company operating in a critical infrastructure industry, as defined by the U.S. Department of Homeland Security. Consistent with federal guidelines and with foreign government, state and local orders to date, we have continued to operate across our footprint throughout the COVID-19 pandemic. Following the onset of COVID-19 and its negative effects on our business, most prominently reflected in our second, third and fourth quarter fiscal 2020 results, global economic conditions improved during fiscal 2021, resulting in increased demand for our products and services, which led to our earnings for fiscal 2021 substantially exceeding our fiscal 2020 results. There remain many unknowns and we continue to monitor the expected trends and related demand for our products and services and have and will continue to adjust our operations accordingly. Please see additional information in Item 1A. Risk Factors.\nOn March 28, 2022, the Chinese government issued a mandatory shutdown in Shanghai, the location of one of our manufacturing facilities. The factory was allowed to partially reopen in May 2022 and fully reopened on June 1, 2022. After the reopening on June 1, 2022, the factory was able to operate near full capacity for the entire month of June. We were able to make up the shipments missed in the fourth quarter and are now operating at normal capacity levels. Given the uncertainty surrounding the COVID-19 pandemic, there can be no assurance that our Shanghai facility will be allowed to remain open on a consistent basis.\nSegment Reporting Changes\nUpon the acquisition of Intersurface Dynamics in the second quarter of 2021, we evaluated our organizational structure and concluded that we have two reportable segments following the acquisition. Our Material and Substrate segment includes our former SiC/LED segment in addition to Intersurface Dynamics beginning at the date of acquisition.\nIndustry Fluctuations\nOur quarterly and annual operating results have been and will continue to be impacted by the timing of large system orders. Further, the semiconductor equipment industry is highly cyclical, and the conditions of this industry remain volatile. Therefore, our order flow fluctuates quarter to quarter. For additional information regarding the risks related to our business and industry, please refer to \"Item 1A. Risk Factors\" within this Form 10-K.\nFiscal Year\nOur fiscal year is from October 1 to September 30. Unless otherwise stated, references to the years 2022, 2021 and 2020 relate to the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nResults of Operations\nThe following table sets forth certain financial data as a percentage of net revenue for the periods indicated:\nYears Ended September 30,\nNet revenue\n%\n%\nCost of sales\n%\n%\nGross margin\n%\n%\nSelling, general and administrative\n%\n%\nResearch, development and engineering\n%\n%\nGain on sale of fixed assets\n(12\n%)\n-\n%\nOperating income\n%\n%\nInterest income (expense) and other, net\n%\n(1\n%)\nIncome before income taxes\n%\n%\nIncome tax provision\n%\n%\nNet income\n%\n%\nFiscal 2022 compared to Fiscal 2021\nNet Revenue\nNet revenue consists of revenue recognized upon shipment or delivery of equipment. Spare parts sales are recognized upon shipment and service revenue is recognized upon completion of the service activity, which is generally ratable over the term of the service contract. Since the majority of our revenue is generated from large system sales, revenue, gross profit and operating income can be significantly impacted by the timing of system shipments. See Critical Accounting Policies - Revenue Recognition included in Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\"\nOur net revenue by reportable segment for the years ended September 30, 2022 and 2021 were as follows, dollars in thousands:\nYears Ended September 30,\nIncrease\nSegment\n(Decrease)\n% Change\nSemiconductor\n$\n87,982\n$\n72,086\n$\n15,896\n%\nMaterial and Substrate\n18,316\n13,119\n5,197\n%\nTotal net revenue\n$\n106,298\n$\n85,205\n$\n21,093\n%\nNet revenue for the years ended September 30, 2022 and 2021 were $106.3 million and $85.2 million, respectively, an increase of $21.1 million or 25%. Revenue from the Semiconductor segment increased $15.9 million, or 22%, over the prior year period. Our Semiconductor results for 2022 reflect the closure of our Shanghai manufacturing facility, which partially reopened in mid-May and fully reopened on June 1, 2022. The Shanghai facility was able to return to normal capacity during the fourth quarter of fiscal 2022, however, the order trends in the overall market have slowed since the April 2022 shutdown. Revenue from our Material and Substrate segment increased $5.2 million, or 40%, due to increased shipments of consumables resulting from capacity expansion and production increases by our customers.\nOrders and Backlog\nNew orders booked in the years ended September 30, 2022 and 2021 were as follows, dollars in thousands:\nYears Ended September 30,\nIncrease\nSegment\n(Decrease)\n% Change\nSemiconductor\n$\n94,268\n$\n101,988\n$\n(7,720\n)\n(8\n)%\nMaterial and Substrate\n19,685\n13,456\n6,229\n%\nTotal new orders\n$\n113,953\n$\n115,444\n$\n(1,491\n)\n(1\n)%\nOur backlog as of September 30, 2022 and 2021 was as follows, dollars in thousands:\nSegment\nSeptember 30,\nSeptember 30,\nIncrease\n(Decrease)\n% Change\nSemiconductor\n$\n48,011\n$\n42,743\n$\n5,268\n%\nMaterial and Substrate\n2,769\n1,400\n1,369\n%\nTotal backlog\n$\n50,780\n$\n44,143\n$\n6,637\n%\nAt the end of 2022, three customers individually accounted for 21%, 17% and 14% of our total backlog. No other customer accounted for more than 10% of our backlog as of September 30, 2022. The orders included in our backlog are generally credit approved customer purchase orders believed to be firm and are generally expected to ship within the next twelve months. Because our orders are typically subject to cancellation or delay by the customer, our backlog at any particular point in time is not necessarily representative of actual sales for succeeding periods, nor is backlog any assurance that we will realize profit from completing these orders.\nGross Profit and Gross Margin\nGross profit is the difference between net revenue and cost of goods sold. Cost of goods sold consists of purchased material, labor and overhead to manufacture equipment and spare parts and the cost of service and support to customers for installation, warranty and paid service calls. Gross margin is gross profit as a percent of net revenue. Our gross profit and gross margin by reportable segment for the years ended September 30, 2022 and 2021 were as follows, dollars in thousands:\nYears Ended September 30,\nSegment\nGross\nMargin\nGross\nMargin\nIncrease\n(Decrease)\n% Change\nSemiconductor\n$\n30,880\n%\n$\n30,336\n%\n$\n%\nMaterial and Substrate\n8,631\n%\n4,194\n%\n4,437\n%\nTotal gross profit\n$\n39,511\n%\n$\n34,530\n%\n$\n4,981\n%\nGross profit for the years ended September 30, 2022 and 2021 was $39.5 million and $34.5 million, respectively, representing an increase of $5.0 million, or 14%. Gross margin for 2022 and 2021 was 37% and 41%, respectively. Gross margin for the Semiconductor segment decreased to 35% in 2022, compared to 42% in 2021, due primarily to the above-mentioned closure of our Shanghai manufacturing facility. This closure resulted in decreased utilization during the closure period as we continued to pay our employees while ceasing production entirely for the first eight weeks of the third quarter of fiscal 2022. Additionally, Semiconductor material costs increased approximately 39% over the 2021 period due to product mix changes and rising prices. We continue to take steps to manage our inventory price risk, including purchasing long lead-time items in advance and onboarding additional source suppliers. In the Material and Substrate segment, gross margin increased to 47% in 2022, compared to 32% in 2021 due primarily to improved capacity utilization resulting from higher consumable sales and the usage of previously reserved inventory slightly offset by increased material costs.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses (SG&A) consists of the cost of employees, consultants and contractors, facility costs, sales commissions, shipping costs, promotional marketing expenses, legal and accounting expenses and bad debt expense.\nTotal SG&A expenses for the years ended September 30, 2022 and 2021 were $28.3 million and $24.7 million, respectively, representing an increase of $3.6 million or 14.4%. This increase was primarily due to increases of $2.1 million in employee-related expenses and $1.6 million in freight expenses, driven by higher revenues and increased shipping rates. SG&A expense includes $0.5 million and $0.4 million of non-cash stock-based compensation expense for 2022 and 2021, respectively.\nGain on Sale of Fixed Assets\nGain on sale of fixed assets consists primarily of the gain on the sale of BTU's building in Massachusetts. The sale price was $20.6 million, of which $0.7 million was deducted at closing for commission and other closing expenses. In connection with the sale, BTU recognized a pre-tax gain on sale of $12.5 million.\nResearch, Development and Engineering\nResearch, development and engineering (RD&E) expenses consist of the cost of employees, consultants and contractors who design, engineer and develop new products and processes as well as materials and supplies used in producing prototypes. RD&E expenses may vary from period to period depending on the engineering projects in process. Expenses related to engineers working on strategic projects or sustaining engineering projects are recorded in RD&E. However, from time to time we add functionality to our products or develop new products during engineering and manufacturing to fulfill specifications in a customers order, in which case the cost of development, along with other costs of the order, are charged to cost of goods sold. Occasionally, we receive reimbursements through governmental research and development grants which are netted against these expenses when certain conditions have been met.\nRD&E expenses, net of grants earned, for the years ended September 30, 2022 and 2021 were $6.4 million and $6.0 million, respectively, an increase of $0.4 million. This increase is due to the timing of purchases related to specific strategic-development projects at our Semiconductor segment. We expect most of these strategic projects to be completed throughout fiscal 2023, resulting in new or updated product offerings in fiscal 2023 and 2024. Grants earned are immaterial in all periods presented.\nRestructuring Charges\nWe recorded restructuring charges of $0.1 million in 2021. These one-time charges relate to staff reductions in our Semiconductor and Material and Substrate operations.\nIncome Taxes\nOur effective tax rate was 7.5% and 56.1% in 2022 and 2021, respectively. The effective tax rate is the ratio of total income tax expense to pre-tax income. The effective tax rates for 2022 and 2021 were lower and higher than the U.S. statutory rate, respectively. The 2022 effective tax rate was lower than the statutory rate due to a substantial portion of the earnings in the US resulting from the gain on the sale of our Massachusetts property for which no tax expense was recognized due to the utilization of net operating losses and foreign tax credits, which are fully valued. The 2021 effective tax rate was higher than the statutory rate due primarily to higher taxes on income in foreign jurisdictions, state income taxes and domestic losses for which no tax benefit was recorded.\nIn 2022 and 2021, we recorded income tax expense of $1.4 million and $1.9 million, respectively. The income tax provisions are based upon estimates of annual income, annual permanent differences, statutory tax rates and credits in the various jurisdictions in which we operate. Significant judgments and estimates are required in the determination of the consolidated income tax expense.\nDeferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements, which will result in taxable or deductible amounts in the future. U.S. GAAP requires that a valuation allowance be established when it is more likely than not that all or a portion of deferred tax assets will not be realized. A review of all available positive and negative evidence needs to be considered, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax-planning strategies and results of recent operations. According to those principles, it is difficult to conclude that a valuation allowance is not needed when the negative evidence includes cumulative losses in recent years. Based on the consideration of all available evidence, we have concluded that we will maintain a full valuation allowance for all U.S. net deferred tax assets and a portion of foreign deferred tax assets. We will continue to monitor our cumulative income and loss positions in the U.S. and foreign jurisdictions to determine whether valuation allowances on deferred tax assets are appropriate. We expect to pay minimal U.S federal cash taxes for the foreseeable future as a result of our U.S. net operating losses that are carried forward.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across our global operations. ASC 740 states that a tax benefit from an uncertain tax position may be recognized when it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes, on the basis of the technical merits. We currently have $1.0 million of unrecognized tax benefits recorded within our financial statements. We record unrecognized tax benefits as liabilities in accordance with ASC 740 and adjust these liabilities when our judgment changes as a result of the evaluation of new information not previously available.\nOur future effective income tax rate depends on various factors, such as the amount of income (loss) in each tax jurisdiction, tax regulations governing each region, non-deductible expenses incurred as a percent of pre-tax income and the effectiveness of our tax planning strategies.\nSelected Quarterly Data (Unaudited)\nThe following table sets forth selected unaudited consolidated quarterly financial information for the years ended September 30, 2022 and 2021, in thousands, except percentages and per share amounts:\nFiscal Year 2022\nFirst\nQuarter\nSecond\nQuarter\nThird\nQuarter\nFourth\nQuarter\nRevenue, net\n$\n26,463\n$\n27,556\n$\n19,964\n$\n32,315\nCost of sales\n16,565\n16,396\n14,064\n19,762\nGross profit\n9,898\n11,160\n5,900\n12,553\nSelling, general and administrative\n7,086\n6,765\n7,157\n7,292\nResearch, development and engineering\n1,572\n1,800\n1,646\n1,372\nGain on sale of fixed assets\n-\n-\n(12,465\n)\n-\nOperating income\n1,240\n2,595\n9,562\n3,889\nInterest (expense) income and other, net\n(83\n)\nIncome before income taxes\n1,157\n2,625\n10,242\n4,761\nIncome tax provision\nNet income\n$\n$\n1,965\n$\n10,222\n$\n4,183\nGross margin\n37.4\n%\n40.5\n%\n29.6\n%\n38.8\n%\nOperating margin\n4.7\n%\n9.4\n%\n47.9\n%\n12.0\n%\nIncome Per Share:\nNet income per basic share\n$\n0.07\n$\n0.14\n$\n0.74\n$\n0.30\nWeighted average shares outstanding - basic\n14,254\n13,979\n13,889\n13,933\nNet income per diluted share\n$\n0.07\n$\n0.14\n$\n0.73\n$\n0.30\nWeighted average shares outstanding - diluted\n14,485\n14,144\n14,026\n14,080\nFiscal Year 2021\nFirst\nQuarter\nSecond\nQuarter\nThird\nQuarter\nFourth\nQuarter\nRevenue, net\n$\n17,975\n$\n19,790\n$\n23,100\n$\n24,340\nCost of sales\n10,463\n12,062\n13,021\n15,129\nGross profit\n7,512\n7,728\n10,079\n9,211\nSelling, general and administrative\n5,213\n5,688\n7,281\n6,558\nResearch, development and engineering\n1,245\n1,869\n1,523\n1,342\nRestructuring charges\n-\n-\nOperating income\n1,054\n1,204\n1,296\nInterest (expense) income and other, net\n(255\n)\n(155\n)\nIncome before income taxes\n1,049\n1,342\nIncome tax provision\nNet income (loss)\n$\n$\n(246\n)\n$\n$\nGross margin\n41.8\n%\n39.1\n%\n43.6\n%\n37.8\n%\nOperating margin\n5.9\n%\n0.9\n%\n5.2\n%\n5.3\n%\nIncome (Loss) Per Share:\nNet income (loss) per basic share\n$\n0.05\n$\n(0.02\n)\n$\n0.03\n$\n0.05\nWeighted average shares outstanding - basic\n14,072\n14,151\n14,176\n14,190\nNet income (loss) per diluted share\n$\n0.05\n$\n(0.02\n)\n$\n0.03\n$\n0.05\nWeighted average shares outstanding - diluted\n14,117\n14,151\n14,373\n14,387\nLiquidity and Capital Resources\nLiquidity\nWe maintain a strong focus on liquidity and define our liquidity risk tolerance based on sources and uses to maintain a sufficient liquidity position to meet our obligations through our industry cycles, under both normal and stressed\nconditions. We manage our liquidity to provide access to sufficient funding to meet our business needs and financial obligations throughout business cycles. We operate in the semiconductor capital equipment industry, which is cyclical, and we must ensure we have sufficient liquidity during the down cycles and varying macroeconomic conditions. Our liquidity plans are established within the context of our financial and strategic planning processes and consider the liquidity necessary to fund our operating commitments, which include purchase obligations for inventory and equipment, payroll and general expenses. We also take into consideration our capital allocation and growth objectives, including investing in research and development and capital expenditures (including capacity assessments and IT systems).\nThe success of our growth strategy is dependent upon the availability of additional capital resources on terms satisfactory to management. Our sources of capital in the past have included the sale of equity securities, which includes common stock sold in private transactions and public offerings, and cash generated from operations. There can be no assurance that we can raise such additional capital resources when needed or on satisfactory terms. We believe that our principal sources of liquidity discussed above are sufficient to support operations for at least the next twelve months.\nCapital Allocation\nOur capital allocation strategy focuses on building shareholder value. We do this by first investing in ourselves and growing our capabilities. We then look to supplement and strengthen our capabilities through acquisitions and strategic investments. And finally, we provide the return realized by the investments to our stockholders. These three priorities are detailed as follows:\nInvest in R&D and capital expenditures to strengthen our competitive position. Historically, our R&D efforts have focused on upgrades to existing product platforms as well as new product designs. Capital expenditures consist primarily of capacity expansion as well as investments in IT systems.\nInvest in strategic acquisitions that will complement our strong platform of product offerings. In evaluating these opportunities, our objectives include enhancing our earnings and cash flows, adding complementary product offerings, expanding our geographic footprint, improving our production efficiency and expanding our customer base. As a result, we continue to manage our balance sheet to maintain adequate liquidity so that we may react quickly as opportunities arise.\nOnce the above priorities have been met, we evaluate the return of capital to shareholders, as we have done in the past. We have never paid dividends on our common stock, and we do not expect to pay dividends on common stock in the foreseeable future. However, our Board has authorized annual stock repurchase plans since 2018.\nCash and Cash Flow\nThe following table sets forth for the periods presented certain consolidated cash flow information, in thousands:\nYears Ended September 30,\nNet cash provided by (used in) operating activities\n$\n5,204\n$\n(5,962\n)\n$\n(1,664\n)\nNet cash provided by (used in) investing activities\n$\n18,773\n$\n(8,094\n)\n$\n(12,616\n)\nNet cash (used in) provided by financing activities\n$\n(8,267\n)\n$\n1,166\n$\n(1,502\n)\nEffect of exchange rate changes on cash\n$\n(1,672\n)\n$\n$\n1,718\nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n14,038\n$\n(12,234\n)\n$\n(14,064\n)\nCash, cash equivalents and restricted cash, beginning of year*\n$\n32,836\n$\n45,070\n$\n59,134\nCash, cash equivalents and restricted cash, end of year\n$\n46,874\n$\n32,836\n$\n45,070\n*\tIncludes Cash, Cash Equivalents and Restricted Cash that are included in Held-For-Sale Assets on the Consolidated Balance Sheets for periods prior to January 22, 2020.\nAs of September 30, 2022 and 2021, cash and cash equivalents were $46.9 million and $32.8 million, respectively. We had no restricted cash at September 30, 2022 and 2021. Our working capital was $80.3 million as of September 30, 2022 and $65.8 million as of September 30, 2021. Our ratio of current assets to current liabilities was 4.5:1 as of September 30, 2022, and 5.4:1 as of September 30, 2021.\nDuring periods of weakening demand, we typically generate cash from operating activities. Conversely, we are more likely to use operating cash flows for working capital requirements during periods of higher growth. The $14.0 million increase in consolidated cash during 2022 was primarily due to increases in cash from the sale of our Massachusetts property as well as customer deposits received in 2022 for upcoming shipments in 2023, partially offset by cash used to repay long-term debt and cash used to repurchase stock. We maintain cash accounts denominated in currencies other than our reporting currency, which expose us to foreign exchange rate fluctuations.\nCash Flows from Operating Activities\nCash provided by operating activities was $5.2 million in 2022 compared to cash used in operating activities of $6.0 million in 2021 and cash used in operating activities of $1.7 million in 2020. During 2022, we received several large customer deposits, primarily related to orders of our horizontal diffusion and high temp furnaces, which are expected to ship over the next four quarters. During 2021, we increased our inventory balances in preparation for shipments scheduled for the first half of fiscal 2022. Additionally, our accounts receivable increased during this period as most of our shipments occurred late in the fourth quarter and our customers generally have payment terms of 60-90 days. During 2020, we increased our inventory balances to mitigate risks in our supply chain resulting from the COVID-19 pandemic, as well as in preparation for a large shipment that occurred in the first quarter of fiscal 2021.\nCash Flows from Investing Activities\nCash provided by investing activities was $18.8 million in 2022, primarily consisting of $19.9 million in proceeds from the sale of our real property in Massachusetts. Cash used in investing activities was $8.1 million in 2021, primarily consisting of $5.1 million net cash paid for the acquisition of Intersurface Dynamics and capital expenditures primarily related to the relocation of our Shanghai manufacturing facility. Cash used in investing activities was $12.6 million in 2020, primarily related to the divestiture of our solar businesses and capital expenditures for our new Material and Substrate building in Pennsylvania. Investing activities in 2022, 2021 and 2020 included capital expenditures of $1.1 million, $3.0 million and $2.7 million, respectively. We expect capital expenditures to increase in 2023 as we make targeted investments in our production capacity and IT systems.\nCash Flows from Financing Activities\nIn 2022, cash used in financing activities was $8.3 million, comprised of $4.1 million of cash used for the repurchase of common stock and payments on long-term debt of $4.9 million, partially offset by $0.7 million of proceeds received from the exercise of stock options. Payments in long-term debt include the full repayment of the $4.5 million mortgage balance on the real property in Massachusetts. In 2021, cash provided by financing activities was $1.2 million, consisting of approximately $1.5 million of proceeds received from the exercise of stock options, partially offset by payments on long-term debt of $0.4 million. In 2020, cash used in financing activities was $1.5 million, consisting of $0.9 million of proceeds received from the exercise of stock options, which was fully offset by $2.0 million used for stock repurchases and payments on long-term debt of $0.4 million.\nOff-Balance Sheet Arrangements\nAs of September 30, 2022, we had no off-balance sheet arrangements as defined in Item 303(a)(4) of Regulation S-K promulgated by the SEC that have or are reasonably likely to have a current or future effect on financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nContractual Obligations and Commercial Commitments\nWe had the following contractual obligations and commercial commitments as of September 30, 2022, in thousands:\nContractual obligations\nTotal\nLess than\n1 year\n1-3 years\n3-5 years\nMore than\n5 years\nDebt obligations\n$\n$\n$\n$\n$\n-\nLease obligations:\nBuildings\n15,110\n2,513\n3,100\n1,634\n7,863\nOffice equipment\n-\n-\nVehicles\n-\n-\nTotal operating lease obligations\n15,146\n2,535\n3,114\n1,634\n7,863\nPurchase obligations\n19,975\n19,929\n-\n-\nTotal\n$\n35,473\n$\n22,583\n$\n3,312\n$\n1,715\n$\n7,863\nAcquisitions\nOur business strategy includes the possible acquisition of or investments in other businesses to expand or complement our operations. The magnitude, timing and nature of any future acquisitions or investments will depend on a number of factors, including the availability of suitable candidates, the negotiation of acceptable terms, our financial capabilities and general economic and business conditions. Financing for future transactions would result in the utilization of cash, incurrence of additional debt, issuance of stock or some combination of the foregoing.\nCritical Accounting Policies\nSee Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations for a discussion of our consolidated financial statements that have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the consolidated financial statements, the disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period.\nOn an on-going basis, we evaluate our estimates and judgments, including those related to revenue recognition, income taxes, inventory valuation, and goodwill. We base our estimates and judgments on historical experience, expectations regarding the future and on various other factors that we believe to be reasonable under the circumstances. The results of these estimates and judgments form the basis for making conclusions about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nA critical accounting policy is one that is both important to the presentation of our financial position and results of operations, and requires managements most difficult, subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain. These uncertainties are discussed in Item 1A. Risk Factors. We believe the following critical accounting policies encompass the more significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenue Recognition. We recognize revenue when a customer obtains control of promised goods or services in an amount that reflects the consideration we expect to receive in exchange for those goods or services. A performance obligation is a promise in a contract to transfer a product or service to the customer. The transaction price of a contract is allocated to each distinct performance obligation based upon the relative standalone selling price for each performance obligation and is recognized as revenue upon satisfaction of the performance obligation, either at a point in time or over time.\nEquipment and related product revenues (e.g., furnace systems, system add-ons, machinery, consumables and spare parts) are recognized at a point in time, when they are shipped or delivered, depending on contractual terms.\nRevenue is recorded net of customer discounts or rebates, if any. Assurance-type warranties are not considered a performance obligation.\nOccasionally, our customers earn a commission on the purchase and/or resale of our products. These payments to customers are recorded as a reduction of revenue and are less than 5% of our total revenues in all periods presented.\nIn substantially all of our sales transactions, we incur incremental costs to obtain contracts with customers, in the form of sales commissions. We maintain a commission program which rewards our sales representatives for system sales and our employees for system sales and other individual goals. We have elected a practical expedient to allow for the recognition of commission expense when incurred if the amortization period of the asset that the entity otherwise would have recognized is one year or less. Based on the nature of our contracts with customers, we expense all commissions as incurred based upon the expectation that the amortization period would be one year or less.\nIncome Taxes. We file consolidated federal income tax returns in the United States for all subsidiaries except those in China and the UK, where separate returns are filed. The calculation of tax liabilities for all jurisdictions involves significant judgment in identifying uncertain tax positions, estimating the amount of deferred tax assets that will be realized in the future and the impact of uncertainties in the application of complex tax laws. Resolution of these uncertainties in a manner inconsistent with our expectations could have a material impact on our operations and financial condition.\nDeferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements, which will result in taxable or deductible amounts in the future. We record a valuation allowance to reduce our deferred tax assets to the amount that is more likely than not to be realized. In evaluating our ability to recover our deferred tax assets in the jurisdiction from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax-planning strategies and results of recent operations. It is difficult to conclude that a valuation allowance is not needed when the negative evidence includes cumulative losses in recent years. If we were to determine that it is more likely than not that we would not be able to realize all or part of our net deferred tax assets in the future, an adjustment to the deferred tax assets would be charged to earnings in the period such determination is made. Likewise, if we later determine that it is more likely than not that all or part of the net deferred tax assets would be realized, a tax benefit would be realized when all or part of the previously provided valuation allowance would be reversed. As of September 30, 2022, we have significant U.S. deferred tax assets that have a full valuation allowance and foreign deferred tax assets that have a partial valuation allowance. Any changes to the judgments related to our valuation allowance could have a material impact on our results of operations.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across our global operations. ASC 740 states that a tax benefit from an uncertain tax position may be recognized when it is more likely than not that the position will be sustained upon examination, including resolutions of any related appeals or litigation processes, on the basis of the technical merits. We currently have $1.0 million of unrecognized tax benefits recorded within our financial statements. We record unrecognized tax benefits as liabilities in accordance with ASC 740 and adjust these liabilities when our judgment changes as a result of the evaluation of new information not previously available.\nInventory Valuation. We value our inventory at the lower of cost or net realizable value. Inventory cost includes the purchase price of parts or finished goods and freight and/or other overhead costs incurred to receive the inventory into our manufacturing facilities. We regularly review inventory quantities and record a write-down to net realizable value for excess and obsolete inventory. The write-down is primarily based on historical inventory usage adjusted for expected changes in product demand and production requirements. Our industry is characterized by customers in highly-cyclical industries, rapid technological changes, frequent new product developments and rapid product obsolescence. Changes in demand for our products could result in further write-downs.\nGoodwill. We perform an annual impairment test as of September 30, or more frequently if indicators of potential impairment exist, to determine whether the fair value of a reporting unit in which goodwill resides is less than its carrying value. We perform the first step of the goodwill impairment test, which compares the fair value of the reporting unit to its carrying value. If the fair value of the reporting unit exceeds the carrying value of the net assets assigned to that unit, goodwill is not considered impaired and we are not required to perform additional analysis. If\nthe carrying value of the net assets assigned to the reporting unit exceeds the fair value of the reporting unit, we would recognize an impairment charge for the amount by which the carrying amount exceeds the reporting units fair value (although the loss would not exceed the total amount of goodwill allocated to the reporting unit).\nDetermining the fair value of a reporting unit involves the use of significant estimates and assumptions. Our goodwill impairment test uses a weighting of the income approach and the market approach to estimate a reporting units fair value. The income approach is based on a discounted future cash flow analysis that uses certain assumptions including: projections of revenues and expenses and related cash flows based on assumed long-term growth rates and demand trends; expected future investments and working capital requirements to sustain and grow the business; and estimated discount rates based on the reporting units weighted average cost of capital as derived by the Capital Asset Pricing Model and other methods, which includes observable market inputs and other data from identified comparable companies. The same estimates are also used internally for our capital budgeting process, and for long-term and short-term business planning and forecasting. We test the reasonableness of the inputs and outcomes of our discounted cash flow analysis against available comparable market data.\nThe market approach is based on the application of appropriate market-derived multiples selected from (i) comparable publicly-traded companies and/or (ii) the implied transaction multiples derived from identified merger and acquisition activity in the market. Multiples are then selected based on a comparison of the reviewed data to that of the reporting unit and applied to relevant historical and forecasted financial parameters such as levels of revenues, EBITDA, EBIT or other metrics.\nIf actual results differ significantly from our projections, we may be required to record a material impairment charge.\nImpact of Recently Issued Accounting Pronouncements\nFor discussion of recently issued accounting pronouncements, see Recently Issued Accounting Pronouncements within \"Note 1. Summary of Operations and Significant Accounting Policies in Item 8. Financial Statements and Supplementary Data. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, as defined by Rule 12b-2 of the Exchange Act and in Item 10(f)(1) of Regulation S-K, we are electing scaled disclosure reporting obligations and, therefore, are not required to provide the information requested by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe following documents are filed as part of this Annual Report on Form 10-K:\nFinancial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID Number 248)\nReport of Independent Registered Public Accounting Firm (PCAOB ID Number 199)\nConsolidated Balance Sheets: September 30, 2022 and 2021\nConsolidated Statements of Operations: Years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Comprehensive Income (Loss): Years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Shareholders Equity: Years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows: Years ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nAmtech Systems, Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheet of Amtech Systems, Inc. (an Arizona corporation) and subsidiaries (the Company) as of September 30, 2022, the related consolidated statements of operations, comprehensive income (loss), shareholders equity, and cash flows for the year ended September 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022, and the results of its operations and its cash flows for the year ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical audit matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2021.\nPhoenix, Arizona\nNovember 30, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nShareholders of:\nAMTECH SYSTEMS, INC. AND SUBSIDIARIES\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of Amtech Systems, Inc. and Subsidiaries (the Company) as of September 30, 2021, and the related consolidated statements of operations, comprehensive income (loss), stockholders equity, and cash flows for each of the two years in the period ended September 30, 2021 and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2021, and the results of its operations and its cash flows for each of the two years in the period ended September 30, 2021 in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (i) relates to accounts or disclosures that are material to the financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which they relate.\nAccounting for Income Taxes in Foreign Jurisdictions\nAs described in Note 12 to the consolidated financial statements, the Company is subject to income taxes in the United States, as well as China and a number of other foreign jurisdictions. The application of tax laws to the Companys operations can be complex and subject to different interpretations by the Company and respective governmental taxing authorities. The Company exercises judgment for the interpretation of current tax regulations. We identified the auditing of the accounting for income taxes as a critical audit matter.\nThe principal consideration for our determination that the auditing of income taxes was a critical audit matter was the complex auditor judgment required when evaluating the foreign income tax provisions and use of specialized knowledge and experience necessary in evaluating the completeness of the foreign tax provisions and uncertain tax positions primarily due to the Companys multinational presence in numerous foreign jurisdictions with varying complexity in tax laws and regulations.\nThe primary procedures we performed to address this critical audit matter included:\nTesting the income tax provision in each significant foreign taxable jurisdiction, including performing procedures designed to test the completeness and accuracy of the permanent and temporary differences by obtaining an understanding of the tax laws applicable in the respective jurisdiction and evaluating communications with tax advisors, accounting records, and tax returns.\nEvaluating and testing the appropriateness of the methods and assumptions used in the Companys identification of deferred tax assets and liabilities and assessment of the valuation of uncertain tax positions in each of its foreign taxable jurisdictions, including the determination of whether the methods were consistent with the requirements of U.S. GAAP, whether the data was appropriately used, and whether the significant assumptions were reasonable and appropriately applied within the methods.\nEngaging tax professionals with specialized skill and knowledge who assisted in (1) obtaining an understanding of the tax laws in each respective jurisdiction; (2) assessing the Companys tax positions, 3) evaluating the Companys interpretation of tax law and its assessment and measurement of certain tax uncertainties and expected outcomes by interpreting tax laws and evaluating and reading advice obtained from the Company.\n/s/ MAYER HOFFMAN MCCANN P.C.\nWe served as the Company's auditor from 2005 to 2021.\nPhoenix, Arizona\nNovember 17, 2021\nPART I. FINANCIAL INFORMATION\nITEM 1. Consolidated Financial Statements\nAMTECH SYSTEMS, INC. AND SUBSIDIARIES\nConsolidated Balance Sheets\n(in thousands, except share and per share data)\nSeptember 30,\nAssets\nCurrent Assets\nCash and cash equivalents\n$\n46,874\n$\n32,836\nAccounts receivable - Net\n25,013\n22,502\nInventories\n25,488\n22,075\nIncome taxes receivable\n-\n1,046\nOther current assets\n5,561\n2,407\nTotal current assets\n102,936\n80,866\nProperty, Plant and Equipment - Net\n6,552\n14,083\nRight-of-Use Assets - Net\n11,258\n8,646\nIntangible Assets - Net\nGoodwill\n11,168\n11,168\nDeferred Income Taxes - Net\nOther Assets\nTotal Assets\n$\n133,534\n$\n116,913\nLiabilities and Shareholders Equity\nCurrent Liabilities\nAccounts payable\n$\n7,301\n$\n8,229\nAccrued compensation and related taxes\n4,109\n2,881\nAccrued warranty expense\nOther accrued liabilities\nCurrent maturities of finance lease liabilities and long-term debt\nCurrent portion of long-term operating lease liabilities\n2,101\nContract liabilities\n7,231\n1,624\nIncome taxes payable\n-\nTotal current liabilities\n22,626\n15,109\nFinance Lease Liabilities and Long-Term Debt\n4,402\nLong-Term Operating Lease Liabilities\n9,395\n8,389\nIncome Taxes Payable\n2,849\n3,277\nOther Long-Term Liabilities\nTotal Liabilities\n35,166\n31,279\nCommitments and Contingencies (Note 16)\nShareholders Equity\nPreferred stock; 100,000,000 shares authorized; none issued\n-\n-\nCommon stock; $0.01 par value; 100,000,000 shares authorized; shares\nissued and outstanding: 13,994,154 and 14,304,492 in\n2022 and 2021, respectively\nAdditional paid-in capital\n124,458\n126,380\nAccumulated other comprehensive (loss) income\n(1,767\n)\nRetained deficit\n(24,463\n)\n(40,903\n)\nTotal Shareholders Equity\n98,368\n85,634\nTotal Liabilities and Shareholders Equity\n$\n133,534\n$\n116,913\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMTECH SYSTEMS, INC. AND SUBSIDIARIES\nConsolidated Statements of Operations\n(in thousands, except per share data)\nYears Ended September 30,\nRevenue, net\n$\n106,298\n$\n85,205\n$\n65,463\nCost of sales\n66,787\n50,675\n41,022\nGross profit\n39,511\n34,530\n24,441\nSelling, general and administrative\n28,300\n24,740\n21,397\nResearch, development and engineering\n6,390\n5,979\n3,312\nGain on sale of fixed assets\n(12,465\n)\n-\n-\nSeverance expense\n-\nOperating income (loss)\n17,286\n3,725\n(485\n)\nLoss on sale of subsidiary\n-\n-\n(2,793\n)\nInterest income (expense) and other, net\n1,499\n(291\n)\nIncome (loss) from continuing operations before income taxes\n18,785\n3,434\n(3,116\n)\nIncome tax provision\n1,418\n1,926\nIncome (loss) from continuing operations, net of tax\n17,367\n1,508\n(3,907\n)\nLoss from discontinued operations, net of tax\n-\n-\n(11,816\n)\nNet income (loss)\n$\n17,367\n$\n1,508\n$\n(15,723\n)\nIncome (Loss) Per Basic Share:\nBasic income (loss) per share from continuing operations\n$\n1.24\n$\n0.11\n$\n(0.28\n)\nBasic loss per share from discontinued operations\n$\n-\n$\n-\n$\n(0.83\n)\nNet income (loss) per basic share\n$\n1.24\n$\n0.11\n$\n(1.11\n)\nIncome (Loss) Per Diluted Share:\nDiluted income (loss) per share from continuing operations\n$\n1.22\n$\n0.11\n$\n(0.28\n)\nDiluted loss per share from discontinued operations\n$\n-\n$\n-\n$\n(0.83\n)\nNet income (loss) per diluted share\n$\n1.22\n$\n0.11\n$\n(1.11\n)\nWeighted average shares outstanding - basic\n14,014\n14,189\n14,159\nWeighted average shares outstanding - diluted\n14,184\n14,340\n14,159\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMTECH SYSTEMS, INC. AND SUBSIDIARIES\nConsolidated Statements of Comprehensive Income (Loss)\n(in thousands)\nYears Ended September 30,\nNet income (loss)\n$\n17,367\n$\n1,508\n$\n(15,723\n)\nForeign currency translation adjustment\n(1,781\n)\n1,790\nReclassification adjustment for net foreign currency translation\nlosses included in net loss\n-\n-\n8,797\nComprehensive income (loss)\n$\n15,586\n$\n2,168\n$\n(5,136\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMTECH SYSTEMS, INC. AND SUBSIDIARIES\nConsolidated Statements of Shareholders Equity\n(in thousands)\nCommon Stock\nTreasury Stock\nAccumulated\nAdditional\nOther\nTotal\nPar\nPaid-in\nComprehensive\nRetained\nShareholders\nShares\nValue\nShares\nCost\nCapital\nIncome (Loss)\nDeficit\nEquity\nBalances at September 30, 2019\n14,269\n$\n-\n$\n-\n$\n125,098\n$\n(11,233\n)\n$\n(26,556\n)\n$\n87,452\nNet loss\n-\n-\n-\n-\n-\n-\n(15,723\n)\n(15,723\n)\nTranslation adjustment\n-\n-\n-\n-\n-\n10,587\n-\n10,587\nStock compensation expense\n-\n-\n-\n-\n-\n-\nRepurchase of treasury stock\n-\n-\n(366\n)\n(2,000\n)\n-\n-\n-\n(2,000\n)\nRetirement of treasury stock\n(366\n)\n(4\n)\n2,000\n(1,864\n)\n-\n(132\n)\n-\nStock options exercised\n-\n-\n-\n-\nBalances at September 30, 2020\n14,063\n$\n-\n$\n-\n$\n124,435\n$\n(646\n)\n$\n(42,411\n)\n$\n81,519\nNet income\n-\n-\n-\n-\n-\n-\n1,508\n1,508\nTranslation adjustment\n-\n-\n-\n-\n-\n-\nStock compensation expense\n-\n-\n-\n-\n-\n-\nStock options exercised\n-\n-\n1,544\n-\n-\n1,546\nBalances at September 30, 2021\n14,304\n$\n-\n$\n-\n$\n126,380\n$\n$\n(40,903\n)\n$\n85,634\nNet income\n-\n-\n-\n-\n-\n-\n17,367\n17,367\nTranslation adjustment\n-\n-\n-\n-\n-\n(1,781\n)\n-\n(1,781\n)\nStock compensation expense\n-\n-\n-\n-\n-\n-\nRepurchase of treasury stock\n-\n-\n(434\n)\n(4,115\n)\n-\n-\n-\n(4,115\n)\nRetirement of treasury stock\n(434\n)\n(4\n)\n4,115\n(3,184\n)\n-\n(927\n)\n-\nStock options exercised\n-\n-\n-\n-\nBalances at September 30, 2022\n13,994\n$\n-\n$\n-\n$\n124,458\n$\n(1,767\n)\n$\n(24,463\n)\n$\n98,368\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMTECH SYSTEMS, INC. AND SUBSIDIARIES\nConsolidated Statements of Cash Flows\n(in thousands)\nYears Ended September 30,\nOperating Activities\nNet income (loss)\n$\n17,367\n$\n1,508\n$\n(15,723\n)\nAdjustments to reconcile net income (loss) to net cash provided by (used in)\noperating activities:\nDepreciation and amortization\n1,729\n1,398\n1,258\nWrite-down of inventory\n(Reversal of) provision for allowance for doubtful accounts\n(32\n)\nDeferred income taxes\n(65\n)\nNon-cash share-based compensation expense\nLoss on sales of subsidiaries\n-\n-\n13,709\nGain on sale of fixed assets\n(12,465\n)\n-\n-\nOther, net\n-\nChanges in operating assets and liabilities:\nAccounts receivable\n(2,479\n)\n(11,023\n)\n1,359\nInventories\n(3,684\n)\n(5,180\n)\n(913\n)\nContract and other assets\n(2,203\n)\n(686\n)\nAccounts payable\n(1,080\n)\n5,472\n(3,620\n)\nAccrued income taxes\n(2,701\n)\nAccrued and other liabilities\n4,658\nContract liabilities\n5,607\n(1,371\n)\nNet cash provided by (used in) operating activities\n5,204\n(5,962\n)\n(1,664\n)\nInvesting Activities\nPurchases of property, plant and equipment\n(1,135\n)\n(3,012\n)\n(2,676\n)\nProceeds from sale of property, plant and equipment\n19,908\n-\n-\nNet cash disposed of in sales of subsidiaries\n-\n-\n(9,940\n)\nAcquisition, net of cash and cash equivalents acquired\n-\n(5,082\n)\n-\nNet cash provided by (used in) investing activities\n18,773\n(8,094\n)\n(12,616\n)\nFinancing Activities\nProceeds from the exercise of stock options\n1,546\nRepurchase of common stock\n(4,115\n)\n-\n(2,000\n)\nPayments on long-term debt\n(4,872\n)\n(380\n)\n(379\n)\nNet cash (used in) provided by financing activities\n(8,267\n)\n1,166\n(1,502\n)\nEffect of Exchange Rate Changes on Cash, Cash Equivalents and\nRestricted Cash\n(1,672\n)\n1,718\nNet Increase (Decrease) in Cash, Cash Equivalents and Restricted Cash\n14,038\n(12,234\n)\n(14,064\n)\nCash, Cash Equivalents and Restricted Cash, Beginning of Year*\n32,836\n45,070\n59,134\nCash, Cash Equivalents and Restricted Cash, End of Year\n$\n46,874\n$\n32,836\n$\n45,070\nSupplemental Cash Flow Information:\nIncome tax payments, net\n$\n$\n1,868\n$\n2,116\nInterest paid, net of capitalized interest\n$\n$\n$\nSupplemental Non-cash Financing and Investing Activities:\nTransfer of inventory to property, plant, and equipment\n$\n$\n$\nLeased assets obtained in exchange for new operating lease liabilities\n$\n3,686\n$\n3,680\n$\n5,262\nLeased assets obtained in exchange for new finance lease liabilities\n$\n$\n$\n-\nAccrued for asset retirement obligation\n$\n-\n$\n$\n-\n*\tIncludes Cash, Cash Equivalents and Restricted Cash that are included in Held-For-Sale Assets on the Consolidated Balance Sheets for periods prior to January 22, 2020.\nThe accompanying notes are an integral part of these consolidated financial statements.\nNotes to Consolidated Financial Statements\nFor the Years Ended September 30, 2022, 2021 and 2020\n1. Summary of Operations and Significant Accounting Policies\nDescription of Business - Amtech is a leading, global manufacturer of capital equipment, including thermal processing and wafer polishing, and related consumables used in fabricating semiconductor devices, such as silicon carbide (SiC) and silicon power devices, analog and discrete devices, electronic assemblies and light-emitting diodes (LEDs). We sell these products to semiconductor device and module manufacturers worldwide, particularly in Asia, North America and Europe.\nWe serve niche markets in industries that are experiencing technological advances, and which historically have been very cyclical. Therefore, future profitability and growth depend on our ability to develop or acquire and market profitable new products and on our ability to adapt to cyclical trends.\nOur fiscal year is from October 1 to September 30. Unless otherwise stated, references to the years 2022, 2021 and 2020 relate to the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nIn March 2020, the outbreak of COVID-19 was recognized as a pandemic by the World Health Organization, and the outbreak became increasingly widespread, including in all of the markets in which we operate. We continue to monitor the impact of COVID-19 on all aspects of our business. We are a company operating in a critical infrastructure industry, as defined by the U.S. Department of Homeland Security. Consistent with federal guidelines and with foreign government, state and local orders to date, we have continued to operate across our footprint throughout the COVID-19 pandemic. Following the onset of COVID-19 and its negative effects on our business, most prominently reflected in our second, third and fourth quarter fiscal 2020 results, global economic conditions improved during fiscal 2021, resulting in increased demand for our products and services, which led to our earnings for fiscal 2021 substantially exceeding our fiscal 2020 results. There remain many unknowns and we continue to monitor the expected trends and related demand for our products and services and have and will continue to adjust our operations accordingly.\nOn March 28, 2022, the Chinese government issued a mandatory shutdown in Shanghai, the location of one of our manufacturing facilities. The factory was allowed to partially reopen in May 2022 and was fully reopened on June 1, 2022. Upon reopening on June 1, 2022, the factory was able to operate at near full capacity for the entire month of June. We were able to make up the shipments missed in the fourth quarter and are now operating at normal capacity levels. Additionally, given the uncertainty surrounding the COVID-19 pandemic and the emergence of variations thereof, there can be no assurance that this facility will be allowed to remain open on a consistent basis.\nPrinciples of Consolidation - The consolidated financial statements include the accounts of the Company and our wholly-owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation.\nUse of Estimates - The preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nReclassifications - Certain reclassifications have been made to prior year financial statement footnotes to conform to the current year presentation. These reclassifications had no effect on the previously reported consolidated financial statements for any period.\nDivestitures - Significant accounting policies associated with a decision to dispose of a business are discussed below:\nDiscontinued Operations - A business is classified as discontinued operations if the disposal represents a strategic shift that will have a major effect on operations or financial results and meets the criteria to be classified as held for sale or is disposed of by sale or otherwise. Significant judgments are involved in determining whether a business meets the criteria for discontinued operations reporting and the period in which these criteria are met. If a business is reported as a discontinued operation, the results of operations through the date of sale, including any gain or loss recognized on the disposition, are presented on a separate line of the Consolidated Statement of Operations. Interest on debt directly attributable to the discontinued operation is allocated to discontinued operations.\nAssets Held for Sale - An asset or business is classified as held for sale when (i) management commits to a plan to sell and it is actively marketed; (ii) it is available for immediate sale and the sale is expected to be completed within one year; and (iii) it is unlikely significant changes to the plan will be made or that the plan will be withdrawn. In isolated instances, assets held for sale may exceed one year due to events or circumstances beyond our control. The assets and related liabilities are aggregated and reported on separate lines of the Consolidated Balance Sheets.\nCash and Cash Equivalents - We consider all highly liquid investments with a maturity of three months or less when purchased to be cash equivalents. Our cash and cash equivalents consist of amounts invested in U.S. money market funds and various U.S. and foreign bank operating and time deposit accounts.\nWe maintain our cash, cash equivalents and restricted cash in multiple financial institutions. Balances in the United States, which account for approximately 84% and 83% of total cash balances as of September 30, 2022 and 2021, respectively, are primarily invested in AAA-rated U.S Treasury and U.S. Government Agency repo money market mutual funds, which have a constant net asset value and consist of direct U.S. Treasuries and/or U.S. Government Agencies with repurchase agreements backed by U.S. Treasury or U.S. Government Agency collateral only, or are in financial institutions insured by the FDIC. The remainder of our cash is maintained with financial institutions with reputable credit in China, the United Kingdom and Malaysia. We maintain cash in bank accounts in amounts which at times may exceed federally insured limits. We have not experienced any losses on such accounts.\nAccounts Receivable and Allowance for Doubtful Accounts - Accounts receivable are recorded at the sales price of products sold to customers on trade credit terms. Accounts receivable are considered past due when payment has not been received from the customer within the normal credit terms extended to that customer. A valuation allowance is established for accounts when collection is no longer probable. Accounts are written off against the allowance when the probability of collection is remote. Historically, these write-offs have been immaterial.\nInventories - We value our inventory at the lower of cost (first-in, first-out method) or net realizable value. Inventory cost includes the purchase price of parts or finished goods, labor, overhead and any freight cost incurred to receive the inventory into our manufacturing facilities. We regularly review inventory quantities and record a write-down to net realizable value for excess and obsolete inventory. The write-down is primarily based on historical inventory usage adjusted for expected changes in product demand and production requirements. Our industry is characterized by customers in highly-cyclical industries, rapid technological changes, frequent new product developments and rapid product obsolescence. Changes in demand for our products could result in further write-downs.\nProperty, Plant and Equipment - Property, plant and equipment are recorded at cost upon acquisition. We begin depreciation and amortization when an asset is both in the location and condition for its intended use. Maintenance and repairs are charged to expense as incurred. The cost of property retired or sold and the related accumulated depreciation and amortization are removed from the applicable accounts when disposition occurs and any gain or loss is recognized. Depreciation and amortization are computed using the straight-line method over the estimated useful life of the asset. Useful lives for equipment and machinery range from three to seven years; for leasehold improvements from three to fifteen years; for furniture and fixtures from five to ten years; and for buildings from 20 to 30 years.\nReviews are regularly performed to determine whether facts and circumstances exist which indicate that the useful life is shorter than originally estimated or the carrying amount of assets may not be recoverable. Impairment, if any, is based on the excess of the carrying amount over the estimated fair value of those assets.\nLeases - We determine if a contract or arrangement is, or contains, a lease at inception. Balances related to operating leases are included in right-of-use (\"ROU\") assets in our Consolidated Balance Sheets. Balances related to financing leases are immaterial and are included in property, plant and equipment and finance lease liabilities and long-term debt in our Consolidated Balance Sheets. ROU assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease.\nROU assets and lease liabilities are recognized at commencement date based on the present value of lease payments over the lease term. As none of our leases provide an implicit rate, we use our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments. The ROU asset includes any prepaid lease payments and additional direct costs and excludes lease incentives. Our lease terms may\ninclude options to extend or terminate the lease, which we include in the recognition of the ROU asset and lease liability, when it is reasonably certain that we will exercise that option.\nWe lease office space, buildings, land, vehicles and equipment. We made an accounting policy election not to separate non-lease components from lease components for all existing classes of underlying assets with the exception of land and buildings. Lease agreements with an initial term of 12 months or less with no renewal options are not recorded on the balance sheet. Instead, we recognize the lease expense as incurred over the lease term. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants. We have one lease that requires the underlying asset to be returned to its original condition at the end of the lease term. The related asset retirement obligation, which is immaterial, is reflected within other long-term liabilities in our Consolidated Balance Sheets.\nCertain lease agreements include one or more options to renew, with individual option terms that can extend the lease term from one to five years. The exercise of lease renewal options is at our sole discretion. Some equipment leases also include options to purchase the leased property. The estimated life of assets and leasehold improvements are limited by the expected lease term, unless there is a transfer of title or purchase option reasonably certain of exercise.\nIn June 2022, we entered into a sale-leaseback transaction to facilitate a future move of our Massachusetts operations, pursuant to which we sold the property to a third party and agreed to lease the property back for two years. To determine whether the transfer of the property should be accounted for as a sale, we evaluated whether we transferred control to the third party in accordance with the revenue recognition guidance set forth in ASC 606. The transfer was deemed to be a sale at market terms. Therefore, we recognized the transaction price for the sale based on the cash proceeds received, derecognized the carrying amount of the underlying assets and recognized a gain in the Consolidated Statements of Operations for the difference between the carrying value of the asset and the transaction price. We then accounted for the leaseback in accordance with our lease accounting policy.\nIntangible Assets - Intangible assets acquired in business combinations are capitalized and subsequently amortized on a straight-line basis over their estimated useful life. We regularly perform reviews to determine if facts and circumstances exist which indicate that the useful lives of our intangible assets are shorter than originally estimated or the carrying amount of these assets may not be recoverable. Impairment, if any, is based on the excess of the carrying amount over the estimated fair value of those assets. Patent costs consist primarily of legal and filing fees incurred to file patents on proprietary methods and technology we developed. Patent costs are expensed when incurred, as they are insignificant.\nGoodwill - Goodwill is recorded when the purchase price paid for an acquisition exceeds the estimated fair value of net identified tangible and intangible assets acquired. Goodwill is not subject to amortization but is tested for impairment annually or when it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying amount. If it is concluded that there is a potential impairment, we would recognize an impairment charge for the amount by which the carrying amount exceeds the reporting units fair value (although the loss would not exceed the total amount of goodwill allocated to the reporting unit).\nRevenue Recognition - We recognize revenue when a customer obtains control of promised goods or services in an amount that reflects the consideration expected to be received in exchange for those goods or services. A performance obligation is a promise in a contract to transfer a product or service to the customer. The transaction price of a contract is allocated to each distinct performance obligation based upon the relative standalone selling price (\"SSP\") for each performance obligation and is recognized as revenue upon satisfaction of the performance obligation. To record revenue properly, we apply the following five steps:\n1) Identify the contract with the customer\nA contract with a customer exists when (i) we enter into an enforceable contract with a customer that defines each partys rights regarding the goods or services to be transferred and identifies the related payment terms, (ii) the contract has commercial substance, and (iii) we determine that collection of substantially all consideration for goods and services that are transferred is probable based on the customers intent and ability to pay the promised consideration.\n2) Identify the performance obligations in the contract\nPerformance obligations are identified based on the goods and services that will be transferred to the customer that are both (i) capable of being distinct, whereby the customer can benefit from the good or service either on its own or together with other available resources, and (ii) are distinct in the context of the contract, whereby the transfer of the good or service is separately identifiable from other promises to the customer in the contract. To the extent a contract includes multiple promised goods and services, we must apply judgment to determine whether promised goods and services are capable of being distinct and distinct in the context of the contract. If these criteria are not met, the promised goods and services are accounted for as a combined performance obligation.\nOur equipment sales consist of multiple promises, including the delivery of the system itself and obligations that are not delivered simultaneously with the system, such as installation services and training. In most cases, these services require minimal effort and are immaterial in the context of the contract. Therefore, equipment and related services are treated as one performance obligation. Customers who purchase new systems are provided an assurance-type warranty, generally for periods of 12 to 36 months. Assurance-type warranties are not considered a performance obligation.\nWe account for shipping and handling activities that occur after control of the related good transfers as fulfillment activities instead of assessing such activities as performance obligations.\nOur remaining performance obligations as of September 30, 2022, have an original duration of one year or less. Our obligations for returns and/or refunds are immaterial in all periods presented.\n3) Determine the transaction price\nThe transaction price is determined based on the consideration to which we will be entitled in exchange for transferring goods and services to the customer.\nThe transaction price is based on the price reflected in the individual customers purchase order.\nOccasionally, our customers earn a commission on the purchase and/or resale of our products. These payments to customers are recorded as a reduction of revenue and are less than 5% of our total revenues.\n4) Allocate the transaction price to performance obligations in the contract\nIf the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. Contracts that contain multiple performance obligations require an allocation of the transaction price to each distinct performance obligation.\nWhen required, the SSP for each performance obligation is based on observable data from standalone sales. To determine the SSP for labor-related performance obligations, we use directly observable inputs based on the standalone sale prices for these services.\n5) Recognize revenue when, or as, we satisfy a performance obligation\nWe satisfy performance obligations either over time or at a point in time. Revenue is recognized over time if either (i) the customer simultaneously receives and consumes the benefits provided by our performance, (ii) our performance creates or enhances an asset that the customer controls as the asset is created or enhanced, or (iii) our performance does not create an asset with an alternative use to the entity and we have an enforceable right to payment for performance completed to date. If we do not satisfy a performance obligation over time, the related performance obligation is satisfied at a point in time by transferring the control of a promised good or service to a customer. For over time recognition, we are required to select a single revenue recognition method for the performance obligation that faithfully depicts our performance in transferring control of the goods and services.\nEquipment and related product revenues (e.g., furnace systems, system add-ons, machinery, consumables and spare parts) are recognized at a point in time, when they are shipped or delivered, depending on contractual terms.\nRevenue for maintenance services are recognized over time based on hours incurred, as the hours incurred align to the maintenance activities performed.\nWe exclude from the transaction price all sales taxes that are assessed by a governmental authority and that are imposed on and concurrent with a specific revenue-producing transaction and collected from a customer (for example, sales, use, value added, and certain excise taxes). Sales taxes are presented on a net basis (excluded from revenues) in our Consolidated Statements of Operations. Our remaining performance obligations as of September 30, 2022, have an original duration of one year or less. Our customers generally have payment terms of 60-90 days. We do not have any payment terms that exceed one year from the point we have satisfied the related performance obligations.\nManagement reviews disaggregated revenue at the reportable segment level. Revenue-generating transactions vary between our reportable segments due to several factors. For example, lead times vary among our reportable segments and among our products. Most of the revenue for our Material and Substrate segment results from the sale of consumables, rather than equipment sales. These consumables have a much shorter production period than equipment produced by our other reportable segment. Due to these variations between reportable segments, management determined that disaggregated revenue by reportable segment sufficiently depicts how economic factors affect the nature, amount, timing and uncertainty of our revenue and cash flows. See Note 18 for additional information on our reportable segments.\nContract Assets - Contract assets consist of amounts we are not legally able to invoice but have completed the related performance obligation. These amounts generally arise from variances between the contractual payment terms and the transaction price assigned to the open performance obligations (e.g., we have recognized revenue in an amount greater than the amount that is billable under the contract). There were no contract assets at September 30, 2022 and 2021.\nContract Liabilities - Contract liabilities are reflected in current liabilities on the Consolidated Balance Sheets as all performance obligations are expected to be satisfied within the next 12 months. Contract liabilities include customer deposits and deferred profit, if any. Contract liabilities relate to payments invoiced or received in advance of completion of performance obligations under a contract. Contract liabilities are recognized as revenue upon the fulfillment of performance obligations. Contract liabilities consist of customer deposits as of September 30, 2022 and 2021. Of the $1.6 million contract liabilities recorded at September 30, 2021, the entire $1.6 million was recorded as revenue for the year ended September 30, 2022. Of the $1.2 million contract liabilities recorded at September 30, 2020, the entire $1.2 million was recorded as revenue for the year ended September 30, 2021. Of the $1.4 million contract liabilities recorded at September 30, 2019, the entire $1.4 million was recorded as revenue for the year ended September 30, 2020.\nWarranty - A limited warranty is provided free of charge, generally for periods of 12 to 36 months to all purchasers of our new products and systems. Accruals are recorded for estimated warranty costs at the time revenue is recognized, generally upon shipment or acceptance, as determined under the revenue recognition policy above. On occasion, we have been required and may be required in the future to provide additional warranty coverage to ensure that the systems are ultimately accepted or to maintain customer goodwill. While our warranty costs have historically been within our expectations and we believe that the amounts accrued for warranty expenditures are sufficient for all systems sold through September 30, 2022, we cannot guarantee that we will continue to experience a similar level of predictability with regard to warranty costs. In addition, technological changes or previously unknown defects in raw materials or components may result in more extensive and frequent warranty service than anticipated, which could result in an increase in our warranty expense.\nThe following is a summary of activity in accrued warranty expense at our continuing operations, in thousands:\nYears Ended September 30,\nBeginning balance\n$\n$\n$\nAdditions for warranties issued during the period\nReductions in the liability for payments made under\nthe warranty\n(36\n)\n(9\n)\n(433\n)\nChanges related to pre-existing warranties\n(459\n)\n(76\n)\n(121\n)\nCurrency translation adjustment\n-\n-\n(15\n)\nEnding balance\n$\n$\n$\nShipping Expense - Shipping expenses at our continuing operations of $2.4 million, $0.8 million and $0.5 million for 2022, 2021 and 2020, respectively, are included in selling, general and administrative expenses.\nAdvertising Expense - Advertising costs are expensed as incurred. Advertising expenses at our continuing operations of $0.4 million, $0.2 million and $0.3 million for 2022, 2021 and 2020, respectively, are included in selling, general and administrative expenses.\nStock-Based Compensation - We measure compensation costs relating to share-based payment transactions based upon the grant-date fair value of the award. Those costs are recognized as expense over the requisite service period, which is generally the vesting period, with forfeitures recognized as they occur. We estimate the fair value of stock option awards on the date of grant using the Black-Scholes option-pricing model. The Black-Scholes model requires us to apply estimates, including expected stock price volatility, expected life of the option and the risk-free interest rate.\nResearch, Development and Engineering Expenses - RD&E expenses consist of the cost of employees, consultants and contractors who design, engineer and develop new products and processes as well as materials and supplies used in producing prototypes. RD&E expenses may vary from period to period depending on the engineering projects in process. Expenses related to engineers working on strategic projects or sustaining engineering projects are recorded in RD&E. However, from time to time we add functionality to our products or develop new products during engineering and manufacturing to fulfill specifications in a customers order, in which case the cost of development, along with other costs of the order, are charged to cost of goods sold. When certain contract requirements are met, governmental research and development grants are netted against research, development and engineering expenses. The following is a summary of our research, development and engineering expense, thousands:\nYears Ended September 30,\nResearch, development and engineering\n$\n6,390\n$\n5,979\n$\n3,689\nGrants earned\n-\n-\n(377\n)\nNet research, development and engineering\n$\n6,390\n$\n5,979\n$\n3,312\nForeign Currency Transactions and Translation - We use the U.S. dollar as our reporting currency. Our operations in the UK, China and other countries are primarily conducted in their functional currencies, the Euro, Renminbi, or the local country currency, respectively. Accordingly, assets and liabilities of the subsidiaries are translated into U.S. dollars at the exchange rate in effect at the balance sheet dates. Income and expense items are translated at the average exchange rate for each month within the year. The resulting translation adjustments are recorded directly in accumulated other comprehensive income (loss), net of tax - foreign currency translation adjustments as a separate component of shareholders equity. Net foreign currency transaction gains/losses, including transaction gains/losses on intercompany balances that are not of a long-term investment nature and non-functional currency cash balances, are reported as a separate component of non-operating (income) expense in our Consolidated Statements of Operations.\nIncome Taxes - We file consolidated federal income tax returns in the United States for all subsidiaries except those in China and the UK, where separate returns are filed. We account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and deferred tax liabilities for the expected future tax\nconsequences of events that have been included in the financial statements. Under this method, we determine deferred tax assets and deferred tax liabilities on the basis of the differences between the financial statement and tax bases of assets and liabilities by using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and deferred tax liabilities is recognized in income in the period that includes the enactment date.\nWe recognize deferred tax assets to the extent that we believe that these assets are more likely than not to be realized. In making such a determination, we consider all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, carryback potential if permitted under the tax law and results of recent operations. If we determine that we would not be able to realize our deferred tax assets in the future in excess of their net recorded amount, we would make an adjustment to the deferred tax asset through recognizing a valuation allowance, which would increase the provision for income taxes.\nWe record uncertain tax positions in accordance with ASC 740 on the basis of a two-step process in which (1) we determine whether it is more likely than not that the tax positions will be sustained on the basis of the technical merits of the position and (2) for those tax positions that meet the more-likely-than-not recognition threshold, we recognize the largest amount of tax benefit that is more than 50 percent likely to be realized upon ultimate settlement with the related tax authority. We recognize interest and penalties related to uncertain tax benefits on the income tax expense line in the accompanying consolidated statement of operations. Accrued interest and penalties are included on the income taxes payable long-term line in the Consolidated Balance Sheets.\nConcentrations of Credit Risk - Our customers are primarily manufacturers of semiconductor substrates and devices and electronic assemblies. Financial instruments that potentially subject us to significant concentrations of credit risk consist principally of cash and trade accounts receivable. Credit risk is managed by performing credit evaluations of the customers financial condition, by requiring significant deposits where appropriate, and by actively monitoring collections. Letters of credit are required of certain customers depending on the size of the order, type of customer or its creditworthiness, and country of domicile.\nAs of September 30, 2022, one Semiconductor customer individually represented 12% of accounts receivable. As of September 30, 2021, one Semiconductor customer individually represented 14% of accounts receivable.\nRefer to Note 20 for information regarding revenue and assets in other countries subject to fluctuation in foreign currency exchange rates.\nFair Value of Financial Instruments - We group our financial assets and liabilities measured at fair value on a recurring basis into three levels, based on the markets in which the assets and liabilities are traded and the reliability of the assumptions used to determine fair value. These levels are:\nLevel 1 - Valuation is based upon quoted market price for identical instruments traded in active markets.\nLevel 2 - Valuation is based on quoted market prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques for which all significant assumptions are observable in the market.\nLevel 3 - Valuation is generated from model-based techniques that use significant assumptions not observable in the market. Valuation techniques include use of discounted cash flow models and similar techniques.\nIt is our policy to use observable inputs whenever reasonably practicable in order to minimize the use of unobservable inputs when developing fair value measurements. When available, we use quoted market prices to measure fair value. If market prices are not available, the fair value measurement is based on models that use primarily market-based parameters including interest rate yield curves, option volatilities and currency rates. In certain cases, where market rate assumptions are not available, we are required to make judgments about assumptions market participants would use to estimate the fair value of a financial instrument. Changes in the underlying assumptions used, including discount rates and estimates of future cash flows, could significantly affect current or future valuations.\nCash, Cash Equivalents and Restricted Cash - Included in cash and cash equivalents and restricted cash in the Consolidated Balance Sheets are money market funds invested in treasury bills, notes and other direct obligations of the U.S. Treasury and foreign bank operating and time deposit accounts. Cash equivalents are classified as Level 1 in the fair value hierarchy.\nReceivables and Payables - The recorded amounts of these financial instruments, including accounts receivable and accounts payable, approximate their fair value because of the short maturities of these instruments.\nDebt - Due to the relatively short-term nature of the debt, we believe that the carrying value approximated fair value. We paid this debt in full on June 23, 2022 upon the closing of the sale of our Massachusetts manufacturing facility (see Note 8).\nRecently Issued Accounting Pronouncements\nThere were no new accounting pronouncements issued or effective as of September 30, 2022 that had or are expected to have a material impact on our consolidated financial statements.\n2. Acquisition\nOn March 3, 2021, we acquired 100% of the issued and outstanding capital stock of Intersurface Dynamics, a Connecticut-based manufacturer of substrate process chemicals used in various manufacturing processes, including semiconductors, silicon and compound semiconductor wafers, and optics, for a cash purchase price of $5.3 million. The total fair value of net assets acquired was approximately $0.7 million, including $0.4 million of identifiable intangible assets consisting of customer relationships and trade name, which are amortized using the straight-line method over their estimated useful lives of ten and three years, respectively. Goodwill acquired approximated $4.5 million, which was recorded in our Material and Substrate segment. Intersurface Dynamics's results of operations are included in our Material and Substrate segment from the date of acquisition. Our historical results would not have been materially affected by the acquisition of Intersurface Dynamics.\n3. Cybersecurity Incident\nOn April 12, 2021, we detected a data incident in which attackers acquired data and disabled some of the technology systems used by one of our subsidiaries. Upon learning of the incident, we immediately engaged external counsel and retained a team of third-party forensic, incident response, and security professionals to investigate and determine the full scope of this incident. We also notified law enforcement officials and confirmed that the incident is covered by our insurance. We completed the investigation of the data incident with assistance from our outside professionals, and indications were that the unauthorized third-party gained access to certain personal information relating to employees and their beneficiaries for some of our operations. There was no indication of any misuse of this information.\nDespite this disruption, production continued in our facilities. Our previously disabled subsidiary network is now back up and running securely. Working alongside our security professionals, we were able to bring our subsidiarys systems online with enhanced security controls. We have deployed an advanced next generation anti-virus and endpoint detection and response tool, as well as Managed Detection & Response services. We remain committed to protecting the security of the personal information entrusted to us and providing high-quality products and service to our customers.\nWe recorded approximately $1.1 million of expense related to this incident, which was included in selling, general and administrative expenses, during 2021. The expense was primarily related to third-party service providers, including security professionals as well as legal and response teams. We may make additional investments in the future to further strengthen our cybersecurity. We filed an insurance claim during 2021 related to the incident. During 2022, we signed a final settlement agreement with our insurer resulting in total reimbursement of approximately $0.6 million, which included $0.4 million received during the quarter ended December 31, 2021 and $0.2 million received during the quarter ended March 31, 2022. No portion of the reimbursement remains outstanding as of September 30, 2022.\n4. Earnings Per Share & Diluted Earnings Per Share\nBasic EPS is computed by dividing net income (loss) available to common shareholders by the weighted average number of common shares outstanding for the period. Diluted EPS is computed similarly to basic EPS except that the denominator is increased to include the number of additional common shares that would have been outstanding if potentially dilutive common shares had been issued. In the case of a net loss, diluted EPS is calculated in the same manner as basic EPS.\nFor the years 2022, 2021 and 2020, options for 189,000, 101,000 and 642,000 weighted average shares, respectively, were excluded from the diluted EPS calculations because they were anti-dilutive. These shares could become dilutive in the future.\nA reconciliation of the denominators of the basic and diluted EPS calculations follows, in thousands, except per share amounts:\nYears Ended September 30,\nNumerator:\nNet income (loss) from continuing operations\n$\n17,367\n$\n1,508\n$\n(3,907\n)\nNet loss from discontinued operations\n$\n-\n$\n-\n$\n(11,816\n)\nNet income (loss)\n$\n17,367\n$\n1,508\n$\n(15,723\n)\nDenominator:\nWeighted-average shares used to compute basic EPS\n14,014\n14,189\n14,159\nCommon stock equivalents (1)\n-\nWeighted-average shares used to compute diluted EPS\n14,184\n14,340\n14,159\nBasic income (loss) per share from continuing operations\n$\n1.24\n$\n0.11\n$\n(0.28\n)\nBasic loss per share from discontinued operations\n$\n-\n$\n-\n$\n(0.83\n)\nNet income (loss) per basic share\n$\n1.24\n$\n0.11\n$\n(1.11\n)\nDiluted income (loss) per share from continuing operations\n$\n1.22\n$\n0.11\n$\n(0.28\n)\nDiluted loss per share from discontinued operations\n$\n-\n$\n-\n$\n(0.83\n)\nNet income (loss) per diluted share\n$\n1.22\n$\n0.11\n$\n(1.11\n)\n(1)\tThe number of common stock equivalents is calculated using the treasury stock method and the average market price during the period.\n5. Severance\nThe table below details the severance activity for the years ended September 30, 2022 and 2021. The activity during 2021 is the result of staff reductions in our Semiconductor and Material and Substrate operations. The outstanding obligations as of September 30, 2022 and 2021 are as follows, in thousands:\nYears Ended September 30,\nBalance at beginning of the year\n$\n$\nSeverance expense, net of adjustments\n-\nCash payments\n(17\n)\n(171\n)\nBalance at the end of the year\n$\n-\n$\n6. Inventories\nThe components of inventories are as follows, in thousands:\nSeptember 30,\nPurchased parts and raw materials\n$\n15,377\n$\n12,647\nWork-in-process\n6,146\n4,865\nFinished goods\n3,965\n4,563\n$\n25,488\n$\n22,075\n7. Property, Plant and Equipment\nThe following is a summary of property, plant and equipment, in thousands:\nSeptember 30,\nLand\n$\n$\n3,240\nBuildings\n5,396\nBuilding and leasehold improvements\n2,694\n4,622\nEquipment and machinery\n7,238\n6,261\nFurniture and fixtures\n2,307\n2,458\n13,145\n21,977\nAccumulated depreciation and amortization\n(6,593\n)\n(7,894\n)\n$\n6,552\n$\n14,083\nDepreciation was $1.6 million, $1.2 million and $0.8 million in 2022, 2021 and 2020, respectively.\n8. Sale and Leaseback of Real Estate\nOn June 23, 2022, BTU completed the sale and leaseback of its building in Massachusetts (the Property). The sale price was $20.6 million, of which $0.7 million was deducted at closing for commission and other closing expenses. Simultaneously with the closing, BTU entered into a two-year leaseback of the Property. The lease terms include annual base rent of $1.5 million in an absolute triple net lease. In connection with the sale, BTU recognized a pre-tax gain on sale of $12.5 million, which is recorded within operating expenses on the Consolidated Statement of Operations. This sale-leaseback transaction resulted in a net cash inflow of approximately $14.9 million, after repayment of the existing mortgage and settlement of related sale expenses.\n9. Leases\nThe following table provides information about the financial statement classification of our lease balances reported within the Consolidated Balance Sheets as of September 30, 2022 and 2021, in thousands:\nSeptember 30,\nAssets\nRight-of-use assets - operating\n$\n11,258\n$\n8,646\nRight-of-use assets - finance\nTotal right-of-use assets\n$\n11,407\n$\n8,820\nLiabilities\nCurrent\nOperating lease liabilities\n$\n2,101\n$\nFinance lease liabilities\nTotal current portion of long-term lease liabilities\n2,172\nLong-term\nOperating lease liabilities\n9,395\n8,279\nFinance lease liabilities\nTotal long-term lease liabilities\n9,471\n8,389\nTotal lease liabilities\n$\n11,643\n$\n8,920\nThe following table provides information about the financial statement classification of our lease expenses reported in the Consolidated Statements of Operations for the years ended September 30, 2022 and 2021, in thousands:\nYears Ended September 30,\nLease cost\nClassification\nOperating lease cost\nCost of sales\n$\n$\n$\nOperating lease cost\nSelling, general and administrative expenses\nOperating lease cost\nResearch, development and engineering\n-\n-\nFinance lease cost\nCost of sales\nFinance lease cost\nSelling, general and administrative expenses\nShort-term lease cost\nCost of sales\n-\nTotal lease cost\n$\n1,270\n$\n1,005\n$\nFuture minimum lease payments under non-cancelable leases as of September 30, 2022 are as follows, in thousands:\nOperating Leases\nFinance Leases\nTotal\n$\n2,535\n$\n$\n2,611\n2,136\n2,193\nThereafter\n7,863\n-\n7,863\nTotal lease payments\n15,146\n15,300\nLess: Interest\n3,650\n3,657\nPresent value of lease liabilities\n$\n11,496\n$\n$\n11,643\nOperating lease payments include $6.2 million related to options to extend lease terms that are reasonably certain of being exercised.\nThe following table provides information about the remaining lease terms and discount rates applied as of September 30, 2022 and 2021:\nSeptember 30,\nWeighted average remaining lease term\nOperating leases\n12.65 years\n16.92 years\nFinance leases\n2.45 years\n2.79 years\nWeighted average discount rate\nOperating leases\n4.17\n%\n4.17\n%\nFinance leases\n4.17\n%\n4.17\n%\n10. Intangible Assets\nIntangible assets consist of the following, in thousands:\nSeptember 30,\nUseful Life\nCustomer lists\n6-10 years\n$\n1,609\n$\n1,609\nTrade names\n3-15 years\n2,488\n2,488\nAccumulated amortization\n(1,730\n)\n(1,630\n)\nIntangible assets, net\n$\n$\nDuring each fiscal year, we periodically assessed whether any indicators of impairment existed related to our intangible assets. As of each interim period end during each fiscal year, we concluded that a triggering event had not occurred that would more likely than not reduce the fair value of intangible assets below their carrying value.\nAmortization expense related to intangible assets at our continuing operations was $0.1 million, $0.2 million and $0.3 million in 2022, 2021 and 2020, respectively. Future amortization expense for the remaining unamortized balance as of September 30, 2022 is estimated as follows, in thousands:\nYears Ending September 30,\nAmortization\nExpense\n$\nThereafter\nTotal\n$\n11. Goodwill\nThe changes in the carrying amount of goodwill, by reportable segment, for the year ended September 30, 2022 are as follows, in thousands:\nSemiconductor\nMaterial and Substrate\nTotal Goodwill\nGoodwill\n$\n5,905\n$\n5,263\n$\n11,168\nAccumulated impairment losses\n-\n-\n-\nBalance at September 30, 2021\n5,905\n5,263\n11,168\nGoodwill acquired during 2022\n-\n-\n-\nImpairment of goodwill during 2022\n-\n-\n-\nBalance at September 30, 2022\n$\n5,905\n$\n5,263\n$\n11,168\nGoodwill\n$\n5,905\n$\n5,263\n$\n11,168\nAccumulated impairment losses\n-\n-\n-\nBalance at September 30, 2022\n$\n5,905\n$\n5,263\n$\n11,168\nOn March 3, 2021, we acquired Intersurface Dynamics, which has been integrated into our Material and Substrate segment. Under the purchase method of accounting, the purchase price for the acquisition was allocated to the tangible and identifiable intangible assets acquired and liabilities assumed based on their estimated fair values. The excess purchase price over fair value of net assets acquired of approximately $4.5 million was recorded as goodwill in the Material and Substrate segment. The primary driver for this acquisition was to bolster our offerings in the substrate consumables space and incorporate wafer processing coolants and chemicals to our existing consumable and machine product lines.\nDuring each fiscal year, we periodically assessed whether any indicators of impairment existed which would require us to perform an interim impairment review. As of each interim period end during each fiscal year, we concluded that a triggering event had not occurred that would more likely than not reduce the fair value of our reporting units below their carrying values. We performed our annual test of goodwill for impairment as of September 30. The results of the goodwill impairment test indicated that the fair values of our Semiconductor and Material and Substrate reporting units were in excess of the carrying values, and, thus, we did not require an impairment charge. While the quantitative analysis indicated no impairment of Semiconductor and Material and Substrate segment goodwill existed as of September 30, 2022, if the future performance of these reporting units fall short of our expectations or if there are significant changes in operations due to changes in market conditions, we could be required to recognize material impairment charges in future periods.\n12. Income Taxes\nIncome Tax Provision\nThe following note related to income taxes summarizes the results from both continuing and discontinued operations. The components of income (loss) before provision for income taxes are as follows, in thousands:\nYears Ended September 30,\nDomestic\n$\n15,275\n$\n(3,320\n)\n$\n(18,652\n)\nForeign\n3,510\n6,754\n3,673\n$\n18,785\n$\n3,434\n$\n(14,979\n)\nThe components of the provision for income taxes are as follows, in thousands:\nYears Ended September 30,\nCurrent:\nDomestic federal\n$\n-\n$\n-\n$\n(239\n)\nForeign\n1,999\n1,407\nForeign withholding taxes\nDomestic state\n(300\n)\n(59\n)\nTotal current\n1,043\n1,991\n1,310\nDeferred:\nDomestic Federal\n(39\n)\n-\n-\nForeign\n(65\n)\n(566\n)\nTotal deferred\n(65\n)\n(566\n)\nTotal provision\n$\n1,418\n$\n1,926\n$\nThe CARES Act, which was signed into law on March 27, 2020, included a provision for a five-year carryback of net operating losses. We have assessed the benefit of the provision and utilized a portion of the 2019 net operating loss carryback to offset income from 2018. The income tax provision as of and for the year ended September 30, 2020 reflects such impact.\nDue to the tax treatment relating to the sale of Tempress, we realized an income tax benefit of $11.1 million, which is reflected in our discontinued operations in 2020. We realized income tax expense of $0.2 million for the sale of R2D, which is reflected in our continuing operations in 2020. The income tax (benefit) expense is fully offset by a valuation allowance.\nA reconciliation of actual income taxes to income taxes at the expected U.S. federal corporate income tax rate is as follows, in thousands, except percentages:\nYears Ended September 30,\nFederal statutory rate\n21.0\n%\n21.0\n%\n21.0\n%\nTax expense (benefit) at the federal statutory rate\n$\n3,945\n$\n$\n(3,146\n)\nEffect of permanent book-tax differences\nState tax provision\nValuation allowance for net deferred tax assets\n(3,138\n)\n3,775\nUncertain tax items\n(276\n)\n(47\n)\nTax rate differential\nOther items\n(544\n)\n(239\n)\n$\n1,418\n$\n1,926\n$\nDeferred Income Taxes and Valuation Allowance\nDeferred income taxes reflect the tax effects of temporary differences between the financial statement and tax bases of assets and liabilities by using enacted tax rates in effect for the year in which the differences are expected to be realized. The components of deferred tax assets and deferred tax liabilities are as follows, in thousands:\nSeptember 30,\nDeferred tax assets:\nNet operating loss carryforwards\n$\n17,180\n$\n20,650\nAccruals and reserves\n1,441\n1,250\nForeign tax credit\n1,207\nOperating lease liabilities\n2,492\n1,119\nForeign service fee\n1,579\n1,635\nOther assets\n1,092\nTotal deferred tax assets\n23,970\n26,953\nValuation allowance\n(20,000\n)\n(23,292\n)\nDeferred tax assets, net of valuation allowance\n3,970\n3,661\nDeferred tax liabilities:\nGoodwill and identifiable intangible assets\n(321\n)\n(499\n)\nProperty and equipment, net\n(758\n)\n(1,201\n)\nOperating lease, right-of-use assets\n(2,494\n)\n(1,119\n)\nPrepaid assets\n(318\n)\n(211\n)\nTotal deferred tax liabilities\n(3,891\n)\n(3,030\n)\nTotal deferred tax assets (liabilities)\n$\n$\nChanges in the deferred tax valuation allowance are as follows, in thousands:\nYears Ended September 30,\nBalance at the beginning of the year\n$\n23,292\n$\n21,733\n(Reductions) additions to valuation allowance\n(3,292\n)\n1,559\nBalance at the end of the year\n$\n20,000\n$\n23,292\nThe deferred tax valuation allowance decreased by $3.3 million and increased by $1.6 million for the years ended September 30, 2022 and 2021, respectively. In assessing the realizability of deferred tax assets, we consider whether it is more likely than not that some portion or all of the deferred tax assets will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. We consider the scheduled reversal of deferred tax liabilities, projected future income and tax planning strategies in making this assessment. We have established valuation allowances on all net U.S. deferred tax assets, after considering all of the available objective evidence, both positive and negative, historical and prospective, with greater weight given to historical evidence, and determined it is not more likely than not that these assets will be realized. We have established a partial valuation allowance on certain foreign deferred tax assets that we consider it is more likely than not will not be realized.\nWe intend to permanently reinvest undistributed earnings of our foreign subsidiaries. It is not practicable to estimate the amount of tax that might be payable on the undistributed amounts.\nNet Operating Losses\nAs of September 30, 2022, we have federal net operating loss carryforwards of approximately $10.0 million that expire at various times between 2032 and 2035. The utilization of those federal net operating losses is limited to approximately $0.8 million per year. Additionally, we have federal net operating loss carryforwards of approximately $68.0 million that have an indefinite carryforward period. The utilization of those federal net operating losses is limited to 80% of taxable income after 2021. We have no foreign net operating loss carryforwards as of September 30, 2022. We have approximately $14.0 million of state net operating loss carryforwards, with various expiration dates and limitations on utilization, depending on the state. As of September 30, 2022, we have approximately $0.8 million of Foreign Tax Credit carryforwards that expire in 2030 and 2031.\nUncertain Tax Positions\nWe have included all of our liabilities for uncertain tax positions with income taxes payable long-term. A reconciliation of the beginning and ending amount of our unrecognized tax benefits is summarized as follows (in thousands):\nYears Ended September 30,\nBalance at beginning of the year\n$\n$\n1,225\n$\n1,272\nAdditions related to tax positions taken in prior years\n-\n-\nReductions due to resolution of uncertain tax position\n-\n(276\n)\n(47\n)\nBalance at the end of the year\n$\n1,004\n$\n$\n1,225\nApproximately $1.0 million of our total unrecognized tax benefits, inclusive of penalties and interest, represents the amount that, if recognized, would favorably affect our effective income tax rate in future periods. We report accrued interest and penalties related to unrecognized tax benefits in income tax expense. We recognized a net (benefit) expense for interest and penalties of $0.1 million, $(0.1) million and $4,000 for 2022, 2021 and 2020, respectively. Income taxes payable long-term on the Consolidated Balance Sheets includes a cumulative accrual for potential interest and penalties of $0.7 million and $0.6 million as of September 30, 2022 and 2021, respectively. We do not expect that the amount of our tax reserves for uncertain tax positions will materially change in the next 12 months other than the continued accrual of interest and penalties.\nTax Return Matters\nWe file income tax returns in China and other foreign jurisdictions, as well as the U.S. and various states in the U.S. We have not signed any agreements with the Internal Revenue Service, any state or foreign jurisdiction to extend the statute of limitations for any fiscal year. As such, the number of open years is the number of years dictated by statute in each of the respective taxing jurisdictions. U.S. Federal tax returns generally have a 3-year statute of limitations. Therefore, U.S. federal returns for tax years ending on or after September 30, 2019 remain open for examination. In addition, the statute for a tax year for which a loss was carried back to remains open for the same period as the year the loss originated. Because the Company filed a net operating loss carryback claim for the tax year ended September 30, 2016 for a loss originating in the tax year ended September 30, 2019, the statute for the carryback claim in 2016 will remain open until 2023. Furthermore, the IRS may adjust attribute carryforwards utilized in an open year even though the year the attributes originated may be closed. State and foreign statutes are generally 3 to 5 years but vary by jurisdiction. These open years contain certain matters that could be subject to differing interpretations of applicable tax laws and regulations as they relate to the amount, timing, or inclusion of revenues and expenses, or the sustainability of income tax positions of Amtech and our subsidiaries.\n13. Long-Term Debt\nWe had a mortgage note secured by BTUs real property in Massachusetts, which was paid in full upon the closing of the sale of this facility in June 2022 (see Note 8). Our remaining long-term debt consists of an equipment finance agreement. Annual maturities relating to our long-term debt as of September 30, 2022 are as follows (in thousands):\nAnnual\nMaturities\n$\nThereafter\n-\nTotal long-term debt\n$\nInterest expense on long-term debt was $0.1 million, $0.2 million and $0.2 million in 2022, 2021 and 2020, respectively.\n14. Equity and Stock-Based Compensation\nStock Repurchase Plans\nThe following table summarizes information related to our stock repurchase plans, in thousands, except share and per share amounts:\nName of Stock Repurchase Plan\nDate Approved by Board\nPlan Term\nAmount Authorized ($)\nAmount Used for Repurchases ($)\nAverage Price Paid per Share ($)\nShares Repurchased (#)\nAmount Available for Repurchases ($)\nPlan Status\nFiscal Year of Repurchases\n2022 Stock Repurchase Plan\n2/10/2022\n1 year\n5,000\n1,400\n9.78\n143,430\n3,600\nOpen\n2021 Stock Repurchase Plan\n2/9/2021\n1 year\n4,000\n2,700\n9.31\n291,383\n-\nExpired\n2020 Stock Repurchase Plan\n2/4/2020\n1 year\n4,000\n2,000\n5.46\n366,000\n-\nExpired\n2019 Stock Repurchase Plan\n11/29/2018\n1 year\n4,000\n-\n-\n-\n-\nExpired\nNA\nAll repurchased shares have been retired.\nStock-Based Compensation Expense\nStock-based compensation expenses of $0.5 million, $0.4 million and $0.3 million for 2022, 2021 and 2020, respectively, are included in selling, general and administrative expenses. As of September 30, 2022, total compensation cost related to non-vested stock options not yet recognized is $0.7 million, which is expected to be recognized over the next 1.19 years on a weighted-average basis.\nAmtech Equity Compensation Plans\nThe 2022 Plan, under which 1,000,000 shares could be granted, was adopted by the Board of Directors in November 2021, and approved by the shareholders in March 2022.\nThe 2007 Plan, under which 500,000 shares could be granted, was adopted by the Board in April 2007, and approved by the shareholders in May 2007. The 2007 Plan was amended in 2009, 2014 and 2015 to add 2,500,000 shares. The\nplan was also amended in 2019 to extend the term of the plan and allow for the grant of restricted stock units. Upon the adoption of the 2022 Plan, no further awards will be granted from the 2007 Plan. Previously issued awards will remain outstanding in accordance with their terms.\nThe Non-Employee Directors Stock Option Plan was approved by the shareholders in 1996 for issuance of up to 100,000 shares of common stock to directors. The Non-Employee Directors Stock Option Plan was amended in 2005, 2009 and 2014 to add 400,000 shares. The plan was also amended in 2020 to extend the term of the plan. Upon the adoption of the 2022 Plan as stated above, no further awards will be granted from the Non-Employee Directors Stock Option Plan. Previously issued awards will remain outstanding in accordance with their terms.\nEquity compensation plans as of September 30, 2022 are summarized in the table below:\nName of Plan\nShares\nAuthorized\nShares\nAvailable for Grant\nOptions\nOutstanding\nPlan\nExpiration\n2022 Plan\n1,000,000\n946,000\n54,000\nMar. 2032\n2007 Plan\n3,000,000\n-\n397,341\nMar. 2024\nNon-Employee Directors Stock Option Plan\n500,000\n-\n138,000\nMar. 2024\n946,000\n589,341\nStock Options\nStock options issued under the terms of our equity compensation plans have, or will have, an exercise price equal to or greater than the fair market value of the common stock at the date of the option grant and expire no later than 10 years from the date of grant. Options issued under the plans vest over 1 to 3 years. We estimated the fair value of stock option awards on the date of grant using the Black-Scholes option pricing model using the following assumptions:\nYears Ended September 30,\nRisk free interest rate\n2%\n1%\n1%\nExpected life\n5 years\n6 years\n6 years\nDividend rate\n0%\n0%\n0%\nVolatility\n57%\n58%\n58%\nThe following table summarizes our stock option activity during 2022, 2021 and 2020:\nYears Ended September 30,\nOptions\nWeighted\nAverage\nExercise\nPrice\nOptions\nWeighted\nAverage\nExercise\nPrice\nOptions\nWeighted\nAverage\nExercise\nPrice\nOutstanding at beginning of period\n608,269\n$\n6.48\n696,665\n$\n7.00\n1,068,665\n$\n7.04\nGranted\n135,500\n$\n12.80\n204,000\n$\n6.25\n32,500\n$\n5.34\nExercised\n(124,475\n)\n$\n5.78\n(241,320\n)\n$\n6.40\n(160,375\n)\n$\n5.47\nForfeited/expired\n(29,953\n)\n$\n6.92\n(51,076\n)\n$\n13.01\n(244,125\n)\n$\n7.94\nOutstanding at end of period\n589,341\n$\n8.06\n608,269\n$\n6.48\n696,665\n$\n7.00\nExercisable at end of period\n358,343\n$\n6.92\n403,853\n$\n6.87\n611,542\n$\n7.19\nWeighted average grant-date\nfair value of options granted\nduring the period\n$\n6.39\n$\n3.33\n$\n2.89\nThe following table summarizes information for stock options outstanding and exercisable as of September 30, 2022:\nOptions Outstanding\nOptions Exercisable\nRange of Exercise Prices\nNumber\nOutstanding\nRemaining\nContractual\nLife\n(in years)\nWeighted\nAverage\nExercise\nPrice Per\nShare\nNumber\nExercisable\nWeighted\nAverage\nExercise\nPrice Per\nShare\n$2.95-$4.90\n62,000\n5.72\n$\n4.64\n62,000\n$\n4.64\n$5.07-$5.52\n86,883\n5.80\n$\n5.38\n66,717\n$\n5.39\n$5.67-$5.67\n113,958\n8.13\n$\n5.67\n38,626\n$\n5.67\n$5.75-$7.01\n77,000\n2.20\n$\n6.70\n77,000\n$\n6.70\n$7.40-$9.98\n114,000\n4.98\n$\n8.75\n84,000\n$\n9.12\n$9.99-$9.99\n6,000\n8.87\n$\n9.99\n6,000\n$\n9.99\n$10.22-$10.22\n24,000\n9.42\n$\n10.22\n-\n-\n$10.71-$10.71\n6,000\n2.52\n$\n10.71\n6,000\n$\n10.71\n$11.51-$11.51\n18,000\n8.48\n$\n11.51\n18,000\n$\n11.51\n$15.43-$15.43\n81,500\n9.13\n$\n15.43\n-\n-\n$2.95-$15.43\n589,341\n6.30\n$\n8.06\n358,343\n$\n6.92\nThe aggregate intrinsic values of options outstanding and options exercisable as of September 30, 2022 were approximately $1.0 million and $0.7 million, respectively, which represents the total pre-tax intrinsic value, based on our closing stock price of $8.50 per share as of September 30, 2022, the last business day of our fiscal year, which would have been received by the option holders had all option holders exercised their options as of that date. The total intrinsic value of stock options exercised during the fiscal years ended September 30, 2022, 2021 and 2020 was $0.8 million, $0.8 million and $0.1 million, respectively.\n15. Benefit Plans\nWe have retirement plans covering substantially all our employees. The principal plans are our defined contribution plan that covers substantially all of our employees in the United States and the multi-employer pension plan for hourly union employees in Pennsylvania. Expense related to both plans is insignificant.\nDefined Contribution Plan - Domestic employees of Amtech and its subsidiaries who meet certain eligibility requirements may participate, at the employees option, in the 401(k) Plan. The 401(k) Plan is a defined contribution plan subject to the provisions of ERISA. We match employee contributions to the 401(k) Plan equal to 60% of the participants' elective deferrals, up to 3.6% of the participants eligible compensation each payroll period. Employees are auto-enrolled upon eligibility at a 6% contribution rate, however, an employee may opt out at their election. The match expense was $0.4 million in 2022 and $0.3 million in 2021 and 2020.\nPension Plan - Our hourly union employees in Pennsylvania participate in a multi-employer pension plan, the NIGPP, in accordance with the union agreement between PR Hoffman and the United Automobile, Aerospace and Agriculture Implement Workers of America. The agreement was renewed in 2022 for a three-year term that expires September 30, 2025. Every company participating in the plan pays a contribution per hour worked for each employee of the company that is eligible to participate in the NIGPP. Our contributions to the NIGPP were $38,000, $39,000 and $44,000 in 2022, 2021 and 2020, respectively.\n16. Commitments and Contingencies\nPurchase Obligations - As of September 30, 2022, we had unrecorded purchase obligations in the amount of $20.0 million. These purchase obligations consist of outstanding purchase orders for goods and services. While the amount represents purchase agreements, the actual amounts to be paid may be less in the event that any agreements are renegotiated, canceled or terminated.\nLegal Proceedings and Other Claims - From time to time, we are a party to claims and actions for matters arising out of our business operations. We regularly evaluate the status of the legal proceedings and other claims in which we are involved to assess whether a loss is probable or there is a reasonable possibility that a loss, or an additional loss, may have been incurred and determine if accruals are appropriate. If accruals are not appropriate, we further evaluate\neach legal proceeding to assess whether an estimate of possible loss or range of possible loss can be made for disclosure. Although the outcome of claims and litigation is inherently unpredictable, we believe that we have adequate provisions for any probable and estimable losses. It is possible, nevertheless, that our consolidated financial position, results of operations or liquidity could be materially and adversely affected in any particular period by the resolution of a claim or legal proceeding. Legal expenses related to defense, negotiations, settlements, rulings and advice of outside legal counsel are expensed as incurred.\nEmployment Contracts - We have employment contracts and change in control agreements with, and severance plans covering, certain officers and management employees under which severance payments would become payable in the event of specified terminations without cause or terminations under certain circumstances after a change in control. If severance payments under the current employment contracts or severance plans were to become payable, the severance payments would generally range from six to twelve months of salary.\n17. Cash Flows\nNon-cash investing activities may include capital expenditures in accounts payable, representing additions purchased at period end but not yet paid in cash. Non-cash investing activities for the year ended September 30, 2022 included $0.2 million of capital expenditures in accounts payable. There were no non-cash capital expenditures in accounts payable for the year ended September 30, 2021. Non-cash investing activities for the year ended September 30, 2020 included $80,000 of capital expenditures in accounts payable.\n18. Reportable Segments\nUpon the acquisition of Intersurface Dynamics in 2021 (see Note 2), we evaluated our organizational structure and concluded that we have two reportable segments following the acquisition.\nAmtech has two operating segments that are structured around the types of product offerings provided to our customers. In addition, the operating segments may be further distinguished by the Companys respective brands. These two operating segments comprise our two reportable segments discussed below. Our two reportable segments are as follows:\nSemiconductor - We design, manufacture, sell and service thermal processing equipment and related controls for use by leading semiconductor manufacturers, and in electronics, automotive and other industries.\nMaterial and Substrate - We produce consumables and machinery for lapping (fine abrading) and polishing of materials, such as sapphire substrates, optical components, silicon wafers, numerous types of crystal materials, ceramics and metal components. Our Material and Substrate segment includes our former SiC/LED segment in addition to Intersurface Dynamics, as they sell complementary products to a similar market.\nInformation concerning our reportable segments is as follows, in thousands:\nYears Ended September 30,\nNet revenue:\nSemiconductor\n$\n87,982\n$\n72,086\n$\n54,516\nMaterial and Substrate\n18,316\n13,119\n10,304\nNon-segment related\n-\n-\n$\n106,298\n$\n85,205\n$\n65,463\nOperating income (loss):\nSemiconductor\n$\n20,672\n$\n8,585\n$\n4,168\nMaterial and Substrate\n3,728\nNon-segment related\n(7,114\n)\n(5,138\n)\n(5,337\n)\n$\n17,286\n$\n3,725\n$\n(485\n)\nYears Ended September 30,\nCapital expenditures:\nSemiconductor\n$\n$\n2,264\n$\nMaterial and Substrate\n1,724\nNon-segment related\n$\n1,135\n$\n3,012\n$\n2,675\nDepreciation and amortization expense:\nSemiconductor\n$\n1,101\n$\n$\nMaterial and Substrate\nNon-segment related\n$\n1,729\n$\n1,398\n$\n1,078\nSeptember 30,\nIdentifiable assets:\nSemiconductor\n$\n75,622\n$\n70,631\nMaterial and Substrate\n22,032\n19,541\nNon-segment related*\n35,880\n26,741\n$\n133,534\n$\n116,913\n*\tNon-segment related assets include cash, property and other assets.\n19. Major Customers and Sales by Country\nIn 2022, two Semiconductor customers accounted for 14% and 12% of net revenues. In 2021, two Semiconductor customers accounted for 14% and 13% of net revenues. In 2020, one Semiconductor customer accounted for 11% of net revenues.\nOur net revenues for 2022, 2021 and 2020 were to customers in the following geographic regions:\nYears Ended September 30,\nUnited States\n%\n%\n%\nOther\n%\n%\n%\nTotal Americas\n%\n%\n%\nChina\n%\n%\n%\nMalaysia\n%\n%\n%\nTaiwan\n%\n%\n%\nOther\n%\n%\n%\nTotal Asia\n%\n%\n%\nGermany\n%\n%\n%\nAustria\n%\n%\n-\n%\nOther\n%\n%\n%\nTotal Europe\n%\n%\n%\n%\n%\n%\n20. Geographic Regions\nWe have continuing operations in the United States and China, as well as satellite offices in Europe and Asia. Revenues, operating income (loss) and identifiable assets by geographic region are as follows, in thousands:\nYears Ended September 30,\nNet revenue:\nUnited States*\n$\n89,197\n$\n58,937\n$\n48,089\nChina\n13,854\n22,828\n13,510\nOther\n3,247\n3,440\n3,864\n$\n106,298\n$\n85,205\n$\n65,463\nOperating income (loss):\nUnited States*\n$\n14,163\n$\n(4,174\n)\n$\n(5,814\n)\nChina\n2,003\n6,958\n4,744\nOther\n1,120\n$\n17,286\n$\n3,725\n$\n(485\n)\n*\tUnited States revenue includes $22.7 million, $19.7 million and $14.9 million in 2022, 2021 and 2020, respectively, related to the products manufactured in our China facility but sold through our Massachusetts facility.\nSeptember 30,\nNet property, plant and equipment:\nUnited States\n$\n4,981\n$\n11,990\nChina\n1,571\n2,093\n$\n6,552\n$\n14,083\n21. Supplementary Financial Information\nThe following is a summary of the activity in our allowance for doubtful accounts, in thousands:\nYears Ended September 30,\nBalance at beginning of year\n$\n$\n$\nProvision\n(34\n)\nWrite offs\n(2\n)\n(26\n)\nAdjustment (1)\n(46\n)\n(13\n)\n(73\n)\nBalance at end of year\n$\n$\n$\n(1)\tPrimarily foreign currency translation adjustments.\nOur net accounts receivable as of September 30, 2022, 2021 and 2020 was $25.0 million, $22.5 million and $11.2 million, respectively.\n22. Discontinued Operations and Disposals\nDiscontinued Operations\nIn April 2019, we announced that the Board determined that it was in the long-term best interest of Amtech to exit the solar business segment and focus our strategic efforts on our non-Solar segments in order to more fully realize the opportunities presented in those areas. The Board made its decision, effective March 28, 2019, after analyzing current market conditions and the strategic outlook for its Solar segment, which operates in a highly competitive market among lower cost manufacturers, particularly in China.\nThe divestiture of our solar business included our Tempress and SoLayTec subsidiaries, which comprised substantially all of our Solar segment. We adopted a plan to sell our Solar operations on or before March 31, 2020. As such, we\nclassified substantially all of the Solar segment as held for sale in our Consolidated Balance Sheets and reported its results as discontinued operations in our Consolidated Statements of Operations. SoLayTec was sold in fiscal 2019.\nEffective January 22, 2020 (Tempress Sale Date), we completed the sale of Tempress for nominal consideration to a third party located in the Netherlands. In connection with this sale transaction, we provided an unsecured term loan to Tempress in the principal sum of $2.25 million, to be used to fund Tempress working capital requirements and to facilitate the restructuring of Tempress operations. We forgave $0.5 million of the loan in accordance with the terms of the loan agreement. The balance of the loan was paid in full during 2020. We recorded a pre-tax loss on sale of approximately $10.9 million, of which approximately $7.2 million was the recognition of previously recorded accumulated foreign currency translation losses. The total pre-tax loss did not have a material effect on our cash balances at our continuing operations. We also recognized a significant tax benefit relating to this loss, which can be carried over to future years. Effective on the Tempress Sale Date, Tempress is no longer included in our consolidated financial statements.\nOperating results of our discontinued solar operations were as follows, in thousands:\nYear Ended September 30,\nRevenue, net\n$\n7,442\nCost of sales\n5,969\nGross profit\n1,473\nSelling, general and administrative\n1,814\nResearch, development and engineering\nRestructuring charges\nOperating loss\n(918\n)\nLoss on sale of subsidiary\n(10,916\n)\nInterest expense and other, net\n(29\n)\nLoss from discontinued operations before income taxes\n(11,863\n)\nIncome tax benefit\n(47\n)\nNet loss\n$\n(11,816\n)\nAmtechs Consolidated Statement of Cash flows combines cash flows from discontinued operations with cash flows from continuing operations within each cash flow statement category. The following table summarizes selected cash flow information for discontinued operations, in thousands:\nYear Ended September 30,\nLoss from discontinued operations, net of tax\n$\n(11,816\n)\nDepreciation and amortization\n$\nReversal of allowance for doubtful accounts, net\n$\n(62\n)\nLoss on sale of subsidiary\n$\n(10,916\n)\nPurchases of property, plant and equipment\n$\nOther Disposal\nR2D - On December 13, 2019 (R2D Sale Date), we finalized the sale of R2D to certain members of R2Ds management team. Upon the sale, we recognized a loss of approximately $2.8 million, which we reported as loss on sale of subsidiary in our Consolidated Statements of Operations for the year ended September 30, 2020. Effective on the R2D Sale Date, R2D is no longer included in our consolidated financial statements. R2D did not meet the discontinued operations or held-for-sale criteria. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures\nOur management, including our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), has carried out an evaluation of the effectiveness of our disclosure controls and procedures as defined in Exchange Act Rules 13a-15(e) and 15(d)-15(e). Based upon that evaluation, our CEO and CFO have concluded that our disclosure controls and procedures in place were effective as of September 30, 2022.\nManagements Report on Internal Control Over Financial Reporting\nTo the Shareholders of Amtech Systems, Inc.\nThe management of Amtech Systems, Inc. is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, our controls and procedures may not prevent or detect misstatements. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the controls system are met. Because of the inherent limitations in all controls systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected.\nOur management evaluated the effectiveness of our internal control over financial reporting as of September 30, 2022. In making this evaluation, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework (2013). Based on our evaluation we believe that, as of September 30, 2022, our internal control over financial reporting was effective based on those criteria.\nChanges in Internal Control Over Financial Reporting\nThere have not been any changes in the Companys internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the quarter ended September 30, 2022 that materially affected, or are reasonably likely to materially affect, the internal control over financial reporting of the Company. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nPursuant to Paragraph G(3) of the General Instructions to Form 10-K, the information required by Part III of Form 10-K is incorporated by reference to the Proxy Statement to be filed within 120 days of September 30, 2022, our fiscal year end. In the event the Proxy Statement is not filed within 120 days, the information required by Part III of this Form 10-K will be filed pursuant to an amendment to this Annual Report on Form 10-K within the 120-day period. ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND GOVERNANCE\nThe information required by this item (i) is incorporated herein by reference to the Proxy Statement or (ii) will be filed pursuant to an amendment to this Annual Report on Form 10-K, in each case, within 120 days of September 30, 2022, our fiscal year end. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this item (i) is incorporated herein by reference to the Proxy Statement or (ii) will be filed pursuant to an amendment to this Annual Report on Form 10-K, in each case, within 120 days of September 30, 2022, our fiscal year end. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this item (i) is incorporated herein by reference to the Proxy Statement or (ii) will be filed pursuant to an amendment to this Annual Report on Form 10-K, in each case, within 120 days of September 30, 2022, our fiscal year end. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item (i) is incorporated herein by reference to the Proxy Statement or (ii) will be filed pursuant to an amendment to this Annual Report on Form 10-K, in each case, within 120 days of September 30, 2022, our fiscal year end. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this item (i) is incorporated herein by reference to the Proxy Statement or (ii) will be filed pursuant to an amendment to this Annual Report on Form 10-K, in each case, within 120 days of September 30, 2022, our fiscal year end.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements and Schedules\nThe consolidated financial statements required by this item are set forth on the pages indicated in Item 8.\nAll financial statement schedules are omitted because they are either not applicable or because the required information is shown in the consolidated financial statements or notes thereto.\n(b) Exhibits\nThe exhibits filed as part of this Annual Report on Form 10-K are listed on the Exhibit Index immediately preceding the signature page hereto, which is incorporated herein by reference.\nITEM 16. FORM 10-K SUMMARY\nNone.\nEXHIBIT INDEX\nINCORPORATED BY REFERENCE\nEXHIBIT\nNO.\nEXHIBIT DESCRIPTION\nFORM\nFILE\nNO.\nEXHIBIT\nNO.\nFILING\nDATE\nFILED\nHEREWITH\n3.1\nAmended and Restated Articles of Incorporation, as amended through February 6, 2012\n10-Q\n000-11412\n3.1\nFebruary 9, 2012\n3.2\nAmended and Restated Bylaws of Amtech Systems, Inc., dated as of September 23, 2020\n8-K\n000-11412\n3.1\nSeptember 25, 2020\n3.3\nFirst Amendment to Amended and Restated and Restated Bylaws (effective as of November 16, 2021)\n8-K\n000-11412\n3.1\nNovember 19, 2021\n4.1\nDescription of Capital Stock\nX\n10.1\nNon-Employee Directors Stock Option Plan, effective July 8, 2005 as amended through May 8, 2014*\n8-K\n000-11412\n10.1\nMay 14, 2014\n10.1a\nAmendment to the Non-Employee Directors Stock Option Plan, effective March 4, 2020*\nDEF14A\n000-11412\nAppendix A\nJanuary 24, 2020\n10.2\n2007 Employee Stock Incentive Plan of Amtech Systems, Inc., as amended, effective April 9, 2015*\n8-K\n000-11412\n10.4\nApril 10, 2015\n10.2a\nAmendment to 2007 Employee Stock Incentive Plan of Amtech Systems, Inc., effective March 6, 2019*\nDEF14A\n000-11412\nAppendix A\nJanuary 25, 2019\n10.3\nSecond Amended and Restated Employment Agreement between Amtech Systems, Inc. and Jong S. Whang, dated February 9, 2012*\n10-Q\n000-11412\n10.1\nFebruary 9, 2012\n10.4\nAmendment, dated as of July 1, 2012, to the Second Amended and Restated Employment Agreement between Amtech Systems, Inc. and Jong S. Whang, dated as of February 9, 2012*\n10-Q\n000-11412\n10.2\nAugust 9, 2012\n10.5\nSecond Amendment, dated June 28, 2013, to the Second Amended and Restated Employment Agreement between Amtech Systems, Inc. and Jong S. Whang, dated as of February 9, 2012*\n10-Q\n000-11412\n10.15\nAugust 8, 2013\n10.6\nFourth Amendment to Employment Agreement between Amtech Systems, Inc. and Jong S. Whang, dated April 9, 2015*\n8-K\n000-11412\n10.1\nApril 10, 2015\n10.7\nFifth Amendment to Employment Agreement, dated November 19, 2015, by and between the Company and Jong S. Whang*\n8-K\n000-11412\n10.1\nNovember 19, 2015\n10.8\nAmtech Systems, Inc. 2022 Equity Incentive Plan*\nS-8\n333-263875\n99.1\nMarch 25, 2022\n10.9\nJong S. Whang Separation Agreement*\nX\n21.1\nSubsidiaries of the Registrant\nX\n23.1\nConsent of Independent Registered Public Accounting Firm - Grant Thornton LLP\nX\n23.2\nConsent of Independent Registered Public Accounting Firm - Mayer Hoffman McCann P.C.\nX\nPowers of Attorney\nX\n31.1\nCertification Pursuant to Rule 13a-14(a)/15d-14(a) of the Securities Exchange Act of 1934, as Amended\nX\n31.2\nCertification Pursuant to Rule 13a-14(a)/15d-14(a) of the Securities Exchange Act of 1934, as Amended\nX\n32.1\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.PRE\nInline Taxonomy Presentation Linkbase Document\nX\n101.CAL\nInline XBRL Taxonomy Calculation Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Label Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\nThe cover page for the Companys Annual Report on Form 10-K for the year ended September 30, 2021, has been formatted in Inline XBRL\nX\n*\tIndicates management contract or compensatory plan.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAMTECH SYSTEMS, INC.\nNovember 30, 2022\nBy:\n/s/ Lisa D. Gibbs\nLisa D. Gibbs, Vice President, Chief Financial Officer and Director\n(Principal Financial Officer and Duly Authorized Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report on Form 10-K has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nSIGNATURE\nTITLE\nDATE\n*\nChief Executive Officer and Director\nNovember 30, 2022\nMichael Whang\n(Principal Executive Officer)\n/s/ Lisa D. Gibbs\nVice President, Chief Financial Officer and Director\nNovember 30, 2022\nLisa D. Gibbs\n(Principal Financial Officer and Principal Accounting Officer)\n*\nChairman of the Board\nNovember 30, 2022\nRobert C. Daigle\n*\nDirector\nNovember 30, 2022\nRobert M. Averick\n*\nDirector\nNovember 30, 2022\nMichael Garnreiter\n*\nDirector\nNovember 30, 2022\nSukesh Mohan\n*\nDirector\nNovember 30, 2022\nJong S. Whang\n*By: /s/ Lisa D. Gibbs\nLisa D. Gibbs, Attorney-In-Fact**\n**\tBy authority of the power of attorney filed as Exhibit 24 hereto."
}