{
    "cik": "725394",
    "company": "DALRADA FINANCIAL CORP",
    "filing_type": "10-K",
    "filing_date": "2023-10-19",
    "period_of_report": "2023-06-30",
    "sic": "7363",
    "state_of_inc": "WY",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/725394/0001683168-23-007283-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/725394/000168316823007283/dalrada_i10k-063023.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/725394/0001683168-23-007283.txt",
    "filename": "725394_10K_2023_0001683168-23-007283.htm",
    "content": "Item 1. Description of Business\nCompany Overview\nMoving the world forward takes bold resolve that turns ideas into actions and builds real-time solutions that positively impact people and the planet. Dalrada accelerates positive change for current and future generations by harnessing true potential and developing products and services that become transformative innovations.\nDalrada Financial Corporation, (Dalrada), was incorporated in September 1982 under the laws of the State of California. It was reincorporated in May 1983 under the laws of the State of Delaware and reincorporated again on May 5, 2020, under the laws of the state of Wyoming. Dalrada Financial Corporation trades under the symbol, OTCQB: DFCO.\nDalrada has five business divisions: Genefic (formerly Dalrada Health), Dalrada Energy Services, Dalrada Precision Manufacturing, Dalrada Technologies and Dalrada Corporate. Within each of these divisions, the Company drives transformative innovation while creating solutions that are sustainable, accessible, and affordable. Dalradas global solutions directly address climate change, gaps in the health care industry, and technology needs that facilitate a new era of human behavior and interaction and ensure a bright future for the world around us.\nGenefic (formerly Dalrada Health)\nGenefic delivers advanced health care solutions with dedicated products, services, and systems. From virus and disease screening capabilities to pharmaceutical goods and holistic wellness clinics, When the world needs advanced health care, Genefic delivers with ingenuity, accessibility, and affordability. This specialized division is committed to developing key health products, lifesaving medications and building comprehensive systems to increase capability, strive to keep people healthy with the goals of improving their quality of life and increasing their longevity- on a global level.\nEmpower Genomics (Empower)- Empower is Dalradas wholly owned diagnostic laboratory subsidiary which processes molecular diagnostic and antibody tests to support the diagnosis of COVID-19 and the detection of immune response to the virus. Empower has built up and maintained the testing capacity to handle surges in COVID-19 testing demands. Empower also offers genetic testing capabilities including Pharmacogenomics, Nutraceutical, Nutrition/Diet DNA and Exercise/Fitness DNA tests.\nPala Diagnostics (Pala)- Pala is a joint venture diagnostic laboratory entity which processes both molecular diagnostic and antibody tests to support the diagnosis of COVID-19 and the detection of immune response to the virus.\nSolas Corp. (Solas)- Solas manages and oversees wellness clinics throughout Southern California including the Sòlas Rejuvenation + Wellness clinics (Sòlas). Through advanced medical techniques and modern technology, Sòlas delivers a clinical experience that helps men and woman live their best life, whether its through simple cosmetic procedures, pain-reducing practices, or anti-aging therapies. Through its three locations, Sòlas prides itself on its dedicated service-focused, health-first approach. Its wellness & rejuvenation clinics deliver with a focus on regenerative therapies, IV and injection services, cosmetic enhancements amongst a myriad of additional health centric services.\nInternational Health Group (IHG)- IHG provides highly trained nursing and medical assistants for hospitals and home health facilities since 2006. IHG Medical Assistant programs include Certified Nursing Assistant (CNA\") and Home Health Aide (HHA) training and the fast-track 22-Day CNA Certification Program at its state-approved testing facility.\nPacific Stem Cells (PSC)- PSC markets and sells traditional biologics and human cells, tissues, and cellular and tissue-based products (HCT/Ps).\nWatson Rx Solutions (Watson)- In June 2022, the Company acquired Watson, an Alabama-based pharmacy with more than 30 years of experience in the retail medical and pharmaceutical industries. Watson specializes in providing expert care and managing disease states through comprehensive prescription management, education, nursing, and total health solutions. Watson maintains pharmacy licenses in all 50 States including Washington D.C.\nGlanHealth (GlanHealth)- Genefic Products launched GlanHealth in 2020 to distribute alcohol-free hand sanitizers, surface cleaners, laundry aides, antimicrobial solutions, electrostatic sprayers, face masks, gloves, kits, and delivery equipment such as dispensers, stands, and ease of use packaging for the end consumer. GlanHealth leverages an extensive supply chain of producers, resellers, distributors, vendors, and formulators for the development, sale, and marketing of its products and services.\nDalrada Energy Services\nDalrada Energy Services (‘DES) employs next-generation technology that enhances clean energy efforts while reducing the worlds carbon footprint. Through innovative products and commercial services, DES facilitates energy transition for universities, businesses, government buildings, and more. Reducing the worlds carbon footprint and achieving international Net Zero goals are no easy task. Fortunately, Dalrada Energy Services knows how and where to start. By providing robust commercial services that help organizations meet or exceed environmental standards, DES helps mitigate negative impacts for real-world energy transition while removing cost barriers for clients through innovative financing and savings share models.\nDalrada Energy Services (DES)- DES provides end-to-end comprehensive energy service solutions in a robust commercial capacity. DES helps organizations meet environmental, social, and governance (ESG) goals and standards while mitigating negative environmental impacts.\nBothof Brothers Construction (Bothof)- Bothof is a licensed general contractor which provides a wide range of development, construction and design capabilities and expertise throughout the United States. Through Bothofs extensive experience in construction and contracting, the DES division can provide a myriad of additional services to its private and public works customers.\nDalrada Precision Manufacturing\nDalrada Precision Manufacturing creates total manufacturing solutions that start with the design and development of high-quality machine parts and components, and end with an efficient global supply chain. This specialized business division can meet todays high demands and solves industry challenges. Dalrada Precision Manufacturing is confident that it redefines the critical quality of the worlds top components and responds with in-house research, design, engineering, and distribution through a highly reliable global supply chain and improved time-to-market capabilities.\nDalrada Precision Parts (Precision)- Precision extends the client its engineering and operations team by helping devise unique manufacturing solutions tailored to their products. Dalrada Precision can enter at any stage of the product lifecycle from concept and design to mass production and logistics.\nLikido Ltd. (Likido)- Likido is an international engineering company developing advanced solutions for the harvesting and recycling of energy. Using its novel, heat pump systems (patent pending), Likido is working to revolutionize the renewable energy sector with the provision of innovative modular process technologies to maximize the capture and reuse of thermal energy for integrated heating and cooling applications. With uses across industrial, commercial and residential sectors, Likido provides cost savings and minimized carbon emissions across global supply chains. Likido's technologies enable the effective recovery and recycling of process energy, mitigating against climate change and expected enhancement of quality of life through the provision of low-carbon heating and cooling systems.\nDuring the prior year, the U.S. Government selected Dalradas Likido®ONE high-performance, low-carbon heat pump for real-world testing in a prestigious clean energy program. The implementation of the Likido®ONE testing is still in process. The expected positive results should not only increase market acceleration and adoption within the federal government acceptance of groundbreaking eco-friendly technology but should also accelerate adoption within the commercial building industry.\nIgnite I.T. (Ignite)- Ignite is a manufacturer and seller of eco-friendly deep cleaners, parts washers and degreasers that are specially formulated to lift hydrocarbon-based dirt and grease from virtually all surfaces with minimal effort. Ignite products are non-flammable, non-corrosive, non-toxic, butyl-free, water-based, and leave a light citrus scent. Ignite is developed for all surfaces suitable for water and meets or exceed the most stringent industry-testing specifications.\nDeposition Technologies (DepTec)- Dalrada Precision Manufacturing acquired DepTec in April 2022. DepTec designs, develops, manufactures, and services chemical vapor and physical vapor deposition systems for the microchip and semiconductor industries.\nDepTec has built an impressive catalogue of precision OEM parts for PVD (Physical vapor deposition) systems and the Companys refurbished systems which allows clients the option of purchasing the same model of system theyve been using for decades -but with significant upgrades and improved efficiencies. Older systems can now operate more reliably with additional control and monitoring plus longer lifespans. DepTec also has its own PVD and CVD (Chemical Vapor Deposition) systems, EVOS-PVD and EVOS -CVD, which deposits metals and non-metals for microchips used in almost every standard and specialized microdevices made today and in the future. These systems can produce a superior film layer utilized in rugged high-stress environment designs.\nDalrada Technology Limited (DTL)- Dalrada Precision Manufacturing Inc. entered into an Ownership Purchase Agreement to purchase all of the membership interests in Dalrada Technology Limited on March 1, 2023. DTL is a holding company for all European based Dalrada Precision entities.\nDalrada Technology Spain L.T. (DTS)- DTS was established as a Spanish subsidiary of DTL for the expansion of the manufacturing and sale of the Companys heat pump technology throughout Europe.\nDalrada Technologies\nDalrada Technologies has worked with some of the worlds most recognizable companies, providing digital engineering for cutting-edge software systems and offering a host of robust digital services. This business division connects the world with integrated technology and innovative solutions, delivering advanced capabilities and error-free results. Dalrada Technologies creates digital products with expert computer information technology and software engineering services for a variety of technical industries and clients in both B2B and B2C environments.\nPrakat (Prakat)- Prakat is an ISO 9001-certified company that provides end-to-end technology services across various industries, improving the value chain. The Company specializes in test engineering, accessibility engineering, product engineering, application modernization, billing and revenue management, CRM, and block chain. Prakat provides global customers with software and technology solutions specializing in Test Engineering, Accessibility Engineering, Product Engineering and Application Modernization.\nDalrada Corporate\nDalrada Corporate covers the activities which support the entire suite of Dalrada subsidiaries. Dalrada Corporate includes the areas of administration, finance, human resources, legal advice, information technology, and marketing. It also contains executive management and shareholder-related services.\nResearch and Development\nWe spent $120,000 and $656,997 on research and development activities during the years ended June 30, 2023, and 2022, respectively. We anticipate that we will incur additional expenses on research and development over the next 12 months. Our planned expenditures on our operations or a business combination are summarized under the section of this annual report entitled Managements Discussion and Analysis of Financial Position and Results of Operations. Item 1A. Risk Factors\nNot applicable to smaller reporting companies. Item 1B. Unresolved Staff Comments\nNot applicable to smaller reporting companies. Item 2. Description of Property\nWe currently lease 114,542 square feet of office, medical, pharmacy and warehouse space in California, Alabama, Texas, Scotland, and India, with leases that expire through 2028.\nThe following table sets forth information with respect to our facilities:\nSquare\nFootage Lease\nLocation Type (approximate) Expiration\nEscondido, California Corporate Headquarters 49,530 6/30/2027\nSan Diego, California Office 8,228 3/14/2028\nEscondido, California Office 2,992 6/30/2027\nChula Vista, California Office, Medical Suite 3,200 11/12/2024\nSan Diego, California Office, Medical Suite 9,016 8/31/2028\nPoway, California Medical Suite 2,504 7/31/2024\nBengaluru, India Office 3,300 4/1/2026\nCoronado,California Office, Medical Suite 12/31/2024\nFlorence, Alabama Pharmacy 1,443 5/31/2024\nLivingston, Scotland Office, Warehouse 4,500 8/27/2025\nEscondido, California Office 12/31/2024\nLivingston, Scotland Office, Warehouse 19,000 11/2/2027\nSan Diego, California R&D Laboratory Space 1,200 10/31/2023\nBergondo, Spain Office, Warehourse 9,000 5/31/2028 Item 3. Legal Proceedings\nGenefic Products (Dalrada Health), a subsidiary of Dalrada Financial Corporation, formed a joint venture with Vivera Pharmaceuticals, Inc. (Vivera), whereby Vivera is the minority member. As the managing member of the joint venture, Genefic Products, in December 2021, filed suit against Vivera and Paul Edalat, Viveras Chairman and CEO, for misappropriation of funds on behalf of the joint venture in the amount of $2,104,509. In addition to filing a cross-complaint against Genefic Products, Vivera filed a separate complaint against Dalrada Financial Corporation, Empower Genomics (a subsidiary of Dalrada Financial Corporation), Dalrada Financial Corporations officers, and other unrelated parties. The proceedings are being held at the Superior Court of the State of California, for the County of Orange - Central Justice Center.\nOn January 10, 2023, the Company settled a dispute between Likido Ltd. and a US based customer, MAPtech Packaging Inc (MAPtech). Pursuant to the settlement, the Company shall pay the sum of $429,987 in damages, $42,374 in legal costs, and £19,754 as reimbursement for arbitration fees and expenses paid on account by MAPtech. The Company shall pay interest at a rate of 8% per annum simple on all sums due pursuant to settlement, beginning 30 days from the date of the award. Item 4. Mine Safety Disclosures\nNot applicable to our Company.\nPART II Item 5. Market for Common Equity, Related Stockholder Matters and Small Business Issuer Purchases of Equity Securities\nMarket Information\nOur shares of common stock are listed on the OTC Markets Pink Sheets under the symbol DFCO. Set forth below are high and low bid prices for our common stock for each quarterly period in the two most recent fiscal years. Such quotations reflect inter-dealer prices, without retail mark-up, markdown or commissions and may not necessarily represent actual transactions in the common stock.\nPeriod High Low\nFiscal 2023\nFirst Quarter ended September 30, 2022 $ 0.3700 $ 0.0900\nSecond Quarter ended December 31, 2022 $ 0.1700 $ 0.0700\nThird Quarter ended March 31, 2023 $ 0.0200 $ 0.0800\nFourth Quarter ended June 30, 2023 $ 0.1900 $ 0.0600\nFiscal 2022\nFirst Quarter ended September 30, 2021 $ 0.3590 $ 0.0100\nSecond Quarter ended December 31, 2021 $ 0.9200 $ 0.2890\nThird Quarter ended March 31, 2022 $ 0.9190 $ 0.2650\nFourth Quarter ended June 30, 2022 $ 0.7200 $ 0.0300\nNumber of Holders\nAs of June 30, 2023, there were 88,699,139 issued and outstanding shares of common stock held by a total of 560 shareholders of record.\nDividends\nNo cash dividends were paid on our shares of common stock during the fiscal years ended June 30, 2023, and 2022. We have not paid any cash dividends since our inception and do not foresee declaring any dividends on our common stock in the foreseeable future.\nRecent Sales of Unregistered Securities\nCommon Stock Transactions - Fiscal 2023\nIn July 2022, November 2022, December 2022, March 2023 and April 2023, the Company issued a total of 1,999,998 shares of common stock related to the acquisition of DepTec (SSCe).\nIn July 2022, the Company issued 500,000 common stock shares pursuant to a consulting agreement for management services.\nIn December 2022, March 2023 and April 2023, the Company issued a total of 500,000 shares of common stock related to the acquisition of Watson.\nIn September 2022, December 2022, and March 2023, the Company issued a total of 375,000 shares of common stock related to the acquisition of International Health Group.\nIn September and December 2022, the Company issued a total of 175,000 shares of common stock related to the acquisition of Pacific Stem Cells.\nDuring the year ended June 30, 2023, the Company issued a total of 10,974,521 shares of common stock pursuant to the conversion of $1,495,528 of convertible debt and its related premium and interest expense.\nIn April 2023, the Company issued 2,000,000 common stock shares pursuant to a consulting agreement for management services to increase the investment community's awareness of the Company.\nCommon Stock Transactions - Fiscal 2022\nIn August 2021, December 2021, March 2022, and May 2022, the Company issued 87,500 shares of common stock related to the acquisition of PSC (see Note 4. Business Combinations and Asset Acquisition for additional information).\nIn October 2021, December 2021, March 2022, and May 2022, the Company issued 125,000 shares of common stock related to the acquisition IHG (see Note 4. Business Combinations and Asset Acquisition for additional information).\nIn September 2021, the Company repurchased 329,478 shares of common stock from a Company employee.\nIn September 2021, the Company issued 2,000,000 shares of common stock to board members.\nIn October 2021, the Company issued 250,000 shares to Vivera pursuant to the Pala agreement (see Note 3. Investment in Pala Diagnostics for additional information).\nIn December 2021, the Company issued 500,000 shares of common stock pursuant to a consulting agreement.\nIn December 2021, the Company cancelled 6,500,000 common shares issued to its Directors, and an advisor, and returned them to treasury.\nIn March 2022, the Company issued 192,000 shares of common stock pursuant to a consulting agreement.\nIn June of 2022, the Company issued 164,659 shares of common stock pursuant to the conversion of $68,630 of convertible debt and its related premium and interest expense.\nIn June 2022, the Company issued 208,777 shares of common stock pursuant to the conversion of $65,034 of convertible debt and its related premium and interest expense.\nIn June 2022, the Company issued 500,000 shares of common stock related to the acquisition of Watson (see Note 4. Business Combinations and Asset Acquisition for additional information).\nPreferred Stock:\nThe Company has 100,000 shares authorized of Series F Preferred Stock (Series F Stock), par value, $0.01, of which 5,000 shares of Series F Stock (at a fair value of $170) were issued to the CEO in December 2019. Each share of Series F Stock entitles the holder to the greater of (i) one hundred thousand votes for each share of Series F Stock, or (ii) the number of votes equal to the number of all outstanding shares of Common Stock, plus one additional vote such that the holders of Series F Stock shall always constitute most of the voting rights of the Corporation. In any vote or action of the holders of the Series F Stock voting together as a separate class required by law, each share of issued and outstanding Series F Stock shall entitle the holder thereof to one vote per share. The holders of Series F Stock shall vote together with the shares of Common Stock as one class.\nOn February 1, 2022, the Company converted $6,532,206 of related party debt principal and interest into 10,002 shares of Series G Convertible Preferred Stock (Series G Stock). The Series G Stock shall convert at one share of Series G Stock to 2,177 shares of common stock (equivalent to converting the related dollars into common shares at $0.30 per share). Series G Stock does not have voting rights.\nOn April 4, 2023, the Company converted $4,544,224 of related party debt principal and interest into 15,002 shares of Series H Convertible Preferred Stock (Series H Stock). The Series H Stock shall convert at one share of Series H Stock to 3,029 shares of common stock (equivalent to converting the related dollars into common shares at $0.10 per share). Series H Stock does not have voting rights.\nOn June 23, 2023, the Company converted $29,315,320 of related party debt principal and interest into 35,108 shares of Series I Convertible Preferred Stock (Series I Stock). The Series I Stock shall convert at one share of Series I Stock to 5,000 shares of common stock (equivalent to converting the related dollars into common shares at $0.167 per share). Series I Stock does not have voting rights.\nPurchase of our Equity Securities by Officers and Directors\nNone.\nOther Stockholder Matters\nNone Item 6. Selected Financial Data\nNot applicable to smaller reporting companies. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis in conjunction with our financial statements, including the notes thereto, included in this Report. Some of the information contained in this Report may contain forward-looking statements within the meaning of Section 27A of the Securities Exchange Act of 1933, as amended (the Act) and Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). This information may involve known and unknown risks, uncertainties and other factors which may cause our actual results, performance, or achievements to be materially different from future results, performance or achievements expressed or implied by any forward-looking statements. Forward-looking statements which involve assumptions and describe our future plans, strategies and expectations, are generally identifiable by the use of the words may, will, should, expect, anticipate, estimate, believe, intend or project or the negative of these words or other variations on these words or comparable terminology. These forward-looking statements are based on assumptions that may be incorrect, and there can be no assurance that the projections included in these forward-looking statements will come to pass. Our actual results could differ materially from those expressed or implied by the forward-looking statements as a result of various factors. We undertake no obligation to update publicly any forward-looking statements for any reason, even if new information becomes available or other events occur in the future.\nOur Independent Registered Public Accounting Firms report contains a statement that our net loss and limited working capital raise substantial doubt about our ability to continue as a going concern. Our independent registered public accountants have stated in their report (included in Item 8 of the Financial Statements) that our significant operating losses and working capital deficit raise substantial doubt about our ability to continue as a going concern. We incurred a net loss of $20,627,721 and 11,571,783, respectively, for the years ended June 30, 2023 and 2022. Although the Company continues to rely on equity and debt investors to finance its losses, it is implementing plans to achieve cost savings and other strategic objectives to address Company profitability. In addition to raising debt and equity financing, the Company continues to focus on growing the subsidiaries anticipated to be most profitable while reducing investments in areas that are not expected to have long-term benefits. The Company will continue to pursue synergistic opportunities to enhance its business portfolio.\nAcquisitions\nDuring the year ended June 30, 2023, the Company acquired a business to complement both the Dalrada Energy Services and Dalrada Precision Manufacturing segments, respectively. A total of 4,000,000 warrants were issued in relation to the acquisitions.\nRefer to Note 4. Business Combinations and Asset Acquisition to the Consolidated Financial Statements for discussion regarding the Companys acquisitions.\nRESULTS OF OPERATIONS\nThe following table sets forth the results of our operations for the years ended June 30, 2023, and 2022:\nYear Ended June 30, 2023\nGenefic Dalrada Energy Dalrada Precision Manufacturing Dalrada Technologies Corporate Consolidated\nRevenues $ 15,740,919 $ 7,075,414 $ 4,873,225 $ 2,049,411 $ - $ 29,738,969\nIncome (Loss) from Operations (5,783,441 ) (1,065,221 ) (2,461,219 ) 10,634 (11,660,710 ) (20,959,957 )\nYear Ended June 30, 2022\nGenefic Dalrada Energy Dalrada Precision Manufacturing Dalrada Technologies Corporate Consolidated\nRevenues $ 13,617,639 $ 1,261,774 $ 2,123,437 $ 2,239,763 $ 25,000 $ 19,267,613\nIncome (Loss) from Operations 2,225,304 967,639 (2,834,342 ) 30,177 (10,824,022 ) (10,435,244 )\nDalrada Financial Corporation manages five primary segments: 1) Genefic (formerly Dalrada Health); 2) Dalrada Energy; 3) Dalrada Precision Manufacturing; 4) Dalrada Technologies; and 5) Dalrada Corporate. The business segment data (see Note 13 to the accompanying Consolidated Financial Statements) should be read in conjunction with this discussion.\nDuring the year we continued to establish products and services through a strategic vertical integration approach. Dalrada leveraged its resources to increase market share across all operating segments as well as acquired companies to enhance and strengthen the existing suite of businesses.\nIn the first quarter of the year, our Dalrada Energy Services subsidiary entered into an agreement with Averett University for the installation and retrofit of the various energy consuming equipment and components across its campus.\nIn the second quarter of the year, the Company acquired Bothof Brothers Construction, a licensed general contractor which provides a wide range of development, construction and design capabilities and expertise throughout the United States. Through Bothofs extensive experience in construction and contracting, the Dalrada Energy Services division is able to provide a myriad of additional services to its private and public works customers.\nIn the third quarter, the Company acquired Dalrada Technology Limited, to establish an existing holding company for all European subsidiaries.\nRevenues and Cost of revenues\nGenefic\nTotal Revenues for Genefic increased to $15,740,919, or 15.6% from last years revenue of $13,617,639.\nPala Diagnostics (Pala) and Empower Genomics (Empower) generated $10,338,768, or 65.7% of the total revenue for Genefic through its complexity CLIA diagnostic laboratories, focusing primarily on Covid-19 testing services with validated PCR and Rapid antigen testing. Our diagnostic laboratories continued to see revenue through seasonal COVID-19 surges as well as the Medicare over-the-counter (OTC) COVID-19 test demonstration program. Furthermore, our Covid Response Field Tech teams were deployed to senior care centers, schools and universities, businesses, and community sites throughout Southern California. During the year, Empower continued to develop its proprietary digital registration and reporting software that meets all compliance benchmarks required by county, state, and federally funded Covid-19 programs.\nIHG generated $1,091,934, or 6.9% of the total revenue for Genefic. IHGs revenue increased by $304,961 from the prior year, or 38.8%. The increase in revenue was a result of a rising number of students entering and graduating from IHGs Certified Nursing Assistant (CNA), Medical Assistant and Home Health Aid (HHA) Certification programs. The cost of revenues increased by 1.6% from the prior year. The modest increase in cost of revenue was a result of economies of scale as IHG grew its attendance and number of classes offered.\nSolas continued to manage three primary health and wellness clinics in San Diego through its management services agreement. The revenue generated was $1,331,612, or 8.5% of total revenue for Genefic. The cost of revenue was $1,324,308.\nWatson generated $2,875,326, or 18.3% of the total revenue for Genefic. Watsons revenue from last year was $69,160 as a result of its acquisition being completed on June 7, 2022. During the first quarter of the year, the revenue was $95,117 and increased by $2,780,209 over the remaining three quarters. The increase was a result of obtaining additional accreditations including the Healthcare Merchant Accreditation from the National Association of Boards of Pharmacy (NABP) where it can be listed on the official Accredited Merchants list along with larger pharmacy retailers CVS, Walgreens, and Walmart, among others. With Healthcare merchant Accreditation, Watson has proven its standards and practices to be in line with the requirements set by large online advertising platforms such as Google and Bing. Watson also obtained the Specialty Pharmacy Accreditation and Mail Service Pharmacy Accreditation from the Utilization Review Accreditation Commission (URAC). NABPs Specialty Pharmacy Accreditation signifies to patients, payers, and providers that the pharmacy organization is recognized for providing an advanced level of pharmacy services and disease management for patients taking medications that meet special handling, storage and distribution requirements. NABPs Digital Pharmacy Accreditation signifies to patients, payers, and providers that the pharmacy organization is recognized for its commitment to the highest quality health care and safe pharmacy practices over the internet. The specific Digital Pharmacy Accreditation was created to recognize safe and legitimate pharmacies with an internet presence that stands out against the ever-growing list of rogue pharmacy websites. These accreditations allow Watson to focus its growth as a full spectrum specialty pharmacy. The cost of revenue was $2,104,439.\nGenefic and Sharks sale of alcohol-free natural sanitizers and sanitizing kits decreased by 44.5% from the prior year, from $186,166 to $103,279. The decrease was a result of a highly competitive sanitization market and the closure of the product line. Total cost of revenue was $244,017 due to the liquidation of the existing product inventory.\nDalrada Precision Manufacturing\nTotal Revenues for Dalrada Precision Manufacturing increased to $4,873,225, or 129.5% from last years revenue of $2,123,437.\nDalrada Precision Parts generated $2,680,906, or 55.0% of the total revenue for Dalrada Precision Manufacturing. Revenue for Dalrada Precision Parts increased by $1,333,090, or 98.9% from the prior year. The increase in revenue was a result of increased sales with a large United States based customer and its consulting business. The cost of revenue was $1,581,340, or 59.0% of revenue.\nLikido Ltd.s heat pump sales generated $594,758, or 12.2% of the total revenue for Dalrada Precision Manufacturing. Revenue for Likido Ltd. increased by $439,540, or 283.2% from the prior year. The increase in revenue was a result of Likido finalizing the additional R&D required for the Likido®ONE heat pump commercialization. Furthermore, Likido built a test bed showroom in Las Vegas, Nevada to offer demonstrations for potential customers. The cost of revenues was $94,435, or 15.9% of revenue, and includes adjustments for intercompany sales to Dalrada Energy Services.\nDepTec generated $1,292,303, or 26.5% of the total revenue for Dalrada Precision Manufacturing. Revenue for DepTec increased by $722,078, or 126.6% from the prior year. The increase in revenue was a result of DepTec generating a full year of revenue. DepTec records its revenue using a cost-based input method, by which we use actual costs incurred relative to the total estimated contract costs to determine, as a percentage, progress toward contract completion. The cost of revenues was $1,132,831, or 87.7% of revenue.\nIgnites cleaners, parts washers and degreasers products generated $305,258, or 6.3% of total revenue for Dalrada Precision Manufacturing. Revenue for Ignite increased by $255,080, or 508.4% from the prior year. The increase in revenue was a result of Ignite generating a full year of revenue. The cost of revenue was $388,953, or 127.4% of revenue, and includes inventory adjustments.\nDalrada Energy Services\nTotal Revenues for Dalrada Energy Services increased to $7,075,414, or 460.8% from last years revenue of $1,261,774.\nDalrada Energy Services generated $4,511,533, or 68.3% of the total revenue for the Dalrada Energy Services segment. Revenue for Dalrada Energy Services increased by $3,249,759, or 257.6% from the prior year. The increase in revenue was a result of generating energy savings reports and the design, engineering and equipment upgrades for universities based in the United States. The cost of revenue was $2,790,145, or 61.8% of revenue, and includes adjustments for intercompany sales from Likido (UK).\nThe Company sold the intellectual property for Dalrada Energy Services subsequent to June 20, 2023. The Company continues to service existing contracts as of June 30, 2023, but does not anticipate additional new contracts from this subsidiary.\nBothof Brothers Construction generated $2,563,881, or 36.2% of the total revenue for the Dalrada Energy Services segment. Bothof Brothers Construction was acquired by the Company in November 2022, so did not have any revenue last fiscal year. Bothof Brothers Construction was generated through construction and contracting services throughout the United States. Bothof Brothers customers include both residential and commercial projects in the private and public sectors. During the year, $2,134,470 of revenue was generated through related parties.\nDalrada Technologies\nTotal Revenue for Dalrada Technologies sole subsidiary, Prakat, decreased to $2,049,411, or 8.5% from the prior years revenue of $2,239,763. The decrease in revenue was a result of several contracts ending their terms during the year.\nDalrada Corporate\nTotal Revenue for Dalrada Corporate was $25,000 in the prior year due to a legacy real estate transaction that realized income. The real estate transaction was one-off and no Corporate revenue was generated during the year.\nBacklog\nBacklog represents the dollar amount of revenues we expect to recognize in the future from agreements awarded and in progress. Backlog is not a measure defined by generally accepted accounting principles and is not a measure of contract profitability. Our methodology for determining backlog may not be comparable to methodologies used by other companies in determining their backlog amounts. The backlog values we disclose include anticipated revenues associated with: (1) the original agreement amounts; (2) change orders for which we have received written confirmations from the applicable customers; (3) change orders for which we expect to receive confirmations in the ordinary course of business; and (4) claims that we have made against customers. We do not include expected revenues of agreements related to unconsolidated joint ventures in our backlog, except to the extent of any contract awards we may receive from those joint ventures.\nFor amounts included in backlog that are attributable to claims, we include unapproved claims in backlog when we have a legal basis to do so, consider collection to be probable and believe we can reliably estimate the ultimate value. Claims revenue is included in backlog to the extent of the lesser of the amounts management expects to recover or associated costs incurred.\nBacklog may not be indicative of future operating results, and agreements in our backlog may be cancelled, modified or otherwise altered by customers. We can provide no assurance as to the profitability of our contracts reflected in backlog.\nThe Dalrada Precision Manufacturing segment has generated a backlog of approximately $900,000,000 over a seven-year period with approximately $40,000,000 within the initial twelve-month period.\nOperating Expenses\nTotal Operating Expenses increased to $30,019,876, or 43.5%, compared to last years expenses of $20,941,591.\nCorporate\nTotal Corporate expenses increased to $11,660,710, or 7.5%, compared to last years expenses of $10,849,022.\nThe Corporate segments Selling, general and administrative (SG&A) expenses consist of the following:\n· Employee compensation and benefits decreased by $604,188, or 11.8% from the prior year and is primarily a result of the Company allocating resources from the Corporate segment to each specific segment; shared resources across the four other business segments were included in the Corporate segment in the prior year. Additionally, the Corporate segment began making cost cuts through employee compensation during Q4 2023.\n· Legal and professional fees decreased by $838,306, or 45.3% from the prior year. The reduction was primarily a result of $230,400 associated with convertible debts issued in the prior year. During the current year, the company began cutting costs in professional fees and incurred less legal fees.\n· Sales and marketing costs decreased by $213,098, or 74.2% from the prior year due to reduced costs associated with third party investor relations, paid media, and content creation expenses. The Companys internal marketing generates most of the sales and marketing services which is included in the employee compensation and benefits expenses.\n· Other general and administrative costs for general corporate expenses, including information technology, rent, travel, and insurance increased by $977,394, or 121.6% from the prior year and is a result increases in travel expenses, rent expense, computer software expenses, and management fees.\nInterest Expense increased by $1,249,204 or 95.8% from the prior year as a result of increases in related party debt as well as PPP loans and convertible debt issued in prior years. See Note 7. Notes Payable to our audited consolidated financial statements included in this Annual Report on Form 10-K for more information regarding our outstanding debt.\nStock-based compensation includes expenses related to equity awards issued to employees and non-employee directors. Stock-based compensation increased by $1,249,886, or 45.1% from the prior year. See Note 12. Stock-Based Compensation to our audited consolidated financial statements included in this Annual Report on Form 10-K for more information regarding our stock-based compensation.\nGenefic\nTotal Genefic expenses increased to $11,468,627, or 86.5%, compared to last years expenses of $6,147,976, and includes a $433,556 loss on impairment.\nThe Genefic segments Selling, general and administrative (SG&A) expenses consist of the following:\n· Employee compensation and benefits increased by $1,646,077, or 220.1% from the prior year and a result of growth of the health-related business of the Genefic segment and the Company allocating resources from the Corporate segment to each specific segment; shared resources across the four other business segments were included in the Corporate segment in the prior year.\n· Legal and Professional Fees increased by $1,101,256, or 81.1% from the prior year and primarily a result of the lawsuit with Vivera Pharmaceuticals.\n· Sales and marketing costs decreased by $185,003, or 79.8% from the prior year due to reduced costs associated with third party advertising, paid media, and content creation expenses. The Companys internal marketing generates most of the sales and marketing services which is included in the Corporate segment employee compensation and benefits expenses.\n· Other general and administrative costs increased by $2,543,073, or 70.8% from the prior year and is a result of expansion of the diagnostic and pharmacy subsidiaries where certain business opportunities included large overhead expenses.\nDalrada Precision Manufacturing\nTotal Dalrada Precision Manufacturing expenses increased to $4,136,885, or 41.0%, compared to last years expenses of $2,933,732.\nThe Dalrada Precision Manufacturing Segments Selling, general and administrative (SG&A) expenses consist of the following:\n· Employee compensation and benefits increased by $1,148,369, or 356.7% from the prior year and a result of growth of the precision manufacturing business of the Dalrada Precision Manufacturing segment and the Company allocating resources from the Corporate segment to each specific segment; shared resources across the four other business segments were included in the Corporate segment in the prior year.\n· Legal and Professional Fees increased by $484,698, or 73.7% from the prior year and is a result of consulting fees related to the growth in manufacturing of precision parts in Asia and establishing third-party manufacturing capabilities of the Likido®ONE in the United States. The increase in legal fees was a result of the settlement Likido Ltd.s lawsuit with MAPtech Packaging, Inc. Pursuant to the settlement, the Company shall pay the sum of $558,252 in damages, legal costs, and reimbursement for arbitration fees and expenses paid on account by MAPtech.\n· Sales and marketing costs decreased by $19,533, or 53.7% from the prior year due to reduced costs associated with third party advertising, paid media, and content creation expenses. The Companys internal marketing generates most of the sales and marketing services which is included in the Corporate segment employee compensation and benefits expenses.\n· Other general and administrative costs increased by $246,616, or 19.6% from the prior year and is a result of an increase in travel, trade shows and other overhead expenses required for the expansion in the Precision Parts and Ignite businesses.\nDalrada Energy Services\nTotal Dalrada Energy Services expenses increased to $1,969,829, or 1,515.9%, compared to last years expenses of $121,904, and is a result of a full year of operations for the Dalrada Energy Services subsidiary and the acquisition of Bothof Brothers.\nThe Dalrada Energy Services Segments Selling, general and administrative (SG&A) expenses consist of the following:\n· Employee compensation and benefits increased to $484,719 as the energy segment continued to grow during the year. The employee resources were focused on the development of the current projects and building a future pipeline. Additionally, Company allocated resources from the Corporate segment to each specific segment. The Dalrada Energy Services segment did not have employee compensation and benefits expense during the prior year.\n· Legal and Professional Fees increased by $452,869, or 377.3% from the prior year and is a result of the growth of the energy segment throughout the year. Professional fees included services for management fees and other services specific to the energy industry.\n· Sales and marketing costs increased to $12,599. The Companys internal marketing generates most of the sales and marketing services which is included in the Corporate segment employee compensation and benefits expenses. The Dalrada Energy Services segment did not have sales and marketing costs during the prior year.\n· Other general and administrative costs increased to $897,738 from the prior year and is a result of management fees, travel and other general overhead costs associated with Dalrada Energy Services energy upgrade business and Bothof Brothers Contracting.\nDalrada Technologies\nTotal Dalrada Technologies expenses decreased to $783,825, or 11.8%, compared to last years expenses of $888,957.\nThe Dalrada Technologies segments Selling, general and administrative (SG&A) expenses consist of the following:\n· Employee compensation and benefits increased by $17,435, or 5.4% from the prior year and is a result of employee fluctuations and wage inflation.\n· Legal and Professional Fees decreased by $198,198, or 59.0% from the prior year and is a result of a reduced third-party engineering fees related to its projects.\n· Sales and marketing costs decreased by $3,797, or 71.3% from the prior year and is a result of reduced third-party advertising and marketing costs.\n· Other general and administrative costs increased by $79,428, or 35.3% and is a result of increases in information technology, rent, travel, and insurance costs.\nOther Income (Expense)\nOther Income (Expense) decreased by $1,336,262 or 133.1% from a $1,004,026 Other Expense in the prior year to a $332,236 Other Income in the current year. The change in Other Expense was a result of interest incurred of $2,549,309 related to additional related party debt, EIDL loans, and convertible debt (See Note 7. Notes Payable to our audited consolidated financial statements included in this Annual Report on Form 10-K for more information regarding our outstanding debt) which is offset by a $2,090,978 Gain on expiration of accrued payroll taxes due to quarterly tax liabilities that expired during fiscal 2023, $500,000 related to the sale of the Dalrada Energy Services intellectual property, and a $585,411 change in the fair value of contingent liability.\nNet Income (Loss)\nNet Loss for the year ended June 30, 2023, was $20,627,721 compared to a Net loss of $11,571,783 during the year ended June 30, 2022\nLiquidity and Capital Resources\nAs of June 30, 2023, the Company had current assets of $9,817,045 and current liabilities of $10,019,465 compared with current assets of $9,563,566 and current liabilities of $20,416,745 at June 30, 2022. The decrease in the working capital deficit is primarily a result of the Company converting $33,859,544 of related party debt during the year. The continuation of the Company as a going concern is dependent upon the successful financing through equity and/or debt investors and growing the subsidiaries anticipated to be profitable while reducing investments in areas that are not expected to have long-term benefits.\nThe Company anticipates an increase in sales of Likidos Likido®ONE heat pump through its current and future customer base. Furthermore, the United States General Services Administration (GSA) and the Department of Energy (DOE) have chosen the Companys Likido®ONE heat pump to help reduce greenhouse emissions from commercial buildings through high performance, low-carbon solutions set forth by the Green Proving Ground (GPG) program.\nThe Company is owed a material amount of account receivable from insurance providers related to the COVID-19 testing services. Furthermore, the Company wrote down $2,945,387 of receivables during the year ended June 30, 2023 which it is actively working to recoup through its third-party billing company.\nWatson obtained additional accreditations including the Healthcare Merchant Accreditation from the National Association of Boards of Pharmacy (NABP) and the Specialty Pharmacy Accreditation and Mail Service Pharmacy Accreditation from the Utilization Review Accreditation Commission (URAC) during the year ended June 30, 2023, and will lead to larger sales opportunities throughout the United States.\nAdditional sales are expected through the Companys increased Precision Parts sales channels, expansion of Prakats technology services, and IHGs increased educational footprint through launching the LVN program. These consolidated financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nCash Flows\nYear Ended\nJune 30,\nNet cash used in operating activities $ (4,612,798 ) $ (10,349,808 )\nNet cash used in investing activities (1,063,427 ) (574,040 )\nNet cash provided by financing activities 5,717,144 11,668,585\nNet change in cash during the period, before effects of foreign currency $ 40,919 $ 744,737\nCash flow from Operating Activities\nDuring the year ended June 30, 2023, the Company used $4,612,798 of cash for operating activities compared to $10,349,808 used during the year ended June 30, 2022. The decrease in the use of cash for operating activities was primarily due to an overall increase in direct funding from related parties.\nCash flow from Investing Activities\nDuring the year ended June 30, 2023, the Company used $1,063,427 of cash for investing activities compared to $574,040 used during the year ended June 30, 2022. The increase in the use of cash for investing activities was due to the purchase of property plant and equipment.\nCash flow from Financing Activities\nDuring the year ended June 30, 2023, the Company received $5,717,144 of cash for financing activities compared to $11,668,585 received during the year ended June 30, 2022. The decrease in financing activities was primarily due to the direct funding received from related party notes payable to finance operating activities.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, Revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nSubsequent Events\nOn July 1, 2023, Bothof Brothers signed a lease for 12,100 square feet of warehouse space in Escondido, California related to its construction business. The base monthly lease cost is $11,425 and expires on September 30, 2025.\nOn July 25, 2023, Genefic Inc. (Genefic), entered into an agreement with OnPoint LTB, LLC (Lender), for a credit line and funding of up to $2,000,000. The terms of the credit line include a 24-month term loan, with interest only for 6 months, then amortizing over 18 months down to 50%, with 50% of the balance due at the end of term. Interest is fixed at 20% per annum, with an origination fee of $20,000 which is added to the loan balance. Genefic borrowed the first installment of $1,200,000 at the time of closing. As part of the loan origination fee, Dalrada Financial Corporation is to issue 500,000 shares of its common stock. In addition, Genefic will issue cashless warrants equal to one percent of Genefic, if and when Genefic engages in a public offering of stock, prior to the maturity date of the loan transaction. The cashless warrants will have a strike price of $0.50. The transaction includes a debt discount of $100,821.\nOn July 31, 2023, the Company issued 109,637 shares of common stock pursuant to the Stock Purchase Agreement between Dalrada Financial Corporation and Prakat Solutions Inc.\nOn August 08, 2023, the Companys subsidiary, Dalrada Technology Spain S.L., entered into an agreement, which was Amended August 30, 2023, with Morocco-based global distributor, Crown Glory Holding to build and install a minimum of 4,500 energy efficient commercial heat pumps over the course of seven years. With the agreement, Crown Glory Holding also becomes the exclusive distributor of the Companys heat pumps for the continent of Africa and select neighboring countries.\nOn August 29, 2023, the Companys subsidiary, Dalrada Technology Spain S.L., entered into an agreement which was Amended August 30, 2023, with France-based JBS Consulting, to distribute a minimum of 2,300 energy efficient commercial heat pumps over the course of five years. The agreement calls for 150 of the commercial heat pumps to be installed and operational within the first 12 months, commencing in October of 2023, with increased numbers of the high-functioning machines installed each year until the contract is fully satisfied.\nOn September 6, 2023, the Dalrada Board of Directors approved 15,861,000 warrants to various Board of Director members, employees and consultants. The total stock-based compensation expense is $2,064,699.\nOn September 18, 2023, the Company appointed Heather McMahon to the Board of Directors.\nOn September 27, 2023, the Company issued 125,000 shares of common stock as part of the consideration for the acquisition of Watson RX Solution, Inc.\nOn October 2, 2023, Genefic borrowed the second installment of the OnPoint LTB, LLC loan of $800,000. The second installment included a loan origination fee of $5,000 and 500,000 of Dalrada Financial Corporation common stock. The transaction includes a debt discount of $154,492.\nOn October 5, 2023, Genefic acquired Diller Pharmacy LLC for the consideration of $135,000 in cash and assuming its lease, which includes a monthly lease cost of $325 and expires on February 28, 2025.\nCritical Accounting Policies\nOur consolidated financial statements and accompanying notes have been prepared in accordance with accounting principles generally accepted in the United States of America and applied on a consistent basis. The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods.\nWe regularly evaluate the accounting policies and estimates that we use to prepare our consolidated financial statements. A complete summary of these policies is included in note (1) of the notes to our consolidated financial statements. In general, management's estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management.\nAccrued Payroll Taxes\nThe total balance for Federal Accrued Payroll Taxes is accumulated on a quarterly basis beginning on their respective quarterly filing dates. Accrued Interest is compounded daily at an Effective Annual Interest Rate of approximately seven percent. The individual quarterly sub-totals have a calculated expiration date of ten years according to the Internal Revenue Service (IRS) statute of limitations. This timeline can be extended because of bankruptcy or other legal action that is filed by the Company (Code 520 per IRS Federal Account Transcripts). Code 520 effectively stops the clock for the Statute of limitations until the bankruptcy or other legal action has been removed (Code 521 per IRS Federal Account Transcripts). In addition to the number of days between Code 520 and 521, every Code 520 automatically extends the IRS Statute of limitations by 30 days. As the quarterly sub-totals surpass their respective Calculated Expiration Date the Company removes the liability from the Consolidated Balance Sheets and an equivalent amount is recognized as Gain on expiration of accrued payroll taxes on the Consolidated Statements of Operations and Comprehensive Loss. The amount owing may be subject to additional late filing fees and penalties that are not quantifiable as at the date of these consolidated financial statements.\nRevenue Recognition\nThe Company recognizes and accounts for revenue in accordance with Accounting Standards Codification (ASC) 606 as a principal on the sale of goods and services. Pursuant to ASC 606, revenue is measured based on a consideration specified in a contract with a customer, and excludes any sales incentives and amounts collected on behalf of third parties. The Company recognizes revenue when it satisfies its performance obligation by transferring control over a product or service to a customer.\nUse of Estimates\nOur consolidated financial statements and accompanying notes have been prepared in accordance with accounting principles generally accepted in the United States of America and requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The Company regularly evaluates estimates and assumptions related to the revenue, valuation of inventory, valuation of acquired assets and liabilities, variables used in the computation of share-based compensation, litigation, and evaluation of goodwill and intangible assets for impairment.\nThe Company bases its estimates and assumptions on current facts, historical experience, and various other factors that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nStock-Based Compensation\nThe Company records stock-based compensation in accordance with ASC 718, Compensation - Stock Compensation, using the fair value method. All transactions in which goods or services are the consideration received for the issuance of equity instruments are accounted for based on the fair value of the consideration received or the fair value of the equity instrument issued, whichever is more reliably measurable. Equity instruments issued to employees and the cost of the services received as consideration are measured and recognized based on the fair value using quoted market prices of the equity instruments issued.\nBusiness Combination\nASC 805, Business Combinations (ASC 805), applies the acquisition method of accounting for business combinations to all acquisitions where the acquirer gains a controlling interest, regardless of whether consideration was exchanged. ASC 805 establishes principles and requirements for how the acquirer: a) recognizes and measures in its financial statements the identifiable assets acquired, the liabilities assumed, and any non-controlling interest in the acquiree; b) recognizes and measures the goodwill acquired in the business combination or a gain from a bargain purchase; and c) determines what information to disclose to enable users of the financial statements to evaluate the nature and financial effects of the business combination. Accounting for acquisitions requires the Company to recognize, separately from goodwill, the assets acquired, and the liabilities assumed at their acquisition-date fair values. Goodwill as of the acquisition date is measured as the excess of consideration transferred and the net of the acquisition-date fair values of the assets acquired and the liabilities assumed. While the Company uses its best estimates and assumptions to accurately value assets acquired and liabilities assumed at the acquisition date, the estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, the Company may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recorded with a corresponding gain or loss being recognized in the Consolidated Statements of Operations.\nGoodwill and Intangible Assets\nThe Company accounts for goodwill and intangible assets in accordance with ASC 350, Intangibles - Goodwill and Other (ASC 350). ASC 350 requires that goodwill and other intangibles with indefinite lives should be tested for impairment annually or on an interim basis if events or circumstances indicate that the fair value of an asset has decreased below its carrying value.\nGoodwill is tested for impairment at the reporting unit level (operating segment or one level below an operating segment) on an annual basis (June 30 for the Company) and between annual tests if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value. The Company considers its market capitalization and the carrying value of its assets and liabilities, including goodwill, when performing its goodwill impairment test. When conducting its annual goodwill impairment assessment, the Company initially performs a qualitative evaluation of whether it is more likely than not that goodwill is impaired. If it is determined by a qualitative evaluation that it is more likely than not that goodwill is impaired, the Company then applies a two-step impairment test. The two-step impairment test first compares the fair value of the Company's reporting unit to its carrying or book value. If the fair value of the reporting unit exceeds its carrying value, goodwill is not impaired and the Company is not required to perform further testing. If the carrying value of the reporting unit exceeds its fair value, the Company determines the implied fair value of the reporting unit's goodwill and if the carrying value of the reporting unit's goodwill exceeds its implied fair value, then an impairment loss equal to the difference is recorded in the Consolidated Statements of Operations. The Company recorded an impairment of goodwill in the amount of $433,556 and $218,308 during the years ended June 30, 2023 and 2022, respectively.\nAn intangible asset is an identifiable non-monetary asset without physical substance. Such an asset is identifiable when it is separable, or when it arises from contractual or other legal rights. Separable assets can be sold, transferred, licensed, etc. Examples of intangible assets include computer software, licenses, trademarks, patents, films and copyrights. The Companys intangible assets are finite lived assets and are amortized on a straight-line basis over the estimated useful lives of the assets.\nPurchase Price Allocation\nUpon the completion of a business combination, the consideration transferred as well as the assets and liabilities acquired must be recorded at their acquisition date fair values. Upon identification of the acquirer and determination of the acquisition date, business combinations are accounted for through the preparation of a Purchase Price Allocation (PPA). We take into consideration the five steps when completing a PPA:\nStep 1: Determine the fair value of consideration paid;\nStep 2: Revalue all existing assets and liabilities (excluding intangible assets and goodwill which are addressed in step 3 to 5 below) to their acquisition date fair values;\nStep 3: Identify the intangible assets acquired;\nStep 4: Determine the fair value of identifiable intangible assets acquired; and,\nStep 5: Allocate the remaining consideration to goodwill and assess the reasonableness of the overall conclusion\nRelated Party Transactions\nRelated party transactions are conducted with parties with which the Company has a close association, such as majority owned subsidiaries, its executive, managers, and their families. The types of transactions that can be conducted between related parties are many, such as sales, asset transfers, leases, lending arrangements, guarantees, allocations of common costs, and the filing of consolidated tax returns. The Company discloses any transaction that would impact the decision making of the users of its consolidated financial statements. This involves the following disclosures:\n· General. The Company discloses all material related party transactions, including the nature of the relationship, the nature of the transactions, the dollar amounts of the transactions, the amounts due to or from related parties.\n· Receivables. The Company separately discloses any receivables from officers, employees, or affiliated entities.\nRecently Issued Accounting Pronouncements\nIn August 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2020-06, Accounting for Convertible Instruments and Contracts in an Entitys Own Equity, as part of its overall simplification initiative to reduce costs and complexity of applying accounting standards while maintaining or improving the usefulness of the information provided to users of financial statements. Among other changes, the new guidance removes from GAAP separation models for convertible debt that require the convertible debt to be separated into a debt and equity component, unless the conversion feature is required to be bifurcated and accounted for as a derivative or the debt is issued at a substantial premium. As a result, after adopting the guidance, entities will no longer separately present such embedded conversion features in equity, and will instead account for the convertible debt wholly as debt. The new guidance also requires use of the if-converted method when calculating the dilutive impact of convertible debt on earnings per share, which is consistent with the Companys current accounting treatment under the current guidance. The guidance is effective for financial statements issued for fiscal years beginning after December 15, 2021, and interim periods within those fiscal years, with early adoption permitted, but only at the beginning of the fiscal year. The Company adopted the guidance on July 1, 2022.\nIn October 2021, the FASB issued ASU 2021-08 - Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08). Under current accounting standards, contract assets and contract liabilities acquired in a business combination are to be recorded at fair value using the ASC 805 measurement principle. ASU 2021-08 requires the acquirer to recognize and measure contract assets and contract liabilities acquired in a business combination in accordance with Topic 606: Revenue from Contracts with Customers as if the acquirer had originated the contracts rather than at fair value. ASU 2021-08 is effective for fiscal years beginning after December 15, 2022, with early adoption permitted. The Company elected to early adopt ASU 2021-08 on a prospective basis as of July 1, 2021. The election to use practical expedients allowed under ASU 2021-08 will be applied on an acquisition-by-acquisition basis. There was no impact to the Companys consolidated financial statements as of the adoption date.\nThe FASB and the SEC have issued certain other accounting pronouncements as of June 30, 2023 that will become effective in subsequent periods; however, management does not believe that any of these pronouncements would have significantly affected the Companys financial accounting measurements or disclosures had they been in effect during the periods for which financial statements are included in this annual report, nor does management believe those pronouncements would have a significant effect on the Companys future financial position or results of operations\nContractual Obligations\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements\nDALRADA FINANCIAL CORPORATION\nConsolidated Financial Statements\nFor the Years Ended June 30, 2023 and 2022\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Loss\nConsolidated Statements of Stockholders Equity (Deficit)\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID N0. 324)\nTo the Board of Directors and\nStockholders of Dalrada Financial Corporation\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of Dalrada Financial Corporation and its subsidiaries (the Company) as of June 30, 2023, the related consolidated statements of operations and comprehensive loss, changes in shareholders equity (deficit), and cash flows for the year ended June 30, 2023, and the related notes to the consolidated financial statements (collectively, referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023, and the results of its operations and its cash flows for year then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company has suffered recurring losses from operations, negative cash flows from operating activities and continues to have a working capital deficit. This raises substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which it relates.\nImpairment Assessment of Goodwill\nDescription of the Matter:\nAs discussed in Notes 2, 3, 4, 5, 11, 12 and 16 to the consolidated financial statements, the Company had a number of business combinations during the current and prior fiscal years that led to the recording of goodwill. Goodwill is tested for impairment at least annually in accordance with the provisions of ASC No. 350, Intangibles Goodwill and Other (ASC No. 350). We identified the impairment assessment of the Companys goodwill acquired in these acquisitions as a critical audit matter as of June 30, 2023. Auditing the Companys impairment tests was complex and highly judgmental because (i) there was significant judgment used by management to develop the fair value measurement, which led to a high degree of audit judgment and subjectivity in performing procedures relating to fair value measurement; and (ii) there was significant effort in performing procedures to evaluate the reasonableness of the fair value measurement and significant assumptions and projections used by management.\nHow We Addressed the Matter in our Audit:\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. To test the potential impairment of the Companys goodwill, our audit procedures included, among others, testing managements application of the relevant accounting guidance, and testing of the significant assumptions used by the Company to develop forecasted results for the reporting unit, including projected revenue growth and operating margins. We also assessed the historical accuracy of managements estimates, as well as performed a sensitivity analysis of significant assumptions to evaluate the changes in the fair value of the reporting units that would result from changes in the assumptions. We compared the significant assumptions to current and past industry, market and economic trends. Additionally, we tested the completeness and accuracy of the underlying data supporting the significant assumptions and estimates\nRevenue Recognition\nDescription of the Matter:\nAs disclosed in Note 2, 9 and 13, the Company follows the guidance provided in ASC 606, Revenue from Contracts with Customers, and recognizes revenue when or as the Company satisfies a customer agreement performance obligation by transferring control of a product or service to a customer, in an amount that reflects the consideration the Company expects to receive in exchange for those products or services. A presumption of fraud risk exists related to revenue recognition and judgment is exercised by the Company in determining revenue recognition for each performance obligation within their customer agreements. We identified the Companys recording of revenues as a critical audit matter because there was significant judgment applied by management in its determination of the appropriate revenue recognition criteria, including assessing the indicators for when control is transferred to the customer, assessing managements evaluation and allocation of the standalone transaction prices to the performance obligations, as well as managements assessment of the impact on revenue recognition of non-standard terms and conditions. In turn, this led to a high degree of auditor judgment, subjectivity and effort in performing audit procedures and evaluating the results of those procedures.\nHow We Addressed the Matter in our Audit:\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. Our principal audit procedures related to the Companys revenue recognition included gaining an understanding of internal controls related to revenue recognition including managements controls related to the evaluation of performance obligations and the allocation of the total contract consideration to these performance obligations noted in their customer agreements. We evaluated managements revenue recognition policies and practices including the reasonableness of managements judgments and assumptions relating to the timing of revenue recognition of those performance obligations. In addition, we selected customer agreements and performed the following testing procedures: 1) Obtained and read the customer agreements or contracts for each selected agreement. 2) Evaluated and tested managements identification of significant terms for completeness, including the identification of distinct performance obligations. 3) Tested revenue contracts and underlying support to evaluate appropriateness of managements revenue recognition. 4) Tested the completeness and accuracy of managements calculation of revenue and associated timing of revenue recognized (i.e., revenue being recognized at a point in time vs over time). 5) These procedures also included, among others, testing managements process for developing estimates for contractual allowances and project completion, including (i) evaluating the appropriateness of the methodology, (ii) testing the completeness and accuracy of the historical contractual allowance and collection data from the Companys billing system, which is an input to the methodology, and (iii) evaluating the reasonableness of managements assumptions used to estimate contractual allowances (net accounts), as well as testing relevant inputs and project costs incurred used to develop estimates of project progress compared to the overall project budget.\nWe have served as the Companys auditor since 2023.\n/s/ Macias Gini & OConnell LLP\nMelville, New York\nOctober 19, 2023\nPCAOB No. 324\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Dalrada Financial Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Dalrada Financial Corporation and subsidiaries (collectively the Company) as of June 30, 2022, the related consolidated statements of operations, stockholders deficit and cash flows for the year then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of June 30, 2022, and the results of their operations and their cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company has had recurring losses, used cash flows from operating activities and has a significant working capital deficit, which raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCritical Audit Matters\nThe critical audit matters communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which it relates.\nRelated Party Transactions including Revenue Recognition\nDescription of the Matter:\nAs discussed in Notes 2, 4, 7, 8, 9, 10, 11, 12 and 14 to the consolidated financial statements, the Company has significant related party transactions involving revenue, accounts receivable, accounts payable, loans payable, advances, and expenses paid by and to multiple related parties. Our auditing of managements identification of related parties and the related transactions including recognition of revenue was complex and is based on a thorough understanding the Companys related party relationships, contracts, and business activities. These were the principal considerations that led us to determine this as a critical audit matter.\nHow We Addressed the Matter in our Audit:\nWe evaluated the controls over the Companys identification of, and recording of related party transactions, and of the revenue recognition process, including walkthroughs of internal controls. We confirmed certain balances and transactions with related parties. To evaluate the related partys satisfaction of performance obligations, our audit procedures included, among others, reviewing contracts and evaluating managements assumptions used to determine the distinct performance obligations, and reviewing the branding work performed by the Company for various products. In addition, to identify undisclosed related party transactions we performed the following: 1) made inquiries of management and other individuals throughout the Company; 2) obtained a selection of expenses and reviewed for related party indicators; 3) reviewed public filings and other online information available; 4) confirmed with the transfer agent regarding significant shareholders; and 5) related procedures performed in other parts of the audit engagement.\nRevenue Recognition\nDescription of the Matter:\nAs disclosed in Note 2, 9, and 13, the Company recognizes revenue when or as the Company satisfies a customer agreement performance obligation by transferring control of a product or service to a customer, in an amount that reflects the consideration the Company expects to receive in exchange for those products or services. In determining revenue recognition for certain customer agreements, significant judgment was exercised by the Company, and included the following: 1) An assessment of the products and services promised in contracts or customer agreements, and the identification of a performance obligation for each promise to transfer to the customer a product or service that is distinct. 2) Determination of relative standalone selling price for distinct performance obligations. 3) The timing of product or service delivery for performance obligations. 4) Net revenues and accounts receivable recognized from healthcare insurers and government payers consist of amounts billed net of contractual allowances for differences between amounts billed and the estimated consideration the Company expects to receive from such payers, which considers historical denial and collection experience and, additionally for healthcare insurers, the terms of the Companys contractual arrangements. As disclosed by management, the process for estimating revenues and the ultimate collection of receivables associated involves significant assumptions and judgments. Given these factors, the related audit effort in evaluating managements judgments in determining revenue recognition for these customer agreements was extensive, which led us to determine this as a critical audit matter.\nHow We Addressed the Matter in our Audit:\nOur principal audit procedures related to the Companys revenue recognition for these customer agreements included an evaluation of the controls related to the identification of distinct performance obligations and the determination of the timing of revenue recognition. We also evaluated managements significant accounting policies related to certain customer agreements. In addition, we selected customer agreements and performed the following procedures: 1) Obtained and read the customer agreements or contracts for each selected agreement. 2) Evaluated and tested managements identification of significant terms for completeness, including the identification of distinct performance obligations. 3) Evaluated the appropriateness of managements application of their accounting principles, in their determination of revenue recognition conclusions. 4) Tested the mathematical accuracy of managements calculations of revenue and the associated timing of revenue recognized in the consolidated financial statements. 5) These procedures also included, among others, testing management's process for developing the estimate for contractual allowances, including (i) evaluating the appropriateness of the methodology, (ii) testing the completeness and accuracy of the historical contractual allowance and collection data from the Companys billing system, which is an input to the methodology, and (iii) evaluating the reasonableness of managements assumptions used to estimate contractual allowances (net accounts receivable).\n/s/ dbbmckennon\nWe have served as the Companys auditor from 2019 to 2022.\nSan Diego, California\nOctober 31, 2022\nPCAOB No. 3501\nDALRADA FINANCIAL CORPORATION\nConsolidated Balance Sheets\nJune 30, June 30,\nAssets\nCurrent assets:\nCash and cash equivalents $ 812,806 $ 772,062\nAccounts receivable, net 4,453,104 6,406,555\nAccounts receivable, net - related parties 752,348 41,603\nOther receivables 376,604 288,655\nInventories 2,078,692 1,624,621\nPrepaid expenses and other current assets 1,343,491 430,070\nTotal current assets 9,817,045 9,563,566\nLong-term receivables 41,722 42,395\nLong-term receivables - related parties 1,173,893 1,209,103\nProperty and equipment, net 1,476,082 1,076,412\nGoodwill 3,803,147 4,253,424\nIntangible assets, net 3,858,086 3,524,888\nRight-of-use asset, net 2,771,854 1,665,436\nRight-of-use asset, net - related party 2,227,286 1,087,256\nTotal assets $ 25,169,115 $ 22,422,480\nLiabilities and Stockholders' Equity (Deficit)\nCurrent liabilities:\nAccounts payable $ 5,178,897 $ 2,331,919\nAccrued liabilities 1,084,008 1,799,404\nAccrued payroll taxes, penalties and interest - 2,055,736\nAccounts payable and accrued liabilities - related parties 547,949 1,270,133\nDeferred revenue 1,337,259 720,923\nNotes payable, current portion 439,562 669,028\nNotes payable, current portion - related parties 251,605 9,269,377\nConvertible notes payable, net of debt discount - 1,495,528\nRight-of-use liability 660,394 435,647\nRight-of-use liability - related party 519,791 369,050\nTotal current liabilities 10,019,465 20,416,745\nLong-term payables 48,888 120,534\nNotes payable 1,011,395 479,001\nNotes payable - related parties 1,648,478 9,538,685\nContingent consideration 4,285,389 4,870,800\nRight-of-use liability 2,160,834 1,231,691\nRight-of-use liability - related party 1,741,830 718,206\nTotal liabilities 20,916,279 37,375,662\nCommitments and contingencies (Note 14) - -\nStockholders' deficit:\nSeries I preferred stock, $0.01 par value, 100,000 shares authorized, 35,108 and 0 shares issued and\noutstanding as of June 30, 2023 and June 30, 2022, respectively\n-\nSeries H preferred stock, $0.01 par value, 15,002 and 0 shares authorized, issued and\noutstanding as of June 30, 2023 and June 30, 2022, respectively\n-\nSeries G preferred stock, $0.01 par value, 100,000 shares authorized, 10,002 shares issued and outstanding as of both June 30, 2023 and June 30, 2022, respectively\nSeries F preferred stock, $0.01 par value, 5,000 and 5,000 shares authorized, issued and\noutstanding as of both June 30, 2023 and June 30, 2022, respectively\nCommon stock, $0.005 par value, 1,000,000,000 shares authorized, 88,699,139 and 72,174,620\nshares issued and outstanding at June 30, 2023 and June 30, 2022, respectively\n443,478\n360,855\nCommon stock to be issued 192,925 1,066,925\nAdditional paid-in capital 145,251,822 104,627,032\nAccumulated deficit (141,729,009 ) (121,436,490 )\nAccumulated other comprehensive loss (50,848 ) (50,673 )\nTotal Dalrada Financial Corp's stockholders' equity (deficit) 4,109,019 (15,432,201 )\nNoncontrolling interests 143,817 479,019\nTotal stockholders' equity (deficit) 4,252,836 (14,953,182 )\nTotal liabilities and stockholders' equity (deficit) $ 25,169,115 $ 22,422,480\n(The accompanying notes are an integral part of these consolidated financial statements)\nDALRADA FINANCIAL CORPORATION\nConsolidated Statements of Operations and Comprehensive Loss\nYear Ended\nJune 30,\nRevenues $ 27,456,223 $ 17,864,557\nRevenues - related party 2,282,746 1,403,056\nTotal revenues 29,738,969 19,267,613\nCost of revenues 20,679,050 8,761,266\nGross profit 9,059,919 10,506,347\nOperating expenses:\nSelling, general and administrative (includes stock-based compensation of $4,022,656 and $2,772,770, respectively) 29,466,320 20,066,286\nResearch and development 120,000 656,997\nLoss on impairment of goodwill 433,556 218,308\nTotal operating expenses 30,019,876 20,941,591\nLoss from operations (20,959,957 ) (10,435,244 )\nOther income (expense):\nInterest expense (2,552,918 ) (1,303,714 )\nInterest income 79,758 4,451\nOther income (expense) 722,620 308,534\nGain on expiration of accrued tax liability 2,090,978 -\nGain (loss) on foreign exchange (8,202 ) (13,297 )\nTotal other income (expense), net 332,236 (1,004,026 )\nLoss before taxes (20,627,721 ) (11,439,270 )\nIncome taxes - 132,513\nNet loss (20,627,721 ) (11,571,783 )\nOther comprehensive loss\nForeign currency translation (175 ) (82,960 )\nComprehensive loss $ (20,627,896 ) $ (11,654,743 )\nNet income (loss) attributable to noncontrolling interests (335,202 ) 2,526,533\nNet loss attributable to Dalrada Financial Corporation stockholders $ (20,292,519 ) $ (14,098,316 )\nNet loss per common share to Dalrada stockholders - basic $ (0.24 ) $ (0.20 )\nNet loss per common share to Dalrada stockholders - diluted $ (0.24 ) $ (0.20 )\nWeighted average common shares outstanding - basic 83,761,903 72,217,851\nWeighted average common shares outstanding - diluted 83,761,903 72,217,851\n(The accompanying notes are an integral part of these consolidated financial statements)\nDALRADA FINANCIAL CORPORATION\nConsolidated Statements of Changes in Stockholders Equity (Deficit)\nPreferred Stock\nCommon Preferred\nSeries I Series H Series G Series F Common Stock Stock to Stock to\nShares Amount Shares Amount Shares Amount Shares Amount Shares Amount be Issued be Issued\nBalance at June 30, 2021 - $ - - $ - - $ - 5,000 $ 50 73,838,662 $ 369,194 601,825 -\nConversion of related party notes into preferred stock - - - - - - - - - - - 6,532,206\nIssuance of preferred stock - - - - 10,002 - - - - - (6,532,206 )\nCommon stock issued pursuant to acquisitions - - - - - - - - 1,850,000 9,252 290,100 -\nJoint ventures - - - - - - - - 250,000 1,250 - -\nReversal of shares previously issued to directors - - - - - - - - (6,829,478 ) (34,147 ) - -\nCommon stock and warrants issued in connection with convertible note - - - - - - - - 192,000 - -\nCommon stock issued pursuant to conversion of note - - - - - - - - 373,436 1,876 - -\nStock-based compensation - - - - - - - - 2,500,000 12,500 175,000 -\nNet income (loss) - - - - - - - - - - - -\nForeign currency translation - - - - - - - - - - - -\nBalance at June 30, 2022 - $ - - $ - 10,002 $ 100 5,000 $ 50 72,174,620 $ 360,855 $ 1,066,925 $ -\nCommon stock issued for conversion of convertibles notes, accrued interest and premium - - - - - - - - 10,974,520 54,873 - -\nCommon stock issued pursuant to acquisitions - - - - - - - - 3,049,999 15,250 (699,000 ) -\nCommon stock issued pursuant to consultant agreement - - - - - - - - 2,000,000 10,000 - -\nConversion of related party notes into preferred stock 35,108 15,022 - - - - - - - -\nWarrants issued pursuant to acquisitions - - - - - - - - - - - -\nStock-based compensation - - - - - - - - 500,000 2,500 (175,000 ) -\nNet income (loss) - - - - - - - - - - - -\nForeign currency translation - - - - - - - - - - - -\nBalance at June 30, 2023 35,108 $ 351 15,022 $ 150 10,002 $ 100 5,000 $ 50 88,699,139 $ 443,478 $ 192,925 $ -\n(Continued)\nAdditional\nAccumulated\nOther\nDalrada Financial Corp's\nTotal\nPaid-in Accumulated Comprehensive Stockholders' Noncontrolling Stockholders'\nCapital Deficit Income (Loss) Deficit Interests Deficit\nBalance at June 30, 2021 $ 92,965,821 $ (107,338,174 ) $ 32,287 $ (13,368,997 ) $ (38,391 ) $ (13,407,388 )\nConversion of related party notes into preferred stock - - - - - -\nIssuance of preferred stock 6,532,106 - - 6,532,106 - 6,532,106\nCommon stock issued pursuant to acquisitions 793,651 - - 1,093,003 - 1,093,003\nJoint ventures 57,310 - - 58,560 (2,009,123 ) (1,950,563 )\nReversal of shares previously issued to directors 19,321 - - (14,826 ) - (14,826 )\nCommon stock and warrants issued in connection with convertible note 1,541,765 - - 1,542,695 - 1,542,695\nCommon stock issued pursuant to conversion of note 131,788 - - 133,664 - 133,664\nStock-based compensation 2,585,270 - - 2,772,770 - 2,772,770\nNet income (loss) - (14,098,316 ) - (14,098,316 ) 2,526,533 (11,571,783 )\nForeign currency translation - - (82,960 ) (82,960 ) - (82,960 )\nBalance at June 30, 2022 $ 104,627,032 $ (121,436,490 ) $ (50,673 ) $ (15,432,201 ) $ 479,019 $ (14,953,182 )\nCommon stock issued for conversion of convertibles notes, accrued interest and premium 1,392,615 - - 1,447,488 - 1,447,488\nCommon stock issued pursuant to acquisitions 998,225 - - 314,475 - 314,475\nCommon stock issued pursuant to consultant agreement 174,000 - - 184,000 - 184,000\nConversion of related party notes into preferred stock 33,859,043 - - 33,859,544 - 33,859,544\nWarrants issued pursuant to acquisitions 5,751 - - 5,751 - 5,751\nStock-based compensation 4,195,156 - - 4,022,656 - 4,022,656\nNet income (loss) - (20,292,519 ) - (20,292,519 ) (335,202 ) (20,627,721 )\nForeign currency translation - - (175 ) (175 ) - (175 )\nBalance at June 30, 2023 $ 145,251,822 $ (141,729,009 ) $ (50,848 ) $ 4,109,019 $ 143,817 $ 4,252,836\n(The accompanying notes are an integral part of these consolidated financial statements)\nDALRADA FINANCIAL CORPORATION\nConsolidated Statements of Cash Flows\nYear Ended\nJune 30,\nCash flows from operating activities:\nNet loss $ (20,627,721 ) $ (11,571,783 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization 707,572 323,018\nStock compensation 4,022,656 2,772,770\nStock consideration issued to vendor 184,000 -\nAmortization of debt discount 1,224,472 554,970\nConvertible debt premium satisfied with common stock 200,000 20,000\nChange in fair value of contingent consideration (270,936 ) (182,200 )\nBad debt expense 4,783,357 1,659,559\nLoss on impairment of goodwill 433,556 218,308\nGain on expiration of accrued tax liability (2,090,978 ) -\nChanges in operating assets and liabilities, net of amounts acquired or assumed in connection with acquisition:\nAccounts receivable (3,897,875 ) (7,383,296 )\nOther receivables (60,660 ) (221,327 )\nInventories (454,071 ) (608,657 )\nPrepaid expenses and other current assets (722,147 ) (137,767 )\nLong-term receivables 35,883 (1,251,498 )\nAccounts payable 2,822,813 1,116,618\nLong-term payables (71,646 ) 120,534\nAccounts payable and accrued liabilities - related parties 7,936,820 2,405,364\nAccrued liabilities 640,529 1,211,943\nAccrued payroll taxes, penalties and interest 35,242 102,712\nDeferred revenue 556,336 500,924\nNet cash used in operating activities (4,612,798 ) (10,349,808 )\nCash flows from investing activities:\nPurchase of property and equipment (693,201 ) (640,184 )\nPurchase of intangibles (470,680 ) (242,063 )\nAcquisition of business, net of cash 100,454 308,207\nNet cash used in investing activities (1,063,427 ) (574,040 )\nCash flows from financing activities:\nProceeds from related party notes payable 6,757,688 11,492,218\nProceeds from convertible notes payable - 2,880,000\nRepayments of related party notes payable 350,028 (233,556 )\nRepayments of convertible note payable (1,680,000 ) (300,000 )\nDistributions to noncontrolling interest - (2,120,308 )\nNet proceeds (repayments) from notes payable 289,428 (34,943 )\nRepurchase of common shares from subsidiary - (14,826 )\nNet cash provided by financing activities 5,717,144 11,668,585\nNet change in cash and cash equivalents 40,919 744,737\nEffect of exchange rate changes on cash (175 ) (82,960 )\nCash and cash equivalents at beginning of period 772,062 110,285\nCash and cash equivalents at end of period $ 812,806 $ 772,062\nSupplemental disclosure of cash flow information:\nCash paid for income taxes $ 139,941 $ 77,766\nCash paid for interest $ 9,048 $ -\nSupplemental disclosure of non-cash investing and financing activities:\nConversion of related party notes and interest into preferred stock $ 33,859,544 $ 6,532,206\nContribution of property and equipment into joint venture $ - $ 111,185\nIssuance of shares to joint venture partner $ - $ 58,560\nConversion of accounts payable-related parties to note payable-related parties $ 8,676,605 $ 181,744\nCommon stock and warrants issued in connection with convertible note $ - $ 1,542,695\nCommon stock issued pursuant to conversion of note, accrued interest and premium $ - $ 133,664\nCommon stock issued pursuant to business combination $ 314,475 $ 1,093,003\nFair value of assets acquired and liabilities assumed in acquisition $ - $ 468,232\nConversion of convertible note payable, accrued interest and premium into common stock $ 1,447,488 $ -\nIncrease in right-of-use asset and liability $ 2,227,830 $ -\n(The accompanying notes are an integral part of these consolidated financial statements)\nDALRADA FINANCIAL CORPORATION\nNotes to the Consolidated Financial Statements\nYears ended June 30, 2023, and 2022\n1. Organization and Nature of Operations\nUnless otherwise stated or the context requires otherwise, references herein to the Company, Dalrada, we, us, and our mean Dalrada Financial Corporation and its direct and indirect subsidiaries, and controlled and managed entities.\nDalrada Financial Corporation, (Dalrada), was incorporated in September 1982 under the laws of the State of California. It was reincorporated in May 1983 under the laws of the State of Delaware and reincorporated again on May 5, 2020, under the laws of the state of Wyoming. Dalrada Financial Corporation trades under the symbol, OTCQB: DFCO.\nDalrada has five primary business divisions: Genefic, Dalrada Energy Services, Dalrada Precision Manufacturing, Dalrada Technologies and Dalrada Corporate. Dalradas global solutions directly address climate change, gaps in the health care industry, and technology needs that facilitate a new era of human behavior and interaction and ensure a bright future for the world around us.\nGenefic (formerly Dalrada Health)\nGenefic, formerly named Dalrada Health, delivers advanced health care solutions with dedicated products, services, and systems. From virus and disease screening capabilities to pharmaceutical goods and holistic wellness clinics, this specialized division is committed to developing key health products, lifesaving medications and building comprehensive systems to increase capability, strive to keep people healthy with the goals of improving their quality of life and increasing their longevity- on a global level.\nEmpower Genomics (Empower)- Empower is Dalradas wholly owned diagnostic laboratory subsidiary which processes molecular diagnostic and antibody tests to support the diagnosis of COVID-19 and the detection of immune response to the virus. Empower has built up and maintained the testing capacity to handle surges in COVID-19 testing demands. Empower also offers genetic testing capabilities including Pharmacogenomics, Nutraceutical, Nutrition/Diet DNA and Exercise/Fitness DNA tests.\nPala Diagnostics (Pala)- Pala is a joint venture diagnostic laboratory which processes both molecular diagnostic and antibody tests to support the diagnosis of COVID-19 and the detection of immune response to the virus.\nSolas Corp. (Solas)- Solas manages and oversees wellness clinics throughout Southern California including the Sòlas Rejuvenation + Wellness clinics (Sòlas). Through advanced medical techniques and modern technology, Sòlas delivers a clinical experience that helps men and woman live their best life, whether its through simple cosmetic procedures, pain-reducing practices, or anti-aging therapies. Through its three locations, Sòlas prides itself on its dedicated service-focused, health-first approach. Its wellness & rejuvenation clinics deliver with a focus on regenerative therapies, IV and injection services, cosmetic enhancements amongst a myriad of additional health centric services.\nInternational Health Group (IHG)- IHG provides highly trained nursing and medical assistants for hospitals and home health facilities since 2006. IHG Medical Assistant programs include Certified Nursing Assistant (CNA\") and Home Health Aide (HHA) training and the fast-track 22-Day CNA Certification Program at its state-approved testing facility.\nPacific Stem Cells (PSC)- PSC markets and sells traditional biologics and human cells, tissues, and cellular and tissue-based products (HCT/Ps).\nWatson Rx Solutions (Watson)- In June 2022, the Company acquired Watson, an Alabama-based pharmacy with more than 30 years of experience in the retail medical and pharmaceutical industries. Watson helps manage disease states through education and prescription management while offering generic as well as specialty medications. Watson maintains pharmacy licenses in all 50 States including Washington D.C.\nGlanHealth (GlanHealth)- Genefic Products launched GlanHealth in 2020 to distribute alcohol-free hand sanitizers, surface cleaners, laundry aides, antimicrobial solutions, electrostatic sprayers, face masks, gloves, kits, and delivery equipment such as dispensers, stands, and ease of use packaging for the end consumer. GlanHealth leverages an extensive supply chain of producers, resellers, distributors, vendors, and formulators for the development, sale, and marketing of its products and services.\nDalrada Energy Services\nDalrada Energy Services (‘DES) employs next-generation technology that enhances clean energy efforts while reducing the worlds carbon footprint. Through innovative products and commercial services, DES facilitates energy transition for universities, businesses, government buildings, and more.\nDalrada Energy Services Inc. (DES)- DES provides end-to-end comprehensive energy service solutions in a robust commercial capacity, DES helps organizations meet environmental, social, and governance (ESG) goals and standards while mitigating negative environmental impacts.\nBothof Brothers Construction (Bothof)- The Company acquired Bothof in November 2022. Bothof is a licensed general contractor which provides a wide range of development, construction and design capabilities and expertise throughout the United States. Through Bothofs extensive experience in construction and contracting, the DES division is able to provide a myriad of additional services to its private and public works customers.\nDalrada Precision Manufacturing\nDalrada Precision Manufacturing creates total manufacturing solutions that start with the design and development of high-quality machine parts and components, and end with an efficient global supply chain. This specialized business division can meet todays high demands and solves industry challenges. Dalrada Precision Manufacturing is confident that it redefines the critical quality of the worlds top components and responds with in-house research, design, engineering, and distribution through a highly reliable global supply chain and improved time-to-market capabilities.\nDalrada Precision Parts (Precision)- Precision extends the client its engineering and operations team by helping devise unique manufacturing solutions tailored to their products. Dalrada Precision can enter at any stage of the product lifecycle from concept and design to mass production and logistics.\nLikido Ltd. (Likido)- Likido is an international engineering company developing advanced solutions for the harvesting and recycling of energy. Using its novel, heat pump systems (patent pending), Likido is working to revolutionize the renewable energy sector with the provision of innovative modular process technologies to maximize the capture and reuse of thermal energy for integrated heating and cooling applications. With uses across industrial, commercial and residential sectors, Likido provides cost savings and the minimized carbon emissions across global supply chains. Likido's technologies enable the effective recovery and recycling of process energy, mitigating against climate change and expected enhancement of quality of life through the provision of low-carbon heating and cooling systems.\nIgnite I.T. (Ignite)- Ignite is a manufacturer and seller of eco-friendly deep cleaners, parts washers and degreasers that are specially formulated to lift hydrocarbon-based dirt and grease from virtually all surfaces with minimal effort. Ignite products are non-flammable, non-corrosive, non-toxic, butyl-free, water-based, and leave a light citrus scent. Ignite is developed for all surfaces suitable for water and meet or exceed the most stringent industry-testing specifications. Ignites products are effective and available solutions to the increased demand for protecting employees from hazardous chemicals currently used and highlighted in recent federal and state regulations.\nDeposition Technologies (DepTec)- Dalrada Precision Manufacturing acquired DepTec in April 2022. DepTec designs, develops, manufactures, and services chemical vapor and physical vapor deposition systems for the microchip and semiconductor industries.\nDepTec has built a multitude of precision OEM parts for PVD (Physical vapor deposition) and refurbished systems which allow clients the option of purchasing the same model of system theyve been using for decades - but with upgrades and improved efficiencies. DepTec also has its own PVD and CVD (Chemical Vapor Deposition) systems, EVOS-PVD and EVOS -CVD, which deposits metals and non-metals for microchips used in almost every standard and specialized microdevices made today and in the future. These systems can produce a superior film layer utilized in rugged high-stress environment designs and expect to meet the increased US market demand driven by the CHIPS and Science Act of 2022.\nDalrada Technology Limited (DTL)- Dalrada Precision Manufacturing Inc. entered into an Ownership Purchase Agreement to purchase all of the membership interests in Dalrada Technology Limited on March 1, 2023. DTL is a holding company for all European based Dalrada Precision entities.\nDalrada Technology Spain L.T. (DTS)- DTS was established as a Spanish subsidiary of DTL for the expansion of the manufacturing and sale of the Companys heat pump technology throughout Europe.\nDalrada Technologies\nDalrada Technologies has worked with some of the worlds most recognizable companies, providing digital engineering for cutting-edge software systems and offering a host of robust digital services. This business division connects the world with integrated technology and innovative solutions, delivering advanced capabilities and error-free results. Dalrada Technologies creates digital products with expert computer information technology and software engineering services for a variety of technical industries and clients in both B2B and B2C environments.\nPrakat (Prakat)- Prakat is an ISO 9001-certified company that provides end-to-end technology services across various industries, improving the value chain. The Company specializes in test engineering, accessibility engineering, product engineering, application modernization, billing and revenue management, CRM, and block chain. Prakat provides global customers with software and technology solutions specializing in Test Engineering, Accessibility Engineering, Product Engineering and Application Modernization.\nDalrada Corporate\nDalrada Corporate covers activities which support the entire suite of Dalrada subsidiaries. Dalrada Corporate includes the areas of administration, finance, human resources, legal advice, information technology, and marketing. It also contains executive management and shareholder-related services.\nGoing Concern\nThese consolidated financial statements have been prepared on a going concern basis, which implies that the Company will continue to realize its assets and discharge its liabilities in the normal course of business. As of June 30, 2023, and 2022, the Company had a working capital deficit of $202,420 and $ $9,357,651, respectively. The Company incurred negative cash flows from operations for the years ended June 30, 2023, and 2022, and raises substantial doubt about the Companys ability to continue as a going concern. The continuation of the Company as a going concern is dependent upon the successful financing through equity and/or debt investors and growing the subsidiaries anticipated to be profitable while reducing investments in areas that are not expected to have long-term benefits. The Company expects to fund any short-term operational deficits primarily through collection of outstanding accounts receivable from medical insurance providers, Medicare, pharmaceutical sales, the sale of Likido units as well as loans from related parties.\n2. Summary of Significant Accounting Policies\n(a) Basis of Presentation\nThese consolidated financial statements of the Company have been prepared in accordance with accounting principles generally accepted in the United States of America (US GAAP) and are expressed in U.S. dollars. The Companys fiscal year end is June 30.\n(b) Principles of Consolidation\nThe consolidated financial statements include the accounts of the Company and its subsidiaries, as well as the accounts of any entities over which the Company has a controlling financial interest in accordance with Accounting Standards Codification (ASC) 810 Consolidation. All transactions and balances between these entities have been eliminated upon consolidation.\nThe consolidated financial statements include the accounts of Dalrada Financial Corp., Genefic Products Inc., Solas Corp., Empower Genomics, Inc., International Health Group, Inc., Pala Diagnostics, LLC, Pacific Stem Cells, LLC, Watson Rx Solutions, Inc., Shark Innovative Technologies Corp., Dalrada Precision Corp., Dalrada Energy Services, Inc., Likido Corp., Ignite I.T., Bothof Brothers Construction Inc., Prakat Solutions, Inc., Prakat Solutions Private Limited, Likido Ltd., Deposition Technologies Ltd. and Dalrada Technology Ltd., controlled by the Company through its direct or indirect ownership of a majority voting interest. Additionally, the consolidated financial statements include the accounts of variable interest entities (VIEs) in which the Company has a variable interest and for which the Company is the primary beneficiary as it has both: (1) the power to direct the activities of the VIE that most significantly impact the VIEs economic performance and (2) the obligation to absorb losses of the VIE that potentially could be significant to the VIE or the right to receive benefits from the VIE that potentially could be significant to the VIE. All significant intercompany accounts and transactions are eliminated in consolidation.\nIncome attributable to the minority interest in the Companys majority owned and controlled consolidated subsidiaries is recorded as net income attributable to noncontrolling interests in the Consolidated Statements of Operations and Comprehensive Loss and the noncontrolling interest is reflected as a separate component of the statement of stockholders equity, consolidated balance sheet, and statement of cash flows.\n(c) Use of Estimates\nThe preparation of these consolidated financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The Company regularly evaluates estimates and assumptions related to the revenue, valuation of inventory, valuation of acquired assets and liabilities, variables used in the computation of share-based compensation, litigation, and evaluation of goodwill and intangible assets for impairment.\nThe Company bases its estimates and assumptions on current facts, historical experience, and various other factors that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\n(d) Cash and Cash Equivalents\nCash and cash equivalents include cash deposits in financial institutions, and the Company considers all highly liquid instruments with a maturity of three months or less at the time of issuance to be cash equivalents.\n(e) Concentrations of Credit Risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk consist principally of cash, accounts receivable, and cash equivalents. The Company generally maintains balances in various operating accounts at financial institutions that management believes to be of high credit quality, in amounts that may exceed federally insured limits. The Company has not experienced any losses related to its cash and cash equivalents and does not believe that it is subject to unusual credit risk beyond the normal credit risk associated with commercial banking relationships.\nWhen estimating its allowance for credit losses related to revenues from Covid Testing, the Company differentiates its receivables based on the following customer types: healthcare insurers, government payers, and cash payers. Additionally, the Company applies assumptions and judgments for assessing collectability and determining net revenues and accounts receivable from its customers. Management considers various historical collection factors for assessing collectability and determining net revenues and accounts receivable from our customers which include the period that the receivables have been outstanding, history of payment amounts, status of collections due, and applicable statutes of limitations.\nDuring the year ended June 30, 2023 and 2022, healthcare insurers and government payers accounted for over 42% and 61% of total revenues, respectively. Also, healthcare insurers and government payers amounted to total revenues of $12,546,849 and $11,824,717 for the years ended June 30, 2023 and 2022, respectively. The accounts receivable related to both healthcare insurers and government payers is $1,499,415 and $4,129,953 as of June 30, 2023 and 2022, respectively.\nDuring the year ended June 30, 2023, DESs Averett University project accounted for $3,741,494, or 12% of total revenues.\nAs of June 30, 2023 and 2022, $829,239 and $880,500 is owed by customers from the sale of Likido units, respectively.\n(f) Fair Value Measurements\nPursuant to ASC 820, Fair Value Measurements and Disclosures, an entity is required to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. ASC 820 establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instruments categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. ASC 820 prioritizes the inputs into three levels that may be used to measure fair value:\nLevel 1 - applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2 - applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3 - applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe Companys financial instruments consist principally of cash, accounts receivable, accounts payable and accrued liabilities, notes payable, and amounts due to related parties. Pursuant to ASC 820, the fair value of cash is determined based on Level 1 inputs, which consist of quoted prices in active markets for identical assets. The recorded values of all other financial instruments approximate their current fair values because of their nature and respective maturity dates or durations.\nThe fair value of the contingent consideration obligations was based on a probability weighted approach derived from the estimates of earn-out criteria and the probability assessment with respect to the likelihood of achieving those criteria. The measurement was based on significant inputs that were not observable in the market, therefore, the Company classified this liability as Level 3 in the following tables:\nSchedule of fair value of assets and liabilities\nFair Value Measurements as of June 30, 2023 Using:\nLevel 1 Level 2 Level 3 Total\nLiabilities:\nContingent consideration - - $ 4,285,389 $ 4,285,389\n$ - $ - $ 4,285,389 $ 4,285,389\nFair Value Measurements as of June 30, 2022 Using:\nLevel 1 Level 2 Level 3 Total\nLiabilities:\nContingent consideration - - $ 4,870,800 $ 4,870,800\n$ - $ - $ 4,870,800 $ 4,870,800\nThe Company records a contingent consideration liability relating to stock price guarantees included in its acquisition and consulting agreements. The estimated fair value of the contingent consideration is recorded using a significant observable measure and is therefore classified as a Level 3 financial instrument.\nThe fair value of the contingent consideration liability related to the Companys business combinations is valued based on a forward contract and the guaranteed equity value at settlement as defined in the acquisition agreement (see Note 4. Business Combinations and Asset Acquisition). The fair value of the contingent consideration is then calculated based on the guaranteed equity value at settlement as defined in the acquisition agreement. (See Note 14. Commitments and Contingencies).\nChanges in contingent consideration liability during the year ended June 30, 2023, and 2022, are as follows:\nSchedule of changes in contingent consideration liability\nContingent\nConsideration\nLiability\nBalance as of June 30, 2022 $ 4,870,800\nChange in fair value (585,411 )\nBalance as of June 30, 2023 $ 4,285,389\nContingent\nConsideration\nLiability\nBalance as of June 30, 2021 $ -\nInitial recognition in connection with acquisition of Deptec 5,053,000\nChange in fair value (182,200 )\nBalance as of June 30, 2022 $ 4,870,800\n(g) Convertible Instruments\nThe Company evaluates and accounts for conversion options embedded in convertible instruments in accordance with ASC Topic 815, Derivatives and Hedging Activities (ASC 815).\nApplicable U.S. GAAP requires companies to bifurcate conversion options from their host instruments and account for them as free-standing derivative financial instruments according to certain criteria. The criteria includes circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument.\nThe Company accounts for convertible instruments (when the Company has determined that the embedded conversion options should not be bifurcated from their host instruments) as follows. The Company records, when necessary, deemed dividends for the intrinsic value of conversion options embedded in shares based upon the differences between the fair value of the underlying common stock at the commitment date of the transaction and the effective conversion price embedded in the shares.\n(h) Accounts Receivable\nAccounts receivables are derived from products and services delivered to customers and are stated at their net realizable value. Each month, the Company reviews its receivables on a customer-by-customer basis and evaluates whether an allowance for doubtful accounts is necessary based on any known or perceived collection issues. Any balances that are eventually deemed uncollectible are written off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. As of June 30, 2023, and 2022, the Company had an allowance of doubtful accounts of $2,430,615 and $119,791, respectively.\nPala and Empower have a standardized approach to estimate the amount of consideration that we expect to be entitled to for its COVID-19 testing revenue, including the impact of contractual allowances (including payer denials), and patient price concessions. The Company principally estimates the allowance for credit losses by pool based on historical collection experience, the current credit worthiness of the customers, current economic conditions, expectations of future economic conditions and the period of time that the receivables have been outstanding. Adjustments to our estimated contractual allowances and implicit patient price concessions are recorded in the current period as changes in estimates.\n(i) Inventory\nInventory is recorded at the lower of cost or net realizable value on a first-in first-out (FIFO) basis. As of June 30, 2023 and 2022, inventory is comprised of raw materials purchased from suppliers, work-in-progress, and finished goods produced or purchased for resale. The Company establishes inventory reserves for estimated obsolete or unsaleable inventory equal to the difference between the cost of inventory and the estimated realizable value based upon assumptions about future market conditions.\n(j) Property and Equipment\nProperty and equipment are stated at cost less accumulated depreciation and amortization. Depreciation and amortization expense is recognized using the straight-line method over the estimated useful life of each asset, as follows:\nSchedule of property and equipment, estimated useful life\nEstimated Useful Life\nComputer and office equipment\n3 - 5 years\nMachinery and equipment\n5 years\nLeasehold improvements\nShorter of lease term or useful life\nEstimated useful lives are periodically assessed to determine if changes are appropriate. Maintenance and repairs are charged to expense as incurred. When assets are retired or otherwise disposed of, the cost of these assets and related accumulated depreciation or amortization are eliminated from the Consolidated Balance Sheet and any resulting gains or losses are included in the Consolidated Statement of Operations in the period of disposal.\n(k) Business Combinations and Asset Acquisitions\nThe Company accounts for acquisitions in which it obtains control of one or more businesses as a business combination. The purchase price of the acquired businesses is allocated to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values at the acquisition date. The excess of the purchase price over those fair values is recognized as goodwill. During the measurement period, which may be up to one year from the acquisition date, the Company may record adjustments, in the period in which they are determined, to the assets acquired and liabilities assumed with the corresponding offset to goodwill. If the assets acquired are not a business, the Company accounts for the transaction or other event as an asset acquisition. Under both methods, the Company recognizes the identifiable assets acquired, the liabilities assumed, and any noncontrolling interest in the acquired entity. In addition, for transactions that are business combinations, the Company evaluates the existence of goodwill or a gain from a bargain purchase.\n(l) Contingent Consideration\nA Company acquisition includes contingent consideration as part of the purchase price. The fair value of the contingent consideration is estimated as of the acquisition date based on the present value of the contingent payments to be made using a weighted probability of possible payments. The unobservable inputs used in the determination of the fair value of the contingent consideration include managements assumptions about the likelihood of payment based on the established benchmarks and discount rates based on internal rate of return analysis. The fair value measurement includes inputs that are Level 3 measurement as discussed in Note 4 to our consolidated financial statements included in this annual report on Form 10-K. Should actual results increase or decrease as compared to the assumption used in our analysis, the fair value of the contingent consideration obligations will increase or decrease, up to the contracted limit, as applicable. Changes in the fair value of the contingent earn-out consideration could cause a material impact and volatility in our operating results. The contingent consideration decreased by $585,411 to a balance of $4,285,389 during the year ended June 30, 2023.\n(m) Impairment of Long-Lived Assets\nThe Company reviews its long-lived assets (property and equipment and amortizable intangible assets) for impairment whenever events or circumstances indicate that the carrying amount of an asset may not be recoverable. If the sum of the expected cash flows, undiscounted, is less than the carrying amount of the asset, an impairment loss is recognized as the amount by which the carrying amount of the asset exceeds its fair value.\nGoodwill is tested annually at June 30 for impairment and upon the occurrence of certain events or substantive changes in circumstances.\nThe annual goodwill impairment test allows for the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. An entity may choose to perform the qualitative assessment on none, some or all of its reporting units or an entity may bypass the qualitative assessment for any reporting unit and proceed directly to step one of the quantitative impairment tests. If it is determined, on the basis of qualitative factors, that the fair value of a reporting unit is, more likely than not, less than its carrying value, the quantitative impairment test is required. The quantitative impairment test calculates any goodwill impairment as the difference between the carrying amount of a reporting unit and its fair value, but not to exceed the carrying amount of goodwill. As of June 30, 2023 and 2022, there were quantitative factors that indicated goodwill was impaired in the amounts of $433,556 and $218,308, respectively.\nAn intangible asset is an identifiable non-monetary asset without physical substance. Such an asset is identifiable when it is separable, or when it arises from contractual or other legal rights. Separable assets can be sold, transferred, licensed, etc. Examples of intangible assets include computer software, licenses, trademarks, patents, films, and copyrights. The Companys intangible assets are finite lived assets and are amortized on a straight-line basis over the estimated useful lives of the assets.\n(n) Revenue Recognition\nThe Company determines revenue recognition in accordance with ASU 2014-09, Revenue from Contracts with Customers, and its related amendments (collectively known as ASC 606) through the following steps:\n- Identification of a contract with a customer;\n- Identification of the performance obligations in the contract;\n- Determination of the transaction price;\n- Allocation of the transaction price to the performance obligations in the contract; and\n- Recognition of revenue when or as the performance obligations are satisfied.\nRevenue is recognized when control of the promised goods or services is transferred to customers, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. As a practical expedient, the Company does not adjust the transaction price for the effects of a significant financing component if, at contract inception, the period between customer payment and the transfer of goods or services is expected to be one year or less.\nThe Companys revenue is derived from the sales of its products, which represents net sales recorded in the Companys Consolidated Statements of Operations. Product sales are recognized when performance obligations under the terms of the contract with the customer are satisfied. Typically, this would occur upon transfer of control, including passage of title to the customer and transfer of risk of loss related to those goods. The Company measures revenue as the amount of consideration to which it expects to be entitled in exchange for transferring goods (transaction price). The Company records reductions to revenue for estimated customer returns, allowances, markdowns, and discounts. The Company bases its estimates on historical rates of customer returns and allowances as well as the specific identification of outstanding returns, markdowns and allowances that have not yet been received by the Company. The actual amount of customer returns and allowances is inherently uncertain and may differ from the Companys estimates. If the Company determines that actual or expected returns or allowances are significantly higher or lower than the reserves it established, it will record a reduction or increase, as appropriate, to net sales in the period in which it makes such a determination. Reserves for returns and markdowns are included within accrued expenses and other liabilities in the Companys Consolidated Balance Sheets. Allowance and discounts are recorded in accounts receivable, net and the value of inventory associated with reserves for sales returns are included within prepaid expenses and other current assets in the Consolidated Balance Sheets.\nThe Company estimates warranty claims reserves based on historical results and research and determined that a warranty reserve was not necessary as of June 30, 2023, or 2022.\nNet revenues from COVID-19 testing accounted for over 34% and 61% of the Companys total net revenues for the years ended June 30, 2023 and 2022, respectively, and primarily comprised of a high volume of relatively low-dollar transactions. Pala and Empower, which provides clinical testing services and other services, satisfies its performance obligations and recognizes revenues primarily upon completion of the testing process (when results are reported) or when services have been rendered. Pala and Empower do not invoice the patients themselves for testing but relies on healthcare insurers and government payers for reimbursement for COVID-19 testing. Pala has a standardized approach to estimate the amount of consideration that we expect to be entitled to, including the impact of contractual allowances (including payer denials), and patient price concessions. We regularly assess the state of our billing operations in order to identify issues which may impact the collectability of receivables or revenue estimates. We believe that the collectability of our receivables is directly linked to the quality of our billing processes, most notably those related to obtaining the correct information in order to bill effectively for the services we provide. As such, we strive to implement best practices and work with our third-party billing company to reduce the number of requisitions that we receive from healthcare providers with missing or incorrect billing information. We believe that our collection and revenue estimation processes, along with our close monitoring of our billing operations, help to reduce the risk associated with material adjustments to reserve estimates. However, changes to our estimate of the impact of contractual allowances (including payer denials) and patient price concessions could have a material impact on our results of operations and financial condition in the period that the estimates are adjusted. Adjustments to our estimated contractual allowances and implicit patient price concessions are recorded in the current period as changes in estimates. Although we have limited track record, further adjustments to the allowances, based on actual receipts, may be recorded upon settlement.\nDES recognizes revenue on energy savings contracts where it provides design, engineering and equipment upgrades to obtain energy savings through Environmental, Social, and Governance (ESG) targets. DES recognizes revenue through two performance obligations: 1) the Energy Savings Report (point in time); and 2) functional IP license (point in time with a significant financing component and royalty and variable consideration constraint). Up to and upon completion of an energy savings project, DES calculates the monthly energy savings based on prior and current energy consumption totals. Upon completion of a project, the customer pays monthly fixed payments which represents a financing component. DES recognized monthly interest income and royalty revenue when the constraint from the energy savings percentage is known. DES records revenue as it provides additional management, consulting, and other services as they are incurred.\nDES records a sales-type where the Company is the lessor. The Company records its investment in the plant and equipment, used to upgrade a customers real property, leased to franchisees on a net basis, which is comprised of the present value of fixed lease payments not yet received over the course of the energy savings agreements. The current and long-term portions of our net investment in sales-type leases are included in Accounts Receivable, net - related parties and Long-term receivables - related parties respectively in the Consolidated Balance Sheets. Unearned income is recognized as interest income over the lease term. Sales-type leases result in the recognition of gain or loss at the commencement of the lease, which is recorded to Revenues - related party in the Consolidated Statements of Operations and Comprehensive Loss.\nDepTec and Bothof recognize revenues using a cost-based input method, by which we use actual costs incurred relative to the total estimated contract costs to determine, as a percentage, progress toward contract completion. Provisions for estimated losses on uncompleted contracts are made in the period in which such losses are determined.\nThe Company also earns service revenue from its other subsidiaries, including information technology and consulting services via Prakat, educational programs, and courses via IHG, management services for Solas, and custom parts manufacturing for Dalrada Precision Parts. For Prakat, Solas and Dalrada Precision Parts, revenues are recognized when performance obligations have been satisfied and the services are complete. This is generally at a point of time upon written completion and client acceptance of the project or product, which represents transfer of control to the customer. For IHG, revenues are recognized over the course of a semester while services are performed.\nDisaggregation of Revenue\nThe following table presents the Company's revenue disaggregated by revenue source:\nSchedule of disaggregated revenue\nYear Ended\nJune 30,\nProduct sales - third parties $ 7,324,522 $ 2,280,403\nProduct sales - related party 77,308 75,324\nService revenue - third parties 20,131,701 15,584,154\nService revenue - related party 2,205,438 1,327,732\nTotal revenue $ 29,738,969 $ 19,267,613\nAccounts Receivable and Deferred Revenue\nThe following table provides information about receivables and contract liabilities from contracts with customers:\nSchedule of receivables and contract liabilities\nYear Ended\nJune 30,\nAccounts receivable, net $ 4,453,104 $ 6,406,555\nAccounts receivable, net - related parties 752,348 41,603\nLong-term receivables 41,722 42,395\nLong-term receivables - related parties 1,173,893 1,209,103\nDeferred revenue 1,337,259 720,923\nThe Company invoices customers based upon contractual billing schedules, and accounts receivable are recorded when the right to consideration becomes unconditional. Contract liabilities represent a set-up fee prepayment received from a customer in advance of performance obligations met.\n(o) Cost of Revenue\nCost of revenue consists primarily of inventory sold and related freight for product sales and direct labor for information technology and consulting services. The following table is a breakdown of cost of revenue:\nSchedule of cost of revenue\nYear Ended\nJune 30,\nProduct sales $ 5,546,015 $ 2,547,392\nService revenue 15,133,035 6,213,874\nTotal cost of revenue $ 20,679,050 $ 8,761,266\n(p) Advertising\nAdvertising costs are expensed as incurred. During the fiscal years ended June 30, 2023, and 2022, advertising expenses were $292,473 and $560,777, respectively.\n(q) Stock-based Compensation\nThe Company records stock-based compensation in accordance with ASC 718, Compensation - Stock Compensation using the fair value method. All transactions in which goods or services are the consideration received for the issuance of equity instruments are accounted for based on the fair value of the consideration received or the fair value of the equity instrument issued, whichever is more reliably measurable. Equity instruments issued to employees and the cost of the services received as consideration are measured and recognized based on the quoted market price of the equity instruments issued. During the years ended June 30, 2023, and 2022, stock-based compensation expenses were $4,022,656 and $2,772,770, respectively.\n(r) Foreign Currency Translation\nThe functional currency of the Company is the United States dollar. The functional currency of the Likido, DepTec, and Dalrada Technology subsidiaries is the Great British Pound. The functional currency of Prakat is the Indian Rupee. The functional currency of Dalrada Technology Spain is the Euro. The financial statements of the Companys subsidiaries were translated to United States dollars in accordance with ASC 830, Foreign Currency Translation Matters, using period-end rates of exchange for assets and liabilities, and average rates of exchange for the year for revenues and expenses. Gains and losses arising on foreign currency denominated transactions are included in Consolidated Statements of Operations.\n(s) Comprehensive Loss\nASC 220, Comprehensive Income, establishes standards for the reporting and display of comprehensive loss and its components in the consolidated financial statements. During the years ended June 30, 2023, and 2022, the Companys only component of comprehensive loss was foreign currency translation adjustments.\n(t) Non-controlling Interests\nNon-controlling interests are classified as a separate component of equity in the Company's Consolidated Balance Sheets and Statements of Changes in Stockholders Equity (Deficit). Net loss attributable to non-controlling interests are reflected separately from consolidated net loss in the Consolidated Statements of Comprehensive Loss and Statements of Changes in Stockholders Equity (Deficit). Any change in ownership of a subsidiary while the controlling financial interest is retained is accounted for as an equity transaction between the controlling and non-controlling interests. In addition, when a subsidiary is deconsolidated, any retained non-controlling equity investment in the former subsidiary will be initially measured at fair value and the difference between the carrying value and fair value of the retained interest will be recorded as a gain or loss.\nAs of June 30, 2023, and 2022, non-controlling interests pertained to the Companys Prakat and Pala subsidiaries.\n(u) Earnings (Loss) per Share\nThe Company computes net income (loss) per share in accordance with ASC 260, Earnings per Share. ASC 260 requires presentation of both basic and diluted earnings per share (EPS) on the face of the income statement. Basic EPS is computed by dividing net income (loss) available to common shareholders (numerator) by the weighted average number of shares outstanding (denominator) during the period. Diluted EPS gives effect to all dilutive potential common shares outstanding during the periods using the treasury stock method and convertible preferred stock using the if-converted method. In computing diluted EPS, the average stock price for the periods is used in determining the number of shares assumed to be purchased from the exercise of stock options or warrants.\nAs all potentially dilutive securities are anti-dilutive as of June 30, 2023, diluted net loss per share is the same as basic net loss per share. Potentially dilutive items outstanding for the years ended June 30, 2023, and 2022, are as follows:\nSchedule of anti-dilutive shares\nConvertible notes payable - 2,999,148\nCommon stock warrants 45,451,134 12,025,000\nWeighted average exercise price $ 0.33 $ 0.45\nProceeds $ 15,150,695 $ 5,411,250\nAverage stock price for FY $ 0.13 $ 0.50\nShares purchased 116,543,810 10,822,500\nThe average closing price during the years exceeded the exercise prices; as a result, there was no effect during the years ended June 30, 2023, or 2022.\n(v) Income Taxes\nThe Company accounts for income taxes using the asset and liability method in accordance with ASC 740, Accounting for Income Taxes. The asset and liability method provides that deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using the currently enacted tax rates and laws that will be in effect when the differences are expected to reverse.\n(w) Recent Accounting Pronouncements\nIn October 2021, the FASB issued ASU 2021-08 - Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers (ASU 2021-08). Under current accounting standards, contract assets and contract liabilities acquired in a business combination are to be recorded at fair value using the ASC 805 measurement principle. ASU 2021-08 requires the acquirer to recognize and measure contract assets and contract liabilities acquired in a business combination in accordance with Topic 606: Revenue from Contracts with Customers as if the acquirer had originated the contracts rather than at fair value. ASU 2021-08 is effective for fiscal years beginning after December 15, 2022, with early adoption permitted. The Company elected to early adopt ASU 2021-08 on a prospective basis as of January 1, 2022. The election to use practical expedients allowed under ASU 2021-08 will be applied on an acquisition-by-acquisition basis. There was no impact to the Companys consolidated financial statements as of the adoption date.\nThe Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\n3. Investment in Pala Diagnostics\nIn August 2021, Dalrada entered a joint venture (JV) with Vivera Pharmaceuticals, Inc (Vivera) for a 51% ownership and controlling interest to operate a CLIA-certified diagnostics lab focused on SARS-CoV-2 testing. The JV has been treated as a business combination.\nThe Company determined that Pala is a Variable Interest Entity (VIE); we believe that the Company has the power to direct the activities that most significantly impact the economic performance of Pala, and accordingly, Dalrada is considered the primary beneficiary of the VIE. The Company has consolidated the activities of the VIE.\nPursuant to the partnership agreement, Dalrada contributed equity in the amount of $500,000 for operating capital and Vivera contributed property and equipment at a fair value of $111,185. This amount was recorded to non-controlling interest equity balance in the Companys Consolidated Balance Sheets.\nPursuant to the JV agreement, Dalrada issued 250,000 shares of common stock to Vivera in October 2021. The fair value of $58,560 was recorded to goodwill as of June 30, 2022. This goodwill balance was written down to $0 as of June 30, 2023.\nIn December 2021, the Company filed suit against Vivera and Paul Edalat, Viveras Chairman and CEO, for misappropriation of funds on behalf of the joint venture in the amount of $2,104,509. See Item 3. Legal Proceedings for additional information related to the lawsuit with Vivera.\n4. Business Combinations and Asset Acquisition\nFiscal 2023 Transactions\nBothof Brothers Construction Inc. (Bothof)\nOn October 17, 2022, the Company acquired 100% of the common stock of Bothof. The Company assumed the net liabilities of Bothof in exchange for the employment services of the selling shareholder. All considerations in the transaction require the continued employment of the selling shareholder and thus is not consideration transferred under ASC 805.\nThe Company entered into a 36-month employment agreement with the selling shareholder for $30,000 monthly and additionally issued 3,000,000 cashless warrants, at a strike price of $0.15 per share, to equal $450,000, which shall vest quarterly over a period of 24 months (the Warrant Consideration).\nIf at the end of the 24-month warrant distribution period, beginning on the effective date of October 17, 2022 (the Distribution Period), the value of cashless warrants does not equate to $6,000,000 (the Target Amount) in value, then the Company shall issue additional cashless warrants equal to the shortfall between the value of the Warrants Consideration and the Target Amount (the Valuation Shortfall).\nThe value of the Warrant Consideration to the selling shareholder is $5,101,223. The Company records the value as stock-based compensation on a straight-line basis over the vesting period of 24-months:\nThe Warrant Consideration is contingent on the selling shareholders continued employment with the Company; therefore, it is treated as stock-based compensation expense and recognized ratably over a 24-month period.\nThe Company acquired Bothof to facilitate the work of and expand the Dalrada Energy Services segment. Bothofs selling shareholder holds certain licenses, construction/engineering design expertise and management skills which will leverage synergies with Dalrada Energy Services.\nThe Bothof transaction was accounted for as a business combination in accordance with ASC 805, Business Combinations. The Company has determined the fair values of the assets acquired and liabilities assumed.\nThe Company has made a preliminary allocation of the purchase price regarding the acquisition related to the assets acquired and liabilities assumed as of the purchase date. The following table summarizes the purchase price allocation:\nSchedule of purchase price allocation\nPreliminary\nPurchase Price Allocation\nCash and cash equivalents $ 70,979\nOther receivables 27,289\nRight of use asset, net 18,618\nProperty and equipment, net 17,179\nTrade name 6,776\nAccounts payable (24,165 )\nAccrued liabilities (18,807 )\nDeferred revenue (60,000 )\nRight of use liability (18,618 )\nNotes payable, current portion (19,251 )\nPurchase price consideration $ -\nTrade name is amortized on a straight-line basis over one month. The fair value estimate of the trade name for the purchase price allocation was based on an analysis of the present value of future cash flows and relief from royalty method.\nDalrada Technology LTD EU (DTL)\nOn March 1, 2023, the Company acquired 100% of the common stock of DTL in an asset acquisition. In consideration for the asset acquisition, the Company issued 1,000,000 cashless warrants, at a strike price of $0.10 per share, which shall vest quarterly over 36 months.\nThe value of the Warrant Consideration to the selling shareholder is $68,975. The value was calculated using the Black-Scholes model. The Company recorded a liability for the warrants at the acquisition date as the warrants are not contingent on employment of the sellers:\nThe Company acquired DTL as a holding company for its European operations, including Likido Ltd. and DepTec. DTL will also be utilized to pursue certain European grants and other governmental funding opportunities. The two sellers of DTL are related parties to the Chairman and CEO of the Company.\nThe DTL transaction was accounted for as an asset acquisition in accordance with ASC 805, Business Combinations. The Company has determined the fair values of the assets acquired and liabilities assumed.\nThe Company has made a preliminary allocation of the purchase price regarding the asset acquisition related to the assets acquired and liabilities assumed as of the purchase date. The following table summarizes the purchase price allocation:\nSchedule of purchase price allocation\nPreliminary\nPurchase Price Allocation\nCash and cash equivalents $ 9,108\nDeposits 13,536\nPrepaids 24,666\nFurniture and Fixtures 64,533\nTrade name 206,336\nLoan Payable (249,204 )\nPurchase price consideration $ 68,975\nTrade name is amortized on a straight-line basis over two years.\nFiscal 2022 Transactions\nDeposition Technology Ltd. (DepTec)\nEffective April 7, 2022, the Company acquired 100% of the common stock of DepTec at a valuation of 2,000,000 Great Britain Pounds (GBP). In consideration for the acquisition, the Company shall issue 3,000,000 shares of its common stock evenly every quarter for 24 months with the initial distribution to take place on the effective date (the Share Consideration).\nIf at the end of the 24-month stock distribution period, beginning on the effective date of April 7, 2022 (the Distribution Period), the value of common stock consideration does not equate to 4,000,000 GBP (the Target Amount) in value (based on the GBP to USD currency exchange rate of 1.30690 on April 7, 2022, is $5,228,000 USD), then the Company shall issue additional shares equal to the shortfall between the value of the Share Consideration and the Target Amount (the Valuation Shortfall). The value of the issued stock shall be deemed at the date of issue, which is the end of the Distribution Period.\nAs a result of the Valuation Shortfall, the Company recorded contingent consideration (see Note 2. Summary of Significant Accounting Policies) in connection with the acquisition. The following is a summary of the purchase price consideration:\nSchedule of purchase price consideration\nCommon stock to be issued $ 175,000\nContingent consideration 5,053,000\nTotal purchase price consideration $ 5,228,000\nThe Company acquired DepTec to expand its Precision Manufacturing segment into the microchip and semiconductor industries. Furthermore, DepTecs location, experience and manufacturing capabilities can leverage synergies with Likido. The founder and principal of DepTec is a related party to the CEO of the Company.\nThe DepTec transaction was accounted for as a business combination in accordance with ASC 805, Business Combinations. The Company has determined preliminary fair values of the assets acquired and liabilities assumed. These values are subject to change as we perform additional reviews of our assumptions utilized.\nThe Company has made a preliminary allocation of the purchase price regarding the acquisition related to the assets acquired and liabilities assumed as of the purchase date. The following table summarizes the purchase price allocation:\nSchedule of purchase price allocation\nPurchase Price\nAllocation\nCash and cash equivalents $ 301,647\nAccounts receivable, net 375,357\nInventories 146,300\nPrepaid expenses and other current assets 6,025\nProperty and equipment, net 28,437\nIntangible assets 1,810,580\nGoodwill 2,962,938\nAccounts payable (240,056 )\nAccrued liabilities (108,180 )\nDeferred revenue -\nNotes payable (55,048 )\nPurchase price consideration $ 5,228,000\nIntangible assets acquired include trademarks, developed technology and customer relationships, which are amortized on a straight-line basis over ten to fifteen years. The fair value estimates of the intangibles for the purchase price allocation were based on an analysis of the present value of future cash flows, relief from royalty, and a replacement cost approach.\nGoodwill is primarily attributable to the go-to-market synergies that are expected to arise because of the acquisition and other intangible assets that do not qualify for separate recognition. The goodwill is not deductible for tax purposes.\nWatson Rx LLC (Watson)\nEffective June 7, 2022, the Company acquired 100% of the common stock of Watson. In consideration for the acquisition, the Company shall issue 2,000,000 shares of its common stock per the following schedule: 1,000,000 shares to be issued at the effective date of the Agreement; and 1,000,000 shares issued in even amounts every quarter over a period of two years beginning on the effective date of June 7, 2022.\nThe following is a summary of the purchase price consideration:\nSchedule of purchase price consideration\nCommon stock (and to be issued) $ 918,000\nLine of credit 244,395\nBank loan 467,712\nTotal purchase price consideration $ 1,630,107\nThe common stock value of $918,000 was based on the value of 2,000,000 common stock shares at the Companys price per share on the effective date of acquisition, or June 7, 2022.\nThe Company acquired Watson to further integrate Genefic Products into the education, nursing, and other health solutions through a comprehensive pharmaceutical opportunity with licenses in 50 States including Washington D.C. Genefic Products expects to strategically integrate the services of the diagnostic laboratories with the pharmaceutical business.\nThe Watson transaction was accounted for as a business combination in accordance with Accounting Standards Codification (ASC) Topic 805, Business Combinations (ASC 805). The Company has determined preliminary fair values of the assets acquired and liabilities assumed. These values are subject to change as we perform additional reviews of our assumptions utilized.\nThe Company has made a preliminary allocation of the purchase price regarding the acquisition related to the assets acquired, liabilities assumed and noncontrolling interests as of the purchase date. The following table summarizes the purchase price allocation:\nSchedule of purchase price allocation\nPurchase Price\nAllocation\nCash and cash equivalents $ 6,560\nAccounts receivable, net 13,300\nInventories 27,556\nProperty and equipment, net 7,391\nDeposits 1,252\nIntangible assets 946,800\nGoodwill 697,057\nAccounts payable (69,809 )\nTotal purchase price consideration $ 1,630,107\nIntangible assets acquired include trademarks and licenses, which are amortized on a straight-line basis over fifteen to seventeen years. The fair value estimates of the intangibles for the purchase price allocation were based on an analysis of the present value of future cash flows, relief from royalty, and a replacement cost approach.\nGoodwill is primarily attributable to the go-to-market synergies that are expected to arise because of the acquisition and other intangible assets that do not qualify for separate recognition. The goodwill is not deductible for tax purposes.\nUnaudited Pro Forma Financial Information\nThe following unaudited pro forma financial information presents the Companys financial results as if the various acquisitions had occurred as of July 1, 2022. The unaudited pro forma financial information is not necessarily indicative of what the financial results would have been had the acquisition been completed on this date. In addition, the unaudited pro forma financial information is not indicative of, nor does it purport to project the Companys future financial results. The pro forma information does not give effect to any estimated and potential cost savings or other operating efficiencies that could result from the acquisitions:\nSchedule of pro forma information\nYear Ended\nJune 30,\nRevenues\n$ 33,047,518\n$ 23,723,570\nNet loss attributable to Dalrada\n$ (23,202,682 )\n$ (14,169,496 )\nNet loss per common share - basic\n$ (0.28 )\n$ (0.20 )\n5. Selected Balance Sheet Elements\nInventories\nInventories consisted of the following as of June 30, 2023, and 2022:\nSchedule of Inventories\nJune 30, June 30,\nRaw materials $ 658,175 $ 399,706\nWork-in-progress 708,007 -\nFinished goods 712,510 1,224,915\nInventory, Net $ 2,078,692 $ 1,624,621\nProperty and Equipment, Net\nProperty and equipment, net consisted of the following as of June 30, 2023, and 2022:\nSchedule of property and equipment, net\nJune 30, June 30,\nMachinery and equipment $ 1,448,556 $ 740,147\nLeasehold improvements 208,689 314,642\nComputer and office equipment 426,162 518,017\nConstruction in progress 249,613 -\n2,333,020 1,572,806\nLess: Accumulated depreciation (856,938 ) (496,394 )\n$ 1,476,082 $ 1,076,412\nDepreciation expense of $360,544 and $252,937 for the years ended June 30, 2023, and 2022, respectively, were included in selling, general and administrative expenses in the Consolidated Statements of Operations.\nGoodwill\nGoodwill consisted of the following by entity as of June 30, 2023, and 2022:\nSchedule of goodwill\nPrecision Health Total\nBalance: June 30, 2022 $ 3,122,811 $ 1,130,613 $ 4,253,424\nAdditions - - -\nAdjustments to purchase price allocation (16,721 ) - -\nLess: loss on impairment - (433,556 ) (433,556 )\nBalance: June 30, 2023 $ 3,106,090 $ 697,057 $ 3,803,147\nPrecision Health Total\nBalance: June 30, 2021 $ 143,152 $ 593,304 $ 736,456\nAdditions 2,979,659 755,617 3,735,276\nLess: loss on impairment - (218,308 ) (218,308 )\nBalance: June 30, 2022 $ 3,122,811 $ 1,130,613 $ 4,253,424\nIntangible Assets, Net\nIntangible assets, net consisted of the following as of June 30, 2023, and June 30, 2022:\nSchedule of intangible assets, net\nDeveloped\ntechnology,\nCurriculum\nCustomer\nsoftware,\ndevelopment Licenses relationships Trademarks and other Totals\nBalance: June 30, 2022 $ 693,385 $ 1,064,000 $ 1,230,159 $ 348,100 $ 335,021 $ 3,670,665\nAdditions - - - 186,047 477,458 663,505\nAdjustments to purchase price allocation - - 14,321 1,400 1,000 16,721\nBalance: June 30, 2023 693,385 1,064,000 1,244,480 535,547 813,479 4,350,891\nLess: Accumulated amortization\nBalance: June 30, 2022 (102,891 ) (4,260 ) (30,754 ) (380 ) (7,492 ) (145,777 )\nAdditions (69,339 ) (51,118 ) (123,016 ) (54,215 ) (49,340 ) (347,028 )\nBalance: June 30 , 2023 (172,230 ) (55,378 ) (153,770 ) (54,595 ) (56,832 ) (492,805 )\nNet book value: June 30, 2023 $ 521,155 $ 1,008,622 $ 1,090,710 $ 480,952 $ 756,647 $ 3,858,086\nDeveloped\ntechnology,\nCurriculum\nCustomer\nsoftware,\ndevelopment Licenses relationships Trademarks and other Totals\nBalance: June 30, 2021 $ 693,385 $ - $ - $ - $ - $ 693,385\nAdditions - 1,064,000 1,230,159 348,100 335,021 2,977,280\nBalance: June 30, 2022 693,385 1,064,000 1,230,159 348,100 335,021 3,670,665\nLess: Accumulated amortization\nBalance: June 30, 2021 (28,891 ) - - - - (28,891 )\nAdditions (74,000 ) (4,260 ) (30,754 ) (380 ) (7,492 ) (116,886 )\nBalance: June 30, 2022 (102,891 ) (4,260 ) (30,754 ) (380 ) (7,492 ) (145,777 )\nNet book value: June 30, 2022 $ 590,494 $ 1,059,740 $ 1,199,405 $ 347,720 $ 327,529 $ 3,524,888\nAmortization expense of $347,028 and $116,886 for the years ended June 30, 2023, and 2022, respectively, were included in selling, general and administrative expenses in the statements of operations. The Companys intangible assets are subject to amortization and are amortized over the straight-line methods over their estimated period of benefit.\nFuture amortization expense is as follows:\nSchedule of future amortization expense\nYear Ending June 30,\n$ 396,596\n361,280\n299,265\n299,265\n299,265\nThereafter\n2,202,415\nTotal $ 3,858,086\n6. Accrued Payroll Taxes\nAs of June 30, 2023, and 2022, the Company had $0 and $2,055,736, respectively, of accrued payroll taxes, penalties and interest relating to calendar years 2004 - 2007. The total balance for accrued payroll taxes accumulated on a quarterly basis beginning on their respective quarterly filing dates. Accrued interest was compounded daily at an estimated effective interest rate of 7.33%. The quarterly sub-totals that made up the balance had a calculated expiration date of 10 years according to the Internal Revenue Service statute of limitations. As the tax periods surpassed their estimated expiration date, the Company removed the liability from the Consolidated Balance Sheets, and an equivalent amount was recognized as Gain on expiration of accrued tax liability within other income on the Consolidated Statements of Operations. For the years ended June 30, 2023, and 2022, the Company recognized $35,242 and $30,155, respectively, of penalties and interest within interest expense on the Consolidated Statements of Operations. For the years ended June 30, 2023, and 2022, the Company recognized $2,090,978 and $0, respectively, within Gain on expiration of accrued tax liability related to quarterly tax liabilities that expired during the respective fiscal years.\n7. Notes Payable\nNotes Payable - Related Parties\nThe following is a summary of notes payable - related parties as of June 30, 2023, and 2022\nSchedule of notes payable, related parties\nJune 30, 2023\nOutstanding Accrued\nPrincipal Interest\nRelated entity 1 $ 1,380,672 $ 3,038\nRelated entity 2 126,864 -\nRelated entity 3 105,000 -\nRelated entity 4 50,074 -\nRelated entity 5 - -\nRelated entity 6 237,473 11,144\n$ 1,900,083 $ 14,182\nJune 30, 2022\nOutstanding Accrued\nPrincipal Interest\nRelated entity 1 $ 8,261,310 $ 120,050\nRelated entity 2 8,213,976 106,951\nRelated entity 3 453,052 11,072\nRelated entity 4 1,512,924 123,996\nRelated entity 5 366,800\n$ 18,808,062 $ 362,855\nThe following is a summary of current and long-term notes payable - related parties as of June 30, 2023:\nSchedule of long-term notes payable - related parties\nJune 30, 2023\nCurrent Long-Term\nPortion Portion Total\nRelated entity 1 $ - $ 1,380,672 $ 1,380,672\nRelated entity 2 - 126,864 126,864\nRelated entity 3 - 105,000 105,000\nRelated entity 4 14,132 35,942 50,074\nRelated entity 5 - - -\nRelated entity 6 237,473 - 237,473\n$ 251,605 $ 1,648,478 $ 1,900,083\nJune 30, 2022\nCurrent Long-Term\nPortion Portion Total\nRelated entity 1 $ 3,737,197 $ 4,524,113 $ 8,261,310\nRelated entity 2 3,206,154 5,007,822 8,213,976\nRelated entity 3 446,302 6,750 453,052\nRelated entity 4 1,512,924 - 1,512,924\nRelated entity 5 366,800 - 366,800\n$ 9,269,377 $ 9,538,685 $ 18,808,062\nAll notes dated December 31, 2022, and prior are unsecured, bear interest at 3% per annum, and are due 360 days from the date of issuance, ranging from June 25, 2020, to December 30, 2022. All notes dated after December 31, 2022, are unsecured, bear interest at 8% per annum, and are due 1095 days from the date of issuance. Each related party has significant influence or common ownership with the Companys Chief Executive Officer. Several of these notes are in default. The Company has not received any notices of default or demands for payment. All notes are unsecured and those which are past-due are due on demand. As of June 30, 2023 and 2022, total accrued interest for Notes Payable-Related Parties was $14,182 and $362,855, respectively. The Company recorded interest expense from Notes Payable-Related Party for fiscal years ending June 30, 2023, and 2022, of $814,240 and $180,708, respectively.\nRelated entity 6 carries an annual interest rate of 30% and is collateralized by the accounts receivable of Watson Rx.\nThere were various related party debt convertible notes that occurred during 2023 and 2022 (see Note 8. Convertible Note Payable - Related Parties for more information).\nThe following are the expected future payments as of June 30, 2023:\nSchedule of expected payments\nFiscal Year Ended June 30,\n$ 251,605\n-\n1,648,478\n-\n-\nTotal $ 1,900,083\nNotes Payable\nNotes payable includes the following:\nSchedule of notes payable\nJune 30, June 30,\nCurrent portion $ 439,562 $ 669,028\nLong-term portion 1,011,395 479,001\nTotal $ 1,450,957 $ 1,148,029\nPacific Stem and IHGs Economic Injury Disaster Loans (EIDL) loans, dated June 7, 2020, and May 10, 2020, respectively, include a 3.75% interest rate for up to 30 years; the payments are deferred for the first two years (during which interest will accrue), and payments of principal and interest are made over the remaining 28 years. The EIDL loans have no penalty for prepayment. The EIDL loans attach collateral which includes the following property that EIDL borrower owns or shall acquire or create immediately upon the acquisition or creation thereof: all tangible and intangible personal property, including, but not limited to: (a) inventory, (b) equipment, (c) instruments, including promissory notes (d) chattel paper, including tangible chattel paper and electronic chattel paper, (e) documents, (f) letter of credit rights, (g) accounts, including health-care insurance receivables and credit card receivables, (h) deposit accounts, (i) commercial tort claims, (j) general intangibles, including payment intangibles and software and (k) as-extracted collateral as such terms may from time to time be defined in the Uniform Commercial Code. The security interest the EIDL borrower grants includes all accessions, attachments, accessories, parts, supplies and replacements for the collateral, all products, proceeds and collections thereof and all records and data relating thereto. The balance of Pacific Stems EIDL is $149,900 for the years ended June 30, 2023, and 2022, respectively. The balance of IHGs EIDL is $147,807 and $150,000 for the years ended June 30, 2023, and 2022, respectively. The EIDL loans are technically in default as a result of a change in ownership without the Small Business Administration (SBA) prior written consent. The Company has contacted the SBA regarding the transfer of ownership and has not yet finalized the transfer of ownership.\nLikidos COVID-19 Government Loan includes a 2.5% interest rate for up to six years; the payments are deferred for the first year (during which interest will accrue). The balance of COVID-19 Government Loan is $36,938 and $48,728 for the years ended June 30, 2023, and 2022, respectively.\nWatson has a loan totaling $320,709 and $373,016 as of June 30, 2023, and 2022, respectively, which includes an interest rate of 5% with a maturity date of April 29, 2025. The loan is collateralized by personal property and includes monthly payments in the amount of $2,656, with a balloon payment at the maturity date in the amount of $336,898. Watson renewed a loan on June 26, 2023, for $176,836, which includes an interest rate equal to the Wall Street Journal Prime Rate, or 8.25% as of June 30, 2023, and a maturity date of June 26, 2024. The loan is collateralized by the accounts receivable of Watson and includes four payments of $46,838.\nThe following are the expected future payments as of June 30, 2023, including the total amount of imputed interested related:\nSchedule of long term debt payment\nFiscal Year Ended June 30,\n$ 439,562\n600,696\n185,333\n45,770\n28,663\nThereafter 150,933\nTotal $ 1,450,957\nConvertible Notes\nOn February 4, 2022, the Company entered into a securities purchase agreement (SPA) with YA II PN, Ltd. (the Buyer) for issuance and sale of convertible debentures (the Debentures) in the aggregate principal amount of $3,000,000, including net proceeds received of $2,880,000 from February to March 2022.\nThe Debentures have a fixed conversion price of $0.9151 per share (the Fixed Conversion Price). The principal and interest, which will accrue at a rate of 5% per annum, payable under the Debentures will mature 15 months from the issuance date (the Maturity Date), unless earlier converted or redeemed by the Company. At any time before the Maturity Date, the Buyer may convert the Debentures into the Companys common stock at the Fixed Conversion Price. Beginning on May 1, 2022, and continuing on the first day of each calendar month thereafter through February 1, 2023, the Principal amount plus a 20% redemption premium and plus accrued and unpaid interest will be subject to monthly redemption (Monthly Redemption). Under Monthly Redemption, the Company shall redeem an applicable redemption amount in accordance with the redemption schedule provided in the Debenture, which is subject to pro rata adjustment to reflect the conversion or redemption otherwise effected pursuant to the Debenture contemporaneous with or prior to the scheduled redemption date, in cash, in common stock through the Buyers conversion of the Debenture (at any time after the applicable redemption date), or a combination of both at the Companys option. With respect to each Monthly Redemption all or partially in common stock, the conversion price shall be the lower of (1) the Fixed Conversion Price, or (2) 100% of the lowest daily VWAP during the ten consecutive trading days immediately preceding the date of conversion (the Variable Conversion Price). The conversion price shall be adjusted from time to time pursuant to the other terms and conditions of the Debenture. At no point will the conversion price be less than $0.01.\nThe Company, in its sole discretion, may redeem in cash amounts owed under the Debentures prior to the Maturity Date by providing the Buyer with advance written notice at least 10 trading days prior to such redemption, provided that the Shares are trading below the Fixed Conversion Price at the time of the redemption notice. The Company shall pay a redemption premium equal to 20% (the Redemption Premium) of the principal amount being redeemed.\nIn connection with the Debenture, the Company issued to the Buyer warrants equal to 30% coverage exercisable at a strike price equal to the Fixed Conversion Price determined at the date of the initial closing, or a total of 983,499 warrants to purchase common stock. The Warrants shall be exercisable for four years and shall be exercised on a cash basis provided the Company is not in default and the shares underlying the Warrant are subject to an effective registration statement at the time of the Investors exercise. There is a cashless provision.\nThe Company analyzed the conversion feature of the warrants and determined they did not need to be bifurcated under ASC 815. Based on adoption of ASU-2020-06, the debt will be accounted for as traditional convertible debt with no portion of the proceeds attributed to the conversion feature. The warrants issued with the debt will be accounted for as a debt discount and will be amortized as interest expense over the life of the note. The warrants were valued using the Monte Carlo model and the Company recognized $1,427,495 as a debt discount related to the warrants. Key variables used in the valuation are as follows:\nSchedule of key variables\nVolatility Risk Free Rate Stock Price Term Remaining (Yrs)\n225.50% 1.16% $0.59 0.0\nIn connection with the Debenture, the Company incurred $120,000 in issuance costs. Furthermore, the Company issued 192,000 shares of common stock to the Buyer and broker at a fair value of $115,200. Both the issuance costs and fair value of common stock were recorded as a debt discount.\nThe total debt discounts related to the convertible notes were $1,659,442 and amortized using an effective interest method over a 15-month period. During the years ended June 30, 2023, and 2022, the Company amortized $1,224,472 and $434,970 of debt discount, incurred interest expense of $39,975 and $56,712, and accrued interest of $63,191 and $24,520, respectively.\nThe total redemption premiums related to the convertible notes were $600,000 and amortized using an effective interest method over a 10-month period, starting in May 2022. During the years ended June 30, 2023, and 2022, the Company paid redemption premiums of $280,000 and $60,000 in cash and $200,000 and $20,000 in stock, respectively.\nDuring the years ended June 2023 and 2022, the Company redeemed $1,400,000 and $300,000 of the Debentures in cash and $1,000,000 and $300,000 of the Debentures in stock, respectively.\nThe net balance of the convertible note was $0 and $1,495,528 as of June 30, 2023, and June 30, 2022, respectively.\n8. Convertible Note Payable - Related Parties\nOn February 1, 2022, $6,532,206 of related party debt principal and interest related to promissory notes issued by the Company, with the option for conversion, was converted into 10,002 shares of Series G Convertible Preferred Stock (Series G Stock). The Series G Stock shall convert at one share of Series G Stock to 2,177 shares of common stock (equivalent to converting the related dollars into common shares at $0.30 per share).\nOn April 4, 2023, $4,544,224 of related party debt principal and interest related to promissory notes issued by the Company, with the option for conversion, was converted into 15,002 shares of Series H Convertible Preferred Stock (Series H Stock). The Series H Stock shall convert at one share of Series H Stock to 3,029 shares of common stock (equivalent to converting the related dollars into common shares at $0.10 per share).\nOn June 23, 2023, $29,315,320 of related party debt principal and interest related to promissory notes issued by the Company, with the option for conversion, was converted into 35,108 shares of Series I Convertible Preferred Stock (Series I Stock). The Series I Stock shall convert at one share of Series I Stock to 5,000 shares of common stock (equivalent to converting the related dollars into common shares at $0.167 per share).\n9. Related Party Transactions\nFiscal 2023 Transactions\nDuring the year ended June 30, 2023, the Company received cash funding or expenses paid on its behalf from related parties totaling $5,439,249. The expenses paid on their behalf primarily relate to operational expenditure and payroll. In most cases, promissory notes were created on a quarterly basis totaling the amounts referenced above. The remaining amounts are included within accounts payable - related parties on the Companys Consolidated Balance Sheet for which the related parties expect repayment. The above-referenced expenses relate to three corporations that the Company has classified as related parties. These corporations are all owned and/or operated by an individual who has a familial relationship with the Companys CEO.\nDuring the year ended June 30, 2023, the Company incurred expenses for services provided by related parties totaling $5,312,020. Services provided to the Company include management services, payroll processing services, rent and chartered flight services. The corporations are either owned and/or operated by a relative of the Companys CEO, is a corporation in which the Companys CEO can exercise control or is an individual who has a familial relationship with the Companys CEO.\nDuring the year ended June 30, 2023, the Companys Bothof Brothers subsidiary recognized revenue for construction services totaling $2,134,470 from corporations owned and/or operated by a related party who has a familial relationship with the Companys CEO.\nDuring the year ended June 30, 2023, the Companys DES subsidiary recognized monthly interest income and royalty revenue totaling $45,968 from corporations owned and/or operated by a related party who has a familial relationship with the Companys CEO.\nDuring the year ended June 30, 2023, the Company incurred $1,669,788 in services performed by non-employee board members.\nAs of June 30, 2023, amounts included within accounts payable and accrued liabilities - related parties on the Companys Consolidated Balance Sheet for related party expenses were $500,288.\nFiscal 2022 Transactions\nDuring the year ended June 30, 2022, the Company received cash funding or expenses paid on behalf of the Company from related parties totaling $11,492,218. The expenses paid on our behalf primarily relate to operation expenditures and payroll. In most cases, promissory notes were created on a quarterly basis totaling the amounts referenced above. The remaining amounts are included within accounts payable - related parties for which the related parties expect repayment. During the year ended June 30, 2022, the Company made payments to the related parties against the promissory note balances of $233,556. As of June 30, 2022, amounts included within accounts payable and accrued liabilities - related parties for expense and payroll related advances were $576,173.\nDuring the year ended June 30, 2022, the Company incurred expenses from services provided by related parties totaling $779,135. Services provided to the Company include management services, payroll processing services, rent and chartered flight services. As of June 30, 2022, amounts included within accounts payable and accrued liabilities - related parties for expense and payroll related advances were $646,570.\nDuring the year ended June 30, 2022, the Company incurred $592,881 in services performed by non-employee board members. As of June 30, 2022, amounts included within accounts payable and accrued liabilities - related parties for expense and payroll related advances were $47,390.\nDuring the year ended June 30, 2022, the Company generated net revenues of approximately $585,000 through Covid tests performed at locations or entities controlled by related parties. This amount mentioned above is included within revenues on the consolidated statements of operations.\nThe following is a summary of revenues recorded by the Companys to related parties with common ownership:\nSchedule of revenues\nYear Ended\nJune 30,\nDalrada Health $ 76,912 $ 75,324\nDalrada Energy Services 45,968 1,261,774\nSolas - 56,240\nDalrada Energy Services - 6,000\nIgnite 3,718\nPrakat 25,000 -\nBothof Brothers 2,134,470 -\n$ 2,282,746 $ 1,403,056\nSee Notes 4, 7, 8, 9, 10, 12, 14 and 16 for additional related party transactions.\n10. Preferred Stock\nThe Company has 100,000 shares authorized of Series F Preferred Stock (Series F Stock), par value, $0.01, of which 5,000 shares of Series F Stock (at a fair value of $170) were issued to the CEO in December 2019. Each share of Series F Stock entitles the holder to the greater of (i) one hundred thousand votes for each share of Series F Stock, or (ii) the number of votes equal to the number of all outstanding shares of Common Stock, plus one additional vote such that the holders of Series F Stock shall always constitute most of the voting rights of the Corporation. In any vote or action of the holders of the Series F Stock voting together as a separate class required by law, each share of issued and outstanding Series F Stock shall entitle the holder thereof to one vote per share. The holders of Series F Stock shall vote together with the shares of Common Stock as one class.\nThere were various related party debt convertible notes that occurred during 2023 and 2022 (see Note 8. Convertible Note Payable - Related Parties for more information).\n11. Stockholders Equity\nCommon Stock Transactions - Fiscal 2023\nIn July 2022, November 2022, December 2022, March 2023 and June 2023, the Company issued a total of 1,999,998 shares of common stock related to the acquisition of DepTec (SSCe).\nIn July 2022, the Company issued 500,000 common stock shares pursuant to a consulting agreement for management services.\nIn December 2022, March 2023 and April 2023, the Company issued a total of 500,000 shares of common stock related to the acquisition of Watson.\nIn September 2022, December 2022, and March 2023, the Company issued a total of 375,000 shares of common stock related to the acquisition of International Health Group.\nIn September and December 2022, the Company issued a total of 175,000 shares of common stock related to the acquisition of Pacific Stem Cells. The are 87,500 shares of common stock remaining to be issued at a future date.\nDuring the year ended June 30, 2023, the Company issued 10,974,521 shares of common stock pursuant to the conversion of $1,475,608 of convertible debt and its related premium and interest expense.\nIn April 2023, the Company issued 2,000,000 common stock shares pursuant to a consulting agreement for management services to increase the investment community's awareness of the Company.\nCommon Stock Transactions - Fiscal 2022\nIn August 2021, December 2021, March 2022, and May 2022, the Company issued 87,500 shares of common stock related to the acquisition of Pacific Stem Business. See Note 4. Business Combinations and Asset Acquisition for additional information related to the acquisition of Pacific Stem Cells.\nIn October 2021, December 2021, March 2022, and May 2022, the Company issued 125,000 shares of common stock related to the acquisition of International Health Group. See Note 4. Business Combinations and Asset Acquisition for additional information related to the acquisition of International Health Group.\nIn September 2021, the Company repurchased 329,478 shares of common stock from a Company employee for a total fair value of $14,827, or $0.045 per share.\nIn September 2021, the Company issued 2,000,000 shares to the board of directors pursuant to the 2020 stock compensation plan. The 2,000,000 shares of common stock were granted on July 19, 2021, at $0.28 per share for a total fair value of $560,000.\nIn October 2021, the Company issued 250,000 shares to Vivera pursuant to the Pala agreement. See Note 3. Investment in Pala Diagnostics for additional information related to the issuance of stock related to the Pala Diagnostics joint venture.\nIn December 2021, the Company issued 500,000 shares of common stock pursuant to a consulting agreement for health care management services. The 500,000 shares of common stock were granted on December 20, 2021, at $0.76 per share for a total fair value of $380,000.\nIn December 2021, the Company cancelled 6,500,000 common shares issues to its directors and an advisor and returned them to treasury. 6,500,000 cashless warrants were issued to the Directors and the advisor in place of the common shares that were cancelled. See Note 12. Stock-Based Compensation for additional information related to the issuance of the warrants.\nIn March 2022, the Company issued 192,000 shares of common stock pursuant to a consulting agreement for a total fair value of $115,200. See Note 7. Notes Payable for additional information related to the common stock issued pursuant to the convertible debt.\nIn June 2022, the Company issued 164,659 shares of common stock pursuant to the conversion of $68,630 of convertible debt and its related premium and interest expense. See Note 7. Notes Payable for additional information related to the common stock issued pursuant to the convertible debt.\nIn June 2022, the Company issued 208,777 shares of common stock pursuant to the conversion of $65,034 of convertible debt and its related premium and interest expense. See Note 7. Notes Payable for additional information related to the common stock issued pursuant to the convertible debt.\nIn June 2022, the Company issued 500,000 shares of common stock related to the acquisition of Watson. See Note 4. Business Combinations and Asset Acquisition for additional information related to the common stock issued related to the acquisition of Watson.\n12. Stock-Based Compensation\nDalrada Financial Corp 2020 Stock Compensation Plan\nOn July 9, 2020, the Board authorized the Dalrada Financial Corp 2020 Stock Compensation Plan (the Plan) to be used to compensate the companys board of directors. The Plan allocates the issuance of up to 3,500,000 shares. On February 25, 2021, the Company amended the Plan to issue up to 4,500,000 shares and issued an aggregate of 4,500,000 common shares, or 500,000 shares to each board member. Consolidated Statements of Operations and Comprehensive LossOn November 10, 2021, the Company cancelled 6,500,000 shares issued under the Plan to the Board of Directors and issued 6,500,000 cashless warrants. A total of 4,500,000 cashless warrants were to vest immediately, and the remaining 2,000,000 cashless warrants were to vest over a 12-month period. All cashless warrants carry a $0.45 exercise price and a ten-year term. The Company recorded stock-based compensation of $730,000 related to the 6,500,000 shares. The issuance of the warrants was treated as a modification and, as a result of the value of the stock-based compensation of the shares cancelled being greater than the stock-based compensation related to the cashless warrants issued, no additional stock-based compensation expense was recorded for the year ended June 30, 2022.\nOn November 30, 2021, the Company issued 2,275,000 cashless warrants to employees and consultants for services performed. A total of 825,000 cashless warrants were vested immediately and the remaining 1,450,000 cashless warrants vests over a 36-month period. The cashless warrants include an exercise price of $0.45 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.73 per share, or $1,651,093 which was calculated using the Black-Scholes model.\nOn February 16, 2022, the Company issued 2,250,000 cashless warrants to new members of the Board of Directors. The cashless warrants vest over a 12-month period and hold an exercise price of $0.45 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.59 per share, or $1,338,644, which was calculated using the Black-Scholes model.\nOn August 11, 2022, the Company issued 2,200,000 cashless warrants to new members of the Board of Directors and Advisors. A total of 1,500,000 cashless warrants vest over a 12-month period and hold an exercise price of $0.45 per share. 450,000 cashless warrants vest over a 12-month period and hold an exercise price of $0.41 per share, and the remaining 250,000 cashless warrants vest over a 12-month period beginning April 8, 2023, and hold an exercise price of $0.45 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.18 per share, or $397,890, which was calculated using the Black-Scholes model.\nOn October 7, 2022, the Company issued 3,000,000 cashless warrants to the selling shareholder of Bothof in connection with the acquisition of Bothof. The warrants vest over a 24-month period and hold an exercise price of $0.15 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $1.26 per share, or $5,101,223, which was calculated using the Fair Value method. The cashless warrants are contingent on the selling shareholders continued employment with the Company; therefore, it is treated as stock-based compensation expense and recognized ratably over a 24-month period.\nOn March 1, 2023, the Company issued 1,000,000 cashless warrants to the selling shareholders of Dalrada Technology Ltd with the acquisition of Dalrada Technology Ltd. The warrants vest over a 36-month period and hold an exercise price of $0.10 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.07 per share, or $68,975, which was calculated using the Fair Value method.\nOn April 14, 2023, the Company authorized and issued 26,638,500 cashless warrants to various officers, employees, and consultants of the Company. A total of 5,575,000 cashless warrants vest over a 36-month period and hold an exercise price of $0.45 per share. A total of 3,600,000 cashless warrants vest over a 24-month period and hold an exercise price of $0.45 per share. A total of 5,000,000 cashless warrants vest over a 36-month period and hold an exercise price of $0.33 per share. A total of 1,300,000 cashless warrants vest over a 12-month period and hold an exercise price of $0.20 per share. A total of 500,000 cashless warrants vest over a 12-month period and hold an exercise price of $0.12 per share. A total of 250,000 cashless warrants vest over a 12-month period and hold an exercise price of $0.45 per share. A total of 20,000 cashless warrants vest over a 12-month period and hold an exercise price of $0.09 per share. A total of 6,200,000 cashless warrants vest over a 36-month period and hold an exercise price of $0.16 per share. A total of 2,250,000 cashless warrants vest over a 36-month period and hold an exercise price of $0.25 per share. A total of 1,143,500 cashless warrants vest over a 36-month period and hold an exercise price of $0.08 per share. The remaining 800,000 cashless warrants vest over a 24-month period and hold an exercise price of $0.14 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.08 per share, or $2,143,402, which was calculated using the Black-Scholes model.\nOn May 25, 2023, the Company authorized and issued 587,634 cashless warrants to various employees of the Company. A total of 537,634 cashless warrants vest over a 36-month period and hold an exercise price of $0.45 per share, and the remaining 50,000 cashless warrants vest over a 36-month period and hold an exercise price of $0.08 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.10 per share, or $47,408, which was calculated using the Black-Scholes model.\nSchedule of warrants outstanding\nWeighted\nCommon Weighted Average\nStock Average Remaining\nWarrants Exercise Price Contractual Life\nOutstanding - June 30, 2021 1,000,000 - 9.87\nGranted 11,025,000 $ 0.45\nExercised - -\nForfeited - -\nOutstanding - June 30, 2022 12,025,000 - 8.82\nGranted 33,426,134 $ 0.29\nExercised - -\nForfeited - -\nOutstanding - June 30, 2023 45,451,134 $ 0.33 8.83\nExercisable at June 30, 2023 23,281,917 $ 0.39 8.45\nSchedule of assumptions\nYears Ended June 30,\nRisk-free interest rate 3.61% 1.14%\nExpected volatility (1) 158.3% 149.2%\nExpected dividend yield 0.00% 0.00%\nExpected life (years) 5.27 5.27\nThe intrinsic value of outstanding warrants was $0 as of June 30, 2023, and 2022.\nDuring the year ended June 30, 2023, and 2022, stock-based compensation expenses were $4,022,656 and $2,772,770, respectively. Total unrecognized compensation cost of non-vested options was $4,985,051 and $1,690,423 on June 30, 2023, and 2022, respectively, which will be recognized over the next three fiscal years.\n13. Segment Reporting\nThe Company manages its business and makes its decisions within its operating \tsegments. The Company classifies its operations into five segments: Health, Energy, Manufacturing, Technology, and Corporate. The Company evaluates the performance of its segments primarily based on revenues and operating income (loss).\nSegment information for the years ended June 30, 2023, and 2022 is as follows:\nSchedule of segment information\nYear Ended June 30, 2023\nGenefic Dalrada Energy Dalrada Precision Manufacturing Dalrada Technologies Corporate Consolidated\nRevenues $ 15,740,919 $ 7,075,414 $ 4,873,225 $ 2,049,411 $ - $ 29,738,969\nIncome (Loss) from Operations (5,783,441 ) (1,065,221 ) (2,461,219 ) 10,634 (10,660,710 ) (20,959,957 )\nYear Ended June 30, 2022\nGenefic Dalrada Energy Dalrada Precision Manufacturing Dalrada Technologies Corporate Consolidated\nRevenues $ 13,617,639 $ 1,261,774 $ 2,123,437 $ 2,239,763 $ 25,000 $ 19,267,613\nIncome (Loss) from Operations 2,225,304 967,639 (2,834,342 ) 30,177 (10,824,022 ) (10,435,244 )\nGeographic Information\nThe following table presents revenue by country:\nSchedule of revenue by country\nYear Ended\nJune 30,\nUnited States $ 26,208,432 $ 16,536,221\nScotland 1,887,061 725,443\nIndia 1,643,476 2,005,949\n$ 29,738,969 $ 19,267,613\nThe following table presents inventories by country:\nSchedule of inventories by country\nJune 30, June 30,\nUnited States $ 584,330 $ 999,302\nScotland 1,494,362 625,319\n$ 2,078,692 $ 1,624,621\nThe following table presents property and equipment, net, by country:\nSchedule of property and equipment by country\nJune 30, June 30,\nUnited States $ 1,284,834 $ 815,556\nScotland 182,657 247,283\nIndia 8,591 13,573\n$ 1,476,082 $ 1,076,412\n14. Commitments and Contingencies\nLease Commitments\nThe Company determines if an arrangement is a lease at inception. This determination generally depends on whether the arrangement conveys to the Company the right to control the use of an explicitly or implicitly identified fixed asset for a period of time in exchange for consideration. Control of an underlying asset is conveyed to the Company if the Company obtains the rights to direct the use of and to obtain substantially all the economic benefits from using the underlying asset. The Company has lease agreements which include lease and non-lease components, which the Company has elected to account for as a single lease component for all classes of underlying assets. Lease expense for variable lease components is recognized when the obligation is probable.\nOperating lease right of use (ROU) assets and lease liabilities are recognized at commencement date based on the present value of lease payments over the lease term. Operating lease payments are recognized as lease expense on a straight-line basis over the lease term. The Company primarily leases buildings (real estate) which are classified as operating leases. ASC 842 requires a lessee to discount its unpaid lease payments using the interest rate implicit in the lease or, if that rate cannot be readily determined, its incremental borrowing rate. As an implicit interest rate is not readily determinable in the Company's leases, the incremental borrowing rate is used based on the information available at commencement date in determining the present value of lease payments.\nThe lease term for all the Company's leases includes the non-cancellable period of the lease plus any additional periods covered by either a Company option to extend (or not to terminate) the lease that the Company is reasonably certain to exercise, or an option to extend (or not to terminate) the lease controlled by the lessor. Options for lease renewals have been excluded from the lease term (and lease liability) for the majority of the Company's leases as the reasonably certain threshold is not met.\nLease payments included in the measurement of the lease liability are comprised of fixed payments, variable payments that depend on index or rate, and amounts probable to be payable under the exercise of the Company option to purchase the underlying asset if reasonably certain.\nVariable lease payments not dependent on a rate or index associated with the Company's leases are recognized when the event, activity, or circumstance in the lease agreement on which those payments are assessed as probable. Variable lease payments are presented as operating expenses in the Company's Consolidated Statement of Operations in the same line item as expense arising from fixed lease payments. As of and during the year ended June 30, 2021, management determined that there were no variable lease costs.\nRight of Use Asset\nIn July 2022, the Company entered into a five-year lease agreement to lease a commercial building in Escondido, California. The building is owned by a related party. The Company recognized a right of use asset and liability of $2,405,540 and used an effective borrowing rate of 3.0% within the calculation. Imputed interest is $192,521. The lease agreements mature in June 2027.\nIn April 2023, the Companys Prakat subsidiary entered into a lease agreement to lease office space through March 2026. The Company recognized a right of use asset and liability of $99,060 and used an effective borrowing rate of 8% within the calculation.\nIn May 2021, the Companys PSC subsidiary entered into a three-year and 6-month lease agreement to lease a medical office space in Poway, California. The Company recognized a right of use asset and liability of $277,856 and used an effective borrowing rate of 3.0% within the calculation.\nIn January 2022, the Companys IHG subsidiary entered into a five-year and 5-month lease agreement to lease a medical office space in Chula Vista, California. The Company recognized a right of use asset and liability of $287,345 and used an effective borrowing rate of 3.0% within the calculation.\nIn May 2022, the Companys IHG subsidiary entered into a six-year and 3-month lease agreement to lease an office space in San Diego, California. The Company recognized a right of use asset and liability of $919,722 and used an effective borrowing rate of 4.0% within the calculation.\nIn August 2020, the Companys DepTec subsidiary entered into a five-year lease agreement to lease office space. The Company recognized a right of use asset and liability of $146,622 and used an effective borrowing rate of 3.0%\nIn May 2021, the Companys Watson subsidiary entered into a three-year lease agreement to lease a building in Florence, Alabama. The Company recognized a right of use asset and liability of $90,827 and used an effective borrowing rate of 3.0%\nIn July 2022, the Companys Empower subsidiary entered into a five-year lease agreement to lease a commercial space in Escondido, California. The building is owned by a related party. The Company recognized a right-of-use asset and liability of $322,756 and used an effective borrowing rate of 3.0% within the calculation. Imputed interest is $25,838. The lease agreement matures in June 2027.\nIn October 2022, the Companys Pala Diagnostics entered into a one-year lease agreement to lease a research and development laboratory space in San Diego, California. The Company recognized a right-of-use asset and liability of $37,239 And used an effective borrowing rate of 8% within the calculation. Imputed interest is $1,761. The lease agreement matures in October 2023.\nIn October 2022, the Company acquired Bothof Brothers which had an existing lease to a commercial building in Escondido, California. The building is owned by a related party. Upon acquisition, the company recognized a right-of-use asset and liability of $33,454 and used an effective borrowing rate of 3.0% within the calculation. Imputed interest is $2,174. The lease agreement matures in December 2024.\nIn January 2023, the Companys Solas subsidiary entered into a one-year lease agreement to lease an office and medical suite in Coronado, California. The company recognized a right of use asset and liability of $47,211 and used an effective borrowing rate of 8%.\nIn March 2023, the Company acquired Dalrada Technology Ltd. which had an existing lease to a commercial building in Livingston, Scotland. Upon acquisition, the company recognized a right-of-use asset and liability of $540,615 and used an effective borrowing rate of 8.0% within the calculation. Imputed interest is $125,761. The lease agreement matures in October 2027.\nIn March 2023, Genefic entered into a five-year lease agreement to lease a commercial building in San Diego, California. The Company recognized a right-of-use asset and liability of $844,242 and used an effective borrowing rate of 8.0% within the calculation. Imputed interest is $185,976. The lease agreement matures in March 2028.\nIn March 2023, Dalrada Technology Spain S.L. entered into a five-year lease agreement to lease a commercial building in Bergondo, Spain. The Company recognized a right-of-use asset and liability of $125,780 and used an effective borrowing rate of 8.0% within the calculation. Imputed interest is $28,129. The lease agreement matures in May 2028.\nThe following are the expected maturities of lease liabilities for operating leases as of June 30, 2023, including the total amount of imputed interested related:\nSchedule of minimum lease payments\nFiscal Year Ended June 30,\n$ 1,395,435\n1,294,901\n1,254,653\n1,232,993\n431,085\nThereafter 32,627\nTotal lease payments 5,641,694\nLess: imputed interest (558,845 )\nPresent value of lease liability $ 5,082,849\nOther information related to operating leases for the years ended June 30, 2023, and 2022, respectively, were as follows:\nLease information June 30, 2023 June 30, 2022\nWeighted average remaining lease term - years 4.09 3.72\nWeighted average discount rate 6.74% 5.65%\n15. Income Taxes\nWe file income tax returns in the United States federal jurisdiction and in various state, local, and foreign jurisdictions. In the normal course of business, we are subject to examination by taxing authorities. The Company is currently on extension and has yet to file their income tax return for the year ended June 30, 2023.\nAs of June 30, 2023, the Company had federal and state net operating loss carry forwards of $37,237,922 that may be offset against future taxable income which will begin to expire in 2038 through 2041.\nThe reconciliation of income tax expense computed at the U.S. federal statutory rate to the income tax provision for the years ended June 30, 2023, and 2022 is as follows:\nSchedule of reconciliation of income taxes\nJune 30,\nCurrent:\nFederal $ - $ -\nState - -\nForeign - 132,513\nTotal current income tax expense - 132,513\nDeferred:\nFederal (3,267,961 ) (2,239,061 )\nState (907,392 ) (622,074 )\nTotal deferred income tax expense (4,175,893 ) (2,861,136 )\nValuation allowance 4,175,893 2,861,135\nTotal provision for income taxes $ - $ 132,513\nThe provision for income tax for the year ended June 30, 2023, is included in selling, general and administrative expenses.\nDeferred income taxes reflect the net tax effects of: (a) temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes; and (b) operating loss and tax credit carryforwards. We record net deferred tax assets to the extent we believe these assets will more likely than not be realized. In making such a determination, we consider all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax planning strategies and recent financial operations. Significant components of deferred tax assets as of June 30, 2023, and 2022 were as follows:\nSchedule of deferred taxes\nJune 30,\nDepreciation & Amortization $ 93,044 $ 30,382\nReserves and Accruals 780,876 122,154\nResearch & Development Credits - -\nNet Operating Loss Carryforwards 9,185,104 5,649,387\nGross Deferred Tax Assets 10,059,024 5,801,923\nValuation Allowance (10,059,024 ) (5,801,923 )\nNet Deferred Tax Assets $ - $ -\nReconciliation of the statutory federal income tax to the Company's effective tax:\nSchedule of reconciliation of the statutory federal income tax\nJune 30,\nTax at Federal Statutory Rate 21.0% 21.0%\nState, Net of Federal Benefit 4.3% 4.4%\nForeign Tax 0.0% 0.9%\nTax Exempt Interest Income (0.06)% (0.2)%\nGain on Expiration of Accrued Tax Liability 0.00% 0.00%\nStock Based Compensation (4.1)% (4.1)%\nNondeductible Interest (20.1)% 0.8%\nChange in Valuation Allowance (20.6)% (20.3)%\nProvision for Taxes (0.4)% (0.9)%\nThe difference in the effective rate and the statutory rate is due to permanent differences, primarily deductibility of penalties and interest on accrued payroll tax liabilities and the gains related to the expiration of the statute of limitations for accrued payroll tax liabilities.\n16. Subsequent Events\nOn July 1, 2023, Bothof Brothers signed a lease for 12,100 square feet of warehouse space in Escondido, California related to its construction business. The base monthly lease cost is $11,425 and expires on September 30, 2025.\nOn July 25, 2023, Genefic entered into an agreement with OnPoint LTB, LLC (Lender), for a credit line and funding of up to $2,000,000. The terms of the credit line include a 24-month term loan with interest only for 6 months, then amortizing over 18 months down to 50%, with 50% of the balance due at the end of term, or July 2025. Interest is fixed at 20% per annum, with an origination fee of $20,000 which is added to the loan balance. Genefic borrowed the first installment of $1,200,000 at the time of closing. As part of the loan origination fee, Dalrada Financial Corporation is to issue 500,000 shares of its common stock. In addition, Genefic will issue cashless warrants equal to one percent of Genefic, if and when Genefic engages in a public offering of stock, prior to the maturity date of the loan transaction. The cashless warrants will have a strike price of $0.50. The transaction includes a debt discount of $100,821.\nOn July 31, 2023, the Company issued 109,637 shares of common stock pursuant to the Stock Purchase Agreement between Dalrada Financial Corporation and Prakat Solutions Inc.\nOn August 08, 2023, the Companys subsidiary, Dalrada Technology Spain S.L., entered into an agreement, which was Amended August 30, 2023, with Morocco-based global distributor, Crown Glory Holding to build and install a minimum of 4,500 energy efficient commercial heat pumps over the course of seven years. With the agreement, Crown Glory Holding also becomes the exclusive distributor of the Companys heat pumps for the continent of Africa and select neighboring countries.\nOn August 29, 2023, the Companys subsidiary, Dalrada Technology Spain S.L., entered into an agreement which was Amended August 30, 2023, with France-based JBS Consulting, to distribute a minimum of 2,300 energy efficient commercial heat pumps over the course of five years. The agreement calls for 150 of the commercial heat pumps to be installed and operational within the first 12 months, commencing in October of 2023, with increased numbers of the high-functioning machines installed each year until the contract is fully satisfied.\nOn September 6, 2023, the Dalrada Board of Directors approved 15,861,000 warrants to various Board of Director members, employees and consultants. The total stock-based compensation expense is $2,064,699.\nOn September 18, 2023, the Company appointed Heather McMahon to the Board of Directors.\nOn September 27, 2023, the Company issued 125,000 shares of common stock as part of the consideration for the acquisition of Watson RX Solution, Inc.\nOn October 2, 2023, Genefic borrowed the second installment of the OnPoint LTB, LLC loan of $800,000. The second installment included a loan origination fee of $5,000 and 500,000 of Dalrada Financial Corporation common stock. The transaction includes a debt discount of $154,492.\nOn October 5, 2023, Genefic acquired Diller Pharmacy LLC for the consideration of $135,000 in cash and assuming its lease, which includes a monthly lease cost of $325 and expires on February 28, 2025. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nOn December 19, 2022, Dalrada engaged Macias Gini & OConnell, LLP (MGO) for audit and review services for the year ended June 30, 2023. Also on December 19, 2022, dbbmckennon, the auditor for Dalrada for the year ended June 30, 2022, ceased performing any audit or review services for the Company. Dalrada and dbbmckennon did not have any disagreements as of the date services ceased. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur disclosure controls and procedures are designed to ensure that information we are required to disclose in reports that we file or submit under the Securities Exchange Act of 1934, as amended (the Exchange Act) is recorded, processed, summarized, and reported within the time periods specified in SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. As required by Rule 13a-15(b) and Rule 15d-15(b) under the Exchange Act, our management, including our Chief Executive Officer and Chief Financial Officer, evaluated, as of December 31, 2022, the effectiveness of our disclosure controls and procedures as defined in Exchange Act Rule 13a-15(c) and Rule 15d-15(e).\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance of achieving their control objectives.\nThe Companys management, with the participation of the Companys Chief Executive Officer and Chief Financial Officer, has evaluated the effectiveness of the Companys disclosure controls and procedures (as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) as of the end of the period covered by this report. Based on such an evaluation, the Companys Chief Executive Officer and Chief Financial Officer, have concluded that certain internal controls over financial reporting were not effective as of June 30, 2023 due to the material weaknesses described in further detail below.\nPreviously Reported Material Weaknesses in Internal Control over Financial Reporting\nAs previously disclosed in our Annual Report on Form 10-K for the year ended June 30, 2022, we identified material weaknesses in the Companys control environment.\nTo address our material weaknesses, we developed a remediation plan which included the implementation and enhancement of various policies, procedures, and controls. In executing our remediation plan, during Fiscal 2023, the Company hired accounting experts to address technical accounting transactions, purchase price allocations and other accounting activity. We also implemented a strict travel and reimbursement policy and enhanced our Board of Directors and Audit Committee for better oversight of our financial reporting processes.\nMaterial Weaknesses in Internal Control over Financial Reporting\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected on a timely basis. As of June 30, 2023, we continue to have material weaknesses in the Companys control environment. Regarding the overall financial reporting structure of the Company, there is not currently a comprehensive and formalized financial reporting policies and procedures manual in place. The following sets forth internal control weaknesses:\n- performing reconciliations\n- preparing adequate and complete schedules across the various consolidated entities including roll forwards, revenue recognition, and allowance estimates\n- oversight of foreign entities\nThis lack of formalized processes was a contributing factor to which a number of inquiries were raised by the audit team and led to numerous post-closing entries subsequent to the commencement of our audit procedures.\nManagements remediation plan will focus on standardizing our reconciliation process including roll forwards and revenue recognition procedures. We will also revise allowance estimates based on June 30, 2023 year-end adjustments. We look to enhance the continued improvement of our policies, procedures, and internal controls over our control environment and risk assessment.\nNo Attestation Report by Independent Registered Accountant\nThe effectiveness of our internal control over financial reporting as of June 30, 2023, has not been audited by our independent registered public accounting firm by virtue of our exemption from such requirement as a smaller reporting company.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in internal control over financial reporting except as noted above. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers, Promoters and Control Persons; Compliance with Section 16(a) of the Exchange Act\nDirectors, Executive Officers, and Key Employees\nThe following table sets forth certain information regarding our directors, executive officers and key employees as of June 30, 2023 and as of the date of the filing of this report:\nName and Address Age Position(s) Held\nBrian Bonar CEO and Director\nKyle McCollum CFO\nBrian McGoff (1) COO\nPauline Gourdie Director\nBrian Kendrick Director\nAnthony Zolezzi Director\nAmy Scannell Director\nAnuradha Biswas (2) Director\nVincent Monteparte Director\n(1) Position terminated as of July 14, 2023\n(2) Resigned as of July 27, 2023\nBackground of Directors and Executive Officers\nBrian Bonar, CEO and Director has over 16 years with Dalrada. Prior to joining Dalrada, Mr. Bonar worked for more than eighteen years with IBM in the US, Asia, and Europe. He has formerly worked at QMS, and Rastek Corporation, The Solvis Group, and was on the Board of Directors of Allegiant Professional and Alliance National Insurance Company. Mr. Bonar is also the founder of Bezier Systems.\nMr. Bonar is involved with various private entities and has been recognized by the Cambridge Whos Who on several occasions as the executive of the year. In 2012, he was recognized as the CEO of the fastest growing public company in Orange County. He is the Chairman of Trucept, Inc. as well as President and Chief Executive Officer of various privately held corporations. He is also on the board of American Marine LLC and founded American Management Services (AMS) Outsourcing, a PEO-focused company.\nMr. Bonar holds the honorary title, Lord Bonar of Wilcrick, Cardiff, Wales United Kingdom. He received a BSC in Mechanical Engineering from Strathclyde University, Glasgow Scotland and an MBA and PHD in the field of International Business Development Studies from the Stafford University, England UK.\nKyle McCollum, is currently the Chief Financial Officer of the Company. Prior to that, Mr. McCollum was with Better Choice Company Inc. (ticker: BTTR) for three years where Mr. McCollum acted as Corporate Secretary and SVP of Corporate Finance.\nIn 2018, Mr. McCollum helped form Bona Vida, a pet CBD company, where he served as Chief Financial Officer. In May 2019, Bona Vida merged into Better Choice Company Inc., a publicly listed pet health and wellness company (ticker: BTTR), where Mr. McCollum acted as Corporate Secretary and SVP of Corporate Finance. With Better Choice Company, he assisted in the merger of Bona Vida and TruPet with Better Choice Company as well as the acquisition of Halo Purely for Pets. Mr. McCollum also guided several 10-Qs and its 2019 10-K with audit.\nFrom 2013 to 2017 Mr. McCollum was Chief Financial Officer of Das & Co., a New York based family office. At Das & Co. Mr. McCollum managed all accounting, tax, audit, portfolio valuation, asset management, financial/investment reporting, and operations for Landmark Banyan Real Estate Fund, a $200 million India Real Estate Fund comprised of over 10 developments. Mr. McCollum was also Chief Operating Officer of all Das & Co.s holding and operating subsidiaries including Apex Resources, its mining company in Tanzania, and LDC Developers, its real estate development company.\nMr. McCollum has also served as Director of Finance at 29th Street Capital, a California-based real estate investment firm with a publicly stated asset value base of US $500 million. Prior to 29th Street Capital, Mr. McCollum was Director of Finance and Corporate Compliance at Fletcher Robbe International Attorneys at Law, an international transactional and securities-based law firm with offices in Century City, New York, Hong Kong and Beijing. While at Fletcher Robbe International Attorneys at Law, Mr. McCollum focused on complex finance transactions, mergers & acquisitions, securities and guided several foreign listed public companies on international cross-listing to U.S. public exchanges. Mr. McCollum earned a Bachelor of Science and Master of Accountancy degree from the University of Montana and holds a Certified Public Accounting license.\nBrian McGoff is a seasoned leader with over 25 years of experience in operations, complex sales, M&A, tech transfer and commercialization of early-stage software, business strategy for venture backed start-ups, and executive communications. He is recognized for developing new strategies and solutions focused on improving operations and increasing revenue across multiple industries including health care, life sciences, higher education, financial services, retail/CPG, and government. These roles involved working with key business and technology stakeholders across Asia, Middle East, Africa, Europe, Australia, New Zealand, Latin America, Central America, and Canada providing first-hand experience in global business and technology trends and markets.\nPrior to Dalrada Financial Corporation, Mr. McGoff contributed most recently to HSP Advisors for a short time in 2022, six years with IBM Corporation - Philadelphia, Pennsylvania from 2016 through 2022 as Business Unit Executive, Public Sector, AI Applications , four years with Health Start Partners - Media, Pennsylvania from 2012 through 2016 as Chief Operating Officer, and twelve years with IBM - New York, New York from 2000 through 2012 having held various executive positions.\nSome highlights of Mr. McGoffs career are as follows:\n· Directly managed tech-transfer and commercialization of software and medical devices for government backed economic development and large corporate and public sector organizations\n· Managed business turnaround efforts for VC backed technology, specialty medical, and medical device companies,\n· Advise venture capital, private equity, government backed economic development and trade groups on innovation and emerging trends (Panelist)\n· Directed financial feasibility studies for venture financing, mergers & acquisitions, divestitures, and complex tech transfer licensing\n· Formal advisor for numerous organizations regarding improvement operational and resource performance\n· Designed, developed, and implemented programs for prescriptive technologies and services to improve both patient and employee engagement using real-time experiential telemetry\n· Thought leader / advisor for Software Prescription Therapy and Digital Therapeutics for Noncommunicable Diseases Groups\n· Thought leader for governance and security within advanced business workflows including data Sovereignty\n· Developed strategies and programs to address the technology needs of the five-generation workforce (2018)\n· Designed and implemented a business development process during COVID19 crisis for IBM Data and AI (2019)\n· Expanded the selling in a crisis program to all sales and distribution groups within IBM (2020)\n· Created and delivered remote enablement for Selling in a Crisis, Conversational ROI and Insight selling for global sales organization\nPauline Gourdie, Director - Ms. Gourdie is currently the owner/operator of CSL Staffing (CSL), which she established in 2016. CSL is a boutique general staffing service, providing staffing solutions for businesses in the San Diego and greater Southern California areas. For seven years prior to that, Ms. Gourdie was the President/Owner of Gourdie Consulting Corp which provided business consulting services across Americas & Europe. Ms. Gourdie possesses over 20 years of experience managing individuals and teams and was instrumental in the implementation of fulfilment and manufacturing centers for IBM and Lenovo in the United States, United Kingdom, Eastern Europe, and China.\nMs. Gourdie holds a Bachelor of Science degree in Industrial and Labor Relations from Cornell University and brings to Dalrada an extensive knowledge of supply chain management, customer account and relationship management, and recruitment and development. Ms. Gourdie was appointed to the Dalrada board on July 29, 2019 and does not receive compensation in her role as a director.\nBrian Kendrick, Director - Kendrick has been the Managing Director of Allegro Jet Management since 2014. Mr. Kendrick has over 30 years of business experience starting with a short stint with Burroughs as a computer programmer. Mr. Kendrick developed one of the industry's first systems for tracking owners of aircraft throughout the world and managed all aspects from the inspection and purchase of aircraft to delivery. Appointed July 29, 2019.\nAnthony Zolezzi is currently the CEO of Diomics Inc. as of August 2019 and is on the Board of Directors of TwinLab and Wild Oats Organic Marketplace. Previously, in 2018, Mr. Zolezzi was named the CEO of Twinlab Consolidated Holdings, Inc., and appointed to Twinlabs Board of Directors in May 2018. Mr. Zolezzi, for the last six years, is also an operating partner at Pegasus Capital Advisors, a private asset management company focused on the wellness sectors. As a serial entrepreneur, Mr. Zolezzi has dedicated his career to the well-being of both people and the planet, co-founding businesses that provide potential solutions to both health concerns and key environmental issues as well as focusing on ways that biotech breakthroughs can enhance consumer health and wellness. Zolezzi has authored and co-authored six books.\nMr. Zolezzi is a graduate of Loyola Marymount University, earned an MBA at San Diego State and completed the Executive Program at the Kellogg School at Northwestern. Zolezzi is a former board member of Vitamin Angels, a non-profit focused on providing nutritional support in impoverished countries. He also co-founded and is a former board member of the Organic Center for Education and Promotion, and a former member of the Organic Alliance Board of Directors. Mr. Zolezzi also serves as an advisory board member\nwith the Menus of Change program, a joint venture between The Culinary Institute of America and Harvard T.H.Chan School of Public Health, and the Keurig Corporation.\nAmy Scannell is currently General Counsel of Tipp Investments, LLC, in Escondido California since June 2019. Tipp Investments, LLC is a company with broad investment interests including commercial real estate, agriculture, and aviation. Scannell was admitted to the California bar in 2019 and the Massachusetts bar in 2015. Prior to Tipp Investments, Scannell worked as an associate attorney for Baskin & Associates, LLC, a family law litigation firm in Boston, Massachusetts. Scannell received her Juris Doctorate from Suffolk University Law School in Boston Massachusetts and Bachelor of Arts from Westfield State University in Westfield, Massachusetts.\nVincent Monteparte is Principal and Venture Partner in the venture capital and investment banking industry, having managed transactions and investments ranging from $40M to $500M. His leadership transformed uniquely positioned mid-market organizations in the enterprise software sector to upwards of $2 billion in enterprise valuations. A diverse background in technology, aerospace, transportation, logistics, real estate and healthcare has led Mr. Monteparte to roles as Venture Partner at Sway Ventures, a US-based venture capital firm investing in early to mid-stage technology companies and Principal at Global Capital Markets, an investment banking firm focusing on mid-market transactions for technology, manufacturing, distribution, service and retail companies.\nMr. Monteparte began his career as an entrepreneur and founded various companies, most recently Miro Technologies. At Miro, he led the development of a SaaS solution to modernize maintenance, repair, overhaul, and supply chain operations for complex assets. The business was sold to Boeing for 14x return on invested capital with an IRR of 48%. Additionally, Mr. Monteparte has since held various senior level executive roles leading teams and positioning multinational corporations to growth.\nMr. Monteparte holds a series 63 and 79 license and Board Advisory positions for BlueSky eLearn, a leading learning management software platform and Measurabl, a global ESG SaaS Software company. He received a B.A. in Aeronautical Engineering from Embry-Riddle Aeronautical University and an MBA from the Pepperdine University Graziadio School of Business, where he earned the Most Distinguished Alumni Award. In his spare time, Mr. Monteparte co-chairs the Business & Entrepreneurship Committee at Pepperdine, where he acts as a mentor to young entrepreneurs and executives in career and portfolios.\nTerm of Office of Directors\nOur directors are appointed for a one-year term to hold office until the next annual general meeting of our stockholders or until removed from office in accordance with our bylaws. Our officers are appointed by our Board of Directors and hold office until the officer dies or resigns or the Board elects a successor or removes the officer.\nKey Employees\nDavid Pickett, Executive Vice President of Sales and Business Development of Dalrada and Dalrada Precision Corp. President. Mr. Picketts professional background includes 25 years experience in executive relationship development and business growth with several companies including Celestica Inc. and Axxion Inc. Mr. Pickett has worked with the largest OEM and Fortune 500 companies in the world. Mr. Picketts vast knowledge base of engineering and manufacturing operational and supply chain requirements has proven to be a strategic asset for accelerating the growth of Dalrada Precisions global manufacturing and clean energy initiatives through its portfolio company Likido.\nFamily Relationships\nPauline Gourdie is the daughter of Brian Bonar.\nAudit Committee Financial Expert\nNo determination has been made as to whether any member of the audit committee qualified as an audit committee financial expert as defined in Item 401 of Regulation S-K.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our directors and executive officers, and persons who beneficially own more than 10% of a registered class of our equity securities, to file reports of beneficial ownership and changes in the beneficial ownership of our securities with the SEC of Forms 3 (Initial Statement of Beneficial Ownership), 4 (Statement of Changes of Beneficial Ownership of Securities) and 5 (Annual Statement of Beneficial Ownership of Securities). Directors, executive officers and beneficial owners of more than 10% of our Common Stock are required by SEC regulations to furnish us with copies of all Section 16(a) forms that they file. The required filings will be made.\nCode of Ethics\nWe have adopted an informal Code of Ethics that applies to our officers and directors, which we feel is sufficient at this time. Item 11. Executive and Director Compensation.\nSUMMARY COMPENSATION TABLE\nName and Principal\nStock\nOption\nAll Other\nPosition\nYear\nSalary\nBonus\nAwards\nAwards\nCompensation\nTotal\nBrian Bonar, CEO\n393,000\n-\n-\n-\n-\n393,000\nBrian McGoff, COO\n350,719\n-\n479,623\n-\n-\n830,342\nKyle McCollum, CFO\n375,062\n75,000\n248,916\n-\n-\n698,978\nPauline Gourdie\n-\n-\n-\n-\n-\n-\nBrian Kendrick\n-\n-\n-\n-\n-\n-\nAnthony Zolezzi\n23,415\n-\n-\n-\n-\n23,415\nAmy Scannell\n-\n-\n-\n-\n-\nVincent Monteparte\n-\n-\n-\n-\n-\n-\nAnuradha Biswas\n-\n-\n90,345\n-\n-\n90,345\nTotal\n1,142,196\n75,000\n818,844\n-\n-\n2,036,080\nName and Principal\nStock\nOption\nAll Other\nPosition\nYear\nSalary\nBonus\nAwards\nAwards\nCompensation\nTotal\nBrian Bonar, CEO\n393,000\n-\n-\n-\n-\n393,000\nBrian McGoff, COO\n-\n-\n-\n-\n-\n-\nKyle McCollum, CFO\n346,570\n100,000\n-\n-\n-\n446,570\nPauline Gourdie\n-\n-\n-\n-\n-\n-\nBrian Kendrick\n-\n-\n-\n-\n-\n-\nFletcher Robbe\n-\n-\n-\n-\n119,736\n119,736\nHarvey Hershkowitz\n140,347\n-\n380,000\n-\n20,000\n540,347\nAnthony Zolezzi\n2,716\n-\n-\n-\n-\n2,716\nTom Giles\n17,429\n145,000\n162,429\nDavid Bacon\n-\n-\n-\n-\n48,000\n48,000\nBijan Kian\n-\nJose Arrieta\n-\n-\n-\n-\n240,000\n240,000\nAmy Scannell\n297,476\n-\n-\n297,476\nVincent Monteparte\n-\n-\n297,476\n-\n-\n297,476\nAnuradha Biswas\n-\n-\n-\n-\n-\n-\nTotal\n1,000,062\n100,000\n974,953\n-\n572,736\n2,547,751\nOUTSTANDING EQUITY AWARDS AT FISCAL YEAR-END TABLE\nOPTION AWARDS STOCK AWARDS\nEquity\nEquity Incentive\nIncentive Plan\nPlan Awards:\nAwards: Market\nNumber or Payout\nof Value of\nMarket Unearned Unearned\nNumber of Number of\nNumber Value of Shares, Shares,\nSecurities Securities\nof Shares Shares or Units or Units or\nUnderlying Underlying\nor Units Units Other Other\nUnexercised Unexercised\nof Stock of Stock Rights Rights\nOptions and Options and Option\nThat Have That Have That That\nWarrants Warrants Exercise Option Not Not Have Not Have Not\nName and Principal (#) (#) Price Expiration Vested Vested Vested Vested\nPosition(s) (Exercisable) (Unexercisable) ($) Date (#) ($) (#) ($)\nBrian Bonar, CEO 500,000 - 0.45 7/7/2030 - - - -\nBrian McGoff, COO 442,466 57,534 0.45 12/31/2031 - - - -\nBrian McGoff, COO 1,712,329 3,287,671 0.33 6/17/2032 - - - -\nKyle McCollum, CFO 1,000,000 - 0.47 5/10/2031 - - - -\nKyle McCollum, CFO 500,000 - 0.45 7/7/2030 - - - -\nKyle McCollum, CFO 410,959 2,589,041 0.16 1/28/2033 - - - -\nPauline Gourdie 500,000 - 0.45 7/7/2030 - - - -\nBrian Kendrick 500,000 - 0.45 7/7/2030 - - - -\nAnthony Zolezzi 500,000 - 0.45 7/7/2030 - - - -\nAmy Scannell 500,000 - 0.45 2/14/2032 - - - -\nVincent Monteparte 500,000 - 0.45 2/14/2032 - - - -\nAnuradha Biswas 442,466 57,534 0.45 12/31/2031 - - - -\nDirector Compensation\nOn July 9, 2020, the Board authorized the Dalrada Financial Corp 2020 stock compensation plan to be used to compensate the company board of directors. The plan allocates the issuance of up to 3,500,000 shares. On February 25, 2021, the Company amended the plan to issue up to 4,500,000 shares and issued an aggregate of 4,500,000 common shares, or 500,000 shares to each board member (9). 3,500,000 shares of common stock were granted on July 9, 2020, at $0.08 per share and 1,000,000 shares of common stock were granted on February 25, 2021, at $0.45 per share, for a total fair value of $730,000, which is included in the Consolidated Statements of Operations and Comprehensive Loss.\nOn August 16, 2021, the Company approved Amendment No.1 of the 2020 Stock Compensation Plan used to compensate the Company board of directors. The Amended plan allocates the issuance of up to 6,500,000 shares which includes an additional 2,000,000 shares valued at $0.28 per shares or $560,000.\nOn September 30, 2021, the Board of Directors through email correspondence, approved Amendment No. 3 of the 2020 Stock Compensation Plan used to compensate the Company board of directors. The Board Directors agree to the following changes;\n1) Cancellation and return to treasury of all the commons shares issued under the previous 2020 Stock Compensation Plan and amendments totaling 6,500,000 shares of common stock.\n2) Ability to issue Cashless Warrants for up to 10,000,000 shares of the Companys Common Stock, at $.005 par value per share (Common Stock) at 500,000 shares per board member, key employees, or consultants with an exercise price at $0.45 per common share.\n3) The vesting period for the Warrants shall be as follows:\na) Warrants issued to replace the 4,500,000 shares issued pursuant to the July 9, 2020, grant date will be fully vested;\nb) Warrants issued to replace the 2,000,000 shares issued pursuant to the July 19, 2021, grant date and any later grant dates will vest over a one-year period.\nOn February 16, 2022, the Company issued 2,250,000 cashless warrants to new members of the Board of Directors. The cashless warrants vest over a 12-month period and hold an exercise price of $0.45 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.59 per share, or $1,338,644, which was calculated using the Black-Scholes model.\nOn August 11, 2023, the Company issued 1,000,000 cashless warrants to new members of the Board of Directors. The cashless warrants vest over a 12-month period and hold an exercise price of $0.45 per share. The cashless warrants expire in ten years after issuance. The fair value of the cashless warrants granted was $0.18 per share, or $180,691 which was calculated using the Black-Scholes model.\nEmployment Agreements\nOn July 1, 2019, the Company entered into an employment agreement with the Chief Executive Officer of the Company. Pursuant to the agreement, the Company will compensate the Chief Executive Officer a base salary of $393,000 per annum, annual increases of 10% and a quarterly bonus based on whether the Company achieves a net profit. He will be issued common stock of the Company sufficient to provide a 10% ownership position only upon a reverse split, which shares are to be maintained for a period of two years. In addition to all other benefits and compensation, he shall be eligible for a quarterly bonus of $47,000 based on if the Company achieves a net profit for that quarter. The Chief Executive Officers base salary has been deferred and accrued by the Company.\nReport on Repricing of Options\nNone. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table provides certain information regarding the ownership of our common stock, as of June 30, 2023, and as of the date of the filing of this annual report by:\n· each of our executive officers;\n· each director;\n· each person known to us to own more than 5% of our outstanding common stock; and\n· all our executive officers and directors act as a group.\nAs of June 30, 2023, we had a total of 88,699,139 shares of common stock issued and outstanding. Except as indicated in footnotes to this table, the persons named in this table have sole voting and investment power with respect to all shares of common stock indicated below. Except where noted, the address of all listed beneficial owners is in care of our office address.\nName and Address of Beneficial Owner\nTitle of Class\nAmount and\nNature of Beneficial\nOwnership\n(1) (#)\nPercent of Class\n(2) (%)\nBrian Bonar, Principal Executive Officer and Director\nCommon Shares\n6,022,093\n6.79\nAnuradha Biswas, Director\nCommon Shares\n1,430,435\n1.61\nAll officers and Directors as a group\nCommon Shares\n7,452,528\n8.40 Item 13. Certain Relationships, Related Transactions and Director Independence\nNotes Payable - Related Parties\nJune 30, 2023\nOutstanding Accrued\nPrincipal Interest\nRelated entity 1 $ 1,380,672 $ 3,038\nRelated entity 2 126,864 -\nRelated entity 3 105,000 -\nRelated entity 4 50,074 -\nRelated entity 5 - -\nRelated entity 6 237,473 11,144\n$ 1,900,083 $ 14,182\nJune 30, 2022\nOutstanding Accrued\nPrincipal Interest\nRelated entity 1 $ 8,261,310 $ 120,050\nRelated entity 2 8,213,976 106,951\nRelated entity 3 453,052 11,072\nRelated entity 4 1,512,924 123,996\nRelated entity 5 366,800\n$ 18,808,062 $ 362,855\nAll notes dated December 31, 2022, and prior are unsecured, bear interest at 3% per annum, and are due 360 days from the date of issuance, ranging from June 25, 2020, to December 30, 2022. All notes dated after December 31, 2022, are unsecured, bear interest at 8% per annum, and are due 1095 days from the date of issuance.\nConvertible Note Payable - Related Parties\nOn June 30, 2019, the Company issued a convertible note for $1,875,000 to the Chief Executive Officer of the Company for compensation. Under the terms of the note, the amount due is unsecured, bears interest at 3% per annum, and was due 360 days from the date of issuance. On June 30, 2019, the Company issued a note agreement which included a conversion feature of the outstanding balance at $0.034 per share. As the conversion price was equal to the fair value of the common shares on the date of the agreement, there was no beneficial conversion feature. As of June 30, 2023, the principal balance was $0 and the accrued interest was $0.\nRelated Party Transactions\nAs of June 30, 2023, and 2022, the Company owed $547,949 and $414,073, respectively to related parties for reimbursement of various operating expenses, accrued salaries, management fees, etc. which has been recorded in accounts payable and accrued liabilities - related parties. As of June 30, 2023, and 2022, this amount includes $0 and $0 of management fees, which consists of accounting and administrative services to Trucept Inc., a related party company controlled by the Chief Executive Officer of the Company. The management fee agreement calls for monthly payments of $35,000. The agreement is ongoing until terminated by either party.\nOn July 1, 2019, the Company formalized an employment agreement with its Chief Executive Officer, which entitles him to compensation of three hundred and ninety-three thousand dollars ($393,000) per year. Annual increases will be up to 10% based on performance criteria to be determined at a later date. He will be issued common stock of the Company sufficient to provide a 10% ownership position post reverse split, which shares be maintained for a period of two years. In addition to all other benefits and compensation, he shall be eligible for a quarterly bonus of $47,000 based on if the Company achieves a net profit for that quarter. As of June 30, 2023, and 2022, the Company had $0 and $0, accrued within accounts payable and accrued liabilities - related parties, respectively.\nThe following is a summary of revenues recorded by the Companys to related parties with common ownership:\nYear Ended\nJune 30,\nDalrada Health $ 76,912 $ 75,324\nDalrada Energy Services 45,968 1,261,774\nSolas - 56,240\nDalrada Energy Services - 6,000\nIgnite 3,718\nPrakat 25,000 -\nBothof Brothers 2,134,470 -\n$ 2,282,746 $ 1,403,056\nDirector Independence\nThe OTC Bulletin Board does not have a requirement that a majority of our Board of Directors be independent. However, with respect to the definition of independence utilized by NASDAQ, our officers and directors would be deemed to be independent.\nOur Audit Committee is comprised of our officers and directors. NASDAQ requires at least three members on the Audit Committee, each of whom must be independent. NASDAQ also requires that, if its Chief Executive Officers compensation is determined by its Compensation Committee, the Compensation Committee must be comprised solely of independent directors. The Company currently does not meet either of these requirements.\nThe NASDAQ rules have both objective tests and a subjective test for determining who is an independent director. The objective tests state, for example, that a director is not considered independent if he or she is an employee of the Company or is a partner, executive officer or controlling stockholder of an entity to which the Company made, or from which the Company received, payments in the current or any of the past three fiscal years that exceed the greater of $200,000 or 5% of the recipients consolidated gross revenue for that year or a family member serves in the current fiscal year or has served at any time during the last three fiscal years as an executive officer of the Company. The subjective test states that an independent director must be a person who lacks a relationship that, in the opinion of the Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. Item 14. Principal Accountant Fees and Services\nThe Company paid or accrued the following fees in each of the prior two fiscal years to its independent certified public accountants, Macias Gini & OConnell LLP (MGO) and dbbmckennon, for the years ended June 30, 2023, and 2022.\nFor the Year Ended June 30,\nAudit Fees - dbbmckennon $ 114,414 $ 131,050\nAudit Fees - MGO 132,213 -\nAudit-Related Fees - dbbmckennon 22,010 3,898\nAudit-Related Fees - MGO 100,000 -\nTax Fees - -\nAll Other Fees - -\nTotal Fees $ 236,424 $ 134,948\n\"Audit Fees\" consisted of fees billed for services rendered for the audit of the Companys annual financial statements and Audit-Related Fees are for review of the financial statements included in the Companys quarterly reports on Form 10-Q. Item 15. Exhibits\nThe financial statement schedules are omitted because they are inapplicable, or the requested information is shown in our financial statements or related notes thereto.\nExhibits\nExhibit\nNumber\nExhibit\nDescription\n31.1\nCertification of the Chief Executive Officer and Chief Financial Officer Pursuant to Rule 13a-14 or 15d-14 of the Exchange Act pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted in inline XBRL and included in exhibit 101).\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act, the Registrant has duly caused this Report to be signed on its behalf by the undersigned thereunto duly authorized.\nDalrada Financial Corporation\nBy: /s/ Brian Bonar\nDate: October 19, 2023 Brian Bonar\nChief Executive Officer\nPursuant to the requirements of the Exchange Act this Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Brian Bonar Chief Executive Officer October 19, 2023\nBrian Bonar and Director"
}