{
    "cik": "74046",
    "company": "Oil-Dri Corp of America",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-07-31",
    "sic": "3990",
    "state_of_inc": "DE",
    "state_location": "IL",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/74046/0000074046-22-000072-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/74046/000007404622000072/odc-20220731.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/74046/0000074046-22-000072.txt",
    "filename": "74046_10K_2022_0000074046-22-000072.htm",
    "content": "ITEM 1 - BUSINESS\nOVERVIEW OF BUSINESS\nExcept as otherwise indicated herein or as the context otherwise requires, references to Oil-Dri, the Company, we, us or our refer to Oil-Dri Corporation of America and its subsidiaries.\nOil-Dri is a leader in developing, manufacturing and/or marketing sorbent products. Our sorbent products are principally produced from hydrated aluminosilicate minerals, primarily consisting of calcium bentonite, attapulgite and diatomaceous shale, which we refer to collectively as our clay, our minerals, or Fuller's Earth. We surface mine our clay on leased or owned land near our manufacturing facilities in Mississippi, Georgia, Illinois and California. We produce both absorbent and adsorbent products from our clay. Absorbents, like sponges, draw liquids up into their many pores. Examples of our absorbent clay products are Cats Pride and Jonny Cat branded premium cat litter, as well as other private label cat litters. Additional examples are our Oil-Dri branded floor absorbents, Amlan branded animal health and nutrition solutions for livestock, and Agsorb and Verge agricultural chemical carriers. Adsorbent products attract impurities in liquids, such as metals and surfactants, and form low-level chemical bonds. Examples of our adsorbent products are our Ultra-Clear clarification clays. Our Pure-Flo, Supreme, Perform and Select bleaching clay products act as purification media for edible and non-edible oils. We also sell nonclay-based products, such as our Oil-Dri synthetic sorbents used for automotive, industrial and marine cleanup as well as plastic cat litter box liners. Our principal products are described in more detail below.\nOil-Dri Corporation of America was incorporated in 1969 in Delaware as the successor to an Illinois corporation incorporated in 1946 (which was the successor to a partnership that commenced business in 1941). For additional information on recent business developments, see Managements Discussion and Analysis of Financial Condition and Results of Operations, in Part II, Item 7, incorporated herein by reference.\nPRINCIPAL PRODUCTS\nAgricultural and Horticultural Products\nWe produce a wide range of granules and powders used to enhance agricultural and horticultural products. Our mineral-based absorbent products serve as carriers for biological and chemical active ingredients, drying agents, and growing media. Our brands include: Agsorb, an agricultural and horticultural carrier and drying agent; Verge, an engineered granule used as a carrier and drying agent; and Flo-Fre, a highly absorbent microgranule used as a flowability aid.\nAgsorb and Verge carriers are used in products that are alternatives to liquid sprays. These products are sold for lawn and garden and row crop applications. The clay granules absorb active ingredients and are then delivered directly into, or on top of the ground, providing a more precise application than liquid sprays. Verge carriers are spherical, uniform-sized granules with very low dust. Agsorb drying agent is blended into fertilizer-pesticide blends applied to absorb moisture and improve flowability. Flo-Fre microgranules are used by grain processors and other large handlers of bulk products to soak up excess moisture, which prevents caking. These products are sold primarily in the United States by our technical sales force.\nAnimal Health and Nutrition Solutions\nWe produce, or use contract processors to produce, Amlan brand name and private label products that support good health and productivity of species in livestock industries. For example, our products, including our Calibrin, Varium and NeoPrime products in our international markets, and Sorbiam, Ambio P and Ambio S products to customers in North America, provide a number of solutions for swine, poultry and dairy cattle livestock production. In addition, our MD-09 moisture manager product is a feed additive for the reduction of wet droppings in poultry and our Pel-Unite and Pel-Unite Plus products are specialized animal feed pellet binders.\nOur animal health and nutrition products are sold both directly and through a network of distributors to livestock producers, feed mill operators, nutritionists and veterinarians in the United States, Latin America, Africa, Mexico, the Middle East and Asia. The sales force for our subsidiaries located in China, Mexico and Indonesia also sells these products, as further described in Foreign Operations below.\nBleaching Adsorbent Products\nWe produce an array of adsorbent products for bleaching, purification and filtration applications that are used around the world by edible oil processors, as well as by refiners of jet fuel and other petroleum-based products. Bleaching clays are used by edible oil processors to adsorb soluble contaminants that promote oxidation problems. Our Pure-Flo and Perform bleaching clays remove impurities, such as trace metals, chlorophyll and color bodies, in various types of edible oils. Perform products provide increased activity for hard-to-bleach oils. Our Select adsorbents are used in a pre-treatment process to remove metals and trace soap in vegetable oil processing. Our Select adsorbents can also be used to pre-treat oil in the processing of biodiesel. Metal-X and Metal-Z are highly efficient adsorbents for the renewable diesel market. Our Ultra-Clear product is used as a purification and filtration medium for jet fuel and other petroleum-based products. These products are sold in the United States and in international markets by our team of technical sales employees, distributors and sales agents.\nCat Litter Products\nWe produce two types of mineral-based cat litter products, scoopable and coarse non-clumping litters, both of which have absorbent and odor controlling characteristics. Scoopable litters have the additional characteristic of clumping when exposed to moisture, allowing the consumer to selectively dispose of the used portion of the litter. Scoopable litter products are further differentiated between lightweight and heavyweight. Lightweight scoopable litters offer high performance with the added convenience of being lighter to carry and pour.\nBranded products. Our scoopable and non-clumping litters are sold under our Cats Pride and Jonny Cat brand names. Our Cat's Pride litters created the lightweight segment of the scoopable litter market. In addition, we offer our non-clumping litter in a pre-packaged, disposable tray under the Cats Pride KatKit brand. Moreover, we offer litter box liners under the Cat's Pride and Jonny Cat product lines. These products are sold through independent food brokers and by our sales force to major grocery, drug, dollar store, mass-merchandiser and pet outlets, as well as through e-commerce.\nPrivate label products. We produce private label scoopable and non-clumping cat litters. Our lightweight scoopable litters lead our private label cat litter offerings.\nCo-packaged products. We have a long-term supply arrangement with A&M Products Manufacturing Company, a subsidiary of The Clorox Company (\"Clorox\") (which is material to our business) under which we manufacture branded non-clumping litters. Under this co-manufacturing relationship, the marketer controls all aspects of sales, marketing, and distribution, as well as the odor control formula, and we are responsible for manufacturing. Under the long-term supply agreement with Clorox we have the exclusive right to supply Cloroxs requirements for Fresh Step coarse cat litter up to certain levels.\nIndustrial and Automotive Products\nWe manufacture and/or sell products made from clay, polypropylene and recycled materials that absorb oil, acid, paint, ink, water and other liquids. These products have industrial, automotive, marine and home applications. Our clay-based sorbent products, such as Oil-Dri branded and private label floor absorbents, are used for floor maintenance in industrial applications to provide a non-slip and non-flammable surface for workers. These floor absorbents are also used in automotive repair facilities, car dealerships and other industrial applications, as well as for home use in garages and driveways. Our Oil-Dri branded polypropylene-based and recycled products are sold in various forms, such as pads, rolls, socks, booms and spill kits.\nIndustrial and automotive sorbent products are sold through distribution networks that includes industrial, auto parts, safety, sanitary supply, chemical and paper distributors. These products are also sold through environmental service companies, mass-merchandisers, catalogs and through e-commerce.\nSports Products\nWe manufacture and sell both branded and private label sports products. Pros Choice Sports Field Products are used on baseball, softball, football, cricket, and soccer fields. Pros Choice soil conditioners are used in field construction or as top dressing to improve drainage, suppress dust and improve field performance. Pro Mound packing clay is used to construct pitchers mounds, catcher's stations and batters boxes. Rapid Dry drying agent is used to wick away excess water from the infield. Sports products are used at all levels of play, including professional, college and high school and on municipal fields. These products are sold through distributors of sport turf materials as well as to sports field product users.\nBUSINESS SEGMENTS\nWe have two reportable operating segments for financial reporting derived from the different characteristics of our two major customer groups: the Retail and Wholesale Products Group and the Business to Business Products Group. The Retail and Wholesale Products Group customers include mass merchandisers, wholesale clubs, drugstore chains, pet specialty retail outlets, dollar stores, retail grocery stores, direct customers through e-commerce, distributors of industrial cleanup and automotive products, environmental service companies and users of sports field products and sports turf materials. The Business to Business Products Group customers include processors and refiners of edible oils, petroleum-based oils and biodiesel fuel; manufacturers of animal feed and agricultural chemicals; distributors of animal health and nutrition products. Certain financial information on both segments is contained in Note 2 of the Notes to the Consolidated Financial Statements and is incorporated herein by reference.\nFOREIGN OPERATIONS\nOur foreign operations are located in Canada, which is included in the Retail and Wholesale Products Group, and the United Kingdom, China, Switzerland, Mexico and Indonesia, which are included in the Business to Business Products Group.\nOur wholly-owned subsidiary, Oil-Dri Canada ULC, is a manufacturer, distributor and marketer of branded and private label cat litter in the Canadian marketplace. Among its leading brands are Saular, Cats Pride and Jonny Cat. Our Canadian business also manufactures or purchases and sells industrial granule floor absorbents, synthetic polypropylene sorbent materials and agricultural chemical carriers.\nOur wholly-owned subsidiary, Oil-Dri (U.K.) Limited, is a manufacturer, distributor and marketer of industrial floor absorbents, bleaching earth and cat litter. These products are marketed in the United Kingdom and Western Europe. Oil-Dri (U.K.) Limited also sells synthetic polypropylene sorbent materials and plastic containment products.\nOur wholly-owned subsidiary, Amlan Trading (Shenzhen) Company, Ltd., located in Shenzhen, China, is dedicated to animal health and provides natural disease management solutions for livestock. This subsidiary sells animal health and nutrition products under our Amlan brand name and under private label arrangements. PT Amlan Perdagangan Internasional, another of our wholly-owned subsidiaries, is located in Indonesia and also distributes our animal health and nutrition products.\nOur wholly-owned subsidiary, Oil-Dri SARL, is a Swiss company that performs various management, customer service and administrative functions for some of the international customers of our domestic operations.\nWe own a 78.4% interest in a distributor in Mexico, Agromex Importaciones, S.A de C.V. This distributor sells, among other products, our animal health and nutrition products.\nOur foreign operations are subject to the normal risks of doing business in non-U.S. countries, such as currency fluctuations, restrictions on the transfer of funds and import/export duties; however, historically our operating results have not been materially impacted by these factors. Incorporated herein by reference are ITEM 1A - RISK FACTORS\nWe seek to identify, manage and mitigate risks to our business, but risk and uncertainty cannot be eliminated or necessarily predicted. You should consider the following factors carefully, in addition to other information contained in this Annual Report on Form 10-K, before making an investment decision with respect to our securities. The risks described below are not the only risks we face. Our business operations could also be affected by additional factors that are not presently known to us or that we currently consider to be immaterial in our operations.\nRisks Related to Our Business\nOur future growth and financial performance depend in large part on successful new product introductions.\nA significant portion of our net sales comes from the sale of products in mature categories, some of which have had, at times, experienced little or no volume growth or have had volume declines in recent fiscal years. A significant part of our future growth and financial performance will require that we successfully introduce new products or extend existing product offerings to meet emerging customer needs, technological trends and product market opportunities. We cannot be certain that we will achieve these goals. The development and introduction of new products generally require substantial and effective research, development and marketing expenditures, some or all of which may be unrecoverable if the new products do not gain market acceptance. New product development itself is inherently risky, as research failures, competitive barriers arising out of the intellectual property rights of others, launch and production difficulties, customer rejection and unexpectedly short product life cycles as well as other factors and events beyond our control may occur even after substantial effort and expense on our part. We may, at times, experience limitations on our ability to conduct plant tests with customers, which may impact our sales. Even in the case of a successful launch of a new product, the ultimate benefit we realize may be uncertain if the new product cannibalizes sales of our existing products beyond expected levels. See Government regulation imposes significant costs on us, and future regulatory changes (or related customer responses to regulatory changes) could increase those costs or limit our ability to produce and sell our products for a discussion of additional risks associated with new product development and launches and Our business could be adversely affected by a widespread threat to public health for a discussion of risks and events beyond our control that could impact our growth and performance.\nWe face intense competition in our markets.\nOur markets are highly competitive and we expect that both direct and indirect competition will increase in the future. Our overall competitive position depends on a number of factors including price, customer service, marketing, advertising and trade spending, technical support, product quality and delivery. Some of our competitors, particularly in the sale of cat litter (the largest product in our Retail and Wholesale Products Group), have substantially greater financial resources and market presence with established brands. The competition in the future may, in some cases, lead to price reductions, increased promotional spending, or loss of market share or product distribution, any of which could materially and adversely affect our operating results and financial condition.\nOur periodic results may be volatile.\nOur operating results have varied on a quarterly basis during our operating history and are likely to fluctuate significantly in the future. Our expense levels are based, in part, on our expectations regarding future net sales, and many of our expenses are fixed, particularly in the short term. We may be unable to adjust spending in a timely manner to compensate for any unexpected revenue shortfall. Any significant shortfall of net sales in relation to our expectations could negatively affect our quarterly operating results. Our operating results may be below the expectations of our investors as a result of a variety of factors, many of which are outside our control. The Company has experienced growth in recent periods, which may not be sustainable or indicative of future growth. Factors that may affect our quarterly operating results include:\nfluctuating demand for our products and services, including as a result of changes in the level of pet ownership and spending on pets;\nsize and timing of sales of our products and services;\nthe mix of products with varying profitability sold in a given quarter;\nchanges in our operating costs including raw materials, energy, transportation, packaging, overburden removal, trade spending and marketing, wages and other employee-related expenses such as health care costs, and other costs;\nour ability to anticipate and adapt to rapidly changing conditions;\nintroduction of new products and services by us or our competitors;\nour ability to successfully implement price increases and surcharges, as well as other changes in our pricing policies or those of our competitors;\nvariations in purchasing patterns by our customers, including due to weather conditions or other factors outside of our control;\nthe ability of major customers and other debtors to meet their obligations to us as they come due;\nour ability to successfully manage regulatory, intellectual property, tax and legal matters;\nlitigation and regulatory judgments and charges, settlements, or other litigation and regulatory-related costs;\nthe overall tax rate of our business, which may be affected by a number of factors, including the use of tax attributes, the financial results of our international subsidiaries and the timing, size and integration of acquisitions we may make from time to time;\nthe occurrence of a widespread outbreak of an illness or any other communicable disease, any other public health crisis, natural disaster, force majeure event or other catastrophic or unforeseen events;\nthe incurrence of restructuring, impairment or other charges; and\ngeneral economic conditions and specific economic conditions in our industry and the industries of our customers.\nAdditionally, the effects from and the continuation of the COVID-19 pandemic and its impacts may exacerbate these factors and cause greater fluctuations in our operating results from quarter-to-quarter. To the extent these factors slow or change, consumer demand for our products may not be sustained or may reverse, and our results could be adversely affected. Accordingly, we believe that quarter-to-quarter comparisons of our operating results are not necessarily meaningful. Investors should not rely on the results of one quarter as an indication of our future performance.\nUncertainties in economic conditions and their impact on consumer spending patterns could adversely impact our business, financial condition, and results of operations.\nThe United States has from time to time experienced challenging economic conditions, including in connection with the COVID-19 pandemic, and the global financial markets have recently undergone and may continue to experience significant volatility and disruption. Our business, financial condition and results of operations may be materially adversely affected by changes in consumer confidence, levels of unemployment, inflation, interest rates, tax rates and general uncertainty regarding the overall future economic environment. The keeping of pets and the purchase of pet-related products may constitute discretionary spending for some consumers and any material decline in the amount of consumer discretionary spending may reduce overall levels of pet ownership or spending on pets. As a result, a recession or slowdown in the economy may cause a decline in demand for our products. If economic conditions result in decreased spending on pets and have a negative impact on our retail customers and suppliers, our business, financial condition and results of operations may be materially adversely affected.\nAcquisitions involve a number of risks, any of which could cause us not to realize the anticipated benefits.\nWe intend, from time to time, to strategically explore potential opportunities to expand our operations and reserves through acquisitions. Identification of good acquisition candidates is difficult and highly competitive. If we are unable to identify attractive acquisition candidates, complete acquisitions, and successfully integrate the companies, businesses or properties that we acquire, our profitability may decline and we could experience a material adverse effect on our business, financial condition, or operating results. Acquisitions involve a number of inherent risks, including:\nuncertainties in assessing the value, strengths, and potential profitability of acquisition candidates, and in identifying the extent of all weaknesses, risks, contingent and other liabilities (including environmental, legacy product or mining safety liabilities) of those candidates;\nthe potential loss of key customers, management and employees of an acquired business;\nthe ability to achieve identified operating and financial synergies anticipated to result from an acquisition;\nproblems that could arise from the integration of the acquired business, it's management or other unanticipated problems or liabilities; and\nunanticipated changes in business, industry or general economic conditions that affect the assumptions underlying our rationale for pursuing the acquisition.\nAny one or more of these factors could cause us not to realize the benefits we anticipate to result from an acquisition. Moreover, acquisition opportunities we pursue could materially affect our liquidity and capital resources and may require us to incur indebtedness, seek equity capital or both and there can be no assurances that we can obtain indebtedness or equity capital on terms acceptable to the Company. Increased borrowings would correspondingly increase the Company's financial leverage, and could result in lower credit ratings and increased future borrowing costs. These risks could also reduce the Company's flexibility to respond to changes in its industry or in general economic conditions. In addition, future acquisitions could result in our assuming more long-term liabilities relative to the value of the acquired assets than we have assumed in our previous acquisitions.\nWe depend on a limited number of customers for a large portion of our net sales.\nA limited number of customers account for a large percentage of our net sales, as described in Item 1 Business above. The loss of, or a substantial decrease in the volume of, purchases by Walmart, or any of our other top customers could harm our sales and profitability. In addition, an adverse change in the terms of our dealings with, or in the financial wherewithal or viability of, one or more of our significant customers could harm our business, financial condition and results of operations.\nWe expect that a significant portion of our net sales will continue to be derived from a small number of customers and that the percentage of net sales represented by these customers may increase. As a result, changes in the strategies of our largest customers may reduce our net sales. These strategic changes may include a reduction in the number of brands or variety of products they carry or a shift of shelf space to private label products or increased use of global or centralized procurement initiatives. Further, the continued impact of COVID-19 may result in a change in demand for or availability of our products as a result of customers modifying their restocking, fulfillment, or shipping practices in response to, or recovery from, the global pandemic. In addition, our business is based primarily upon individual sales orders placed by customers rather than contracts with a fixed duration. Accordingly, most of our customers could reduce their purchasing levels or cease buying products from us on relatively short notice. While we do have long-term contracts with certain of our customers, including Clorox, even these agreements are subject to termination in certain circumstances. In addition, the degree of profit margin contribution of our significant customers varies. If a significant customer with a more favorable profit margin was to terminate its relationship with us or shift its mix of product purchases to lower-margin products, it would have a disproportionately adverse impact on our results of operations.\nPrice or trade concessions, or the failure to make them to retain customers, could adversely affect our sales and profitability.\nThe products we sell are subject to significant price competition and the price may fluctuate for a variety of reasons. From time to time, we may need to reduce the prices for some of our products to respond to competitive and customer pressures and to maintain market share. These pressures are often exacerbated during an economic downturn. Additionally, we have, from time to time, experienced customer-driven price deductions on our products as a result of delayed shipments of products. Any reduction in prices to respond to these pressures would reduce our profit margins. In addition, if our sales volumes fail to grow sufficiently to offset any reduction in margins, our results of operations would suffer. Because of the competitive environment facing many of our customers, particularly our high-volume mass merchandiser customers, these customers have increasingly sought to obtain price reductions, deductions, specialized packaging or other concessions from product suppliers. These business demands may relate to inventory practices, logistics or other aspects of the customer-supplier relationship. To the extent we provide these concessions, our profit margins are reduced. Further, if we are unable to maintain terms that are acceptable to our customers, these customers could reduce purchases of our products and increase purchases of products from our competitors, which would harm our sales and profitability.\nIncreases in energy, commodity, transportation, labor and other costs would increase our operating costs, and we may be unable to pass all these increases on to our customers in the form of higher prices and surcharges.\nIf our energy, commodity, transportation, labor and/or other costs increase disproportionately to our net sales, our earnings could be significantly reduced. Increases in our operating costs may reduce our profitability if we are unable to pass all the increases on to our customers through price increases or surcharges. Sustained price increases, surcharges or price inflation (or inflation pressure generally), in turn, may lead to declines in volume, and while we seek to project tradeoffs between price increases, surcharges and inflation, on the one hand, and volume, on the other, there can be no assurance that our projections will prove to be accurate. In particular, as a result of increased demand in trucking the United States as well as increased shipping demand globally, which has impacted overseas vessel deliveries, the Company has experienced significant increases in transportation costs, decreases in the availability of shipping, and other global supply chain complexities and could experience delays in customer shipments and increased customer deductions for late shipments. Such increase in transportation costs may be further exacerbated by volatile global oil and gas markets. It is possible that significant disruptions could occur if the effects of the COVID-19 pandemic and other global factors continue to put pressure on transportation and shipping as a result of an imbalance of supply and demand or if there are continued increases in costs that we are unable to recover. The duration and magnitude of the increased transportation costs cannot be predicted at this time and there can be no assurances that such costs and/or shipping disruptions will not continue to increase.\nWe are subject to volatility in the price and availability of natural gas, as well as other sources of energy. Such volatility could be intensified by geopolitical tensions, including war and terrorism, as well as other disruptions and market reactions to such events. From time to time, we may use forward purchase contracts or financial instruments to moderate the volatility of a portion of our energy costs. The success or failure of any such transactions depends on a number of factors, including our ability to anticipate and manage volatility in energy prices, the general demand for fuel by the manufacturing sector, seasonality and the weather patterns throughout the United States and the world.\nThe prices of other commodities such as paper, plastic resins, synthetic rubber, lumber, and steel significantly influence the costs of packaging, replacement parts and equipment we use in the manufacture of our products and the maintenance of our facilities. Similarly, transportation prices impact our cost of packaging and raw materials we purchase, as well as our cost to deliver finished products to our customers. We have also experienced increases in prices of non-commodity materials we purchase. As a result, increases in the prices of commodities, transportation and other materials may increase our cost of sales and present the same types of risks as described above.\nFurther, the Company has experienced an increasingly competitive labor market, changes in the availability of our workers, and labor shortages in our supply chain, which could result in increased costs, such as increased wage rates to attract and retain employees, and could negatively affect our ability to efficiently operate our facilities and overall business.\nTo the extent that we experience increased costs in any of these areas, we may increase our prices, pass the increases along to customers, or otherwise take actions to offset the impact. However, competitive pressures and other factors may also limit our ability to quickly raise prices in response to increased costs. Accordingly, we may not be able to offset increased costs fully or at all, and there can be no assurances that increasing prices will fully mitigate the impact of these increases, which could adversely impact our results.\nOur business could be negatively affected by supply, capacity, labor, information technology, logistics and other disruptions or the costs incurred to avoid these disruptions.\nSupply, capacity, information technology and logistics disruptions (which may be caused by a variety of factors, including public health crises such as the COVID-19 outbreak or other outbreaks of diseases or illnesses, weather conditions, governmental controls, tariffs, national emergencies, natural or man-made disasters, other force majeure events, abrupt political change or other political, civil or social unrest or instability, mass or other physical violence (or threats thereof), including terrorist activity and armed conflict, or other similar events) or our failure to mitigate such disruptions could adversely affect our ability to manufacture, package or transport our products or require additional resources to maintain or restore our supply chain. In addition, labor shortages or an increase in the cost of labor could adversely affect our profit margins and results of operations. As a result of the effects of and the continuation of the COVID-19 pandemic, there could be continued or renewed restrictions on our ability to travel or disruptions in our supply chain or ability to manufacture our products, as well as temporary closures of our facilities or those of our suppliers or customers, any of which could impact our sales and operating results. Some of our products require raw materials and/or packaging that are provided by a limited number of suppliers, or are demanded by other industries or are simply not available at times. Problems or delays experienced by these suppliers as a result of labor shortages or other events could lead to shortages in our production capacity, which could impact our ability to meet\ncustomer demand. In addition, as we grow or experience increased customer demand, our existing suppliers may not be able to meet our increasing demand, and we may need to find additional suppliers. We may not be able to secure suppliers who provide materials at, or services to, the specification, quantity and quality levels that we demand (or at all) or be able to negotiate acceptable fees and terms of services with any such suppliers. Additionally, such disruptions have resulted in challenges in addressing or backlogs and further backlog could develop in the event of continued disruptions. Disruptions arising from the foregoing or other events could adversely impact our results.\nFurther, some of our products are manufactured on equipment at or near its capacity thus limiting our ability to sell additional volumes of such products until more capacity is obtained. Additionally, as with all manufacturing facilities, equipment and infrastructure age and become subject to increasing maintenance and repair and the costs associated with such maintenance and repair may be significant. We have experienced increased costs and shortages in repair parts and our ability to procure components to repair equipment essential for our manufacturing processes could also be negatively impacted by various restrictions or disruptions in supply chains, among other items. In addition, an increase in truck or ocean freight costs may reduce our profitability, and a decrease in transportation availability may affect our ability to deliver our products to our customers and consequently decrease customer satisfaction and future orders. See Increases in energy, commodity, transportation, labor and other costs would increase our operating costs, and we may be unable to pass all these increases on to our customers in the form of higher prices and surcharges for additional risks related to increased transportation costs and logistics disruptions.\nChanges in inventory strategy by our customers as well as other external factors could adversely affect our sales and increase our inventory risk.\nFrom time to time, customers in both our Retail and Wholesale Products Group and our Business to Business Products Group have changed inventory levels as part of managing their working capital requirements. Any decrease in inventory levels by our customers would harm our operating results for the financial periods affected by the reductions. In particular, continued consolidation within the retail industry could potentially reduce inventory levels maintained by our retail customers, which could adversely affect our results of operations for the financial periods affected by the reductions.\nThe value of our inventory may decline as a result of surplus inventory, packaging changes driven by regulatory requirements or market refreshment, price reductions or obsolescence. We must identify the right product mix and maintain sufficient inventory on hand to meet customer orders. Failure to do so could adversely affect our revenue and operating results. If circumstances change (for example, an unexpected shift in market demand, pricing or customer defaults) there could be a material impact on the net realizable value of our inventory. We maintain an inventory valuation reserve account against diminution in the value or saleability of our inventory; however, there is no guaranty that these arrangements will be sufficient to avoid write-offs in excess of our reserves.\nWe depend on our mining operations for a majority of our supply of sorbent minerals.\nMost of our principal raw materials are sorbent minerals mined by us or independent contractors on land that we own or lease. While our mining operations are conducted in surface mines, which do not present many of the risks associated with deep underground mining, our mining operations are nevertheless subject to many conditions beyond our control. Our mining operations are affected by weather and natural disasters (such as earthquakes, tornadoes, hurricanes, heavy rains and flooding), power outages, equipment failures and other unexpected maintenance problems, variations in the amount of rock and soil overlying our reserves, variations in geological conditions, fires and other accidents, fluctuations in the price or availability of supplies, landowner disputes, permit requirements and other matters. Any of these risks could result in significant damage to our mining properties or processing facilities, personal injury to our employees, environmental damage, delays in mining or processing, losses or possible legal liability. We cannot predict whether or the extent to which we will suffer the impact of these and other conditions in the future.\nWe may not be successful in acquiring adequate additional reserves in the future.\nWe have an ongoing program of exploration for additional reserves on existing properties as well as through the potential acquisition of new owned or leased properties; however, there can be no assurance that our attempts to acquire additional reserves in the future will be successful. Our ability to acquire additional reserves in the future could be limited by competition from other companies for attractive properties, the lack of suitable properties that can be acquired on terms acceptable to us or restrictions under our existing or future debt facilities. We may not be able to negotiate new leases or obtain mining contracts for properties containing additional reserves or renew our leasehold interests in properties on which operations are not commenced during the term of the lease. Also, requirements for environmental compliance may restrict exploration or use of lands that might otherwise be utilized as a source of reserves.\nFailure to effectively utilize or successfully assert intellectual property rights, and the loss or expiration of such rights, could materially adversely affect our competitiveness. Infringement of third-party intellectual property rights could result in costly litigation and/or the modification or discontinuance of our products.\nWe rely on intellectual property rights based on trademark, trade secret, patent and copyright laws to protect our brands, products and packaging for our products. We cannot be certain that these intellectual property rights will be maximized or that they can be successfully asserted. There is a risk that we will not be able to obtain and perfect our own intellectual property rights or, where appropriate, license intellectual property rights necessary to support new product introductions. We cannot be certain that these rights, if obtained, will not later be invalidated, circumvented or challenged, and we could incur significant costs in connection with legal actions to assert our intellectual property rights or to defend those rights from assertions of invalidity. In addition, even if such rights are obtained in the United States or in other countries, the laws of some of the other countries in which our products are or may be sold may not protect intellectual property rights to the same extent as the laws of the United States. If other parties infringe our intellectual property rights, they may dilute the value of our brands in the marketplace, which could diminish the value that consumers associate with our brands and harm our sales. Accordingly, we have taken and may need to continue to take legal action in the future to protect our patents, trade secrets or know-how or to assert them against claimed infringement by others. Any legal action of that type could be costly and time consuming and no assurances can be made that any lawsuit will be successful. The failure to perfect or successfully assert our intellectual property rights could make us less competitive and could have a material adverse effect on our business, operating results, and financial condition.\nIn addition, if our products are found to infringe intellectual property rights of others, the owners of those rights could bring legal actions against us claiming substantial damages for past infringement and seeking to enjoin manufacturing and marketing of the affected products. If these legal actions are successful, in addition to any potential liability for damages from past infringement, we could be required to obtain a license in order to continue to manufacture or market the affected products, potentially adding significant costs. Similarly, we have asserted that products sold by our competitors infringe patents owned or licensed by us. We may not prevail in any action brought against us or we may be unsuccessful in securing any license for continued use and therefore have to discontinue the marketing and sale of a product. This could make us less competitive and could have a material adverse impact on our business, operating results and financial condition.\nThe loss of any key member of our senior management team may impede the implementation of our business plans in a timely manner.\nThe execution of our business plans depends in part upon the continued service of our senior management team, who possess unique and extensive industry knowledge and experience. The loss or other unavailability of one or more of the key members of our senior management team could adversely impact our ability to manage our operations effectively and/or pursue our business strategy. No Company-owned life insurance coverage has been obtained on current team members.\nRisks Related to Regulatory Compliance\nEnvironmental, health and safety matters create potential compliance and other liability risks.\nWe are subject to a variety of federal, state, local and foreign laws and regulatory requirements relating to the environment and to health and safety matters. For example, our mining operations are subject to extensive governmental regulation on matters such as permitting and licensing requirements, workplace safety, plant and wildlife protection, wetlands and other environmental protection, reclamation and restoration of mining properties after mining is completed, the discharge, storage and disposal of materials in the environment, and the effects that mining has on air or groundwater quality and water availability. We believe we have obtained all material permits and licenses required to conduct our present operations. We will, however, need additional permits and renewals of permits in the future.\nThe expense, liabilities and requirements associated with environmental, health and safety laws and regulations are costly and time-consuming and may delay commencement or continuation of exploration, mining or manufacturing operations. We have incurred, and will continue to incur, significant capital and operating expenditures and other costs, along with management focus and efforts, in complying with environmental, health and safety laws and regulations. In recent years, regulation and enforcement of environmental, health and safety matters has grown increasingly stringent, a trend that we expect will continue. Substantial penalties and other costs may be imposed if we violate certain of these laws and regulations even if the violation was inadvertent or unintentional. Failure to maintain or achieve compliance with these laws and regulations or with the permits required for our operations could result in substantial operating costs and capital expenditures, in addition to\nfines and administrative, civil or criminal sanctions, third-party claims for property damage or personal injury, cleanup and site restoration costs and liens, the issuance of injunctions to limit or cease operations, the suspension or revocation of permits and other enforcement measures that could have the effect of limiting our operations or otherwise requiring a change to our operations. Under the joint and several liability principle of certain environmental laws, we may be held liable for all remediation costs at a particular site and the amount of that liability could be material. In addition, future environmental laws and regulations could restrict our ability to expand our facilities or extract our existing reserves or could require us to acquire costly equipment or to incur other significant expenses in connection with our business. Furthermore, our reputation could be adversely impacted by the failure (or perceived failure) to maintain high environmental, health and safety practices for operations or negative perceptions of these practices in our industry or for our operations or products. There can be no assurance that future events, including changes in any environmental requirements and the costs associated with complying with such requirements, will not have a material adverse effect on us.\nGovernment regulation imposes significant costs on us, and future regulatory changes (or related customer responses to regulatory changes) could increase those costs or limit our ability to produce and sell our products.\nIn addition to the regulatory matters described above, our operations are subject to various federal, state, local and foreign laws and regulations relating to the mining, manufacture, packaging, labeling, content, storage, distribution and advertising of our products and the conduct of our business operations. For example, in the United States, some of our products, product claims, labeling and advertising are regulated by the Food and Drug Administration, the Consumer Product Safety Commission, the Occupational Safety and Health Administration, the Mine Safety and Health Administration, the Environmental Protection Agency and the Federal Trade Commission. Most states have agencies that regulate in parallel to these federal agencies. In addition, our international sales and operations are subject to regulation in each of the foreign jurisdictions in which we manufacture, distribute or sell our products. There is increasing federal and state regulation with respect to the content, labeling, use, and disposal after use of various products we sell. Throughout the world, but particularly in the United States and Europe, there is also increasing government scrutiny and regulation of the food chain and products entering or affecting the food chain.\nIf we are found to be out of compliance with applicable laws and regulations in these or other areas, we could be subject to loss of customers and to civil remedies, including fines, injunctions, recalls or asset seizures, as well as potential criminal sanctions, any of which could have a material adverse effect on our business. Loss of or failure to obtain necessary permits and registrations could delay or prevent us from meeting product demand, introducing new products, building new facilities or acquiring new businesses and could adversely affect operating results. As a result of closures caused by government action taken in response to COVID-19, the Company experienced some delays in obtaining such permits and registrations for its products. While the Company has taken steps to mitigate such delays, there can be no assurances that there will not be further delays as governments and agencies in the wake of the COVID-19 outbreak. Further, if applicable laws or regulations are changed or interpreted differently in the future, it may become more difficult or expensive for us to comply. In addition, investigations or evaluations of our products by government agencies may require us to adopt additional labeling, safety measures or other precautions, or may effectively limit or eliminate our ability to market and sell these products. Accordingly, there can be no assurance that we will be able to obtain or renew required governmental permits and registrations in the future. Further, there can be no assurance that current or future governmental regulation or other rule-making (including proposals regarding increased disclosure on climate-related matters) will not have a material adverse effect on our business. Our efforts to comply with new requirements and regulations could result in increased general and administrative expenses and a diversion of substantial management time and attention from revenue-generating activities to compliance activities.\nWe are also experiencing increasing customer scrutiny of the content and manufacturing of our products, particularly our products entering or affecting the food chain, in parallel with the increasing government regulation discussed above. Our customers may impose product specifications, certifications or other requirements that are different from, and more onerous than, applicable laws and regulations. As a result, the failure of our products to meet these additional requirements may result in loss of customers and decreased sales of our products even in the absence of any actual failure to comply with applicable laws and regulations. There can be no assurance that future customer requirements concerning the content or manufacturing of our products will not have a material adverse effect on our business.\nWe face risks to our domestic and international sales and business operations due to political, regulatory, economic and other conditions.\nUnstable economic, political, regulatory and other conditions could adversely affect demand for our products or disrupt our operations in the United States and in international markets. The international nature of our operations subjects the Company to numerous risks, including political, civil and/or instability (including acts of terrorism, civil or social unrest, labor unrest, violence in connection with political or social events, and outbreaks of war and pandemics or other disease outbreaks).\nBoth international and domestic operations are also subject to regulatory requirements and issues, including with respect to environmental matters. Any of these matters could result in sudden, and potentially prolonged, changes in domestic and international demand for our products. Further, ongoing developments in the U.S. political climate have introduced greater uncertainty with respect to tax policies, trade relations, tariffs and government regulations affecting trade between the U.S. and other countries. In particular, it remains uncertain what effects will continue in connection with the COVID-19 pandemic, its impacts, and the reactions of governmental authorities and others thereto will have on international trade and what impact any changes in international trade will have on the economy or on the businesses of the Company and those of its customers and its suppliers. In addition to considerations around the U.S. political climate, geopolitical concerns may also impact our business; for instance, we have experienced, and expect to continue to experience, the indirect impacts of the conflict resulting from Russias invasion of Ukraine, including increases in the cost of raw and packaging materials and commodities (including the price of oil), supply chain and logistics challenges and foreign currency volatility, and it is not possible to predict the broader or longer-term consequences of this conflict or the sanctions imposed to date. These developments, as well as the risks outlined above, could have a material adverse effect on the Companys business, financial condition and results of operations.\nIn addition, our international sales and operations are subject to various economic-related risks. Our international sales and operations are, among other factors, subject to currency exchange fluctuations, fund transfer and trade restrictions and import/export duties. In some cases, we may have difficulty enforcing agreements and collecting accounts receivable through a foreign countrys legal system. Further, an increase in inflation rates could affect the Companys profitability and cash flows, due to higher employment costs, higher operating costs, higher financing costs, and/or higher supplier prices. Inflation may also adversely affect foreign exchange rates. The Company may be unable to pass along such higher costs to its customers. In addition, inflation may adversely affect customers operations.\nWe may incur adverse safety events or product liability claims that may be costly, create adverse publicity and may add further governmental regulation.\nIf any of the products that we sell cause, or appear to cause, harm to any of our customers or to consumers, we could be exposed to product liability lawsuits, heightened regulatory scrutiny, requirements for additional labeling, withdrawal of products from the market, indemnification obligations, imposition of fines or criminal penalties or other governmental actions. Any of these actions could result in material write-offs of inventory, material impairments of intangible assets, goodwill and fixed assets, material restructuring charges and other adverse impacts on our business operations. We cannot predict with certainty the eventual outcome of any pending or future litigation, and we could be required to pay substantial judgments or settlements against us or change our product formulations in response to governmental action. Further, lawsuits can be expensive to defend, whether or not they have merit, and the defense of these actions may divert the attention of our management and other resources that would otherwise be engaged in managing our business and our reputation could suffer, any of which could harm our business.\nGoodwill, long-lived, and other intangible assets recorded as a result of our acquisitions could become impaired.\nWe review goodwill, long-lived assets, including property, plant and equipment and identifiable amortizing intangible assets, for impairment whenever changes in circumstances or events may indicate that the carrying amounts are not recoverable. Factors which may cause an impairment of long-lived assets include lower share trading prices and the adverse impact of rising costs and additional expenses to mitigate supply chain disruptions, among other factors. In 2022, we recorded a $5.6 million loss of goodwill related to the impairment of goodwill at our Retail and Wholesale Products Group reporting unit. We assess all existing goodwill at least annually for impairment on a reporting unit basis. The techniques used in our qualitative assessment and goodwill impairment tests incorporate a number of estimates and assumptions that are subject to change. Although we believe these estimates and assumptions are reasonable and reflect market conditions forecasted at the assessment date, any changes to these assumptions and estimates due to market conditions or otherwise may lead to an outcome where impairment charges would be required in future periods.\nWe may be subjected to increased taxes or fluctuating tax rates, which could adversely affect our results of operations and/or cash flows.\nAs a corporation operating in various jurisdictions around the world, we are subject to income and other taxes based upon the jurisdictions in which we operate and where our sales and profits are determined to be earned and taxed. Federal, state, and foreign statutory tax rates and taxing regimes have been subject to significant change and continue to evolve. Further, significant uncertainties exist with respect to the application of the various taxes to the businesses in which we engage, often requiring that we make judgments in determining our tax liabilities and worldwide provision for income taxes.\nOur interpretation of current tax laws and their applicability to our business, as well as any changes to existing laws, can significantly impact our effective tax rate. In particular, the U.S. as well as jurisdictions around the world are considering or have enacted changes in relevant tax regulations and interpretations. Changes in income tax laws and regulations, or their interpretation, could result in higher or lower income tax rates assessed or changes in the taxability of certain revenues or the deductibility of certain expenses, thereby affecting our income tax expense and profitability. In the U.S., various proposals, if enacted, could raise the U.S. corporate tax rate and increase the tax on non-U.S. income. Such unfavorable tax legislation could create the potential for added volatility in our quarterly provision for income taxes and could have a significant adverse impact on our future income tax provision and tax rate. Further, a number of factors may cause our effective tax rate to fluctuate, including: changes in tax rates in various jurisdictions, unanticipated changes in the amount of profit in jurisdictions in which the statutory tax rates may be higher or lower than the U.S. tax rate, changes in the valuation of our deferred tax assets and liabilities, adjustments to income taxes upon finalization of various tax returns, increases in expenses not deductible for tax purposes, and changes in available tax credits or our ability to utilize foreign tax credits. We could experience an effective tax rate significantly different from that of prior periods or current expectations, which could have an adverse effect on our results of operations or cash flows.\nWe are also subject to potential reviews, examinations, and audits by the Internal Revenue Service and other taxing authorities with respect to taxes within and outside of the U.S. Although we believe our tax estimates are reasonable, unfavorable resolution of any tax audits and controversies could cause our tax liabilities to increase (including interest and penalties) and may have a significant adverse impact on our provision for income taxes and tax rate. Our effective tax rate is also influenced by the geography, timing, nature, and magnitude of transactions, such as acquisitions and divestitures, restructuring activities, and impairment charges.\nRisks Related to Our Common Stock\nWe cannot guarantee that that our share repurchases will enhance long-term shareholder value.\nOur Board of Directors has previously authorized a share repurchase program. Under these authorizations, the Company has authority to repurchase both shares of our common stock and our Class B stock. The Company has undertaken repurchases of common stock on the open market (including pursuant to a 10b5-1 plan) and is also authorized to undertake repurchases in private, negotiated transactions. The Company has no obligations to repurchase any specific dollar amount or to acquire any specific number of shares. The timing, number and manner of share repurchases is determined by management and may depend upon a number of factors, including the trading price, market conditions, and the Companys liquidity needs and management of its spending. Further, the Companys share repurchases may be limited, suspended or discontinued at any time without prior notice (subject to the terms and conditions of the repurchase plan(s) in place at such time). The existence of a share repurchase program could cause our stock price to be higher than it would be in the absence of such a program and could potentially reduce the market liquidity for our stock or otherwise affect stock price and or volatility. Additionally, our share repurchase program could diminish our cash reserves, which may impact our ability to otherwise deploy such cash. There can be no assurance that these share repurchases will enhance shareholder value.\nOur principal stockholders have the ability to control matters requiring a stockholder vote and could delay, deter or prevent a change in control of our company.\nUnder our Certificate of Incorporation, the holders of our Common Stock are entitled to one vote per share and the holders of our Class B Stock are entitled to ten votes per share; the two classes generally vote together without regard to class (except that any amendment to our Certificate of Incorporation changing the number of authorized shares or adversely affecting the rights of Common Stock or Class B Stock requires the separate approval of the class so affected as well as the approval of both classes voting together). As a result, the holders of our Class B Stock exert control over the Company and thus limit the ability of other stockholders to influence corporate matters. Beneficial ownership of Common Stock and Class B Stock by the Jaffee Investment Partnership, L.P. and its affiliates (including Daniel S. Jaffee, our President, Chief Executive Officer and Chairman of the Board of Directors) provides them with the ability to control the election of our Board of Directors and the outcome of most matters requiring the approval of our stockholders, including the amendment of certain provisions of our Certificate of Incorporation and By-Laws, the approval of any equity-based employee compensation plans and the approval of fundamental corporate transactions, including mergers and substantial asset sales. Through their concentration of voting power, our principal stockholders may be able to delay, deter or prevent a change in control of our company or other business combinations that might otherwise be beneficial to our other stockholders.\nWe are a controlled company within the meaning of the New York Stock Exchange (NYSE) rules and, as a result, qualify for, and intend to rely on, exemptions from certain corporate governance requirements.\nWe are a controlled company under the New York Stock Exchange Corporate Governance Standards. As a controlled company, we may from time to time rely on exemptions from certain NYSE corporate governance requirements that otherwise would be applicable, including the requirements:\nthat a majority of the board of directors consists of independent directors;\nthat we have a nominating and governance committee comprised entirely of independent directors with a written charter addressing the committees purpose and responsibilities; and\nthat we have a compensation committee comprised entirely of independent directors with a written charter addressing the committees purpose and responsibilities.\nWe have previously relied on these exemptions (although we are not currently relying on the first exemption listed above), and we intend to continue to rely on them in the future, as applicable. As a result, you may not have the same benefits and information available to stockholders of NYSE-listed companies that are subject to all of the NYSE corporate governance requirements.\nThe market price for our Common Stock may be volatile.\nThe market price of our Common Stock could fluctuate substantially in the future in response to a number of factors, including the following:\nfluctuations in our quarterly operating results or the operating results of our competitors;\nchanges in general conditions in the economy, the financial markets, or the industries in which we operate;\nannouncements of significant acquisitions, strategic alliances or joint ventures by us, our customers, suppliers or competitors;\nsales of our common stock by the Company, our officer or directors or unaffiliated third party investors;\nintroduction of new products or services;\nincreases in the price of energy sources and other raw materials; and\nother developments affecting us, our industries, customers or competitors.\nIn addition, the stock market may experience extreme price and volume fluctuations that have a significant effect on the market prices of securities issued by many companies, including the Company, for reasons unrelated to their operating performance. These broad market fluctuations may materially adversely affect our Common Stock price, regardless of our operating results. Given its relatively small public float, number of stockholders and average daily trading volume, our Common Stock may be relatively more susceptible to volatility arising from any of these factors. If we experience significant fluctuations in our stock price, we may be exposed to securities class action lawsuits, which could negatively affect our business. There can be no assurance that the price of our Common Stock will increase in the future or be maintained at its recent levels.\nFuture sales of our Common Stock could depress its market price.\nFuture sales of shares of our Common Stock could adversely affect its prevailing market price. If our officers, directors or significant stockholders sell a large number of shares, or if we issue a large number of shares, the market price of our Common Stock could significantly decline. Moreover, the perception in the public market that stockholders might sell shares of Common Stock could depress the market for our Common Stock. Our Common Stocks relatively small public float and average daily trading volume may make it relatively more susceptible to these risks.\nFurthermore, in response to recent public focus on dual class capital structures, certain stock index providers are implementing limitations on the inclusion of dual class share structures in their indices. If these restrictions increase, they may impact who buys and holds our stock.\nFuture dividends on our common stock may be restricted or eliminated.\nDividends are declared at the discretion of our Board of Directors, and future dividends will depend on our future earnings, cash flow, financial requirements and other factors, including market and economic conditions. We are not obligated to continue a dividend for any fixed period, and the payment of dividends could be suspended or discontinued at any time at our discretion and without prior notice. There can be no assurance that we will continue to pay dividends. The amount and timing of any future dividends may vary, and the payment of any dividend does not assure that we will pay dividends in the future.\nGeneral Risk Factors\nTechnology failures or cyber security breaches or other unauthorized access to our information technology systems or sensitive or proprietary information could have an adverse effect on the Company's business and operations.\nWe rely on information technology systems to process, transmit, store, and protect electronic information. For example, a significant portion of the communications between the Company's personnel, customers, and suppliers depends on information technology and we rely on access to such information systems for our operations. We cannot guarantee that the security measures in place will prevent disruptions, failures, computer viruses or other malicious codes, ransomware, unauthorized access attempts, denial of service attacks, phishing, hacking, and other cyber-attacks or other privacy or security breaches in the information technology, phone systems or other systems (whether due to third-party action, bugs or vulnerabilities, physical break-ins, employee error, malfeasance or otherwise) of the Company, our customers or third parties, which could adversely affect our communications and business operations. Further, events such as natural disasters, fires, power outages, systems failures, telecommunications failures, employee error or malfeasance or other catastrophic events could similarly cause interruptions, disruptions or shutdowns, or exacerbate the risk of the failures described above. These risks may be increased as more employees work from home. We may not have the resources or technical sophistication to anticipate, prevent or detect rapidly-evolving types of cyber-attacks and other security risks. Attacks may be targeted at us, our customers and suppliers, or others who have entrusted us with information. To date, the Company has not experienced any material impact to the business or operations resulting from information or cybersecurity attacks; however, because of the frequently changing attack techniques, along with the increased volume and sophistication of the attacks, there is the potential for the Company to be adversely impacted. While the Company has policies and procedures in place, including system monitoring and data back-up processes to prevent or mitigate the effects of these potential disruptions or breaches, security breaches and other disruptions to information technology systems could interfere with our operations. Any failure to maintain, or disruption to, our information technology systems, whether as a result of cybersecurity attacks or otherwise, could damage our reputation, subject the Company to legal claims and proceedings, create risks of violations of data privacy laws and regulations, and cause us to incur substantial additional costs. There can be no assurance that existing or emerging threats will not have an adverse impact on our systems or communications networks and, further, technological enhancements to prevent business interruptions could require increased spending. Furthermore, security breaches pose a risk to confidential data and intellectual property, which could result in damage to our competitiveness and reputation.\nAdditionally, in connection with our global operations, we, from time to time, transmit data across national borders to conduct our business and, consequently, are subject to a variety of laws and regulations regarding privacy, data protection, and data security, including those related to the collection, processing, storage, handling, use, disclosure, transfer, and security of personal data, including the European Union General Data Protection Regulation, Personal Information Protection Law in China and similar regulations in states within the United States and in countries around the world. Our efforts to comply with privacy and data protection laws may impose significant costs and challenges that are likely to increase over time.\nOur enterprise resource planning system (ERP) is designed to accurately maintain our books and records and provide information important to the operation of our business. Any potential disruptions with the ERP system could affect our ability to process orders, ship product and send invoices. These difficulties could, in turn, negatively impact our financial results including sales, earnings and cash flow. Further development and maintenance of the ERP system will continue to require investment of human and financial resources, which may cause increased costs and other difficulties.\nOur business could be adversely affected by a widespread threat to public health.\nIn March 2020, the World Health Organization declared the COVID-19 outbreak a pandemic and in response to the COVID-19 outbreak and as jurisdictions have experienced resurgences in the spread of COVID-19, countries and local governments across the world implemented Shelter in Place, Safe at Home, quarantine or similar orders that restricted workforce and/or required closures of non-essential businesses along with restrictions on travel. Such restrictions and\nclosures initially disrupted our sales office in China and limited travel by our salesforce and delayed product shipments. The COVID-19 pandemic created significant volatility, uncertainty, and economic disruption. While our facilities otherwise remained operational as essential businesses throughout the pandemic, there can be no assurances that we will not have to close facilities or experience other disruption in the future due to concerns over the health and well-being of our employees, or as a result of government directives in response to COVID-19 or other public health threats. The spread of a widespread threat to public health such as COVID-19 has currently had limited disruption and impact to our third party business partners, suppliers, service providers, and customers but no assurances can be made that future threats to public health will not have a more significant impact on our operations or results.\nPublic health crises may create significant uncertainty relating to the COVID-19 pandemic and the responses thereto as well as the potential effects of the pandemic on our business and could negatively affect our costs, customer orders, and collection of accounts receivable, which may be material. In addition, a public health crisis could result in the deterioration of worldwide economic conditions and impact the proper functioning of financial and capital markets, foreign currency exchange rates, and commodity and energy prices, as well as demand for our products. We may experience adverse impacts to our business and financial results due to uncertainty regarding the ultimate duration of the COVID-19 pandemic and/or its effects and due to any major public health crises that may occur in the future.\nWe are subject to various legal and regulatory proceedings, including litigation in the ordinary course of business, which may adversely impact our business, financial condition and results of operations.\nIn the ordinary course of business, we are subject to various legal and regulatory proceedings, which may include but are not limited to those involving antitrust, tax, trade, environmental, intellectual property, data privacy and other matters, including general commercial litigation. Such claims and litigation are frequently expensive and time-consuming (and could divert managements attention and resources) to resolve and may result in substantial liability to us, which liability and related costs and expenses may not be recoverable through insurance or any other forms of reimbursement and could also result in higher insurance costs. Additionally, the outcome of legal and regulatory proceedings may differ from our expectations because the outcomes of these proceedings are often difficult to predict reliably. Various factors and developments can lead to changes in our estimates of liabilities. A future adverse ruling, settlement or unfavorable development could result in charges that could have a material adverse effect on our results of operations in any particular period.\nFailure to maintain effective internal control over financial reporting could have a material adverse effect on our business, operating results and stock price.\nSection 404 of the Sarbanes-Oxley Act and related SEC rules require that we perform an annual management assessment of the design and effectiveness of our internal control over financial reporting and obtain an opinion from our independent registered public accounting firm on our internal control over financial reporting. Our assessment concluded that our internal control over financial reporting was effective as of July 31, 2022 and we obtained from our independent registered public accounting firm an unqualified opinion on our internal control over financial reporting; however, there can be no assurance that we will be able to maintain the adequacy of our internal control over financial reporting, as such standards are modified, supplemented or amended from time to time in future periods. Further, as a result of COVID-19, a portion of our workforce has been and continues to work from home, so new processes, procedures, and controls could be required due to the changes in our business environment, which could negatively impact our internal control over financial reporting. Accordingly, we cannot assure that we will be able to conclude on an ongoing basis that we have effective internal control over financial reporting in accordance with Section 404 of the Sarbanes- Oxley Act. Moreover, effective internal control is necessary for us to produce reliable financial reports and is important to help prevent financial fraud. If we cannot provide reliable financial reports or prevent fraud, our business and operating results could be harmed, investors could lose confidence in our reported financial information, and the trading price of our Common Stock could drop significantly.\nFailure to maintain a level of corporate social responsibility could damage our reputation and could adversely affect our business, financial condition or results of operations.\nIn light of evolving expectations around corporate social responsibility, our reputation or brand could be adversely impacted by a failure (or perceived failure) to maintain a level of corporate responsibility. In todays environment, an allegation or perception regarding quality, safety, or corporate social responsibility can negatively impact our reputation. This may include, without limitation: failure to maintain certain ethical, social and environmental practices for our operations and activities, or failure to require our suppliers or other third parties to do so; our environmental impact, including our mining operations and their impact on the environment; the practices of our employees, agents, customers, suppliers, or other third parties (including others in our industry) with respect to any of the foregoing, actual or perceived; the failure to be perceived as appropriately addressing matters of social responsibility; consumer perception of statements made by us, our employees and\nexecutives, agents, customers, suppliers, or other third parties (including others in our industry); or our responses to any of the foregoing. Further, we may be subject to rulemaking regarding corporate social responsibility and/or disclosure, as public awareness and focus on social and environmental issues has led to legislative and regulatory efforts to impose increase regulations and require further disclosure. As a result, we may become subject to new or more stringent regulations, legislation or other governmental requirements or industry standards and/or an increased demand to meet voluntary criteria related to such matters. Increased regulations, including around climate change concerns, could subject us to additional costs and restrictions and require us to make certain changes to our manufacturing practices and/or product designs, which could negatively impact our business, results of operations, financial condition and competitive position. ITEM 1B - UNRESOLVED STAFF COMMENTS\nNone. ITEM 2 - PROPERTIES\nCLAY RESOURCES AND RESERVES\nIn 2018, the SEC adopted new rules updating the disclosure requirements for companies with mining operations. The new mining disclosure rules rescind Industry Guide 7 and codify the SECs mining property disclosure requirements in new subpart 1300 of Regulation S-K. These rules became applicable to our disclosures on August 1, 2021. Regulation S-K 1300 requires the disclosure of mineral resources for the first time. However, we have no mineral resource estimates as all mineral accumulations of economic interest and with reasonable prospects for eventual economic extraction are either currently on production or subject to an economically viable future development plan and are classified as mineral reserves.\nAs used in this Form 10-K, the terms mineral resource, mineral reserve, proven mineral reserve and probable mineral reserve are defined and used in accordance with subpart 1300 of Regulation S-K. Under subpart 1300 of Regulation S-K, mineral resources may not be classified as mineral reserves unless the determination has been made by a qualified person (as defined under subpart 1300 of Regulation S-K) that the mineral resources can be the basis of an economically viable project.\nThe following provides an overview of our mining properties, operations, and reserves. Our real property holdings and tons produced for each of the three fiscal years ended July 31, are as follows:\nReal Property Holdings\nTons Produced\nLand\nOwned Land\nLeased Land\nUnpatented\nClaims Total 2022 2021 2020\n(acres) (thousands of tons)\nCalifornia 795 - 1,030 1,825 61 65 65\nGeorgia 3,851 1,593 - 5,444 418 383 379\nIllinois 105 508 - 613 55 50 55\nMississippi 2,219 1,331 - 3,550 298 283 257\nNevada 535 - - 535 0 0 0\nOregon 340 - - 340 0 0 0\nTennessee 178 - - 178 0 0 0\n8,023 3,432 1,030 12,485 832 781 756\nWith the exception of our research and development center in Illinois, all properties contain clay mineral reserves or are used in the processing of our clay. We mine sorbent minerals primarily consisting of calcium bentonite, attapulgite and diatomaceous shale which we refer to in the aggregate as clay, minerals, or Fullers Earth. We use certified professional geologists and mineral specialists who prepared the estimated reserves of these minerals in the table above. See also Item 1 Business above for further information about our reserves. Apart from certain mines in Georgia and Illinois, all mines in Mississippi, Georgia, California and Illinois are currently in active production and collectively produced approximately 832,000 and 781,000 tons of finished product in fiscal years 2022, and 2021, respectively. Certain of our mines in Georgia are currently in development. Parcels of such land are also sites of manufacturing facilities operated by us. In addition, we own approximately one acre of land in Laval, Quebec, Canada, which is the site of the processing, packaging and distribution facility for our Canadian subsidiary. While we have reserves in Nevada, Oregon and Tennessee we are not actively mining these properties.\nMINING PROPERTIES\nOur mining operations are conducted on both owned and leased land. The Georgia, Illinois and Mississippi mining leases generally require that we pay a minimum monthly rent to continue the lease term. The rental payments are typically applied against a stated royalty related to the number of unprocessed, or in some cases processed, tons of minerals extracted from the leased property. Many of our mining leases have no stated expiration dates. Some of our leases, however, do have expiration dates ranging from 2026 to 2097. We would not experience a material adverse effect from the expiration or termination of any of these leases. We have a variety of access arrangements, some of which are styled as leases, for manufacturing at facilities that are not contiguous with the related mines. We would not experience a material adverse effect from the expiration or termination of any of these arrangements.\nCertain of our land holdings in California are represented by unpatented mining claims we lease from the Bureau of Land Management. These leases generally give us the contractual right to conduct mining or processing activities on the land covered by the claims. The validity of title to unpatented claims, however, is dependent upon numerous factual matters. We believe the unpatented claims we lease are in compliance with all applicable federal, state and local mining laws, rules and regulations. Future amendments to existing federal mining laws, however, could have a prospective effect on mining operations on federal lands and include, among other changes, the imposition of royalty fees on the mining of unpatented claims, the elimination or restructuring of the patent system and an increase in fees for the maintenance of unpatented claims. To the extent that future proposals may result in the imposition of royalty fees on unpatented lands, the mining of our unpatented claims may become economically unfavorable. We cannot predict the form that any such amendments might take or whether or when such amendments might be adopted. In addition, the construction and operation of processing facilities on these sites would require the approval of federal, state and local regulatory authorities. See Item 1A Risk Factors above for a discussion of other risks to our business related to our mining properties.\nWe operate a number of mines concentrated near our production facilities in California, Georgia, Illinois and Mississippi, although we have proven reserves in other states. Based upon the quantitative and qualitative factors applicable, we do not consider any of our mines to be individually material to our business or financial condition. As a result, we are only required to disclose summary information related to our mineral reserves. Our mineral reserves as of July 31, 2022, have been prepared and certified by Jason Giddens, Corporate Geologist, our Qualified Person (QP) who is employed by us and who is a certified professional geologist. Our summary of proven and probable reserves as of July 31, 2022 is as follows:\nMineral Reserves\nEstimated\nProven\nReserves Estimated\nProbable\nReserves Total\n(thousands of tons)\nCalifornia 3,458 11,226 14,684\nGeorgia 33,065 22,675 55,740\nIllinois 2,384 1,596 3,980\nMississippi 36,170 134,854 171,024\nNevada 23,316 2,976 26,292\nOregon - 25 25\nTennessee 3,000 3,000 6,000\n101,393 176,352 277,745\nWe estimate that our proven mineral reserves as of July 31, 2022 were approximately 101,393,000 tons in aggregate and our probable reserves were approximately 176,352,000 tons in aggregate, for a total of 277,745,000 tons of mineral reserves. Based on our rate of consumption during fiscal year 2022, and without regard to any of our reserves in Nevada, Oregon and Tennessee, we consider our proven and probable reserves adequate to supply our needs for over 40 years. Although we consider these reserves to be extremely valuable to our business, only a small portion of the reserves, those which were acquired in acquisitions, are reflected at cost on our balance sheet.\nIt is our policy to attempt to maintain a minimum of forty years of proven and probable reserves of each type of clay at each location. We have an ongoing program of exploration for additional reserves but we cannot assure that additional reserves will continue to become available. Our use of these reserves, and our ability to explore for additional reserves, are subject to compliance with existing and future federal and state statutes and regulations regarding mining and environmental compliance. During fiscal year 2022, we utilized these reserves to produce substantially all of the sorbent products that we sold.\nProven reserves means the economically mineable part of a measured resource and can only result from conversion of a measured mineral resource. Further, proven reserves are those reserves for which (a) quantity is computed from dimensions revealed in outcrops, trenches, workings or drill holes; grade and/or quality are computed from results of detailed sampling, and (b) the sites for inspection, sampling and measurement are spaced so closely and the geologic character is so well defined that size, shape, depth and mineral content of reserves are well established. Probable reserves are computed from information similar to that used for proven reserves, but the sites for inspection, sampling and measurement are farther apart or are otherwise less adequately spaced. The degree of assurance, although lower than that for proven reserves, is high enough to assume continuity between points of observation. We use certified professional geologists and mineral specialists who estimate and evaluate existing and potential reserves in terms of quality, quantity and availability.\nWe have internal controls for reviewing and documenting the information supporting the mineral reserve estimates and ensuring the validity of the estimates. Information that is utilized to compile mineral reserves is prepared and certified by our QP and is subject to internal review. Refer to Item 1A. Risk Factors for discussion of risks associated with our estimates of mineral reserves.\nMINING AND MANUFACTURING METHODS\nMining and Hauling\nWe mine clay in open-pit mines in Georgia, Mississippi, Illinois and California. The mining and hauling operations are similar throughout the Oil-Dri locations, with the exception of California. The land to be mined is first stripped. The stripping process involves removing the overburden and preparing the site to allow the excavators to reach the desired clay. When stripping is completed, the excavators dig out and load the clay onto dump trucks. The trucks haul the clay directly to our processing plants where it is dumped in a clay yard and segregated by clay type if necessary. Generally, the mine sites are in close proximity to the processing plants; however, the maximum distance the clay is currently hauled to a plant is approximately 13 miles.\nAt our California mines, the clay is excavated and hauled to a hopper. An initial crushing and screening operation is performed at the mine site before the trucks are loaded for delivery to the processing plant.\nProcessing\nThe processing of our clay varies depending on the level of moisture desired in the clay after the drying process. The moisture level is referred to as regular volatile moisture (RVM) or low volatile moisture (LVM).\nRVM Clay: A front end loader is used to load the clay from the clay yard into the primary crusher. The primary crusher reduces the clay chunks to 2.0 inches in diameter or smaller. From the crusher, the clay is transported via a belt conveyor into the clay shed. A clay shed loader feeds the clay into a disintegrator which reduces the clay to particles 0.5 inches in diameter or smaller. The clay then feeds directly into the RVM kiln. The RVM kiln reduces the clays moisture content. From the RVM kiln, the clay moves through a series of mills and screens which further size and separate the clay into the desired particle sizes. The sized clay is then conveyed into storage tanks. The RVM processed clay can then be packaged or processed into LVM material.\nLVM Clay: RVM clay is fed from storage tanks into the LVM kiln where the moisture content is further reduced. The clay then proceeds to a screening circuit which separates the clay into the desired particle sizes.\nIn addition, certain other products may go through further processing or the application of fragrances and additives. For example, certain fluid purification and animal health products are processed into a powder form. We also use a proprietary process for our engineered granules to create spherical, uniform-sized granules.\nPackaging\nOnce the clay has been dried to the desired level it will be sized and packaged. Our products have various package sizes and types ranging from bags, boxes, pails, and jugs of cat litter to railcars of agricultural products. We also package some of our products into bulk (approximately one ton) bags or into bulk trucks. The size and delivery configuration of our finished products is determined by customer requirements.\nFACILITIES\nWe operate clay manufacturing and non-clay production facilities on property owned or leased by us as shown on the map below:\nOil-Dri Plant Site Locations\nLocation Owned/Leased Function\nBlue Mountain, Mississippi Owned Manufacturing and packaging\nChicago, Illinois Leased Principal executive office\nCoppet, Switzerland Leased Customer service office\nJakarta, Indonesia Leased Office\nJalisco, Mexico Leased Warehouse and office\nLaval, Quebec, Canada Owned Non-clay manufacturing and clay and non-clay packaging, sales\nMounds, Illinois Owned Manufacturing and packaging\nOchlocknee, Georgia Owned Manufacturing and packaging\nRipley, Mississippi Owned Manufacturing and packaging\nShenzhen, China Leased Sales office, customer service\nTaft, California Owned Manufacturing and packaging\nVernon Hills, Illinois Owned & Leased Research and development\nWisbech, United Kingdom Leased Non-clay manufacturing and clay and non-clay packaging, sales, customer service\nWe have no mortgages on the real property we own. The leases for the locations listed above expire as follows: Shenzhen, China in 2024; Vernon Hills, Illinois in 2026; Wisbech, United Kingdom in 2032 and Chicago, Illinois in 2033. The leases for the Coppet, Switzerland; Jakarta, Indonesia; and Jalisco, Mexico offices are on a year-to-year basis. We consider that our properties are generally in good condition, well maintained and suitable and adequate to carry on our business. ITEM 3 - LEGAL PROCEEDINGS\nFor a discussion of contingencies related to legal proceedings, see Note 11 of the Notes to the Consolidated Financial Statements, which is hereby incorporated by reference. ITEM 4 - MINE SAFETY DISCLOSURE\nOur mining operations are subject to regulation by the Mine Safety and Health Administration under authority of the Federal Mine Safety and Health Act of 1977, as amended. Information concerning mine safety violations or other regulatory matters required by section 1503(a) of the Dodd-Frank Wall Street Reform and Consumer Protection Act and Item 104 of Regulation S-K is included in Exhibit 95 to this Annual Report on Form 10-K.\nPART II ITEM 5 - MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur Common Stock is traded on the NYSE under the symbol ODC. There is no established trading market for our Class B Stock. There are no shares of Class A Common Stock currently outstanding. See Exhibit 4.1 to this Annual Report on Form 10-K for a description of our Common Stock, Class B Stock and Class A Common Stock. The number of holders of record of Common Stock and Class B Stock on September 30, 2022 were 710 and 24, respectively, as reported by our transfer agent. In the last three years, we have not sold any securities which were not registered under the Securities Act of 1933.\nDividends\nOur Board of Directors determines the timing and amount of any dividends. Our Board of Directors may change its dividend practice at any time. The declaration and payment of future dividends, if any, will depend upon, among other things, our future earnings, capital requirements, financial condition, legal requirements, contractual restrictions and other factors that our Board of Directors deems relevant. Our Credit Agreement with BMO Harris Bank N.A. (BMO Harris) and our Amended Note Agreement with Prudential requires that certain minimum net worth and tangible net worth levels are to be maintained. To the extent that these balances are not attained, our ability to pay dividends may be impaired. See Note 3 of the Notes to the Consolidated Financial Statements for further information about our note agreements.\nIssuer Repurchase of Equity Securities\nDuring the three months ended July 31, 2022, we did not sell any securities which were not registered under the Securities Act of 1933. The following chart summarizes our Common Stock purchases during this period.\nISSUER PURCHASES OF EQUITY SECURITIES 1\n(a) (b) (c) (d)\nFor the Three Months Ended July 31, 2022 Total Number of Shares Purchased2\nAverage Price Paid per Share Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs Maximum Number of Shares that may yet be Purchased Under Plans or Programs3\nMay, 1 2022 to May 31, 2022 - $- - 485,196\nJune 1, 2022 to June 30, 2022 48,064 $26.71 48,064 437,132\nJuly 1, 2022 to July 31, 2022 606 $28.27 - 436,526\n1 The table summarizes repurchases of (and remaining authority to repurchase) shares of our Common Stock. Our Board of Directors authorized the repurchase of 300,000 shares of Class B Stock on March 21, 2018, however there have been no repurchases of Class B Stock for the three months ended July 31, 2022, and the authorized Class B Stock is not included in the table above. No shares of our Class A Common Stock are currently outstanding. Descriptions of our Common Stock, Class B Stock and Class A Common Stock are contained in Exhibit 4.1 of this Annual Report on Form 10-K for the fiscal year ended July 31, 2022.\n2 The 606 shares of Common Stock in July 2022 represent shares surrendered by employees to pay taxes related to restricted stock awards.\n3 Our Board of Directors authorized the repurchase of 250,000 shares on June 14, 2012 and an additional 750,000 shares on March 11, 2019. These authorizations do not have a stated expiration date. The share numbers in this column indicate the number of shares of Common Stock that may yet be repurchased under these authorizations. Repurchases may be made on the open market (pursuant to Rule 10b5-1 plans or otherwise) or in negotiated transactions. The timing and number of shares repurchased will be determined by our management.  ITEM 7 - MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read together with the Consolidated Financial Statements and the related notes included elsewhere herein. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results may differ materially from the results discussed in the forward-looking statements. Factors that might cause a difference include those discussed under Forward-Looking Statements and in Item 1A Risk Factors in this Annual Report on Form 10-K.\nOVERVIEW\nWe develop, mine, manufacture and market sorbent products principally produced from clay minerals, primarily consisting of calcium bentonite, attapulgite and diatomaceous shale. Our principal products include agricultural and horticultural chemical carriers, animal health and nutrition products, cat litter, fluid purification and filtration bleaching clays, industrial and automotive floor absorbents and sports field products. Our products are sold to two primary customer groups, including customers who resell our products as originally produced to the end consumer and other customers who use our products as part of their production process or use them as an ingredient in their final finished product. We have two reportable operating segments based on the different characteristics of our two primary customer groups: the Retail and Wholesale Products Group and the Business to Business Products Group. Each operating segment is discussed individually below. Additional detailed descriptions of the operating segments are included in Item 1 Business above.\nAs a result of a change in management organization during fiscal year 2022 and as part of our routine assessments of our segments, our wholly owned subsidiary located in the United Kingdom is now included in our Business to Business Products Group and our co-packaged coarse cat litter is now included in the Retail and Wholesale Products Group. Prior year net sales and operating income have also been reclassified to reflect these changes. The organization change was intended to better serve our customers and the segment information presented reflects the information regularly reviewed by our chief operating decision maker.\nRESULTS OF OPERATIONS\nOVERVIEW\nConsolidated net sales increased approximately $43,608,000 or 14% in fiscal year 2022 compared to fiscal year 2021. Consolidated income from operations in fiscal year 2022 decreased compared to fiscal year 2021 by $8,215,000. Additionally, fiscal year 2022 experienced lower income tax expense than fiscal year 2021 as further described in Note 5 of the Notes to the Consolidated Financial Statements.\nConsolidated net income was $5,674,000, or $0.81 per diluted common share, for the fiscal year ended July 31, 2022, a 49% decrease from net income of $11,113,000, or $1.57 per diluted common share, for the fiscal year ended July 31, 2021. The decrease relates to higher freight, packaging, natural gas, and non-fuel manufacturing costs and also various other rising costs as described further below.\nOur Consolidated Balance Sheets as of July 31, 2022 and our Consolidated Statements of Cash Flows for fiscal year 2022 show a decrease in total cash and cash equivalents from fiscal year-end 2021 driven by higher cost of goods, increased capital requirements, and stock repurchases. Cash reduction as of July 31, 2022 was offset by an additional $25,000,000 in loan proceeds.\nAs further discussed below, our consolidated net sales increased in the fiscal year 2022 compared to the fiscal year 2021. Net sales of our industrial and sports products as well as most of our fluids purification products have mostly returned to pre-pandemic levels as many businesses and sports have re-opened and air travel has been increasing. However, parts of our business continue to be negatively impacted by the pandemic and varying recoveries from and resurgences of the pandemic in certain areas. Net sales for our industrial granules in the United Kingdom have increased in fiscal year 2022 as a result of the return of demand following the impact of the pandemic (and also certain timing impacts). Net sales of our animal health and nutrition products have been dampened due to COVID-19 in certain geographic areas, particularly in China, which has continued to impose restrictions and quarantine requirements in response to COVID-19 outbreaks. We have also experienced an increase in backlog due, in part, to supply chain disruptions, shipping delays and constraints on the availability of labor (including at our suppliers) amidst unprecedented demand for our products. We have put in place measures to reduce the backlog that was generated during fiscal year 2022, including hiring additional labor, adding additional work shifts, improving\noperating productivity in our plants, upgrading our manufacturing facilities and equipment and increasing our overseas freight forwarders.\nAs discussed below in \"Consolidated Results,\" gross profit has declined in fiscal year 2022 compared to fiscal year 2021 related to rising costs and supply chain disruptions. We have faced longer lead times for some of our materials purchases, which have contributed to an increase in our backlog, but we have been able to avoid significant out of stock issues for most of our materials. Where possible, we have found other suppliers to meet the increase in customer demand for our products. In addition, the cost of repair parts has increased but this has not caused any significant disruption to our business. While we have experienced a shortage of production labor at certain times during the fiscal year 2022, which has been a contributing factor to our increase in backlog, we have been able to hire additional labor and reduce our backlog related to production constraints in the third and fourth quarters of fiscal year 2022. We are closely monitoring the continuation, resurgence in certain areas, and effects of COVID-19 on all aspects of our business, including how it has impacted and may impact our suppliers and customers as well as the effects of the pandemic on economic conditions and the financial markets. In general, we have seen an increase in costs, particularly as it relates to commodities as the economy continues to react to, and recover from, the pandemic and demand surpasses supply. We have also seen costs increasing due to inflation. In addition to rising commodity costs and other increased costs described below, several of our suppliers have passed along non-commodity price increases they have experienced in their own businesses. However, we have not experienced any significant interruptions, and we will continue to closely monitor our inventory levels to mitigate the risk of any potential supply interruptions or changes in customer demand. It is possible that significant disruptions could occur if the pandemic and other factors such as labor shortages, ongoing geopolitical tensions, and other strains on the supply chain continue to put pressure on production, transportation, and shipping as a result of an imbalance of supply and demand or if there are continued increases in costs that we are unable to recover. The impacts of COVID-19 and related economic conditions on our future results are uncertain at this time. The scope, duration, and magnitude of the direct and indirect effects of COVID-19 continue to evolve (and in many cases, rapidly) in ways that are difficult or impossible to anticipate. In addition, although COVID-19 has not materially impacted our net sales to date, it remains uncertain whether and how consumers will modify their purchasing habits in response to the ongoing COVID-19 pandemic and/or the lifting or relaxing and/or re-imposition of mandates as various geographies experience resurgences and abatement of the pandemic.\nThe impacts of COVID-19 to our specific operating segments are discussed below.\nRESULTS OF OPERATIONS\nFISCAL YEAR 2022 COMPARED TO FISCAL YEAR 2021\nCONSOLIDATED RESULTS\nConsolidated net sales in fiscal year 2022 reached an all-time high of $348,589,000, an increase of $43,608,000 or 14%, from net sales of $304,981,000 in fiscal year 2021. Net sales increased for both our Retail and Wholesale Products Group and Business to Business Products Group due to an increase in sales volume and higher prices instituted in response to rising costs. The increase in demand for our products during the fiscal year 2022 has led to an increase in our backlog of orders. We have hired additional manufacturing personnel, expanded our production shifts, increased production equipment and made various repairs to equipment in order to reduce our backlog as well as increase our use of alternate modes of transportation. We continue to analyze the constraints on our operations and implement strategies to meet the increase in customer demand. Segment results are discussed further below.\nConsolidated gross profit in fiscal year 2022 was $62,515,000, a decrease of $2,726,000, or 4%, from gross profit of $65,241,000 in the prior fiscal year. Our gross margin (defined as gross profit as a percentage of net sales) in fiscal year 2022 decreased to 18% from 21% in fiscal year 2021. Higher freight, packaging, natural gas, and non-fuel manufacturing costs per ton drove the decrease in gross profit. We continue to experience high freight costs both domestically and with respect to ocean freight. Domestic freight costs per ton, excluding the freight we no longer charge to a significant customer who now picks up its own purchases, increased approximately 27% in fiscal year 2022 compared to fiscal year 2021. The increase relates to higher transportation rates due to an increase in diesel fuel costs, a national driver shortage, and tight trucking capacity. Ocean freight costs have also increased due to rising fuel costs and export fees. In addition, our overall freight costs can vary between periods depending on the mix of products sold and the geographic distribution of our customers. Packaging costs per ton for fiscal year 2022 were approximately 29% higher compared to fiscal year 2021 due to higher commodity costs, particularly as it relates to resin and pallet costs. Many of our contracts for packaging purchases are subject to periodic price adjustments, which trail changes in underlying commodity prices. The cost of natural gas per ton used to operate kilns that dry our clay was 108% higher in fiscal year 2022 compared to fiscal year 2021 due to higher natural gas prices and higher natural gas delivery costs, which are being driven by demand surpassing available supply as well as the impact of the ongoing conflict between Russia and Ukraine and actions taken in response to such conflict. Non-fuel manufacturing costs per ton also increased during fiscal year\n2022 compared to fiscal year 2021 by 11%. The increase in non-fuel manufacturing costs relate to higher repairs, utility costs, labor and benefit costs, and costs of purchased materials. In addition to the above, during fiscal year 2022, several suppliers started to pass along non-commodity price increases related to cost increases experienced in their own businesses and we expect such increases to persist. While we have faced higher costs due to the reasons mentioned above, we continue to strive to restore our historical margins utilizing various strategies including reducing costs where possible, increasing sales volume, and implementing price increases.\nTotal selling, general and administrative expenses (SG&A) were 0.3% lower in fiscal year 2022 compared to fiscal year 2021, effectively flat year over year. An increase in compensation expense was offset by lower pension and other costs. The discussion of each segment's operating income below describe the changes in selling, general and administrative expenses that were allocated to that segment.\nThe loss on impairment of goodwill of $5,644,000 is related to our Retail and Wholesale Products Group reporting unit. Our goodwill impairment test is based on cash flow considerations and other approaches that require significant judgment with respect to volume, revenue, expenses and allocations. We determined that, as a result of lower share prices and the continued adverse impacts of rising costs and additional expenses to prevent supply chain disruptions, and despite improving margins, we had a triggering event during the third quarter of fiscal 2022 that necessitated a goodwill impairment test and resulted in the carrying value of our Retail and Wholesale Products Group reporting unit being higher than its fair value which led to the $5,644,000 impairment charge.\nOther income (expense), net in fiscal year 2021 included approximately $600,000 of settlement expense under our pension plan as further described in Note 8 to the Notes to the Consolidated Financial Statements. No settlement expense was incurred in fiscal 2022. In addition, there was pension income driven by changes in discount rates and census data in fiscal year 2022.\nTax expense for fiscal year 2022 was $97,000 (effective tax rate of 1.7%) compared to $2,388,000 (effective tax rate of 17.7%) in fiscal year 2021. The decrease in tax expense was driven by lower taxable income and additional tax deductions allowed for the mining industry. See Note 5 of the Notes to the Consolidated Financial Statements for additional information about our income taxes.\nThe Company routinely assesses its operating segments. In fiscal year 2022, driven by a change in its management organization, the Company decided to move its wholly-owned subsidiary in the United Kingdom from the Retail and Wholesale Products Group to the Business to Business Products Group. In addition, the co-packaging coarse cat litter business was moved from the Business to Business Products Group to the Retail and Wholesale Products Group. Prior year net sales and operating income have been reclassified to reflect these changes.\nBUSINESS TO BUSINESS PRODUCTS GROUP\nNet sales of the Business to Business Products Group for fiscal year 2022 were $113,379,000, an increase of $16,241,000, or 17%, from net sales of $97,138,000 in fiscal year 2021. Net sales increased in all product categories - agricultural and horticultural products; fluids and purification products; and animal health products. This growth was the result of both price increases and higher demand for our products. Net sales of fluid purification products increased approximately $8,715,000 or 16% in fiscal year 2022 compared with the prior year. The increase in net sales occurred for a variety of reasons, including new customer wins, increased sales to existing customers, increase in air travel in most regions, price increases that were instituted to offset rising costs, and in some cases, timing of net sales. The majority of this increase in net sales was concentrated in North America and Latin America. Revenues in Europe remained relatively flat year over year due to the impact of currency translation on our selling prices as well as ocean freight shipping delays. Net sales of our agricultural and horticultural chemical carrier products increased approximately $4,384,000, or 17%, for fiscal year 2022 compared to fiscal year 2021 as a result of continued strong demand for these products as well as price increases. Net sales of our animal health and nutrition products increased $3,143,000, or 18%, during fiscal year 2022 compared to the prior year driven by increases in North America and Latin America, partially offset by decreases in Mexico and Asia, (excluding China which had a slight increase in net sales as discussed below in \"Foreign Operations\"). The increase in net sales relates to several new customers, a new product line in North America, and in general, timing of when sales occur. Furthermore, our business to Latin America has benefited from the European Union's (\"EU\") new antibiotic-free regulation on foreign protein imports, as a large percentage of meat is exported from that region to the EU. Despite the overall increase in net sales, ocean freight delays and the continuation of COVID-19, particularly in China, which has continued to impose restrictions and quarantine requirements in response to COVID-19 outbreaks, impacted our animal health business during fiscal year 2022. See Foreign Operations below for a discussion of net sales for our foreign operations that sell our animal health and nutrition products.\nSG&A expenses for the Business to Business Products Group increased approximately 23% or $2,628,844 for fiscal year 2022 compared to the prior fiscal year. We continued to invest in our animal health business, which resulted in higher costs due to increased headcount of sales and leadership personnel, increased travel costs, and increased marketing efforts associated with our animal feed additives. The increase in SG&A expenses in fiscal year 2022 also related to an increase in compensation related to additional headcount and a write off of patent applications.\nThe Business to Business Products Groups operating income for fiscal year 2022 was $24,344,000, a decrease of $1,570,000, or 6%, from operating income of $25,914,000 for fiscal year 2021. The decrease in operating income was driven by higher freight, packaging, natural gas, and non-fuel manufacturing costs per ton as discussed in Consolidated Results above as well as higher SG&A expenses during fiscal year 2022.\nRETAIL AND WHOLESALE PRODUCTS GROUP\nNet sales of the Retail and Wholesale Products Group for fiscal year 2022 were $235,210,000, an increase of $27,367,000, or 13%, from net sales of $207,843,000 in fiscal year 2021 driven by both increases in net sales of our cat litter and our industrial and sports products. Total cat litter net sales increased $20,159,000, or 11%, compared to the prior fiscal year. This increase was driven by organic volume growth, expanded distribution, price increases in response to rising costs, and the reduced need for trade spending because of higher demand. Net sales of branded scoopable litter, private label lightweight and heavyweight litter, and accessories (liners) increased in fiscal year 2022 compared to the prior year. Sales to e-commerce distributors were also higher during the fiscal year 2022 compared to fiscal year 2021. Our co-packaged coarse cat litter business experienced an increase of $2,474,300 or 17% in net sales during fiscal year 2022 compared to fiscal year 2021 primarily due to price increases partially offset by a decrease in volume. Also included in the Retail and Wholesale Products Group's results were increased net sales of our industrial and sports products in fiscal year 2022, compared to fiscal year 2021. Net sales of our industrial and sports products increased approximately $7,208,000 or 23% in fiscal year 2022 compared to fiscal year 2021, due to the continued re-opening of businesses and sports fields in fiscal 2022, as well as new customers and an increase in selling price per ton as we continue to respond to rising costs.\nSG&A expenses for the Retail and Wholesale Products Group was lower by approximately $4,520,089, or 26%, during fiscal year 2022 compared to fiscal year 2021 due to lower advertising costs, bad debt expenses and other selling expenses in fiscal year 2022.\nAn impairment of goodwill of $5,644,000 was recognized in the third quarter of fiscal 2022 driven by a third quarter triggering event due to lower share prices and the continued adverse impacts of rising costs and additional expenses to prevent supply chain disruptions.\nThe Retail and Wholesale Products Groups segment operating income for fiscal year 2022 was $6,252,000, a decrease of $4,836,000 or 44%, from operating income of $11,088,000 in fiscal year 2021. The decrease in segment operating income was driven by the goodwill impairment charge recorded in the third quarter of fiscal year 2022 as well as higher freight, packaging, natural gas, and non-fuel manufacturing costs which outpaced the increase in net sales as described in Consolidated Results above.\nFOREIGN SUBSIDIARIES\nForeign operations include our subsidiary in Canada, which is included in the Retail and Wholesale Products Group, and our subsidiaries in the United Kingdom, China, Mexico and Indonesia, which are included in the Business to Business Products Group. Net sales by our foreign subsidiaries during fiscal year 2022 were $19,893,000, an increase of $2,487,000, or 14%, from net sales of $17,406,000 during fiscal year 2021. All of our foreign operations, with the exception of our subsidiary in Mexico, experienced an increase in net sales during fiscal year 2022 compared to fiscal year 2021. Total net sales of our subsidiary in Canada during fiscal year 2022 increased by $2,237,000, or 23%, compared to fiscal year 2021 driven by higher cat litter net sales. Cat litter sales in Canada were $2,610,000 higher during fiscal year 2022 than in fiscal year 2021. The increase in cat litter sales was mainly driven by a key customer carrying three of our products for the first time as well as price increases instituted in response to rising costs. The increase in cat litter sales was partially offset by lower net sales of our industrial absorbent granules in fiscal year 2022 compared to fiscal year 2021. Net sales of industrial absorbent granules were higher in fiscal year 2021 as companies emerged from the constraints of the pandemic and there was a surge in demand. Net sales of our subsidiary in the United Kingdom in fiscal year 2022 increased by $396,000, or 21%, compared to net sales in fiscal year 2021. The increase related to timing of net sales and partly due to demand starting to slowly return post pandemic. Net sales of our subsidiary in Mexico decreased during fiscal year 2022 compared to fiscal year 2021 by $408,000 or 16%, as fiscal year 2021 included net sales of products in that region that are no longer part of our business strategy. Despite the negative impacts of COVID-19 in China, net sales of our subsidiary in China increased $40,000, or 1%, during fiscal year 2022 compared to fiscal year 2021 due primarily to the addition of a new customer. Net sales by our foreign subsidiaries represented 6% of our consolidated net sales for both the fiscal years 2022 and 2021.\nFor fiscal year 2022, our foreign subsidiaries reported a net loss of $756,000, compared to a net loss of $597,000 in fiscal year 2021. The net loss in fiscal year 2022 was primarily driven by unfavorable exchange rates, lower net sales for our subsidiary in Mexico, higher cost of sales, and higher SG&A expenses by our subsidiary in China due to increased sales personnel and marketing of our animal feed additives as we continue to invest in our animal health and nutrition products.\nIdentifiable assets of our foreign subsidiaries as of July 31, 2022 were $12,989,000 compared to $12,572,000 as of July 31, 2021.\nLIQUIDITY AND CAPITAL RESOURCES\nOur principal short and long-term capital requirements include: funding working capital needs; purchasing and upgrading equipment, facilities, information systems, and real estate; supporting new product development; spending on marketing and advertising costs; investing in infrastructure; repurchasing stock; paying dividends; making pension contributions; and, from time to time, business acquisitions. During fiscal year 2022, we principally funded these short and long-term capital requirements using cash from current operations as well as cash generated in the second quarter of fiscal year 2022 from borrowings under our Series Senior C Notes (described below).\nCash and cash equivalents totaled $16,298,000 and $24,591,000 as of July 31, 2022 and 2021, respectively.\nWe currently anticipate cash flows from operations and our available sources of liquidity will be sufficient to meet our cash requirements. In addition, we are actively monitoring the timing and collection of our accounts receivable. Given the dynamic nature of COVID-19 and its effects, as well as the current inflationary environment and impacts of supply chain disruption on our business, we will continue to assess our liquidity needs and to actively manage our spending.\nThe following table sets forth certain elements of our Consolidated Statements of Cash Flows for the fiscal year (in thousands):\n2022 2021\nNet cash provided by operating activities $ 9,838 $ 13,636\nNet cash used in investing activities (22,810) (18,830)\nNet cash provided by (used in) financing activities 4,703 (11,322)\nEffect of exchange rate changes on cash and cash equivalents (24) 217\nNet (decrease) increase in cash and cash equivalents $ (8,293) $ (16,299)\nNet cash provided by operating activities\nIn addition to net income, as adjusted for depreciation and amortization and other non-cash operating activities, the primary sources and uses of operating cash flows for fiscal years 2022 and 2021 were as follows:\nNon-cash stock compensation was $210,000 higher for fiscal 2022 compared to fiscal 2021 due to an increase of stock awards granted in 2022. See Note 7 of the Notes to the Consolidated Financial Statements for further information about stock-based compensation.\nDuring the third quarter of fiscal 2022, we recorded a non-cash goodwill impairment charge of $5,644,000, which left no remaining goodwill in the Retail and Wholesale Products Group reporting unit. See Note 1 of the Notes to the Consolidated Financial Statements for further information about goodwill.\nAccounts receivable, less allowance for doubtful accounts and cash discounts, were $10,881,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021 due primarily to higher sales in the fourth quarter of fiscal 2022 than in the same period in fiscal year 2021. The same measure of accounts receivable was $5,808,000 higher at fiscal year-end 2021 compared to fiscal year-end 2020 due to higher sales in the fourth quarter of fiscal year 2021. Accounts receivable increased in both fiscal years 2022 and 2021 due to the increase in net sales in both periods. In addition, the variation in accounts receivable balances reflect differences in the level and timing of collections as well as the payment terms provided to various customers.\nInventories were $12,109,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021 due primarily to rising costs and building inventory levels to meet demand and thwart potential supply chain disruptions. Inventories were $518,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020 due primarily to higher sales of finished goods offset by increased packaging costs and a lower obsolescence reserve. Packaging costs increased due to anticipated sales demand as well as an increase in the underlying cost of packaging. The lower obsolescence reserve was attributable to our focus on inventory management. See Note 1 of the Notes to the Consolidated Financial Statements for further information regarding our inventory.\nPrepaid expenses were $1,014,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021 driven primarily by higher prepaid insurance costs due to the rising cost of insurance and timing of premium payments. Prepaid expenses were $4,067,000 higher at fiscal year end 2021 compared to fiscal year 2020 due to higher prepayments of income taxes. This increase in fiscal year 2021 was partially offset by lower prepaid advertising costs and insurance.\nDeferred income taxes, less provision for deferred income taxes, were $1,581,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021 and were $5,196,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020. Deferred income taxes were higher at fiscal year-end 2022 due to the election of out of bonus depreciation that the Company took in fiscal year 2021. Deferred income taxes were lower at fiscal year-end 2021 due to certain pension and retirement benefits, accrued expenses, and bonus depreciation on fixed assets. See Note 5 of the Notes to the Consolidated Financial Statements for further information about income taxes.\nOther assets were $2,138,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021 due to an increase in operating lease right-of-use lease assets offset by amortization of said right-of-use assets. Other assets were $544,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020 due to a reduction in our operating right of use lease asset for expiring leases partially offset by higher pre-production costs at certain of our mines.\nAccounts payable were $5,002,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021. Higher trade payables drove the increase in accounts payable in fiscal year 2022. Accounts payable were $2,411,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020. Lower trade payables drove the decrease in accounts payable in fiscal year 2021 as well\nas income taxes payable being in a prepaid position versus a payable position at the end of the fiscal year 2021. Changes in trade accounts payable in all periods are subject to normal fluctuations in the timing of payments, the cost of goods and services we purchased, production volume levels and vendor payment terms.\nAccrued expenses were $4,703,000 higher at fiscal year-end 2022 compared to fiscal year-end 2021 The increase in accrued expenses during the fiscal year 2022 is attributable to a continued increase in freight costs, natural gas prices and salaries and benefits. These increases were somewhat lessened by lower accrued advertising costs. Accrued expenses were $4,097,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020 due primarily to accrued annual discretionary bonus, 401(k) employer match, advertising costs and an accrual for a legal contingency, which is further described in Note 11 of the Notes to the Consolidated Financial Statements. These increases were partially offset by lower accruals for unvouchered freight.\nDeferred compensation balances at fiscal year-end 2022 were $189,000 higher compared to fiscal year-end 2021 and fiscal year-end 2021 was $770,000 lower compared to fiscal year-end 2020. Deferred compensation increased in fiscal 2022 because of higher deferrals by participants in our deferred compensation plans. Deferred compensation balances were lower at fiscal year-end 2021 due to the termination and subsequent pay-out of one of our plans, the Supplemental Executive Retirement Plan, as further discussed in Note 9 to the Notes to the Consolidated Financial Statements.\nPension and other postretirement liabilities, net of the adjustment recorded in stockholders' equity, were $1,938,000 lower at fiscal year-end 2022 compared to fiscal year-end 2021 due to a higher discount rate and change in census data. These liabilities were $2,652,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020 due to reduced service expense related to the Pension Plan which was frozen in fiscal year 2020 as well as a higher discount rate and change in census data. See Note 8 of the Notes to the Consolidated Financial Statements for more information regarding our postretirement benefit plans.\nOther liabilities were $2,799,000 lower at fiscal year-end 2022 compared to fiscal year-end 2021. The decrease in Other liabilities relates to a payment of payroll taxes deferred by the CARES Act during fiscal 2022, payments made against our operating lease liability, partially offset by an increase in reclamation liability due to increased mining activity. Other liabilities were $557,000 lower at fiscal year-end 2021 compared to fiscal year-end 2020. The decrease in other liabilities relates to a reduction in our operating lease liability, partly offset by an increase in our reclamation liability due to increased mining activity and an increase in deferral of employer taxes under the CARES Act as further described in Note 1 of the Notes to the Consolidated Financial Statements.\nNet cash used in investing activities\nCash used in investing activities was $22,810,000 in fiscal year 2022 and cash used in investing activities was $18,830,000 in fiscal year 2021. Cash used in fiscal year 2022 related primarily to the purchases of capital expenditures at levels comparably higher to fiscal year 2021. During fiscal year 2022, we expanded our plant equipment and improved our facilities to support increased demand for our products as well as made improvements to our IT network. Cash used in fiscal year 2021 related chiefly to capital expenditures. The increase in our capital expenditures in fiscal year 2021 compared to fiscal year 2020 relates to purchases of equipment to support our increased mining and hauling activity.\nNet cash provided by (used in) financing activities\nCash provided in financing activities was $4,703,000 in fiscal year 2022 and cash used in financing activities was $11,322,000 in fiscal year 2021. During fiscal year 2022, we issued $25,000,000 in aggregate principal amount of our 3.25% Series C Senior Notes, which provided cash for operations. The primary uses of cash used in financing activities in all periods were for long-term debt, dividend payments, and stock purchases offset by borrowings as further described in Note 3 of the Notes to the Consolidated Financial Statements.\nOther\nTotal cash and investment balances held by our foreign subsidiaries as of July 31, 2022 and 2021 were $3,260,000 and $3,054,000, respectively. See further discussion in the Foreign Operations section above.\nOn January 31, 2019, we signed a fifth amendment to our credit agreement with BMO Harris, which expires on January 31, 2024. The new agreement provides for a $45,000,000 unsecured revolving credit agreement, including a maximum of $10,000,000 for letters of credit. The remaining terms were substantially unchanged from our previous agreement with BMO Harris, including the provision that we may select a variable rate based on either BMO Harris prime rate or a LIBOR-based rate, plus a margin which varies depending on our debt to earnings ratio, or a fixed rate as agreed between us and BMO Harris.\nAs of July 31, 2022, the variable rates would have been 5.75% for the BMO Harris prime-based rate or 4.04% for the LIBOR-based rate. The credit agreement contains restrictive covenants that, among other things and under various conditions, limit our ability to incur additional indebtedness or to dispose of assets. The agreement also requires us to maintain a minimum fixed coverage ratio and a minimum consolidated net worth. As of July 31, 2022 and 2021, we were in compliance with its covenants. As of July 31, 2022 and 2021, there were no outstanding borrowings under this credit agreement. See Note 13 of the Notes to the Consolidated Financial Statements for further information regarding our debt agreement.\nSee Note 3 and Note 13 of the Notes to the Consolidated Financial Statements for information about our outstanding notes payable and a discussion of the debt instrument that we entered into on May 15, 2020 pursuant to which, among other things, we issued $10,000,000 in aggregate principal amount of our 3.95% Series B Senior Notes due May 15, 2030 and entered into an amended note agreement that provides the Company with the ability to request, from time to time until May 15, 2023 (or such earlier date as provided for in the agreement), additional senior unsecured notes of the Company in an aggregate principal amount of up to $75,000,000 minus the aggregate principal amount of the notes then outstanding and the additional notes that have been accepted for purchase. The issuance of such additional notes is at the discretion of the noteholders and purchasers and on an uncommitted basis.\nAs of July 31, 2022, we had remaining authority to repurchase 436,526 shares of Common Stock and 273,100 shares of Class B Stock under a repurchase plan approved by our Board of Directors (the Board). Repurchases may be made on the open market (pursuant to Rule 10b5-1 plans or otherwise) or in negotiated transactions. The timing and number of shares repurchased will be determined by our management pursuant to the repurchase plan approved by our Board. In fiscal years 2021 and 2022 we made repurchases of stock as further discussed in Item 5, Market for Registrant's Common Equity, Related Stockholders Matters and Issuer Purchases of Equity Securities.\nWe believe that cash flow from operations, availability under our revolving credit facility, current cash balances and our ability to obtain other financing, if necessary, will provide adequate cash funds for foreseeable working capital needs, capital expenditures at existing facilities, deferred compensation payouts, dividend payments and debt service obligations for at least the next 12 months. We spent approximately $4,619,000 less for advertising in fiscal year 2022 compared to fiscal year 2021. We spent approximately $1,023,000 less for advertising in fiscal year 2021 compared to fiscal year 2020. We expect advertising expense in fiscal year 2023 to be higher than in fiscal year 2022 and more in line with pre-COVID spending levels. Our expenditures for capital were higher in fiscal year 2022 compared to fiscal year 2021 and also higher in fiscal year 2021 compared to fiscal year 2020. The increased capital expenditures did not dramatically impact our cash position; however our cash requirements are subject to change as business conditions warrant and opportunities arise.\nWe continually evaluate our liquidity position and anticipated cash needs, as well as the financing options available to obtain additional cash reserves. Our ability to fund operations, to make planned capital expenditures, to make scheduled debt payments, to contribute to our pension plan and to remain in compliance with all financial covenants under debt agreements, including, but not limited to, the current credit agreement, depends on our future operating performance, which, in turn, is subject to prevailing economic conditions and to financial, business and other factors. The timing and size of any new business ventures or acquisitions that we complete may also impact our cash requirements.\nOFF BALANCE SHEET ARRANGEMENTS\nWe do not have any unconsolidated special purpose entities. As of July 31, 2022, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. The term off-balance sheet arrangement generally means any transaction, agreement or other contractual arrangement to which an entity unconsolidated with us is a party, under which we have: (i) any obligation arising under a guarantee contract, derivative instrument or variable interest; or (ii) a retained or contingent interest in assets transferred to such entity or similar arrangement that serves as credit, liquidity or market risk support for such assets.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nManagements discussion and analysis of the financial condition and results of operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with the generally accepted accounting principles of the United States (U.S. GAAP). We review our financial reporting and disclosure practices and accounting policies annually to ensure that our financial reporting and disclosures provide accurate and transparent information relative to the current economic and business environment. We believe that, of our significant accounting policies stated in Note 1 of the Notes to the Consolidated Financial Statements, the policies listed below involve a higher degree of judgment and/or complexity. The preparation of the financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, as well as the reported amounts of revenues and expenses during the reporting period. Significant estimates include income taxes, promotional programs, pension accounting and allowance for doubtful accounts. Actual results could differ from these estimates.\nIncome Taxes. Our effective tax rate on earnings was based on income, statutory tax rates and tax planning opportunities available to us in various jurisdictions in which we operate. Significant judgment was required in determining our effective tax rate and in evaluating our tax positions.\nWe determine our current and deferred taxes in accordance with Accounting Standards Codification (ASC) 740 Income Taxes. The tax effect of the expected reversal of tax differences was recorded at rates currently enacted for each jurisdiction in which we operate. To the extent that temporary differences will result in future tax benefit, we must estimate the timing of their reversal and whether taxable operating income in future periods will be sufficient to fully recognize any deferred tax assets.\nWe maintain valuation allowances where it is likely that all or a portion of a deferred tax asset will not be realized. Changes in valuation allowances from period to period are included in the income tax provision in the period of change. In determining whether a valuation allowance is warranted, we take into account such factors as prior earnings history, expected future earnings and other factors that could affect the realization of deferred tax assets.\nWe recorded valuation allowances of $1,761,000 and $1,362,000 for the amount of the deferred tax benefit related to our foreign net operating loss carryforwards as of July 31, 2022 and 2021, respectively, because we believe it is unlikely we will realize the benefit of these tax attributes in the future.\nIn addition to valuation allowances, we may provide for uncertain tax positions when such tax positions do not meet certain recognition thresholds or measurement standards. Amounts for uncertain tax positions are adjusted when new information becomes available or when positions are effectively settled. We did not record a liability for unrecognized tax benefits at either July 31, 2022 or 2021. See Note 5 of the Notes to the Consolidated Financial Statements for further discussion.\nTrade Promotions. We routinely commit to one-time or ongoing trade promotion programs in our Retail and Wholesale Products Group. Promotional reserves are provided for sales incentives made directly to consumers, such as coupons, and sales incentives made to customers, such as slotting, discounts based on sales volume, cooperative marketing programs and other arrangements. All such trade promotion costs are netted against sales. Promotional reserves are established based on our best estimate of the amounts necessary to settle future and existing claims on products sold as of the balance sheet date. To estimate trade promotion reserves, we rely on our historical experience of trade spending patterns and that of the industry, current trends and forecasted data. While we believe our promotional reserves are reasonable and that appropriate judgments have been made, estimated amounts could differ from future obligations. We have accrued liabilities at the end of each period for the estimated trade spending programs. We recorded liabilities of approximately $1,180,000 and $1,653,000 for trade promotions as of July 31, 2022 and 2021, respectively.\nPension and Postretirement Benefit Costs. We calculate our pension and postretirement health benefit obligations and the related effects on results of operations using actuarial models. To measure the expense and obligations, we must make a variety of estimates including critical assumptions for the discount rate used to value certain liabilities and the expected return on plan assets set aside to fund these costs. We evaluate these critical assumptions at least annually. Other assumptions involving demographic factors, such as retirement age, mortality and turnover, are evaluated periodically and are updated to reflect actual experience. As these assumptions change from period to period, recorded pension and postretirement health benefit amounts and funding requirements could also change. Actual results in any given year will often differ from actuarial assumptions because of economic and other factors.\nThe discount rate is the rate assumed to measure the single amount that, if invested at the measurement date in a portfolio of high-quality debt instruments, would provide the necessary future cash flows to pay the pension benefits when due. The discount rate is subject to change each year. We refer to an applicable index and the expected duration of the benefit payments to select a discount rate at which we believe the benefits could be effectively settled. The discount rate was the single equivalent rate that would yield the same present value as the plans expected cash flows discounted with spot rates on a yield curve of investment-grade corporate bonds. The yield curve used in both fiscal years 2022 and 2021 was the FTSE Pension Discount Curve (formerly called the Citi Pension Discount Curve). Our determination of pension expense or income is based on a market-related valuation of plan assets, which is the fair market value. Our expected rate of return on plan assets is determined based on asset allocations and historical experience. The expected long-term rate of inflation and risk premiums for the various asset categories are based on general historical returns and inflation rates. The target allocation of assets is used to develop a composite rate of return assumption. See Note 8 of the Notes to the Consolidated Financial Statements for additional information.\nAs further described in Note 8 of the Notes to the Consolidated Financial Statements, we amended and froze participation in our pension plan and supplemental executive retirement plan in the second quarter of fiscal year 2020. The amendment of these plans triggered a curtailment, which required a remeasurement of the plans obligations. Both of these remeasurements were based on actuarially determined amounts. In addition, we offered terminated participants with vested benefits who have not yet begun receipt of benefits under the pension plan the opportunity to receive their pension benefits in a single payment (the Lump Sum Option). We made payments to those participants in the pension plan who elected the Lump Sum Option by the May 15, 2020 election deadline. This settlement of the pension plan was completed in fiscal year 2021 when we purchased an annuity.\nTrade Receivables. We recognize trade receivables when control of finished products are transferred to our customers. We record an allowance for credit losses based on our expectations and a periodic review of our accounts receivable, including a review of the overall aging of accounts, consideration of customer credit risk and analysis of facts and circumstances about specific accounts. A customer account is determined to be uncollectible when it is probable that a loss will be incurred after we have completed our internal collection procedures, including termination of shipments, direct customer contact and formal demand of payment. We believe our allowance for doubtful accounts is reasonable; however, the unanticipated default by a customer with a material trade receivable could occur. We also record an estimated allowance for cash discounts offered in our payment terms to some customers. We recorded a total allowance for credit losses and cash discounts of $922,000 and $1,174,000 as of July 31, 2022 and 2021, respectively.\nRevenue Recognition. We recognize revenue when performance obligations under the terms of the contracts with customers are satisfied. Our performance obligation generally consists of the promise to sell finished products to wholesalers, distributors and retailers or consumers and our obligations have an original duration of one year or less. Control of the finished products are transferred upon shipment to, or receipt at, customers' locations, as determined by the specific terms of the contract. We have completed our performance obligation when control is transferred and we recognize revenue accordingly. Taxes collected from customers and remitted to governmental authorities are excluded from net sales. Sales returns are not material nor are warranties and any related obligations.\nInventories. We value inventories at the lower of cost (first-in, first-out) or net realizable value. Inventory costs include the cost of raw materials, packaging supplies, labor and other overhead costs. We perform a detailed review of our inventory to determine if a reserve adjustment is necessary, giving consideration to obsolescence, inventory levels, product deterioration and other factors. The review also surveys all of our operating facilities and sales divisions to give consideration to historic and new market trends. The inventory reserve values as of July 31, 2022 and 2021 were $842,000 and $641,000, respectively.\nReclamation. During the normal course of our mining process we remove overburden and perform on-going reclamation activities. As overburden is removed from a mine site, it is hauled to a previously mined site and used to refill older sites. This process allows us to continuously reclaim older mine sites and dispose of overburden simultaneously, therefore minimizing the costs associated with the reclamation process. On an annual basis we evaluate our potential reclamation liability in accordance with ASC 410, Asset Retirement and Environmental Obligations. As of July 31, 2022 and 2021, we have recorded an estimated net reclamation asset of $1,799,000 and $1,152,000, respectively, and a corresponding estimated reclamation liability of $3,807,000 as of July 31, 2022 and $2,965,000 as of July 31, 2021. These values represent the discounted present value of the estimated future mining reclamation costs at the production plants. The reclamation assets are depreciated over the estimated useful lives of the various mines. The reclamation liabilities are increased based on a yearly accretion charge over the estimated useful lives of the mines.\nAccounting for reclamation obligations requires that we make estimates unique to each mining operation of the future costs we will incur to complete the reclamation work required to comply with existing laws and regulations. Actual future costs incurred could significantly differ from estimated amounts. Future changes to environmental laws could increase the extent of reclamation work required. Any such increases in future costs could materially impact the amount incurred for reclamation costs.\nImpairment of goodwill, trademarks and other intangible assets. We review carrying values of goodwill, trademarks and other indefinite-lived intangible assets periodically for possible impairment in accordance ASC 350, Intangibles - Goodwill and Other. Our impairment review requires significant judgment with respect to factors such as volume, revenue and expenses. Impairment occurs when the carrying value exceeds the fair value. Our impairment analysis is performed in the fourth quarter of the fiscal year and may be re-performed during the year when indicators such as unexpected adverse economic factors, unanticipated technological changes, competitive activities and acts by governments and courts indicate that an asset may become impaired. We determined that, as a result of lower share prices and the continued adverse impacts of rising costs and additional expenses to prevent supply chain disruptions, we had a triggering event during the third quarter of fiscal year 2022 that necessitated a goodwill impairment test. We performed a goodwill impairment test on our Retail and Wholesale Products Group and Business to Business Products Group reporting units and determined that the carrying value of our Retail and Wholesale Products Group reporting unit was higher than its fair value. As a result, we recorded goodwill impairment of $5,644,000, which left no remaining goodwill in the Retail and Wholesale Products Group reporting unit. We also performed a quantitative impairment analysis on the Business to Business Products Group reporting unit and concluded there was excess fair value over carrying value, therefore no impairment was recorded on this reporting unit. We continue to monitor events, circumstances or changes in the business that might imply a reduction in value which could lead to an impairment. In addition, although we have not identified any additional triggering events relating to goodwill or our intangibles, the ultimate effects of COVID-19 could change this assessment in the future, as outlined under Item 1A, Risk Factors, discussed above.\nNEW ACCOUNTING PRONOUNCEMENTS\nRecently Issued Accounting Standards\nIn March 2020, the FASB issued guidance under ASC 848, Reference Rate Reform. This guidance provides optional expedients and exceptions to account for debt, leases, contracts, hedging relationships and other transactions that reference LIBOR or another reference rate if certain criteria are met. The guidance is effective immediately and may be applied prospectively to contract modifications made and hedging relationships entered into or evaluated on or before December 31, 2022. We have debt agreements that reference LIBOR and to the extent that those agreements are modified to replace LIBOR with another interest rate index, ASC 848 will allow us to account for the modification as a continuation of the existing contract without additional analysis. The impact of adopting this requirement is not material to our Consolidated Financial Statements.\nIn December 2019, the FASB issued guidance under ASC 740, Income Taxes, which simplifies the accounting for income taxes. The guidance removes several specific exceptions to the general principles in ASC 740 and clarifies and makes amendments to improve consistent application of and simplify existing accounting for other areas in ASC 740. We implemented this guidance effective for our first quarter of fiscal year 2022. The impact of adopting this requirement is not material to our Consolidated Financial Statements.\nIn June 2016, the FASB issued guidance under ASC 326, Financial Instruments-Credit Losses, which requires companies to utilize an impairment model for most financial assets measured at amortized cost and certain other financial instruments, which include trade and other receivables, loans and held-to-maturity debt securities, to record an allowance for credit risk based on expected losses rather than incurred losses. In addition, this new guidance changes the recognition method for credit losses on available-for-sale debt securities, which can occur as a result of market and credit risk, as well as additional disclosures. In general, this guidance will require modified retrospective adoption for all outstanding instruments that fall under this guidance. Early adoption is permitted, and we adopted this standard for the evaluation of bad debt reserves at July 31, 2022. Accordingly, this guidance is effective for our first quarter of fiscal year 2023. The impact of adopting this requirement is not material to our Consolidated Financial Statements.\nA summary of all recently adopted and issued accounting standards is contained in Note 1 of Notes to the Consolidated Financial Statements.  ITEM 8 - FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nOIL-DRI CORPORATION OF AMERICA\nCONSOLIDATED BALANCE SHEETS\nJuly 31,\n2022 2021\nASSETS (in thousands)\nCurrent Assets\nCash and cash equivalents $ 16,298 $ 24,591\nAccounts receivable, less allowance of $922 and $1,174\nin 2022 and 2021, respectively\n51,683 40,923\nInventories, net 35,562 23,598\nPrepaid repairs expense 7,474 6,088\nPrepaid expenses and other assets 3,664 6,742\nTotal Current Assets 114,681 101,942\nProperty, Plant and Equipment\nBuildings and leasehold improvements 40,294 40,181\nMachinery and equipment 165,350 162,930\nOffice furniture and equipment 17,524 21,685\nVehicles 15,470 17,543\nGross depreciable assets 238,638 242,339\nLess accumulated depreciation and amortization (175,374) (178,885)\nNet depreciable assets 63,264 63,454\nConstruction in progress 24,496 14,627\nLand and mineral rights 20,106 17,859\nTotal Property, Plant and Equipment, Net 107,866 95,940\nOther Assets\nGoodwill 3,618 9,262\nTrademarks and patents, net of accumulated amortization\nof $524 and $385 in 2022 and 2021, respectively\n1,445 1,743\nCustomer list, net of accumulated amortization\nof $7,608 and $7,321 in 2022 and 2021, respectively\n177 464\nDeferred income taxes 3,677 2,096\nOperating lease right-of-use assets 10,601 8,619\nOther 7,546 7,500\nTotal Other Assets 27,064 29,684\nTotal Assets $ 249,611 $ 227,566\nOIL-DRI CORPORATION OF AMERICA\nCONSOLIDATED BALANCE SHEETS\n(continued)\nJuly 31,\n2022 2021\nLIABILITIES AND STOCKHOLDERS EQUITY (in thousands)\nCurrent Liabilities\nCurrent maturities of notes payable $ 1,000 $ 1,000\nAccounts payable 13,401 9,206\nDividends payable 1,851 1,865\nOperating lease liabilities 2,178 2,036\nAccrued expenses 30,085 24,883\nTotal Current Liabilities 48,515 38,990\nNoncurrent Liabilities\nNotes payable, net of unamortized debt issuance costs of $202 and $122 in 2022 and 2021, respectively\n31,798 7,878\nDeferred compensation 4,559 4,370\nPension and postretirement benefits 798 4,922\nLong-term operating lease liabilities 9,749 8,022\nOther 3,843 4,152\nTotal Noncurrent Liabilities 50,747 29,344\nTotal Liabilities 99,262 68,334\nStockholders Equity\nCommon Stock, par value $.10 per share, issued 8,686,768 shares in 2022 and 8,561,311 shares in 2021\n868 856\nClass B Stock, convertible, par value $.10 per share, issued 2,397,056 shares in 2022 and 2,397,056 shares in 2021\n240 240\nAdditional paid-in capital 52,467 48,271\nRetained earnings 178,754 180,443\nNoncontrolling interest (369) (307)\nAccumulated Other Comprehensive Loss\nPension and postretirement benefits (2,242) (4,428)\nCumulative translation adjustment 59 311\nTotal Accumulated Other Comprehensive Loss (2,183) (4,117)\nLess treasury stock, at cost (3,609,938 Common and 351,641 Class B shares in 2022 and 3,192,702 Common and 346,491 Class B shares in 2021)\n(79,428) (66,154)\nTotal Stockholders Equity 150,349 159,232\nTotal Liabilities and Stockholders Equity $ 249,611 $ 227,566\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nOIL-DRI CORPORATION OF AMERICA\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended July 31,\n2022 2021\n(in thousands, except for per share data)\nNet Sales $ 348,589 $ 304,981\nCost of Sales (286,074) (239,740)\nGross Profit 62,515 65,241\nSelling, General and Administrative Expenses (1) (52,050) (52,205)\nLoss on Impairment of Goodwill (5,644) -\nIncome from Operations 4,821 13,036\nOther Income (Expense)\nInterest income 45 71\nInterest expense (1,228) (722)\nForeign exchange loss (303) (93)\nOther, net (2) 2,374 1,076\nTotal Other Income (Expense), Net 888 332\nIncome Before Income Taxes 5,709 13,368\nIncome Tax Expense (97) (2,388)\nNet Income $ 5,612 $ 10,980\nNet Loss Attributable to Noncontrolling Interest (62) (133)\nNet Income Attributable to Oil-Dri 5,674 11,113\nNet Income Per Share\nBasic Common $ 0.83 $ 1.61\nBasic Class B Common $ 0.63 $ 1.20\nDiluted Common $ 0.81 $ 1.57\nDiluted Class B Common $ 0.62 $ 1.18\nAverage Shares Outstanding\nBasic Common 4,987 5,142\nBasic Class B Common 1,934 1,926\nDiluted Basic Common 5,099 5,253\nDiluted Basic Class B Common 1,962 1,967\n(1) See Note 9 of the Notes to the Consolidated Financial Statements for further information about amounts included in this line item.\n(2) See Note 8 of the Notes to the Consolidated Financial Statements for further information about amounts included in this line item.\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nOIL-DRI CORPORATION OF AMERICA\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended July 31,\n2022 2021\n(in thousands)\nNet Income Attributable to Oil-Dri $ 5,674 $ 11,113\nOther Comprehensive Income (Loss):\nPension and postretirement benefits (net of tax) 2,186 7,566\nCumulative translation adjustment (252) 571\nOther Comprehensive Income 1,934 8,137\nComprehensive Income $ 7,608 $ 19,250\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nOIL-DRI CORPORATION OF AMERICA\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nNumber of Shares (in thousands)\nCommon\n& Class B\nStock Treasury\nStock Common\n& Class B\nStock Additional\nPaid-In\nCapital Retained\nEarnings Treasury\nStock Accumulated\nOther\nComprehensive\nLoss Non-Controlling Interest Total\nStockholders\nEquity\nBalance, July 31, 2020 10,886,405 (3,426,046) $ 1,089 $ 44,993 $ 176,579 $ (62,269) $ (12,254) $ (174) $ 147,964\nNet income (loss) - - - - 11,113 - - (133) 10,980\nOther comprehensive income - - - - - - 8,137 - 8,137\nDividends declared\n- - - - (7,249) - - - (7,249)\nPurchases of treasury stock\n- (87,647) - - - (3,130) - - (3,130)\nNet issuance of stock under long-term incentive plans\n71,962 (25,500) 7 747 - (755) - - (1)\nAmortization of restricted stock - - - 2,531 - - - - 2,531\nBalance, July 31, 2021 10,958,367 (3,539,193) $ 1,096 $ 48,271 $ 180,443 $ (66,154) $ (4,117) $ (307) $ 159,232\nNet income (loss) - - - - 5,674 - - (62) 5,612\nOther comprehensive income - - - - - - 1,934 - 1,934\nDividends declared - - - - (7,363) - - - (7,363)\nPurchases of treasury stock\n- (379,586) - - - (11,806) - - (11,806)\nNet issuance of stock under long-term incentive plans\n125,457 (42,800) 12 1,455 - (1,468) - - (1)\nAmortization of restricted stock - - - 2,741 - - - - 2,741\nBalance, July 31, 2022 11,083,824 (3,961,579) $ 1,108 $ 52,467 $ 178,754 $ (79,428) $ (2,183) $ (369) $ 150,349\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nOIL-DRI CORPORATION OF AMERICA\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear-Ended July 31,\n2022 2021\n(in thousands)\nCash Flows from Operating Activities\nNet income $ 5,612 $ 10,980\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 13,474 14,177\nNon-cash stock compensation expense 2,741 2,531\nProvision for deferred income taxes (2,296) 2,760\nProvision for bad debts and cash discounts (227) 147\nLoss on impairment of goodwill 5,644 -\nLoss on impairment of patent applications 323 -\nLoss on the disposals of property, plant and equipment 334 52\n(Increase) decrease in:\nAccounts receivable (10,654) (5,955)\nInventories (12,109) 518\nPrepaid expenses (1,014) (4,067)\nDeferred income taxes 715 2,436\nOther assets 2,138 544\nIncrease (decrease) in:\nAccounts payable 5,002 (2,411)\nAccrued expenses 4,703 (4,097)\nDeferred compensation 189 (770)\nPension and postretirement benefits (1,938) (2,652)\nOther liabilities (2,799) (557)\nTotal Adjustments 4,226 2,656\nNet Cash Provided by Operating Activities 9,838 13,636\nCash Flows from Investing Activities\nCapital expenditures (22,831) (18,839)\nProceeds from sale of property, plant and equipment 21 9\nNet Cash Used in Investing Activities (22,810) (18,830)\nCash Flows from Financing Activities\nProceeds from issuance of notes payable 25,000 -\nPrincipal payments on notes payable (1,000) (1,000)\nPayment of debt issuance costs (114) -\nDividends paid (7,377) (7,192)\nPurchase of treasury stock (11,806) (3,130)\nNet Cash Provided by (Used in) Financing Activities 4,703 (11,322)\nEffect of exchange rate changes on cash and cash equivalents (24) 217\nNet Decrease in Cash and Cash Equivalents (8,293) (16,299)\nCash and Cash Equivalents, Beginning of Year 24,591 40,890\nCash and Cash Equivalents, End of Year $ 16,298 $ 24,591\nCONSOLIDATED STATEMENTS OF CASH FLOWS - CONTINUED\nYear-Ended July 31,\n2022 2021\n(in thousands)\nSupplemental disclosure:\nOther cash flows:\nInterest payments, net of amounts capitalized $ 767 $ 400\nIncome tax (refunds) payments $ (178) $ 6,151\nRight-of-use assets obtained in exchange for new operating lease liabilities $ 4,377 $ 1,036\nNoncash investing and financing activities:\nCapital expenditures accrued, but not paid $ 3,558 $ 1,926\nCash dividends declared and accrued, but not paid $ 1,851 $ 1,865\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nOIL-DRI CORPORATION OF AMERICA\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNATURE OF OPERATIONS\nWe are a leader in developing, manufacturing and/or marketing sorbent products. Our sorbent products are principally produced from clay minerals. Our absorbent clay products include cat litter, industrial floor absorbents, agricultural chemical carriers and animal feed additives. Our adsorbent products include bleaching clays, which are used for filtration of edible oils and for purification of petroleum-based oils. We also sell synthetic sorbents, which are used for industrial cleanup.\nPRINCIPLES OF CONSOLIDATION\nThe Consolidated Financial Statements include the accounts of Oil-Dri Corporation of America and its subsidiaries. All significant intercompany balances and transactions have been eliminated from the Consolidated Financial Statements.\nRECLASSIFICATION\nCertain amounts in the prior period financial statements have been reclassified to conform to the presentation of the current period financial statements. These immaterial reclassifications had no effect on the previously reported net income or cash flows.\nMANAGEMENT USE OF ESTIMATES\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, and disclosure of contingent assets and liabilities as of the date of the financial statements and the reported amounts of revenues and expenses during the reporting period as well as the related disclosures. Estimates and assumptions about future events cannot be made with certainty, including the potential impacts and duration of COVID-19 and its aftermath. All of our estimates and assumptions are revised periodically. Actual results could differ from these estimates. For more information see Critical Accounting Policies and Estimates in Item 7 Management's Discussion and Analysis of Financial Condition and Results of Operations.\nThe effects of the COVID-19 pandemic continues to impact business activity across industries in the U.S. and worldwide, including, but not limited to, workforce and supply chain disruptions. The Company remains committed to taking actions to address the health, safety and welfare of its employees, customers, agents and suppliers. Future developments, such as the actions taken by governmental authorities in response to future outbreaks that are highly uncertain and unpredictable, will determine the extent to which COVID-19 and its effects continue to impact the Companys results of operations and financial conditions. See the risk factor captioned Our business could be adversely affected by a widespread threat to public health,\" in Item 1A, Risk Factors, included in Part I of this Annual Report on Form 10-K for an additional discussion of risks related to COVID-19.\nCASH AND CASH EQUIVALENTS\nCash equivalents are highly liquid investments with maturities of three months or less.\nTRADE RECEIVABLES\nWe recognize trade receivables when control of finished products are transferred to our customers. We record an allowance for credit losses based on our expectations and a periodic review of our accounts receivable, including a review of the overall aging of accounts, consideration of customer credit risk and analysis of facts and circumstances about specific accounts. A customer account is determined to be uncollectible when it is probable that a loss will be incurred after we have completed our internal collection procedures, including termination of shipments, direct customer contact and formal demand of payment. We retain outside collection agencies to facilitate our collection efforts. Past due status is determined based on contractual terms and customer payment history.\nINVENTORIES\nThe composition of inventories was as follows as of July 31 (in thousands):\n2022 2021\nFinished goods $ 18,142 $ 14,179\nPackaging 9,515 5,084\nOther 7,905 4,335\nInventories $ 35,562 $ 23,598\nInventories are valued at the lower of cost (first-in, first-out) or net realizable value. Inventory costs include the cost of raw materials, packaging supplies, labor and other overhead costs. We performed a detailed review of our inventory items to determine if an obsolescence reserve adjustment was necessary. The review surveyed all of our operating facilities and sales groups to ensure that both historical issues and new market trends were considered. The obsolescence reserve not only considered specific items, but also took into consideration the overall value of the inventory as of the balance sheet date. We recorded inventory obsolescence reserves of approximately $842,000 and $641,000 as of July 31, 2022 and 2021, respectively. The higher obsolescence reserve is attributed to our focus on inventory management. The other category of inventories includes a variety of items including clay, additives, fragrances and other supplies and increased from July 31, 2021 due to increased supply chain issues. Finished goods inventory increased due to sales volume. Packaging inventories increased from July 31, 2021 due to anticipated sales demand as well as an increase in the cost of packaging.\nTRANSLATION OF FOREIGN CURRENCIES\nAssets and liabilities of foreign subsidiaries, where the local currency is the functional currency, are translated to U.S. Dollars at the exchange rates in effect at period end. Income statement items are translated at the average exchange rate on a monthly basis. Resulting translation adjustments are recorded as a separate component of stockholders equity.\nINTANGIBLES AND GOODWILL\nWe amortize most of our intangibles on a straight-line basis over periods ranging from 4 to 20 years. Our customer list intangible asset is amortized at an accelerated amortization rate in the earlier years to reflect the expected pattern of decline in the related benefits over time. Intangible amortization was $490,000 in fiscal year 2022 and $680,000 in fiscal year 2021. Some intangible assets were determined to have indefinite lives and are not amortized, specifically one acquired trademark recorded at $376,000.\nOur estimated intangible amortization expense for the next five fiscal years is as follows (in thousands):\n2023 $ 265\n2024 $ 129\n2025 $ 104\n2026 $ 101\n2027 $ 99\nThe weighted average amortization period of our intangibles subject to amortization is as follows (in years):\nWeighted Average Amortization Period\nTrademarks and patents 12.0\nCustomer list 1.3\nTotal intangible assets subject to amortization 9.4\nWe periodically review indefinite-lived intangibles and goodwill to assess for impairment. Our review is based on cash flow considerations and other approaches that require significant judgment with respect to volume, revenue, expenses and allocations. Impairment occurs when the carrying value exceeds the fair value. Much of our goodwill cannot be specifically assigned to one of our operating segments because of the shared nature of our production facilities; however, for purposes of\nour most recent impairment analysis we estimated the goodwill allocation and assigned $0 to the Retail and Wholesale Products Group and $3,618,000 to the Business to Business Products Group.\nDuring the third quarter of fiscal 2022, we determined, as a result of lower share prices and the continued adverse impacts of rising costs and additional expenses to prevent supply chain disruptions, that we had a triggering event that necessitated a goodwill impairment test. In the third quarter, we performed a goodwill impairment test on our Retail and Wholesale Products Group and Business to Business Products Group reporting units and determined that the carrying value of our Retail and Wholesale Products Group reporting unit was higher than its fair value. As a result, we recorded goodwill impairment of $5,644,000, which left no remaining goodwill in the Retail and Wholesale Products Group reporting unit. We performed our annual impairment testing in the fourth quarter of fiscal years 2022 and 2021. There was no additional impairment required based on our analysis for the fourth quarter of fiscal year 2022. We will continue to consider the need to re-perform impairment testing throughout the year when circumstances such as unexpected adverse economic factors, unanticipated technological changes, competitive activities and acts by governments and courts indicate that an asset may become impaired. In addition, although we have not identified any triggering events relating to goodwill or our intangibles, the ultimate effects of COVID-19 could change this assessment in the future, as outlined under Item 1A, Risk Factors, discussed above.\nOVERBURDEN REMOVAL AND MINING COSTS\nWe surface mine sorbent minerals on property that we either own or lease as part of our overall operations. A significant part of our overall mining cost is incurred during the process of removing the overburden from the mine site, thus exposing the sorbent material used in a majority of our production processes. These stripping costs incurred during production are treated as a variable inventory production cost and are included in cost of sales in the period they are incurred. Stripping costs included in cost of sales were approximately $2,703,000 and $1,920,000 for fiscal years 2022 and 2021, respectively. Pre-production overburden removal costs associated with opening a new mine during the development phase are deferred. Total pre-production costs, including the overburden removal costs, that were capitalized in fiscal years 2022 and 2021 were $1,279,000 and $1,810,000 respectively. Capitalized development costs are amortized when the sorbent material is removed from the mine and used to produce product for sale. At the end of fiscal year 2022, the amount of development costs that are being amortized is $2,037,000.\nAdditionally, it is our policy to capitalize the purchase cost of land and mineral rights, including associated legal fees, survey fees and real estate fees. The costs of obtaining mineral rights, including legal fees and drilling expenses, are also capitalized. The amount of land and mineral rights included in land on the Consolidated Balance Sheets were approximately $13,628,000 and $2,165,000, respectively, as of July 31, 2022, and were $13,637,000 and $2,165,000, respectively, as of July 31, 2021. Any prepaid royalties that may be offset against future royalties due upon extraction of the mineral are also capitalized. Prepaid royalties included in current prepaid expenses and in non-current other assets on the Consolidated Balance Sheets were approximately $2,003,000 and $1,605,000 as of July 31, 2022 and 2021, respectively.\nRECLAMATION\nWe perform ongoing reclamation activities during the normal course of our overburden removal. As overburden is removed from a mine site, it is hauled to previously mined sites and is used to refill older sites. This process allows us to continuously reclaim older mine sites and dispose of overburden simultaneously, therefore minimizing the costs associated with the reclamation process.\nOn an annual basis we evaluate our potential reclamation liability in accordance with ASC 410, Asset Retirement and Environmental Obligations. The reclamation assets are depreciated over the estimated useful lives of the various mines. The reclamation liabilities are increased based on a yearly accretion charge over the estimated useful lives of the mines.\nAs of July 31, 2022 and 2021, we have recorded an estimated net reclamation asset of $1,799,000 and $1,152,000, respectively, and a corresponding estimated reclamation liability of $3,807,000 as of July 31, 2022 and $2,965,000 as of July 31, 2021. These values represent the discounted present value of the estimated future mining reclamation costs at the production plants. Additional mining activity in fiscal year 2022 and disturbance of land accounts for the increase in the reclamation liability.\nPROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment are generally depreciated using the straight-line method over their estimated useful lives which are listed below. Depreciation expense was $12,984,000 and $13,497,000 in fiscal years 2022 and 2021, respectively. Major improvements and betterments are capitalized, while maintenance and repairs that do not extend the useful life of the applicable assets are expensed as incurred. Interest expense may also be capitalized for assets that require a period of time to get them ready for their intended use. There was no capitalized interest in fiscal years 2022 and 2021.\nYears\nBuildings and leasehold improvements 3 - 40\nMachinery and equipment\nPackaging 2 - 20\nProcessing 2 - 25\nMining and other 2 - 15\nOffice furniture and equipment 2 - 15\nVehicles 2 - 15\nProperty, plant and equipment are carried at cost on the Consolidated Balance Sheets and are reviewed for possible impairment on an annual basis or when circumstances indicate impairment that an asset may become impaired. We take into consideration idle and underutilized equipment and review business plans for possible impairment. When impairment is indicated, an impairment charge is recorded for the difference between the carrying value of the asset and its fair market value. No impairment was recorded in either fiscal year 2022 or 2021.\nOTHER CURRENT AND NONCURRENT LIABILITIES\nOn March 27, 2020, in response to the COVID-19 pandemic, the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) was signed into U.S. law. The CARES Act provides for, among other things, deferral of the employer portion of social security taxes incurred through the end of calendar 2020. As permitted by the CARES Act, we deferred approximately $2,300,000 in payroll taxes in calendar year 2020, $1,150,000 was paid in December 2021 and $1,150,000 will be paid in December 2022. The current portion of the accrual for these payroll taxes is included in Other within Accrued Expenses and the noncurrent portion of the accrual, as applicable, is included in Other within Noncurrent Liabilities on the Consolidated Balance Sheet.\nTRADE PROMOTIONS\nWe routinely commit to one-time or ongoing trade promotion programs, primarily in our Retail and Wholesale Products Group. All such costs are netted against sales. We have accrued liabilities at the end of each period for the estimated expenses incurred but not yet paid for these programs. Promotional reserves are provided for sales incentives made directly to consumers, such as coupons, and sales incentives made to customers, such as slotting, discounts based on sales volume, cooperative marketing programs and other arrangements. We use judgment for estimates to determine our trade spending liabilities. We rely on our historical experience of trade spending patterns and that of the industry, current trends and forecast data.\nADVERTISING\nAdvertising costs for the development of printed materials, television commercials, web-based digital banners, web-based social media and sales videos are deferred and expensed upon the first use of the materials, unless such amounts are immaterial. Costs paid for communicating advertising over a period of time, such as television air time, radio commercials and print media advertising space, are deferred and expensed on a pro-rata basis. All other advertising costs, including participation in industry conventions and shows and market research, are expensed when incurred. All advertising costs are part of selling, general and administrative expenses. Advertising expenses were approximately $4,032,000 and $8,651,000 in fiscal years 2022 and 2021, respectively.\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nNon-derivative financial instruments included in the Consolidated Balance Sheets are cash and cash equivalents and notes payable. These instruments, except for notes payable, were carried at amounts approximating fair value as of July 31, 2022 and 2021. See Note 4 of the Notes to the Consolidated Financial Statements for additional information regarding the fair value of our financial instruments, including notes payable.\nREVENUE RECOGNITION\nWe recognize revenue when performance obligations under the terms of the contracts with customers are satisfied. Our performance obligation generally consists of the promise to sell finished products to wholesalers, distributors and retailers or consumers and our obligations have an original duration of one year or less. Control of the finished products are transferred upon shipment to, or receipt at, customers' locations, as determined by the specific terms of the contract. We have completed our performance obligation when control is transferred and we recognize revenue accordingly. Taxes collected from customers and remitted to governmental authorities are excluded from net sales. Sales returns are not material nor are warranties and any related obligations.\nWe have an unconditional right to consideration under the payment terms specified in the contract upon completion of the performance obligation. We may require certain customers to provide payment in advance of product shipment. We recorded a liability for these advance payments of $527,000 and $256,000 as of July 31, 2022 and July 31, 2021, respectively. This liability is reported in Other Accrued Expenses on the Consolidated Balance Sheets. Revenue recognized during fiscal year 2022 that was included in the liability for advance payments at the beginning of the year was $151,000.\nCOST OF SALES\nCost of sales consists of all manufacturing costs, including depreciation and amortization related to assets used in the manufacturing and distribution process, inbound and outbound freight, inspection costs, purchasing costs associated with materials and packaging used in the production process and warehouse and distribution costs.\nSHIPPING AND HANDLING COSTS\nShipping and handling costs are included in cost of sales and were approximately $48,487,000 and $46,500,000 for fiscal years 2022 and 2021, respectively. The increase in fiscal year 2022 relates to the increase in freight due to higher transportation rates from tight truck availability offset by freight we no longer incur related to a significant customer who now picks up its own purchases.\nSELLING, GENERAL AND ADMINISTRATIVE EXPENSES\nSelling, general and administrative expenses include salaries, wages and benefits associated with staff outside the manufacturing and distribution functions, all marketing related costs, any miscellaneous trade spending expenses not required to be included in net sales, research and development costs, depreciation and amortization related to assets outside the manufacturing and distribution process and all other non-manufacturing and non-distribution expenses.\nRESEARCH AND DEVELOPMENT\nResearch and development costs of approximately $2,106,000 and $2,539,000 were charged to expense as incurred for fiscal years 2022 and 2021, respectively, and are recorded in selling, general and administrative expenses.\nPENSION AND POSTRETIREMENT BENEFIT COSTS\nWe provide a defined benefit pension plan for eligible salaried and hourly employees and we make contributions to fund the plan. We also provide a postretirement health benefit plan to domestic salaried employees who qualify under the plans provisions. The postretirement health benefit plan is unfunded. Our pension and postretirement health benefit plans are accounted for using actuarial valuations required by ASC 715, Compensation - Retirement Benefits. The funded status of our defined pension and postretirement health benefit plans are recognized on the Consolidated Balance Sheets. Changes in the funded status that arise during the period but are not recognized as components of net periodic benefit cost are recognized within other comprehensive income, net of income tax. In fiscal year 2020 we amended the defined benefit pension plan and the plan is now closed to new entrants. See Note 8 of the Notes to the Consolidated Financial Statements for additional information.\nSTOCK-BASED COMPENSATION\nWe account for stock options and restricted stock issued under our long term incentive plans in accordance with ASC 718, Compensation - Stock Compensation. The fair value of stock-based compensation is determined at the grant date. The related compensation expense is recognized over the appropriate vesting period. Forfeitures are recognized as they occur. See Note 7 of the Notes to the Consolidated Financial Statements for additional information.\nINCOME TAXES\nDeferred income tax assets and liabilities are recorded for the impact of temporary differences between the tax basis of assets and liabilities and the amounts recognized for financial reporting purposes. Deferred tax assets are reviewed and a valuation allowance is established if management believes that it is more likely than not that some portion of our deferred tax assets will not be realized. Changes in valuation allowances from period to period are included in the tax provision in the period of change.\nIn addition to existing valuation allowances, we provide for uncertain tax positions, if necessary, when such tax positions do not meet the recognition thresholds or measurement standards prescribed by ASC 740, Income Taxes. Amounts for uncertain tax positions are adjusted when new information becomes available or when positions are effectively settled. We recognize interest and penalties accrued related to uncertain tax positions in income tax expense.\nU.S. income tax expense and foreign withholding taxes are provided on remittances of foreign earnings and on unremitted foreign earnings that are not indefinitely reinvested. Where unremitted foreign earnings are indefinitely reinvested, no provision for federal or state tax expense is recorded. When circumstances change and we determine that some or all of the undistributed earnings will be remitted in the foreseeable future, a corresponding expense is accrued in the current period. See Note 5 of the Notes to the Consolidated Financial Statements for additional information about income taxes.\nNEW ACCOUNTING PRONOUNCEMENTS\nRecently Adopted Accounting Pronouncements\nIn January 2017, the FASB issued ASU 2017-04, Intangibles - Goodwill and Other: Simplifying the Test for Goodwill Impairment (ASC 350). The standard eliminates the requirement to measure the implied fair value of goodwill by assigning the fair value of a reporting unit to all assets and liabilities within that unit (the Step 2 test) from the goodwill impairment test. Instead, if the carrying amount of a reporting unit exceeds its fair value, an impairment loss is recognized in an amount equal to that excess, limited by the amount of goodwill in that reporting unit. The guidance is effective for us beginning with the first quarter of fiscal year 2023. Early adoption is permitted. We adopted this standard for our goodwill impairment test performed on May 1, 2022. See Note 5 for additional information regarding the results of the impairment test performed.\nIn December 2019, the FASB issued guidance under ASC 740, Income Taxes, which simplifies the accounting for income taxes. The guidance removes several specific exceptions to the general principles in ASC 740 and clarifies and makes amendments to improve consistent application of and simplify existing accounting for other areas in ASC 740. We implemented this guidance effective for our first quarter of fiscal year 2022. The impact of adopting this requirement is not material to our Consolidated Financial Statements.\nIn June 2016, the FASB issued guidance under ASC 326, Financial Instruments-Credit Losses, which requires companies to utilize an impairment model for most financial assets measured at amortized cost and certain other financial instruments, which include trade and other receivables, loans and held-to-maturity debt securities, to record an allowance for credit risk based on expected losses rather than incurred losses. In addition, this new guidance changes the recognition method for credit losses on available-for-sale debt securities, which can occur as a result of market and credit risk, as well as additional disclosures. In general, this guidance will require modified retrospective adoption for all outstanding instruments that fall under this guidance. Early adoption is permitted and we adopted this standard for the evaluation of bad debt reserves at July 31, 2022. Accordingly, this guidance is effective for our first quarter of fiscal year 2023. The impact of adopting this requirement is not material to our Consolidated Financial Statements.\nRecently Issued Accounting Standards\nIn March 2020, the FASB issued guidance under ASC 848, Reference Rate Reform. This guidance provides optional expedients and exceptions to account for debt, leases, contracts, hedging relationships and other transactions that reference LIBOR or another reference rate if certain criteria are met. The guidance is effective immediately and may be applied prospectively to contract modifications made and hedging relationships entered into or evaluated on or before December 31, 2022. We have debt agreements that reference LIBOR and to the extent that those agreements are modified to replace LIBOR with another interest rate index, ASC 848 will allow us to account for the modification as a continuation of the existing contract without additional analysis. On August 30, 2022 we amended our debt agreements to replace the LIBOR-based reference rate with an adjusted term Secured Overnight Financing Rate (SOFR). See Note 13 for additional information on the debt amendment subsequent event.\nThere have been no other accounting pronouncements issued but not yet adopted by us which are expected to have a material impact on our Consolidated Financial Statements.\nNOTE 2 - OPERATING SEGMENTS\nAs a result of a change in management organization during fiscal year 2022 and as part of our routine assessments of our segments, our wholly owned subsidiary located in the United Kingdom is now included in our Business to Business Products Group and our co-packaged coarse cat litter is now included in the Retail and Wholesale Products Group. Prior year net sales and operating income have also been reclassified to reflect these changes. The organization change was intended to better serve our customers and the segment information presented reflects the information regularly reviewed by our chief operating decision maker.\nWe have two reportable operating segments: (1) Retail and Wholesale Products Group and (2) Business to Business Products Group. These operating segments are managed separately and each segment's major customers have different characteristics. The Retail and Wholesale Products Group customers include mass merchandisers, wholesale clubs, drugstore chains, pet specialty retail outlets, dollar stores, retail grocery stores, distributors of industrial cleanup and automotive products, environmental service companies, sports field product users and marketers of consumer products. The Business to Business Products Group customers include: processors and refiners of edible oils, petroleum-based oils and biodiesel fuel; manufacturers of animal feed and agricultural chemicals; and distributors of animal health and nutrition products.\nNet sales for our principal products by segment are as follows (in thousands):\nBusiness to Business Products Group Retail and Wholesale Products Group\nYear Ended July 31,\nProduct 2022 2021 2022 2021\nCat Litter $ - $ - $ 196,278 $ 176,119\nIndustrial and Sports - - 38,932 31,724\nAgricultural and Horticultural 30,419 26,035 - -\nBleaching Clay and Fluids Purification 62,051 53,337 - -\nAnimal Health and Nutrition 20,909 17,766 - -\nNet Sales $ 113,379 $ 97,138 $ 235,210 $ 207,843\nNet sales and operating income for each segment are provided below. The accounting policies of the segments are the same as those described in the Note 1 of the Notes to the Consolidated Financial Statements.\nWe do not rely on any operating segment asset allocations and we do not consider them meaningful because of the shared nature of our production facilities; however, we have estimated the segment asset allocations below for those assets for which we can reasonably determine. The unallocated asset category is the remainder of our total assets. The asset allocation is estimated and is not a measure used by our chief operating decision maker about allocating resources to the operating segments or in assessing their performance.\nThe corporate expenses line in the table below represents certain unallocated expenses, including primarily salaries, wages and benefits, purchased services, rent, utilities and depreciation and amortization associated with corporate functions such as research and development, information systems, finance, legal, human resources and customer service. Corporate expenses also include the annual incentive plan bonus accrual.\nJuly 31,\nAssets\n2022 2021\n(in thousands)\nBusiness to Business Products $ 75,644 $ 62,124\nRetail and Wholesale Products 125,293 110,167\nUnallocated assets 48,674 55,275\nTotal Assets $ 249,611 $ 227,566\nYear Ended July 31,\nNet Sales Income\n2022 2021 2022 2021\n(in thousands)\nBusiness to Business Products $ 113,379 $ 97,138 $ 24,344 $ 25,914\nRetail and Wholesale Products 235,210 207,843 6,252 11,088\nNet Sales $ 348,589 $ 304,981\nCorporate Expenses (25,775) (23,966)\nIncome from Operations 4,821 13,036\nTotal Other Income, Net 888 332\nIncome Before Income Taxes 5,709 13,368\nIncome Tax Expense (97) (2,388)\nNet Income $ 5,612 $ 10,980\nNet Loss Attributable to Noncontrolling Interest $ (62) $ (133)\nNet Income Attributable to Oil-Dri $ 5,674 $ 11,113\nThe following is a summary by fiscal year of financial information by geographic region (in thousands):\n2022 2021\nSales to unaffiliated customers by:\nDomestic operations $ 328,696 $ 287,575\nForeign subsidiaries $ 19,893 $ 17,406\nSales or transfers between geographic areas:\nDomestic operations $ 6,418 $ 5,347\nForeign subsidiaries $ 161 $ 112\nIncome (Loss) before income taxes:\nDomestic operations $ 6,552 $ 14,144\nForeign subsidiaries $ (843) $ (776)\nNet Income (Loss) attributable to Oil-Dri:\nDomestic operations $ 6,430 $ 11,710\nForeign subsidiaries $ (756) $ (597)\nIdentifiable assets:\nDomestic operations $ 236,622 $ 214,994\nForeign subsidiaries $ 12,989 $ 12,572\nIncluded within identifiable assets for our foreign subsidiaries is cash held at foreign banks of $3,260 and $3,054 as of July 31, 2022 and July 31, 2021, respectively.\nSales to Walmart, our largest customer, are included in our Retail and Wholesale Products Group. The percentage of consolidated net sales and net accounts receivable attributed to Walmart are shown in the table below:\n2022 2021\nNet sales for the years ended July 31 16% 18%\nNet accounts receivable as of July 31 21% 20%\nThere are no other customers with sales equal to or greater than 10% of our total sales.\nNOTE 3 - DEBT\nThe composition of notes payable is as follows as of July 31 (in thousands):\n2022 2021\nAmended and Restated Note Purchase and Private Shelf Agreement. Annual principal installments on May 15: $1,000 in each fiscal year 2021 through 2030. Interest is payable semi-annually at an annual rate of 3.95%\n$ 8,000 $ 9,000\nAmended and Restated Note Purchase and Private Shelf Agreement. Annual principal installments on Dec 15: $5,000 in each fiscal year 2028 through 2032. Interest is payable semi-annually at an annual rate of 3.25%\n25,000 -\nLess current maturities of notes payable (1,000) (1,000)\nLess unamortized debt issuance costs $ (202) $ (122)\nNoncurrent notes payable $ 31,798 $ 7,878\nOn May 15, 2020 (the Effective Date), we entered into an Amended and Restated Note Purchase and Private Shelf Agreement (the Amended Note Agreement) with PGIM, Inc. (Prudential) and certain existing noteholders and purchasers affiliated with Prudential named therein. The Amended Note Agreement amends and restates the Note Agreement between Oil-Dri, Prudential and certain existing noteholders named therein, dated as of November 12, 2010 (the Prior Note Agreement), under which our 3.96% Series A Senior Notes (the Series A Notes) were previously issued in an original aggregate principal amount of $18,500,000.\nPursuant to the Amended Note Agreement, (i) the Series A Notes, in an aggregate principal amount of $3,100,000 as of immediately prior to the Effective Date, were paid in full in July 2020 and (ii) we issued $10,000,000 in aggregate principal amount of our 3.95% Series B Senior Notes due May 15, 2030 (the Series B Notes) and (iii) we issued $25,000,000 in aggregate principal amount of our 3.25% Series C Senior Notes due December 16, 2031 (the Series C Notes). In addition, the Amended Note Agreement provided us with the ability to request, from time to time until May 15, 2023 (or such earlier date as provided for in the Amended Note Agreement), that Prudential affiliate(s) purchase, at Prudentials discretion and on an uncommitted basis, additional senior unsecured notes of Oil-Dri (the Shelf Notes, and collectively with the Series A Notes and Series B Notes, and Series C Notes, the Notes) in an aggregate principal amount of up to $75,000,000 minus the aggregate principal amount of Notes then outstanding and Shelf Notes that have been accepted for purchase. Interest payable on any Shelf Note agreed to be purchased under the Amended Note Agreement will be at a rate determined by Prudential and will mature not more than fifteen years after the date of original issue of such Shelf Note.\nLike the Prior Note Agreement, the Amended Note Agreement is guaranteed, on an unsecured basis, by certain U.S. subsidiaries of Oil-Dri, and contains customary covenants, including but not limited to, limitations on our and certain of our subsidiaries ability to incur indebtedness, incur liens, engage in mergers, and sell or transfer assets and stock, as well as financial covenants, including a minimum fixed charges coverage ratio and consolidated debt ratio that remain the same as those contained in the Prior Note Agreement. Upon the occurrence of certain events of default, our obligations under the Amended Note Agreement may be accelerated. Such events of default include payment defaults, covenant defaults and other enumerated defaults.\nEffective June 3, 2022, we entered into Amendment No. 2 (the Amendment) to the Amended and Restated Note Purchase and Private Shelf Agreement (the Note Agreement) with PGIM, Inc. (Prudential) and certain existing noteholders affiliated with Prudential named therein. The Amendment, among other things, revises the definition of Consolidated EBITDA (Earnings Before Interest, Depreciation, and Amortization) within the Note Agreement.\nThe revised definitions of Consolidated EBITDA are relevant to our covenant calculations based on the amended definitions noted above. The goodwill impairment recorded in the third quarter was excluded from the quarterly covenant calculations based on the amended definitions summarized above. See Note 1 of the Notes to the Consolidated Financial Statements for additional information on goodwill impairment.\nWe have a credit agreement with BMO Harris that expires on January 31, 2024 (the \"Credit Agreement\"). The agreement provides for a $45,000,000 unsecured revolving credit agreement, including a maximum of $10,000,000 for letters of credit. Under the credit agreement, we may select a variable rate based on either BMO Harris prime rate or a LIBOR-based rate, plus a margin which varies depending on our debt to earnings ratio, or a fixed rate as agreed between us and BMO Harris. As of July 31, 2022, the variable rates would have been 5.75% for the BMO Harris prime-based rate or 4.04% for the LIBOR-based rate.\nEffective June 6, 2022, we entered into a modification (the Modification) to the credit agreement (the Credit Agreement) with BMO Harris N.A. The Modification, among other things, revises the definition of Consolidated EBITDA and Consolidated EBITR (Earnings Before Interest, Taxes, and Rent) within the Credit Agreement.\nThe revised definitions of Consolidated EBITDA and consolidated EBITR are relevant to our covenant calculations based on the amended definitions noted above. The goodwill impairment recorded in the third quarter was excluded from the quarterly covenant calculations based on the amended definitions summarized above. See Note 1 of the Notes to the Consolidated Financial Statements for additional information on goodwill impairment.\nAs of July 31, 2022 and 2021, there were no outstanding borrowings under this credit agreement. However, we had $964,000 of letters of credit outstanding at July 31, 2022 and 2021 under this agreement.\nThe credit agreement contains restrictive covenants that, among other things and under various conditions, limit our ability to incur additional indebtedness or to dispose of assets. The agreement also requires us to maintain a minimum fixed coverage ratio, a minimum consolidated net worth and a minimum consolidated debt ratio. Our debt agreements also contain provisions such that if we default on one debt agreement, the others will automatically default. If we default on any guaranteed debt with a balance greater than $1,000,000, our unsecured revolving credit agreement with BMO Harris will be considered in default. If we default on any debt with a balance greater than $5,000,000 we will also be considered in default with the senior promissory notes. We were in compliance with all restrictive covenants and limitations as of July 31, 2022.\nThe following is a schedule by fiscal year of future principal maturities of notes payable as of July 31, 2022 (in thousands):\n2023 $ 1,000\n2024 1,000\n2025 1,000\n2026 1,000\n2027 1,000\nOn August 30, 2022, the Company entered into (i) the Sixth Amendment to the Credit Agreement (the Sixth Amendment), which amends the Credit Agreement, among BMO Harris, the Company and certain domestic subsidiaries of the Company; and (ii) Amendment No. 3 (the Third Amendment) to the Amended Note Agreement with Prudential and certain existing noteholders affiliated with Prudential named therein. See Note 13 of the Notes to the Consolidated Financial Statements for additional information.\nNOTE 4 - FINANCIAL INSTRUMENTS\nFair Value\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The inputs used to measure fair value are prioritized into one of three categories based on the lowest level of input that is significant to the fair value measurement. Categories in the hierarchy are as follows:\nLevel 1: Quoted market prices in active markets for identical assets or liabilities.\nLevel 2: Observable market-based inputs for similar assets or liabilities or valuation models whose inputs are observable, directly or indirectly.\nLevel 3: Unobservable inputs.\nCash equivalents are classified as Level 1 of the fair value hierarchy because they are valued using quoted market prices in active markets. These cash instruments are primarily money market funds and are included in cash and cash equivalents on the Consolidated Balance Sheets. There were no cash equivalents as of July 31, 2022 and July 31, 2021.\nAccounts receivable and accounts payable balances on the Consolidated Balance Sheets approximate their fair values as of July 31, 2022 and 2021 due to the short maturity and nature of those balances.\nNotes payable on the Consolidated Balance Sheets are carried at the face amount of future maturities. The estimated fair value of notes payable was approximately $31,784,000 as of July 31, 2022 and $10,231,000 as of July 31, 2021. The fair value was estimated using the exit price notion of fair value and is classified as Level 2. The increase in fair value is attributable to the Amended Note Agreement entered into in December 2021. See Note 3 of the Notes to the Consolidated Financial Statements for further information about such debt.\nWe apply fair value techniques on at least an annual basis associated with: (1) valuing potential impairment loss related to goodwill, trademarks and other indefinite-lived intangible assets and (2) valuing potential impairment loss related to long-lived assets. See Note 1 of the Notes to Consolidated Financial Statements for further information about goodwill and other intangible assets, including the goodwill impairment recorded during fiscal year 2022 at our Retail and Wholesale Products Group.\nConcentration of Credit Risk\nFinancial instruments which potentially subject us to concentrations of credit risk consist principally of cash and accounts receivable. Our cash is held in banks which are covered by the Federal Deposit Insurance Corporation; however, our cash balances are in excess of the maximum amount that is insured. Concentrations of credit risk with respect to accounts receivable are subject to the financial condition of certain major customers, principally the customer referred to in Note 2 of the Notes to the Consolidated Financial Statements. We generally do not require collateral to secure customer receivables.\nNOTE 5 - INCOME TAXES\nThe provision for income tax expense by fiscal year consists of the following (in thousands):\n2022 2021\nCurrent\nFederal $ 1,681 $ (683)\nForeign 16 2\nState 696 309\nCurrent Income Tax Total 2,393 (372)\nDeferred\nFederal (1,868) 2,440\nForeign (41) (48)\nState (387) 368\nDeferred Income Tax Total (2,296) 2,760\nTotal Income Tax Expense $ 97 $ 2,388\nPrincipal reasons for variations between the statutory federal rate and the effective rates by fiscal year were as follows:\n2022 2021\nU.S. federal income tax rate 21.0 % 21.0 %\nDepletion deductions allowed for mining (20.1) (5.4)\nState income tax expense, net of federal tax expense 4.5 5.1\nNondeductible officer compensation 2.4 4.0\nTax credits (3.1) (2.5)\nStatutory rate change of foreign subsidiaries - (0.7)\nValuation allowance - foreign 6.9 2.5\nForeign tax differential (5.3) (1.5)\nPrior year income taxes (9.5) (4.0)\nGoodwill impairment 3.1 -\nOther 1.8 (0.8)\nEffective income tax rate 1.7 % 17.7 %\nThe U.S. effective tax rate for the year ended July 31, 2022 and July 31, 2021 were 1.7% and 17.7%, respectively, based on income before taxes. The items impacting the effective tax rate were permanent items and the return to provision adjustments. The tax impact of the items comprising the permanent adjustments primarily consisted of depletion, stock-based compensation and goodwill impairment.\nThe Consolidated Balance Sheets included the following tax effects of cumulative temporary differences as of July 31 (in thousands):\n`\n2022 2021\nAssets Liabilities Assets Liabilities\nDepreciation $ - $ 4,356 $ - $ 5,870\nDeferred compensation 1,499 - 1,593 -\nPostretirement benefits 209 - 1,296 -\nGoodwill 62 - - 1,073\nLease right of use assets - 2,700 - 2,160\nLease liabilities 3,040 - 2,524 -\nAllowance for doubtful accounts 95 - 176 -\nDeferred marketing expenses - 22 - 133\nOther assets 1 - 289 -\nOther liabilities - 23 - -\nAccrued expenses 2,362 - 2,402 -\nTax credits 223 - 87 -\nAmortization 1,046 - 1,028 -\nInventories 366 - 351 -\nDepletion - 154 - 166\nStock-based compensation 1,522 - 1,340 -\nReclamation 549 - 498 -\nOther liabilities - foreign - 42 - 86\nOther assets - foreign 1,761 - 1,362 -\nValuation allowance (1,761) - (1,362) -\nTotal deferred taxes $ 10,974 $ 7,297 $ 11,584 $ 9,488\nDeferred tax liabilities for depreciation decreased due to the election out of bonus depreciation that the Company took in fiscal year 2021. Deferred tax assets for post retirement benefits were affected by the freeze of our pension plan as well as the Lump Sum Option both of which significantly reduced our pension liability. See Note 8 of the Notes to the Consolidated Financial Statements for further information about postretirement benefits. Deferred tax assets and liabilities related to lease decreased as leases are expiring. Deferred tax assets for accrued expenses reflected a lower accrual for the annual discretionary bonus.\nWe recorded a valuation allowance of $1,761,000 and $1,362,000 as of July 31, 2022 and 2021, respectively, for the amount of the deferred tax benefit related to our foreign net operating loss carryforwards since we believe it is unlikely we will realize the benefit of these tax attributes in the future. As of July 31, 2022, we have total net operating loss carryforwards from state jurisdictions of approximately $7,000,000. The carryforward expiration dates vary by state. No valuation allowance has been established for these carryforwards since we expect our future profitability will allow us to fully realize these tax benefits.\nWith the exception of our foreign subsidiary in Canada, none of our foreign subsidiaries have generated any untaxed foreign income, therefore we have not provided for any related income taxes for these subsidiaries.\nWe had no material liability for unrecognized tax benefits based on tax positions related to the current and prior fiscal years as of July 31, 2022 and 2021; correspondingly, no related interest and penalties were recognized as income tax expense and there were no accruals for such items in either of these fiscal years.\nWe are subject to U.S. federal income tax as well as income tax in multiple state and foreign jurisdictions. We have no income tax returns under examination as of July 31, 2022 and federal tax returns for fiscal years 2019-2021 remain open for examination. Foreign and U.S. state jurisdictions have statutes of limitations generally ranging from three to five years. The state impact of any federal income tax changes remains subject to examination by various states for a period of up to one year after formal notification to the states. There are a limited number of open state and local income tax audits in which no material\nissues have been preliminarily identified. There are no material open or unsettled foreign income tax audits. We believe our accrual for tax liabilities is adequate for all open audit years.\nNOTE 6 - ACCUMULATED OTHER COMPREHENSIVE (LOSS) INCOME\nThe following table summarizes the changes in accumulated other comprehensive income by component (in thousands):\nPension and Postretirement Health Benefits Cumulative Translation Adjustment Total Accumulated Other Comprehensive (Loss) Income\nBalance as of July 31, 2020 $ (11,994) $ (260) (12,254)\nOther comprehensive income before reclassifications, net of tax 6,592 a) 571 7,163\nAmounts reclassified from accumulated other comprehensive income, net of tax 494 b) - 494\nCurtailment/Settlement on Pension Plan 480 c) - 480\nNet current-period other comprehensive income, net of tax 7,566 571 8,137\nBalance as of July 31, 2021 $ (4,428) $ 311 $ (4,117)\nOther comprehensive income (loss) before reclassifications, net of tax 2,081 a) (252) 1,829\nAmounts reclassified from accumulated other comprehensive income, net of tax 105 b) - 105\nNet current-period other comprehensive income (loss), net of tax 2,186 (252) 1,934\nBalance as of July 31, 2022 $ (2,242) $ 59 $ (2,183)\na) Amounts are net of taxes of $684,000 and $2,095,000 in fiscal years 2022 and 2021, respectively, and are included in Other Comprehensive Loss.\nb) Amounts are net of taxes of $34,000 and $156,000 in fiscal years 2022 and 2021, respectively. Amounts are included in the components of net periodic benefit cost for the pension and postretirement health plans.\nc) Amount is net of taxes of $151,000 in fiscal year 2021. Amount is included in the components of net periodic benefit cost for the pension and postretirement health plans.\nSee Note 8 of the Notes to the Consolidated Financial Statements for further information about pension and postretirement health benefits.\nNOTE 7 - STOCK-BASED COMPENSATION\nThe Oil-Dri Corporation of America 2006 Long Term Incentive Plan (as amended, the 2006 Plan) permits the grant of stock options, stock appreciation rights, restricted stock, restricted stock units, performance awards and other stock-based and cash-based awards. Our employees and outside directors are eligible to receive grants under the 2006 Plan. The total number of shares of stock subject to grants under the 2006 Plan may not exceed 1,219,500. As of July 31, 2022, there were 272,475 shares available for future grants under this plan.\nRESTRICTED STOCK\nAll non-vested restricted stock as of July 31, 2022 was issued under the 2006 Plan with vesting periods generally from two to five years. The fair value of restricted stock was determined by the closing market price of our Common Stock on the date of grant multiplied by the number of shares granted.\nA summary of restricted stock transactions under the plans is shown below.\nNumber of\nShares\n(in thousands) Weighted\nAverage\nGrant Date\nFair Value Weighted\nAverage\nRemaining\nContractual\nTerm\n(Years) Unamortized\nExpense\n(in thousands)\nNon-vested restricted stock outstanding at July 31, 2020 390 $ 33.19 4.0 $ 7,784\nGranted 72 $ 35.76\nVested (67) $ 33.11\nForfeited (25) $ 29.58\nNon-vested restricted stock outstanding at July 31, 2021 370 $ 33.96 3.3 $ 7,073\nGranted 126 $ 33.48\nVested (71) $ 34.64\nForfeited (43) $ 34.29\nNon-vested restricted stock outstanding at July 31, 2022 382 $ 33.63 3.0 $ 7,064\nStock-based compensation for restricted stock of $2,083,000 and $1,924,000, net of related tax effect, was recognized in fiscal years 2022 and 2021, respectively. The total restricted stock compensation related tax benefit was $658,000 and $607,000 in fiscal years 2022 and 2021, respectively.\nNOTE 8 - PENSION AND OTHER POSTRETIREMENT BENEFITS\nThe Oil-Dri Corporation of America Pension Plan (Pension Plan) is a defined benefit pension plan for eligible salaried and hourly employees. Pension benefits are based on a formula of years of credited service and levels of compensation or stated amounts for each year of credited service. On January 9, 2020, we amended the Pension Plan to freeze participation, all future benefit accruals and accrual of benefit service, including consideration of compensation increases, effective March 1, 2020. Consequently, the Pension Plan is closed to new participants and current participants will no longer earn additional benefits on or after March 1, 2020. On May 4, 2021, we purchased an annuity for $8,530,000 which decreased both our projected benefit obligation and the fair value of plan assets and resulted in no change in the funded status of the pension plan. The settlement expense related to the annuity purchase was $631,000 and was recorded net of tax in Other, net in the Consolidated Statements of Operations.\nA postretirement health benefits plan is also provided to domestic salaried employees who meet specific age, participation and length of service requirements at the time of retirement. Eligible employees may elect to continue their health care coverage under the Oil-Dri Corporation of America Employee Benefits Plan until the date certain criteria are met, including attaining the age of Medicare eligibility. We have the right to modify or terminate the postretirement health benefit plan at any time.\nA 401(k) savings plan is maintained under which we match a portion of employee contributions. This plan is available to essentially all domestic employees following a specific number of days of employment. Our contributions to this plan, and to similar plans maintained by our foreign subsidiaries, were $2,936,000 and $2,784,000 for fiscal years 2022 and 2021, respectively.\nObligations and Funded Status\nThe following tables provide a reconciliation of changes in the plans benefit obligations, asset fair values and funded status by fiscal year (in thousands):\nPension Benefits Postretirement Health Benefits\n2022 2021 2022 2021\nChange in benefit obligation:\nBenefit obligation, beginning of year $ 42,267 $ 57,280 $ 3,125 $ 3,291\nService cost - - 123 139\nInterest cost 1,068 1,168 58 51\nActuarial gain (8,386) (6,091) (1,155) (313)\nBenefits paid (1,208) (1,603) (32) (43)\nSettlements - (8,487) - -\nBenefit obligation, end of year 33,741 42,267 2,119 3,125\nChange in plan assets:\nFair value of plan assets, beginning of year 40,388 45,334 - -\nActual return on plan assets (4,191) 5,144 - -\nEmployer contribution - - 32 43\nBenefits paid (1,208) (1,603) (32) (43)\nSettlements - (8,487) - -\nFair value of plan assets, end of year 34,989 40,388 - -\nFunded status, recorded in Consolidated Balance Sheets $ 1,248 $ (1,879) $ (2,119) $ (3,125)\nSee Cash Flows below for further information about employer contributions and benefits payments.\nThe accumulated benefit obligation for the Pension Plan was $33,741,000 and $42,267,000 as of July 31, 2022 and July 31, 2021, respectively.\nThe following table shows amounts recognized in the Consolidated Balance Sheets as of July 31 (in thousands):\nPension Benefits Postretirement Health\nBenefits\n2022 2021 2022 2021\nDeferred income taxes $ (335) $ 504 $ 544 $ 792\nOther current liabilities $ - $ - $ (73) $ (82)\nOther noncurrent liabilities $ 1,248 $ (1,879) $ (2,046) $ (3,043)\nAccumulated other comprehensive loss - net of tax:\nNet actuarial loss (gain) $ 2,998 $ 4,311 $ (756) $ 117\nBenefit Costs and Amortizations\nThe following table shows the components of the net periodic pension and postretirement health benefit costs by fiscal year (in thousands):\nPension Cost Postretirement Health Benefit Cost\n2022 2021 2022 2021\nService cost $ - $ - $ 123 $ 139\nInterest cost 1,068 1,168 58 51\nExpected return on plan assets (2,586) (2,816) - -\nAmortization of:\nPrior service income - - (6) (6)\nOther actuarial loss 145 653 - 3\nSettlement cost - 631 - -\nNet periodic benefit (income) cost $ (1,373) $ (364) $ 175 $ 187\nService cost is recorded in Other, net within Other Income (Expense) in the Consolidated Statements of Operations. As the pension plan is frozen, there was no service cost recorded in fiscal years 2021 or 2022.\nThe following table shows amounts, net of tax, that are recognized in other comprehensive income by fiscal year (in thousands):\nPension Benefits Postretirement Health Benefits\n2022 2021 2022 2021\nNet actuarial gain $ (1,203) $ (6,355) $ (878) $ (237)\nAmortization of:\nPrior service income - - 5 5\nAmortization of actuarial loss (110) (496) - (3)\nCurtailment/Settlement $ - $ (480) $ - $ -\nTotal recognized in other comprehensive income $ (1,313) $ (7,331) $ (873) $ (235)\nCash Flows\nWe have funded the Pension Plan based upon actuarially determined contributions that take into account the amount deductible for income tax purposes, the normal cost and the minimum contribution required and the maximum contribution allowed under applicable regulations. We made no contributions in fiscal years 2021 or 2022 and we do not expect to make a contribution to the Pension Plan in fiscal year 2023. The postretirement health plan is an unfunded plan. Our policy is to pay health insurance premiums and claims from our assets.\nThe following table shows the estimated future benefit payments by fiscal year (in thousands):\nPension\nBenefits Postretirement\nHealth Benefits\n2023 $ 1,226 $ 73\n2024 $ 1,258 $ 123\n2025 $ 1,342 $ 154\n2026 $ 1,476 $ 147\n2027 $ 1,596 $ 157\n2028-32 $ 9,209 $ 977\nAssumptions\nOur pension benefit and postretirement health benefit obligations and the related effects on operations are calculated using actuarial models. Critical assumptions that are important elements of plan expenses and asset/liability measurements include discount rate and expected return on assets for the Pension Plan and health care cost trend for the postretirement health plan. We evaluate these critical assumptions at least annually. Other assumptions involving demographic factors such as retirement age, mortality and turnover are evaluated periodically and are updated to reflect our experience and to meet regulatory requirements. Actual results in any given year will often differ from actuarial assumptions because of economic and other factors. The assumptions used in the previous calculations by fiscal year were as follows:\nPension Benefits Postretirement Health Benefits\n2022 2021 2022 2021\nDiscount rate for net periodic benefit costs 2.57% 2.14% 2.10% 1.63%\nDiscount rate for year-end obligations 4.05% 2.57% 3.82% 2.10%\nRate of increase in compensation levels for net periodic benefit costs -% -% -% -%\nRate of increase in compensation levels for year-end obligations -% -% -% -%\nLong-term expected rate of return on assets 6.50% 6.50% -% -%\nThe discount rate was based on the FTSE Pension Discount Curve to determine separately for the Pension Plan and the postretirement health plan, the single equivalent rate that would yield the same present value as the specific plans expected cash flows.\nOur expected rate of return on Pension Plan assets is determined by our asset allocation, our historical long-term investment performance, our estimate of future long-term returns by asset class (using input from our actuaries, investment managers and investment advisors), and long-term inflation assumptions.\nFor fiscal year 2022, the medical cost trend assumption used for the postretirement health benefit cost was 8.5%. The graded trend rate is expected to decrease to an ultimate rate of 4.9% in fiscal year 2044.\nPension Plan Assets\nThe investment objective for the Pension Plan assets is to optimize long-term return at a moderate level of risk in order to secure the benefit obligations to participants at a reasonable cost. To reach this goal, our investment structure includes various asset classes, asset allocations and investment management styles that, in total, have a reasonable likelihood of producing a sufficient level of overall diversification that balances expected return with expected risk over the long-term. The Pension Plan does not invest directly in Company stock.\nWe measure and monitor the plans asset investment performance and the allocation of assets through quarterly investment portfolio reviews. Investment performance is measured by absolute returns, returns relative to benchmark indices and any other appropriate basis of comparison. The targeted allocation percentages of plan assets is shown below for fiscal year 2023 and the actual allocation as of July 31:\nAsset Allocation Target fiscal 2023 2022 2021\nCash and accrued income 64% -% -%\nFixed income 36% 36% 38%\nEquity -% 64% 62%\nIn anticipation of a termination of the pension plan (See Note 13 of the Notes to Consolidated Financial Statements), we adjusted our asset allocation target for fiscal year 2023.\nThe following table sets forth by level, within the fair value hierarchy, the Pension Plan's assets carried at fair value (in thousands):\nFair Value At July 31, 2022\nTotal Quoted\nPrices in\nActive\nMarkets for\nIdentical\nAssets\n(Level 1) Significant\nObservable\nInputs\n(Level 2)\nAsset Class\nCash and cash equivalents(a)\n$ 51 $ 51 $ -\nEquity securities(b):\nU.S. companies 15,389 10,387 5,002\nInternational companies 521 521 -\nEquity securities - international mutual funds:\nDeveloped market(c)\n4,025 923 3,102\nEmerging markets(d)\n1,517 1,149 368\nCommodities(e)\n1,137 1,137 -\nFixed Income:\nU.S. Treasuries 3,019 904 2,115\nDebt securities(f)\n1,656 - 1,656\nGovernment sponsored entities(g)\n1,256 - 1,256\nMulti-strategy bond fund(h)\n5,079 - 5,079\nMoney market fund(i)\n389 - 389\nOther(j)\n950 - 950\nTotal $ 34,989 $ 15,072 $ 19,917\nFair Value At July 31, 2021\nTotal Quoted\nPrices in\nActive\nMarkets for\nIdentical\nAssets\n(Level 1) Significant\nObservable\nInputs\n(Level 2)\nAsset Class\nCash and cash equivalents(a)\n$ 16 $ 16 $ -\nEquity securities(b):\nU.S. companies 15,241 4,290 10,951\nInternational companies 806 806 -\nEquity securities - international mutual funds:\nDeveloped market(c)\n5,622 - 5,622\nEmerging markets(d)\n2,389 - 2,389\nCommodities(e)\n829 - 829\nFixed Income:\nU.S. Treasuries 1,543 - 1,543\nDebt securities(f) 2,258 - 2,258\nGovernment sponsored entities(g)\n1,730 - 1,730\nMulti-strategy bond fund(h)\n8,257 - 8,257\nMoney market fund(i)\n718 - 718\nOther(j)\n979 - 979\nTotal $ 40,388 $ 5,112 $ 35,276\n(a)Cash and cash equivalents consists of highly liquid investments which are traded in active markets.\n(b)This class represents equities traded on regulated exchanges, as well as funds that invest in a portfolio of such stocks.\n(c)These mutual funds seek long-term capital growth by investing no less than 80% of their assets in stocks of non- U.S. companies that are primarily in developed markets, but also may invest in emerging and less developed markets.\n(d)These mutual funds seek to track the performance of a benchmark index that measures the investment return of stock issued by companies located in emerging market countries.\n(e)These investments seek attractive total return by investing primarily in a diversified portfolio of commodity futures contracts and fixed income investments.\n(f)This class includes bonds and loans of U.S. and non-U.S. corporate issuers from diverse industries and bonds of domestic and foreign municipalities.\n(g)This class represents a beneficial ownership interest in a pool of single-family residential mortgage loans. These investments are generally not backed by the full faith and credit of the United States government, except for securities valued at $114,000 in our portfolio as of July 31, 2022 and $176,000 as of July 31, 2021.\n(h)This class invests at least 80% of its net assets in bonds and other fixed income instruments issued by governmental or private-sector entities. More than 30% of its net assets are invested in asset-backed and mortgage-backed securities. The fund may invest up to 20% of its net assets in securities below investment grade.\n(i)These money market mutual funds seek to provide current income consistent with liquidity and stability of principal by investing in a diversified portfolio of high quality, short-term, dollar-denominated debt securities. These funds may include securities issued or guaranteed as to principal and interest by the U.S. government or its agencies, short-term securities issued by domestic or foreign banks, domestic and dollar-denominated foreign commercial papers, and other short-term corporate obligations and obligations issued or guaranteed by one or more foreign governments.\n(j)This class includes funds that use a number of other strategies, including arbitrage, to obtain long-term positive returns. The portfolio of instruments may include equities, debt securities, real estate properties, warrants, options, swaps, future contracts, forwards or other types of derivative instruments.\nNOTE 9 - DEFERRED COMPENSATION\nOil-Dri's deferred compensation plans permit directors and certain management employees to defer portions of their compensation and to earn interest on the deferred amounts. Participants have deferred $680,000 and $1,158,000 into these plans in fiscal years 2022 and 2021, respectively. We recorded $218,000 and $187,000 of interest expense associated with these plans in fiscal years 2022 and 2021, respectively. Payments to participants were $440,000 and $480,000 in fiscal years 2022 and 2021, respectively, and the total liability recorded for deferred compensation was $4,812,000 and $4,354,000 as of July 31, 2022 and 2021, respectively.\nThe Oil-Dri Corporation of America Annual Incentive Plan provides certain executives with the opportunity to receive a deferred executive bonus award if certain financial goals are met. Deferred executive bonus awards of $818,000 were awarded for fiscal year 2022. No executive bonus was awarded for fiscal year 2021 as financial targets under the provisions of the plan were not achieved. These awards will vest and accrue interest over a three-year period.\nOur deferred compensation plans are unfunded. We fund these benefits when payments are made, and the timing and amount of the payments are determined according to the plans' provisions and, for certain plans, according to individual employee agreements.\nOur SERP, which was terminated in fiscal year 2020, provided certain retired participants in the Pension Plan with the amount of benefits that would have been provided under the Pension Plan but for: (1) the limitations on benefits imposed by Section 415 of the Internal Revenue Code (Code), and/or (2) the limitation on compensation for purposes of calculating benefits under the Pension Plan imposed by Section 401(a)(17) of the Code. The SERP liability was actuarially determined at the end of each fiscal year using assumptions similar to those used for the Pension Plan, see Note 8 of the Notes to the Consolidated Financial Statements. The SERP liability was $0 as of July 31, 2021, and we recorded expense related to the SERP of $0 in fiscal year 2021. On January 9, 2020, we amended the SERP to freeze participation and any excess benefit, supplemental benefit or additional benefit effective March 1, 2020. Consequently, the SERP was closed to new participants and current participants no longer earned additional benefits on or after March 1, 2020. The amendment of the SERP triggered a curtailment which required a remeasurement of the SERP's obligation. The remeasurement resulted in a decrease in the SERP liability and recognition of a curtailment gain of approximately $1,296,000 in fiscal year 2020, which was recorded in Selling, General & Administrative Expenses. Subsequent to the curtailment, the SERP was terminated effective June 30, 2020 and all participants were paid in the form of one lump sum in July 2021.\nNOTE 10 - ACCRUED EXPENSES\nAccrued expenses is as follows (in thousands):\nJuly 31,\n2022 July 31,\nSalaries, Wages, Commissions and Employee Benefits 13,439 $ 10,806\nTrade promotions and advertising 1,180 1,653\nFreight 4,022 2,845\nReal Estate Tax 1,006 1,002\nOther 10,438 8,577\n$ 30,085 $ 24,883\nThe increase in salaries, wages, commissions and employee benefits relates primarily to the accrual of annual discretionary bonuses related to fiscal year 2022 that will be paid during the first quarter of fiscal year 2023 and a higher discretionary bonus accrual as of the end of fiscal year 2022 when compared to fiscal year 2021. The accrual for trade promotions and advertising is lower at July 31, 2022 than at July 31, 2021 due to a shift in timing of advertising programs and expense. Freight rates increased during fiscal year 2022 resulting in a higher accrual at July 31, 2022 than at July 31, 2021. Accrued real estate tax at July 31, 2022 is higher than at July 31, 2021 due to the timing of payments. Other accrued expenses are higher due to an increase in natural gas costs in fiscal year 2022 that will be paid during the first quarter of fiscal year 2023.\nNOTE 11 - OTHER CONTINGENCIES\nWe are party to various legal actions from time to time that are ordinary in nature and incidental to the operation of our business, including ongoing litigation. While it is not possible at this time to determine with certainty the ultimate outcome of these or other lawsuits, we believe that none of the pending proceedings will have a material adverse effect on our business,\nfinancial condition, results of operations or cash flows. In June 2020, the Company received notice from a former service provider alleging a breach of contract regarding the payment of a contingency fee. Such party subsequently, in July 2020, filed a lawsuit seeking to require the Company to participate in binding mediation regarding this matter. Although we believe this claim to be without merit, as of July 31, 2022, we have determined a reasonable estimate of this liability within a range, with no amount within that range being a better estimate than any other amount, and have therefore recorded that estimate within Other accrued expenses. We believe that any loss related to this matter is unlikely to be material. However, the outcome of this legal matter is subject to significant uncertainties. The ability to predict the ultimate outcome of this legal matter involves judgments, estimates and inherent uncertainties. The actual outcome could differ materially from managements estimates.\nNOTE 12 - LEASES\nWe have operating leases primarily for real estate properties, including corporate headquarters, customer service and sales offices, manufacturing and packaging facilities, warehouses, and research and development facilities, as well as for rail tracks, railcars and office equipment. Certain of our leases for a shared warehouse and office facility, rail track and railcars have options to extend which we are reasonably certain we will exercise and, accordingly, have been considered in the lease term used to recognize our ROU assets and lease liabilities. To determine the present value of the lease liability, we use an incremental borrowing rate, which is defined as the rate of interest that the Company would have to pay to borrow (on a collateralized basis over a similar term) an amount equal to the lease payments in similar economic environments. Further information about our accounting policy for leases is included in Note 1 of the Notes to the Consolidated Financial Statements.\nWe have no material finance leases, and variable costs for operating leases are immaterial. Operating lease costs are included in Cost of Sales or SG&A expenses based on the nature of the lease. The following table summarizes total lease costs for our operating leases (in thousands):\nFor the Twelve Months Ended July 31, For the Twelve Months Ended July 31,\n2022 2021\nOperating Lease Cost\nOperating lease cost $ 2,776 $ 2,658\nShort-term operating lease cost 553 721\nSupplemental cash flow information related to leases was as follows (in thousands):\nFor the Twelve Months Ended July 31, For the Twelve Months Ended July 31,\n2022 2021\nOther Information\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases $ 2,490 $ 2,303\nOperating lease ROU assets and operating lease liabilities are separately presented on the Consolidated Balance Sheet, excluding leases with an initial term of twelve months or less. Other supplemental balance sheet information related to leases was as follows:\nFor the Twelve Months Ended July 31, For the Twelve Months Ended July 31,\n2022 2021\nWeighted-average remaining lease term - operating leases 7.7 years 9.1 years\nWeighted-average discount rate - operating leases 3.91% 3.88%\nThe following table summarizes scheduled minimum future lease payments due within twelve months for operating leases with terms longer than one year for which cash flows are fixed and determinable as of July 31, 2022 (in thousands):\n2023 $ 2,576\n2024 2,046\n2025 1,913\n2026 1,623\n2027 1,214\nThereafter 4,577\nTotal 13,949\nLess: imputed interest (2,022)\nNet lease obligation $ 11,927\nNOTE 13 - SUBSEQUENT EVENTS\nOn August 30, 2022, the Company entered into (i) the Sixth Amendment to the Credit Agreement (the Sixth Amendment), which amends the Credit Agreement, among BMO Harris, the Company and certain domestic subsidiaries of the Company; and (ii) Amendment No. 3 (the Third Amendment) to the Amended Note Agreement with Prudential and certain existing noteholders affiliated with Prudential named therein.\nThe Sixth Amendment amends the Credit Agreement to, among other things to extend the expiration of the agreement until August 20, 2027; to replace the LIBOR-based reference rate with an adjusted term Secured Overnight Financing Rate (\"SOFR\"); revise the method for calculating consolidated EBITDA and consolidated debt for purposes of the Credit Agreement; modify certain restrictive covenants, including increasing the unsecured indebtedness basket from $50 million to $75 million; and revise the existing financial covenants by replacing the consolidated debt covenant with a covenant to maintain a maximum debt to earnings ratio, lowering the minimum fixed charge coverage ratio level and revising the method for calculating the fixed charge coverage ratio.\nThe Third Amendment amends the Amended Note Agreement to, among other things, modify the existing fixed charge coverage financial covenant and replace the existing consolidated debt financial covenant with a maximum debt to earnings ratio and effect certain changes consistent with the Sixth Amendment, including modifying the method for calculating consolidated EBITDA and the excess leverage fee.\nOn September 20, 2022, subsequent to the end of the fiscal year, the Company's Board of Directors approved a resolution to terminate the Company's defined benefit pension plan. During the first quarter of fiscal year 2023, the Company commenced the plan termination process and expects to complete the termination over a period of eighteen months. The decision to terminate the Plan follows the 2020 decision to amend and freeze the plan, pursuant to which participation, all future benefit accruals and accrual of benefit service, including consideration of compensation increases, were frozen effective March 1, 2020.\nNOTE 14 - RELATED PARTIES\nOne member of our Board of Directors retired from the role of President and Chief Executive Officer of a customer of ours on September 28, 2019 and is currently party to a post-employment consulting agreement with the customer. Total net sales to that customer, including sales to subsidiaries of that customer, were $348,827 and $326,692 for fiscal years 2022 and 2021, respectively. There was $5,608 of outstanding accounts receivable due from that customer, and its subsidiaries, as of July 31, 2022 and $4,256 outstanding accounts receivable as of July 31, 2021.\nOne member of our Board of Directors is currently the President and Chief Executive Officer of a vendor of ours. Total payments to this vendor for fees and cost reimbursements were $689,668 and $703,098 for fiscal years 2022 and 2021, respectively. There were no outstanding amounts due to that vendor as of July 31, 2022 or July 31, 2021.\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15f. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America.\nUnder the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an assessment of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013 framework) issued by the Committee Sponsoring Organizations of the Treadway Commission (COSO). Based on our assessment, our management concluded that our internal control over financial reporting was effective as of July 31, 2022.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur internal controls over financial reporting as of July 31, 2022 have been audited by Grant Thornton LLP, an independent registered public accounting firm, as stated in their report which appears on the next page of this Annual Report on Form 10-K.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nOil-Dri Corporation of America\nOpinions on the financial statements and internal control over financial reporting\nWe have audited the accompanying consolidated balance sheets of Oil-Dri Corporation of America (a Delaware corporation) and subsidiaries (the Company) as of July 31, 2022 and 2021, and the related consolidated statements of operations, comprehensive income, stockholders equity, and cash flows for each of the two years in the period ended July 31, 2022, and the related notes and financial statement schedule included under Item 15(a) (collectively referred to as the financial statements). We also have audited the Companys internal control over financial reporting as of July 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for each of the two years in the period ended July 31, 2022 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of July 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nBasis for opinions\nThe Companys management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys financial statements and an opinion on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and limitations of internal control over financial reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill impairment analysis\nAs described further in Note 1 to the financial statements, during the third quarter of fiscal year 2022, the Company determined that a triggering event necessitated a goodwill impairment test. The Company performed a goodwill impairment test on both the Retail and Wholesale Products Group and Business to Business Product Groups reporting units and determined that the carrying value of the Retail and Wholesale Products Group reporting unit was higher than its fair value. As a result, the Company recorded goodwill impairment of $5,644,000 which left no remaining goodwill in the Retail and Wholesale Products Group.\nThe principal considerations for our determination that the goodwill impairment analysis is a critical audit matter are that the significant estimates and assumptions made by management involve subjectivity and judgment in determining the fair value of the reporting units using the discounted future cash flows valuation technique. The reporting unit discounted future cash flows include certain management assumptions that are complex and have a higher degree of estimation uncertainty. Changes in these assumptions could have a significant impact on the results of the impairment analysis. These assumptions include forward-looking projections related to volume, revenue, and expenses as well as certain allocations between reporting units and determination of discount rates. Performing audit procedures to evaluate managements assumptions required a high degree of auditor judgment and an increased extent of effort, including the need to involve valuation specialists.\nOur audit procedures related to the goodwill impairment analysis included the following, among others:\na.We tested the design and operating effectiveness of internal controls relating to managements goodwill impairment test, including the internal controls over the determination of key inputs such as the forecasting of future cash flows and determination of the discount rate;\nb.We tested the reasonableness of managements forecasts of future revenues and operating margin by comparing to third-party industry projections and historical operating results;\nc.We performed sensitivity analysis on the Companys future revenues, operating margins, and expense allocations to evaluate the reasonableness of managements forecasts;\nd.We utilized a valuation specialist to assist in recalculating the Companys discounted future cash flows model and in evaluating the reasonableness of the significant assumptions including the discount rate; and\ne.We evaluated the competency and objectivity of managements specialists who assisted with preparing the discounted future cash flows analysis.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2014.\nChicago, Illinois\nOctober 13, 2022 ITEM 9 - CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A - CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nManagement conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Form 10-K. The controls evaluation was conducted under the supervision and with the participation of management, including our Chief Executive Officer (CEO) and Chief Financial Officer (CFO). Based upon the controls evaluation, our CEO and CFO have concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were effective to provide reasonable assurance that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified by the SEC, and that such information is accumulated and communicated to management, including the CEO and CFO, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control Over Financial Reporting\nManagements Report on Internal Control Over Financial Reporting is set forth in Part II, Item 8 of this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nWe have not experienced any material impact to our internal controls over financial reporting despite the fact that many of our employees are working remotely due to COVID-19. We are continually monitoring and assessing the effects of COVID-19 on our internal controls to minimize the impact to their design and operating effectiveness.\nThere were no changes in our internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) that occurred during the fiscal year ended July 31, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nInherent Limitations on Effectiveness of Controls\nOur management, including the CEO and CFO, do not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures. ITEM 9B - OTHER INFORMATION\nNone.\nPART III ITEM 10 - DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item (except as set forth below) is contained in Oil-Dris Proxy Statement for its 2022 annual meeting of stockholders under the captions PROPOSALS - 1. Election of Directors, Executive Officers, CORPORATE GOVERNANCE MATTERS - Director Nominations, Board of Directors Committee Membership and Meetings, (including the Audit Committee section thereunder) and Corporate Governance Matters and is incorporated herein by this reference.\nThe Company has adopted a Code of Ethics and Business Conduct (the Code) which applies to all of its directors, officers (including the Companys Chief Executive Officer and senior financial officers) and employees. The Code imposes significant responsibilities on the Chief Executive Officer and the senior financial officers of the Company. The Code, the Companys Corporate Governance Guidelines and the charter of its Audit Committee may be viewed on the Companys website at www.oildri.com and are available in print to any person upon request to Investor Relations, Oil-Dri Corporation of America, 410 North Michigan Avenue, Suite 400, Chicago, Illinois 60611-4213, telephone (312) 321-1515 or e-mail to info@oildri.com. Any amendment to, or waiver of, a provision of the Code which applies to the Companys Chief Executive Officer or senior financial officers and relates to the elements of a code of ethics as defined by the SEC will also be posted on the Companys website. As allowed by the controlled company exemption to certain NYSE rules, the Company does not have a nominating/corporate governance committee (as defined by the NYSE rules) and its compensation committee does not have a charter. ITEM 11 - EXECUTIVE COMPENSATION\nThe information required by this Item is contained in Oil-Dris Proxy Statement for its 2022 annual meeting of stockholders under the captions Executive Compensation, CORPORATE GOVERNANCE MATTERS - Director Compensation, and Board of Directors Committee Membership and Meetings, (including the Compensation Committee thereunder) and is incorporated herein by reference. ITEM 12 - SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nExcept as set forth herein, the information required by this Item is contained in Oil-Dris Proxy Statement for its 2022 annual meeting of stockholders under the captions Principal Stockholders and Security Ownership of Management and is incorporated herein by reference.\nEquity Compensation Plan Information. The following table presents information about compensation plans under which our equity securities are authorized for issuance. There are no outstanding stock options as of July 31, 2022. See Note 7 of the Notes to the Consolidated Financial Statements for further information about these stock-based compensation plans.\nEquity Compensation Plan Information As Of July 31, 2022\nPlan Category Number of securities to be issued upon exercise of outstanding options (in thousands)\n(a) Weighted-average exercise price of outstanding options\n(b) Number of securities remaining available for further issuance under equity compensation plans (excluding securities reflected in column (a)) (in thousands)\n(c)\nEquity compensation plans approved by stockholders - $- 272\nThe number of securities remaining in column (c) above includes, in accordance with the terms of the plan, shares that were: 1) not vested or exercised in full due to expiration or termination, or 2) tendered or withheld for payment of the exercise price or to satisfy tax withholding amounts. ITEM 13 - CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is contained in Oil-Dris Proxy Statement for its 2022 annual meeting of stockholders under the captions CORPORATE GOVERNANCE MATTERS - Certain Relationships and Related Party Transactions and Director Independence and is incorporated herein by reference. ITEM 14 - PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is contained in Oil-Dris Proxy Statement for its 2022 annual meeting of stockholders under the caption Other Matters Relating to the Independent Auditor - Auditor Fees and is incorporated herein by reference.\nPART IV ITEM 15 - EXHIBITS AND FINANCIAL STATEMENT SCHEDULE\n(a)(1) The following consolidated financial statements are contained herein.\nConsolidated Balance Sheets as of July 31, 2022 and July 31, 2021.\nConsolidated Statements of Operations for the fiscal years ended July 31, 2022 and July 31, 2021.\nConsolidated Statements of Comprehensive Income for the fiscal years ended July 31, 2022 and July 31, 2021.\nConsolidated Statements of Stockholders Equity for the fiscal years ended July 31, 2022 and July 31, 2021.\nConsolidated Statements of Cash Flows for the fiscal years ended July 31, 2022 and July 31, 2021.\nNotes to the Consolidated Financial Statements.\nReport of Independent Registered Public Accounting Firm.\n(a)(2) The following financial statement schedule is contained herein:\nSchedule to Financial Statements, as follows:\nSchedule II - Valuation and Qualifying Accounts, years ended July 31, 2022 and July 31, 2021.\nAll other schedules are omitted because they are inapplicable, not required under the instructions or the information is included in the consolidated financial statements or notes thereto.\n(a)(3) The following documents are exhibits to this Report:\nExhibit\nNo. Description SEC Document Reference\n3.1 Certificate of Incorporation of Oil-Dri, as amended. Incorporated by reference to Exhibit 4.1 to Oil-Dris Registration Statement on Form S-8 (Registration No. 333-57625), filed on June 24, 1998.\n3.2 By-Laws of Oil-Dri Corporation of America, as Amended and Restated on December 12, 2017. Incorporated by reference to Exhibit 3 to Oil-Dris (file No. 001-12622) Quarterly Report on Form 10-Q filed on March 9, 2018.\n4.1 Description of Capital Stock Filed herewith\n10.1 Memorandum of Agreement #1450 Fresh Step® dated as of March 12, 2001 between A&M Products Manufacturing Company and Oil-Dri.\nIncorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended October 31, 2020.\nExhibit\nNo. Description SEC Document Reference\n10.2 First Amendment, dated as of December 13, 2002, to Memorandum of Agreement #1450 Fresh Step® dated as of March 12, 2001.\nIncorporated by reference to Exhibit 10.2 to Oil-Dris (File No. 001-12622) Annual Report on Form 10-K for the fiscal year ended July 31, 2007.\n10.3 Second Amendment, dated as of October 15, 2007, to Memorandum of Agreement #1450 Fresh Step® dated as of March 12, 2001.\nIncorporated by reference to Exhibit 10.2 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended October 31, 2020.\n10.4 Third Amendment, dated as of May 27, 2016, to Memorandum of Agreement #1450 Fresh Step® dated as of March 12, 2001.\nIncorporated by reference to Exhibit 10.3 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended October 31, 2020.\n10.5 Exclusive Supply Agreement dated May 19, 1999 between Church & Dwight Co., Inc. and Oil-Dri. Incorporated by reference to Exhibit 10.5 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended October 31, 2020.\n10.6 Credit Agreement, dated January 27, 2006 among the Company, certain subsidiaries of the Company and Harris N.A. Incorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Current Report on Form 8-K filed on February 1, 2006.\n10.7 First Amendment, dated as of December 19, 2008 to Credit Agreement dated as of January 27, 2006. Incorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended January 31, 2009.\n10.8 Second Amendment, dated as of December 21, 2011 to Credit Agreement dated as of January 27, 2006. Incorporated by reference to Exhibit 10 to Oil-Dris (File No. 001-12622) Current Report on Form 8-K filed on December 28, 2011.\n10.9 Third Amendment, dated as of June 21, 2012 to Credit Agreement dated as of January 27, 2006. Incorporated by reference to Exhibit 10.12 to Oil-Dris (File No. 001-12622) Annual Report on Form 10-K for the fiscal year ended July 31, 2012.\n10.10 Fourth Amendment, dated as of December 4, 2014 to Credit Agreement dated as of January 27, 2006. Incorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended October 31, 2014.\n10.11 Fifth Amendment, dated as of January 31, 2019 to Credit Agreement dated as of January 27, 2006. Incorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Current Report on Form 8-K filed on January 31, 2019.\n10.12 Annex A to the Fifth Amendment to Credit Agreement dated as of January 27, 2006. Incorporated by reference to Exhibit 10.2 to Oil-Dris (File No. 001-12622) Current Report on Form 8-K filed on January 31, 2019.\n10.13 $18,500,000 Note Agreement dated as of November 12, 2010 among Oil-Dri Corporation of America, The Prudential Insurance Company of America, Prudential Retirement Insurance and Annuity Company, Forethought Life Insurance Company, Physicians Mutual Insurance Company and BCBSM, Inc. dba Blue Cross and Blue Shield of Minnesota. Incorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Current Report on Form 8-K filed on November 16, 2010.\nExhibit\nNo. Description SEC Document Reference\n10.14 Amended and Restated Note Purchase and Private Shelf Agreement, dated as of May 15, 2020, among Oil-Dri Corporation of America, PGIM, Inc. and existing noteholders and purchasers named therein. Incorporated by reference to Exhibit 10.1 to Oil-Dri's (file No. 001-12622) Current Report on Form 8-K filed on May 21, 2020.\n10.15 Oil-Dri Corporation of America Deferred Compensation Plan, as amended and restated effective April 1, 2003.* Incorporated by reference to Exhibit (10)(j)(1) to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended April 30, 2003.\n10.16 First Amendment, effective as of January 1, 2007, to Oil-Dri Corporation of America Deferred Compensation Plan, as amended and restated effective April 1, 2003.* Incorporated by reference to Exhibit 10.1 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended January 31, 2008.\n10.17 Second Amendment, effective as of January 1, 2008, to Oil-Dri Corporation of America Deferred Compensation Plan, as amended and restated effective April 1, 2003.* Incorporated by reference to Exhibit 10.2 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended January 31, 2008.\n10.18 Oil-Dri Corporation of America Annual Incentive Plan (as amended and restated effective January 1, 2008).* Incorporated by reference to Exhibit 10.4 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended January 31, 2008.\n10.19 Oil-Dri Corporation of America 2005 Deferred Compensation Plan (as amended and restated effective January 1, 2008)* Incorporated by reference to Exhibit 10.3 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended January 31, 2008.\n10.20 First Amendment, effective July 1, 2020, to the Oil-Dri Corporation of America 2005 Deferred Compensation Plan (as amended and restated effective January 1, 2008).* Incorporated by reference to Exhibit 10.24 to Oil Dri's (File No. 001-12622) Annual Report on Form 10-K for the fiscal year ended July 31, 2020.\n10.21 Oil-Dri Corporation of America 2006 Long Term Incentive Plan (as amended and restated effective July 28, 2006)* Incorporated by reference to Appendix A to Oil-Dris (File No. 001-12622) Definitive Proxy Statement on Schedule 14A filed on November 3, 2006.\n10.22 First Amendment, effective as of January 1, 2008, to Oil-Dri Corporation of America 2006 Long Term Incentive Plan (as amended and restated effective July 28, 2006)* Incorporated by reference to Exhibit 10.5 to Oil-Dris (File No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended January 31, 2008.\n10.23 Second Amendment, effective as of October 15, 2015, to Oil-Dri Corporation of America 2006 Long Term Incentive Plan (as previously amended and restated effective July 28, 2006)* Incorporated by reference to Appendix A to Oil-Dris (File No. 001-12622) Definitive Proxy Statement on Schedule 14A filed on October 28, 2015.\n10.24 Third Amendment to Oil-Dri Corporation of America 2006 Long Term Incentive Plan* Incorporated by reference to Appendix A of Oil-Dri's (File No. 001-12622) Definitive Proxy Statement on Schedule 14A filed on October 30, 2019\nExhibit\nNo. Description SEC Document Reference\n10.25 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Employee Stock Option Agreement for Class A Common Stock.* Incorporated by reference to Exhibit 10.2 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.26 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Employee Stock Option Agreement for Common Stock.* Incorporated by reference to Exhibit 10.3 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.27 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Employee Stock Option Agreement for Class B Stock.* Incorporated by reference to Exhibit 10.4 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.28 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Director Stock Option Agreement for Common Stock.* Incorporated by reference to Exhibit 10.5 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.29 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Restricted Stock Agreement for Class A Common Stock.* Incorporated by reference to Exhibit 10.6 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.30 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Restricted Stock Agreement for Common Stock.* Incorporated by reference to Exhibit 10.7 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.31 Form of Oil-Dri Corporation of America 2006 Long Term Incentive Plan Restricted Stock Agreement for Class B Stock.* Incorporated by reference to Exhibit 10.8 to Oil-Dris (file No. 001-12622) Current Report on Form 8-K filed on December 11, 2006.\n10.32 Form of 2018 Restricted Stock Agreement for Class B Stock under the Oil-Dri Corporation of America 2006 Long Term Incentive Plan.* Incorporated by reference to Exhibit 10.29 to Oil-Dri's (file No. 001-12622) Annual Report on Form 10-K for the fiscal year ended July 31, 2018.\n10.33 Fourth Amendment, dated as of December 4, 2020, to Memorandum of Agreement #1450 Fresh Step® dated as of March 12, 2001. Incorporated by reference to Exhibit 10.4 to Oil-Dris (file No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended October 31, 2020.\n10.34 Amendment No. 1 dated December 16, 2021 to the Amended and Restated Note Purchase and Private Shelf Agreement among Oil-Dri Corporation of America, PGIM, Inc. and existing noteholders and purchasers named therein. Incorporated by reference to Exhibit 10.1 to Oil-Dri's (file No. 001-12622) Current Report on Form 8-K filed on December 17, 2021.\n10.35 Oil-Dri BMO - Modification to BMO Harris Bank N.A. Credit Agreement. Incorporated by reference to Exhibit 10.1 to Oil-Dris (file No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended April 30, 2022.\n10.36 Amendment No. 2 to Amended and Restated Note Purchase and Private Shelf Agreement. Incorporated by reference to Exhibit 10.2 to Oil-Dris (file No. 001-12622) Quarterly Report on Form 10-Q for the quarter ended April 30, 2022.\n10.37 Sixth Amendment to Credit Agreement dated as of August 30, 2022, between Oil-Dri Corporation of America and BMO Harris Bank N.A. Incorporated by reference to Exhibit 10.1 to Oil-Dri's (file No. 001-12622) Current Report on Form 8-K filed on September 6, 2022.\n10.38\nAmendment No. 3 to Amended and Restated Note Purchase and Private Shelf Agreement, dated August 30, 2022, among Oil-Dri Corporation of America, PGIM, Inc. and existing noteholders named therein.\nIncorporated by reference to Exhibit 10.2 to Oil-Dri's (file No. 001-12622) Current Report on Form 8-K filed on September 6, 2022.\n14.1 Amended and Restated Code of Ethics Available at Oil-Dris website at www.oildri.com or in print upon request to Investor Relations, Oil-Dri Corporation of America, 410 North Michigan Avenue, Suite 400, Chicago, IL 60611-4213, telephone (312) 321-1515 or e-mail to info@oildri.com.\n21.1 Subsidiaries of Oil-Dri Corporation of America Filed herewith.\n23.1 Consent of Independent Registered Public Accounting Firm Filed herewith.\nExhibit\nNo. Description SEC Document Reference\n31.1 Certifications pursuant to Rule 13a - 14(a). Filed herewith.\n32.1 Certifications pursuant to Section 1350 of the Sarbanes-Oxley Act of 2002. Furnished herewith.\n95 Mine Safety Disclosure Filed herewith.\n101.INS XBRL Taxonomy Instance Document The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH XBRL Taxonomy Extension Schema Document Furnished herewith.\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document Furnished herewith.\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document Furnished herewith.\n104 Cover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101) Furnished herewith\n101.LAB XBRL Taxonomy Extension Labels Linkbase Document Furnished herewith.\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Furnished herewith.\nCertain portions of this exhibit have been redacted pursuant to Item 601(b)(10) of Regulation S-K. A copy of the omitted portions will be furnished supplementally to the Securities and Exchange Commission upon request.\n* Management contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, Oil-Dri has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOIL-DRI CORPORATION OF AMERICA\n(Registrant)\nBy /s/ Daniel S. Jaffee\nDaniel S. Jaffee\nPresident and Chief Executive Officer, Director\nDated: October 13, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of Oil-Dri and in the capacities and on the dates indicated:\n/s/ Daniel S. Jaffee October 13, 2022\nDaniel S. Jaffee\nPresident and Chief Executive Officer,\nChairman of the Board of Directors\n(Principal Executive Officer)\n/s/ Susan M. Kreh October 13, 2022\nSusan M. Kreh\nChief Financial Officer\n(Principal Financial Officer)\n/s/ David M. Atkinson October 13, 2022\nDavid M. Atkinson\nVice President, Corporate Controller\n(Controller)\n/s/ Ellen-Blair Chube October 13, 2022\nEllen-Blair Chube\nDirector\n/s/ Paul M. Hindsley October 13, 2022\nPaul M. Hindsley\nDirector\n/s/ Michael A. Nemeroff October 13, 2022\nMichael A. Nemeroff\nDirector\n/s/ George C. Roeth October 13, 2022\nGeorge C. Roeth\nDirector\n/s/ Amy L. Ryan October 13, 2022\nAmy L. Ryan\nDirector\n/s/ Allan H. Selig October 13, 2022\nAllan H. Selig\nDirector\n/s/ Paul E. Suckow October 13, 2022\nPaul E. Suckow\nDirector\n/s/ Lawrence E. Washow October 13, 2022\nLawrence E. Washow\nDirector\nSCHEDULE II\nOIL-DRI CORPORATION OF AMERICA AND SUBSIDIARIES\nVALUATION AND QUALIFYING ACCOUNTS\nYear Ended July 31,\n2022 2021\n(in thousands)\nAllowance for doubtful accounts and cash discounts:\nBalance, beginning of year $ 1,174 $ 1,078\n(Reduction) addition (237) 82\nNet recovery (15) 14\nBalance, end of year $ 922 $ 1,174\nValuation reserve for income taxes:\nBalance, beginning of year $ 1,362 $ 1,029\nChange 399 333\nBalance, end of year $ 1,761 $ 1,362\nEXHIBITS\nExhibit No. Description\n4.1 Description of Capital Stock\n21.1 Subsidiaries of Oil-Dri Corporation of America\n23.1 Consent of Independent Registered Public Accounting Firm\n31.1 Certifications by Daniel S. Jaffee, President and Chief Executive Officer and Susan M. Kreh, Chief Financial Officer, required by Rule 13a-14(a)\n32.1 Certifications pursuant to Section 1350 of the Sarbanes-Oxley Act of 2002\n95 Mine Safety Disclosure\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Labels Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase\nNote: Stockholders may receive copies of the above listed exhibits, without fee, by written request to Investor Relations, Oil-Dri Corporation of America, 410 North Michigan Avenue, Suite 400, Chicago, Illinois 60611-4213, telephone (312) 321-1515 or e-mail to info@oildri.com."
}