{
    "cik": "745543",
    "company": "PETRO USA, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "2834",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/745543/0001658521-23-000008-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/745543/000165852123000008/atpt06302023_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/745543/0001658521-23-000008.txt",
    "filename": "745543_10K_2023_0001658521-23-000008.htm",
    "content": "ITEM 1. BUSINESS.\nCORPORATE HISTORY\nAll State Properties L.P., a limited partnership (the Partnership) was organized under the Revised Uniform Limited Partnership Act of Delaware on April 27, 1984 to conduct the business formerly carried on by its predecessor corporation, All State Properties, Inc. (the Corporation); and together with the Partnership, the Company. In March 2007 Hubei Longdan (Delaware), Inc. (Longdan Delaware and Subsidiary) was organized under the laws of the State of Delaware as a wholly owned subsidiary of the Company. Longdan Delaware had only nominal assets and no liabilities and had conducted no activities except in connection with the transactions contemplated by the Acquisition Agreement. The Company together with Longdan Delaware referred to herein as the Registrant. Pursuant to a Plan of Liquidation adopted by shareholders of the Corporation on September 30, 1984, the Corporation transferred substantially all of its assets to the Partnership, and the Corporation distributed such limited partnership interests to its shareholders. The Registrant was engaged since inception in land development and the construction and sale of residential housing in various parts of the eastern United States and in Argentina with its most recent transactions being in Florida.\nSince August 1999, the Companys only business has been the ownership of a member interest of approximately 35% in Tunicom LLC, a Florida limited liability company (Tunicom). An affiliate of Tunicom was engaged in the ownership and operation of an adult rental apartment complex until the sale of the apartment complex in August 2000. Since that time, Tunicoms only business was activities relating to its attempts to sell its only remaining asset, five acres of commercial and residential land in Broward County, Florida (the Remaining Property). For a description of the sale of the Remaining Property by Tunicom and the liquidating distribution by the Company, see Item 1(b)(i). Following the completion of the transactions described in Item 1(b)(ii) the Company became a shell company (as defined in Rule 12b-2 under the Securities Exchange Act of 1934, as amended) because it has no or nominal operations and no or nominal assets (other than cash). In March 2007, the Company entered into an Acquisition Agreement which contemplates a reverse merger with a private operating Chinese pharmaceutical company provided that certain conditions are satisfied, including approval of the transaction by its partners (See Item 1(b)(ii)).\nOn November 2, 2007, the Company terminated the Acquisition Agreement based on the breach of its terms by Longdan.\nOn December 20, 2007, Belmont Partners, LLC (Belmont), a Virginia limited liability company, entered into an agreement (the Agreement) with the Company and Stanley R. Rosenthal, an individual resident of the State of Florida (\"Rosenthal\").\nOn March 3, 2008, Greenwich Holdings LLC (Greenwich), a New York limited liability company, entered into a purchase agreement (the Purchase Agreement) with the Company and Joseph Meuse, as General Partner of the Company and a Managing Member of Belmont Partners, LLC (Belmont), a Virginia limited liability company.\nUnder the terms of the Purchase Agreement, Belmont (the Seller), sold to Greenwich (the Buyer) fifty and one one-thousandth percent (50.001%) of the issued and outstanding partnership units (Units), which shall be not more than nine million Units (9,000,000) of the Company for one hundred eighty eight thousand U.S. dollars ($188,000.00). In conjunction with the Agreement, brokers in the transaction received 1,150,000 units and Garry McHenry received 200,000 units as compensation as the new general partner. Greenwich then received their 50.001% or 4,471,000 Units of the Company. As of March 31, 2008, the outstanding Units issued totaled 8,809,065.\nOn May 29, 2008, our predecessor, All State Properties, L.P., a Delaware limited partnership (ASP), and All State Properties Holdings, Inc., a Nevada corporation and wholly-owned subsidiary of ASP (ASPH), entered into an Agreement and Plan of Merger. On May 29, 2008, ASP merged with and into ASPH, so that ASP and ASPH became a single corporation named All State Properties Holdings, Inc. (the Surviving Corporation), which is a corporation and exists under, and is governed by, the laws of the State of Nevada (the Merger)\nAs a result of the Merger, all of the assets, property, rights, privileges, powers and franchises of ASP became vested in, held and enjoyed by the Surviving Corporation, the Surviving Corporation assumed all of the obligations of ASP and we changed our name from All State Properties, L.P. to All State Properties Holdings, Inc.\nUpon the effectiveness and as a result of the Merger, the Certificate of Incorporation and By-laws of ASPH became the Certificate of Incorporation and By-laws of the Surviving Corporation.\nIn addition, each share of common stock of ASP that was issued and outstanding immediately prior to the Merger was converted into 1 issued and outstanding share of common stock of the Surviving Corporation (Common Stock), so that the holders of all of the issued and outstanding shares of common stock of ASP immediately prior to the Merger are the holders of Common Stock of the Surviving Corporation. All shares of ASPH owned by ASP immediately prior to the Merger were surrendered to the Surviving Corporation and cancelled.\nAll State Properties Holdings, Inc. was incorporated under the laws of the State of Nevada on April 24, 2008. All State Properties Holdings, Inc. was to serve as a vehicle to effect a merger, exchange of capital stock, asset acquisition, or other business combination with a domestic or foreign private business. The company not commenced planned principal operations.\nOn November 10, 2020, the majority of the shareholders and board of directors of the Registrant approved a name change for the Registrant to Petro U.S.A., Inc. to reflect a change in the business to become an operator of truck stops and travel centers in the United States, offering diesel fuel and gasoline, full service and fast-food restaurants, maintenance and repair service for trucks, and groceries and convenience goods, among other products and services.\nThe Company has a June 30 year end. As of June 30, 2023, the issued and outstanding shares of common stock totaled 200,030.920.\n(i) Remaining Property Sale\nOn December 19, 2006, Tunicom sold the Remaining Property and thereafter distributed the net sales proceeds to its members, including the Company, as a final liquidating distribution. After payment of certain debt and after setting aside a reserve for expenses, the Company distributed the remaining cash to its partners. Following the distribution, the Company has no assets.\n(ii) Acquisition Agreement\nThe Company had been negotiating a definitive agreement with Hubei Longdan Biological Medicine Technology Co., Ltd. (Longdan), a company organized under the laws of the Peoples Republic of China (the PRC), pursuant to which the Company would issue approximately eighty nine percent (89%) of its capital stock to Longdans shareholders in return for acquisition of the business of Longdan (the Acquisition). Longdan is engaged in the marketing and sale of pharmaceutical products in the PRC.\nOn March 14, 2007, the Company, Longdan Delaware, Longdan and Longdan International Inc., a corporation formed under the laws of Nevis (Longdan International), entered into an Acquisition Agreement (the Acquisition Agreement) pursuant to which the Company will acquire Longdan International and an indirect interest in Longdan and the shareholders of Longdan International will acquire a controlling interest in the Company.\nUnder the terms of the Acquisition Agreement, it is contemplated that the Company will convert from a Delaware limited partnership to a newly-formed Delaware corporation to be called Longdan International Holdings, Inc. (LIH) and Longdan International will merge with and into Longdan Delaware. At the Merger Effective Time (as defined in the Acquisition Agreement), the shareholders of Longdan will be issued shares representing approximately eighty nine percent (89%) of the capital stock of the Company and the Companys shareholders will hold shares representing approximately eleven percent (11%) of the capital stock of the Company, in each case, on an as if converted basis.\nLongdan had agreed to pay all costs associated with the Acquisition, including legal fees incurred in connection with the related corporate law transactions and required filings under the securities laws, and had also agreed to pay for any costs incurred by the Company in connection with maintaining its registration under the Securities Exchange Act of 1934, as amended, after June 30, 2007.\nOn October 31, 2007 Longdan advised the Company that it will not fulfill its contractual commitment to pay these expenses. Accordingly, by its letter to Longdan dated November 2, 2007, All-State terminated the Acquisition Agreement based on this breach.\n(iii)Other Agreements\nOn December 20, 2007, Belmont Partners, LLC (Belmont), a Virginia limited liability company, entered into an agreement (the Agreement) with the Company and Stanley R. Rosenthal, an individual resident of the State of Florida (\"Rosenthal\").\nUnder the terms of the Agreement, Belmont has agreed to pay to the Company the sum of Twenty-Two Thousand Dollars ($22,000.00) (the Loan). As consideration for the Loan, the Company and Rosenthal have agreed to grant Belmont a promissory note to repay the Loan, Rosenthal has agreed to resign as the General Partner of the Company and Joseph Meuse will be appointed the General Partner. In addition, Belmont shall pay for the reasonable legal costs and expenses incurred by the Company and Rosenthal in connection with this Agreement and all related agreements and transactions contemplated by the Agreement up to an amount not to exceed Ten Thousand Dollars ($10,000) in the aggregate (the Legal Expenses). To the extent Belmont pays any Legal Expenses in accordance with the above, the Company agrees that any such amount shall be added to the Loan as additional principal thereunder. Immediately upon execution of this Agreement, Belmont loaned to the Company four thousand dollars ($4,000.00) to be applied against the Legal Expenses.\nIn fiscal 2008, Stanley Rosenthal and Richard Astley surrendered 100,000 and 29,950 partnership units, respectively, back to the company. The return of the units was related to the dismissal of notes receivable in fiscal 2007. The notes receivable was non-recourse and payable solely from the Companys distributions.\nOn February 28, 2008, Greenwich Holdings, LLC (Greenwich), a New York limited liability company, entered into an agreement (the Agreement) with Belmont Partners, LLC, a Virginia limited liability company (Belmont),\nUnder the terms of the Agreement, Greenwich has agreed to purchase a control block in All-State Properties L.P., a Delaware limited partnership (the Company or ASP) consisting of approximately fifty and one-thousandth percent (50.001%) of the outstanding common units of the Company (the Control Block). In consideration for the Control Block, Greenwich agreed to pay the Company One Hundred Eighty-Eight Thousand ($188,000.00) U.S. Dollars.\nA copy of the Agreement entered into by and between Belmont and Greenwich was attached as exhibit 10.1 to this Current Report on Form8-K filed on March 3, 2008.\nOn February 17, 2009, Greenwich, sold the Control Block back o Belmont in consideration of $220,000. Said consideration was never paid by Belmont to Greenwich. On August 1, 2012, Belmont returned the Company back to the sole member of Greenwich, Joseph Passalaqua (Passalaqua). On February 3, 2017, Passalaqua transferred the Control Block to Sea Alive, Inc., a Wyoming corporation.\nOn December 8, 2017, the Company entered into a Common Stock Purchase Agreement with Maurice Parham. Under said Purchase Agreement, the Parties agreed that Joseph Passalaqua would resign from the Board of Directors of the Company and was replaced by Maurice Parham. Maurice Parham was to immediately transfer to the Company the rights to the Universal Nation business plan. Friction & Heat shall cancel its Reduced Control Stock and the Company shall issue the same amount of newly issued shares in exchange of the outstanding debt owed by the Company to Friction as of the date of execution of the Purchase Agreement.\nOn July 2, 2018, the Company entered into a Settlement Agreement, whereby the parties terminated their Purchase Agreement dated December 8, 2017 with Maurice Parham in accordance with the termination provisions in said Purchase Agreement, and return the parties to their pre-Purchase Agreement status. Thereby Maurice Pelham resigned from the Company and Joseph Passalaqua was reinstated to the Board of Directors of the Company. Maurice Parham will not transfer to the Company the rights to the Universal Nation business plan.\nOUR BUSINESS\nOn May 28, 2020, the majority of the shareholders and board of directors of the Registrant approved a name change for the Registrant to Petro U.S.A., Inc. to reflect a change in the business to become an operator of truck stops and travel centers in the United States, offering diesel fuel and gasoline, full service and fast food restaurants, maintenance and repair service for trucks, and groceries and convenience goods, among other products and services.\nEMPLOYEES\nAs of the date of this Annual Report, we have no employees. ITEM 1A. RISK FACTORS.\nWe are a smaller reporting company and therefore not required to provide this information in our Form 10-K. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nAs of the date of this Annual Report, there are no unresolved SEC Staff comments. ITEM 2. DESCRIPTION OF PROPERTY\nWe do not own or lease any property. ITEM 3. LEGAL PROCEEDINGS.\nAs of the date of this Annual Report, management is not aware of any legal proceedings contemplated by any governmental authority or any other party involving us or our properties. As of the date of this Annual Report, no director, officer or affiliate is (i) a party adverse to us in any legal proceeding, or (ii) has an adverse interest to us in any legal proceedings. Management is not aware of any other legal proceedings pending or that have been threatened against us or our properties. ITEM 4. MINE SAFETY DISCLOSURES.\nNot Applicable.\nPART II ITEM 5. MARKET FOR COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND SMALL BUSINESS ISSUER PURCHASERS OF EQUITY SECURITIES.\nMARKET INFORMATION\nOur common stock trades on the over the counter under the symbol \"PBAJ\". The following table sets forth the high and low-price information of the Company's common stock for the periods indicated.\nFISCAL YEAR ENDED JUNE 30, 2023:\nHigh\nLow\nSeptember 30, 2022\n$\n7.00\n$\n7.00\nDecember 31. 2022\n$\n8.01\n$\n8.01\nMarch 31, 2023\n$\n9.99\n$\n9.99\nJune 30, 2023\n$\n7.99\n$\n7.99\nFISCAL YEAR ENDED JUNE 30, 2022:\nSeptember 30, 2021\n$\n2.19\n`\n2.19\nDecember 31, 2021\n$\n1.25\n$\n1.25\nMarch 31, 2022\n$\n9.99\n$\n3.01\nJune 30, 2022\n$\n6.36\n$\n5.00\nSHAREHOLDERS OF RECORD\nAs of June 30, 2023, there were approximately 514 holders of record of our common stock, not including holders who hold their shares in street name.\nDIVIDENDS\nWe have never declared or paid a cash dividend. At this time, we do not anticipate paying dividends in the future. We are under no legal or contractual obligation to declare or to pay dividends, and the timing and amount of any future cash dividends and distributions is at the discretion of our Board of Directors and will depend, among other things, on our future after-tax earnings, operations, capital requirements, borrowing capacity, financial condition and general business conditions. We plan to retain any earnings for use in the operation of our business and to fund future growth. You should not purchase our Shares on the expectation of future dividends.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nEquity Compensation Plan Information\nPlan Category\nNumber of\nsecurities to be issued\nupon exercise\nof outstanding\noptions,\nwarrants and rights\nWeighted-\naverage exercise\nprice of\noutstanding\noptions, warrants\nand rights\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation plans\n(excluding securities\nreflected in column (a))\nEquity compensation plans approved by security holders\nNone\n-\nNone\nEquity compensation plans not approved by security holders\nNone\n-\nNone\nTotal\nNone\n-\nNone\nINFORMATION RELATING TO OUTSTANDING SHARES\nAs of June 30, 2023, there were 200,030,920 shares of our common stock issued and outstanding.\nOf the 200,030,920 common stock issued and outstanding, 200,016,920 shares are owned by officers, directors and principal stock holders. Only 200,030,920 shares (of which 200,016,920 shares are owned by officers, directors and principal stock holders) have been held for a period in excess of six months and are eligible to be resold pursuant to Rule 144 promulgated under the Securities Act.\nThe resale of our shares of common stock owned by officers, directors and affiliates is subject to the volume limitations of Rule 144. In general, Rule 144 permits our affiliate shareholders who have beneficially owned restricted shares of common stock for at least six months to sell without registration, within a three-month period, a number of shares not exceeding one percent of the then outstanding shares of common stock. Furthermore, if such shares are held for at least six months by a person not affiliated with the company (in general, a person who is not one of our executive officers, directors or principal shareholders during the three-month period prior to resale), such restricted shares can be sold without any volume limitation, provided all of the other requirements for resale under Rule 144 are applicable.\nRECENT SALES OF UNREGISTERED SECURITIES\nDuring the year ended June 30, 2023, the Registrant had the following sale of unregistered securities:\nNone\nISSUER PURCHASE OF SECURITIES\nOn May 1, 2022, the majority of the shareholders and board of directors of the Registrant approved the issuance of an additional 200,000,000 shares at par value to a related party for cancelling $20,000 of debt to that same related party thereby increasing the issued shares from 30,920 to 200,030,920 shares. ITEM 6. SELECTED FINANCIAL DATA.\nNot Applicable. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nForward Looking Statements\nThis section and other parts of this Form 10-K annual report includes \"forward-looking statements\", that involves risks and uncertainties. All statements other than statements of historical facts, included in this Form 10-K that address activities, events, or developments that we expect or anticipate will or may occur in the future, including such things as future capital expenditures (including the amount and nature thereof), business strategy and measures to implement strategy, competitive strength, goals, expansion and growth of our business and operations, plans, references to future success, reference to intentions as to future matters, and other such matters are forward-looking statements. In some cases, you can identify forward-looking statements by terminology such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" or \"continue,\" or the negative of such terms or other comparable terminology. These statements are only predictions. Actual events or results may differ materially. These statements are based upon certain assumptions and analyses made by us in light of our experience and our perception of historical trends, current conditions and expected future developments as well as other factors that we believe are appropriate in the circumstances. However, whether actual results and developments will conform to our expectations and predictions is subject to a number of risks, uncertainties, and other factors, many of which are beyond our control.\nAlthough we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance, or achievements. Moreover, we do not assume responsibility for the accuracy and completeness of such forward-looking statements. We are under no duty to update any of the forward-looking statements after the date of this report to conform such statements to actual results.\nOverview\nPetro USA, Inc. (the \"Company\", \"we\", or \"us\") was incorporated under the laws of the State of Nevada on April 24, 2008. All State Properties Holdings, Inc. is an operator of truck stops and travel centers in the United States, offering diesel fuel and gasoline, full service and fast-food restaurants, maintenance and repair service for trucks, and groceries and convenience goods, among other products and services. The Company has a June 30 year end. As of June 30, 2023 the issued and outstanding shares of common stock totaled 200,030,920.\nCertain statements contained below are forward-looking statements (rather than historical facts) that are subject to risks and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements.\nWe are considered a start-up corporation. Our auditors have issued a going concern opinion in the financial statements for the year ended June 30, 2023.\nRESULTS OF OPERATIONS\nWorking Capital\nJune 30\nJune 30\nCurrent Assets\n$\n$\n-\nCurrent Liabilities\n128,506\n104,543\nWorking Capital (Deficit)\n$\n(128,406)\n$\n(104,543)\nCash Flows\nJune 30\nJune 30\nCash Flows from (used in) Operating Activities\n$\n-\n$\n-\nCash Flows from (used in) Financing Activities\n-\n-\nNet Increase (decrease) in Cash During Period\n$\n-\n$\n-\nYEAR ENDED JUNE 30, 2023 COMPARED TO YEAR ENDED JUNE 30, 2022\nREVENUES\nWe have generated revenues of $0 and $0 for the years ended June 30, 2023, and 20221.\nOPERATION AND ADMINISTATIVE EXPENSES\nOperating expenses for the year ended June 30, 2023, were $23,581 compared with $12,860 for the year ended June 30, 2022. The incrase in operating expenses were attributable to an increase in general and administrative expenses from $12,860 for the year ended June 30, 2022 to $23,581 to the year ended June 30, 2023.\nDuring the year ended June 30, 2023, the Company recorded a net loss of $23,863, compared with net loss of $13,143 for the year ended June 30, 2022.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of June 30, 2023, the Company's cash balance was $0 compared to cash balance of $0 as of June 30, 2022. As of June 30, 2023, the Company's total assets were $0 compared to total assets of $0 as of June 30, 2022.\nAs of June 30, 2023, the Company had total liabilities of $128,506 compared with total liabilities of $104,543 as of June 30, 2022. The increase in total liabilities is attributed to an increase in accounts payable and accrued liabilities from $21,089 on June 30, 2022 to $29,568 on June 30, 2023 and an increase in due to related parties from $79,659 on June 30,2022 to $94,861 on June 30, 2023 and an increase in promissory note and accrued interest to related party from $3,795 on June 30,2022 to $4,077 on June 30, 2023.\nAs of June 30, 2023, the Company has a working capital deficit of $128,406 compared with working capital deficit of $104,543 at June 30, 2022 with the increase in the working capital deficit attributed to an increase in accounts payable and accrued liabilities from $21,089 on June 30, 2022 to $29,568 on June 30, 2023 and an increase in due to related parties from $79.659 on June 30,2022 to $94,861 on June 30, 2023 and an increase in promissory note and accrued interest to related party from $3,795 on June 30,2022 to $4,077 on June 30, 2023.\nCashflows from Operating Activities\nDuring the year ended June 30, 2023, and June 30, 2022, the Company did not used any cash for operating activities.\nCashflows from Financing Activities\nDuring the years ended June 30, 2023, the Company received $0 from proceeds from related promissory note compared to $0 received on June 30, 2022.\nCommitments and Contingencies\nOn April 27, 2020, the District Court in Clark County Nevada issued a Default Judgement against defendants Wayne Mower, Robert Kroff and Joseph Moretti stating that their actions including authorizing a 7,500 for 1 reverse stock split of the Registrant were neither authorized nor permitted. The Court stated that the Defendants were not authorized to engage in a reverse stock split. Neither did these Defendants had any ownership or management interest in the company. The Court stated that these Defendants acted with clear disregard of the rights of the shareholders and management. That these Defendants conspired to deprive the shareholders, of their interest in the company. The Court Concluded that the acts of these Defendants were those of fraudulent rogue actors without any authority.\nSubsequent Developments\nNone\nGoing Concern\nWe have not attained profitable operations and are dependent upon the continued financial support from our shareholders, the ability to raise equity or debt financing, and the attainment of profitable operations from our future business. These factors raise substantial doubt regarding our ability to continue as a going concern.\nOFF BALANCE SHEET ARRANGEMENTS\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nCONTRACTUAL OBLIGATIONS\nAs a \"smaller reporting company\" as defined by Item 10 of Regulation S-K, we are not required to provide this information.\nCRITICAL ACCOUNTING POLICIES\nWe have one main products, namely the concealed weapons detection system. In all cases revenue is considered earned when the product is shipped to the customer, installed (if necessary) and accepted by the customer as a completed sale. Each product has an unconditional 30-day warranty, during which time the product can be returned for a complete refund. Customers can purchase extended warranties, which provide for replacement or repair of the unit beyond the period provided by the unconditional warranty. Warranties can be purchased for various periods but generally they are for one-year period that begins after any other warranties expire. The revenue from warranties is recognized on a straight-line bases over the period covered by the warranty. Prior to the issuance of financial statements management reviews any returns subsequent to the end of the accounting period which are from sales recognized during the accounting period and makes appropriate adjustments as necessary. Product prices are fixed or determinable and products are only shipped when collectability is reasonably assured.\nStock Based Compensation\nWe account for share-based compensation at fair value. Stock based compensation cost for stock options granted to employees, board members and service providers is determined at the grant date using an option pricing model. The value of the award that is ultimately expected to vest is recognized as expensed on a straight-line basis over the requisite service period. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nAs a \"smaller reporting company\", the Company is not required to provide this information. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nPETRO USA. INC.\nFINANCIAL STATEMENTS\nJUNE 30, 2023 AND 2022\nC O N T E N T S\nReport of Independent Registered Public Accounting Firm (Gries & Associates, LLC)\nBalance Sheets\nStatements of Operations\nStatements of Stockholders' Deficit\nStatements of Cash Flows\nNotes to the Financial Statements\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street Suite 1100\nDenver, Colorado 80246\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nPetro USA, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Petro USA, Inc. (the Company), which comprise the balance sheet as of June 30, 2023 and June 30, 2022 and the related statements of Operations, Changes in Stockholders Equity, and Cash Flows for the years then ended, and the related notes to the financial statements. In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022, respectively, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United Sates) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we were required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluation of the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nAs shown in the financial statements, the Company incurred net losses of 23,863 during the year ended June 30, 2023 and accumulated losses of $121,825,555. These factors create an uncertainty as to the Companys ability to continue as a going concern. The ability of the Company to continue as a going concern is dependent upon the success of raising additional capital through the issuance of common stock and the ability to generate sufficient operating revenue. The financial statements do not include any adjustments that might be necessary should the Company be unable to continue as a going concern.\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and\nfinancial markets of many countries, including the geographical area in which the Company plans to operate.\nWe have served as the Companys auditor since 2023.\n/s/ Gries & Associates, LLC\nDenver, Colorado\nOctober 12, 2023\nPCAOB# 6778\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado 80246\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nPetro USA, Inc.\n(formerly All State Properties Holdings, Inc.)\nBalance Sheets\nJune 30,\nAssets\nCurrent Assets:\nCash and cash equivalents\n$ 100 $ -\nTotal current assets\n-\nTotal assets\n$ 100 $ -\nLiabilities and Stockholders' Deficit\nCurrent Liabilities:\nAccounts payable and accrued liabilities\n$ 29,568 $ 21,089\nPromissory note and accrued interest to related party\n4,077 3,795\nDue to related parties\n94,861 79,659\nTotal current liabilities\n128,506 104,543\nTotal liabilities\n128,506 104,543\nStockholders' Deficit\nPreferred Stock, $0.0001 par value, 10,000,000 shares authorized,\nPreferred Stock, $0.0001 par value, 10,000,000 shares authorized, none issued and outstanding\n- -\nCommon Stock, $0.0001 par value, 500,000,000 and 290,000,000 shares\nAuthorized, 200,030,920 shares issued and Outstanding,\nCommon Stock, $0.0001 par value, 500,000,000 and 290,000,000 shares Authorized, 200,030,920 shares issued and Outstanding, respectively\n20,003 20,003\nAdditional paid-in capital\n121,677,146 121,677,146\nAccumulated deficit\n(121,825,555 ) (121,801,692 )\nTotal stockholders' deficit\n(128,406 ) (104,543 )\nTotal liabilities and stockholders' deficit\n$ 100 $ -\nThe accompanying notes are an integral part of these financial statements\nPetro USA, Inc.\n(formerly All State Properties Holdings, Inc.)\nStatement of Operations\nFor the Years Ended\nJune 30,\nRevenues\n$ - $ -\nOperating expenses\nOther general and administrative expenses\n23,681 12,860\nTotal operating expenses\n23,581 12,860\nLoss from operations\n(23,581 ) (12,860 )\nOther income (expense)\nLoss on settlement of debt\n- -\nInterest expense\n(282 ) (283 )\nTotal other income (expense)\n(282 ) (283 )\nNet loss\n$ (23,863 ) $ (13,143 )\nBasic and fully diluted loss per common share\n$ - $ -\nBasic and fully diluted weighted average\nBasic and fully diluted weighted average common shares outstanding\n200,030,920 200,030,920\nThe accompanying notes are an integral part of these unaudited financial statements\nPetro USA, Inc.\n(formerly All State Properties Holdings, Inc.\nStatement of Changes in Stockholders' Deficit\nFor the Years Ended June 30, 2023 and 2022\nAdditional\nPreferred Stock\nCommon Stock\nPaid-in\nAccumulated\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance at June 30, 2021\n- - 30,920 $ 3 $ 121,677,146 $ (121,788,549 ) $ (111,400 )\nShares issued for cancellation of debt\n- - 200,000,000 $ 20,000 - - $ 20,000\nNet loss for the year ended June 30, 2022\n- - - - - $ (13,143 ) $ (13,143 )\nBalance at June 30, 2022\n- $ - 200,030,920 $ 20,003 $ 121,677,146 $ (121,801,692 ) $ (104,543 )\nNet loss for the year ended June 30, 2023\n- - - - - $ (23,863 ) $ (23,863 )\nBalance at June 30, 2023\n- $ - 200,030,920 $ 20,003 $ 121,677,146 $ (121,825,555 ) $ (128,406 )\nThe accompanying notes are an integral part of these financial statements\nPetro USA, Inc.\n(formerly All State Properties Holdings, Inc.)\nStatement of Cash Flows\nFor the Years Ended\nJune 30,\nCash Flows from Operating Activities:\nNet loss\n$ (23,863 ) $ (13,143 )\nAdjustments to reconcile net loss to net cash provided\nAdjustments to reconcile net loss to net cash provided by (used in) operating activities:\nIssuance of common stock as share-based compensation\n- -\nLoss on extinguishment of debt\n- -\nChanges in assets and liabilities\nIncrease (decrease) in accounts payable\n8,479 2,014\nIncrease (decrease) in accrued interest to related\nIncrease (decrease) in due to related parties\n15,202 10,846\nNet cash provided by (used in) operating activities\n-\nCash Flows from Investing Activities\n- -\nCash Flows from Financing Activities\n- -\nProceeds from related part promissory note - -\nNet cash provided by (used in) financing activities\n- -\nNet increase (decrease) in cash\n-\nCash and cash equivalents, beginning of period\n- -\nCash and cash equivalents, end of period\n-\nSupplemental disclosure of cash flow information:\nCash paid for interest\n$ - $ -\nCash paid for taxes\n$ - $ -\nNon-cash transactions:\nConversion of related party debt\n- -\nThe accompanying notes are an integral part of these financial statements\nPetro USA, Inc.\nNotes to Financial Statements\nFor the years ended June 30, 2023 and 2022\n1. Organization, Description of Business, and Basis of Accounting\nBusiness Organization\nPetro USA, Inc, formerly All State Properties Holdings, Inc., a corporation (the Company) was organized under the state of Nevada on April 24, 2008 to conduct business formerly carried on by its predecessor partnership, All State Properties L.P. (the Partnership). The Partnership merged with the Company on May 29, 2008. The Company acquired all of the assets and assumed all of the liabilities and obligations of the Partnership. At May 29, 2008 each unit, par value $0.001 per share of the Partnership was converted into one issued and outstanding share of par value $0.0001 common stock of the Corporation.\nOn November 10, 2020, the majority of the shareholders and board of directors of the Registrant approved a name change for the Registrant to Petro U.S.A., Inc. to reflect a change in the business to become an operator of truck stops and travel centers in the United States, offering diesel fuel and gasoline, full service and fast food restaurants, maintenance and repair service for trucks, and groceries and convenience goods, among other products and services.\nThe Companys fiscal year end is June 30th.\nAccounting Basis\nThese financial statements have been prepared on the accrual basis of accounting following generally accepted accounting principles of the United States of America consistently applied.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nIncome Taxes\nThe Company uses the asset and liability method of accounting for income taxes. At June 30, 2023 and 2022, respectively, the deferred tax asset and deferred tax liability accounts, as recorded when material to the financial statements, are entirely the result of temporary differences. Temporary differences represent differences in the recognition of assets and liabilities for tax and financial reporting purposes, primarily share based compensation and loss on settlement of debt.\nAs of June 30, 2023, the deferred tax asset related to the Company's net operating loss (NOL) carry forward is fully reserved. Due to the provisions of Internal Revenue Code Section 338, the Company may have no net operating loss carry forwards available to offset financial statement or tax return taxable income in future periods as a result of a change in control involving 50 percentage points or more of the issued and outstanding securities of the Company.\n.\nPetro USA, Inc.\nNotes to Financial Statements\nFor the years ended June 30, 2023 and 2022\n1. Organization, Description of Business, and Basis of Accounting (Continued)\nDividends\nThe Company has not yet adopted a policy regarding the payment of dividends.\nFair Value of Financial Instruments\nThe carrying value of cash, accounts payable and amounts due to related party approximates its fair value because of the short maturity of these instruments. Unless otherwise noted, it is managements opinion the Company is not exposed to significant interest, currency or credit risks arising from these financial instruments.\nThe Company accounts for financial instruments in accordance with the Financial Accounting Standard Board's Accounting Standards Codification Topic 820 - Fair Value Measurements and Disclosures (\"ASC 820\"), which establishes a framework for measuring fair value and expands disclosure of fair value measurements. Fair value is an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, this policy established a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value as follows:\nLevel 1. Observable inputs such as quoted prices in active markets;\nLevel 2. Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3. Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe following table presents assets that are measured and recognized at fair value on a non-recurring basis:\nLevel 1: None\nLevel 2: None\nLevel 3: None\nThe Fair Value Option permits entities to choose to measure eligible financial instruments and certain other items at fair value at specified election dates. A business entity shall report unrealized gains and losses on items for which the fair value options have been elected in earnings at each subsequent reporting date. For the years ended June 30, 2022 and 2021, there were no applicable items on which the fair value option was elected. The Fair Value Option may impact our consolidated financial statements in the future.\nEarnings (Loss) per Share\nBasic earnings (loss) per share is computed by dividing the net income (loss) available to common shareholders by the weighted-average number of common shares outstanding during the respective period presented in our accompanying financial statements.\nPetro USA, Inc.\nNotes to Financial Statements\nFor the years ended June 30, 2023 and 2022\n1. Organization, Description of Business, and Basis of Accounting (Continued)\nFully diluted earnings (loss) per share is computed similar to basic income (loss) per share except that the denominator is increased to include the number of common stock equivalents (primarily outstanding options and warrants).\nCommon stock equivalents represent the dilutive effect of the assumed exercise of outstanding stock options and warrants, using the treasury stock method, at either the beginning of the respective period presented or the date of issuance, whichever is later, and only if the common stock equivalents are considered dilutive based upon the Companys net income (loss) position at the calculation date.\nAs of June 30, 2023 and 2022, the Companys has no issued and outstanding warrants or options.\n2. Going Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern, which contemplates the realization of assets and the liquidation of liabilities in the normal course of business. However, the Company has incurred significant losses and is dependent on obtaining adequate capital to fund operating losses until it becomes profitable. If the Company is unable to obtain the necessary funding it could cease operations as a new enterprise. This raises substantial doubt about the Companys ability to continue as a going concern for a period of one year from the issuance of these financial statements. These financial statements do not include any adjustments that might result from this uncertainty\n.Income Taxes\nThe Company provides for income taxes asset and liability approach in accounting for income taxes. Deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax bases of assets and liabilities and the tax rates in effect when these differences are expected to reverse. This method requires the reduction of deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe provision for income taxes differs from the amounts which would be provided by applying the statutory federal income tax rate of 21% to the net loss before provision for income taxes for the following reasons:\nJune 30\nIncome tax expense at statutory rate 7,210 7,210\nValuation Allowance (7,210 ) (7,210 )\nIncome tax expense per books $ - $ -\nPetro USA, Inc.\nNotes to Financial Statements\nFor the years ended June 30, 2023 and 2022\nIncome Taxes (Continued)\nNet deferred tax assets consist of the following components as of June 30:\nNet Operating Loss Carryover (249,117 ) $ (225,254 )\nValuation Allowance 249,117 225,254\nNet Deferred Tax Asset $ - $ -\nThe Company has a net operating loss carryover of $249,117 as of June 30, 2023.\nThe Company has net operating loss carry forwards that were derived solely from operating losses from prior years. These amounts can be carried forward to offset future taxable income indefinitely. No provision was made for federal income taxes as the Company has significant net operating losses.\nAt June 30, 2023 and 2022, the Company has established a valuation allowance equal to the deferred tax assets as there is no assurance that the Company will generate future taxable income to utilize these assets.\nDue to the provisions of Internal Revenue Code Section 338, the Company may have no net operating loss carry forwards available to offset financial statement or tax return taxable income in future periods as a result of a change in control involving 50 percentage points or more of the issued and outstanding securities of the Company. The Company had no uncertain tax positions at June 30, 2023 or 2022.\n4. Capital Stock\nThe Company has 10,000,000 shares of Preferred Stock authorized at a par value of $0.0001 and none has been issued at June 30, 2023 and 2022.\nAt June 30, 2023 and 2022, the Company had 200,030,920 common shares issued and outstanding respectively.\nOn April 12, 2022, the majority of the shareholders and board of directors of the Registrant approved the issuance of an additional\nThe Company has no other classes of shares authorized for issuance. At June 30, 2022 and 2021, there were no outstanding stock options or warrants.\nPetro USA, Inc.\nNotes to Financial Statements\nFor the years ended June 30, 2023 and 2022\n5. Related Party Transactions\nThe Amounts due to related parties are advances from a company controlled by the Company's Chief Executive Officer in order to pay operating expenses of the Company. These advances are non-interest bearing and payable upon demand.\nThe promissory note to related parties is a note for $3,500 to the Companys Chief Executive Officer accruing interest at 8% per annum.\n6. Subsequent Events\nNone ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nGRIES AND ASSOCIATES, LLC\nThis decision to engage Gries and Associates, LLC was approved by our full Board of Directors. Because we have no standing audit committee, our full Board of Directors participated in and approved the decision to change independent accountants. Presently, the Board of Directors acts as the audit committee. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nWe have carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer/Principal Financial Officer, of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\")) as of June 30, 2023. Based on such evaluation, we have concluded that, as of such date, our disclosure controls and procedures were not effective to ensure that information required to be disclosed by us in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in applicable SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer/Principal Financial Officer, as appropriate, to allow timely discussions regarding required disclosure.\nManagement's Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining internal control over financial reporting for our internal control system was designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Internal control over our financial reporting includes those policies and procedures that:\n(1)pertain to the maintenance of records that in reasonable detail accurately and fairy reflect our transactions.\n(2)provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorization of our management and directors; and\n(3)provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nAll internal control systems, no matter how well designed, have inherent limitations, including the possibility of human error or circumvention through collusion of improper overriding of controls. Therefore, even those internal control systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation. Further, because of changes in conditions, the effectiveness of internal control may vary over time.\nOur management assessed the effectiveness of our internal control over financial reporting as of June 30, 2023. In making its assessment of internal control over financial reporting, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO 2013\") in Internal-Control-Integrated Framework and implemented a process to monitor and assess both the design and operating effectiveness of our internal controls. Based on this assessment, management believes that as of June 30, 2023, our internal control over financial reporting was not effective.\nWe have instituted a remediation plan which involves reeducating our management, the accounting staff, and the administrative staff as to the elements of a completed sale. We increased the oversight of the process by increasing the frequency of involvement of outside accounting consultants. Internal systems are being put into place to track and document significant dates, such as delivery, installation and customer acceptance. In addition, the bookkeeping system has been modified so that all sales of extended warranties are automatically recorded as deferred revenue and that the amount of revenue that is ultimately recognized as warranty revenue is as the result of an analysis of the significant aspects of the warranty such as coverage and period.\nChanges in Internal Control Over Financial Reporting\nOur management has evaluated, with the participation of our Chief Executive Officer/Chief Financial Officer, changes in our internal controls over financial reporting (as defined in Rule 13a-15(f) of the Exchange Act) during the fourth quarter of 2023. In connection with such evaluation, there have been no changes to our internal control over financial reporting that occurred since the beginning of our fourth quarter of 2023 that have materially affected, or are reasonably likely to materially affect our internal control over financial reporting. While there have been no changes, we have assessed our internal controls as being deficient and will be taking steps beginning in 2024 to remedy such deficiencies. ITEM 9B. OTHER INFORMATION.\nThere are no further disclosures.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nDirectors and Executive Officers\nThe following table includes the names and positions held of our executive officers and directors who served during the years ended June 30, 2022 and/or June 30, 2023 and their current ages:\nNAME\nAGE\nPOSITION\nDIRECTOR SINCE\nJoseph C. Passalaqua\nChief Executive Officer, Chief Financial Officer\nSecretary and Director\nJoseph C. Passalaqua\nMr. Passalaqua, 74, was employed by Summit Auto Group from 2012 through 2016. He became President of Plantation Corp., in January of 2010. He is the owner of Prime Auto Group, LLC which he formed in August 2015.\nINVOLVEMENT IN CERTAIN LEGAL PROCEEDINGS\nNone of our directors, executive officers or control persons has been involved in any of the legal proceedings required to be disclosed in Item 401 of Regulation S-K, during the past five years.\nCORPORATE GOVERNANCE MATTERS\nAudit Committee\nThe board of directors has established an audit committee, and the functions of the audit committee are currently performed by our Corporate Secretary, with assistance by expert independent accounting personnel and oversight by the entire board of directors. We are not currently subject to any law, rule or regulation requiring that we establish or maintain an audit committee.\nBoard of Directors Independence. Our board of directors currently consists of three members. We are not currently subject to any law, rule or regulation requiring that all or any portion of our board of directors include \"independent\" directors.\nAudit Committee Financial Expert. Our board of directors has determined that we do not have an audit committee financial expert serving on our audit committee within the meaning of Item 407(d)(5) of Regulation S-K. In general, an \"audit committee financial expert\" is an individual member of the audit committee who (a) understands generally accepted accounting principles and financial statements, (b) is able to assess the general application of such principles in connection with accounting for estimates, accruals and reserves, (c) has experience preparing, auditing, analyzing or evaluating financial statements comparable to the breadth and complexity to the Company's financial statements, (d) understands internal controls over financial reporting and (e) understands audit committee functions.\nWe have not yet replaced our former audit committee financial expert, but we are engaged in finding a suitable replacement.\nCode of Ethics\nWe have not adopted a code of ethics for our executive officers, directors and employees. However, our management intends to promote honest and ethical conduct, full and fair disclosure in our reports to the SEC, and compliance with applicable governmental laws and regulations.\nNominating Committee\nWe have not yet established a nominating committee. Our board of directors, sitting as a board, performs the role of a nominating committee. We are not currently subject to any law, rule or regulation requiring that we establish a nominating committee.\nCompensation Committee\nWe have not established a compensation committee. Our board of directors, sitting as a board, performs the role of a compensation committee. We are not currently subject to any law, rule or regulation requiring that we establish a compensation committee. During the last fiscal year, Mr. Gunther Than, an executive officer, participated in our board of directors' deliberations concerning executive officer compensation.\nSECTION 16(a) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act of 1934 requires officers and directors, and persons who own more than ten percent of a registered class of our equity securities, to file reports of ownership and changes in ownership with the Commission. Officers, directors and greater than ten percent beneficial owners are required by Commission regulations to furnish us with copies of all forms they file pursuant to Section 16(a). Based solely on our review of the copies of such forms received and written representations from reporting persons required to file reports under Section 16(a), all of the Section 16(a) filing requirements applicable to such persons, with respect to fiscal year 2023, appear not to have been complied with to the best of our knowledge. ITEM 11. EXECUTIVE COMPENSATION.\nNone.\nName\nSalary\nPosition\nJoseph C. Passalaqua\n$\nAs Chairman of the Board, Chief Executive Officer and Director\nSUMMARY COMPENSATION TABLE‡\nName and Principal Position\nFiscal\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNonequity\nIncentive\nPlan\nCompen-\nsation ($)\nNon-\nQualified\nDeferred\nCompen-\nsation\nEarnings\n($)\nAll\nOther\nCompen-\nsation\n($)\nTotal\n($)\nJoseph C. Passalaqua\n$\n$\n$\n$\n$\n$\n$\n$\n(Principal Chief Executive Officer, Chief Financial Officer\n$\n$\n$\n$\n$\n$\n$\n$\nPresident and Director)\nEMPLOYMENT CONTRACTS AND TERMINATION OF EMPLOYMENT AND CHANGE-IN-CONTROL ARRANGEMENTS\nNone\nDirectors Compensation\nNo director received compensation for services rendered in any capacity to us during the fiscal years ended June 30, 2022 and June 30, 2023.\nIndemnification of Directors and Officers\nOur Articles of Incorporation, as amended and restated, and our Bylaws provide for mandatory indemnification of our officers and directors, except where such person has been adjudicated liable by reason of his negligence or willful misconduct toward the Company or such other corporation in the performance of his duties as such officer or director. Our Bylaws also authorize the purchase of director and officer liability insurance to insure them against any liability asserted against or incurred by such person in that capacity or arising from such person's status as a director, officer, employee, fiduciary, or agent, whether or not the corporation would have the power to indemnify such person under the applicable law.\nCompensation Committee Interlocks and Insider Participation\nWe have not established a compensation committee. We are not currently subject to any law, rule or regulation requiring that we establish a compensation committee. During the last fiscal year, Mr. Gunther Than, an executive officer, participated in our board of directors' deliberations concerning executive officer compensation. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following tables set forth information as of June 30, 2023 regarding the beneficial ownership of our common stock each stockholder who is known by the Company to own beneficially in excess of 5% of our outstanding common stock; each director known to hold common or preferred stock; the Company's chief executive officer; and the executive officers and directors as a group. Except as otherwise indicated, all persons listed below have (i) sole voting power and investment power with respect to their shares of stock, except to the extent that authority is shared by spouses under applicable law, and (ii) record and beneficial ownership with respect to their shares of stock.\nNUMBER OF\nSHARES\nPERCENT OF\nSHARES\nNAME AND ADDRESS OF\nTITLE\nBENEFICIALLY\nBENEFICIALLY\nBENEFICIAL OWNER\nOF CLASS\nOWNED\nOWNED\nJoseph C. Passalaqua\nCommon\n200,016,922\n99.993\n%\n106 Glenwood Drive\nLiverpool, NY 13090\nAll Directors and officers as a group (1 member)\nCommon\n200,016,922\n99.993\n%\nThe above table reflects share ownership as of the most recent date. Each share of common stock has one vote per share on all matters submitted to a vote of our shareholders. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nWe do not have a specific policy or procedure for the review, approval, or ratification of any transaction involving related persons. We historically have sought and obtained funding from officers, directors, and family members as these categories of persons are familiar with our management and often provide better terms and conditions than we can obtain from unassociated sources. Also, we are so small that having specific policies or procedures of this type would be unworkable. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe following table shows the fees paid or accrued for the audit and other services provided by our independent registered public accounting firm.\nAudit fees\n$8,000\n$8,000\nAudit related fees\nTax fees\nAll other fees\nAudit Fees\nAudit fees represent the professional services rendered for the audit of our annual financial statements and the review of our financial statements included in quarterly reports, along with services normally provided by the accountant in connection with statutory and regulatory filings or engagements.\nAudit Related Fees\nAudit-related fees represent professional services rendered for assurance and related services by the principal accountant that are reasonably related to the performance of the audit or review of our financial statements that are not reported under audit fees.\nTax Fees\nTax fees represent professional services rendered by the principal accountant for tax compliance, tax advice, and tax planning.\nAll Other Fees\nAll other fees represent fees billed for products and services provided by the principal accountant, other than the services reported for the other categories.\nPRE-APPROVAL POLICIES\nOur audit committee does not rely on pre-approval policies and procedures. Typically, Management has sought out audit firm candidates and presented them to the audit committee. Before the auditor renders audit and non-audit services our board of directors approves the engagement.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following exhibits are filed as part of this Form 10-K:\n31.1\nRule 13a-15(e)/15d-15(e) Certification by the Chief Executive Officer *\n31.2\nRule 13a-15(e)/15d-15(e) Certification by the Chief Financial Officer *\n32.1\nCertification by the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 *\n32.2\nCertification by the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 *\n*Filed herewith\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on October 12, 2023.\nPetro USA, Inc..\nBy:\n/ s/Joseph C, Passalaqua\nJoseph C. Passalaqua\nChief Executive Officer\n(Principal executive officer)\nBy:\n/ s/Joseph C, Passalaqua\nJoseph C. Passalaqua\nChief Financial Officer\n(Principal financial officer)"
}