{
    "cik": "754811",
    "company": "U S GLOBAL INVESTORS INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-16",
    "period_of_report": "2023-06-30",
    "sic": "6282",
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/754811/0001437749-23-032363-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/754811/000143774923032363/usglobal20230630_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/754811/0001437749-23-032363.txt",
    "filename": "754811_10K_2023_0001437749-23-032363.htm",
    "content": "Item 1. Business\nThis Annual Report on Form 10-K contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. In addition, U.S. Global Investors, Inc. and its subsidiaries (collectively, U.S. Global or the Company) may make other written and oral communications from time to time that contain such statements. Forward-looking statements include statements as to industry trends, future expectations of the Company, and other matters that do not relate strictly to historical facts and are based on certain assumptions by management. These statements are often identified by the use of words such as may, will, expect, believe, anticipate, intend, could, should, estimate, or continue, and similar expressions or variations. These statements are based on the beliefs and assumptions of Company management based on information currently available to management. Such forward-looking statements are subject to risks, uncertainties and other factors that could cause actual results to differ materially from future results expressed or implied by such forward-looking statements. Important factors that could cause actual results to differ materially from the forward-looking statements include, among others, the risks described in Part I, Item 1A, Risk Factors, and elsewhere in this report and other documents filed or furnished by U.S. Global from time to time with the U.S. Securities and Exchange Commission (SEC). U.S. Global cautions readers to carefully consider such factors. Furthermore, such forward-looking statements speak only as of the date on which such statements are made. Except to the extent required by applicable law, U.S. Global undertakes no obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements.\nU.S. Global, a Texas corporation organized in 1968, is a registered investment adviser under the Investment Advisers Act of 1940, as amended (Advisers Act). The Company, with principal operations located in San Antonio, Texas, manages two business segments:\n1.\nInvestment Management Services, through which the Company offers, to U.S. Global Investors Funds (USGIF or the Fund(s)) and exchange traded fund (ETF) clients, a range of investment management products and services to meet the needs of individual and institutional investors; and\n2.\nCorporate Investments, through which the Company invests for its own account in an effort to add growth and value to its cash position. The Company holds a significant amount of its total assets in investments.\nAs part of its investment management business, the Company provides: (1) investment advisory services and (2) administrative services to the mutual funds advised by the Company. The fees from these services, as well as investment income, are the primary sources of the Companys revenue.\nBusiness Segments\nBusiness segments are discussed below.\nInvestment Management Services\nInvestment Advisory Services. The Company furnishes an investment program for each of the clients it manages and determines, subject to overall supervision by the applicable board of trustees of the clients, the clients investments pursuant to an advisory agreement. Consistent with the investment restrictions, objectives and policies of the particular client, the portfolio team for each client determines what investments should be purchased, sold, and held, and makes changes in the portfolio deemed necessary or appropriate. In the advisory agreement, the Company is charged with seeking the best overall terms in executing portfolio transactions and selecting brokers or dealers.\nAs required by the Investment Company Act of 1940, as amended (Investment Company Act), the advisory agreement with USGIF is subject to annual renewal and is terminable upon a 60 days' notice. In September 2023, the Board of Trustees of USGIF approved the annual renewal of the advisory agreement.\nIn addition to providing advisory services to USGIF, the Company provides advisory services to three U.S.-based ETFs: U.S. Global Jets ETF, U.S. Global GO GOLD and Precious Metal Miners ETF, and the U.S. Global Sea to Sky Cargo ETF. The advisory agreement for the U.S. based ETFs have been renewed through July 2024. The Company also serves as investment advisor to one European-based ETF, the U.S. Global Jets UCITS ETF. The advisory services agreement for the U.S. Global Jets UCITS ETF is not subject to renewal on an annual basis and is terminable upon 6-months' notice.\nNet assets under management on June 30, 2023, and 2022, are detailed in the following table.\nAssets Under Management (AUM)\nFund\nTicker\nJune 30, 2023\nJune 30, 2022\n(dollars in thousands)\nETF Clients\nAirline and Cargo\nU.S. Global Jets ETF\nJETS\n$ 1,939,144\n$ 2,453,268\nU.S. Global Jets UCITS ETF\nJETS\n5,893\n12,934\nU.S. Global Sea to Sky ETF\nSEA\n3,636\n7,568\nTotal Airline and Cargo\n1,948,673\n2,473,770\nGold and Natural Resources\nU.S. Global GO GOLD and Precious Metal Miners ETF\nGOAU\n92,980\n76,609\nTotal Gold and Natural Resources\n92,980\n76,609\nTotal ETF Clients\n2,041,653\n2,550,379\nU.S. Global Investors Funds\nGold and Natural Resources\nGlobal Resources\nPSPFX\n50,758\n57,385\nWorld Precious Minerals\nUNWPX\n47,661\n59,075\nGold and Precious Metals\nUSERX\n99,697\n111,953\nTotal Gold and Natural Resources\n198,116\n228,413\nEmerging Markets\nEmerging Europe\nEUROX\n12,274\n10,821\nChina Region\nUSCOX\n6,707\n7,624\nTotal Emerging Markets\n18,981\n18,445\nInternational Equity\nGlobal Luxury Goods\nUSLUX\n48,232\n39,508\nTotal International Equity\n48,232\n39,508\nBond\nU.S. Government Securities Ultra-Short Bond\nUGSDX\n33,214\n35,490\nNear-Term Tax Free\nNEARX\n29,896\n35,671\nTotal Bond\n63,110\n71,161\nTotal U.S. Global Investors Funds\n328,439\n357,527\nTotal AUM\n$ 2,370,092\n$ 2,907,906\nAdministrative Services. The Company also manages, supervises and conducts certain other affairs of USGIF, subject to the control of the Funds Board of Trustees pursuant to an administrative services agreement. The administrative services agreement with USGIF is subject to renewal on an annual basis and is terminable upon 60 days' notice. In September 2023, the Board of Trustees of USGIF approved the annual renewal of the advisory agreement.\nCorporate Investments\nInvestment Activities. In addition to providing management and advisory services, the Company is actively engaged in investing for its own account. See segment information in the Notes to the Consolidated Financial Statements at Note 16, Financial Information by Business Segment, of this Annual Report on Form 10-K.\nAdditional Segment Information\nSee additional financial information about business segments in Part II, Item 8, Financial Statements and Supplementary Data at Note 16, Financial Information by Business Segment, of this Annual Report on Form 10-K.\nHuman Capital\nAs of June 30, 2023, U.S. Global and its wholly-owned subsidiaries employed 21 full-time employees and 3 part-time employees. Our compensation program is designed to attract, retain and reward qualified individuals who possess the skills and motivation necessary to support our business objectives and assist in the achievement of goals. Key to our compensation program are performance-based cash and fund share bonuses and incentives for achieving professional certifications. In addition to base salary and bonus compensation, we also offer employees benefits such as life, disability, and health (medical, dental and vision) insurance, paid time off, a 401(k) plan that includes a match, discretionary profit-sharing, and assistance with savings programs. We also offer long-term incentive awards which include stock options.\nCompetition\nThe mutual fund industry is highly competitive. According to the Investment Company Institute, at the end of 2022 there were approximately 8,800 domestically registered open-end investment companies and approximately 3,000 exchange-traded funds of varying sizes and investment policies, whose shares are being offered to the public in the U.S. In addition to competition from other mutual fund managers and investment advisers, the Company and the mutual fund industry are in competition with various investment alternatives offered by insurance companies, banks, securities broker-dealers, and other financial institutions. Many of these institutions are able to engage in more liberal advertising than mutual funds and ETFs and may offer accounts at competitive interest rates, which may be insured by federally chartered corporations such as the Federal Deposit Insurance Corporation.\nA number of mutual fund groups are significantly larger than the funds managed by U.S. Global, offer a greater variety of investment objectives and have greater resources to promote the sale of investments therein. However, the Company believes it has the resources, products, and personnel to compete with these other mutual funds. In particular, the Company is known for its expertise in gold mining and exploration, natural resources, and airlines. Competition for sales of fund shares is influenced by various factors, including investment objectives and performance, advertising and sales promotional efforts, distribution channels, and the types and quality of services offered to fund shareholders.\nSuccess in the investment advisory business is substantially dependent on each funds investment performance, the quality of services provided to shareholders, and the Companys efforts to market the Funds and ETFs effectively. Operating revenues from management and administrative services fees are based on the assets of the funds under management. Costs of distribution and compliance continue to put pressure on profit margins for the mutual fund industry.\nDespite the Companys expertise in gold mining and exploration, natural resources, and airlines, the Company faces the same obstacles many advisers face, namely uncovering undervalued investment opportunities as the markets face further uncertainty and increased volatility. In addition, the growing number of alternative investments, especially in specialized areas, has created pressure on the profit margins and increased competition for available investment opportunities.\nSupervision and Regulation\nThe Company and the clients the Company manages and administers operate under certain laws, including federal and state securities laws, governing their organization, registration, operation, legal, financial, and tax status. Among the potential penalties for violation of the laws and regulations applicable to the Company are fines, imprisonment, injunctions, revocation of registration, and certain additional administrative sanctions. Any determination that the Company or its management has violated applicable laws and regulations could have a material adverse effect on the business of the Company. Moreover, there is no assurance that changes to existing laws, regulations, or rulings promulgated by governmental entities having jurisdiction over the Company and its clients will not have a material adverse effect on the Companys business. The Company has no control over regulatory rulemaking or the consequences it may have on the mutual fund and investment advisory industry.\nRegulatory pronouncements and oversight have significantly increased the burden of compliance infrastructure with respect to the mutual fund industry and the capital markets. This momentum of regulations has contributed significantly to the costs of managing and administering mutual funds.\nU.S. Global is registered as an investment adviser with the SEC. As a registered investment adviser, it is subject to the requirements of the Advisers Act, and the SECs regulations thereunder, as well as to examination by the SECs staff. The Advisers Act imposes substantive regulation on virtually all aspects of the Companys business and relationships with the Companys clients. Applicable rules relate to, among other things, fiduciary duties to clients, transactions with clients, effective compliance programs, conflicts of interest, advertising, recordkeeping, reporting, and disclosure requirements. The Funds and the ETFs for which the Company acts as the investment adviser are registered with the SEC under the Investment Company Act. The Investment Company Act imposes additional obligations, including detailed operational requirements for both funds and their advisers. Moreover, an investment advisers contract with a registered fund may be terminated by the fund on not more than 60 days notice and is subject to annual renewal by the funds board after an initial two-year term. Both the Advisers Act and the Investment Company Act regulate the assignment of advisory contracts by the investment adviser. The SEC is authorized to institute proceedings and impose sanctions for violations of the Investment Advisers Act and the Investment Company Act, ranging from fines and censures to termination of an investment advisers registration. The failure of the Company, or the Funds and ETFs which the Company advises, to comply with the requirements of the SEC could have a material adverse effect on the Company. The Company is also subject to federal and state laws affecting corporate governance, including the Sarbanes-Oxley Act of 2002 (S-Ox Act), as well as rules adopted by the SEC.\nU.S. Global is required to keep and maintain certain reports and records, which must be made available to the SEC upon request.\nU.S. Global manages clients portfolios on a discretionary basis, with the authority to enter into security transactions, select broker-dealers to execute trades, and negotiate brokerage commissions. The Company may receive soft dollar credits from certain broker-dealers that are used to pay for research and related services or products, which therefore has the effect of reducing certain operating expenses. These soft dollar arrangements are intended to be within the safe harbor provisions of the Securities Exchange Act of 1934. If the ability to use soft dollar arrangements were reduced or eliminated as a result of statutory amendments, new regulations or a change in business practices, the Companys operating expenses would increase.\nRelationships with Clients\nThe business of the Company is to a significant degree dependent on its association and contractual relationships with USGIF and exchange traded fund clients. In the event the advisory or administrative agreements with USGIF or the advisory agreements with exchange traded fund clients are canceled or not renewed pursuant to the terms thereof, the Company would be substantially adversely affected. U.S. Global considers its relationships with its clients to be good, and management has no reason to believe that the management and service contracts will not be renewed in the future; however, there is no assurance that USGIF and/or the exchange traded fund clients will choose to continue their relationships with the Company.\nAvailable Information\nThe Companys Internet website address is www.usfunds.com. Information contained on the Companys website is not part of this annual report on Form 10-K. The Companys annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed with (or furnished to) the SEC are available through a link on the Companys Internet website, free of charge, as soon as reasonably practicable after such material is filed or furnished. (The link to the Companys SEC filings can be found at www.usfunds.com by clicking Investor Relations.) The Company routinely posts important information on its website.\nThe Company also posts its Corporate Governance Guidelines, Code of Business Conduct, Code of Ethics for Principal Executive and Senior Financial Officer and the charters of the audit and compensation committees of its Board of Directors on the Companys website in the Policies and Procedures section of \"About Us.\" The Companys SEC filings and governance documents are available in print to any stockholder that makes a written request to: Investor Relations, U.S. Global Investors, Inc., 7900 Callaghan Road, San Antonio, Texas 78229.\nThe Company files reports electronically with the SEC via the SECs Electronic Data Gathering, Analysis and Retrieval system (EDGAR), which may be accessed through the Internet. The SEC maintains an Internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC, at http://www.sec.gov.\nInvestors and others should note that we announce material financial information to our investors using the website, SEC filings, press releases, public conference calls and webcasts. We also use social media to communicate with our customers and the public about our company. It is possible that the information we post on social media could be deemed to be material information. Therefore, we encourage investors, the media, and others interested in our company to review the information we post on social media channels listed below. This list may be updated from time to time.\nhttps://www.facebook.com/USFunds\nhttps://twitter.com/USFunds\nhttps://twitter.com/USGlobalETFs\nhttps://www.linkedin.com/company/u-s-global-investors\nhttps://www.instagram.com/usglobal\nhttps://pinterest.com/usfunds\nhttps://www.youtube.com/c/usglobalinvestorssanantonio\nhttps://www.youtube.com/channel/UCDkX1zvbWPyWc99esHOhwRQ\nInformation contained on our website or on social media channels is not deemed part of this report. Item 1A. Risk Factors\nThe Company faces a variety of significant and diverse risks, many of which are inherent in the business. Described below are certain risks that could materially affect the Company. Other risks and uncertainties that the Company does not presently consider to be material, or of which the Company is not presently aware, may become important factors that affect it in the future. The occurrence of any of the risks discussed below could materially and adversely affect the business, prospects, financial condition, results of operations, or cash flow.\nRisk Factors Related to Our Industry\nThe investment management business is intensely competitive.\nCompetition in the investment management business is based on a variety of factors, including:\n●\nInvestment performance;\n●\nInvestor perception of an investment teams drive, focus, and alignment of interest with them;\n●\nQuality of service provided to, and duration of relationships with, clients and shareholders;\n●\nBusiness reputation; and\n●\nLevel of fees charged for services.\nThe Company competes with a large number of investment management firms, commercial banks, broker-dealers, insurance companies, and other financial institutions. Competitive risk is heightened by the fact that some competitors may invest according to different investment styles or in alternative asset classes which the markets may perceive as more attractive than the Companys investment approach. If the Company is unable to compete effectively, revenues and earnings may be reduced, and the business could be materially affected.\nFailure to comply with government regulations could result in fines, which could cause the Companys earnings and stock price to decline.\nThe Company is subject to a variety of foreign and domestic federal securities laws and agencies, including, but not limited to, the Advisers Act, the Investment Company Act, the S-Ox Act, the Gramm-Leach-Bliley Act of 1999, the Bank Secrecy Act of 1970, as amended, the USA PATRIOT Act of 2001, the SEC, FINRA, and NASDAQ. Moreover, financial reporting requirements and the processes, controls, and procedures that have been put in place to address them, are comprehensive and complex. While management has focused attention and resources on compliance policies and procedures, non-compliance with applicable laws or regulations could result in fines, sanctions or censures which could affect the Companys reputation, and thus its revenues and earnings.\nOur business is subject to substantial risk from litigation, regulatory investigations and potential securities laws liability.\nMany aspects of U.S. Globals business involve substantial risks of litigation, regulatory investigations and/or arbitration. The Company is exposed to liability under federal and state securities laws, other federal and state laws and court decisions, as well as rules and regulations promulgated by the SEC and other regulatory bodies. U.S. Global, its subsidiaries, and/or officers could be named as parties in legal actions, regulatory investigations and proceedings. An adverse resolution of any lawsuit, legal or regulatory proceeding or claim against the Company could result in substantial costs or reputational harm to the Company and have a material adverse effect on the Companys business, financial condition or results of operations, which, in turn, may negatively affect the market price of the Companys common stock and U.S. Globals ability to pay dividends. In addition to these financial costs and risks, the defense of litigation or arbitration may divert resources and managements attention from operations.\nIncreased regulatory and legislative actions and reforms could increase costs and negatively impact the Companys profitability and future financial results.\nThe Company is subject to financial services laws, regulations, corporate governance requirements, administrative actions and policies. During the past two decades, federal securities laws have been substantially augmented and made significantly more complex by the S-Ox Act, the USA PATRIOT Act of 2001, and the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act). With new laws and changes in interpretations and enforcement of existing requirements, the associated time the Company must dedicate to, and related costs the Company must incur in, meeting the regulatory complexities of the business have increased. In order to comply with these requirements, the Company has had to expend additional time and resources. Future changes in financial institution regulation may increase the costs of compliance and the complexity of operations.\nFurther, adverse results of regulatory investigations of mutual fund, investment advisory, and financial services firms could tarnish the reputation of the financial services industry generally, and mutual funds and investment advisers more specifically, causing investors to avoid further fund investments or redeem their balances. Redemptions would decrease the Companys assets under management, which would reduce its advisory revenues and net income.\nNew tax legislation or changes to existing tax laws, our failure to adequately comply with tax laws, or the outcome of any audits or regulatory disputes with respect to our compliance with tax law could adversely affect us.\nChanges to tax law could be enacted in the future that could have a material adverse effect on our business, results of operations, and financial condition. Further, we are subject to potential tax audits in various jurisdictions and in such an event, tax authorities may review and challenge certain positions we have taken and assess penalties or additional taxes. These challenges may result in adjustments to, or impact the timing or amount of, taxable income, deductions or other tax allocations, which may adversely affect the Companys effective tax rate and overall financial condition. While we regularly assess the likely outcomes of these potential audits, there can be no assurance that we will accurately predict the outcome of a potential audit, and an audit could have a material adverse impact on our business, results of operations, and financial condition.\nInvestment Company Act - Certain changes in control of the Company would automatically terminate our investment management agreements with our client unless the funds' boards of directors and shareholders vote to continue the agreements.\nUnder the Investment Company Act, an investment management agreement with a fund must provide for its automatic termination in the event of its assignment. The funds' board and shareholders must vote to continue the agreement following its assignment, the cost of which ordinarily would be borne by the Company. Under the Advisers Act, a client's investment management agreement may not be assigned by the investment advisor without the client's consent. An advisor's ownership is considered to be assigned to another party when a controlling block of the advisor's ownership is transferred. In our case, an assignment would occur with the transfer or issuance of a controlling block of Class C shares. The Company cannot be certain that our clients will consent to assignments of our investment management agreements or approve new agreements with us if an assignment occurs. This restriction may discourage potential purchasers from acquiring a controlling interest in the Company.\nRisks Related to Our Common Stock\nOne person beneficially owns substantially all of our voting stock and controls the outcome of all matters requiring a vote of stockholders, which may influence the value of our publicly traded non-voting stock.\nFrank Holmes, CEO, is the beneficial owner of over 99 percent of our class C voting convertible common stock, and is subject to the Investment Company Act as described above, and controls the outcome of all issues requiring a vote of stockholders. All of our publicly traded stock is nonvoting stock. Consequently, except to the extent provided by law, stockholders other than Frank Holmes have no vote with respect to the election of directors or any other matter requiring a vote of stockholders. Frank Holmes is able to determine the outcome of matters submitted to a vote of our shareholders for approval and will be able to cause or prevent a change in control of the Company. This lack of voting rights may adversely affect the market value of the publicly traded class A nonvoting common stock.\nThe market price and trading volume of the Companys class A common stock may be volatile, which could result in rapid and substantial losses for the Companys stockholders.\nThe market price of the Companys class A common stock may be volatile, and the trading volume may fluctuate, causing significant price variations to occur. If the market price of the Companys class A common stock declines significantly, stockholders may be unable to sell their shares at or above their purchase price. The Company cannot assure that the market price of its class A common stock will not fluctuate or decline significantly in the future. Some of the factors that could negatively affect the price of the Companys class A common stock, or result in fluctuations in price or trading volume, include:\n●\nDecreases in assets under management;\n●\nVariations in quarterly and annual operating results;\n●\nVolatility in realized and unrealized gains or losses on corporate investments;\n●\nPublication of research reports about the Company or the investment management industry;\n●\nDepartures of key personnel;\n●\nAdverse market reactions to any indebtedness the Company may incur, acquisitions or disposals the Company may make, or securities the Company may issue in the future;\n●\nChanges in market valuations of similar companies;\n●\nChanges or proposed changes in laws or regulations, or differing interpretations thereof, affecting the business, or enforcement of these laws and regulations, or announcements relating to these matters;\n●\nAdverse publicity about the asset management industry, generally, or individual scandals, specifically; and\n●\nGeneral market and economic conditions.\nIn addition, the Company has invested in convertible securities and warrants in the cryptocurrency mining industry through its corporate investments. Cryptocurrency markets and related stocks have been, and are expected to continue to be, volatile. This volatility may have a material impact on the Companys financial statements and thus affect the Companys common stock market price. In addition, the price of the Companys common stock may fluctuate to the extent that shareholders invest in the Companys common stock as a proxy for cryptocurrency. The investing public may be influenced by future anticipated appreciation or depreciation in value of cryptocurrencies or blockchain generally, factors over which the Company has little or no influence or control. The Companys stock price may also be subject to volatility due to supply and demand factors associated with few or limited public company options for investment in the segment, which may change over time.\nMacroeconomic declines, including inflation; negative political developments, including volatile market conditions due to investor concerns regarding inflation and hostilities between Russia and Ukraine; adverse market conditions; and catastrophic events may cause a decline in the Companys revenue, an increase in the Companys costs, negatively affect the Companys operating results, adversely affect the Companys cash flow, and could result in a decline in the Companys stock price.\nThe market price of the Companys class A common stock could decline due to the large number of shares of the Companys class C common stock eligible for future sale upon conversion to class A shares.\nThe market price of the Companys class A common stock could decline as a result of sales of a large number of shares of class A common stock eligible for future sale upon the conversion of class C shares, or the perception that such sales could occur. These sales, or the possibility that these sales may occur, might also make it more difficult for the Company to raise additional capital by selling equity securities in the future, at a time and at a price the Company deems appropriate.\nThe Company intends to pay regular dividends to its stockholders, but the ability to do so is subject to the discretion of the Board of Directors.\nThe Company intends to pay cash dividends on a monthly basis, but the Board of Directors, at its discretion, may decrease the level or frequency of dividends or discontinue payment of dividends entirely based on earnings, operations, capital requirements, general financial condition of the Company, and general business conditions.\nAcquisitions involve inherent risks that could compromise the success of the combined business and dilute the holdings of current stockholders.\nAs part of our business strategy, we may pursue corporate development transactions, including the acquisition of asset management firms. These transactions involve assessing the value, strengths, weaknesses, liabilities and potential profitability of the transactions, and if our assessment is incorrect, the success of the combined business could be jeopardized. In addition, such transactions are subject to acquisition costs and expenses, are likely to divert the attention of managements time, and can dilute the stockholders of the combined company if the acquisition is made for stock of the combined company.\nRisks Related to Our Operations\nNatural disasters, epidemics, pandemics and other unpredictable events could adversely affect our operations.\nNatural disasters, outbreaks of epidemics or pandemics, terrorist attacks, extreme weather events or other unpredictable events could adversely affect our revenues, expenses, and net income by:\n●\ndecreasing investment valuations in, and returns on, the investment portfolios that we manage and our corporate portfolio, thus causing reductions and volatility in revenue,\n●\ncausing disruptions in national or global economies that decrease investor confidence and make investment products generally less attractive,\n●\nincapacitating or reducing the availability of key personnel necessary to conduct our business activities,\n●\ninterrupting the Companys business operations or those of critical service providers,\n●\ntriggering technology delays or failures, and\n●\nrequiring substantial capital expenditures and operating expenses to remediate damage, replace our facilities, and restore our operations.\nThe Companys business operations are concentrated in San Antonio, Texas. The Company has developed various backup systems and contingency plans but cannot be assured that those preparations will be adequate in all circumstances that could arise, or that material interruptions and disruptions will not occur. The Company also relies to varying degrees on outside vendors for service delivery in addition to technology and disaster contingency support, and there is a risk that these vendors will not be able to perform in an adequate and timely manner. If the Company loses the availability of employees, or if it is unable to respond adequately to such an event in a timely manner, revenues, expenses, and net income could be negatively impacted.\nSpecifically, the effects of the outbreak of the novel coronavirus (COVID-19) had an adverse effect on the global economy, the United States economy and the global financial markets. Should this reoccur and continue for an extended period, it may disrupt the Companys operations and the Companys clients operations, which could have an adverse effect on the Companys business, financial condition and results of operations. An epidemic, pandemic, or outbreak of any kind of communicable disease or virus or major public health issue could cause a slowdown in the levels of economic activity generally, which would adversely affect the Companys business, financial condition and operations.\nThe loss of key personnel could negatively affect the Companys financial performance.\nThe success of the Company depends on key personnel, including the portfolio managers, analysts, and executive officers. Competition for qualified, motivated, and skilled personnel in the asset management industry remains significant. Moreover, in order to retain certain key personnel, the Company may be required to increase compensation to such individuals, resulting in additional expense. The loss of key personnel or the Companys failure to attract replacement personnel could negatively affect its financial performance.\nThe Company could be subject to losses if it fails to properly safeguard sensitive and confidential information.\nAs part of the Companys normal operations, it maintains and transmits certain confidential information about the Company and its clients as well as proprietary information relating to its business operations. These systems could be victimized by unauthorized users or corrupted by computer viruses or other malicious software code, or authorized persons could inadvertently or intentionally release confidential or proprietary information. Such a breach could subject the Company to liability for a failure to safeguard client data, result in the termination of relationships with our existing customers, require significant capital and operating expenditures to investigate and remediate the breach and subject the Company to regulatory action.\nWe rely upon certain critical information systems for the operation of our business, and the failure of any critical information system, including a cyber-security breach, may result in harm to our business.\nWe are heavily dependent on technology infrastructure and rely upon certain critical information systems for the effective operation of our business. These information systems include data network and telecommunications, internet access and our websites, and various computer hardware equipment and software applications. These information systems are subject to damage or interruption from a number of potential sources including natural disasters, software viruses or other malware, power failures, cyber-attacks and other events. We have implemented measures, such as virus protection software, intrusion detection systems and emergency recovery processes to address the outlined risks. However, security measures for information systems cannot be guaranteed to be failsafe. Any compromise of our data security or our inability to use or access these information systems at critical points in time could unfavorably impact the timely and efficient operation of our business and subject us to additional costs and liabilities, which could adversely affect our results of operations. Finally, federal legislation relating to cyber-security threats could impose additional requirements on our operations.\nHigher insurance premiums and related insurance coverage risks could increase costs and reduce profitability.\nWhile U.S. Global carries insurance in amounts and under terms that it believes are appropriate, the Company cannot assure that its insurance will cover most liabilities and losses to which it may be exposed, or that our insurance policies will continue to be available at acceptable terms and fees. U.S. Global is subject to regulatory and governmental inquiries and civil litigation. An adverse outcome of any such proceeding could involve substantial financial penalties. From time to time, various claims against us arise in the ordinary course of business, including employment-related claims. There has been increased incidence of litigation and regulatory investigations in the financial services industry in recent years, including customer claims and class action suits alleging substantial monetary damages. Certain insurance coverage may not be available or may be prohibitively expensive in future periods. As U.S. Globals insurance policies come up for renewal, the Company may need to assume higher deductibles or co-insurance liabilities, or pay higher premiums, which would increase the Companys expenses and reduce net income.\nWe have identified material weaknesses in our internal control over financial reporting. These material weaknesses could continue to adversely affect our ability to report the results of operations and financial condition accurately and in a timely manner.\nAs further described in Item 9A of this Form 10-K, management has concluded that, because of material weaknesses in internal control over financial reporting, our internal control over financial reporting and our disclosure controls and procedures were not effective as of June 30, 2023. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements would not be prevented or detected on a timely basis. If we fail to remediate these material weaknesses in our internal controls, or after having remediated such material weaknesses, thereafter fail to maintain the adequacy of our internal control over financial reporting or our disclosure controls and procedures, we could be subjected to regulatory scrutiny, civil or criminal penalties or shareholder litigation, the defense of any of which could cause the diversion of managements attention and resources, we could incur significant legal and other expenses, and we could be required to pay damages to settle such actions if any such actions were not resolved in our favor. Moreover, we may be the subject of negative publicity focusing on these material weaknesses and we may be subject to negative reactions from shareholders and others with whom we do business.\nRisks Related to Assets Under Management\nPoor investment performance could lead to a decline in revenues.\nSuccess in the investment management industry is largely dependent on investment performance relative to market conditions and the performance of competing products. Good relative performance generally attracts additional assets under management, resulting in additional revenues. Conversely, poor performance generally results in decreased sales and increased redemptions with a corresponding decrease in revenues. Therefore, poor investment performance relative to the portfolio benchmarks and to competitors could impair the Companys revenues and growth. The equity funds within USGIF have a performance fee whereby the base advisory fee is adjusted upwards or downwards by 0.25 percent if there is a performance difference of 5 percent or more between a Funds performance and that of its designated benchmark index over the prior rolling 12 months.\nThe Companys clients can terminate their agreements with the Company on short notice, which may lead to unexpected declines in revenue and profitability.\nThe Companys investment advisory agreements are generally terminable on short notice and subject to annual renewal. If the Companys investment advisory agreements are terminated, which may occur in a short time frame, the Company may experience a decline in revenues and profitability.\nThe Company derives a substantial portion of revenue from one fund under management.\nA substantial amount of assets under management is concentrated in the U.S. Global Jets ETF (83 percent and 86 percent of average net assets for fiscal years 2023 and 2022, respectively). Consequently, the Companys revenues followed a similar pattern of concentration (84 percent and 82 percent of total operating revenues for fiscal years 2023 and 2022, respectively). As a result, our operating results are particularly dependent upon the performance of one fund and our ability to maintain and grow assets under management in that fund. If this fund were to experience a significant decrease in market value or redemptions, our assets under management would be reduced, adversely affecting our revenues.\nDifficult market conditions can adversely affect the Company by reducing the market value of the assets we manage or causing shareholders to make significant redemptions.\nChanges in economic or market conditions may adversely affect the profitability, performance of and demand for the Companys investment products and services. Under the Companys advisory fee arrangements, the fees received are primarily based on the market value of assets under management. Accordingly, a decline in the price of securities held in funds under management would be expected to cause revenues and net income to decline, which would result in lower advisory fees, or cause increased shareholder redemptions in favor of investments they perceive as offering greater opportunity or lower risk, which redemptions would also result in lower advisory fees. The ability of the Company to compete and grow is dependent on the relative attractiveness of the types of investment products the Company offers and its investment performance and strategies under prevailing market conditions.\nMarket-specific risks may negatively impact the Companys earnings.\nThe Company manages certain funds in the emerging market and natural resources sectors, which are highly cyclical. The investments in the funds are subject to significant loss due to political, economic and diplomatic developments, currency fluctuations, social instability, and changes in governmental policies, including trading policies, regulatory requirements, tariffs and other barriers. Foreign trading markets, particularly in some emerging market countries, are often smaller, less liquid, less regulated and significantly more volatile than the U.S. and other established markets.\nGovernment relationship risks may negatively impact the Companys earnings.\nThe Company manages a fund with significant investments in China-based issuers. While companies in China may be subject to limitations on their business relationships under Chinese law, these laws may not be consistent with certain political and security concerns of the U.S. As a result, Chinese companies may have material direct or indirect business relationships with governments that are considered state sponsors of terrorism by the U.S. government, or governments that otherwise have policies in conflict with the U.S. government (an Adverse Government). If a fund under management invests in companies that have or develop a material business relationship with an Adverse Government, the fund will be subject to the risk that these companies reputation and price in the market will be adversely or negatively impacted.\nRisks Related to Our Corporate Investments\nInvestment income and assets may be negatively impacted by fluctuations in the Companys corporate investments.\nThe Company currently has a substantial portion of its assets in corporate investments. These investments are subject to investment market risk, and investment income could be adversely affected by the realization of losses upon disposition of investments or the recognition of significant unrealized losses or impairments. Due to the Companys investments in debt securities carried at fair value, interest rate fluctuations represent a market risk factor affecting the Companys consolidated financial position. Debt securities may fluctuate in value due to changes in interest rates. Typically, investments subject to interest rate risk will decrease in value when interest rates rise and increase in value when interest rates decline. Fluctuations in investment income are expected to continue in the future.\nThe Company has indirect exposure to the cryptocurrency markets through its investments.\nCryptocurrencies (also referred to as virtual currencies and digital currencies) are digital assets that are designed to act as a medium of exchange. Although the Company has no current intention of directly investing in cryptocurrencies, the Company has indirect exposure to cryptocurrencies by investing in securities of issuers with exposure to the cryptocurrency industry. Cryptocurrencies (some of the most well-known include Bitcoin, Dogecoin and Ethereum) are not backed by any government, corporation, or other identified body. Trading markets for cryptocurrencies are often unregulated and may be more exposed to operational or technical issues as well as the potential for fraud or manipulation than established, regulated exchanges for securities, derivatives and traditional currencies.\nCryptocurrencies have been subject to significant fluctuations in value. The value of a cryptocurrency may significantly fluctuate precipitously (including declining to zero) and unpredictably for a variety of reasons, including, but not limited to: investor perceptions and expectations; regulatory changes; general economic conditions; adoption and use in the retail and commercial marketplace; public opinion regarding the environmental impact of the creation (minting or mining) of cryptocurrency; confidence in, and the maintenance and development of, its network and open-source software protocols such as blockchain for ensuring the integrity of cryptocurrency transactional data; and general risks tied to the use of information technologies, including cybersecurity risks.\nAdverse changes in foreign currencies could negatively impact financial results.\nWe have cash and certain corporate investments held in foreign currencies. Adverse changes in foreign currency exchange rates would also lower the value of those assets. Certain assets under management also have exposure to foreign currency fluctuations in various markets, which could have an impact on their valuation and thus the revenue we receive. Item 1B. Unresolved Staff Comments\nNot applicable for smaller reporting companies. Item 2. Properties\nThe Company presently owns and occupies an office building as its headquarters in San Antonio, Texas. The office building is approximately 46,000 square feet on approximately 2.5 acres of land. Item 3. Legal Proceedings\nThere are no material legal proceedings in which the Company is involved. Item 4. Mine Safety Disclosures\nNot applicable.\nPart II of Annual Report on Form 10-K Item 5. Market for Registrants Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nU.S. Global Investors, Inc. (U.S. Global or the Company) has three classes of common equity: class A, class B, and class C common stock, par value $0.025 per share.\nThe Companys class A common stock is traded over-the-counter and is quoted daily under NASDAQs Capital Markets. Trades are reported under the symbol GROW.\nThere is no established public trading market for the Companys class B and class C common stock.\nThe Companys class A and class B common stock have no voting privileges.\nHolders\nOn November 8, 2023, there were approximately 189 holders of record of class A common stock, no holders of record of class B common stock, and 19 holders of record of class C common stock.\nSecurities authorized for issuance under equity compensation plans\nInformation relating to equity compensation plans under which our stock is authorized for issuance is set forth in Item 12 of Part III of this Form 10-K under the heading Equity Compensation Plan Information.\nPurchases of equity securities by the issuer\nThe Company has a share repurchase program, approved by the Board of Directors, authorizing the Company to annually purchase up to $5.0 million of its outstanding common shares, as market and business conditions warrant, on the open market in compliance with Rule 10b-18 of the Securities Exchange Act of 1934 through December 31, 2023. The repurchase program has been in place since December 2012, and the Board of Directors has annually renewed the repurchase program each calendar year.\nFor the quarter ended June 30, 2023, the Company purchased a total of 91,845 class A shares using cash of $257,000. The Company may repurchase class A stock from employees; however, none were repurchased from employees during the quarter ended June 30, 2023. The Company did not repurchase any classes B or C common stock during the quarter ended June 30, 2023.\n(dollars in thousands, except price data)\nApproximate Dollar\nTotal Number of\nValue of Shares that\nShares Purchased as\nMay Yet Be\nTotal Number of\nTotal Amount\nAverage Price\nPart of Publicly\nPurchased Under\nPeriod\nShares Purchased 1\nPurchased\nPaid Per Share 2\nAnnounced Plan 3\nthe Plan\n04-01-23 to 04-30-23\n27,109\n$76\n$2.81\n27,109\n$4,368\n05-01-23 to 05-31-23\n41,114\n$2.77\n41,114\n$4,254\n06-01-23 to 06-30-23\n23,622\n$2.82\n23,622\n$4,187\nTotal\n91,845\n$257\n$2.79\n91,845\n1.\nThe Board of Directors of the Company approved on December 7, 2012, and renewed annually, a repurchase of up to $2.75 million in each of calendar years 2013 through 2022 of its outstanding class A common stock from time to time on the open market in accordance with all applicable rules and regulations. On February 25, 2022, the Company announced that the Board of Directors of the company approved an increase to the limit of its annual share buyback program from $2.75 million to $5.0 million.\n2.\nThe average price paid per share of stock repurchased under the stock repurchase program includes the commissions paid to brokers.\n3.\nThe total amount of shares that may be repurchased in 2023 under the program is $5.0 million.\nDividends\nAs of June 30, 2023, the Board of Directors has authorized a monthly dividend of $0.0075 per share from July 2023 through September 2023. The total amount of cash dividends to be paid to class A and class C shareholders from July 2023 to September 2023 will be approximately $329,000, which is included as dividends payable in the Consolidated Balance Sheets at June 30, 2023. Payment of cash dividends is within the discretion of the Companys Board of Directors and is dependent on earnings, operations, capital requirements, general financial condition of the Company, and general business conditions. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThis discussion reviews and analyzes the consolidated results of operations of U.S. Global Investors, Inc. and its subsidiaries (collectively, U.S. Global or the Company) for the past two fiscal years and other factors that may affect future financial performance. This discussion should be read in conjunction with the Consolidated Financial Statements and Notes to the Consolidated Financial Statements of this Annual Report on Form 10-K.\nRecent Trends in Financial Markets\nThe Companys operating revenues are highly correlated to the level of assets under management (AUM) and fees associated with various investment products. While AUM is directly impacted by changes in the financial markets, it is also impacted by cash inflows or outflows due to shareholder activity. Performance fees on certain equity fund products may also impact revenues, either positively or negatively. Various products may have different fees, so changes in our product mix may also affect revenues. For example, international equity products will generally have a higher fee than fixed income products, so changes in assets in those products will have a larger impact on revenues.\nWhile products are offered for a wide variety of markets, the Company has traditionally focused on gold mining and exploration, natural resources, and emerging markets. More recently the airline industry has become more significant to our revenue. All these markets are volatile and subject to capital cycles.\nReflecting on the significant developments and challenges we have faced over the past year, the impacts and fears of COVID-19 seem to have diminished, as China successfully emerged from the COVID lockdown. With supply chains now open, ports are bustling with activity, allowing us to better navigate the current economic landscape.\nThroughout the spring and especially during the summer months, we experienced robust travel demand, which in turn drove investor flows into the airline stocks. This positive price momentum has been a key driver of revenue for our JETS ETF and airline industry related revenues at large.\nHowever, it is worth noting that this year has not been without challenges. We find ourselves still grappling with the highest inflation rates in four decades. This inflationary pressure is partly attributable to the Russian-Ukrainian war and increased consumer spending of disposable income. As always, we continue to closely monitor economic trends to navigate their potential impact on the Company's performance.\nIn the broader market, we observed interesting sectoral dynamics. The S&P 500 saw notable strength in nine of its 11 sectors, with Information Technology leading the charge, boasting an impressive 38.8% increase. Meanwhile, the Real Estate sector faced challenges, experiencing a decline of 7.5%. This illustrates the importance of diversification and thoughtful portfolio management in uncertain market conditions.\nThe performance of the S&P 500 was commendable, registering a growth of 17.6% for the trailing twelve months ended June 30, 2023. As we move forward, we will continue to focus on driving sustainable growth, prioritizing innovation, and maintaining a vigilant approach to risk management.\nMutual funds in general continued to see outflows compared to other investment alternatives, including ETFs. The Company has three ETF products listed on the New York Stock Exchange: the U.S. Global Jets ETF (ticker JETS), which concentrates on the U.S. and international airline industry, the U.S. Global GO GOLD and Precious Metal Miners ETF (ticker GOAU), which invests in companies engaged in the production of precious metals either through active (mining or production) or passive (owning royalties or production streams) means, and U.S. Global Sea to Sky Cargo ETF (ticker SEA), which concentrates on the global sea shipping and air freight industries. The Company has one European-based ETF product listed on various exchanges in Europe, the U.S. Global Jets UCITS ETF (ticker JETS), which concentrates on the U.S. and international airline industry.\nAssets in the Jets ETF were $1.9 billion and $2.5 billion at June 30, 2023, and 2022, respectively. The Jets ETF invests in airline-related stocks, including global airline carriers, airport operators and aircraft manufacturers.\nThe spread of the global COVID-19 outbreak and actions taken in response have affected the global and domestic economies and financial markets. Market declines affect the Companys assets under management, and thus its revenues and also the valuation of the Companys corporate investments. The Company cannot determine the long-term impact of COVID-19 on the Companys business. Should this macro-economic risk reemerge and continue for an extended period, there could be an adverse material financial impact to the Companys business and investments, including a material reduction in its results of operations.\nCOVID-19-related circumstances (e.g., remote work arrangements) have not adversely affected the Companys ability to maintain operations, including financial reporting systems, internal controls over financial reporting, and disclosure controls and procedures.\nTo manage expenses, the Company maintains a flexible structure for one of its largest costs, compensation expenses, by setting relatively low base salaries with bonuses that are tied to fund and Company performance. Thus, the Companys expense model somewhat expands and contracts with asset swings and performance.\nBusiness Segments\nThe Company, with principal operations located in San Antonio, Texas, manages two business segments:\n1.\nInvestment management services, through which the Company offers, to U.S. Global Investors Funds (USGIF or the Fund(s)) and ETF clients, a range of investment management products and services to meet the needs of individual and institutional investors; and\n2.\nCorporate investments, through which the Company invests for its own account in an effort to add growth and value to its cash position. The Company holds a significant amount of its total assets in investments.\nAssets Under Management (AUM)\n(dollars in thousands)\nJune 30, 2023\nJune 30, 2022\nInvestment Management Services\nETF Clients\n$ 2,041,653\n$ 2,550,379\nUSGIF\n328,439\n357,527\nTotal AUM\n$ 2,370,092\n$ 2,907,906\nOn June 30, 2023, total AUM as of period end was $2.4 billion compared to $2.9 billion on June 30, 2022, a decrease of $537.8 million, or 18.5 percent. During fiscal year 2023, average AUM was $2.5 billion compared to $3.9 billion in fiscal year 2022, a decrease of 35.6 percent. The decrease was primarily due to outflows from the Jets ETF. The Jets ETF invests in airline-related stocks, including global airline carriers, airport operators and aircraft manufacturers.\nThe following is a brief discussion of the Companys two business segments.\nInvestment Management Services\nThe Company generates operating revenues from managing and servicing the Funds. The Company recorded advisory and administrative services fees from USGIF totaling approximately $1.9 million and $3.8 million in fiscal 2023 and fiscal 2022, respectively. These revenues are largely dependent on the total value and composition of assets under its management. Fluctuations in the markets and investor sentiment have a direct impact on the Funds asset levels, thereby affecting income and results of operations. Detailed information regarding the Funds managed by the Company within USGIF can be found on the Companys website, www.usfunds.com, including the prospectus and performance information for each fund. The mutual fund shareholders in USGIF are not required to give advance notice prior to redemption of shares in the Funds, and the USGIF funds do not currently charge a redemption fee.\nInvestment base advisory fees from USGIF are calculated as a percentage of average net assets, ranging from 0.375 percent to 1.25 percent, and are paid monthly. The base advisory fee on the equity funds within USGIF is adjusted upward or downward based on performance. For the years ended June 30, 2023, and 2022, the Company adjusted its base advisory fees downward by $490,000 and upward by $20,000, respectively. USGIF advisory fees in total, including performance adjustments, decreased by approximately $1.8 million, or 50.4 percent, in fiscal year 2023 compared to fiscal year 2022, primarily as a result of a decrease in average assets under management driven by redemptions and a change to performance fees paid versus performance fees received.\nMutual fund investment advisory fees are also affected by changes in assets under management, which include:\n●\nmarket appreciation or depreciation;\n●\nthe addition of new fund shareholder accounts;\n●\nfund shareholder contributions of additional assets to existing accounts;\n●\nwithdrawals of assets from and termination of fund shareholder accounts;\n●\nexchanges of assets between accounts or products with different fee structures; and\n●\nthe amount of fees reimbursed.\nThe following tables summarize the changes in assets under management for USGIF for fiscal years 2023 and 2022.\nYear Ended June 30, 2023\n(dollars in thousands)\nEquity\nFixed Income\nTotal\nBeginning Balance\n$ 286,367\n$ 71,161\n$ 357,528\nMarket appreciation\n17,540\n18,076\nDividends and distributions\n(11,329 )\n(1,366 )\n(12,695 )\nNet shareholder redemptions\n(27,249 )\n(7,221 )\n(34,470 )\nEnding Balance\n$ 265,329\n$ 63,110\n$ 328,439\nAverage investment management fee\n0.80 %\n0.00 %\n0.65 %\nAverage net assets\n$ 281,076\n$ 65,312\n$ 346,388\nYear Ended June 30, 2022\n(dollars in thousands)\nEquity\nFixed Income\nTotal\nBeginning Balance\n$ 433,380\n$ 75,842\n$ 509,222\nMarket depreciation\n(110,465 )\n(2,201 )\n(112,666 )\nDividends and distributions\n(61,309 )\n(285 )\n(61,594 )\nNet shareholder purchases (redemptions)\n24,761\n(2,195 )\n22,566\nEnding Balance\n$ 286,367\n$ 71,161\n$ 357,528\nAverage investment management fee\n0.93 %\n0.00 %\n0.78 %\nAverage net assets\n$ 380,519\n$ 71,818\n$ 452,337\nThe average annualized investment management fee rate (total advisory fees, excluding performance fees, as a percentage of average assets under management) was 65 basis points in fiscal year 2023 and 78 basis points in fiscal year 2022. The average investment management fee for equity funds in fiscal years 2023 and 2022 was 80 basis points and 93 basis points, respectively. The average investment management fee for the fixed income funds was nil for both fiscal years 2023 and 2022 due to fee waivers on these funds as discussed in Note 5, Investment Management and Other Fees, to the Consolidated Financial Statements of this Annual Report on Form 10-K.\nThe Company serves as investment advisor to three U.S.-based exchange-traded funds (ETFs): U.S. Global Jets ETF (ticker JETS), U.S. Global GO GOLD and Precious Metal Miners ETF (ticker GOAU), and U.S. Global Sea to Sky Cargo ETF (ticker SEA). The Company receives a unitary management fee of 0.60 percent of average net assets and has agreed to bear all expenses of the ETFs, except the U.S. Global Sea to Sky Cargo ETF. The Company has agreed to contractually limit the expenses of the U.S. Global Sea to Sky Cargo ETF through April 2024. The Company also serves as investment advisor to one European-based ETF, the U.S. Global Jets UCITS ETF. The Company receives a unitary management fee of 0.65 percent of average net assets and has agreed to bear all expenses of the ETF. The Company recorded advisory fees from the ETF clients totaling $13.2 million and $21.0 million in fiscal years 2023 and 2022, respectively. Average assets in the ETFs decreased in fiscal year 2023, primarily in the Jets ETF. Information on the U.S.-based ETFs can be found at www.usglobaletfs.com, including the prospectus, performance and holdings. The ETFs authorized participants are not required to give advance notice prior to redemption of shares in the ETFs, and the ETFs do not charge a redemption fee. The U.S. Global Jets UCITS ETF is not available to U.S. investors.\nCorporate Investments\nManagement believes it can more effectively manage the Companys cash position by maintaining certain types of investments utilized in cash management and continues to believe that such activities are in the best interest of the Company.\nThe following summarizes the cost, unrealized gain or loss, and fair value of investments carried at fair value as of June 30, 2023, and 2022.\nSecurities at Fair Value\nCost\nUnrealized Gain in Other Comprehensive Income\nUnrealized Loss in Net Investment Income (Loss)\nFair Value\n(dollars in thousands)\nEquity securities at fair value 1\n$ 19,601\n$ -\n$ (6,396 )\n$ 13,205\nAvailable-for-sale debt securities at fair value 2\n7,729\n1,707\n(2,428 )\n7,008\nTotal at June 30, 2023\n$ 27,330\n$ 1,707\n$ (8,824 )\n$ 20,213\nEquity securities at fair value 1\n$ 19,967\n$ -\n$ (5,667 )\n$ 14,300\nAvailable-for-sale debt securities at fair value 2\n8,576\n4,588\n(2,539 )\n10,625\nTotal at June 30, 2022\n$ 28,543\n$ 4,588\n$ (8,206 )\n$ 24,925\n1.\nChanges in unrealized and realized gains and losses are included in net investment income (loss) in the Consolidated Statements of Operations.\n2.\nRealized gains and losses are included in net investment income (loss) in the Consolidated Statements of Operations. Changes in unrealized gains and losses are included in the Consolidated Statements of Comprehensive Income, except for declines in fair value determined to be other than temporary, and amounts attributable to embedded derivatives, which are included in net investment income (loss) in the Consolidated Statements of Operations. An embedded derivative and its related host contract represent one legal contract and are combined within the investments in available-for-sale debt securities on the Consolidated Balance Sheets.\nThe investments shown above include investments at fair value of $12.4 million and $12.8 million, as of June 30, 2023, and 2022, respectively, invested in USGIF, funds the Company advised.\nNet investment income (loss) from the Companys investments includes:\n●\nrealized gains and losses on sales of securities;\n●\nrealized gains on principal payment proceeds;\n●\nunrealized gains and losses on fair valued securities;\n●\nforeign currency gains and losses;\n●\nimpairments and observable price changes on equity investments without readily determinable fair values; and\n●\ndividend and interest income.\nInvestment income can be volatile and may vary depending on market fluctuations, the Companys ability to participate in investment opportunities, and timing of transactions. A significant portion of the unrealized gains and losses is concentrated in a small number of issuers. For fiscal year 2023, the Company had net investment income of $316,000, compared to a $6.2 million net investment loss in fiscal year 2022. Due to market volatility, the Company expects that gains or losses will continue to fluctuate in the future.\nA significant portion of the securities recorded at fair value in the above table is in investments in HIVE Digital Technologies Ltd., formerly HIVE Blockchain Technologies Ltd., (HIVE), which were warrants and convertible debentures valued at $7.3 million and $11.1 million at June 30, 2023, and 2022, respectively. The investments in HIVE are discussed in more detail in Note 4, Investments, to the Consolidated Financial Statements of this Annual Report on Form 10-K. HIVE is a company that is headquartered in Canada with cryptocurrency mining facilities in Iceland, Sweden, and Canada. Frank Holmes, CEO, is the executive chairman of HIVE.\nCryptocurrency markets and related stocks have been, and are expected to continue to be, volatile, and may be influenced by a wide variety of factors, including speculative activity. Cryptocurrency mining companies face a variety of risks, including, but not limited to, environmental concerns, regulatory factors, and heightened risks of cybersecurity attacks for which there may be no source of recovery. There has been significant volatility in the market price of HIVE, which has materially impacted the investments value included on the Consolidated Balance Sheets, unrealized gain (loss) recognized in net investment income (loss), and unrealized gain (loss) recognized in other comprehensive income (loss).\nIn addition to the investments above, as of June 30, 2023, and 2022, the Company owned other investments of approximately $2.4 million and $4.0 million, respectively, classified as securities without readily determinable fair values.\nConsolidated Results of Operations\nThe following is a discussion of the consolidated results of operations of the Company and a detailed discussion of the Companys revenues and expenses.\nYear Ended June 30, 2023, Compared with Year Ended June 30, 2022\nThe Company posted net income, as shown in the Consolidated Statements of Operations, of $3.1 million ($ 0.22 per share) for the year ended June 30, 2023, compared with net income of $3.4 million ($ 0.23 per share) for the year ended June 30, 2022, a decrease of approximately $291,000. The change is primarily due to lower operating revenues, offset by net investment income in the current year compared to net investment losses in the prior year, and lower operating expenses, as discussed further below.\nOperating Revenues\nYear ended June 30,\n$\n%\n(dollars in thousands)\nChange\nChange\nETF advisory fees:\nAirline and cargo ETFs\n$ 12,668\n$ 20,378\n$ (7,710 )\n(37.8 )%\nGold and natural resources ETF\n(78 )\n(13.4 )%\nTotal ETF advisory fees\n13,174\n20,962\n(7,788 )\n(37.2 )%\nInvestment advisory fees - USGIF:\nGold and natural resources funds\n$ 1,441\n$ 2,851\n$ (1,410 )\n(49.5 )%\nEmerging markets funds\n(197 )\n(92.5 )%\nInternational equity funds\n(190 )\n(38.1 )%\nBond funds\n-\n-\n-\nn/a\nTotal investment advisory fees - USGIF\n1,766\n3,563\n(1,797 )\n(50.4 )%\nTotal advisory fees\n14,940\n24,525\n(9,585 )\n(39.1 )%\nUSGIF administrative services fees\n(55 )\n(29.1 )%\nTotal Operating Revenues\n$ 15,074\n$ 24,714\n$ (9,640 )\n(39.0 )%\nTotal consolidated operating revenues for the year ended June 30, 2023, decreased $9.6 million, or 39.0 percent, compared with the year ended June 30, 2022. This decrease was primarily attributable to the following:\n●\nAdvisory fees decreased by $9.6 million, or 39.1 percent, primarily as the result of lower ETF assets under management. Advisory fees are comprised of two components: a base management fee and a performance fee.\n○\nBase management fees decreased approximately $9.1 million. ETF unitary management fees decreased due to a decrease in ETF average assets under management, primarily in the Jets ETF. Base fees for USGIF decreased primarily as a result of lower average assets under management due to shareholder redemptions and an increase management fee waivers.\n○ Performance fee adjustments for USGIF in the current year resulted in fees paid of $490,000 compared to fees received of $20,000 in the prior year, a change of $510,000. The USGIF performance fee, which applies to the equity funds only, is a fulcrum fee that is adjusted upwards or downwards by 0.25 percent when there is a performance difference of 5 percent or more between a funds performance and that of its designated benchmark index over the prior rolling 12 months.\nAdvisory Fees. Advisory fees, the largest component of the Companys operating revenues, are derived from two sources: exchange-traded fund advisory fees and USGIF advisory fees. In fiscal year 2023, these sources accounted for 87.4 percent and 11.7 percent, respectively, of the Companys operating revenues.\nInvestment base advisory fees from USGIF are calculated as a percentage of average net assets, ranging from 0.375 percent to 1.25 percent, and are paid monthly. The base advisory fee on the equity funds within USGIF is adjusted upward or downward based on performance. For the years ended June 30, 2023, and 2022, the Company adjusted its base advisory fees downward by $490,000 and upward by $20,000, respectively. USGIF advisory fees in total, including performance adjustments, decreased by approximately $1.8 million, or 50.4 percent, in fiscal year 2023 compared to fiscal year 2022, primarily as a result of a decrease in average assets under management driven by shareholder redemptions and a change from performance fees received to performance fees paid.\nThe Company serves as investment advisor to three U.S.-based exchange-traded funds (ETFs): U.S. Global Jets ETF (ticker JETS), U.S. Global GO GOLD and Precious Metal Miners ETF (ticker GOAU), and U.S. Global Sea to Sky Cargo ETF (ticker SEA). The Company receives a unitary management fee of 0.60 percent of average net assets of the ETFs, and has agreed to bear all expenses of the ETFs, except the U.S. Global Sea to Sky Cargo ETF. The Company has agreed to contractually limit the expenses of the U.S. Global Sea to Sky Cargo ETF through April 2024. The Company also serves as investment advisor to one European-based ETF, the U.S. Global Jets UCITS ETF. The Company receives a unitary management fee of 0.65 percent of average net assets and has agreed to bear all expenses of the ETF. The Company recorded advisory fees from the ETF clients of $13.2 million and $21.0 million in fiscal years 2023 and 2022, respectively.\nOperating Expenses\nYear ended June 30,\n$\n%\n(dollars in thousands)\nChange\nChange\nEmployee compensation and benefits\n$ 4,798\n$ 6,059\n$ (1,261 )\n(20.8 )%\nGeneral and administrative\n6,122\n6,911\n(789 )\n(11.4 )%\nAdvertising\n(23 )\n(5.7 )%\nDepreciation\n7.5 %\nInterest\n-\nn/a\nTotal\n$ 11,549\n$ 13,601\n$ (2,052 )\n(15.1 )%\nTotal operating expenses decreased $2.1 million, or 15.1 percent, compared with the previous fiscal year. This decrease was primarily attributable to decreases in employee compensation and general and administrative expenses, as described below.\nEmployee Compensation and Benefits. Employee compensation and benefits decreased $1.3 million, or 20.8 percent, in fiscal year 2023, primarily as a result of lower bonuses related to lower operating income and lower realized investment gains than in the previous fiscal year, and amortization expense of employee stock options in the prior fiscal year.\nGeneral and Administrative. General and administrative expenses decreased $789,000, or 11.4 percent, in fiscal year 2023, primarily due to a decrease in director fees and expenses, fund expenses, and consulting and professional fees. The decrease in director fees and expenses is primarily due to the amortization expense of stock options in the prior fiscal year.\nOther Income (Loss)\nYear ended June 30,\n$\n%\n(dollars in thousands)\nChange\nChange\nNet investment income (loss)\n$\n$ (6,174 )\n$ 6,490\n(105.1 )%\nLoss from equity method investments\n-\n(206 )\n(100.0 )%\nOther income\n3.0 %\nTotal Other Income (Loss)\n$\n$ (6,145 )\n$ 6,703\n(109.1 )%\nTotal consolidated other income for the year ended June 30, 2023, was $558,000, compared to $6.1 million in losses for the year ended June 30, 2022, a change of $6.7 million. The change was primarily due to the following components and factors:\n●\nNet investment income was $316,000 for the year ended June 30, 2023, compared to a net investment loss of $6.2 million for the year ended June 30, 2022, a change of approximately $6.5 million. Net investment income (loss) is dependent on market fluctuations and does not remain at a consistent level.\n○ The current year ended June 30, 2023, included changes in unrealized losses on equity securities of $2.6 million and realized losses on equity securities of $453,000, whereas the prior year ended June 30, 2022, included changes in unrealized losses on equity securities of $9.4 million and realized gains on sales of equity securities of $1.8 million. For the current year, the change in unrealized losses on equity securities were primarily due to observable price changes for equity investments accounted for under the investment alternative, and the realized losses on equity securities were primarily due to impairments for equity investments accounted for under the investment alternative. For the prior year, a significant amount of the changes in unrealized losses on equity securities were due to a decrease in the fair value of the Companys investment in warrants of HIVE.\n○ The current year ended June 30, 2023, had unrealized gains on embedded derivatives of $111,000, whereas the prior year ended June 30, 2022, had unrealized losses on embedded derivatives of $2.5 million. This was due to a decrease in the fair value of the Company's investment in convertible debentures in HIVE in the prior year.\n○ Also, due to the Companys investment in convertible debentures in HIVE, there were realized gains on debt securities of $1.7 million for the year ended June 30, 2023, compared to $2.2 million in the prior year ended June 30, 2022, a decrease of $527,000, or 24.1 percent.\n○ A significant portion of corporate investments is held in securities of a company in the business of mining cryptocurrency. Cryptocurrency markets and related stocks have been, and are expected to continue to be, volatile. See further discussion of these securities and other investments in Note 4, Investments, to the Consolidated Financial Statements of this Annual Report on Form 10-K.\n●\nThere was no income or loss from equity method investments for the year ended June 30, 2023, compared to a loss from equity method investments of $206,000 for the year ended June 30, 2022. The Companys equity method investment was dissolved during the year ended June 30, 2022.\nProvision for Income Taxes\nA tax expense of $934,000 was recorded for the year ended June 30, 2023, compared to $1.5 million for the year ended June 30, 2022, a decrease of $594,000, or 38.9 percent. The decrease was due primarily to lower operating income and lower realized gains on sales of securities, offset by lower unrealized losses on investments. See Note 13 to the Consolidated Financial Statements of this Annual Report on Form 10-K for additional disclosures on income taxes.\nLiquidity and Capital Resources\nAt June 30, 2023, the Company had net working capital (current assets minus current liabilities) of approximately $37.4 million and a current ratio (current assets divided by current liabilities) of 13.7 to 1. With approximately $25.4 million in cash and cash equivalents and $12.9 million in securities carried at fair value, excluding convertible securities, which together comprise approximately 68.8 percent of total assets, the Company has adequate liquidity to meet its current obligations. Total shareholders equity was approximately $52.2 million.\nThe increase in cash and cash equivalents of $3.1 million, and accordingly, net working capital, was primarily due to net cash provided by operating activities of $2.9 million and proceeds from principal paydowns of $3.0 million, offset by $1.2 million for repurchases of common stock and $1.3 million for dividends paid. Consolidated shareholders equity at June 30, 2023, was $52.2 million, a decrease of $1.6 million, or 3.0 percent since June 30, 2022. The decrease was primarily due to other comprehensive loss of $2.3 million, dividends declared of $1.3 million, and repurchases of common stock of $1.2 million; offset by net income of $3.1 million for the year ended June 30, 2023.\nThe Company also has access to a $1.0 million credit facility, which can be utilized for working capital purposes. The credit agreement requires the Company to maintain certain covenants; the Company has been in compliance with these covenants during the current fiscal year. The credit agreement will expire on May 31, 2024, and the Company intends to renew it annually. The credit facility is collateralized by approximately $1.0 million, included in restricted cash on the Consolidated Balance Sheets, held in deposit in a money market account at the financial institution that provided the credit facility. As of June 30, 2023, this credit facility remained unutilized by the Company.\nInvestment advisory contracts pursuant to the Investment Company Act of 1940 and related affiliated contracts in the U.S., by law, may not exceed one year in length and, therefore, must be renewed at least annually after an initial two-year term. The investment advisory and related contracts between the Company and USGIF have been renewed through September 2024. The advisory agreement for the U.S. Global Jets ETF and the U.S. Global GO GOLD and Precious Metal Miners ETF has been renewed through July 2024.\nThe primary cash requirements are for operating activities. The Company also uses cash to purchase investments, pay dividends and repurchase Company stock. The cash outlays for investments and dividend payments are discretionary. The stock repurchase plan is approved through December 31, 2023, but may be suspended or discontinued. Cash and securities recorded at fair value, excluding convertible securities, of approximately $38.3 million are available to fund current activities.\nAs of June 30, 2023, the Board of Directors has authorized a monthly dividend of $0.0075 per share from July 2023 through September 2023. The total amount of cash dividends to be paid to class A and class C shareholders from July 2023 to September 2023 will be approximately $329,000, which is included as dividends payable in the Consolidated Balance Sheets at June 30, 2023. Payment of cash dividends is within the discretion of the Companys Board of Directors and is dependent on earnings, operations, capital requirements, general financial condition of the Company, and general business conditions.\nContractual obligations primarily consist of agreements for services used in daily operations and for marketing and distribution. As of June 30, 2023, the Company had contractual obligations of $1.1 million for the fiscal years ending June 30, 2024, through 2026. Other contractual obligations consist of agreements to waive or reduce fees and/or pay expenses on certain funds. Future obligations under these agreements are dependent upon future levels of fund assets.\nManagement believes current cash reserves, investments, and financing available will be sufficient to meet foreseeable cash needs for operating activities and for contractual obligations.\nThe spread of the global COVID-19 had an adverse effect on global and domestic economies and financial markets, which may reoccur and continue for an undetermined period. Market declines affect the Companys assets under management, and thus its revenues and also the valuation of the Companys corporate investments. This may adversely affect the Companys Consolidated Balance Sheets and results of operations.\nCritical Accounting Estimates\nThe discussion and analysis of financial condition and results of operations are based on the Companys Consolidated Financial Statements, which have been prepared in accordance with generally accepted accounting principles in the U.S. (GAAP). The preparation of these Consolidated Financial Statements requires the Company to make estimates and judgments that affect the reported amounts of assets, liabilities, and expenses. Management reviews these estimates on an ongoing basis. Estimates are based on experience and on various other assumptions that the Company believes to be reasonable under the circumstances. Actual results may differ from these estimates under different assumptions or conditions. While significant accounting policies are described in more detail in Note 3 to the Consolidated Financial Statements, the Company believes the accounting policies that require management to make assumptions and estimates involving significant judgment are those relating to valuation of investments, income taxes, and valuation of share-based compensation.\nFair Value of Financial Instruments. The financial instruments of the Company are reported on the Consolidated Balance Sheets at market or fair values or at carrying amounts that approximate fair values. The Company believes that the estimates related to fair values of financial instruments are critical accounting estimates because the assumptions used could significantly impact the unrealized gains or losses recorded in the Companys Consolidated Financial Statements.\nShare-Based Compensation. Share-based compensation expense is measured at the grant date based on the fair value of the award, and the cost is recognized as expense ratably over the awards vesting period. Forfeitures are recognized as they occur.\nThe Company believes that the estimates related to share-based compensation expense are critical accounting estimates because the assumptions used could significantly impact the timing and amount of share-based compensation expense recorded in the Companys Consolidated Financial Statements.\nIncome Taxes. The Companys annual effective income tax rate is based on the mix of income and losses in its U.S. and non-U.S. entities which are part of the Companys Consolidated Financial Statements, statutory tax rates, and tax-planning opportunities available to the Company in the various jurisdictions in which it operates. Significant judgment is required in evaluating the Companys tax positions.\nTax law requires certain items to be included in the tax return at different times from when these items are reflected in the Companys Consolidated Statements of Operations. As a result, the effective tax rate reflected in the Consolidated Financial Statements is different from the tax rate reported on the Companys consolidated tax return. Some of these differences are permanent, such as expenses that are not deductible in the tax return, and some differences reverse over time, such as depreciation expense. These timing differences create deferred tax assets and liabilities. Deferred tax assets and liabilities are determined based on temporary differences between the financial reporting and the tax basis of assets and liabilities and are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment dates.\nThe Company assesses uncertain tax positions in accordance with ASC 740, Income Taxes and maintains a reserve. Judgment is used to identify, recognize, and measure the amounts to be recorded in the financial statements related to tax positions taken or expected to be taken in a tax return. A liability is recognized to represent the potential future obligation to the taxing authority for the benefit taken in the tax return. These liabilities are adjusted, including any impact of the related interest and penalties, in light of changing facts and circumstances such as the progress of a tax audit. A number of years may elapse before a particular matter for which a reserve has been established is audited and finally resolved. The number of years with open tax audits varies depending on the tax jurisdiction.\nThe Company assesses whether a valuation allowance should be established against its deferred income tax assets based on consideration of available evidence, both positive and negative, using a more likely than not standard. This assessment considers, among other matters, the nature, frequency and severity of recent losses, forecast of future profitability, the duration of statutory carry back and carry forward periods, the Companys experience with tax attributes expiring unused, and tax planning alternatives.\nAssessing the future tax consequences of events that have been recognized in the Companys Consolidated Financial Statements or tax returns requires judgment. The Company believes that income taxes include critical accounting estimates because variations in the actual outcome of these future tax consequences could materially impact the Companys financial position, results of operations or cash flows. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nMarket Risk Disclosures\nThe following information, together with information included in other parts of this Managements Discussion and Analysis of Financial Condition and Results of Operations, describes the key aspects of certain financial instruments that have market risk to the Company.\nCOVID-19 had an adverse effect on global and domestic financial markets, which may reoccur and continue for an undetermined period. This may adversely affect assets under management and thus the Companys revenues and operating results. Market declines also affect the valuation of the Companys corporate investments, which also adversely affects the Companys Consolidated Balance Sheets and results of operations.\nMacroeconomic declines, including inflation; negative political developments, including volatile market conditions due to investor concerns regarding inflation and potential hostilities between Russia and Ukraine; adverse market conditions; and catastrophic events may cause a decline in the Companys revenue, an increase in the Companys costs, negatively affect the Companys operating results, adversely affect the Companys cash flow, and could result in a decline in the Companys stock price.\nInvestment Management and Administrative Services Fees\nRevenues are generally based upon a percentage of assets under management in accordance with contractual agreements. Accordingly, fluctuations in the financial markets have a direct effect on the Companys operating results. A significant portion of assets under management in equity funds have exposure to international markets and/or natural resource sectors, which may experience volatility. In addition, fluctuations in interest rates may affect the value of assets under management in fixed income funds.\nPerformance Fees\nUSGIF advisory fees are comprised of two components: a base management fee and a performance fee. The performance fee is a fulcrum fee that is adjusted upwards or downwards by 0.25 percent when there is a performance difference of 5 percent or more between a funds performance and that of its designated benchmark index over the prior rolling 12 months.\nAs a result, the Companys revenues are subject to volatility beyond market-based fluctuations discussed in the investment management and administrative fees section above. For the year ended June 30, 2023, the Company realized a decrease in its USGIF base advisory fee of $490,000, and for fiscal year ended June 30, 2022, an increase of $20,000 due to these performance adjustments.\nCorporate Investments\nThe Companys Consolidated Balance Sheets include substantial amounts of assets whose fair values are subject to market risk. The market risks are primarily associated with equity prices and foreign currency exchange rates. The fair values of corporate investments with exposure to the cryptocurrency industry are subject to considerable volatility.\nThe Companys investment activities are reviewed and monitored by Company compliance personnel, and various reports are provided to certain investment advisory clients. Written procedures are in place to manage compliance with the code of ethics and other policies affecting the Companys investment practices.\nEquity Price Risk\nDue to the Companys investments in securities carried at fair value, equity price fluctuations represent a market risk factor affecting the Companys consolidated financial position. The carrying values of investments subject to equity price risks are based on quoted market prices or, if not actively traded, managements estimate of fair value as of the balance sheet date. Market prices fluctuate, and the amount realized in the subsequent sale of an investment may differ significantly from the reported fair value.\nThe following table summarizes the Companys equity price risks in securities carried at fair value as of June 30, 2023, and shows the effects of a hypothetical 25 percent increase and a 25 percent decrease in market prices.\nHypothetical\nEstimated Fair Value\nEstimated Increase\nFair Value at\nPercentage\nAfter Hypothetical\n(Decrease) in\n(dollars in thousands)\nJune 30, 2023\nChange\nPrice Change\nNet Income (Loss) 1\nEquity securities at fair value\n$ 13,205\n25% increase\n$ 16,506\n$ 2,608\n25% decrease\n$ 9,904\n$ (2,608 )\nEmbedded derivatives at fair value 2\n$\n25% increase\n$\n$\n25% decrease\n$\n$ (23 )\n1.\nChanges in unrealized and realized gains and losses on embedded derivatives and equity securities at fair value are included in earnings in the Consolidated Statements of Operations. The estimated increase (decrease) is after income taxes at the statutory rate in effect as of the balance sheet date.\n2.\nAn embedded derivative and its related host contract represent one legal contract and are combined within the investments in available-for-sale debt securities on the Consolidated Balance Sheets.\nThe selected hypothetical changes do not reflect what could be considered best- or worst-case scenarios. Results could be significantly different due to both the nature of markets and the concentration of the Companys investment portfolio.\nCOVID-19 had an effect on volatility in global and domestic financial markets, which may reoccur and continue for an undetermined period. This may not only adversely affect the Companys assets under management but also the valuation of the Companys corporate investments.\nA portion of the equity securities recorded at fair value in the above table subject to equity price risk are investments in common share purchase warrants of HIVE Digital Technologies Ltd. formerly HIVE Blockchain Technologies Ltd., (HIVE), which were valued at $290,000 at June 30, 2023. Also, the embedded derivatives shown in the above table, which were valued at $114,000 at June 30, 2023, are related to HIVE convertible debentures. HIVE is discussed in more detail in Note 4, Investments, to the Consolidated Financial Statements of this Annual Report on Form 10-K. HIVE is a company that is headquartered in Canada with cryptocurrency mining facilities in Iceland, Sweden and Canada. Cryptocurrency markets and related stocks have been, and are expected to continue to be, volatile. There is potential for significant volatility in the market price of HIVE, which could materially impact the investments value included on the Consolidated Balance Sheets and unrealized gain (loss) recognized in net investment income.\nInterest Rate Risk\nDue to the Companys investments in debt securities carried at fair value, interest rate fluctuations represent a market risk factor affecting the Companys consolidated financial position. Debt securities may fluctuate in value due to changes in interest rates. Typically, investments subject to interest rate risk will decrease in value when interest rates rise and increase in value when interest rates decline. Fluctuations in interest rates could have a material impact on the Companys investments in debt securities carried at fair value included on the Consolidated Balance Sheets and gains (losses) recognized in net investment income.\nForeign Currency Risk\nA portion of cash and certain corporate investments are held in foreign currencies. Adverse changes in foreign currency exchange rates would lower the value of those cash accounts and corporate investments. Certain assets under management also have exposure to foreign currency fluctuations in various markets, which could have an impact on their valuation and thus the revenue received by the Company. Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nU.S. Global Investors, Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheet of U.S. Global Investors, Inc. and subsidiaries (the Company) as of June 30, 2023, the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nFair Value of Investment in Available-for-Sale Debt Securities\nAs described further in Note 3 to the financial statements, the Companys investment in available-for-sale debt securities at fair value is $7,008 thousand as of June 30, 2023 and is categorized as a Level 3 investment within the fair value hierarchy.\nManagements valuation techniques for this investment, for which there is no readily available market value, involve measurement using significant unobservable inputs and assumptions and use of a binomial lattice model. The significant unobservable inputs and assumptions disclosed by management include, among others, volatility, credit spread and risk-free rate. Changes in these inputs and assumptions could have a significant impact on the determination of fair value. As such, we identified the investments in available-for-sale debt securities at fair value as a critical audit matter.\nThe principal considerations for our determination that the investments in available-for-sale debt securities at fair value is a critical audit matter are that there are significant management judgements used in developing complex valuation techniques (the binomial lattice model) and inherent estimation uncertainty in the fair value determined using such techniques. Auditing these types of investments requires a high degree of subjective auditor judgment, including use of valuation professionals with specialized skills and knowledge, to evaluate the reasonableness of unobservable inputs and assumptions.\nOur audit procedures related to the critical audit matter included the following, among others:\nWith the assistance of internal valuation specialists, we developed an independent expectation of the fair value and compared that expectation to managements determined fair value for reasonableness.\nWith the assistance of internal valuation specialists, we performed substantive audit procedures to determine the mathematical accuracy of the model used by management as well as the reasonableness of the data used to determine the investment fair value as of June 30, 2023. Our tests of significant inputs and assumptions included the following, among others:\no We inspected the available-for-sale debt security purchase agreement and validated that the inputs such as issuance date, maturity date, principal at issuance and interest rate were consistent with the inputs utilized in managements valuation model.\no We reviewed the volatility analysis prepared by managements external specialist and performed an independent calculation to ensure the selected volatility was appropriate and within a reasonable range.\no We performed an independent synthetic credit analysis to determine the reasonableness of the credit spread prepared by managements external specialist.\nWe reviewed the risk-free rate utilized by managements external specialist for appropriateness, taking into consideration the note was issued in Canada and factoring into our evaluation any potential foreign currency translation adjustments.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2022.\nDallas, Texas\nNovember 16, 2023\nGrant Thornton LLP; Dallas, Texas; PCAOB ID# 248\nReport of Independent Registered Public Accounting Firm\nShareholders and Board of Directors\nU.S. Global Investors, Inc.\nSan Antonio, Texas\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying Consolidated Balance Sheet of U.S. Global Investors, Inc. and subsidiaries (the Company) as of June 30, 2022, and the related Consolidated Statement of Operations, Comprehensive Income, Shareholders Equity, and Cash Flows for year ended June 30, 2022, and the related notes (collectively referred to as the Consolidated Financial Statements). In our opinion, the Consolidated Financial Statements present fairly, in all material respects, the financial position of the Company and subsidiaries at June 30, 2022, and the results of their operations and their cash flows for the period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nRestatement of Financial Statements\nAs discussed in Note 3 to the Consolidated Financial Statements, the 2022 financial statements were restated to correct misstatements.\nBasis for Opinion\nThese Consolidated Financial Statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys Consolidated Financial Statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the Consolidated Financial Statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the Consolidated Financial Statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence supporting the amounts and disclosures in the Consolidated Financial Statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the Consolidated Financial Statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BDO USA, LLP\nWe have served as the Company's auditor from 2004 to 2022.\nDallas, Texas\nSeptember 1, 2022, except for the impact of the restatement discussed in Note 3, as to which the date is May 19, 2023.\nU.S. GLOBAL INVESTORS, INC.\nCONSOLIDATED BALANCE SHEETS\n(dollars in thousands)\nJune 30, 2023 June 30, 2022\nAssets\nCurrent Assets\nCash and cash equivalents\n$ 25,401 $ 22,314\nRestricted cash\n1,000 1,000\nInvestments in equity securities at fair value, current\n11,642 12,138\nAccounts and other receivables\n1,245 1,796\nTax receivable\n576 384\nPrepaid expenses\n510 400\nTotal Current Assets\n40,374 38,032\nNet Property and Equipment\n1,138 1,370\nOther Assets\nDeferred tax asset\n1,920 872\nInvestments in equity securities at fair value, non-current\n1,563 2,162\nInvestments in available-for-sale debt securities at fair value\n7,008 10,625\nInvestments in held-to-maturity debt securities\n1,000 1,000\nOther investments\n2,388 3,992\nFinancing lease, right of use assets\n65 93\nOther assets, non-current\n217 216\nTotal Other Assets\n14,161 18,960\nTotal Assets\n$ 55,673 $ 58,362\nLiabilities and Shareholders Equity\nCurrent Liabilities\nAccounts payable\n$ 143 $ 73\nAccrued compensation and related costs\n1,165 1,864\nDividends payable\n329 337\nFinancing lease liability, short-term\n28 27\nOther accrued expenses\n1,274 1,831\nTotal Current Liabilities\n2,939 4,132\nLong-Term Liabilities\nDeferred tax liability\n4 -\nReserve for uncertain tax positions\n496 379\nFinancing lease liability, long-term\n38 66\nTotal Long-Term Liabilities\n538 445\nTotal Liabilities\n3,477 4,577\nCommitments and Contingencies (Note 18)\nShareholders Equity\nCommon stock (class A) - $0.025 par value; nonvoting; 28,000,000 shares authorized; 13,866,999 shares issued at June 30, 2023, and 2022; 12,496,674 and 12,888,950 shares outstanding at June 30, 2023, and 2022, respectively\n347 347\nCommon stock (class B) - $0.025 par value; nonvoting; 4,500,000 shares authorized; no shares issued\n- -\nConvertible common stock (class C) - $0.025 par value; voting; 3,500,000 shares authorized; 2,068,549 shares issued and outstanding at June 30, 2023, and 2022\n52 52\nAdditional paid-in-capital\n16,442 16,438\nTreasury stock, class A shares at cost; 1,370,325 shares and 978,049 shares at June 30, 2023, and 2022, respectively\n(3,740 ) (2,599 )\nAccumulated other comprehensive income, net of tax\n1,348 3,624\nRetained earnings\n37,747 35,923\nTotal Shareholders Equity\n52,196 53,785\nTotal Liabilities and Shareholders Equity\n$ 55,673 $ 58,362\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nU.S. GLOBAL INVESTORS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended June 30,\n(dollars in thousands, except per share data)\n2023 2022\nOperating Revenues\nAdvisory fees\n$ 14,940 $ 24,525\nAdministrative services fees\n134 189\n15,074 24,714\nOperating Expenses\nEmployee compensation and benefits\n4,798 6,059\nGeneral and administrative\n6,122 6,911\nAdvertising\n382 405\nDepreciation\n243 226\nInterest\n4 -\n11,549 13,601\nOperating Income\n3,525 11,113\nOther Income (Loss)\nNet investment income (loss)\n316 (6,174 )\nLoss from equity method investments\n- (206 )\nOther income\n242 235\n558 (6,145 )\nIncome Before Income Taxes\n4,083 4,968\nProvision for Income Taxes\nTax expense\n934 1,528\nNet Income\n$ 3,149 $ 3,440\nEarnings Per Share\nBasic Net Income per Share\n$ 0.22 $ 0.23\nDiluted Net Income per Share\n$ 0.22 $ 0.23\nBasic weighted average number of common shares outstanding\n14,638,833 15,010,138\nDiluted weighted average number of common shares outstanding\n14,639,069 15,011,128\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nU.S. GLOBAL INVESTORS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended June 30,\n(dollars in thousands)\nNet Income\n$ 3,149 $ 3,440\nOther Comprehensive Loss:\nUnrealized losses on available-for-sale securities arising during period, net of tax\n(961 ) (1,209 )\nLess: reclassification adjustment for gains included in net income, net of tax\n(1,315 ) (1,731 )\nNet change from available-for-sale securities\n(2,276 ) (2,940 )\nForeign currency translation adjustment\n- (13 )\nLess: reclassification adjustment for foreign currency gains included in net income\n- (10 )\nNet change from foreign currency translations\n- (23 )\nOther Comprehensive Loss\n(2,276 ) (2,963 )\nComprehensive Income\n$ 873 $ 477\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nU.S. GLOBAL INVESTORS, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nCommon Stock\nConvertible Common Stock\nTreasury Stock\nAccumulated\n(class A)\n(class C)\nAdditional\nOther\nPaid-in Comprehensive Retained\n(dollars in thousands)\nShares\nPar Value\nShares\nPar Value\nCapital\nShares\nCost\nIncome (Loss)\nEarnings\nTotal\nBalance at June 30, 2021\n13,866,913 $ 347 2,068,635 $ 52 $ 15,677 898,953 $ (2,172 ) $ 6,587 $ 33,833 $ 54,324\nRepurchases of shares of Common Stock (class A)\n- - - - - 89,287 (452 ) - - (452 )\nIssuance of stock under ESPP of shares of Common Stock (class A)\n- - - - 28 (10,191 ) 25 - - 53\nConversion of shares of class C common stock for class A common stock\n86 - (86 ) - - - - - - -\nShare-based compensation, net of tax\n- - - - 733 - - - - 733\nDividends declared\n- - - - - - - - (1,350 ) (1,350 )\nOther comprehensive loss, net of tax\n- - - - - - - (2,963 ) - (2,963 )\nNet income\n- - - - - - - - 3,440 3,440\nBalance at June 30, 2022\n13,866,999 $ 347 2,068,549 $ 52 $ 16,438 978,049 $ (2,599 ) $ 3,624 $ 35,923 $ 53,785\nRepurchases of shares of Common Stock (class A)\n- - - - - 412,257 (1,195 ) - - (1,195 )\nIssuance of stock under ESPP of shares of Common Stock (class A)\n- - - - 5 (19,981 ) 54 - - 59\nShare-based compensation, adjustment for forfeitures, net of tax\n- - - - (1 ) - - - - (1 )\nDividends declared\n- - - - - - - - (1,325 ) (1,325 )\nOther comprehensive loss, net of tax\n- - - - - - - (2,276 ) - (2,276 )\nNet income\n- - - - - - - - 3,149 3,149\nBalance at June 30, 2023\n13,866,999 $ 347 2,068,549 $ 52 $ 16,442 1,370,325 $ (3,740 ) $ 1,348 $ 37,747 $ 52,196\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nU.S. GLOBAL INVESTORS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended June 30,\n(dollars in thousands)\n2023 2022\nCash Flows from Operating Activities:\nNet income\n$ 3,149 $ 3,440\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation, amortization and accretion\n(246 ) (419 )\nNet realized loss on disposal of fixed assets\n3 -\nNet realized gains on securities\n(1,211 ) (4,039 )\nUnrealized losses on securities\n2,452 11,914\nInvestment basis adjustment\n(5 ) 5\nNet loss from equity method investment\n- 206\nForeign currency transaction gain\n- (10 )\nProvision for deferred taxes\n(440 ) (2,891 )\nShare-based compensation expense\n- 733\nChanges in operating assets and liabilities:\nAccounts and other receivables\n359 2,501\nPrepaid expenses and other assets\n(82 ) (217 )\nAccounts payable and accrued expenses\n(1,069 ) (688 )\nTotal adjustments\n(239 ) 7,095\nNet cash provided by operating activities\n2,910 10,535\nCash Flows from Investing Activities:\nPurchase of property and equipment\n(14 ) (220 )\nPurchase of equity securities at fair value, current\n- (6,000 )\nPurchase of equity securities at fair value, non-current\n- (123 )\nPurchase of other investments\n(663 ) (620 )\nProceeds from sale of equity method investment\n- 85\nProceeds on sale of equity securities at fair value, current\n350 -\nProceeds on sale of equity securities at fair value, non-current\n- 2,850\nProceeds from principal paydowns of available-for-sale debt securities at fair value\n3,000 3,000\nReturn of capital on other investments\n- 9\nNet cash provided by (used in) investing activities\n2,673 (1,019 )\nCash Flows from Financing Activities:\nPrincipal payments on financing lease\n(27 ) -\nIssuance of common stock\n59 53\nRepurchases of common stock\n(1,195 ) (452 )\nDividends paid\n(1,333 ) (1,239 )\nNet cash used in financing activities\n(2,496 ) (1,638 )\nNet increase in cash, cash equivalents, and restricted cash\n3,087 7,878\nBeginning cash, cash equivalents, and restricted cash\n23,314 15,436\nEnding cash, cash equivalents, and restricted cash\n$ 26,401 $ 23,314\nSupplemental Disclosures of Non-Cash Investing and Financing Activities\nDividends declared but not paid\n$ 329 $ 337\nFair value of assets acquired\n$ - $ 228\nSupplemental Disclosures of Cash Flow Information\nCash paid for income taxes\n$ 1,492 $ 4,142\nCash paid for interest\n$ 4 $ -\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\nNotes to Consolidated Financial Statements\nNOTE 1. REVISION OF PREVIOUSLY ISSUED CONSOLIDATED FINANCIAL STATEMENTS\nIn connection with the preparation of its Consolidated Financial Statements for the fiscal year ended June 30, 2023, the Company determined that its previously issued Consolidated Financial Statements as of and for the fiscal year ended June 30, 2022, contained an error as summarized below. Based on managements evaluation of the accounting error under the SEC Staffs Accounting Bulletins Nos. 99 (SAB 99) and 108 (SAB 108) and interpretations thereof, the Company concluded the error is not material, on an individual or aggregate basis, to the Companys previously reported financial statements. The Company has corrected this accounting error in the accompanying Consolidated Financial Statements as of and for the fiscal year ended June 30, 2022, as a revision to those financial statements.\nThe Company did not record certain liabilities as required by FASB Interpretation No. 48 Accounting for Uncertainty in Income Taxes (codified under ASC 740-10) (FIN 48) for fiscal years 2022 and 2021. The error for both fiscal year 2021 and 2022 were corrected in the Companys Consolidated Financial Statements as of and for the year ended June 30, 2022.\nThe following tables set forth the impact of correcting this error in the Companys previously issued Consolidated Financial Statements, as of and for the year ended June 30, 2022.\nCONSOLIDATED BALANCE SHEET\nJune 30, 2022\nAs\nPreviously\nImmaterial\nAs\n(dollars in thousands)\nReported\nRevisions\nRevised\nLong-Term Liabilities\nReserve for uncertain tax positions\n$ - $ 379 $ 379\nTotal Long-Term Liabilities\n$ 66 $ 379 $ 445\nTotal Liabilities\n$ 4,198 $ 379 $ 4,577\nShareholders Equity\nRetained earnings\n$ 36,302 $ (379 ) $ 35,923\nTotal Shareholders Equity\n$ 54,164 $ (379 ) $ 53,785\nCONSOLIDATED STATEMENT OF OPERATIONS\nYear Ended June 30, 2022\nAs\nPreviously\nImmaterial\nAs\n(dollars in thousands, except per share data)\nReported\nRevisions\nRevised\nProvision for Income Taxes\nTax expense\n$ 1,149 $ 379 $ 1,528\nNet Income\n$ 3,819 $ (379 ) $ 3,440\nEarnings Per Share\nBasic Net Income per Share\n$ 0.25 $ (0.02 ) $ 0.23\nDiluted Net Income per Share\n$ 0.25 $ (0.02 ) $ 0.23\nIn addition to the changes listed above, the Consolidated Statements of Comprehensive Income, Consolidated Statements of Shareholders' Equity, Consolidated Statements of Cash Flows, and impacted footnote disclosures have also been revised to reflect the error correction.\nNOTE 2. ORGANIZATION\nU.S. Global Investors, Inc. (the Company or U.S. Global) serves as investment adviser to U.S. Global Investors Funds (USGIF or the Fund(s)), a Delaware statutory trust that is a no-load, open-end investment company offering shares in numerous mutual funds to the investing public. The Company also provides administrative services to USGIF. For these services, the Company receives fees from USGIF. The Company also provides advisory services to SEC registered exchange traded funds (ETFs).\nThe Company has the following subsidiaries utilized primarily for corporate investment purposes: U.S. Global Investors (Bermuda) Limited (USBERM), incorporated in Bermuda, and U.S. Global Investors (Canada) Limited (USCAN). The Company created U.S. Global Indices, LLC, a Texas limited liability company, of which the Company is the sole member, to provide indexing services to exchange-traded funds managed by the Company.\nNOTE 3. SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation. The Consolidated Financial Statements include the accounts of the Company and its wholly-owned subsidiaries: USBERM, USCAN and U.S. Global Indices, LLC.\nThere are two primary consolidation models in U.S. GAAP, the variable interest entity (VIE) and voting interest entity models. The Companys evaluation for consolidation includes whether entities in which it has an interest or from which it receives fees are VIEs and whether the Company is the primary beneficiary of any VIEs identified in its analysis. A VIE is an entity in which either (a) the equity investment at risk is not sufficient to permit the entity to finance its own activities without additional financial support or (b) the group of holders of the equity investment at risk lacks certain characteristics of a controlling financial interest. The primary beneficiary is the entity that has the obligation to absorb a majority of the expected losses or the right to receive the majority of the residual returns and consolidates the VIE on the basis of having a controlling financial interest.\nThe Company holds variable interests in, but is not deemed to be the primary beneficiary of, certain funds it advises, specifically, certain funds in USGIF. The Companys interests in these VIEs consist of the Companys direct ownership therein and any fees earned but uncollected. In the ordinary course of business, the Company may choose to waive certain fees or assume operating expenses of the funds it advises for competitive, regulatory or contractual reasons (see Note 5 for information regarding fee waivers). The Company has not provided financial support to any of these entities outside the ordinary course of business. The Companys risk of loss with respect to these VIEs is limited to the carrying value of its investments in, and fees receivable from, the entities. The Company is not deemed to be the primary beneficiary because it does not have the obligation to absorb a majority of the expected losses or the right to receive the majority of the residual returns. The Company does not consolidate these VIEs because it is not the primary beneficiary. The Companys total exposure to unconsolidated VIEs, consisting of the carrying value of investment securities and receivables for fees, was $12.5 million and $12.8 million at June 30, 2023, and 2022, respectively.\nThe carrying ﻿amount of assets and liabilities recognized in the Consolidated Balance Sheets related to the Company's interests in these non-consolidated VIEs were as follows:\nCarrying Value and Maximum Exposure to Loss\n(dollars in thousands)\nJune 30, 2023\nJune 30, 2022\nInvestments in equity securities at fair value, current\n$ 11,642 $ 12,138\nInvestments in equity securities at fair value, non-current\n785 623\nOther receivables\n45 21\nTotal VIE assets, maximum exposure to loss\n12,472 12,782\nOther accrued expenses\n- 110\nTotal carrying amount\n$ 12,472 $ 12,672\nSince the Company is not the primary beneficiary of the above funds it advises, the Company evaluated if it should consolidate under the voting interest entity model. Under the voting interest model, for legal entities other than partnerships, the usual condition for control is ownership, directly or indirectly, of more than 50 percent of the outstanding voting shares over an entity. The Company does not have control of any of the above funds it advises; therefore, the Company does not consolidate any of these funds.\nDuring the year ended June 30, 2022, the Company held a variable interest in a fund organized as a limited partnership, but this entity did not qualify as a VIE. Since it was not a VIE, the Company evaluated if it should consolidate it under the voting interest entity model. Under the voting interest model, for legal entities other than partnerships, the usual condition for control is ownership, directly or indirectly, of more than 50 percent of the outstanding voting shares over an entity. The Company did not have control of the entity and, therefore, did not consolidate it. However, the Company was considered to have the ability to exercise significant influence. Thus, the investment was accounted for under the equity method of accounting. During the year ended June 30, 2022, this entity was dissolved. See further information about this investment in Note 4.\nAll significant intercompany balances and transactions have been eliminated in consolidation. Certain amounts have been reclassified for comparative purposes.\nRestatement of Previously Issued Financial Statements. The Consolidated Financial Statements as of and for the year ended June 30, 2022, were previously restated for the correction of material errors.\nCash and Cash Equivalents. Cash and cash equivalents include highly liquid investments with original maturities of three months or less.\nRestricted Cash. Restricted cash represents cash invested in a money market account as collateral for credit facilities that is not available for general corporate use.\nInvestments. The Company records security transactions on trade date. Realized gains (losses) from security transactions are calculated on a first-in/first-out cost basis, unless otherwise identifiable, and are recorded in earnings on the date of sale.\nInvestments in Equity Securities. Equity securities are generally carried at fair value on the Consolidated Balance Sheets with changes in the fair value recorded through earnings within net investment income (loss).\nInvestments in Debt Securities. The Company classifies debt investments as available-for-sale or held-to-maturity based on the Companys intent to sell the security or, its intent and ability to hold the debt security to maturity. Available-for-sale debt securities are carried at fair value, and changes in unrealized gains and losses are reported net of tax in accumulated other comprehensive income (loss), except for declines in fair value determined to be other than temporary, which are reported in earnings. Upon the disposition of an available-for-sale security, the Company reclassifies the gain or loss on the security from accumulated other comprehensive income (loss) to net investment income (loss). Held-to-maturity debt securities are purchased with the intent and ability to hold until maturity and are carried at amortized cost.\nEmbedded derivatives. The Company does not use derivatives for trading, speculation, or hedging exposures. Certain financial instruments the Company invests in contain both a derivative and a non-derivative component. In such cases, the derivative component is termed an embedded derivative, with the non-derivative component representing the host contract. If the economic characteristics and risks of embedded derivative are not closely related to those of the host contract, and the changes in the fair value of the host contact itself is not recorded through earnings within net investment income (loss), the embedded derivative is bifurcated and carried at fair value, with changes in the fair value recorded through earnings within net investment income (loss) on the Consolidated Statements of Operations. The host contract will continue to be accounted for in accordance with the appropriate accounting standard. The embedded derivative and the related host contract represent one legal contract and are combined on the Consolidated Balance Sheets, the Consolidated Statements of Cash Flows, and tables within Note 4, Investments, unless otherwise indicated.\nOther Investments. Other investments consist of equity investments in entities over which the Company is unable to exercise significant influence and which do not have readily determinable fair values. The Company has elected to value these investments using the measurement alternative, under which such securities are measured at cost, less impairment, if any. If the Company identifies observable price changes for identical or similar securities of the same issuer, the equity security is measured at fair value as of the date the observable transaction occurred, with such changes recorded in net investment income (loss). The Company reassesses at each reporting period whether the equity investment's fair value becomes readily determinable, and if so, the Company subsequently elects to measure the equity investment at fair value.\nEquity Method Investments. Investments classified as equity method consist of investments in companies in which the Company is able to exercise significant influence but not control. Under the equity method of accounting, the investment is initially recorded at cost, then the Companys proportional share of investees underlying net income or loss is recorded as a component of other income with a corresponding increase or decrease to the carrying value of the investment. Distributions received from the investee reduce the Companys carrying value of the investment. These investments are evaluated for impairment if events or circumstances arise that indicate that the carrying amount of such assets may not be recoverable. No impairment was recognized for the Companys equity method investment during the years presented.\nFair Value of Financial Instruments. The financial instruments of the Company are reported on the Consolidated Balance Sheets at market or fair values or at carrying amounts that approximate fair values.\nReceivables. Receivables other than notes receivable consist primarily of advisory and other fees owed to the Company by clients. The Company may also invest in notes receivable. Notes receivable are recorded in accordance with the terms of the agreement, and accrued interest is recorded when earned. Unearned fees are shown as a deduction from the related notes receivable and are amortized to interest income using the effective interest method. The Company reviews the need for an allowance for credit losses for notes and other receivables based on various factors including payment history, historical bad debt experience, existing economic conditions, aging and specific accounts identified as high risk. Uncollectible receivables, if any, are charged against the allowance when all reasonable efforts to collect the amounts due have been exhausted. The Company had no allowance for credit losses as of June 30, 2023, or 2022.\nProperty and Equipment. Fixed assets are recorded at cost. Depreciation for fixed assets is recorded using the straight-line method over the estimated useful life of each asset as follows: furniture and equipment are depreciated over 3 to 10 years, and the building and related improvements are depreciated over 14 to 40 years.\nLeases. The Company leases equipment under various leasing arrangements. Leases may be classified as either financing leases or operating leases, as appropriate. The Company determines if a contract is a lease or contains a lease at inception. The Company accounts for lease and non-lease components as a single component for its leases. The Company elected the short-term lease exception for leases with an initial term of 12 months or less. Consequently, such leases are not recorded on the Consolidated Balance Sheets. The Companys lease terms include options to extend or terminate the lease when it is reasonably certain they will be exercised or not, respectively.\nFixed lease payments are included in right of use (ROU) assets and lease liabilities within other assets and liabilities, respectively, on the Consolidated Balance Sheets. ROU assets and lease liabilities are recognized based on the present value of the future lease payments over the lease term at the commencement date using the Companys incremental borrowing rate as the discount rate. Fixed lease payments made over the lease term are recorded as lease expense on a straight-line basis. Variable lease payments based on usage, changes in an index or market rate are expensed as incurred.\nFor new leases, the discount rates are based on the entire noncancelable lease term.\nThe Company is the lessor of certain areas of its owned office building under operating leases. The Company determines if a contract is a lease or contains a lease at inception. The Company elected not to separate lease and related non-lease components and account for the combined component as an operating lease.\nImpairment of Long-Lived Assets. The Company reviews property and equipment and other long-lived assets for impairment whenever events or changes in business circumstances indicate the net book values of the assets may not be recoverable. Impairment is indicated when the assets net book value is less than the fair value of the asset. If this occurs, an impairment loss is recognized for the difference between the fair value and net book value. Factors that indicate potential impairment include: a significant decrease in the market value of the asset or a significant change in the assets physical condition or use. No impairments of long-lived assets were recorded during the years included in these financial statements.\nTreasury Stock. Treasury stock purchases are accounted for under the cost method. The subsequent issuances of these shares are accounted for based on their weighted-average cost basis.\nShare-Based Compensation. Share-based compensation expense is measured at the grant date based on the fair value of the award, and the cost is recognized as expense ratably over the awards vesting period. Forfeitures are recognized as they occur.\nIncome Taxes. Provisions for income taxes include deferred taxes for temporary differences in the bases of assets and liabilities for financial and tax purposes, resulting from the use of the liability method of accounting for income taxes. The liability method requires that deferred tax assets be reduced by a valuation allowance in cases where it is more likely than not that the deferred tax assets will not be realized. The Company accounts for income taxes in accordance with ASC 740, Income Taxes. The Companys policy is to recognize interest and penalties related to uncertain tax positions in income tax expense.\nThe Company also maintains a reserve for uncertain tax positions. The Company evaluates tax positions taken or expected to be taken in a tax return for recognition in the Consolidated Financial Statements. Prior to recording the related tax benefit in the Consolidated Financial Statements, the Company must conclude that tax positions will be more-likely-than-not to be sustained, assuming those positions will be examined by taxing authorities with full knowledge of all relevant information. The benefit recognized in the Consolidated Financial Statements is the amount the Company expects to realize after examination by taxing authorities. If a tax position drops below the more-likely-than-not standard, the benefit can no longer be recognized. Assumptions, judgment, and the use of estimates are required in determining if the more-likely-than-not standard has been met when developing the provision for income taxes and in determining the expected benefit. A change in the assessment of the more-likely-than-not standard could materially impact the Companys results of operations or financial position. See Note 13 for further discussion of the Companys reserve for uncertain tax positions.\nThe Company has elected to treat the global intangible low-taxed income (GILTI) tax as a period expense. The Company also elected to use the tax law ordering approach when assessing the realization of net operating losses related to GILTI.\nRevenue Recognition. The Companys operating revenue is earned from investment advisory and administrative services provided to clients. Each distinct service promised in the agreements is considered a performance obligation and is the basis for determining when revenue is recognized. The fees are allocated to each distinct performance obligation and revenue is recognized when, or as, promises are satisfied. The consideration for services is generally variable and included in net revenues when it is improbable that a significant reversal could occur in the future. The timing of when clients are billed and related payment received varies in accordance with agreed-upon contractual terms. For current agreements, billing occurs after the Company has recognized revenue which results in accounts receivable and revenue.\nInvestment Advisory Fees. The investment advisory agreements have a single performance obligation, since the promised services are not separately identifiable from other promises in the agreements and, therefore, are not distinct. Investment advisory fees are comprised of two components, a base fee and a performance fee, if applicable. Base investment advisory fees are recognized as the services are performed over time and are based upon agreed-upon percentages of average assets under management (AAUM), depending on contractual terms. These fees are received in cash after the end of each monthly period within 30 days. Investment advisory fees are affected by changes in assets under management, including market appreciation or depreciation, foreign exchange translation, and net inflows or outflows. Investment advisory fees are reported net of fee waivers.\nPerformance Fees. USGI receives investment advisory performance fees from certain funds. Performance fees for the equity funds within USGIF are a fulcrum fee that is a 0.25 percent adjustment upwards or downwards of the base investment advisory fees when there is a 5 percent difference between a funds performance and that of its benchmark index over the prior rolling 12 months. Performance fees are recorded when it is determined that they are no longer probable of significant reversal. These fees are received in cash or paid in cash after the end of each monthly period within 30 days. Performance fees are affected by changes in fund performance, benchmark index performance, and assets under management.\nAdministrative Services Fees. The administrative services agreement has a single performance obligation, since the promised services are not separately identifiable from other promises in the agreement and, therefore, are not distinct. Administrative services fees are recognized as the services are performed over time and are based upon agreed-upon percentages of AAUM. These fees are received in cash after the end of each monthly period within 30 days. Administrative services fees are affected by changes in assets under management, including market appreciation or depreciation, foreign exchange translation, and net inflows or outflows. Administrative services fees are reported net of fee waivers.\nFee Waivers. For certain clients, the Company has agreed to contractually limit the expenses or voluntarily waive or reduce its fees and/or agreed to pay expenses for funds. These fee waivers are deemed to be a reduction of the transaction price and are reported as a reduction of investment advisory fees and/or administrative services fees. These fees are paid in cash after the end of each monthly period within 30 days.\nDividends and Interest. Dividends are recorded on the ex-dividend date, and interest income is recorded on an accrual basis. Any discount between the cost and the principal amount of debt investments is amortized to interest income using the effective interest method. Both dividends and interest income are included in investment income.\nAdvertising Costs. The Company expenses advertising costs as they are incurred. The Company is reimbursed for certain advertising expenses related to USGIF from the distributor for USGIF.\nForeign Exchange. The balance sheets of certain foreign subsidiaries of the Company and certain foreign-denominated investment products are translated at the current exchange rate as of the end of the accounting period and the related income or loss is translated at the average exchange rate in effect during the period. Net exchange gains and losses resulting from balance sheet translations of foreign subsidiaries are excluded from income and are recorded in accumulated other comprehensive income (loss) on the Consolidated Balance Sheets. Net exchange gains and losses resulting from income or loss translations are included in income and are recorded in net investment income (loss) on the Consolidated Statements of Operations. Investment transactions denominated in foreign currencies are converted to U.S. dollars using the exchange rate on the date of the transaction and any related gain or loss is included in net investment income (loss) on the Consolidated Statements of Operations.\nUse of Estimates. The preparation of the Consolidated Financial Statements in conformity with generally accepted accounting principles requires the Company to make estimates and assumptions that affect the amounts reported in the Consolidated Financial Statements and accompanying notes. Actual results could differ from these estimates.\nCOVID-19 adversely affected the global financial markets, and in the future it or other epidemics, pandemics or outbreaks may adversely affect the Companys results of operations, cash flows and financial position. The Company cannot reasonably estimate the future impact, given the uncertainty over the duration and severity of the economic impact.\nEarnings Per Share. The Company computes and presents earnings per share in accordance with ASC 260, Earnings Per Share. Basic earnings per share (EPS) excludes dilution and is computed by dividing net income (loss) by the weighted average number of common shares outstanding for the period. Diluted EPS reflects the potential dilution of EPS that could occur if options to issue common stock were exercised. The Company has two classes of common stock with outstanding shares. Both classes share equally in dividend and liquidation preferences.\nAccumulated Other Comprehensive Income (Loss). Accumulated other comprehensive income (loss), net of tax, is reported in the Consolidated Balance Sheets and the Consolidated Statements of Shareholders Equity and includes any unrealized gains and losses on debt securities classified as available-for-sale and foreign currency translation adjustments.\nRecent Accounting Pronouncements and Developments\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326), Measurement of Credit Losses on Financial Instruments, and has subsequently issued several amendments (collectively, ASU 2016-13). ASU 2016-13 adds to U.S. GAAP an impairment model (known as the current expected credit loss model) that is based on expected losses rather than incurred losses. Under the new guidance, an entity recognizes as an allowance its estimate of expected credit losses. The standard became effective for the Company on July 1, 2023. The Company has evaluated the guidance and does not believe the adoption of this standard will have a material impact on the Company's financial statements.\nIn December 2019, the FASB issued ASU 2019-12, Simplifying the Accounting for Income Taxes (ASU 2019-12). ASU 2019-12 enhances and simplifies various aspects of the income tax accounting guidance. The amendments in ASU 2019-12 are effective for public business entities for fiscal years beginning after December 15, 2020, including interim periods therein. Early adoption of the standard is permitted. The standard became effective for the Company on July 1, 2021. The adoption of the standard did not have a material impact on the Companys financial statements or disclosures.\nIn June 2022, the FASB issued ASU 2022-03, Fair Value Measurement (Topic 820), Fair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions (ASU 2022-03). The FASB issued ASU 2022-03 (1) to clarify the guidance in Topic 820, Fair Value Measurement, when measuring the fair value of an equity security subject to contractual restrictions that prohibit the sale of an equity security, (2) to amend a related illustrative example, and (3) to introduce new disclosure requirements for equity securities subject to contractual sale restrictions that are measured at fair value in accordance with Topic 820. ASU 2022-03 will be effective for fiscal years beginning after December 15, 2023. Early adoption is permitted for both interim and annual financial statements that have not yet been issued or made available for issuance. The Company does not expect this standard to have a material impact on its financial statements.\nNOTE 4. INVESTMENTS\nAs of June 30, 2023, the Company held investments carried at fair value on a recurring basis of $20.2 million and a cost basis of $27.3 million. The fair value of these investments is approximately 36.3 percent of the Companys total assets at June 30, 2023. In addition, the Company held other investments of approximately $2.4 million, and held-to-maturity debt investments of $1.0 million.\nThe cost basis of investments is adjusted for amortization of premium or accretion of discount on debt securities held or the recharacterization of distributions from investments in partnerships, if applicable.\nConcentrations of Credit Risk\nA significant portion of the Companys investments carried at fair value on a recurring basis is investments in USGIF, which were $12.4 million and $12.8 million as of June 30, 2023, and 2022, respectively, and investments in HIVE Digital Technologies Ltd., formerly HIVE Blockchain Technologies Ltd., (HIVE), which were warrants and convertible debentures valued at $7.3 million and $11.1 million as of June 30, 2023, and 2022, respectively. For these investments, the maximum amount of loss due to credit risk the Company could incur is the fair value of the financial instruments.\nFair Value Hierarchy\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The valuation techniques described below maximize the use of observable inputs and minimize the use of unobservable inputs in determining fair value.\nThe inputs used for measuring financial instruments at fair value are summarized in the three broad levels listed below:\nLevel 1 - Inputs represent unadjusted quoted prices for identical assets exchanged in active markets.\nLevel 2 - Inputs include directly or indirectly observable inputs (other than Level 1 inputs) such as quoted prices for similar assets exchanged in active or inactive markets; quoted prices for identical assets exchanged in inactive markets; other inputs that may be considered in fair value determinations of the assets, such as interest rates and yield curves; and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nLevel 3 - Inputs include unobservable inputs used in the measurement of assets. The Company is required to use its own assumptions regarding unobservable inputs because there is little, if any, market activity in the assets and it may be unable to corroborate the related observable inputs. Unobservable inputs require management to make certain projections and assumptions about the information that would be used by market participants in valuing assets.\nThe Companys assessment of the significance of a particular input to the fair value measurement in its entirety requires judgment and considers factors specific to the financial instrument. The inputs or methodology used for valuing securities are not necessarily an indication of the risk associated with investing in those securities. Because of the inherent uncertainties of valuation, the values reflected may materially differ from the values received upon actual sale of those investments.\nThe Company has established a Proprietary Valuation Committee (the Committee) to administer and oversee the Companys valuation policies and procedures, which are approved by the Board of Directors, and to perform a periodic review of valuations provided by independent pricing services.\nFor actively traded securities, the Company values investments using the closing price of the securities on the exchange or market on which the securities principally trade. If the security is not traded on the last business day of the quarter, it is generally valued at the mean between the last bid and ask quotation. The fair value of a security that has a restriction greater than one year is based on the quoted price for an otherwise identical unrestricted instrument that trades in a public market, adjusted for the estimated effect of the restriction. Mutual funds, which include open- and closed-end funds and exchange-traded funds, are valued at net asset value or closing price, as applicable.\nFor common share purchase warrants not traded on an exchange, the estimated fair value is determined using the Black-Scholes option-pricing model. This sophisticated model utilizes a number of assumptions in arriving at its results, including the estimated life, the risk-free interest rate, and historical volatility of the underlying common stock. The Company may change the assumption of the risk-free interest rate and utilize the yield curve for instruments with similar characteristics, such as credit ratings and jurisdiction, or change the expected volatility. The effects of changing any of the assumptions or factors employed by the Black-Scholes model may result in a significantly different valuation.\nCertain convertible debt securities not traded on an exchange are valued by an independent third party using a binomial lattice model based on factors such as yield, quality, maturity, coupon rate, type of issuance, individual trading characteristics of the underlying common shares and other market data. The model utilizes a number of assumptions in arriving at its results. The effects of changing any of the assumptions or factors utilized in the binomial lattice model, including expected volatility, credit adjusted discount rates, and discounts for lack of marketability, may result in a significantly different valuation for the securities.\nFor other securities included in the fair value hierarchy with unobservable inputs, the Committee considers a number of factors in determining a securitys fair value, including the securitys trading volume, market values of similar class issuances, investment personnels judgment regarding the market experience of the issuer, financial status of the issuer, the issuers management, and back testing, as appropriate. The fair values may differ from what may have been used had a broader market for these securities existed. The Committee reviews inputs and assumptions and reports material items to the Board of Directors. Securities which do not have readily determinable fair values are also periodically reviewed by the Committee.\nThe following summarizes the major categories of investments with fair values adjusted on a recurring basis as of June 30, 2023, and 2022, and other investments with fair values adjusted on a nonrecurring basis, with fair values shown according to the fair value hierarchy.\nJune 30, 2023\nSignificant\nSignificant\nOther\nUnobservable\nQuoted Prices\nInputs\nInputs\n(dollars in thousands)\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\nInvestments carried at fair value on a recurring basis:\nInvestments in equity securities:\nEquities - International\n$ 488 $ - $ 290 $ 778\nMutual funds - Fixed income\n11,642 - - 11,642\nMutual funds - Global equity\n785 - - 785\nTotal investments in equity securities:\n$ 12,915 $ - $ 290 $ 13,205\nInvestments in debt securities:\nAvailable-for-sale - Convertible debentures\n- - 7,008 7,008\nTotal investments carried at fair value on a recurring basis:\n$ 12,915 $ - $ 7,298 $ 20,213\nInvestments carried at fair value on a nonrecurring basis:\nOther investments1\n$ - $ - $ 1,786 $ 1,786\nJune 30, 2022\nSignificant\nSignificant\nOther\nUnobservable\nQuoted Prices\nInputs\nInputs\n(dollars in thousands)\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\nInvestments carried at fair value on a recurring basis:\nInvestments in equity securities:\nEquities - International\n$ 1,024 $ - $ 515 $ 1,539\nMutual funds - Fixed income\n12,138 - - 12,138\nMutual funds - Global equity\n623 - - 623\nTotal investments in equity securities:\n$ 13,785 $ - $ 515 $ 14,300\nInvestments in debt securities:\nAvailable-for-sale - Convertible debentures\n- - 10,625 10,625\nTotal investments carried at fair value on a recurring basis:\n$ 13,785 $ - $ 11,140 $ 24,925\nInvestments carried at fair value on a nonrecurring basis:\nOther investments1\n$ - $ - $ 781 $ 781\n1. Other investments include equity securities without readily determinable fair values that were adjusted as a result of the measurement alternative on dates other than June 30, 2023, and 2022. These securities are classified as level 3 due to the infrequency of the observable price changes and/or restrictions on the shares.\nThe securities classified as Level 3 and carried at fair value on a recurring basis in the preceding tables are investments in HIVE, which were warrants and convertible debentures valued at $7.3 million and $11.1 million at June 30, 2023, and 2022, respectively. The Company utilizes an independent third-party to estimate the fair values of the investments in HIVE.\nThe following table is a reconciliation of investments recorded at fair value for which unobservable inputs (Level 3) were used in determining fair value during the year ended June 30, 2023:\nChanges in Level 3 Assets Measured at Fair Value on a Recurring Basis\nYear Ended June 30, 2023\nInvestments in\nInvestments in\n(dollars in thousands)\nequity securities\ndebt securities\nBeginning Balance\n$ 515 $ 10,625\nPrincipal repayments\n- (3,000 )\nAmortization of day one premium\n- (251 )\nAccretion of bifurcation discount\n- 740\nTotal unrealized gains (losses) included in:\nNet Investment Income (Loss)\n(225 ) 1,775\nOther Comprehensive Loss\n- (2,881 )\nEnding Balance\n$ 290 $ 7,008\nIn January 2021, the Company purchased convertible securities of HIVE, a company that is headquartered in Canada with cryptocurrency mining facilities in Iceland, Sweden, and Canada, for $15.0 million. The convertible securities are comprised of 8.0% interest-bearing unsecured convertible debentures, payable in quarterly installments with a final maturity in January 2026, and 5 million common share purchase warrants in the capital of HIVE. Under the original terms, the principal amount of each debenture was convertible into common shares in the capital of HIVE at a conversion rate of $2.34. Each whole warrant, expiring in January 2024, entitled the Company to acquire one common share at a price of $3.00 (Canadian). Under the current terms, which reflect a reverse stock split, the principal amount of each debenture is convertible into common shares in the capital of HIVE at a conversion rate of $11.70. The remaining principal amount is $7.6 million as of June 30, 2023. Each five whole warrants, expiring in January 2024, entitles the Company to acquire one common share at a price of $15.00 (Canadian). Cryptocurrency markets and related securities have been, and are expected to continue to be, volatile. There has been significant volatility in the market price of HIVE, which has materially impacted the value of the investments included on the Consolidated Balance Sheets, unrealized gain recognized in net investment income (loss), and unrealized gain recognized in other comprehensive income (loss). The investments did not represent ownership in HIVE as of June 30, 2023. The securities are subject to Canadian securities regulations. Frank Holmes serves on the board as executive chairman of HIVE and held shares and options at June 30, 2023. From August 31, 2018, through January 2023, Mr. Holmes was Interim CEO of HIVE.\nThe Company recorded the warrants at the estimated fair value of $5.9 million on the purchase date. The debentures were recorded at the estimated fair value of $16.0 million on purchase date, and an unrealized gain of $6.9 million was recognized in other comprehensive income (loss), which will be realized in net investment income (loss) ratably using the effective interest method until maturity, conversion, or other disposition. The fair value of the warrants and debentures was $290,000 and $7.0 million, respectively, at June 30, 2023, and $515,000 and $10.6 million, respectively, at June 30, 2022.\nThe Company currently considers the related fair value measurements to contain Level 3 inputs. The following is quantitative information as of June 30, 2023, with respect to the securities measured and carried at fair value on a recurring basis with the use of significant unobservable inputs (Level 3):\nJune 30, 2023\n(dollars in thousands)\nFair Value\nPrincipal Valuation Techniques\nUnobservable Inputs\nInvestments in equity securities:\nCommon share purchase warrants\n$ 290 Option pricing model\nVolatility\n100.0 %\nRisk-Free Rate\n5.0 %\nInvestments in debt securities:\nAvailable-for-sale - Convertible debentures\n$ 7,008 Binomial lattice model\nVolatility\n100.0 %\nCredit Spread\n11.5 %\nRisk-Free Rate\n4.2 %\nEquity Investments at Fair Value\nInvestments in equity securities with readily determinable fair values are carried at fair value, and changes in unrealized gains or losses are reported in the current period earnings.\nThe following details the components of the Companys equity investments carried at fair value as of June 30, 2023, and 2022.\nJune 30, 2023\n(dollars in thousands)\nCost\nUnrealized Gains (Losses)\nFair Value\nEquity securities at fair value\nEquities - International\n$ 6,679 $ (5,901 ) $ 778\nEquities - Domestic\n45 (45 ) -\nMutual funds - Fixed income\n11,947 (305 ) 11,642\nMutual funds - Global equity\n930 (145 ) 785\nTotal equity securities at fair value\n$ 19,601 $ (6,396 ) $ 13,205\nJune 30, 2022\n(dollars in thousands)\nCost\nUnrealized Gains (Losses)\nFair Value\nEquity securities at fair value\nEquities - International\n$ 6,680 $ (5,141 ) $ 1,539\nEquities - Domestic\n45 (45 ) -\nMutual funds - Fixed income\n12,313 (175 ) 12,138\nMutual funds - Global equity\n929 (306 ) 623\nTotal equity securities at fair value\n$ 19,967 $ (5,667 ) $ 14,300\nDebt Investments\nInvestments in debt securities are classified on the acquisition dates and at each balance sheet date. Securities classified as held-to-maturity are carried at amortized cost, reflecting the ability and intent to hold the securities to maturity. Debt securities classified as trading are acquired with the intent to sell in the near term and are carried at fair value with changes reported in earnings. All other debt securities are classified as available-for-sale and are carried at fair value.\nInvestment gains and losses on available-for-sale debt securities are recorded when the securities are sold, as determined on a specific identification basis, and recognized in current period earnings. Changes in unrealized gains are reported net of tax in accumulated other comprehensive income (loss). For debt securities in an unrealized loss position, a loss in earnings is recognized for the excess of amortized cost over fair value if the Company intends to sell before the price recovers. Otherwise, the Company evaluates as of the balance sheet date whether the unrealized losses are attributable to credit losses or other factors. The severity of the decline in value, creditworthiness of the issuer and other relevant factors are considered. The portion of unrealized loss the Company believes is related to a credit loss is recognized in earnings, and the portion of unrealized loss the Company believes is not related to a credit loss is recognized in other comprehensive income.\nThe following details the components of the Companys available-for-sale debt investments at June 30, 2023, and 2022.\nJune 30, 2023\n(dollars in thousands)\nAmortized Cost\nGross Unrealized Gains in Other Comprehensive Income (Loss)\nGross Unrealized Losses in Net Investment Income (Loss)\nFair Value\nAvailable-for-sale - Convertible debentures 1\n$ 7,729 $ 1,707 $ (2,428 ) $ 7,008\nJune 30, 2022\n(dollars in thousands)\nAmortized Cost\nGross Unrealized Gains in Other Comprehensive Income (Loss)\nGross Unrealized Losses in Net Investment Income (Loss)\nFair Value\nAvailable-for-sale - Convertible debentures 1\n$ 8,576 $ 4,588 $ (2,539 ) $ 10,625\n1. Changes in unrealized gains and losses are included in the Consolidated Statements of Comprehensive Income, except for embedded derivatives. Changes in unrealized and realized gains and losses for embedded derivatives are included in net investment income (loss) in the Consolidated Statements of Operations.\nThe following details the components of the Companys held-to-maturity debt investments at June 30, 2023, and 2022.\nJune 30, 2023\n(dollars in thousands)\nAmortized Cost\nGross Unrecognized Holding Gains\nGross Unrecognized Holding Losses\nFair Value\nHeld-to-maturity - Debentures 1\n$ 1,000 $ - $ (232 ) $ 768\nJune 30, 2022\n(dollars in thousands)\nAmortized Cost\nGross Unrecognized Holding Gains\nGross Unrecognized Holding Losses\nFair Value\nHeld-to-maturity - Debentures 1\n$ 1,000 $ - $ (133 ) $ 867\n1. Held-to-maturity debt instruments are carried at amortized cost, and the fair value is classified as Level 2 according to the fair value hierarchy.\nAt June 30, 2023, and 2022, the Company held $1.0 million in one security classified as held-to-maturity. The security had an estimated fair value that was lower than the carrying value by $232,000 at June 30, 2023, and has been in continuous unrealized loss position for longer than 12 months. We have evaluated the unrealized loss on the security at June 30, 2023, and determined it to be of a temporary nature and caused by fluctuations in market interest rates, not by concerns about the ability of the issuer to meet their obligations.\nThe following summarizes the net carrying amount and estimated fair value of debt securities at June 30, 2023, by contractual maturity dates. Actual maturities may differ from final contractual maturities due to principal repayment installments or prepayment rights held by issuers.\nJune 30, 2023\nAvailable-for-sale\nHeld-to-maturity\ndebt securities\ndebt securities\nConvertible\nDue after one year\n(dollars in thousands)\ndebentures 1\nthrough five years\nAmortized Cost\n$ 7,729 $ 1,000\nFair Value\n$ 7,008 $ 768\n1. Principal payments of $750,000 are due quarterly with a final maturity in January 2026.\nCertain derivatives embedded in other financial instruments, such as the conversion option in a convertible bond, are reported at fair value, and changes in fair value are recorded through earnings within net investment income (loss). The host contract continues to be accounted for in accordance with the appropriate accounting standard. The embedded derivative and the related host contract represent one legal contract and are combined on the Consolidated Balance Sheets and the tables reflected above. The Company held one financial instrument containing an embedded derivative, which represents an investment in HIVE, at June 30, 2023, and 2022.\nThe following table summarizes the fair values of embedded derivatives on the Consolidated Balance Sheets, categorized by risk exposure, at June 30, 2023, and 2022.\nJune 30, 2023\nJune 30, 2022\nOther Assets\nOther Assets\n(dollars in thousands)\nInvestments in available-for-sale debt securities\nInvestments in available-for-sale debt securities\nEmbedded Derivatives:\nEquity price risk exposure\n$ 114 $ 3\nThe following table presents the effect of embedded derivatives on the Consolidated Statements of Operations, categorized by risk exposure, for the years ended June 30, 2023, and 2022.\nYear Ended June 30,\nOther Income (Loss)\nOther Income (Loss)\n(dollars in thousands)\nNet Investment Income (Loss)\nNet Investment Income (Loss)\nEmbedded Derivatives:\nEquity price risk exposure\n$ 111 $ (2,539 )\nOther Investments\nOther investments consist of equity investments in entities over which the Company is unable to exercise significant influence and which do not have readily determinable fair values. For these securities, the Company generally elects to value using the measurement alternative, under which such securities are measured at cost, less impairment, if any. If the Company identifies observable price changes for identical or similar securities of the same issuer, the equity security is measured at fair value as of the date the observable transaction occurred, with such changes recorded in net investment income (loss).\nThe following table presents the carrying value of equity securities without readily determinable fair values held as of June 30, 2023, and 2022, that are measured under the measurement alternative, and the related adjustments recorded during the periods presented for those securities with observable price changes or impairments. These securities are included in the nonrecurring fair value hierarchy tables when applicable price changes are observable, or when impairments occur.\nYear Ended June 30,\n(dollars in thousands)\nOther Investments\nCarrying value\n$ 2,388 $ 3,992\nUpward carrying value changes\n$ 14 $ 187\nDownward carrying value changes/impairments\n$ (2,280 ) $ (13 )\nThe period-end carrying values reflect cumulative purchases and sales in addition to upward and downward carrying value changes. The cumulative amount of upward adjustments to all equity securities without readily determinable fair values total $2.5 million since their respective acquisitions through June 30, 2023. The cumulative amount of impairments and other downward adjustments, which include return of capital distributions and observable price changes, to all equity securities without readily determinable fair values total $3.8 million since their respective acquisitions through June 30, 2023.\nThe Company has an investment in The Sonar Company (Sonar), a company headquartered in the United States, at a cost of $175,000. The investment had a carrying value of approximately $362,000 at June 30, 2023, and 2022. During the year ended June 30, 2022, the Company purchased additional common shares, resulting in an observable price change and upward adjustment for the existing common shares held of approximately $187,000, using the measurement alternative. Roy D. Terracina, Director and Vice Chairman of the Board of Directors for U.S. Global, has served as the CEO of Sonar since July 2021, and the Companys ownership of Sonar was approximately 2.8 percent as of June 30, 2023.\nInvestments Classified as Equity Method\nThe Company had an equity method investment in Galileo New Economy Fund LP (previously known as Galileo Technology and Blockchain LP), a Canadian limited partnership, through its dissolution date, which occurred during the third quarter of fiscal 2022. The Company owned approximately 22 percent of the LP prior to dissolution, and the Company was considered to have the ability to exercise significant influence. Thus, the investment was accounted for under the equity method of accounting. Included in other income (loss) for the year ended June 30, 2022, is $206,000 of equity method loss for this investment. Upon dissolution, the Company received a distribution, which included cash of $85,000, and common shares of an investment held in the LP, which had a fair value of approximately $228,000 when received. Frank Holmes also directly held an investment in the LP and received dissolution proceeds related to his direct investment.\nNet Investment Income (Loss)\nThe following summarizes net investment income (loss) reflected in earnings for the periods presented.\nYear Ended June 30,\n(dollars in thousands)\n2023 2022\nNet Investment Income (Loss)\nRealized gains (losses) on equity securities\n$ (453 ) $ 1,848\nRealized gains on debt securities\n1,664 2,191\nUnrealized losses on equity securities\n(2,563 ) (9,375 )\nUnrealized gains (losses) on embedded derivatives\n111 (2,539 )\nUnrealized losses on cash equivalents\n(5 ) -\nDividend and interest income\n1,798 1,949\nForeign currency losses, net\n(236 ) (248 )\nTotal Net Investment Income (Loss)\n$ 316 $ (6,174 )\nDuring the years ended June 30, 2023, and 2022, realized gains on debt securities in the amount of $1.7 million and $2.2 million, respectively, were reclassified from other comprehensive income (loss) related to the Company's investment in HIVE debentures. Realized foreign currency gains (losses) for the year ended June 30, 2022, includes $10,000 in foreign currency gains reclassified from other comprehensive income (loss) upon the dissolution of the Galileo New Economy Fund LP, the Company's equity method investment.\nThe following table presents unrealized gains and losses recognized during the years ended June 30, 2023, and 2022, on equity investments still held at each respective date.\nYear Ended June 30,\n(dollars in thousands)\n2023 2022\nNet gains and losses recognized during the period on equity securities\n$ (3,016 ) $ (7,527 )\nLess: Net gains and losses recognized during the period on equity securities sold during the period\n(13 ) 178\nUnrealized gains and losses recognized during the reporting period on equity securities still held at the reporting date 1\n$ (3,003 ) $ (7,705 )\n1. Included $2.3 million for the fiscal year ended June 30, 2023, of net losses as a result of the measurement alternative. There were net gains of $187,000 as a result of the measurement alternative for the year ended June 30, 2022.\nNet investment income (loss) can be volatile and varies depending on market fluctuations.\nNOTE 5. INVESTMENT MANAGEMENT AND OTHER FEES\nThe following table presents operating revenues disaggregated by performance obligation:\nYear Ended June 30,\n(dollars in thousands)\nETF advisory fees\n$ 13,174 $ 20,962\nUSGIF advisory fees\n2,256 3,543\nUSGIF performance fees earned (paid)\n(490 ) 20\nTotal Advisory Fees\n14,940 24,525\nUSGIF administrative services fees\n134 189\nTotal Operating Revenue\n$ 15,074 $ 24,714\nThe Company serves as investment adviser to USGIF and receives a fee based on a specified percentage of net assets under management. The advisory agreement for the equity funds within USGIF provides for a base advisory fee that is adjusted upwards or downwards by 0.25 percent if there is a performance difference of 5 percent or more between a funds performance and that of its designated benchmark index over the prior rolling 12 months.\nThe Company has agreed to contractually limit the expenses of the Near-Term Tax Free Fund and the Global Luxury Goods Fund through April 2024. The Company has voluntarily waived or reduced its fees and/or agreed to pay expenses on the remaining USGIF funds. These caps will continue on a voluntary basis at the Companys discretion. The aggregate fees waived, and expenses borne by the Company for USGIF were $1.1 million and $667,000 for the years ended June 30, 2023, and 2022, respectively. USGIF revenue included on the Consolidated Statements of Operations is net of fee waivers. Management cannot predict the impact of future waivers due to the number of variables and the range of potential outcomes.\nThe Company receives administrative service fees from USGIF based on an annual rate of 0.05 percent of average daily net assets of each fund.\nThe Company serves as investment advisor to three U.S.-based exchange-traded funds (ETFs): U.S. Global Jets ETF (ticker JETS), U.S. Global GO GOLD and Precious Metal Miners ETF (ticker GOAU), and U.S. Global Sea to Sky Cargo ETF (ticker SEA). The Company receives a unitary management fee of 0.60 percent of average net assets of the ETFs, and has agreed to bear all expenses of the ETFs, except the U.S. Global Sea to Sky Cargo ETF (\"SEA\"). The Company has agreed to contractually limit the expenses of SEA through April 2024. The aggregate fees waived, and expenses borne by the Company for SEA were $105,000 and $69,000 for the years ended June 30, 2023, and 2022, respectively. The Company also serves as investment advisor to one European-based ETF, the U.S. Global Jets UCITS ETF. The Company receives a unitary management fee of 0.65 percent of average net assets and has agreed to bear all expenses of the ETF.\nAs of June 30, 2023, the Company had $1.1 million in receivables from fund clients, of which $126,000 was from USGIF and $1.0 million from ETFs. As of June 30, 2022, the Company had $1.6 million in receivables from fund clients, of which $188,000 was from USGIF and $1.4 million from ETFs.\nNOTE 6. RESTRICTED AND UNRESTRICTED CASH\nThe Company maintains its cash deposits with established commercial banks. At times, balances may exceed federally insured limits. We have not experienced any losses in such accounts and do not believe that we are exposed to any significant credit risk associated with our cash deposits. Restricted cash represents cash invested in a money market account as collateral for credit facilities that is not available for general corporate use.\nA reconciliation of cash, cash equivalents, and restricted cash reported from the Consolidated Balance Sheets to the Statements of Cash Flows is shown below:\nJune 30,\n(dollars in thousands)\nCash and cash equivalents\n$ 25,401 $ 22,314\nRestricted cash\n1,000 1,000\nTotal cash, cash equivalents, and restricted cash\n$ 26,401 $ 23,314\nNOTE 7. PROPERTY AND EQUIPMENT\nProperty and equipment are composed of the following:\nJune 30,\n(dollars in thousands)\nBuilding and land\n$ 4,616 $ 4,606\nFurniture, equipment, and other\n981 987\n5,597 5,593\nAccumulated depreciation\n(4,459 ) (4,223 )\nNet property and equipment\n$ 1,138 $ 1,370\nDepreciation expense totaled $243,000 and $226,000 in fiscal years 2023 and 2022, respectively.\nNOTE 8. LEASES\nThe Company has lease agreements for office equipment that expire in the fiscal year 2026. Lease expense included in operating expenses on the Consolidated Statements of Operations totaled $123,000 and $168,000 for the years ended June 30, 2023, and 2022, respectively.\nThe following table presents the components of lease cost.\nYear Ended June 30,\n(dollars in thousands)\nFinance lease cost:\nAmortization of right-of-use assets\n$ 29 $ -\nInterest on lease liabilities\n4 -\nTotal finance lease cost\n33 -\nOperating lease cost\n- 44\nShort-term lease cost\n90 124\nTotal lease cost\n$ 123 $ 168\nSupplemental information related to the Company's leases follows.\nYear Ended June 30,\n(dollars in thousands)\nOperating cash flows from operating leases included in lease liabilities\n$ - $ 44\nLease liabilities obtained from new ROU assets - operating\n$ - $ -\nOperating cash flows from financing leases included in lease liabilities\n$ 4 $ -\nFinancing cash flows from financing leases included in lease liabilities\n$ 27 $ -\nLease liabilities obtained from new ROU assets - financing\n$ - $ 93\nAdditional qualitative information concerning the Company's leases follows.\nJune 30,\nWeighted-average remaining lease term - operating leases (years)\n- -\nWeighted-average discount rate - operating leases\n- -\nWeighted-average remaining lease term - financing leases (years)\n2.25 3.25\nWeighted-average discount rate - financing leases\n4.75 % 4.75 %\nThe following table presents the maturities of lease liabilities as of June 30, 2023.\n(dollars in thousands)\nFiscal Year\nFinance Leases\n$ 31\n-\n-\nTotal lease payments\nLess imputed interest\n(4 )\nTotal\n$ 66\nThe Company is the lessor of certain areas of its owned office building under operating leases expiring in various years through fiscal year 2025. At the commencement of an operation lease, no income is recognized; subsequently, lease payments received are recognized on a straight-line basis. Lease income included in other income on the Consolidated Statements of Operations was $125,000 and $115,000 for fiscal years 2023 and 2022, respectively. The cost of obtaining lessor contracts, which is included in other assets on the Consolidated Balance Sheets, was $4,000 and $9,000 at June 30, 2023, and 2022, respectively.\nA summary analysis of annual undiscounted cash flows to be received on leases as of June 30, 2023, is as follows:\n(dollars in thousands)\nFiscal Year\nOperating Leases\n$ 42\nTotal lease payments\n$ 78\nThe Company may terminate the building leases with one hundred eighty days written notice if it sells the property. If the Company terminates the lease, the Company will pay the tenant a termination fee of the lesser of six months of the base monthly rent or the base monthly rent times the number of months remaining in the initial term.\nNOTE 9. OTHER ACCRUED EXPENSES\nOther accrued expenses consist of the following:\nJune 30,\n(dollars in thousands)\nProfessional fees\n$ 697 $ 889\nVendors payable\n157 460\nETF operating and distribution expenses\n344 385\nOther taxes payable\n76 97\nOther accrued expenses\n$ 1,274 $ 1,831\nNOTE 10. DEBT\nThe Company has access to a $1.0 million credit facility for working capital purposes. The credit agreement requires the Company to maintain certain covenants; the Company has been in compliance with these covenants during the fiscal years ended June 30, 2023, and 2022. The credit agreement will expire on May 31, 2024, and the Company intends to renew it annually. The credit facility is collateralized by approximately $1.0 million at June 30, 2023, included in restricted cash on the Consolidated Balance Sheets, held in deposit in a money market account at the financial institution that provided the credit facility. As of June 30, 2023, the credit facility remains unutilized by the Company.\nNOTE 11. BENEFIT PLANS\nThe Company offers a savings and investment plan qualified under Section 401(k) of the Internal Revenue Code covering substantially all employees. In connection with the 401(k) plan, participants can voluntarily contribute a portion of their compensation, up to certain limitations, to this plan, and the Company will match 100 percent of participants contributions up to the first 3 percent of compensation and 50 percent of the next 2 percent of compensation. The Company recorded expenses for contributions to the 401(k) plan of $109,000 and $111,000 for fiscal years 2023 and 2022, respectively.\nThe 401(k) plan allows for a discretionary profit-sharing contribution by the Company, as authorized by the Board of Directors. The Company made a profit-sharing contribution of $200,000 in fiscal years 2023 and 2022.\nThe Company offers employees, including its executive officers, an opportunity to participate in savings programs using mutual funds managed by the Company. Employees may contribute to an IRA, and the Company matches these contributions on a limited basis. A similar savings plan utilizing Uniform Gifts to Minors Act (UGMA) accounts is offered to employees to save for their minor relatives. The Company match, reflected in base salary expense, aggregated in all programs to $12,000 and $14,000 in fiscal years 2023 and 2022, respectively.\nThe Company has an Employee Stock Purchase Plan whereby eligible employees can purchase treasury shares at market price. During fiscal years 2023 and 2022, employees purchased 19,981 and 10,191, respectively, shares of treasury stock from the Company. The Company matches these contributions on a limited basis. The Company match, reflected in base salary expense, was $42,000 and $38,000 in fiscal years 2023, and 2022, respectively.\nNOTE 12. SHAREHOLDERS EQUITY\nThe Company has three classes of common equity: class A, class B, and class C common stock. The Companys class A common stock is traded over-the-counter and is quoted daily under NASDAQs Capital Markets under the symbol GROW. There is no established public trading market for the Companys class B and class C common stock. There are no shares of class B stock issued as of June 30, 2023, or 2022.\nThe shareholders of class C common stock have voting rights, and the shareholders of class A and class B common stock have no voting rights. Shareholders of class C common stock are allowed to convert to class A common stock. During fiscal year 2023, no shares were converted from class C to class A. During fiscal year 2022, 86 shares were converted from class C to class A. Conversions are one class A share for one class C share and are recorded at par value. There are no restrictions or requirements to convert.\nDividends\nDividends totaling $1.1 million were paid to holders of class A common stock in fiscal years 2023 and 2022. Dividends of $186,000 and $171,000 were paid to holders of class C common stock in fiscal years 2023 and 2022, respectively. The dividend rate per share for both classes was $0.0050 per month for July 2021 through September 2021, and $0.0075 per month for October 2021 through June 2023.\nAs of June 30, 2023, the Board has authorized a monthly dividend of $0.0075 per share through September 2023, at which time it will be considered for continuation by the Board. Payment of cash dividends is within the discretion of the Companys Board of Directors and is dependent on earnings, operations, capital requirements, general financial condition of the Company and general business conditions. On a per share basis, the holders of the class C common stock and the nonvoting class A common stock participate equally in dividends as declared by the Companys Board of Directors.\nShare Repurchase Plan\nThe Company has a share repurchase program, approved by the Board of Directors, authorizing the Company to annually purchase up to $5.0 million of its outstanding common shares, as market and business conditions warrant, on the open market in compliance with Rule 10b-18 and Rule 10b5-1 of the Securities Exchange Act of 1934. The repurchase program has been in place since December 2012, and the Board of Directors has annually renewed the repurchase program each calendar year. The Company announced on February 25, 2022, that the Board of Directors of the Company approved an increase to the limit of its annual share buyback program from $2.75 million to $5.0 million. The acquired shares may be used for corporate purposes, including shares issued to employees in the Companys share-based compensation programs. As of June 30, 2023, approximately $4.2 million remains available for repurchase under this authorization.\nDuring fiscal years 2023 and 2022, the Company repurchased 412,257 and 89,287, respectively, of its class A shares on the open market using cash of $1.2 million and $452,000, respectively. To date, the Company has repurchased a total of 1,221,226 class A shares under the repurchase program using cash of $3.4 million.\nIn August 2022, the Inflation Reduction Act (IRA) was signed into law, which made a number of changes to the Internal Revenue Code, including adding a 1% excise tax on stock buybacks by publicly traded corporations. Any excise tax incurred is recognized as part of the cost basis of the shares acquired in the Consolidated Statements of Shareholders' Equity. The impact of these provisions did not have an impact on the Consolidated Financial Statements.\nOther Activity\nAll stock grants vest immediately after issuance. Issuances of treasury stock for grants, bonuses, and the share repurchase plan are accounted for using the weighted-average cost basis of the shares issued. During fiscal years 2023 and 2022, no shares were granted to employees or non-employee directors.\nStock Option Plans\nIn November 1989, the Board of Directors adopted the 1989 Non-Qualified Stock Option Plan (1989 Plan), amended in December 1991, which provides for the granting of options to purchase 1,600,000 shares of the Companys class A common stock to directors, officers and employees of the Company and its subsidiaries. Options issued under the 1989 Plan vest six months from the grant date or 20 percent on the first, second, third, fourth, and fifth anniversaries of the grant date. Options issued under the 1989 Plan expire ten years after issuance. The estimated fair value of options granted is amortized to expense over the options vesting period. There were 231,000 options outstanding and nonvested as of June 30, 2021, which vested during the year ended June 30, 2022, with a weighted-average grant date fair value price of $3.36. During the year ended June 30, 2022, $733,000 was recognized as compensation expense and $154,000 was recognized as a deferred tax asset. As of June 30, 2023, and 2022, there were no unrecognized compensation costs related to nonvested stock options under the Plan.\nThere were 2,000 options forfeited during the year ended June 30, 2023, and no options granted or exercised. There were no options granted, forfeited, or exercised during the year ended June 30, 2022. Under the 1989 Plan, there were 229,000 and 231,000 options outstanding and exercisable as of June 30, 2023, and 2022, respectively, with a weighted-average grant date fair value price of $3.36. The fair value of options granted is estimated at the date of the grant using a Black-Scholes option pricing model.\nThe assumptions utilized to estimate the fair value of options outstanding under the 1989 Plan are presented in the following table:\nRisk-free interest rate\n0.9 %\nExpected volatility\n70.0 %\nExpected life (in years)\n5.25\nExpected dividend yield\n1.0 %\nThe risk-free interest rate is based on a treasury instrument whose term is consistent with the expected life of the stock options. Expected volatility is based on the historical volatility of the Companys common stock. The Company did not have historical post-vesting activity under the 1989 Plan and utilized the simplified method to calculate expected term for stock options granted in fiscal 2021. The simplified method calculates the expected term as mid-point between the weighted-average time to vest and the contractual maturity. The expected dividend yield is based on the date of the grant.\nStock option transactions under the 1989 Plan for the last two fiscal years are summarized below.\nWeighted Average\nWeighted Average Remaining\nAggregate Intrinsic\nExercise\nContractual\nValue\n(dollars in thousands, except price data)\nOptions\nPrice\nLife in Years\n(net of tax)\nOutstanding June 30, 2021\n231,000 6.05\nGranted\n- n/a\nExercised\n- n/a\nForfeited\n- n/a\nOutstanding June 30, 2022\n231,000 $ 6.05\nGranted\n- n/a\nExercised\n- n/a\nForfeited\n(2,000 ) 6.05\nOutstanding June 30, 2023\n229,000 $ 6.05 7.98 $ -\nIn April 1997, the Board of Directors adopted the 1997 Non-Qualified Stock Option Plan (1997 Plan), which provides for the granting of stock appreciation rights (SARs) and/or options to purchase 400,000 shares of the Companys class A common stock to directors, officers, and employees of the Company and its subsidiaries. Options issued under the 1997 Plan expire ten years after issuance. There were no options granted, exercised, or forfeited during the years ended June 30, 2023, or 2022. There were 2,000 options outstanding and exercisable under the 1997 Plan as of June 30, 2023, and 2022.\nThe estimated fair value of options granted is amortized to expense over the options vesting period. The fair value of these options is estimated at the date of the grant using a Black-Scholes option pricing model.\nStock option transactions under the 1997 Plan for the past two fiscal years are summarized below:\nWeighted Average\nWeighted Average Remaining\nAggregate Intrinsic\nExercise\nContractual\nValue\n(dollars in thousands, except price data)\nOptions\nPrice\nLife in Years\n(net of tax)\nOutstanding June 30, 2021\n2,000 $ 2.74\nGranted\n- n/a\nExercised\n- n/a\nForfeited\n- n/a\nOutstanding June 30, 2022\n2,000 $ 2.74\nGranted\n- n/a\nExercised\n- n/a\nForfeited\n- n/a\nOutstanding June 30, 2023\n2,000 $ 2.74 4.72 $ 1.00\nNOTE 13. INCOME TAXES\nThe Company and its non-Canadian subsidiaries file a consolidated U.S. federal income tax return. USCAN files a separate tax return in Canada. The Company's components of income (loss) before tax by jurisdiction are as follows:\nYear ended June 30,\n(dollars in thousands)\nUnited States\n$ 4,114 $ 5,493\nCanada\n(31 ) (525 )\nTotal\n$ 4,083 $ 4,968\nThe reconciliation of income tax computed at U.S. federal statutory rates to income tax expense is as follows:\nYear ended June 30,\n% of\n% of\n(dollars in thousands)\nPretax\nPretax\nTax expense at statutory rate\n$ 857 21.0 % $ 1,042 21.0 %\nState and local income taxes, net of federal tax benefit\n131 3.2 % 406 8.2 %\nTax expense (benefit) from change in foreign unrealized gain/loss\n6 0.1 % (281 ) (5.7 )%\nNon-taxable investment income (loss)\n(33 ) (0.8 )% 294 5.9 %\nIncome from controlled foreign corporation\n7 0.2 % 307 6.2 %\nRate difference on foreign deferred income (loss)\n18 0.4 % (262 ) (5.3 )%\nForeign tax credit\n- 0.0 % (153 ) (3.1 )%\nOther\n(52 ) (1.2 )% 175 3.6 %\nTotal tax expense\n$ 934 22.9 % $ 1,528 30.8 %\nComponents of total tax expense (benefit) are as follows:\nYear ended June 30,\n(dollars in thousands)\nCurrent tax expense - U.S.\n$ 1,245 $ 3,859\nCurrent tax expense - State U.S.\n131 406\nCurrent tax expense (benefit) - Non-U.S.\n(2 ) 154\nDeferred tax benefit - U.S.\n(442 ) (2,657 )\nDeferred tax expense (benefit) - Non-U.S.\n2 (234 )\nTotal tax expense\n$ 934 $ 1,528\nComponents of the Companys deferred assets and liabilities are as follows:\nJune 30,\n(dollars in thousands)\nDeferred Income Tax Assets:\nAccumulated depreciation\n$ 117 $ 102\nInvestments in securities at fair value\n1,604 837\nAccrued expenses\n218 407\nProduct start-up costs\n99 99\nShare-based compensation expense\n162 164\nOther\n40 16\nNet operating loss carryover\n24 -\nSubtotal Deferred Tax Assets\n2,264 1,625\nValuation Allowance\n(24 ) -\nTotal Deferred Tax Assets\n2,240 1,625\nDeferred Income Tax Liabilities:\nInvestments in securities at fair value\n$ (4 ) $ -\nPrepaid expenses\n(77 ) (64 )\nOther investments\n- (430 )\nForeign tax on undistributed earnings\n(243 ) (259 )\nTotal Deferred Tax Liabilities\n(324 ) (753 )\nNet Deferred Tax Asset\n$ 1,916 $ 872\nCarryovers\nFor U.S. federal income tax purposes at June 30, 2023, the Company has no U.S. federal net operating loss carryovers and no capital loss carryovers. For Canadian income tax purposes, USCAN has $91,000 of net operating loss carryovers expiring in fiscal year 2043 and no capital loss carryovers.\nAdditional Disclosures\nA valuation allowance is provided when it is more likely than not that some portion of the deferred tax amount will not be realized. At June 30, 2023, a valuation allowance of $24,000 was included to fully reserve for net operating loss carryovers. There was no valuation allowance included at June 30, 2022.\nUncertain income tax positions\nThe Company is subject to U.S. federal income tax, state tax jurisdictions within the U.S., and taxes in Canada. The Company maintains a reserve for uncertain tax positions. As of June 30, 2023, and June 30, 2022, the total reserve for uncertain tax positions, including interest and penalties, and net of federal benefits, was $496,000 and $379,000, respectively, which is included within long-term liabilities on the Consolidated Balance Sheets.\nThe reserve as of June 30, 2023, relates to the Companys uncertain tax positions for income tax matters. The Company believes the reserve for uncertain tax positions, including interest and penalties, and net of federal benefits, of $496,000 as of June 30, 2023, adequately covers open tax years and uncertain tax positions up to and including fiscal 2023 for major taxing jurisdictions. As of June 30, 2023, the entire $496,000 of unrecognized tax benefits, including interest and penalties and net of federal benefit, if recognized, would impact the Companys effective income tax rate.\nThe Company's activity was as follows:\nYear ended June 30,\n(dollars in thousands)\nBeginning Balance\n$ 379 $ -\nIncreases related to current year tax positions\n117 379\nEnding Balance\n$ 496 $ 379\nThe Company continues to follow its policy of recognizing interest and penalties accrued on tax positions as a component of income taxes on the Consolidated Statements of Operations. The amount of accrued interest and penalties associated with the Companys tax positions was $166,000 and $86,000 as of June 30, 2023, and June 30, 2022, respectively. The tax years from 2019 through 2022 remain open to examination by the U.S. Federal tax jurisdictions to which the Company is subject. The tax years from 2016 through 2022 remain open to examination by the non-U.S. Federal tax jurisdictions to which the Company is subject. For jurisdictions with unfiled tax returns, the statutes of limitations remain open indefinitely.\nNOTE 14. EARNINGS PER SHARE\nThe following table sets forth the computation for basic and diluted earnings per share (EPS):\nYear Ended June 30,\n2023 2022\n(dollars in thousands, except per share data)\nNet Income\n$ 3,149 $ 3,440\nWeighted average number of outstanding shares\nBasic\n14,638,833 15,010,138\nEffect of dilutive securities:\nStock options\n236 990\nDiluted\n14,639,069 15,011,128\nEarnings Per Share\nBasic Net Income per Share\n$ 0.22 $ 0.23\nDiluted Net Income per Share\n$ 0.22 $ 0.23\nThe diluted EPS calculation excludes the effect of stock options when their exercise prices exceed the average market price for the period. For the years ended June 30, 2023, and 2022, 229,000 and 231,000 employee stock options were excluded from diluted EPS.\nDuring fiscal years 2023 and 2022, the Company repurchased class A shares on the open market. Repurchased shares are classified as treasury shares and are deducted from outstanding shares in the earnings per share calculation.\nNOTE 15. ACCUMULATED OTHER COMPREHENSIVE INCOME (LOSS)\nThe following table presents changes in accumulated other comprehensive income (loss) by component:\n(dollars in thousands)\nUnrealized gains (losses) on available-for-sale investments\nForeign currency translation adjustment 1\nTotal\nBalance at June 30, 2021\n$ 6,564 $ 23 $ 6,587\nOther comprehensive loss before reclassifications\n(1,529 ) (13 ) (1,542 )\nTax effect\n320 - 320\nAmount reclassified from AOCI\n(2,191 ) (10 ) (2,201 )\nTax effect\n460 - 460\nNet other comprehensive loss for 2022\n(2,940 ) (23 ) (2,963 )\nBalance at June 30, 2022\n3,624 - 3,624\nOther comprehensive loss before reclassifications\n(1,217 ) - (1,217 )\nTax effect\n256 - 256\nAmount reclassified from AOCI\n(1,664 ) - (1,664 )\nTax effect\n349 - 349\nNet other comprehensive loss for 2023\n(2,276 ) - (2,276 )\nBalance at June 30, 2023\n$ 1,348 $ - $ 1,348\n1.\nAmounts include no tax expense or benefit.\nNOTE 16. FINANCIAL INFORMATION BY BUSINESS SEGMENT\nThe Company manages the following business segments:\n1.\nInvestment management services, by which the Company offers, to USGIF and ETF clients, a range of investment management products and services to meet the needs of individual and institutional investors; and\n2.\nCorporate investments, through which the Company invests for its own account in an effort to add growth and value to its cash position\nThese segments are managed separately. The Companys segment information is prepared on the same basis that management uses to review the financial information for operational and investment decision-making purposes. The Company's chief operating and investment decision maker, the Chief Executive Officer, evaluates the performance of the Companys Corporate Investments segment separately from the Investment Management Services segment based on net investment income (loss), and the Corporate Investments segment does not include any allocated company expenses. All segment accounting policies are the same as those described in the summary of significant accounting policies.\nThe following schedule details total revenues and income by business segment:\nInvestment\nManagement\nCorporate\n(dollars in thousands)\nServices\nInvestments\nConsolidated\nYear Ended June 30, 2023\nNet operating revenues\n$ 15,074 $ - $ 15,074\nNet investment income\n$ - $ 316 $ 316\nOther income\n$ 242 $ - $ 242\nIncome before income taxes\n$ 3,868 $ 215 $ 4,083\nDepreciation\n$ 243 $ - $ 243\nGross identifiable assets at June 30, 2023\n$ 25,918 $ 27,835 $ 53,753\nDeferred tax asset\n$ 1,920\nConsolidated total assets at June 30, 2023\n$ 55,673\nYear Ended June 30, 2022\nNet operating revenues\n$ 24,714 $ - $ 24,714\nNet investment loss\n$ - $ (6,174 ) $ (6,174 )\nLoss from equity method investments\n$ - $ (206 ) $ (206 )\nOther income\n$ 235 $ - $ 235\nIncome (loss) before income taxes\n$ 11,622 $ (6,654 ) $ 4,968\nDepreciation\n$ 226 $ - $ 226\nGross identifiable assets at June 30, 2022\n$ 23,003 $ 34,487 $ 57,490\nDeferred tax asset\n$ 872\nConsolidated total assets at June 30, 2022\n$ 58,362\nNet operating revenues from investment management services include revenues from USGIF of $1.9 million and $3.8 million in fiscal years 2023 and 2022, respectively. Net operating revenues from investment management services also include operating revenues from ETF clients of $13.2 million and $21.0 million in fiscal years 2023 and 2022, respectively.\nNOTE 17. RELATED PARTY TRANSACTIONS\nOn June 30, 2023, and 2022, the Company had $12.4 million and $12.8 million, respectively, at fair value invested in USGIF funds the Company advised. These amounts were included in the Consolidated Balance Sheets as investments in equity securities at fair value. During the year ended June 30, 2023, the Company redeemed an investment for $350,000, and during the year ended June 30, 2022, the Company made an additional investment for $6.0 million. The Company recorded $267,000 and $146,000 in income from capital gain distributions and dividends from USGIF investments in fiscal years 2023 and 2022, respectively. There was $13,000 of net realized losses on its investments in the Funds in fiscal year 2023. There were no net realized gains or losses on its investments in the Funds in fiscal year 2022.\nThe Company earned advisory and administrative services fees, as applicable, from the various funds for which it acts as investment adviser, as disclosed in Note 5. Receivables include amounts due from the funds for those fees and out-of-pocket expenses, net of amounts payable to the funds for expense reimbursements. As of June 30, 2023, and 2022, the Company had $1.1 million and $1.6 million, respectively, of receivables from funds included in the Consolidated Balance Sheets within receivables. As of June 30, 2022, the Company had $110,000 of payables to funds included in the Consolidated Balance Sheets within other accrued expenses.\nThe Company has various investments in HIVE that were valued at approximately $7.3 million and $11.1 million and as of June 30, 2023, and 2022, respectively. As discussed in Note 4, in January 2021, the Company purchased convertible securities in HIVE, and an unrealized gain was recognized in other comprehensive income (loss) for the convertible debentures, which is to be realized in net investment income (loss) ratably using the effective interest method until maturity, conversion, or other disposition. During the fiscal year ended June 30, 2023, and 2022, $3.0 million in principal payments were received, and $1.7 million and $2.2 million, respectively, was included in net investment income (loss) as realized gains on debt securities. The Company recorded $1.2 million and $1.6 million in interest income from HIVE investments during the fiscal year ended June 30, 2023, and 2022, respectively. The Company earned other income from HIVE for consulting fees in the amount of $120,000 during each of the fiscal year ended June 30, 2023, and 2022. The Company had $43,000 and $140,000 of receivables from HIVE included in the Consolidated Balance Sheets within receivables as of June 30, 2023, and 2022, respectively. Frank Holmes, a director and Chief Executive Officer of the Company, is the executive chairman of HIVE, for which he received director fees from HIVE during fiscal years 2023 and 2022. Mr. Holmes held shares and options of HIVE at June 30, 2023, and 2022. From August 2018 through January 2023, Mr. Holmes was Interim CEO of HIVE.\nAs discussed in Note 4, the Company has an investment in Sonar that had a carrying value of approximately $362,000 at June 30, 2023, and 2022. During the year ended June 30, 2022, the Company purchased common shares for $75,000, resulting in an observable price change and upward adjustment for the existing common shares held of approximately $187,000, using the measurement alternative. The Company earned lease income from Sonar in the amount of $16,000 and $15,000 during the fiscal years ended June 30, 2023, and 2022, respectively. Roy D. Terracina, Director and Vice Chairman of the Board of Directors for U.S. Global, has served as the CEO of Sonar since July 2021.\nNOTE 18. COMMITMENTS AND CONTINGENCIES\nThe Company continuously reviews all investor, employee, and vendor complaints, tax claims, and pending or threatened litigation. The likelihood that a loss contingency exists is evaluated through consultation with legal counsel, and a loss contingency is recorded if probable and reasonably estimable.\nDuring the normal course of business, the Company may be subject to various claims, legal proceedings, and other contingencies. These matters are subject to various uncertainties, and it is possible that some of these matters may be resolved unfavorably. The Company establishes accruals for matters for which the outcome is probable and can be reasonably estimated. Management believes that any liability in excess of these accruals upon the ultimate resolution of these matters will not have a material adverse effect on the Consolidated Financial Statements of the Company. Excluding reserves for uncertain tax positions, the Company recorded no accruals for contingencies as of June 30, 2023, or 2022.\nThe Board of Directors has authorized a monthly dividend of $0.0075 per share from July through September 2023, at which time it will be considered for continuation by the Board of Directors. Payment of cash dividends is within the discretion of the Companys Board of Directors and is dependent on earnings, operations, capital requirements, general financial condition of the Company and general business conditions. The total amount of cash dividends to be paid to class A and class C shareholders from July to September 2023 will be approximately $329,000.\nThe outbreak of the COVID-19 pandemic and the resulting actions to control or slow the spread have affected global and domestic economies and financial markets, and in the future it or other epidemics, pandemics or outbreaks may adversely affect the Company's results of operations, cash flows and financial position. The Company cannot reasonably estimate the future impact of these events, given the uncertainty over the duration and severity of the economic impact.\nNOTE 19. SUBSEQUENT EVENTS\nIn September 2023, the Board authorized the continuance of the monthly dividend of $0.0075 per share from October through December 2023, at which time it will be considered for continuation by the Board. Payment of cash dividends is within the discretion of the Companys Board of Directors and is dependent on earnings, operations, capital requirements, general financial condition of the Company, and general business conditions.\nSubsequent to June 30, 2023, the Company recognized an impairment loss on an equity investment accounted for under the investment alternative of $776,000. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nThere were no changes in or disagreements with accountants on accounting and financial disclosure during the two most recent fiscal years. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures. Disclosure controls and procedures are designed to ensure that information required to be disclosed in the reports that the Company files or submits under the Exchange Act is: (1) recorded, processed, summarized, and reported within the time periods specified in SEC rules and forms; and (2) accumulated and communicated to management, including the principal executive and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure. An evaluation was conducted under the supervision and with the participation of the Companys management, including the Chief Executive Officer (CEO) and Chief Financial Officer (CFO), of the effectiveness of the design and operation of the Companys disclosure controls and procedures as of June 30, 2023. Based on that evaluation, the CEO and CFO concluded that the Companys disclosure controls and procedures were not effective as of June 30, 2023, due to the existence of the material weaknesses in internal control over financial reporting described below (which we view as an integral part of our disclosure controls and procedures).\nNotwithstanding the material weaknesses, we believe that the Consolidated Financial Statements included in this annual report on Form 10-K fairly present, in all material respects, our financial position, results of operations and cash flows as of the date, and for the period, presented, in conformity with U.S. GAAP.\nManagements Report on Internal Control over Financial Reporting. The Companys management is responsible for establishing and maintaining adequate internal control over financial reporting as defined by Rules 13a-15(f) and 15d-15(f) under the Exchange Act. The Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management assessed the effectiveness of its internal control over financial reporting as of June 30, 2023. In making this assessment, the Companys management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on the Companys assessment, management concluded that, due to the material weaknesses described below, the Company's management did not maintain effective internal control over financial reporting as of June 30, 2023.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis.\nMaterial weakness over regulatory compliance and remediation efforts:\nManagement identified a deficiency in the design and operating effectiveness of the Companys internal controls as of June 30, 2023, that represents a material weakness in our internal control over financial reporting. The deficiency is the result of the inadequate design of controls related to complying with tax regulatory requirements. In particular, we determined that our controls were not designed and operating effectively to ensure new tax regulatory requirements were identified, reviewed for applicability and implemented on a timely basis. The control deficiency creates a reasonable possibility that a material misstatement of our Consolidated Financial Statements would not be prevented or detected on a timely basis, and constitutes a material weakness in our internal control over financial reporting.\nWe have evaluated the materiality of this error and determined that the impact is not material to our previously issued Consolidated Financial Statements. This material weakness resulted in an immaterial error in calculation and recognition of a reserve for uncertain tax positions for fiscal 2021 and 2022, which we have corrected in the accompanying Consolidated Financial Statements as of and for the fiscal year ended June 30, 2022, as a revision to the financial statements.\nManagement will design a remediation plan intended to address this material weakness. Management, with the oversight of the Audit Committee, will develop a comprehensive remediation plan, including a detailed plan and timetable for implementation, and will report regularly to the Audit Committee regarding the status of the implementation activities.\nMaterial weakness over fair value measurements and remediation efforts:\nThe material weakness in internal controls over financial reporting that was disclosed in our annual report on Form 10-K/A-2 as of and for the year ended June 30, 2022, was not remediated as of June 30, 2023. The deficiency is the result of the inadequate design of controls to measure the fair value of the Companys investments and overreliance on the work of a third-party specialist resulting in undetected errors in the valuation of certain investments. Management has initiated a remediation plan intended to address this material weakness, which includes taking steps to enhance its evaluation of the qualifications of third-party specialists, more accurately define the scope of work to be performed by such specialists, and improve the review process for work products prepared by specialists. The material weakness will not be considered remediated until such time management designs and implements effective controls that operate for a sufficient period of time and has concluded, through testing, that these controls are effective.\nChanges in Internal Control over Financial Reporting. Other than as described above, there have not been any changes in the Companys internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f)) during the fourth quarter ended June 30, 2023, that have materially affected or are reasonably likely to materially affect the Companys internal control over financial reporting.\nInherent Limitation of the Effectiveness of Internal Control. A control system, no matter how well conceived, implemented and operated, can provide only reasonable, not absolute, assurance that the objectives of the internal control system are met. Limitations inherent in any control system include the following:\n●\nJudgments in decision-making can be faulty, and control and process breakdowns can occur because of simple errors or mistakes.\n●\nControls can be circumvented by individuals, acting alone or in collusion with others, or by management override.\n●\nThe design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\n●\nOver time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with associated policies or procedures.\n●\nThe design of a control system must reflect the fact that resources are constrained, and the benefits of controls must be considered relative to their costs.\nBecause of such inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within a company or any division of a company have been detected. Item 9B. Other Information\nIn light of Frank Holmes ownership of 99.81 percent of the class C voting shares, the Company is eligible to rely on the exemption from certain of the NASDAQ corporate governance listing requirements relating to the independence of the Board of Directors and certain committees that is afforded to controlled companies. Under NASDAQ rules, a controlled company is a company of which more than 50 percent of the voting power for the election of directors is held by an individual, a group or another company.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPart III of Annual Report on Form 10-K Item 10. Directors, Executive Officers and Corporate Governance\nThe directors and executive officers of U.S. Global Investors, Inc. (U.S. Global or the Company) are as follows:\nName\nAge\nPosition\nFrank E. Holmes\nDirector of the Company and Chief Executive Officer of the Company since October 1989, and Chief Investment Officer since June 1999. Since October 1989, Mr. Holmes has served and continues to serve in various positions with the Company and its subsidiaries. Mr. Holmes served as Chairman of the Board of HIVE Digital Technologies Ltd., formerly HIVE Blockchain Technologies Ltd., since August 2017, Interim Executive Chairman from August 2018 to December 2020, Executive Chairman since December 2020, and Interim CEO from August 2018 to January 2023. He also served on the board of Thunderbird Entertainment Group Inc. (formerly Thunderbird Entertainment, Inc.) from June 2014 to March 2021. Mr. Holmes served as Chairman of the Board of GoldSpot Discoveries Corp. from February 2019 to May 2020 and as a director from February 2019 to June 2020. Mr. Holmes served as Director of Meridian Global Gold & Resources Fund Ltd. from December 2003 to November 2017; and Director of Meridian Global Energy & Resources Fund Ltd. from April 2006 to November 2017.\nJerold H. Rubinstein\nChairman of the Board of Directors since February 2006 and Director of the Company since October 1989. Mr. Rubinstein has served as Director and Chairman of Salton Sea Industries from June 2016 to June 2020. Mr. Rubinstein served as Director and Chairman of the Audit Committee of CKE Restaurants from June 2006 to July 2010 and April 2011 to December 2017. He also served as Director and Chairman of the Audit Committee of Greenwood Hall, Inc. from November 2016 to June 2017.\nRoy D. Terracina\nDirector of the Company since December 1994 and Vice Chairman of the Board of Directors since May 1997. Mr. Terracina is the owner of Sunshine Ventures, Inc., a company formed to hold investments, since January 1994 and has served as Chief Executive Officer and Board Chair of the Sonar Company since July 2021.\nThomas F. Lydon, Jr.\nDirector of the Company since June 1997. Mr. Lydon has served as Vice Chairman of VettaFi since May 2022; President of Global Trends Investments since April 1996; co-CEO of ETF Flows LLC since February 2019; Board Member of Alerian Company since August 2021; Independent Trustee of Guggenheim Investments since February 2012; and Independent Director of Harvest Volatility Edge Trust from December 2017 to December 2018.\nLisa C. Callicotte\nChief Financial Officer of the Company since July 12, 2013. Controller of the Company from July 2009 until July 2013. Since July 2009, Ms. Callicotte has served and continues to serve in various positions with the Company and its subsidiaries.\nNone of the directors or executive officers of the Company has a family relationship with any of the other directors or executive officers.\nThe members of the Board of Directors are elected for one-year terms or until their successors are elected and qualified. The Board of Directors appoints the executive officers of the Company.\nDirector Independence. The Companys Board of Directors is currently composed of four members. The Board of Directors has determined that three of the four members meet the definition of an independent director set forth in NASDAQ Rule 5605(a)(2), with the exception being Frank Holmes, who is the Chief Executive Officer and Chief Investment Officer of the Company. In assessing the independence of directors, the Board of Directors considered the business relationships between the Company and its directors or their affiliated businesses, including businesses owned and operated by family members, other than ordinary investment relationships. Furthermore, the Board of Directors has determined that none of the members of the two standing committees of the Board of Directors in existence during the 2023 fiscal year has any material relationship with the Company (either directly or as a partner, stockholder or officer of an organization that has a relationship with the Company) and that each such member is independent within the meaning of the independence standards applicable to each such committee.\nThe Board of Directors held nine meetings over the past fiscal year. Each incumbent director attended at least 75 percent of the board meetings during the last fiscal year. Directors are encouraged to attend the annual meeting of shareholders. All directors attended the 2022 fiscal year annual meeting. The standing committees of the Board of Directors currently consist of the Audit Committee and the Compensation Committee. The membership and responsibilities of those committees are described below:\nIndependent Directors\nAudit Committee\nCompensation Committee\nRoy D. Terracina\nChairman\nMember\nThomas F. Lydon, Jr.\nMember\nChairman\nJerold H. Rubinstein\nMember\nMember\nAudit Committee. The Company has a separately designated Audit Committee, established in accordance with Section 3(a)(58)(A) of the Exchange Act. The Audit Committee assists the Board of Directors in monitoring the integrity of the financial statements of the Company; the independent auditors qualifications and independence; the performance of the Companys independent auditors; complaints relating to the Companys accounting, internal accounting controls and audit matters; and the Companys accounting and financial reporting processes and audits of the Companys financial statements. The Board of Directors has determined that Director Roy Terracina qualifies as an audit committee financial expert as defined in Item 401(e) of Regulation S-K under the Exchange Act. Mr. Terracinas pertinent experience, qualifications, attributes, and skills include: a bachelors degree and a masters degree in finance, financial experience as a treasurer of a publicly traded company, managerial experience attained as the owner of a company responsible as a major supplier of baked and packaged goods primarily through the Department of Defense, the knowledge and experience he has attained from service on other boards and the knowledge and experience he has attained from his service on U.S. Globals Board of Directors. The Audit Committee met six times during the past fiscal year. Each incumbent committee member attended at least 75 percent of the committee meetings during the last fiscal year.\nReport of the Audit Committee. Management is responsible for U.S. Globals internal controls and financial reporting process. Grant Thornton LLP, U.S. Globals independent registered public accounting firm for the fiscal year ended June 30, 2023, is responsible for performing an independent audit of U.S. Globals financial statements in accordance with the standards of the Public Company Accounting Oversight Board (PCAOB) and to issue its report thereon. The Audit Committee monitors and oversees these processes. The Audit Committee approves the selection and appointment of U.S. Globals independent registered public accounting firm and recommends the ratification of such selection and appointment to U.S. Globals Board of Directors.\nThe Audit Committee has reviewed and discussed U.S. Globals audited financial statements with management and Grant Thornton LLP. The committee has discussed with Grant Thornton LLP the matters required to be discussed by the PCAOB auditing standards which relates to the conduct of our audit, including our auditors judgment about the quality of the accounting principles applied in our fiscal year 2023 audited financial statements. The Audit Committee has received the written disclosures and the letter from Grant Thornton LLP required by applicable requirements of the PCAOB regarding the independent accountants communications with the committee concerning independence and has discussed with Grant Thornton LLP that firms independence.\nBased on the foregoing review and discussions and such other matters the Audit Committee considered relevant and appropriate, the committee recommended to the Board of Directors that the audited financial statements of U.S. Global be included in its Annual Report on Form 10-K for the year ended June 30, 2023.\nCompensation Committee. The Compensation Committee assists the Board of Directors in carrying out its responsibilities with respect to employee qualified benefit plans and employee programs, executive compensation programs, stock option plans and director compensation programs. The Compensation Committee has broad responsibility for assuring that the Companys executive officers, including the Companys Chief Executive Officer, are effectively compensated in terms of salaries, supplemental compensation and benefits that are internally equitable and externally competitive. Additional responsibilities include the review and approval of corporate goals and objectives relevant to the Chief Executive Officer. The Compensation Committee reviews all components of compensation, including salaries, cash incentive plans, long-term incentive plans and various employee benefit matters. The Compensation Committee met two times during the past fiscal year. Each incumbent committee member attended at least 75 percent of the committee meetings during the last fiscal year.\nNomination of Directors. Although the Company does not have a standing nominating committee, the Companys Corporate Governance Guidelines effectively provide guidance on selection and nomination process whenever a vacancy occurs on the Board of Directors. Due to the longevity of service of the current Board of Directors, those Directors have not participated in consideration of director nominees.\nThe Company believes generally that its Board of Directors as a whole should encompass a range of talent and expertise, enabling it to provide sound guidance with respect to the Companys operations and interests. Whenever a vacancy occurs on the Board of Directors, the board members are responsible for identifying one or more candidates to fill that vacancy, investigating each candidate and evaluating their suitability for service on the board. The following attributes or qualifications will be considered by the Board of Directors in evaluating a persons candidacy:\n●\nManagement and leadership experience;\n●\nSkilled and diverse background; and\n●\nIntegrity and professionalism.\nThe board members are authorized to use any methods it deems appropriate for identifying candidates for board membership. In addition, candidates recommended by the Companys stockholders are considered in the same manner as other candidates.\nThe Companys policy is to have at least a majority of directors qualify as independent under the NASDAQ Listing Rules and the Companys Corporate Governance Guidelines, which are available at the Companys website at www.usfunds.com.\nDirector Interaction with Stockholders. The Companys Corporate Governance Guidelines provide the process by which stockholders and other interested parties may contact the non-management members of the Board. These guidelines are contained on the Companys website under About Us, followed by Investor Relations.\nCode of Ethics for Principal Executive and Senior Financial Officers\nThe Company has adopted a Code of Ethics for Principal Executive and Senior Financial Officers that applies to the Companys principal executive officer and principal financial officer. This code charges these individuals with responsibilities regarding honest and ethical conduct, the preparation and quality of the disclosures in documents and reports the Company files with the SEC, and compliance with applicable laws, rules, and regulations. Item 11. Executive Compensation\nCompensation Discussion and Analysis\nOverview\nThe following section provides a discussion and analysis of the basis for the compensation awarded to the CEO and the CFO, (Named Executive Officers or NEOs), as well as our directors in fiscal year 2023. We provide investment advisory and other services to our clients. Our long-term success depends on our ability to provide superior investment returns and outstanding client service. As such, one of our greatest assets is the collective skill, experience and efforts of our employees. To achieve success, we must be able to attract, retain and motivate professionals within all levels of our Company who are committed to our core values.\nWe place great significance on our values of performance, teamwork, initiative, responsiveness, focused work ethic, and intellectual curiosity. We believe that adherence to these core values will contribute to the long-term success of the Company and our shareholders.\nWe compete for talent with a large number of investment management and financial services companies, many of which have significantly larger market capitalization than we do. Our relatively small size within the industry, geographic location, and lean executive management team provides unique challenges.\nSetting Executive Compensation\nThe Compensation Committee of our Board of Directors is responsible for reviewing and approving corporate goals and objectives relevant to the CEO, Frank Holmes; evaluating the CEOs performance in light of those goals and objectives; and determining and approving the CEOs compensation level based on this evaluation. In addition, the committee is responsible for reviewing and approving compensation recommended by Mr. Holmes for our other executive officers. The Board of Directors appointed Messrs. Lydon, Terracina, and Rubinstein as members of the Compensation Committee. Mr. Lydon serves as the chairman of the Compensation Committee. The Compensation Committee has a charter that is available for review on our website at www.usfunds.com by clicking About Us, followed by Policies and Procedures.\nThe individuals listed below are the CEO and CFO, who are the only NEOs for the fiscal year 2023.\nName\nTitle\nFrank E. Holmes\nChief Executive Officer and Chief Investment Officer\nLisa C. Callicotte\nChief Financial Officer\nIn establishing total annual compensation for Mr. Holmes, the Compensation Committee considers a number of factors. For assistance in determining the appropriate factors to consider, the Compensation Committee consulted in 2005 with Moss Adams LLP, an executive compensation consulting firm. Importantly, the Compensation Committee considers the various functions Mr. Holmes assumes, including the dual role of CEO and Chief Investment Officer (CIO). In addition, the Compensation Committee considers various measures of company performance, including profitability and total shareholder return. The Compensation Committee also reviews Mr. Holmes performance in managing our corporate investments, in overseeing the management of our client portfolios and the results of our operational earnings.\nIn addition to his base salary, Mr. Holmes receives a bonus based on operational earnings, which are substantially derived from assets under management, based on a percentage of operational earnings, and capped at a predetermined dollar amount, as computed for financial reporting purposes in accordance with GAAP (before consideration of this fee).\nMr. Holmes also receives a bonus when our investment team meets their performance goals. The bonus is based on calculated fund performance bonuses of the investment team and is in recognition of Mr. Holmes creation and oversight of the investment processes and strategy.\nThe committee has delegated to Mr. Holmes the responsibility for reviewing the performance of, and recommending the compensation levels for, our other NEOs. The committee does not use rigid formulas with respect to the compensation of NEOs. Mr. Holmes makes a recommendation based on the achievement of qualitative goals that apply to all employees, quantitative goals that apply to an executive officers specific job responsibilities and other accomplishments, such as expansion in functional responsibility. In forming his recommendations, Mr. Holmes also considers the responsibilities and workload of the executive officer; the explicit and tacit knowledge required to perform these responsibilities, including any professional designations; the profitability of the company; and the cost of living in San Antonio, Texas.\nObjectives\nOur executive compensation programs are designed to:\n●\nattract and retain key executives,\n●\nalign executive performance with our long-term interests and those of our shareholders, and\n●\nlink executive pay with performance.\nElements of Executive Compensation\nThe committee reviews and approves all components of executive officer compensation. The principal elements of executive compensation, other than Mr. Holmes, are:\n●\nbase salary,\n●\nperformance-based cash and stock bonuses,\n●\nlong-term incentive awards, and\n●\nother compensation and benefits.\nBase Salary\nBase salaries for NEOs are reviewed annually by the Compensation Committee. Generally, the salaries of NEOs are occasionally adjusted to recognize expansion of an individuals role, outstanding and sustained performance, or to bring the officers pay into alignment with the market. We did not use any benchmarking studies in fiscal year 2023 to obtain market information. In addition, the Compensation Committee did not consider the equity ownership of the Company by Mr. Holmes when setting his compensation. Nor did the committee aim for a specific relationship between Mr. Holmes and the other executive officers. Base salaries paid to NEOs during the fiscal year are shown in the Summary Compensation Table.\nPerformance-Based Cash Bonuses\nExecutive officers, except Mr. Holmes, participate in a team performance pay program based on each employees annual salary to recognize monthly completion of departmental goals. Additionally, key executive officers are compensated based on individual performance pay arrangements. Discretionary cash bonuses are awarded from time to time for such things as completion of critical projects or outstanding performance.\nMr. Holmes considered a matrix of factors in reviewing the performance of, and compensation for, the CFO, Ms. Lisa Callicotte. Mr. Holmes considered such things as responsibilities, productivity, results of the Companys actual versus targeted goals, hours of work, profitability of the Company, timely and accurate financial regulatory filings, unqualified audit results and the cost of living in San Antonio. Occasionally, Ms. Callicotte receives discretionary bonuses for the completion of projects.\nLong-Term Incentive Awards\nLong-term incentive awards include stock options and restricted shares. We have utilized option grants to induce qualified individuals to join us, thereby providing the individual with an opportunity to benefit if we have significant growth. Similarly, options have been utilized to reward existing employees, including NEOs, for long and faithful service and to encourage them to stay with us. The Company has no written policy for allocating between cash and equity, or current and long-term compensation for the CEO and other NEOs. The Compensation Committee administers the stock option plans.\nStock Option Plans\nIn November 1989, the Board of Directors adopted the 1989 Non-Qualified Stock Option Plan (1989 Plan) which provides for the granting of options to purchase shares of our class A common stock to directors, officers, and employees. On December 6, 1991, shareholders approved and amended the 1989 Plan to provide provisions to cause the plan and future grants under the plan to qualify under 1934 Act Rule 16b-3. The 1989 Plan is administered by the Compensation Committee consisting of three independent members of the Board of Directors. The maximum number of shares of class A common stock initially approved for issuance under the 1989 Plan is 1,600,000 shares. During the fiscal year ended June 30, 2023, no stock options were granted under this plan. As of June 30, 2023, under this amended plan, 1,964,400 options had been granted, 883,000 options had been exercised, 852,400 options had expired, 229,000 remained outstanding, and 488,000 options are available for grant.\nIn April 1997, the Board of Directors adopted the 1997 Non-Qualified Stock Option Plan (1997 Plan), which shareholders approved on April 25, 1997. It provides for the granting of stock appreciation rights (SARs) and/or options to purchase shares of our class A common stock to directors, officers and employees. The 1997 Plan expressly requires that all grants under the plan qualify under 1934 Act Rule 16b-3. The 1997 Plan is administered by the Compensation Committee consisting of three outside members of the Board of Directors. The maximum number of shares of class A common stock initially approved for issuance under the 1997 Plan is 400,000 shares. During the fiscal year ended June 30, 2023, no stock options were granted under this plan. As of June 30, 2023, 583,300 options had been granted; 257,000 shares had been exercised; 324,300 options had expired; 2,000 options remained outstanding; and 141,000 options are available for grant.\nAssessment of Risk\nBy design, the Companys compensation program for all employees, including executive officers, does not incentivize excessive risk-taking. The Companys base salary component of compensation does not encourage risk-taking because it is a fixed amount. Generally, incentive awards have the following risk-limiting characteristics:\n●\nAwards are made based on a review of a variety of indicators of performance, thus diversifying the risk associated with any single indicator of performance;\n●\nAll participants, including executive officers, in the Employee Stock Purchase Plan are subject to stock ownership and holding guidelines.\nOther Compensation and Benefits\nHealth, Welfare and Retirement Benefits\nHealth, welfare, and retirement benefits are designed to provide a safety net of protection for employees in the event of illness, disability, or death, and to provide employees an opportunity to accumulate retirement savings.\nWe offer a range of health and welfare benefits to substantially all employees, including the NEOs. These benefits include medical, dental, vision, prescription drug, short-term disability, long-term disability, group life and accidental death insurance, and tuition reimbursement.\n401(k) Plan\nWe offer a 401(k) plan covering substantially all employees, including NEOs. Participants may contribute a portion of their base salary and cash incentive compensation, up to a limit imposed by the Internal Revenue Code, which is $22,500 in calendar year 2023. An additional catch-up pretax contribution of up to $7,500 is allowed for employees over 50. We automatically match 100 percent of the first 3 percent of participating employees contributions and 50 percent of the next 2 percent of participating employees contributions. We contribute to participants accounts at the same time that the employees pay deferral is made. Employees are immediately vested in both their 401(k) salary deferral contribution and the matched contributions. Participants in our 401(k) plan may contribute to Roth and/or traditional 401(k) accounts.\nProfit Sharing\nThe 401(k) plan allows us to make a discretionary profit-sharing contribution, as authorized by the Board of Directors. Factors that are considered by the Board of Directors include earnings, cash flows, capital requirements and the general financial condition of the Company. No specific performance thresholds or goals are required by the board to authorize a profit-sharing contribution. The Company made a profit-sharing contribution of $200,000 in fiscal years 2023 and 2022.\nSavings Plans\nWe also have a program pursuant to which we offer employees an opportunity to participate in savings programs using mutual funds managed by us. Employee contributions to an Individual Retirement Account are matched to a maximum of $100 per month for certain management-level employees, including NEOs, and a maximum of $30 for all other employees. A similar savings plan utilizing Uniform Gifts to Minors Act (UGMA) accounts is offered to all employees to save for minor relatives and is matched at a maximum of $15 per month per child.\nEmployee Stock Purchase Plan\nWe also have a program whereby eligible employees can purchase treasury shares, at market price. The Company matches these contributions on a limited basis. During fiscal years 2023 and 2022, employees purchased 19,981 and 10,191 shares of treasury stock from us, respectively. The purchase price used is the closing stock price on the last business day of each month. All participants, including executive officers, in the Employee Stock Purchase Plan are subject to stock ownership and holding guidelines. We do not restrict the ability of our employees or directors to hedge their position in our shares. In addition, neither the board nor NEOs are required to own or purchase a certain number of shares.\nThe Summary Compensation Table includes the matched contributions to the plans described above for each NEO.\nPerquisites and Other Benefits\nWe provide certain perquisites that the committee believes are reasonable and consistent with our overall compensation program to a limited number of officers. The perquisites consist of such things as memberships for business entertainment purposes and policies for long-term disability and life insurance. The Summary Compensation Table shows the value of perquisites provided to NEOs in fiscal year 2023 in the All Other Compensation column.\nEmployment Agreements, Termination and Change-in Control Arrangements\nWe do not have any employment agreements, termination agreements, or change-in control agreements with any of our executive officers.\nCompliance with Section 162(m)\nAs amended by the Tax Cuts and Jobs Act enacted in December 2017, Section 162(m) of the Internal Revenue Code generally disallows a tax deduction to public corporations for compensation greater than $1 million paid during any fiscal year to our CEO, CFO and our three other most highly compensated executive officers.\nCompensation of Named Executive Officers\nThe following table sets forth for the fiscal year ended June 30, 2023, the compensation reportable for the NEOs, as determined by SEC rules. Columns were omitted if they were not applicable.\nSummary Compensation Table\nName and Principal Position\nYear\nSalary\nBonus\nNon-Equity Incentive Plan Compensation\nAll Other Compensation\nTotal\n($)\n($)\n($) 1\n($) 2,3\n($)\n(dollars in thousands)\nFrank E. Holmes\nChief Executive Officer\n1,329\n2,023\nChief Investment Officer\n1,167\nLisa C. Callicotte\nChief Financial Officer\n-\n-\n1.\nThe amounts consist of cash incentive compensation awards earned for services. The amounts were paid pursuant to the senior executive bonus programs.\n2.\nFor fiscal year 2023, represents amounts paid by us on behalf of or to Mr. Holmes as follows: (i) $63 in insurance, (ii) $32 in matched contributions, (iii) $27 in paid time off payout, (iv) $25 in profit-sharing, (v) $2 in memberships, and (vi) $19 in miscellaneous items.\n3.\nFor fiscal year 2023, represents amounts paid by us on behalf of or to Ms. Callicotte as follows: (i) $22 in profit-sharing, (ii) $20 in matched contributions, (iii) $11 in paid time off payout, and (iv) $2 in miscellaneous items.\nOutstanding equity awards as of June 30, 2023, for the named executive officers are detailed in the table below. Columns were omitted if they were not applicable.\nOutstanding Equity Awards at Fiscal Year-End\nOption Awards\nName\nNumber of Securities Underlying Unexercised Options - Exercisable\nNumber of Securities Underlying Unexercised Options - Unexercisable\nOption Exercise Price ($)\nOption Expiration Date\nFrank E. Holmes\n50,000\n-\n$ 6.05\n6/21/2031\nLisa C. Callicotte\n2,000\n-\n$ 2.74\n3/21/2028\nLisa C. Callicotte\n50,000\n-\n$ 6.05\n6/21/2031\nThe Pension Benefits, Nonqualified Deferred Compensation, and Option Exercises and Stock Vested Tables were omitted because they were not applicable.\nCompensation of Directors\nThe compensation of directors is subject to a minimum of $15,000 in any quarter. Directors are reimbursed for reasonable travel expenses incurred in attending the meetings held by the Board of Directors. Mr. Rubinstein serves as the Chairman of the Board. We may grant non-employee directors options under our 1989 and 1997 Stock Option Plans. Director compensation for the fiscal year ended June 30, 2023, is detailed in the table below. Columns that were not applicable were omitted.\nDirector Compensation\nFees Earned or\nName\nPaid in Cash 1\nTotal\n(dollars in thousands)\nJerold H. Rubinstein\n$\n$\nRoy D. Terracina\n$\n$\nThomas F. Lydon, Jr.\n$\n$\n1.\nThe difference in fees earned was primarily due to Mr. Rubinstein receiving an additional amount per month for added responsibilities as chairman. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners\nClass C Common Stock (Voting Stock)\nOn November 8, 2023, there were 2,068,549 shares of the Companys class C common stock outstanding. The following table sets forth, as of such date, information regarding the beneficial ownership of the Companys class C common stock by each person known by the Company to own 5 percent or more of the outstanding shares of class C common stock.\nName and Address of Beneficial Owner\nClass C Common Shares Beneficially Owned\nPercent of Class (%)\nFrank Holmes\n2,064,560\n99.81 %\n7900 Callaghan Road\nSan Antonio, TX 78229\nClass A Common Stock (Nonvoting Stock)\nOn November 8, 2023, there were 12,240,786 shares of the Companys class A common stock outstanding. There were no persons known by the Company to own 5 percent or more of the outstanding shares of class A common stock.\nSecurity Ownership of Management\nThe following table sets forth, as of November 8, 2023, information regarding the beneficial ownership of the Companys class A and class C common stock by each director and named executive officer and by all directors and executive officers as a group. Except as otherwise indicated in the notes below, each person directly owns the number of shares indicated in the table and has sole voting power and investment power with respect to all such shares.\nClass C\nClass A\nBeneficial Owner\nCommon Stock\nCommon Stock\nNumber of Shares\n%\nNumber of Shares\n%\nFrank E. Holmes, CEO, Director\n2,064,560\n99.81 %\n530,408\n4.33 %\nLisa C. Callicotte, CFO\n-\n-\n26,875\n0.22 %\nJerold H. Rubinstein, Director\n-\n-\n2,800\n0.02 %\nRoy D. Terracina, Director\n-\n-\n63,800\n0.52 %\nThomas F. Lydon, Jr., Director\n-\n-\n17,500\n0.14 %\nAll directors and executive officers as a group (five persons)\n2,064,560\n99.81 %\n641,383\n5.24 %\nEquity Compensation Plan Information\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nWeighted-average exercise price of outstanding options, warrants and rights\nNumber of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nPlan Category\n(a)\n(b)\n(c)\nEquity compensation plans approved by security holders\nN/A\nN/A\nN/A\nEquity compensation plans not approved by security holders\n1989 Stock Option Plan 1\n229,000\n$ 6.05\n488,000\n1997 Non-Qualified Stock Option Plan 2\n2,000\n$ 2.74\n141,000\nEmployee Stock Purchase Plan 3\nN/A\nN/A\n82,797\nTotal\n231,000\n711,797\n1.\nStock options under this plan may be granted to directors, officers, and employees of the Company from authorized but unissued shares or treasury shares.\n2.\nStock options under this plan may be granted to directors, executives, and key salaried employees of the Company from authorized but unissued shares or treasury shares. The term of the option periods must be less than ten years.\n3.\nThe Company has adopted a stock purchase plan to provide eligible employees of the Company an opportunity to purchase common stock of the Company. There are authorized shares of treasury stock reserved for issuance under the plan for which a registration statement has not been filed. Item 13. Certain Relationships and Related Transactions, and Director Independence\nSee Note 17, Related Party Transactions, to the Consolidated Financial Statements of this Annual Report on Form 10-K, which incorporates the information of the relationships and related transaction for this Item 13. Refer to Item 10 for information regarding director independence. Item 14. Principal Accounting Fees and Services\nThe following table represents fees for professional audit services for the audit of the Companys annual financial statements for the fiscal year ended June 30, 2023, rendered by Grant Thornton LLP.\nFiscal year ended June 30,\n(dollars in thousands)\nAudit fees 1\n$\nAudit-related fees 2\n-\nTax fees 3\nTotal fees\n$\n1.\nAudit fees consist of fees for professional services rendered by the principal accountant for the audit of the Companys annual financial statements and review of the financial statements included in the Companys Form 10-Q and for services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements.\n2.\nAudit-related fees consist primarily of fees for assurance and related services by the accountant that are reasonably related to the performance of the audit or review of the Companys financial statements.\n3.\nTax fees include the preparation of federal tax returns as well as tax planning and consultation on new tax legislation, regulations, rulings, and developments.\nAudit Committee Pre-Approval Policies\nThe Audit Committee has established pre-approval policies pursuant to which all audit and auditor-provided non-audit engagement fees and terms must be approved. Pre-approval is generally provided and is detailed as to the particular service or category of services. The Audit Committee is also responsible for considering, to the extent applicable, whether the independent auditors provision of other non-audit services to the Company is compatible with maintaining the independence of the independent auditors.\nAll services provided by Grant Thornton LLP in the fiscal year ended June 30, 2023, were pre-approved by the Audit Committee.\nPart IV of Annual Report on Form 10-K Item 15. Exhibits, Financial Statement Schedules\n(a)\nThe following documents are filed as part of this report:\n1.\nFinancial Statements\nSee Item 8 of Part II of this report.\n2.\nFinancial Statement Schedules\nNone.\n3.\nExhibits\n3.1\nFourth Restated and Amended Articles of Incorporation of Company, incorporated by reference to the Companys Form 10-Q for the quarter ended March 31, 2007 (EDGAR Accession Number 000095134-07-010817)\n3.2\nAmended and Restated By-Laws of Company, incorporated by reference to Exhibit 3.02 of the Companys Form 8-K filed on November 8, 2006, (EDGAR Accession Number 0000754811-06-000076)\n4.1\nDescription of Capital Stock, incorporated by reference to the Companys Form 10-K for the year ended June 30, 2019 (Edgar Accession No. 0001185185-19-001226)\n10.1\nAdvisory Agreement with U.S. Global Investors Funds, dated October 1, 2008, incorporated by reference to Post-Effective Amendment 100 filed October 1, 2008 (EDGAR Accession No. 0000950134-08-017422)\n10.2\nDistribution Agreement dated December 10, 2015, by and between U.S. Global Investors Funds and Foreside Fund Services, LLC, incorporated by reference to the Companys Form 10-Q for the quarter ended December 31, 2015, filed February 12, 2016 (EDGAR Accession No. 0001185185-16-003686)\n10.3\nNovation to the Distribution Agreement dated December 10, 2015, by and between U.S. Global Investors Funds and Foreside Fund Services, LLC, incorporated by reference to U.S. Global Investors Funds, Post-Effective Amendment No. 127, filed April 28, 2017 (EDGAR Accession No. 0001398344-17-005412)\n10.4\nDistribution Services Agreement dated December 10, 2015, by and between U.S. Global Investors, Inc. and Foreside Fund Services, LLC, incorporated by reference to the Companys Form 10-Q for the quarter ended December 31, 2015, filed February 12, 2016 (EDGAR Accession No. 0001185185-16-003686)\n10.5\nAmended and Restated Administrative Services Agreement dated December 9, 2015, by and between U.S. Global Investors Funds and U.S. Global Investors, Inc., incorporated by reference to the Companys Form 10-Q for the quarter ended December 31, 2015, filed February 12, 2016 (EDGAR Accession No. 0001185185-16-003686)\n10.6\nDistribution Plan Pursuant to Rule 12b-1 adopted December 9, 2015 by the Board of Trustees of U.S. Global Investors Funds, incorporated by reference to the Companys Form 10-Q for the quarter ended December 31, 2015, filed February 12, 2016 (EDGAR Accession No. 0001185185-16-003686)\n10.7\nUnited Services Advisors, Inc. 1989 Non-Qualified Stock Option Plan, incorporated by reference to Exhibit 4(a) of the Companys Registration Statement No. 33-3012, Post-Effective Amendment No. 2, filed on Form S-8 with the Commission on April 23, 1997 (EDGAR Accession No. 0000754811-97-000004)\n10.8\nU.S. Global Investors, Inc. 1997 Non-Qualified Stock Option Plan, incorporated by reference to Exhibit 4 of the Companys Registration Statement No. 333-25699 filed on Form S-8 with the Commission on April 23, 1997 (EDGAR Accession No. 0000754811-97-000003)\n10.9\n2010 Stock Incentive Plan, amended May 26, 2020, incorporated by reference to the Companys Form 8-K filed on May 28, 2020 (EDGAR Accession No. 0001185185-20-000741)\n10.10\n(A) Advisory Agreement with ETF Series Solutions dated February 19, 2015, incorporated by reference to Post-Effective Amendment 53 filed April 22, 2015 (EDGAR Accession No. 0000894189-15-001923)\n(B) Amended Schedule A to Advisory Agreement with ETF Series Solutions, incorporated by reference to Post-Effective Amendment 210 filed June 8, 2017 (EDGAR Accession No. 0000894189-17-003025)\n(C) Amended Schedule A to Advisory Agreement with ETF Series Solutions, incorporated by reference to Post-Effective Amendment 755 and Amendment 756 filed October 28, 2021 (EDGAR Accession No. 0000894189-21-007557)\n14.01\nCode of Ethics for Principal Executive and Senior Financial Officers, adopted December 15, 2003, and amended February 17, 2016, incorporated by reference to the Companys Form 10-Q for the quarter ended March 31, 2016, filed on May 12, 2016 (EDGAR Accession No. 0001185185-16-004512)\n14.02\nCode of Ethics, incorporated by reference to the Companys Form 10-Q for the quarter ended December 31, 2019 (EDGAR Accession No. 0001185185-20-000164)\nList of Subsidiaries of the Company, included herein.\n23.1\nGrant Thornton LLP consent of independent registered public accounting firm for Form 10-K for U.S. Global Investors, Inc., included herein.\n23.2 BDO USA, LLP consent of independent registered public accounting firm for Form 10-K for U.S. Global Investors, Inc., included herein.\n31.1\nRule 13a-14(a) Certifications (under Section 302 of the Sarbanes-Oxley Act of 2002), included herein.\n32.1\nSection 1350 Certifications (under Section 906 of the Sarbanes-Oxley Act of 2002), included herein.\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nSignatures\nPursuant to the requirements of Section 13 of 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nU.S. Global Investors, Inc.\nBy: /s/ Frank E. Holmes\nFrank E. Holmes\nDate: November 16, 2023\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nCapacity in which signed\nDate\n/s/ Frank E. Holmes\nFrank E. Holmes\nChief Executive Officer\nChief Investment Officer\nDirector\nNovember 16, 2023\n/s/ Thomas F. Lydon, Jr.\nThomas F. Lydon, Jr.\nDirector\nNovember 16, 2023\n/s/ Jerold H. Rubinstein\nJerold H. Rubinstein\nChairman, Board of Directors\nNovember 16, 2023\n/s/ Roy D. Terracina\nRoy D. Terracina\nDirector\nNovember 16, 2023\n/s/ Lisa C. Callicotte\nLisa C. Callicotte\nChief Financial Officer\nNovember 16, 2023"
}