{
    "cik": "764401",
    "company": "INSTEEL INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-10-27",
    "period_of_report": "2022-10-01",
    "sic": "3310",
    "state_of_inc": "NC",
    "state_location": "NC",
    "fiscal_year_end": "1001",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/764401/0001437749-22-024897-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/764401/000143774922024897/iiin20221001_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/764401/0001437749-22-024897.txt",
    "filename": "764401_10K_2022_0001437749-22-024897.htm",
    "content": "Item 1. Business\nGeneral\nInsteel Industries, Inc. (we, us, our, the Company or Insteel) is the nations largest manufacturer of steel wire reinforcing products for concrete construction applications. We manufacture and market prestressed concrete strand (PC strand) and welded wire reinforcement (WWR), including ESM, concrete pipe reinforcement (CPR) and standard welded wire reinforcement (SWWR). Our products are sold mainly to manufacturers of concrete products that are used primarily in nonresidential construction. For fiscal 2022, we estimate that approximately 85% of our sales were related to nonresidential construction and 15% were related to residential construction.\nInsteel is the parent holding company for two wholly-owned subsidiaries, Insteel Wire Products Company (IWP), an operating subsidiary, and Intercontinental Metals Corporation, an inactive subsidiary. We were incorporated in 1958 in the State of North Carolina.\nOur business strategy is focused on: (1) achieving leadership positions in our markets; (2) operating as the lowest cost producer in our industry; and (3) pursuing growth opportunities within our core businesses that further our penetration of the markets we currently serve or expand our footprint. Headquartered in Mount Airy, North Carolina, we operate ten manufacturing facilities that are all located in the U.S. in close proximity to our customers and raw material suppliers. Our growth strategy is focused on organic opportunities as well as strategic acquisitions in existing or related markets that leverage our infrastructure and core competencies in the manufacture and marketing of concrete reinforcing products.\nOn March 16, 2020, we, through our wholly-owned subsidiary, IWP, purchased substantially all of the assets of Strand-Tech Manufacturing, Inc. (STM) for an adjusted purchase price of $19.4 million, which reflects certain post-closing adjustments (the STM Acquisition). STM was a leading manufacturer of PC strand for concrete construction applications. We acquired, among other assets, STMs accounts receivable, inventories, production equipment and facility located in Summerville, South Carolina and assumed certain of its accounts payable and accrued liabilities. Subsequent to the acquisition, we elected to consolidate our PC strand operations with the closure of the Summerville facility.\nProducts\nOur operations are entirely focused on the manufacture and marketing of steel wire reinforcing products for concrete construction applications. Our concrete reinforcing products consist of two product lines: PC strand and WWR. Based on the criteria specified in Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 280, Segment Reporting, we have one reportable segment.\nPC strand is a high strength, seven-wire strand that is used to impart compression forces into precast concrete elements and structures, which may be either pretensioned or posttensioned, providing reinforcement for bridges, parking decks, buildings and other concrete structures. Its high tensile strength allows for the casting of longer spans and thinner sections. Pretensioned or prestressed concrete elements or structures are primarily used in nonresidential construction while posttensioned concrete elements or structures are used in both nonresidential and residential construction.\nWWR is produced as either a standard or a specially engineered reinforcing product for use in nonresidential and residential construction. We produce a full range of WWR products, including ESM, CPR and SWWR. ESM is an engineered made-to-order product that is used as the primary reinforcement for concrete elements or structures, frequently serving as a lower cost reinforcing solution than hot-rolled rebar. CPR is an engineered made-to-order product that is used as the primary reinforcement in concrete pipe, box culverts and precast manholes for drainage and sewage systems, water treatment facilities and other related applications. SWWR is a secondary reinforcing product that is produced in standard styles for crack control applications in residential and light nonresidential construction, including driveways, sidewalks and various slab-on-grade applications.\nSee Note 15 for the disaggregation of our net sales by product line and geography.\nMarketing and Distribution\nWe market our products through sales representatives who are our employees. Our outside sales representatives are trained on the technical applications for our products and sell multiple product lines in their respective territories. We sell our products nationwide across the U.S. and, to a much lesser extent, into Canada, Mexico and Central and South America. Our products are shipped primarily by truck, using common or contract carriers. The delivery method selected is determined based on backhaul opportunities, comparative costs and customer service requirements.\nCustomers\nWe sell our products to a broad range of customers that includes manufacturers of concrete products, and to a lesser extent, distributors, rebar fabricators and contractors. In fiscal 2022, we estimate that approximately 70% of our net sales were to manufacturers of concrete products and 30% were to distributors, rebar fabricators and contractors. In many cases, we are unable to identify the specific end use for our products as most of our customers sell products that are used for both nonresidential and residential construction, and the same products can be used for different end uses. We did not have any customers that represented 10% or more of our net sales in fiscal years 2022, 2021 and 2020. The loss of a single customer or a few customers would not have a material adverse impact on our business.\nBacklog\nBacklog for our business is minimal due to the relatively short lead times that are required by our customers. We believe that the majority of our firm orders as of the end of fiscal 2022 will be shipped during the first quarter of fiscal 2023.\nSeasonality and Cyclicality\nDemand in our markets is both seasonal and cyclical, driven by the level of construction activity, but can also be impacted by fluctuations in the inventory positions of our customers. Shipments are seasonal, typically reaching their highest level when weather conditions are the most conducive to construction activity. As a result, assuming normal seasonal weather patterns, shipments and profitability are usually higher in the third and fourth quarters of the fiscal year and lower in the first and second quarters. Construction activity and demand for our products is cyclical based on overall economic conditions, although there can be significant differences between the relative strength of nonresidential and residential construction for extended periods.\nRaw Materials\nThe primary raw material used to manufacture our products is hot-rolled carbon steel wire rod, which we purchase from both domestic and foreign suppliers and can generally be characterized as a commodity product. We purchase several different grades and sizes of wire rod with varying specifications based on the diameter, chemistry, mechanical properties and metallurgical characteristics that are required for our products. High-carbon grades of wire rod are required for the production of PC strand while low-carbon grades are used to manufacture WWR.\nWire rod prices tend to fluctuate based on changes in scrap and other metallic prices for steel producers together with domestic and global market conditions. In most economic environments, domestic demand for wire rod exceeds domestic production capacity, and imports of wire rod are necessary to satisfy the supply requirements of the U.S. market. U.S. government trade policies and trade actions by domestic wire rod producers can significantly impact the pricing and availability of imported wire rod, which during fiscal years 2022 and 2021 represented approximately 26% and 16%, respectively, of our total wire rod purchases. We believe that our substantial wire rod requirements, desirable mix of sizes and grades and strong financial condition represent a competitive advantage by making us a relatively more attractive customer to our suppliers.\nOur ability to source wire rod from overseas suppliers is limited by domestic content requirements generally referred to as Buy America or Buy American laws that exist at both the federal and state levels. These laws generally prescribe a domestic melt and cast standard for purposes of compliance. Customers purchasing PC strand and WWR for certain applications require the Company to certify compliance with Buy America laws.\nSelling prices for our products tend to be correlated with changes in wire rod prices. However, the timing and magnitude of the relative price changes varies depending upon market conditions and competitive factors. Ultimately, the relative supply - demand balance in our markets and competitive dynamics determine whether our margins expand or contract during periods of rising or falling wire rod prices.\nCompetition\nWe are the nations largest manufacturer of steel wire reinforcing products for concrete construction applications. Our markets are highly competitive based on price, quality and service. Some of our competitors, such as Nucor Corporation, Liberty Steel USA (Liberty) and Oklahoma Steel and Wire, are vertically integrated companies that produce both wire rod and concrete reinforcing products and offer multiple product lines over broad geographic areas. Other competitors are smaller independent companies that offer limited competition in certain markets. Our primary competitors for WWR products are Engineered Wire Products, Inc. (a subsidiary of Liberty), Wire Mesh Corporation, Concrete Reinforcements, Inc., National Wire Products, Davis Wire Corporation and Oklahoma Steel & Wire Co., Inc. Our primary competitors for PC strand are Sumiden Wire Products Corporation and Wire Mesh Corporation. Import competition is also a significant factor in certain segments of the PC strand and SWWR markets that are not subject to Buy America requirements.\nIn response to illegally traded import competition from offshore PC strand suppliers, we have pursued trade cases, when necessary, as a means of ensuring that foreign producers were complying with the applicable trade laws and regulations. In 2003, we joined together with a coalition of domestic PC strand producers and filed petitions with the U.S. Department of Commerce (the DOC) alleging that imports of PC strand from Brazil, India, Korea, Mexico and Thailand were being dumped or sold in the U.S. at a price that was lower than fair value and had injured the domestic PC strand industry. The DOC ruled in our favor and imposed anti-dumping duties ranging from 12% up to 119%, which had the effect of limiting the participation of these countries in the domestic market. In 2010, we joined together with a coalition of domestic PC strand producers and filed petitions with the DOC alleging that imports of PC strand from China were being dumped or sold in the U.S. at a price that was lower than fair value and that subsidies were being provided to Chinese PC strand producers by the Chinese government, both of which had injured the domestic PC strand industry. The DOC ruled in our favor and imposed final countervailing duty margins ranging from 9% to 46% and anti-dumping margins ranging from 43% to 194%, which had the effect of limiting the continued participation of Chinese producers in the domestic market. In 2020, we joined two other domestic PC strand producers and filed anti-dumping petitions against Argentina, Columbia, Egypt, Indonesia, Italy, Malaysia, Netherlands, Saudi Arabia, South Africa, Spain, Taiwan, Tunisia, Turkey, Ukraine and the United Arab Emirates. In January 2021, with respect to 8 countries, and in April 2021, with respect to 7 countries, the DOC ruled in our favor and imposed anti-dumping duties ranging from 4% to 194%, which had the effect of limiting the participation of these countries in the domestic market. Additionally, in 2020, we and four other domestic producers of SWWR filed anti-dumping petitions against Mexico. In July 2021, the DOC ruled in our favor and imposed final countervailing duty margins ranging from 23% to 110%, which had the effect of limiting the continued participation of Mexican producers in the domestic market.\nQuality and service expectations of customers have risen substantially over the years and are key factors that impact their selection of suppliers. Technology has become a critical competitive factor from the standpoint of manufacturing costs, quality and customer service capabilities. In view of our strong market positions, broad product offering and national footprint, technologically advanced manufacturing facilities, low-cost production capabilities, sophisticated information systems and financial strength and flexibility, we believe that we are well-positioned to compete favorably with other producers of our concrete reinforcing products.\nHuman Capital\nWe value all our employees and their important role in the long-term success of the company. Our human capital strategy is centered around four key areas: Safe Operations, Performance Based Compensation, Equal Opportunity and Hiring and Retention. As of October 1, 2022, we had 964 employees, none of which were represented by labor unions. In the event of production disruptions, we believe that our contingency plans would enable us to continue serving our customers, although there can be no assurances that a work slowdown or stoppage would not adversely impact our operating costs and financial results.\nSafe Operations\nOur employees are extensively trained in a formal process of risk assessment, risk reduction and hazard elimination and empowered with the authority to stop equipment or tasks until work can be safely accomplished. Safe Operations with Zero Harm, our internal safety philosophy, is a key part of our ongoing employee training and operations. Zero Harm is identifying and managing risk to avoid injuries, illness or other negative impacts experienced by employees, the community, customers, property, the environment and shareholders. We monitor our safety performance through a key range of leading and lagging measures of safety.\nLeading Indicator Measures:\nLagging Indicator Measures:\n● Hazard management process training\n● Leadership engagement\n● Employee involvement\n● Rolling 12-month Incident Recordable Rate\n● Lost Time Rate\n● Severity Rate - Days Away, Restricted, and Transferred (DART)\nPerformance Based Compensation\nOur production and skilled trades team members earn pay increases through our Pay for Skills program and share in productivity pay through our Team Share incentive program. Our salaried team members also have a compensation structure that rewards individual performance in addition to company performance. The Team Share incentive program is driven by variables that are controllable at the plant level. We believe a compensation structure, which rewards both individual initiative and team accomplishments, leads to higher levels of performance.\nEqual Opportunity\nOur business depends on talented individuals who bring diverse skills, experiences and backgrounds. We believe in a collaborative workplace that is based on the fundamentals of dignity, respect, equality and opportunity for all and encourage transparency and access to leadership through our Open-Door Policy, Code of Business Conduct (including Whistleblower Hotline), Equal Opportunity Policy, Harassment Policy and Mission and Values. Our performance and succession development process includes all employees. We have many team members in key leadership roles who started in entry-level roles and have grown in their careers by partnering with us in their development plans.\nHiring and Retention\nOur performance relies on people who are developed and empowered to achieve results. We are improving the future of our company by identifying, developing and retaining talent that reflects our corporate philosophy. Our goal is to create a positive and engaging work environment that meets evolving employee needs in areas like flexible work schedules beyond the traditional full-time work schedule (such as part-time, weekend only, shared shift and other flexible approaches that attract a broader candidate pool). In addition, we are involved in many outreach programs in our communities to provide opportunities to diverse talent sources that may otherwise be overlooked or face barriers to equal opportunity.\nProduct Warranties\nOur products are used in applications that are subject to inherent risks, including performance deficiencies, personal injury, property damage, environmental contamination or loss of production. We warrant our products to meet certain specifications. Although actual or claimed deficiencies from these specifications may give rise to claims, we do not maintain a reserve for warranties as the historical claims have been immaterial. We maintain product liability insurance coverage to minimize our exposure to such risks.\nEnvironmental Matters\nWe believe that we are in compliance in all material respects with applicable environmental laws and regulations. We have experienced no material difficulties in complying with legislative or regulatory standards and believe that these standards have not materially impacted our financial position or results of operations. Although our future compliance with additional environmental requirements could necessitate capital outlays, we do not believe these expenditures would ultimately have a material adverse effect on our financial position or results of operations. We do not expect to incur material capital expenditures for environmental control facilities during fiscal 2023.\nAvailable Information\nOur annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to these reports are available at no cost on our website at https://investor.insteel.com and the SECs website at www.sec.gov as soon as reasonably practicable after we file these reports with the SEC. The information available on our website and the SECs website is not incorporated into this report or any of our filings with the SEC. Item 1A. Risk Factors\nAn investment in our common stock involves risks and uncertainties. You should carefully consider the following risk factors, in addition to the other information contained in this annual report on Form 10-K, before deciding whether an investment in our common stock is suitable for you. The risk factors described below are not the only ones we face. There may be other risks and uncertainties that are currently unknown to us or that we currently consider to be immaterial that could adversely affect our business, results of operations, financial condition and cash flows.\nIndustry Specific Risks\nOur business is cyclical and can be negatively impacted by prolonged economic downturns or tightening in the financial markets that reduce the level of construction activity and demand for our products.\nDemand for our products is cyclical in nature and sensitive to changes in the economy and in the financial markets. Our products are sold primarily to manufacturers of concrete products that are used for a broad range of nonresidential and residential construction applications. Demand for our products is driven by the level of construction activity, which tends to be correlated with conditions in the overall economy as well as other factors beyond our control. Tightening in the financial markets could adversely impact demand for our products by reducing the availability of financing to our customers and the construction industry as a whole and increasing the risk of payment defaults on our accounts receivable. Future prolonged periods of economic weakness or reduced availability of financing could have a material adverse impact on our business, results of operations, financial condition and cash flows.\nOur business can be negatively impacted by reductions in the amount and duration of government funding for infrastructure projects that reduce the level of construction activity and demand for our products.\nCertain of our products are used in the construction of highways, bridges and other infrastructure projects that are funded by federal, state and local governments. Reductions in the amount of funding for such projects or the period for which it is provided could have a material adverse impact on our business, results of operations, financial condition and cash flows.\nForeign competition could adversely impact our financial results.\nCertain of our PC strand and SWWR markets are subject to foreign import competition on an ongoing basis. If we are unable to purchase raw materials and achieve manufacturing costs that are competitive with those of foreign producers, or if the margin and return requirements of foreign producers are substantially lower, our market share and profit margins could be negatively impacted. In response to illegally traded import competition from offshore PC strand and SWWR suppliers, we have pursued trade cases, when necessary, as a means of ensuring that foreign producers were complying with the applicable trade laws and regulations. Such actions may be costly and may not be successful. Trade law enforcement is critical to our ability to maintain our competitive position against foreign PC strand and SWWR producers that engage in unlawful trade practices.\nOur financial results can be negatively impacted by the volatility in the cost and availability of our primary raw material, hot-rolled carbon steel wire rod.\nThe primary raw material used to manufacture our products is hot-rolled carbon steel wire rod, which we purchase from both domestic and foreign suppliers. We do not use derivative commodity instruments to hedge our exposure to changes in the price of wire rod as such instruments are currently unavailable in the financial markets. Prices for wire rod have become increasingly volatile in recent years driven by the higher degree of variability in raw material costs for rod producers, changes in trade policy and the tightening of domestic supply. In response, wire rod producers have resorted to increasing the frequency of price adjustments, typically on a monthly basis, as well as unilaterally changing the terms of prior commitments.\nAlthough changes in our wire rod costs and selling prices tend to be correlated, we may be unable to fully recover increased rod costs during weaker market environments, which would reduce our earnings and cash flows. Additionally, when raw material costs decline, our financial results would be negatively impacted if the selling prices for our products decrease to an even greater extent and if we are consuming higher cost material from inventory.\nOur financial results can also be significantly impacted if raw material supplies are inadequate to satisfy our purchasing requirements. For example, U.S. government trade policies and trade actions by domestic wire rod producers against other countries can significantly impact the availability and cost of imported wire rod. The imposition of tariffs, quotas or anti-dumping or countervailing duty margins by the U.S. government against exporting countries can have the effect of reducing or eliminating their competitiveness and participation in the domestic market. If we were unable to obtain adequate and timely delivery of our raw material requirements, we may be unable to manufacture sufficient quantities of our products or operate our manufacturing facilities in an efficient manner, which could result in lost sales and higher operating costs. Because tight market conditions typically affect the entire industry, during past periods of short raw material supply, margins and profitability have been favorably impacted due to curtailed availability of PC strand and WWR that supported higher average selling prices. There is no assurance that future short supply conditions in raw material markets would result in similar outcomes, however.\nDemand for our products is highly variable and difficult to forecast due to our minimal backlog and unanticipated changes that can occur in customer order patterns or inventory levels.\nDemand for our products is highly variable. The short lead times for customer orders and minimal backlog that characterize our business make it difficult to forecast the future level of demand for our products. In some cases, unanticipated softening in demand can be exacerbated by inventory rebalancing measures pursued by our customers, which may cause significant fluctuations in our sales, profitability and cash flows.\nOperational Risks\nOur manufacturing facilities are subject to unexpected equipment failures, operational interruptions and casualty losses.\nOur manufacturing facilities are subject to risks that may limit our ability to manufacture and sell our products, including unexpected equipment failures, operational interruptions and catastrophic losses due to other unanticipated events such as fires, explosions, accidents, adverse weather conditions and transportation interruptions. Any such equipment failures or events can subject us to plant shutdowns and periods of reduced production or unexpected downtime. Furthermore, the resolution of certain operational interruptions may require significant capital expenditures. Although our insurance coverage could offset the losses or expenditures relating to some of these events, our results of operations and cash flows would be negatively impacted to the extent that such claims were not covered or only partially covered by our insurance.\nOur financial results could be adversely impacted by the escalation of our operating costs.\nConsistent with the experience of other employers, our labor, medical and workers compensation costs have increased substantially in recent years and are expected to continue to rise. If this trend continues, the cost of labor and to provide healthcare and other benefits to our employees could increase, adversely impacting profitability. As the labor market recovers from the effects of the COVID-19 pandemic, availability of qualified employees and competition for them has escalated, which has increased costs associated with attracting and retaining employees. We cannot be certain that we will be able to maintain an adequately skilled labor force necessary to operate efficiently or that our labor costs will not increase as a result of a shortage in the availability of skilled employees. Additionally, employee turnover could result in lost time due to inefficiencies and the need for additional training, which could impact our operating results. Changes to healthcare regulations may also increase the cost of providing such benefits to our employees. We cannot predict the ultimate content, timing, or effect of any healthcare reform legislation or the impact of potential legislation or related proposals and policies on our results. Any significant increases in the costs attributable to our self-insured health and workers compensation plans could adversely impact our business, results of operations, financial condition and cash flows.\nIn addition, increasing transaction prices for freight, natural gas, electricity, fuel and consumables would adversely affect our manufacturing and distribution costs. For most of our business, we incur the transportation costs associated with the delivery of products to our customers. Although we have previously implemented numerous measures to offset the impact of increases in these costs, there can be no assurance that such actions will be effective. If we are unable to pass these additional costs through by raising our selling prices, our financial results could be adversely impacted.\nOur business and operations are subject to risks related to climate change.\nThe long-term effects of global climate change could present both physical risks and transition risks (such as regulatory or technology changes), which are expected to be widespread and unpredictable. These changes could over time affect, for example, the availability and cost of raw materials, commodities and energy (including utilities), which in turn may impact our ability to procure goods or services required for the operation of our business at the quantities and levels we require. Additionally, we have facilities located in areas that may be impacted by the physical risks of climate change, and we face the risk of losses incurred as a result of physical damage to our facilities and inventory as well as business interruption caused by such events. Furthermore, periods of extended inclement weather or associated flooding may inhibit construction activity utilizing our products and delay shipments of our products to customers. We believe that adaptation strategies to accommodate rising sea levels and other climate related phenomena could stimulate demand for our products to the extent that reinforced concrete products are essential to managing surface waters.\nWe also use natural gas, diesel fuel, gasoline and electricity in our operations, all of which could face increased regulation as a result of climate change or other environmental concerns. Additionally, we may face increased costs to respond to future water laws and regulations, and operations in areas with limited water availability may be impacted if droughts become more frequent or severe. Any such events could have a material adverse effect on our costs or results of operations.\nFinancing Risks\nOur operations are subject to seasonal fluctuations that may impact our cash flows.\nOur shipments are typically lower in the first and second fiscal quarters due to the unfavorable impact of winter weather on construction activity during these periods and customer plant shutdowns associated with holidays. As a result, our cash flows may fluctuate from quarter to quarter due to these seasonal factors.\nOur capital resources may not be adequate to provide for our capital investment and maintenance expenditures if we were to experience a substantial downturn in our financial performance.\nOur operations are capital intensive and require substantial recurring expenditures for the routine maintenance of our equipment and facilities. Although we expect to finance our business requirements through internally generated funds or from borrowings under our $100 million revolving credit facility, we cannot provide any assurances these resources will be sufficient to support our business. A material adverse change in our operations or financial condition could limit our ability to borrow funds under our credit facility, which could further adversely impact our liquidity and financial condition. Any significant future acquisitions could require additional financing from external sources that may not be available on favorable terms, which could adversely impact our growth, operations, financial condition and results of operations.\nLegal and Regulatory Risks\nChanges in environmental compliance and remediation requirements could result in substantial increases in our capital investments and operating costs.\nOur business is subject to numerous federal, state and local laws and regulations pertaining to the protection of the environment that could require substantial increases in capital investments and operating costs. These laws and regulations, which are constantly evolving, are becoming increasingly stringent, and the ultimate impact of compliance is not always clearly known or determinable because regulations under some of these laws have not yet been promulgated or are undergoing revision. Legislation and increased regulation regarding climate change, including mandatory reductions in energy consumption or emissions of greenhouse gases, could impose significant costs on us, including costs related to energy requirements, capital equipment, environmental monitoring and reporting and other costs to comply with such regulations.\nGeneral Risks\nOur business, results of operations, financial condition, cash flows and stock price can be adversely affected by pandemics, epidemics or other public health emergencies, such as the ongoing COVID-19 pandemic.\nThe COVID-19 pandemic and any preventive or protective actions taken by governmental authorities may have a material adverse effect on our operations, supply chain, customers and transportation networks, including business shutdowns or disruptions. While the U.S. economy has experienced a recovery from the conditions experienced at the onset of the COVID-19 pandemic, the emergence of new variants of COVID-19, labor shortages, supply chain disruptions, new or proposed legislation related to governmental spending, inflation and increases in interest rates have impacted, and will continue to impact, economic growth. Even after the COVID-19 pandemic has subsided, we may experience material adverse impacts to our business due to any resulting economic recession. We continue to closely monitor the impact of the COVID-19 pandemic on all aspects of our business and the potential effect on our financial position, results of operations and cash flows. The situation remains dynamic, and the ultimate duration and impact on our business are not known at this time.\nOur stock price can be volatile, often in connection with matters beyond our control.\nEquity markets in the U.S. have been increasingly volatile in recent years. During fiscal 2022, our common stock traded as high as $47.70 and as low as $26.02. There are numerous factors that could cause the price of our common stock to fluctuate significantly, including: variations in our financial results; changes in our business outlook and expectations for the construction industry; changes in market valuations of companies in our industry; and announcements by us, our competitors or industry participants that may be perceived to impact our financial results.\nWe are increasingly dependent on information technology systems that are susceptible to certain risks, including cybersecurity breaches and data leaks, which could adversely impact our business.\nOur increasing reliance on technology systems and infrastructure heightens our potential vulnerability to system failure and malfunction, breakdowns due to natural disasters, human error, unauthorized access, power loss and other unforeseen events. Data privacy breaches by employees and others with or without authorized access to our systems poses risks that sensitive data may be permanently lost or leaked to the public or other unauthorized persons. With the growing use and rapid evolution of technology, not limited to cloud-based computing and mobile devices, there are additional risks of unintentional data leaks. There is also the risk of the theft of confidential information, intentional vandalism, industrial espionage and a variety of cyber-attacks that could compromise our internal technology system and infrastructure or result in data leaks in-house or at our third-party providers and business partners. Failures of technology or related systems, or an improper release of confidential information, could adversely impact our business or subject us to unexpected liabilities.\nOur financial results could be adversely impacted by the impairment of goodwill.\nOur balance sheet includes intangible assets, including goodwill and other separately identifiable assets related to prior acquisitions, and we may acquire additional intangible assets in connection with future acquisitions. We are required to review goodwill for impairment on an annual basis or more frequently if certain indicators of permanent impairment arise such as, among other things, a decline in our stock price and market capitalization or a reduction in our projected operating results and cash flows. If our review indicates that goodwill has been impaired, the impaired portion would have to be written-off during that period which could adversely impact our business and financial results. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nOur corporate headquarters and IWPs sales and administrative offices are located in Mount Airy, North Carolina. We also have an engineering and administrative office located in Sugarloaf, Pennsylvania. As of October 1, 2022, we operated ten manufacturing facilities located in Dayton, Texas; Gallatin, Tennessee; Hazleton, Pennsylvania; Hickman, Kentucky; Houston, Texas; Jacksonville, Florida; Kingman, Arizona; Mount Airy, North Carolina; Sanderson, Florida; and St. Joseph, Missouri.\nWe own all of our real estate except for the office in Sugarloaf, Pennsylvania, which we lease. We believe that our properties are in good operating condition and that our machinery and equipment have been well maintained. We also believe that our manufacturing facilities are suitable for their intended purposes and have capacities adequate to satisfy the current and projected demand for our products. Item 3. Legal Proceedings.\nWe are involved in lawsuits, claims, investigations and proceedings, including commercial, environmental and employment matters, which arise in the ordinary course of business. We do not anticipate that the ultimate cost to resolve these matters will have a material adverse effect on our financial position, results of operations or cash flows. Item 4. Mine Safety Disclosures.\nNot applicable.\nInformation About Our Executive Officers\nOur executive officers are as follows:\nName\nAge\nPosition\nH. O. Woltz III\nPresident, Chief Executive Officer and Chairman of the Board\nMark A. Carano\nSenior Vice President, Chief Financial Officer and Treasurer\nJames F. Petelle\nVice President Administration, Secretary and Chief Legal Officer\nRichard T. Wagner\nSenior Vice President and Chief Operating Officer\nJames R. York\nSenior Vice President, Sourcing and Logistics\nH. O. Woltz III, 66, has served as Chief Executive Officer since 1991, as President since 1989 and has been employed by us and our subsidiaries in various capacities since 1978. He was named President and Chief Operating Officer in 1989. He served as our Vice President from 1988 to 1989 and as President of Rappahannock Wire Company, formerly a subsidiary of our Company, from 1981 to 1989. Mr. Woltz has been a Director since 1986 and also serves as President of Insteel Wire Products Company. Mr. Woltz served as President of Florida Wire and Cable, Inc., formerly a subsidiary of our Company, until its merger with Insteel Wire Products Company in 2002. Mr. Woltz has served as Chairman of the Board since 2009.\nMark A. Carano, 53, has served as Senior Vice President, Chief Financial Officer and Treasurer since October 2020 and as Vice President, Chief Financial Officer and Treasurer from May 2020 to October 2020. Prior to Insteel, Mr. Carano had been employed by Big River Steel, a privately-held manufacturer of steel products, having served as Chief Financial Officer since April 2019. Prior to Big River Steel, he served in various senior management finance roles with Babcock & Wilcox Enterprises from June 2013 to October 2018. Mr. Carano also has 14 years of combined investment banking experience with Bank of America, Merrill Lynch, Deutsche Bank and First Union Securities.\nJames F. Petelle, 72, has served as Vice President, Administration, Secretary and Chief Legal Officer since October 2020. He joined us in October 2006 and was elected Vice President and Assistant Secretary in November 2006 and Vice President, Administration and Secretary in January 2007. He was previously employed by Andrew Corporation, a publicly-held manufacturer of telecommunications infrastructure equipment, having served as Secretary from 1990 to May 2006, and Vice President - Law from 2000 to October 2006.\nRichard T. Wagner, 63, has served as Senior Vice President, Chief Operating Officer since October 2020 and as Vice President and General Manager of the Concrete Reinforcing Products Business Unit of our subsidiary, Insteel Wire Products Company, since 1998. He joined us in 1992 serving in various other management roles. From 1977 until 1992, Mr. Wagner served in various positions with Florida Wire and Cable, Inc., a manufacturer of PC strand and galvanized strand products, which was later acquired by us in 2000.\nJames R. York, 64, has served as Senior Vice President, Sourcing and Logistics since October 2020, and as Vice President, Sourcing and Logistics since joining us in 2018. Prior to Insteel, he served in various senior management roles with Leggett & Platt, a publicly-held manufacturer of diversified engineered products, from 2002 to 2018, including Group President-Rod and Wire Products, Unit President-Wire Products and Unit President-Specialty Products. Mr. York served in a range of leadership positions at Bekeart Corporation, a U.S. subsidiary of N.V. Bekeart A.S. of Belgium, from 1983 to 2002.\nPART II Item 5. Market for Registrants Common Equity, Related Shareholder Matters and Issuer Purchases of Equity Securities.\nOur common stock is listed on the New York Stock Exchange (NYSE) under the symbol IIIN and has traded on the NYSE since March 17, 2021. As of October 26, 2022, there were 467 shareholders of record.\nWe pay regular quarterly cash dividends and expect to continue to pay regular quarterly cash dividends in the foreseeable future, though each quarterly dividend payment is subject to review and approval by our Board of Directors. On November 16, 2021, our Board of Directors approved a one-time special cash dividend of $2.00 per share that was paid on December 17, 2021.\nIssuer Purchases of Equity Securities\nThe following table summarizes the repurchases of common stock during the quarter ended October 1, 2022:\n(In thousands except share and per share amounts)\nTotal Number of\nShares Purchased\nAverage Price\nPaid per Share\nTotal Number of\nShares Purchased as\nPart of Publicly\nAnnounced Plan or\nProgram\nMaximum Number (or\nApproximate Dollar Value) of\nShares That May Yet Be\nPurchased Under the Plan or\nProgram\nJuly 3, 2022 - August 6, 2022\n-\n-\n-\n$ 24,756 (1)\nAugust 7, 2022 - September 3, 2022\n25,763\n$ 29.26\n25,763\n24,002 (1)\nSeptember 4, 2022 - October 1, 2022\n15,943\n$ 28.20\n15,943\n23,552 (1)\n41,706\n41,706\n(1)\nUnder the $25.0 million share repurchase authorization announced on November 18, 2008, which continues in effect until terminated by the Board of Directors.\nAdditional information regarding our share repurchase authorization is discussed in Note 18 to our consolidated financial statements and incorporated herein by reference.\nStock Performance Graph\nThe graph below compares the cumulative total shareholder return on our common stock with the cumulative total return of the Russell 2000 Index and the S&P Building Products Index for the five years ended October 1, 2022. The graph and table assume that $100 was invested on September 30, 2017 in our common stock and in each of the two indices and the reinvestment of all dividends. Cumulative total shareholder returns for our common stock, the Russell 2000 Index and the S&P Building Products Index are based on our fiscal year.\nFiscal Year Ended\nSeptember 30,\nSeptember 29,\nSeptember 28,\nOctober 3,\nOctober 2,\nOctober 1,\nInsteel Industries, Inc.\n$ 100.00\n$ 142.87\n$ 82.93\n$ 76.42\n$ 168.12\n$ 120.44\nRussell 2000\n100.00\n115.24\n104.99\n105.40\n155.66\n119.08\nS&P Building Products\n100.00\n90.79\n107.05\n123.99\n179.62\n135.57 Item 6. Reserved. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe matters discussed in this section include forward-looking statements that are subject to numerous risks. You should carefully read the Cautionary Note Regarding Forward-Looking Statements and Risk Factors in this Form 10-K.\nOverview\nOur operations are entirely focused on the manufacture and marketing of concrete reinforcing products for the concrete construction industry. Our business strategy is focused on: (1) achieving leadership positions in our markets; (2) operating as the lowest cost producer in our industry; and (3) pursuing growth opportunities within our core businesses that further our penetration of the markets we currently serve or expand our footprint.\nOn March 16, 2020, we, through our wholly-owned subsidiary, IWP, purchased substantially all of the assets of STM for an adjusted purchase price of $19.4 million, which reflects certain post-closing adjustments. STM was a leading manufacturer of PC strand for concrete construction applications. We acquired, among other assets, STMs accounts receivable, inventories, production equipment and facility located in Summerville, South Carolina and assumed certain of its accounts payable and accrued liabilities. Subsequent to the acquisition, we elected to consolidate our PC strand operations with the closure of the Summerville facility.\nImpact of COVID-19\nDespite the significant disruption in the U.S. and global economies, including supply chain challenges and labor market obstacles, COVID-19 has had a limited impact on our operations to date. We continue to closely monitor the impact of the COVID-19 pandemic on all aspects of our business and the potential effect on our financial position, results of operations and cash flows.\nCritical Accounting Estimates\nOur consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States. Our discussion and analysis of our financial condition and results of operations are based on these consolidated financial statements. The preparation of our consolidated financial statements requires the application of these accounting principles in addition to certain estimates and judgments based on currently available information, actuarial estimates, historical results and other assumptions believed to be reasonable. These estimates, assumptions and judgments are affected by our application of accounting policies, which are discussed in Note 2, \"Summary of Significant Accounting Policies\", and elsewhere in the accompanying consolidated financial statements. Estimates are used for, but not limited to, determining the net carrying value of trade accounts receivable, inventories, recording self-insurance liabilities and other accrued liabilities. Actual results could differ from these estimates.\nAccounting estimates are considered critical if both of the following conditions are met: (1) the nature of the estimates or assumptions is material because of the levels of subjectivity and judgment needed to account for matters that are highly uncertain and susceptible to change and (2) the effect of the estimates and assumptions is material to the financial statements.\nWe have reviewed our accounting estimates, and none were deemed to be considered critical for the accounting periods presented.\nRecent Accounting Pronouncements.\nThe nature and impact of recent accounting pronouncements is discussed in Note 3 to our consolidated financial statements and incorporated herein by reference.\nResults of Operations\nThe following discussion and analysis of our financial condition and results of operations is for the year ended October 1, 2022 compared with the year ended October 2, 2021. Discussions of our financial condition and results of operations for the year ended October 2, 2021 compared to October 3, 2020 that have been omitted under this item can be found in Part II, Item 7 Managements Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the fiscal year ended October 2, 2021, which was filed with the SEC on October 27, 2021.\nThe table below presents a summary of our results of operations for fiscal 2022 and fiscal 2021.\nStatements of Operations - Selected Data\n(Dollars in thousands)\nYear Ended\nOctober 1,\nOctober 2,\nChange\nNet sales\n$ 826,832\n40.0 %\n$ 590,601\nGross profit\n197,310\n62.3 %\n121,548\nPercentage of net sales\n23.9 %\n20.6 %\nSelling, general and administrative expense\n$ 36,048\n11.3 %\n$ 32,388\nPercentage of net sales\n4.4 %\n5.5 %\nRestructuring (recoveries) charges, net\n$ (318 )\n(111.1% )\n$ 2,868\nEffective income tax rate\n22.7 %\n22.6 %\nNet earnings\n$ 125,011\n87.7 %\n$ 66,610\n2022 Compared with 2021\nNet Sales\nNet sales increased 40.0% to $826.8 million in 2022 from $590.6 million in 2021, reflecting a 51.9% increase in selling prices partially offset by a 7.8% decrease in shipments. The increase in average selling prices was driven by price increases implemented in the current year to recover the escalation in raw material costs. The decrease in shipments was due to tight supply conditions for raw materials during the first half of the current year followed by inventory management measures pursued by our customers and weakness in residential construction activity in the latter half of the year.\nGross Profit\nGross profit increased 62.3% to $197.3 million, or 23.9% of net sales, in 2022 from $121.5 million, or 20.6% of net sales, in 2021. The year-over-year increase was primarily due to higher spreads between average selling prices and raw material costs ($94.2 million) partially offset by higher manufacturing costs ($9.2 million) and a decrease in shipments ($9.2 million). The increase in spreads was driven by higher average selling prices ($282.0 million) partially offset by higher raw material costs ($181.9 million) and freight expense ($5.9 million).\nSelling, General and Administrative Expense\nSelling, general and administrative expense (SG&A expense) increased 11.3% to $36.0 million, or 4.4% of net sales, in 2022 from $32.4 million, or 5.5% of net sales, in 2021 primarily due to relative year-over-year changes in the cash surrender value of life insurance policies ($3.4 million), higher compensation ($948,000), travel ($423,000) and insurance ($265,000) expense partially offset by the lower legal ($1.8 million) and employee benefit ($321,000) expense. The cash surrender value of life insurance policies decreased $1.9 million in the current year compared with an increase of $1.5 million in the prior year due to the corresponding changes in the value of the underlying investments. The increase in compensation expense was largely driven by higher incentive and stock-based compensation expense. The decrease in legal expense was primarily related to costs associated with trade matters incurred in the prior year. The decrease in employee benefits expense was due to a net gain on the settlement of life insurance policies ($364,000) in the current year.\nRestructuring (Recoveries) Charges, Net\nNet restructuring recoveries of $318,000 were incurred in 2022 related to the closure of the Summerville, South Carolina facility, which had been acquired through the STM Acquisition, and the consolidation of our PC strand operations. Net restructuring recoveries in 2022 included a gain on sale of the Summerville facility ($622,000) partially offset by facility closure costs ($304,000). Net restructuring charges of $2.9 million were incurred in the prior year which included asset impairment charges ($1.4 million), facility closure costs ($1.0 million), equipment relocation costs ($423,000) and employee separation costs ($13,000).\nIncome Taxes\nOur effective income tax rate for 2022 increased to 22.7% from 22.6% in 2021 due to changes in book versus tax differences.\nNet Earnings\nNet earnings increased to $125.0 million ($6.37 per diluted share) in 2022 from $66.6 million ($3.41 per diluted share) in 2021 primarily due to the increase in gross profit and the change in net restructuring (recoveries) charges partially offset by higher SG&A expense.\nLiquidity and Capital Resources\nOverview\nOur sources of liquidity include cash and cash equivalents, cash generated by operating activities and borrowing availability provided under our $100.0 million revolving credit facility (the Credit Facility). Our principal capital requirements include funding working capital, capital expenditures, dividends and any share repurchases. As of October 1, 2022, our cash and cash equivalents totaled $48.3 million compared with $89.9 million as of October 2, 2021.\nWe believe that, in the absence of significant unanticipated cash demands, cash and cash equivalents, cash generated by operating activities and the borrowing availability provided under the Credit Facility will be sufficient to satisfy our expected requirements for working capital, capital expenditures, dividends and share repurchases, if any, in both the short- and long-term. We also expect to have access to the amounts available under our Credit Facility as required. However, should we experience future reductions in our operating cash flows due to weakening conditions in our construction end-markets and reduced demand from our customers, we may need to curtail capital and operating expenditures, delay or restrict share repurchases, cease dividend payments and/or realign our working capital requirements.\nShould we determine, at any time, that we require additional short-term liquidity, we would evaluate the alternative sources of financing that were potentially available to provide such funding. There can be no assurance that any such financing, if pursued, would be obtained, or if obtained, would be adequate or on terms acceptable to us. However, we believe that our strong balance sheet, flexible capital structure and borrowing capacity available to us under our Credit Facility position us to meet our anticipated liquidity requirements for the foreseeable future.\nSelected Liquidity and Capital Resources Data\n(Dollars in thousands)\nYear Ended\nOctober 1,\nOctober 2,\nNet cash provided by operating activities\n$ 5,670\n$ 69,878\nNet cash used for investing activities\n(6,039 )\n(17,805 )\nNet cash used for financing activities\n(41,199 )\n(30,877 )\nCash and cash equivalents\n48,316\n89,884\nNet working capital\n272,736\n178,057\nTotal debt\n-\n-\nPercentage of total capital\n-\n-\nShareholders' equity\n$ 389,744\n$ 302,038\nPercentage of total capital\n%\n%\nTotal capital (total debt + shareholders' equity)\n$ 389,744\n$ 302,038\nOperating Activities\nOperating activities provided $5.7 million of cash in 2022 primarily from net earnings adjusted for non-cash items partially offset by an increase in working capital. Working capital used $134.3 million of cash due to a $118.6 million increase in inventories, a $13.7 million increase in accounts receivable and a $2.0 million decrease in accounts payable and accrued expenses. The increase in inventories was the result of higher raw material purchases during 2022 together with higher average unit costs. The increase in accounts receivable was due to higher average selling prices. The decrease in accounts payable and accrued expenses was primarily related to lower raw material purchases near the end of the current year.\nOperating activities provided $69.9 million of cash in 2021 primarily from net earnings adjusted for non-cash items partially offset by an increase in working capital. Working capital used $12.3 million of cash due to a $14.1 million increase in accounts receivable and a $10.1 million increase in inventories partially offset by an $11.9 million increase in accounts payable and accrued expenses. The increase in accounts receivable and inventories were due to the escalation in raw material costs and average selling prices during 2021. The increase in accounts payable and accrued expenses was primarily related to raw material purchases with higher unit costs near the end of the period and, to a lesser extent, increases in accrued salaries, wages and related expenses and income taxes.\nWe may elect to adjust our operating activities as there are changes in the conditions in our construction end-markets, which could materially impact our cash requirements. While a downturn in the level of construction activity affects sales to our customers, it generally reduces our working capital requirements.\nInvesting Activities\nInvesting activities used $6.0 million of cash in 2022 primarily due to capital expenditures ($15.9 million) partially offset by the receipt of proceeds from the sale of assets held for sale ($6.9 million), life insurance claims ($1.5 million) and a decrease in cash surrender value of life insurance policies ($1.4 million). Investing activities used $17.8 million of cash in 2021 primarily due to capital expenditures ($17.5 million) and an increase in the cash surrender value of life insurance policies ($0.4 million). Capital expenditures for both years focused on cost and productivity improvement initiatives in addition to recurring maintenance requirements. Capital expenditures are expected to total up to approximately $30.0 million in 2023, which include expenditures primarily to advance the growth of our engineered structural mesh business and to support cost and productivity improvement initiatives as well as recurring maintenance requirements. Our investing activities are largely discretionary, providing us with the ability to significantly curtail outlays should future business conditions warrant that such actions be taken.\nFinancing Activities\nFinancing activities used $41.2 million of cash in 2022 and $30.9 million of cash in 2021. In 2022, $41.2 million of cash was used for dividend payments (including a special cash dividend of $38.8 million, or $2.00 per share, and regular cash dividends totaling $2.4 million) and $1.2 million for the repurchase of common stock, which was partially offset by $1.7 million of proceeds from the exercise of stock options. In 2021, $31.3 million of cash was used for dividend payments (including a special cash dividend of $29.0 million, or $1.50 per share, and regular cash dividends totaling $2.3 million), which was partially offset by $1.1 million of proceeds from the exercise of stock options.\nCash Management\nOur cash is principally concentrated at one financial institution, which at times exceeds federally insured limits. We invest excess cash primarily in money market funds, which are highly liquid securities that bear minimal risk.\nCredit Facility\nWe have a Credit Facility that is used to supplement our operating cash flow and fund our working capital, capital expenditure, general corporate and growth requirements. In May 2019, we entered into a new credit agreement, which amended and restated in its entirety the previous agreement pertaining to the revolving credit facility that had been in effect since June 2010. The new credit agreement, among other changes, extended the maturity date of the Credit Facility from May 13, 2020 to May 15, 2024 and provided for an accordion feature whereby its size may be increased by up to $50.0 million, subject to our lenders approval. Advances under the Credit Facility are limited to the lesser of the revolving loan commitment amount (currently $100.0 million) or a borrowing base amount that is calculated based upon a percentage of eligible receivables and inventories. As of October 1, 2022, no borrowings were outstanding on the Credit Facility, $98.6 million of borrowing capacity was available and outstanding letters of credit totaled $1.4 million (see Note 8 to the consolidated financial statements). As of October 2, 2021, there were no borrowings outstanding on the Credit Facility.\nOff-Balance Sheet Arrangements\nWe do not have any material transactions, arrangements, obligations (including contingent obligations), or other relationships with unconsolidated entities or other persons, as defined by Item 303(a)(4) of Regulation S-K of the SEC, that have or are reasonably likely to have a material current or future impact on our financial condition, results of operations, liquidity, capital expenditures, capital resources or significant components of revenues or expenses.\nContractual Obligations\nIn addition to our discussion and analysis surrounding our liquidity and capital resources, our contractual obligations and commitments as of October 1, 2022, include:\n●\nRaw Material Purchase Commitments - See Note 12, Commitments and Contingencies, within our consolidated financial statements for further details concerning our non-cancelable raw material purchase commitments.\n●\nSupplemental Employee Retirement Plan Obligations - See Note 11, Employee Benefit Plans, within our consolidated financial statements for further detail of our obligations and the timing of expected future payments under our supplemental employee retirement plan.\n●\nOperating Leases - See Note 13, Leases, within our consolidated financial statements for further detail of our obligations and the timing of expected future payments, including a five-year maturity schedule.\n●\nDebt Obligations and Interest Payments - See Note 8, Long-Term Debt, within our consolidated financial statements for further detail of our debt and the timing of expected future principal and interest payments. As of October 1, 2022, there were no borrowings outstanding.\n●\nCapital Expenditures - As of October 1, 2022, we had contractual commitments for capital expenditures of $31.9 million.\nImpact of Inflation\nWe are subject to inflationary risks arising from fluctuations in the market prices for our primary raw material, hot-rolled carbon steel wire rod, and, to a much lesser extent, labor, freight, energy and other consumables that are used in our manufacturing processes. We have generally been able to adjust our selling prices to pass through increases in these costs or offset them through various cost reduction and productivity improvement initiatives. However, our ability to raise our selling prices depends on market conditions and competitive dynamics, and there may be periods during which we are unable to fully recover increases in our costs.\nDuring 2022 and 2021, we were successful in implementing price increases sufficient to recover the escalation in our raw material costs that occurred over the course of each year. The timing and magnitude of any future increases in raw material costs and the impact on selling prices for our products is uncertain at this time.\nOutlook\nLooking ahead to fiscal 2023, we are optimistic about demand in both our private and public nonresidential construction markets. Backlogs across our customer base remain solid and widely monitored leading market indicators in private nonresidential construction point to continued expansion. Public nonresidential construction markets should benefit from incremental demand from both the strong financial position of state budgets and funding by the Infrastructure Investment and Jobs Act. Weakness in the residential construction market and heightened uncertainty regarding the future direction of the overall economy are areas we are closely monitoring, but we believe our strong balance sheet and flexible operating model position us to navigate challenges we may encounter.\nRegardless of the market dynamics, we continue to focus on those factors we control: closely managing and controlling our expenses; aligning our production schedules with demand in a proactive manner as there are changes in market conditions to minimize our operating costs; pursuing further improvements in the productivity and effectiveness of all our manufacturing, selling and administrative activities: and furthering our human capital strategy. We also expect gradually increasing contributions from the substantial investments we have made in our facilities in the form of reduced operating costs and additional capacity to support future growth. Finally, we will continue to pursue acquisitions opportunistically in our existing businesses that expand our penetration of markets we currently serve or expand our footprint.\nThe statements contained in this section are forward-looking statements. See Cautionary Note Regarding Forward-Looking Statements and Risk Factors. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nOur cash flows and earnings are subject to fluctuations resulting from changes in commodity prices, interest rates and foreign exchange rates. We manage our exposure to these market risks through internally established policies and procedures and, when appropriate, through the use of derivative financial instruments. We do not use financial instruments for trading purposes and are not a party to any leveraged derivatives. We monitor our underlying market risk exposures on an ongoing basis and believe we can modify or adapt our hedging strategies as necessary.\nCommodity Prices\nWe are subject to significant fluctuations in the cost and availability of our primary raw material, hot-rolled carbon steel wire rod, which we purchase from both domestic and foreign suppliers. We negotiate quantities and pricing for both domestic and foreign wire rod purchases for varying periods (most recently monthly for domestic suppliers), depending upon market conditions, to manage our exposure to price fluctuations and to ensure adequate availability of material consistent with our requirements. We do not use derivative commodity instruments to hedge our exposure to changes in prices as such instruments are not currently available for wire rod. Our ability to acquire wire rod from foreign sources on favorable terms is impacted by fluctuations in strength of home markets, foreign currency exchange rates, foreign taxes, duties, tariffs, quotas and other trade actions. Although changes in our wire rod costs and selling prices tend to be correlated, in weaker market environments, we may be unable to fully recover increased wire rod costs, which would reduce our earnings and cash flows. Additionally, when raw material costs decline, our financial results may be negatively impacted if the selling prices for our products decrease to an even greater extent and if we are consuming higher cost material from inventory. Based on our 2022 shipments and average wire rod cost reflected in cost of sales, a 10% increase in the price of wire rod would have resulted in a $48.5 million decrease in our annual pre-tax earnings (assuming there was not a corresponding change in our selling prices).\nInterest Rates\nAlthough we did not have any balances outstanding on our Credit Facility as of October 1, 2022, future borrowings under the facility are subject to a variable rate of interest and are sensitive to changes in interest rates.\nForeign Exchange Exposure\nWe have not typically hedged foreign currency exposures related to transactions denominated in currencies other than U.S. dollars, as such transactions have not been material historically. We will occasionally hedge firm commitments for certain equipment purchases that are denominated in foreign currencies. The decision to hedge any such transactions is made by us on a case-by-case basis. There were no forward contracts outstanding as of October 1, 2022. During 2022, a 10% increase or decrease in the value of the U.S. dollar relative to foreign currencies to which we are typically exposed would not have had a material impact on our financial position, results of operations or cash flows. Item 8. Financial Statements and Supplementary Data.\nFinancial Statements\nConsolidated Statements of Operations for the years ended October 1, 2022, October 2, 2021 and October 3, 2020\nConsolidated Statements of Comprehensive Income for the years ended October 1, 2022, October 2, 2021 and October 3, 2020\nConsolidated Balance Sheets as of October 1, 2022 and October 2, 2021\nConsolidated Statements of Shareholders Equity for the years ended October 1, 2022, October 2, 2021 and October 3, 2020\nConsolidated Statements of Cash Flows for the years ended October 1, 2022, October 2, 2021 and October 3, 2020\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm - Consolidated Financial Statements (PCAOB ID Number 248)\nINSTEEL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share amounts)\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\nNet sales\n$ 826,832\n$ 590,601\n$ 472,618\nCost of sales\n629,522\n469,053\n416,831\nGross profit\n197,310\n121,548\n55,787\nSelling, general and administrative expense\n36,048\n32,388\n31,348\nRestructuring (recoveries) charges, net\n(318 )\n2,868\n1,695\nAcquisition costs\n-\n-\nOther expense (income), net\n(1,254 )\nInterest expense\nInterest income\n(326 )\n(21 )\n(473 )\nEarnings before income taxes\n161,727\n86,103\n24,170\nIncome taxes\n36,716\n19,493\n5,161\nNet earnings\n$ 125,011\n$ 66,610\n$ 19,009\nNet earnings per share:\nBasic\n$ 6.41\n$ 3.44\n$ 0.99\nDiluted\n6.37\n3.41\n0.98\nCash dividends declared\n2.12\n1.62\n0.12\nWeighted average shares outstanding:\nBasic\n19,517\n19,344\n19,278\nDiluted\n19,629\n19,534\n19,383\nSee accompanying notes to consolidated financial statements.\nINSTEEL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\nNet earnings\n$ 125,011\n$ 66,610\n$ 19,009\nAdjustment to defined benefit plan liability, net of income taxes of ($463), $154 and ($93), respectively\n1,465\n(486 )\nOther comprehensive income (loss)\n1,465\n(486 )\nComprehensive income\n$ 126,476\n$ 66,124\n$ 19,301\nSee accompanying notes to consolidated financial statements.\nINSTEEL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except per share amounts)\nOctober 1,\nOctober 2,\nAssets:\nCurrent assets:\nCash and cash equivalents\n$ 48,316\n$ 89,884\nAccounts receivable, net\n81,646\n67,917\nInventories\n197,654\n79,049\nOther current assets\n7,716\n10,056\nTotal current assets\n335,332\n246,906\nProperty, plant and equipment, net\n108,156\n105,624\nIntangibles, net\n6,847\n7,668\nGoodwill\n9,745\n9,745\nOther assets\n11,665\n20,767\nTotal assets\n$ 471,745\n$ 390,710\nLiabilities and shareholders equity:\nCurrent liabilities:\nAccounts payable\n$ 46,796\n$ 49,443\nAccrued expenses\n15,800\n19,406\nTotal current liabilities\n62,596\n68,849\nOther liabilities\n19,405\n19,823\nCommitments and contingencies\nShareholders equity:\nPreferred stock, no par value Authorized shares: 1,000 None issued\n-\n-\nCommon stock, $1 stated value Authorized shares: 50,000 Issued and outstanding shares: 2022, 19,478; 2021, 19,408\n19,478\n19,408\nAdditional paid-in capital\n81,997\n78,688\nRetained earnings\n289,246\n206,384\nAccumulated other comprehensive loss\n(977 )\n(2,442 )\nTotal shareholders equity\n389,744\n302,038\nTotal liabilities and shareholders equity\n$ 471,745\n$ 390,710\nSee accompanying notes to consolidated financial statements.\nINSTEEL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\n(In thousands)\nAccumulated\nAdditional\nOther\nTotal\nCommon Stock\nPaid-In\nRetained\nComprehensive\nShareholders'\nShares\nAmount\nCapital\nEarnings\nIncome (Loss)(1)\nEquity\nBalance at September 28, 2019\n19,261\n$ 19,261\n$ 74,632\n$ 154,372\n$ (2,248 )\n$ 246,017\nNet earnings\n19,009\n19,009\nOther comprehensive income(1)\nActivity within accumulated other comprehensive income (loss) is reported net of related income taxes: 2020 ($93), 2021 $154 and 2022 ($463)\nVesting of restricted stock units\n(43 )\n-\nCompensation expense associated with stock-based plans\n2,028\n2,028\nRestricted stock units and stock options surrendered for withholding taxes payable\n(230 )\n(230 )\nCash dividends declared\n(2,313 )\n(2,313 )\nBalance at October 3, 2020\n19,304\n19,304\n76,387\n171,068\n(1,956 )\n264,803\nNet earnings\n66,610\n66,610\nOther comprehensive loss(1)\n(486 )\n(486 )\nStock options exercised\n1,008\n1,082\nVesting of restricted stock units\n(30 )\n-\nCompensation expense associated with stock-based plans\n1,988\n1,988\nRestricted stock units and stock options surrendered for withholding taxes payable\n(665 )\n(665 )\nCash dividends declared\n(31,294 )\n(31,294 )\nBalance at October 2, 2021\n19,408\n19,408\n78,688\n206,384\n(2,442 )\n302,038\nNet earnings\n125,011\n125,011\nOther comprehensive income(1)\n1,465\n1,465\nStock options exercised\n1,578\n1,650\nVesting of restricted stock units\n(40 )\n-\nCompensation expense associated with stock-based plans\n2,429\n2,429\nRepurchases of common stock\n(42 )\n(42 )\n(175 )\n(987 )\n(1,204 )\nRestricted stock units and stock options surrendered for withholding taxes payable\n(483 )\n(483 )\nCash dividends declared\n(41,162 )\n(41,162 )\nBalance at October 1, 2022\n19,478\n$ 19,478\n$ 81,997\n$ 289,246\n$ (977 )\n$ 389,744\n(1)Activity within accumulated other comprehensive income (loss) is reported net of related income taxes: 2020 ($93), 2021 $154 and 2022 ($463).\nSee accompanying notes to consolidated financial statements.\nINSTEEL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\nCash Flows From Operating Activities:\nNet earnings\n$ 125,011\n$ 66,610\n$ 19,009\nAdjustments to reconcile net earnings to net cash provided by operating activities:\nDepreciation and amortization\n14,486\n14,521\n14,255\nAmortization of capitalized financing costs\nStock-based compensation expense\n2,429\n1,988\n2,028\nDeferred income taxes\n(118 )\n(424 )\nAsset impairment charges\n-\n1,415\n(Gain) loss on sale and disposition of property, plant and equipment and assets held for sale\n(480 )\n(1,114 )\nIncrease in cash surrender value of life insurance policies over premiums paid\n-\n(1,533 )\n(243 )\nGain from life insurance proceeds\n(364 )\n-\n(200 )\nNet changes in assets and liabilities (net of assets and liabilities acquired):\nAccounts receivable, net\n(13,729 )\n(14,100 )\n(5,806 )\nInventories\n(118,605 )\n(10,086 )\n5,060\nAccounts payable and accrued expenses\n(1,964 )\n11,891\n20,159\nOther changes\n(1,506 )\n(900 )\n3,091\nTotal adjustments\n(119,341 )\n3,268\n37,215\nNet cash provided by operating activities\n5,670\n69,878\n56,224\nCash Flows From Investing Activities:\nAcquisition of business\n-\n-\n(18,356 )\nCapital expenditures\n(15,900 )\n(17,500 )\n(7,114 )\nProceeds from sale of property, plant and equipment\n-\n-\nProceeds from surrender of life insurance policies\nDecrease (increase) in cash surrender value of life insurance policies\n1,361\n(416 )\n(390 )\nProceeds from sale of assets held for sale\n6,934\n2,186\nProceeds from life insurance claims\n1,456\n-\nNet cash used for investing activities\n(6,039 )\n(17,805 )\n(23,174 )\nCash Flows From Financing Activities:\nProceeds from long-term debt\nPrincipal payments on long-term debt\n(266 )\n(297 )\n(322 )\nCash dividends paid\n(41,162 )\n(31,294 )\n(2,313 )\nCash received from exercise of stock options\n1,650\n1,082\n-\nRepurchases of common stock\n(1,204 )\n-\n-\nPayment of employee tax withholdings related to net share transactions\n(483 )\n(665 )\n(230 )\nNet cash used for financing activities\n(41,199 )\n(30,877 )\n(2,543 )\nNet (decrease) increase in cash and cash equivalents\n(41,568 )\n21,196\n30,507\nCash and cash equivalents at beginning of period\n89,884\n68,688\n38,181\nCash and cash equivalents at end of period\n$ 48,316\n$ 89,884\n$ 68,688\nSupplemental Disclosures of Cash Flow Information:\nCash paid during the period for:\nIncome taxes, net\n$ 41,483\n$ 16,799\n$ 1,919\nNon-cash investing and financing activities:\nPurchases of property, plant and equipment in accounts payable\nRestricted stock units and stock options surrendered for withholding taxes payable\nPayable related to holdback for business acquired\n-\n-\n1,000\nSee accompanying notes to consolidated financial statements.\nINSTEEL INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED OCTOBER 1, 2022, OCTOBER 2, 2021 AND OCTOBER 3, 2020\n(1) Description of Business\nInsteel Industries, Inc. (we, us, our, Insteel or the Company) is the nations largest manufacturer of steel wire reinforcing products for concrete construction applications. Insteel is the parent holding company for two wholly-owned subsidiaries, Insteel Wire Products Company (IWP), an operating subsidiary, and Intercontinental Metals Corporation, an inactive subsidiary. We manufacture and market prestressed concrete strand (PC strand) and welded wire reinforcement (WWR), including engineered structural mesh, concrete pipe reinforcement and standard welded wire reinforcement. Our products are primarily sold to manufacturers of concrete products and, to a lesser extent, distributors, rebar fabricators and contractors. We sell our products nationwide across the United States (U.S.) and, to a much lesser extent, into Canada, Mexico and Central and South America.\nOn March 16, 2020, we, through our wholly-owned subsidiary, IWP, purchased substantially all of the assets of Strand-Tech Manufacturing, Inc. (STM).\nWe have evaluated all subsequent events that occurred after the balance sheet date through the time of filing this Annual Report on Form 10-K and concluded there were no events or transactions during this period that required additional recognition or disclosure in our consolidated financial statements.\n(2) Summary of Significant Accounting Policies\nFiscal year. Our fiscal year is the 52 or 53 weeks ending on the Saturday closest to September 30. Fiscal years 2022 and 2021 were 52-week periods, and fiscal year 2020 was a 53-week period. All references to years relate to fiscal years rather than calendar years.\nPrinciples of consolidation. The consolidated financial statements include the accounts of Insteel and our subsidiaries. All significant intercompany transactions and accounts have been eliminated in consolidation.\nUse of estimates. The preparation of financial statements in conformity with accounting principles generally accepted in the United States (GAAP) requires us to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. There is no assurance that actual results will not differ from these estimates.\nCash equivalents. We consider all highly liquid investments purchased with original maturities of three months or less to be cash equivalents.\nConcentration of credit risk. Financial instruments that subject us to concentrations of credit risk consist principally of cash and cash equivalents and trade accounts receivable. Our cash is principally concentrated at one financial institution, which at times exceeds federally insured limits. We are exposed to credit risk in the event of default by institutions in which our cash and cash equivalents are held and by customers to the extent of the amounts recorded on the balance sheet. We invest excess cash primarily in money market funds, which are highly liquid securities.\nThe majority of our accounts receivable are due from customers that are located in the U.S. and are generally not secured by collateral depending upon the creditworthiness of the account. We provide an allowance for credit losses based upon our assessment of the credit risk of specific customers, historical trends and other information. We write off accounts receivable when they become uncollectible. There is no disproportionate concentration of credit risk.\nStock-based compensation. We account for stock-based compensation in accordance with the fair value recognition provisions of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 718, Compensation - Stock Compensation, which requires stock-based compensation expense to be recognized in net earnings based on the fair value of the award on the date of the grant. We estimate for forfeitures over the service period. We determine the fair value of stock options issued by using a Monte Carlo valuation model at the grant date, which considers a range of assumptions including the expected term, volatility, dividend yield and risk-free interest rate.\nEmployee benefit plan. We account for our supplemental retirement benefit agreements (each, a SRBA) in accordance with ASC Topic 715, Compensation - Retirement Benefits. Under the provisions of ASC Topic 715, we recognize net periodic pension cost and value liabilities based on certain actuarial assumptions, principally the assumed discount rate.\nThe discount rate we utilize for determining net periodic pension cost and the related benefit obligation for the SRBAs is based, in part, on current interest rates earned on long-term bonds that receive one of the two highest ratings assigned by recognized rating agencies. Our discount rate assumptions are adjusted as of each valuation date to reflect current interest rates on such long-term bonds. The discount rate is used to determine the actuarial present value of the benefit obligations as of the valuation date as well as the interest component of the net periodic pension cost for the following year. We currently expect net periodic pension cost for 2023 to be $864,000 for the SRBAs. Cash contributions to the SRBAs during 2023 are expected to be $560,000.\nThe assumed discount rate is reevaluated annually. A reduction in the assumed discount rate generally results in an actuarial loss, as the actuarially-determined present value of estimated future benefit payments will increase. Conversely, an increase in the assumed discount rate generally results in an actuarial gain. However, any actuarial gains generated in future periods reduce the negative amortization effect of any cumulative unamortized actuarial losses, while any actuarial losses generated in future periods reduce the favorable amortization effect of any cumulative unamortized actuarial gains.\nThe projected benefit obligations and net periodic pension cost for the SRBAs are based in part on expected increases in future compensation levels. Our assumption for the expected increase in future compensation levels is based upon our average historical experience and our intentions regarding future compensation increases, which generally approximates average long-term inflation rates. A 0.25% decrease in the assumed discount rate for our SRBAs would have increased our projected and accumulated benefit obligations as of October 1, 2022 by approximately $297,000 and $244,000, respectively, and our expected net periodic pension cost for 2023 by approximately $30,000.\nRevenue recognition. We recognize revenues when obligations under the terms of a contract with our customers are satisfied, which generally occurs when products are shipped and control is transferred. Revenue is measured as the amount of consideration expected to be received in exchange for our products.\nInventories. Inventories are valued at the lower of weighted average cost (which approximates computation on a first-in, first-out basis) and net realizable value. The valuation of inventory includes the costs for material, labor and manufacturing overhead.\nProperty, plant and equipment. Property, plant and equipment are recorded at cost or fair market value in the case of the assets acquired through acquisitions, or otherwise at reduced values to the extent there have been asset impairment write-downs. Expenditures for maintenance and repairs are charged directly to expense when incurred, while major improvements are capitalized. Depreciation is computed for financial reporting purposes principally by use of the straight-line method over the following estimated useful lives: machinery and equipment, 3 - 15 years; buildings, 10 - 30 years; and land improvements, 10 - 20 years. Depreciation expense was approximately $13.7 million in 2022, $13.6 million in 2021 and $13.2 million in 2020 and reflected in cost of sales and selling, general and administrative expense (SG&A expense) in the consolidated statements of operations. Capitalized software is amortized over the shorter of the estimated useful life or 5 years and reflected in SG&A expense. No interest costs were capitalized in 2022, 2021 and 2020.\nGoodwill. Goodwill is the excess of cost over the fair value of net assets of businesses acquired. Goodwill is not amortized but is tested annually for impairment and whenever events or circumstances change that would make it more likely than not that an impairment may have occurred. We perform our annual impairment analysis as of the first day of the fourth quarter each year. The evaluation of impairment involves comparing the current estimated fair value of the reporting unit to its recorded value, including goodwill. We perform a qualitative assessment to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying amount. It may be necessary to perform a quantitative analysis where a discounted cash flow model is used to determine the current estimated fair value of the reporting unit. Key assumptions used to determine the fair value of the reporting unit as part of our annual testing (and any required interim testing) include: (a) expected cash flows for the five-year period following the testing date; (b) an estimated terminal value using a terminal year growth rate based on the growth prospects of the reporting unit; (c) a discount rate based on our estimated after-tax weighted average cost of capital; and (d) a probability-weighted scenario approach by which varying cash flows are assigned to alternative scenarios based on their likelihood of occurrence. In developing these assumptions, we consider historical and anticipated future results, general economic and market conditions, the impact of planned business and operational strategies and all available information at the time the fair value of the reporting unit is estimated. Assumptions in estimating future cash flows are subject to a high degree of judgment and complexity. Changes in assumptions and estimates may affect the fair value of goodwill and could result in impairment charges in future periods. Based on the results of our impairment analysis, no goodwill impairment losses were recognized in the consolidated statements of operations for 2022, 2021 and 2020. Subsequent to the analysis, there have been no events or circumstances that indicate any potential impairment of goodwill.\nLong-lived assets. Long-lived assets include property, plant and equipment and identifiable intangible assets with definite useful lives. Finite-lived intangible assets are amortized over their estimated useful lives. Our intangible assets consist of customer relationships, developed technology and know-how, non-competition agreements and trade names and are being amortized on a straight-line basis over their finite useful lives (see Note 7 to the consolidated financial statements). We assess the impairment of long-lived assets whenever events or changes in circumstances indicate that the carrying value may not be fully recoverable. When we determine that the carrying value of such assets may not be recoverable, we measure recoverability based on the undiscounted cash flows expected to be generated by the related asset or asset group. If it is determined that an impairment loss has occurred, the loss is recognized in the period in which it is incurred and is calculated as the difference between the carrying value and the present value of estimated future net cash flows or comparable market values. There were no impairment losses in 2022. Impairment charges of $1.4 million and $0.3 million were recorded in 2021 and 2020, respectively, related to the impairment of long-lived assets resulting from the consolidation of our PC strand operations with the closure of our Summerville, South Carolina facility (see Note 5 to the consolidated financial statements).\nFair value of financial instruments. The carrying amounts for cash and cash equivalents, accounts receivable and accounts payable and accrued expenses approximate fair value because of their short maturities.\nIncome taxes. Income taxes are based on pretax financial accounting income. Deferred tax assets and liabilities are recognized for the expected tax consequences of temporary differences between the tax basis of assets and liabilities and their reported amounts. We assess the need to establish a valuation allowance against deferred tax assets to the extent we no longer believe it is more likely than not that the tax assets will be fully realized. We recognize uncertain tax positions when we have determined it is more likely than not that a tax position will be sustained upon examination. However, new information may become available, or applicable laws or regulations may change, thereby resulting in a favorable or unfavorable adjustment to amounts recorded.\nEarnings per share. Basic earnings per share (EPS) are computed by dividing earnings available to common shareholders by the weighted average number of shares of common stock outstanding during the period. Diluted EPS are computed by dividing earnings available to common shareholders by the weighted average number of shares of common stock and other dilutive equity securities outstanding during the period. Securities that have the effect of increasing EPS are considered to be antidilutive and are not included in the computation of diluted EPS.\n(3) Recent Accounting Pronouncements\nCurrent Adoptions\nIn December 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2019-12 \"Simplifying the Accounting for Income Taxes (Topic 740)\". ASU No. 2019-12 removes certain exceptions to the general principles in ASC 740 and also clarifies and amends existing guidance to provide for more consistent application. We adopted ASU No. 2019-12 in the first quarter of 2022. The adoption of this guidance did not have a material impact on our consolidated financial statements.\nFuture Adoptions\nIn March 2020, the FASB issued ASU No. 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting. ASU No. 2020-04 provides optional expedients and exceptions to account for contracts, hedging relationships and other transactions that reference LIBOR or another reference rate if certain criteria are met. ASU No. 2020-04 is effective March 12, 2020 through December 31, 2022. The adoption of this guidance will not have a material impact on our consolidated financial statements and disclosures.\n(4) Revenue Recognition\nWe recognize revenues when performance obligations under the terms of a contract with our customers are satisfied, which generally occurs when products are shipped and control is transferred. We enter into contracts that pertain to products, which are accounted for as separate performance obligations and typically one year or less in duration. We do not exercise significant judgment in determining the timing for the satisfaction of performance obligations or the transaction price. Revenue is measured as the amount of consideration expected to be received in exchange for our products. We present revenue net of amounts collected from customers for sales tax.\nVariable consideration that may affect the total transaction price, including contractual discounts, rebates, returns and credits are included in net sales. Estimates for variable consideration are based on historical experience, anticipated performance and management's judgment and are updated as of each reporting date. Shipping and related expenses associated with outbound freight are accounted for as fulfillment costs and included in cost of sales. We do not have significant financing components. Contract costs are not significant and are recognized as incurred.\nContract assets primarily relate to our rights to consideration for products that are delivered but not billed as of the reporting date and are reclassified to receivables when the customer is invoiced. Contract liabilities primarily relate to performance obligations that are to be satisfied in the future and arise when we collect from the customer in advance of shipments. Contract assets and liabilities were not material as of October 1, 2022 and October 2, 2021.\nAccounts receivable includes amounts billed and currently due from customers stated at their net estimated realizable value. Customer payment terms are generally 30 days. We maintain an allowance for doubtful accounts to provide for the estimated receivables that will not be collected, which is based upon our assessment of customer creditworthiness, historical payment experience and the age of outstanding receivables. Past-due trade receivable balances are written off when our collection efforts have been unsuccessful.\nSee Note 15 for the disaggregation of our net sales by product line and geography.\n(5) Restructuring\nOn March 16, 2020, we purchased substantially all of the assets of STM for an adjusted purchase price of $19.4 million, reflecting certain post-closing adjustments (the STM Acquisition). STM was a leading manufacturer of PC strand for concrete construction applications. We acquired, among other assets, STMs accounts receivable, inventories, production equipment and facility located in Summerville, South Carolina, and assumed certain of its accounts payable and accrued liabilities.\nIn connection with the STM acquisition, we elected to consolidate our PC strand operations through the closure of the Summerville facility and the redeployment of its equipment to our other three PC strand production facilities located in Gallatin, Tennessee; Houston, Texas; and Sanderson, Florida. Operations at the Summerville facility ceased during the third quarter of 2020, and the facility was sold in 2022. The consolidation of our PC strand operations was completed in 2022. Following is a summary of the restructuring activity during 2022, 2021 and 2020:\nEmployee\nEquipment\nFacility\nLoss (Gain)\n(In thousands)\nSeparation\nRelocation\nClosure\nAsset\non Sale of\nCosts\nCosts\nCosts\nImpairments\nEquipment\nTotal\nLiability as of October 2, 2021\n$ -\n$ -\n$\n$ -\n$ -\n$\nRestructuring charges (recoveries), net\n-\n-\n-\n(622 )\n(318 )\nCash payments\n-\n-\n(314 )\n-\n-\n(314 )\nNon-cash charges\n-\n-\n-\nLiability as of October 1, 2022\n$ -\n$ -\n$ -\n$ -\n$ -\n$ -\nLiability as of October 3, 2020\n$ -\n$\n$\n$ -\n$ -\n$\nRestructuring charges, net\n1,017\n1,415\n-\n2,868\nCash payments\n(13 )\n(443 )\n(1,158 )\n-\n-\n(1,614 )\nNon-cash charges\n-\n-\n(1,415 )\n-\n(1,415 )\nLiability as of October 2, 2021\n$ -\n$ -\n$\n$ -\n$ -\n$\nRestructuring charges, net\n$\n$\n$\n$\n$ (118 )\n$ 1,695\nCash payments\n(182 )\n(462 )\n(655 )\n-\n-\n(1,299 )\nNon-cash charges\n-\n-\n-\n(343 )\n(225 )\nLiability as of October 3, 2020\n$ -\n$\n$\n$ -\n$ -\n$\n(6) Fair Value Measurements\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The authoritative guidance for fair value measurements establishes a three-level fair value hierarchy that encourages an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The three levels of inputs used to measure fair value are as follows:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets and liabilities in active markets.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities, including certain pricing models, discounted cash flow methodologies and similar techniques that use significant unobservable inputs.\nAs of October 1, 2022 and October 2, 2021, we held financial assets that are required to be measured at fair value on a recurring basis, which are summarized below:\n(In thousands)\nTotal\nQuoted Prices\nin Active\nMarkets\n(Level 1)\nObservable\nInputs\n(Level 2)\nAs of October 1, 2022:\nCurrent assets:\nCash equivalents\n$ 48,045\n$ 48,045\n$ -\nOther assets:\nCash surrender value of life insurance policies\n9,938\n-\n9,938\nTotal\n$ 57,983\n$ 48,045\n$ 9,938\nAs of October 2, 2021:\nCurrent assets:\nCash equivalents\n$ 86,395\n$ 86,395\n$ -\nOther assets:\nCash surrender value of life insurance policies\n12,501\n-\n12,501\nTotal\n$ 98,896\n$ 86,395\n$ 12,501\nCash equivalents, which include all highly liquid investments with original maturities of three months or less, are classified as Level 1 of the fair value hierarchy. The carrying amount of our cash equivalents, which consist of investments in money market funds, approximates fair value due to their short maturities. Cash surrender value of life insurance policies are classified as Level 2. The fair value of the life insurance policies was determined by the underwriting insurance companys valuation models and represents the guaranteed value we would receive upon surrender of these policies as of the reporting date.\nAs of October 1, 2022 and October 2, 2021, we had no nonfinancial assets that are required to be measured at fair value on a nonrecurring basis. During 2021, we recognized $1.4 million of impairment charges related to the Summerville facility acquired in the STM Acquisition to reflect its fair value of $6.3 million as of October 2, 2021. The Summerville facility, which was sold in 2022, was classified as assets held for sale in other assets on our consolidated balance sheet as of October 2, 2021. The carrying amounts of accounts receivable, accounts payable and accrued expenses approximate fair value due to the short-term maturities of these financial instruments.\n(7) Intangible Assets\nThe primary components of our intangible assets and the related accumulated amortization are as follows:\n(In thousands)\nWeighted-\nAverage Useful\nLife (Years)\nGross\nAccumulated\nAmortization\nNet Book Value\nAs of October 1, 2022:\nCustomer relationships\n17.1\n$ 9,870\n$ (4,130 )\n$ 5,740\nDeveloped technology and know-how\n20.0\n1,800\n(729 )\n1,071\nNon-competition agreements\n5.0\n(364 )\n$ 12,070\n$ (5,223 )\n$ 6,847\nAs of October 2, 2021:\nCustomer relationships\n17.1\n$ 9,870\n$ (3,482 )\n$ 6,388\nDeveloped technology and know-how\n20.0\n1,800\n(639 )\n1,161\nNon-competition agreements\n5.0\n(284 )\nTrade name\n2.7\n(247 )\n$ 12,320\n$ (4,652 )\n$ 7,668\nAmortization expense for intangibles was $821,000 in 2022, $899,000 in 2021 and $1.0 million in 2020. Amortization expense for the next five years is $756,000 in 2023, $750,000 in 2024, $743,000 in 2025, $752,000 in 2026 and $480,000 in 2027.\n(8) Long-Term Debt\nRevolving Credit Facility. We have a $100.0 million revolving credit facility (the Credit Facility) that is used to supplement our operating cash flow and fund our working capital, capital expenditure, general corporate and growth requirements. In May 2019, we entered into a new credit agreement, which amended and restated in its entirety the previous agreement pertaining to the revolving credit facility that had been in effect since June 2010. The new credit agreement, among other changes, extended the maturity date of the Credit Facility from May 13, 2020 to May 15, 2024 and provided for an accordion feature whereby its size may be increased by up to $50.0 million, subject to our lenders approval. Advances under the Credit Facility are limited to the lesser of the revolving loan commitment amount (currently $100.0 million) or a borrowing base amount that is calculated based upon a percentage of eligible receivables and inventories. As of October 1, 2022, no borrowings were outstanding on the Credit Facility, $98.6 million of borrowing capacity was available and outstanding letters of credit totaled $1.4 million. As of October 2, 2021, there were no borrowings outstanding on the Credit Facility.\nInterest rates on the Credit Facility are based upon (1) an index rate that is established at the highest of the prime rate, 0.50% plus the federal funds rate or the LIBOR rate plus the excess of the then-applicable margin for LIBOR loans over the then-applicable margin for index rate loans, or (2) at our election, a LIBOR rate, plus in either case, an applicable interest rate margin. The applicable interest rate margins are adjusted on a quarterly basis based upon the amount of excess availability on the Credit Facility within the range of 0.25% to 0.50% for index rate loans and 1.25% to 1.50% for LIBOR loans. In addition, the applicable interest rate margins would be increased by 2.00% upon the occurrence of certain events of default provided for under the terms of the Credit Facility. Based on our excess availability as of October 1, 2022, the applicable interest rate margins on the Credit Facility were 0.25% for index rate loans and 1.25% for LIBOR loans.\nOur ability to borrow available amounts under the Credit Facility will be restricted or eliminated in the event of certain covenant breaches, events of default or if we are unable to make certain representations and warranties provided for under the terms of the Credit Facility. We are required to maintain a fixed charge coverage ratio of not less than 1.0 at the end of each fiscal quarter for the twelve-month period then ended when the amount of liquidity on the Credit Facility is less than $10.0 million. In addition, the terms of the Credit Facility restrict our ability to, among other things: engage in certain business combinations or divestitures; make investments in or loans to third parties, unless certain conditions are met with respect to such investments or loans; pay cash dividends or repurchase shares of our stock subject to certain minimum borrowing availability requirements; incur or assume indebtedness; issue securities; enter into certain transactions with our affiliates; or permit liens to encumber our property and assets. The terms of the Credit Facility also provide that an event of default will occur upon the occurrence of, among other things: defaults or breaches under the loan documents, subject in certain cases to cure periods; defaults or breaches by us or any of our subsidiaries under any agreement resulting in the acceleration of amounts above certain thresholds or payment defaults above certain thresholds; certain events of bankruptcy or insolvency; certain entries of judgment against us or any of our subsidiaries, which are not covered by insurance; or a change of control. As of October 1, 2022, we were in compliance with all of the financial and negative covenants under the Credit Facility, and there have not been any events of default.\nAmortization of capitalized financing costs associated with the Credit Facility was $65,000 in 2022, $65,000 in 2021 and $66,000 in 2020. We expect the amortization of capitalized financing costs to approximate the following amounts for the next five fiscal years:\nFiscal year\nIn thousands\n$\n(9) Stock-Based Compensation\nUnder our equity incentive plan, employees and directors may be granted stock options, restricted stock, restricted stock units and performance awards. Effective February 11, 2020, our shareholders approved an amendment to the 2015 Equity Incentive Plan of Insteel Industries, Inc. (the 2015 Plan), which authorizes up to an additional 750,000 shares of our common stock for future grants under the plan and expires on February 17, 2025. As of October 1, 2022, there were 555,000 shares of our common stock available for future grants under the 2015 Plan, which is our only active equity incentive plan.\nStock option awards. Under our equity incentive plan, employees and directors may be granted options to purchase shares of common stock at the fair market value on the date of the grant. Options granted under the plan generally vest over three years and expire ten years from the date of the grant. Compensation expense associated with stock options was $1.1 million in 2022, $860,000 in 2021 and $810,000 in 2020. As of October 1, 2022, there was $714,000 of unrecognized compensation cost related to unvested options which is expected to be recognized over a weighted average period of 2.11 years.\nThe fair value of each option award granted is estimated on the date of grant using a Monte Carlo valuation model. The weighted-average estimated fair values of stock options granted during 2022, 2021 and 2020 were $14.67, $14.47 and $8.05 per share, respectively, based on the following weighted-average assumptions:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\nExpected term (in years)\n4.61\n4.87\n4.81\nRisk-free interest rate\n3.03 %\n0.68 %\n0.95 %\nExpected volatility\n49.63 %\n50.34 %\n47.18 %\nExpected dividend yield\n0.34 %\n0.42 %\n0.59 %\nThe assumptions utilized in the Monte Carlo valuation model are evaluated and revised, as necessary, to reflect market conditions and actual historical experience. The expected term for options was based on the results of a Monte Carlo simulation model, using the models estimated fair value as an input to the Black-Scholes-Merton model, and then solving for the expected term. The risk-free interest rate for periods within the contractual life of the option was based on the U.S. Treasury yield curve in effect at the time of the grant. The expected volatility was derived using a term structure based on historical volatility and the volatility implied by exchange-traded options on our common stock. The dividend yield was calculated based on our annual dividend as of the option grant date.\nThe following table summarizes stock option activity:\nContractual\nAggregate\nOptions\nWeighted\nTerm - Weighted\nIntrinsic\nOutstanding\nAverage\nAverage\nValue\n(in thousands)\nExercise Price\n(in years)\n(in thousands)\nOutstanding at September 28, 2019\n$ 26.16\nGranted\n21.08\nForfeited\n(27 )\n25.88\nOutstanding at October 3, 2020\n24.90\nGranted\n34.76\nExercised\n(128 )\n21.17\n$ 2,212\nOutstanding at October 2, 2021\n27.72\nGranted\n35.32\nExercised\n(85 )\n24.23\n1,615\nForfeited\n(60 )\n29.29\nOutstanding at October 1, 2022\n30.00\n7.55\nVested and anticipated to vest in the future at October 1, 2022\n29.92\n7.51\nExercisable at October 1, 2022\n28.30\n6.4\nStock option exercises include net exercises for which the optionee received shares of common stock equal to the intrinsic value of the options (fair market value of common stock on the date of exercise less exercise price) reduced by any applicable withholding taxes.\nRestricted stock units. Restricted stock units (RSUs) granted under our equity incentive plan are valued based upon the fair market value on the date of the grant and provide for a dividend equivalent payment which is included in compensation expense. The vesting period for RSUs is generally one year from the date of the grant for RSUs granted to directors and three years from the date of the grant for RSUs granted to employees. RSUs do not have voting rights. RSU grants and compensation expense are as follows:\nOctober 1,\nOctober 2,\nOctober 3,\n(In thousands)\nRestricted stock unit grants:\nUnits\nMarket value\n$ 1,563\n$ 1,430\n$ 1,444\nCompensation expense\n1,365\n1,128\n1,218\nAs of October 1, 2022, there was $1.1 million of unrecognized compensation cost related to unvested RSUs which is expected to be recognized over a weighted average period of 1.73 years.\nThe following table summarizes RSU activity:\nWeighted\nAggregate\nRestricted\nAverage\nIntrinsic\nStock Units\nGrant Date\nValue\n(Unit amounts in thousands)\nOutstanding\nFair Value\n(in thousands)\nBalance, September 28, 2019\n$ 26.16\nGranted\n21.29\nForfeited\n(6 )\n25.49\nReleased\n(55 )\n27.07\n$ 1,127\nBalance, October 3, 2020\n23.07\nGranted\n33.22\nReleased\n(36 )\n29.21\n1,191\nBalance, October 2, 2021\n24.73\nGranted\n35.93\nForfeited\n(3 )\n22.09\nReleased\n(49 )\n22.17\n1,773\nBalance, October 1, 2022\n29.88\n(10) Income Taxes\nThe components of the provision for income taxes are as follows:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\n(Dollars in thousands)\nProvision for income taxes:\nCurrent:\nFederal\n$ 33,377\n$ 17,904\n$ 5,056\nState\n3,012\n1,707\n36,389\n19,611\n5,585\nDeferred:\nFederal\n(180 )\n(288 )\nState\n(300 )\n(136 )\n(118 )\n(424 )\nIncome taxes\n$ 36,716\n$ 19,493\n$ 5,161\nEffective income tax rate\n22.7 %\n22.6 %\n21.4 %\nThe reconciliation between income taxes computed at the federal statutory rate and the provision for income taxes is as follows:\nYear Ended\n(Dollars in thousands)\nOctober 1, 2022\nOctober 2, 2021\nOctober 3, 2020\nProvision for income taxes at federal statutory rate\n$ 33,963\n21.0 %\n$ 18,082\n21.0 %\n$ 5,076\n21.0 %\nState income taxes, net of federal tax benefit\n2,108\n1.3\n1,544\n1.8\n1.3\nStock-based compensation\n(255 )\n(0.2 )\n(253 )\n(0.3 )\n0.5\nValuation allowance\n(41 )\n(0.0 )\n(134 )\n(0.2 )\n(50 )\n(0.2 )\nNet operating loss carryback - CARES Act\n-\n-\n-\n-\n(223 )\n(0.9 )\nNondeductible expenses and other, net\n0.6\n0.3\n(89 )\n(0.3 )\nProvision for income taxes\n$ 36,716\n22.7 %\n$ 19,493\n22.6 %\n$ 5,161\n21.4 %\nThe components of deferred tax assets and liabilities are as follows:\nOctober 1,\nOctober 2,\n(In thousands)\nDeferred tax assets:\nDefined benefit plans\n$ 2,617\n$ 2,921\nAccrued expenses and asset reserves\n2,430\n2,280\nStock-based compensation\n1,176\n1,204\nOperating lease liability\nState net operating loss carryforwards and tax credits\nValuation allowance\n(32 )\n(73 )\nDeferred tax assets\n6,686\n6,773\nDeferred tax liabilities:\nPlant and equipment\n(11,546 )\n(10,901 )\nPrepaid insurance\n(1,279 )\n(1,374 )\nRight of use assets\n(352 )\n(385 )\nGoodwill\n(595 )\n(409 )\nDeferred tax liabilities\n(13,772 )\n(13,069 )\nNet deferred tax liability\n$ (7,086 )\n$ (6,296 )\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (\"CARES Act\") was signed into law. The CARES Act includes several changes impacting business, including, but not limited to, enhanced business interest deductibility, net operating loss (\"NOL\") carryback provisions, payroll tax deferral provisions and employee retention tax credits. We recorded a $223,000 tax benefit in 2020 resulting from the NOL carryback provisions of the CARES Act.\nAs of October 1, 2022 and October 2, 2021, we recorded deferred tax liabilities (net of valuation allowances) of $7.1 million and $6.3 million, respectively, in other liabilities on our consolidated balance sheet. We have $5.6 million of state NOLs that begin to expire in 2031, but principally expire between 2031 and 2037.\nThe realization of our deferred tax assets is entirely dependent upon our ability to generate future taxable income in applicable jurisdictions. GAAP requires that we periodically assess the need to establish a reserve against our deferred tax assets to the extent we no longer believe it is more likely than not that they will be fully realized. As of October 1, 2022, we recorded a valuation allowance of $32,000 pertaining to various state NOLs that were not expected to be utilized. The valuation allowance is subject to periodic review and adjustment based on changes in facts and circumstances and would be reduced should we utilize the state NOLs and tax credits against which an allowance had previously been provided or determine that such utilization was more likely than not. The $41,000 decrease in the valuation allowance during 2022 is primarily due to the utilization of state NOLs for which an allowance had been recorded together with a reduction in state apportionment rates.\nAs of October 1, 2022, we had no material, known tax exposures that required the establishment of contingency reserves for uncertain tax positions.\nWe classify interest and penalties related to unrecognized tax benefits as part of income tax expense. There were no interest and penalties related to unrecognized tax benefits incurred during 2022, 2021 and 2020.\nWe file U.S. federal income tax returns as well as state and local income tax returns in various jurisdictions. Federal and various state tax returns filed subsequent to 2017 remain subject to examination.\n(11) Employee Benefit Plans\nSupplemental retirement benefit plan. We have SRBAs with certain of our key employees (each, a Participant). Under the SRBAs, if the Participant remains in continuous service with us for a period of at least 30 years, we will pay the Participant a supplemental retirement benefit for the 15-year period following the Participants retirement equal to 50% of the Participants highest average annual base salary for five consecutive years in the 10-year period preceding the Participants retirement. If the Participant retires prior to the later of age 65 or the completion of 30 years of continuous service with us, but has completed at least 10 years of continuous service, the amount of the Participants supplemental retirement benefit will be reduced by 1/360th for each month short of 30 years that the Participant was employed by us.\nThe reconciliation of the projected benefit obligation, plan assets, funded status and amounts recognized for the SRBAs in our consolidated balance sheets is as follows:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\n(In thousands)\nChange in benefit obligation:\nBenefit obligation at beginning of year\n$ 12,888\n$ 11,610\n$ 11,278\nService cost\nInterest cost\nActuarial (gain) loss\n(1,650 )\n(91 )\nDistributions\n(205 )\n(205 )\n(249 )\nBenefit obligation at end of year\n$ 11,779\n$ 12,888\n$ 11,610\nChange in plan assets:\nActual employer contributions\n$\n$\n$\nActual distributions\n(205 )\n(205 )\n(249 )\nPlan assets at fair value at end of year\n$ -\n$ -\n$ -\nReconciliation of funded status to net amount recognized:\nFunded status\n$ (11,779 )\n$ (12,888 )\n$ (11,610 )\nNet amount recognized\n$ (11,779 )\n$ (12,888 )\n$ (11,610 )\nAmounts recognized in accumulated other comprehensive loss:\nUnrecognized net loss\n$ 1,285\n$ 3,213\n$ 2,574\nNet amount recognized\n$ 1,285\n$ 3,213\n$ 2,574\nOther changes in plan assets and benefit obligations recognized in other comprehensive income (loss):\nNet (gain) loss\n$ (1,650 )\n$\n$ (91 )\nAmortization of net loss\n(278 )\n(215 )\n(294 )\nTotal recognized in other comprehensive (loss) income\n$ (1,928 )\n$\n$ (385 )\nIn 2022, 2021 and 2020, the actuarial (gain) loss includes amounts resulting from changes in actuarial assumptions utilized to calculate our benefit plan obligation such as the discount rate, estimated future compensation levels and changes in plan participants.\nThe accumulated benefit obligation was $10.7 million and $11.7 million as of October 1, 2022 and October 2, 2021, respectively.\nNet periodic pension cost for the SRBAs includes the following components:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\n(In thousands)\nService cost\n$\n$\n$\nInterest cost\nAmortization of net loss\nNet periodic pension cost\n$ 1,024\n$\n$\nThe assumptions used in the valuation of the SRBAs are as follows:\nMeasurement Date\nOctober 1,\nOctober 2,\nOctober 3,\nAssumptions at year-end:\nDiscount rate\n4.50 %\n2.75 %\n2.75 %\nRate of increase in compensation levels\n3.00 %\n3.00 %\n3.00 %\nThe assumed discount rate is established as of our fiscal year-end measurement date. In establishing the discount rate, we review published market indices of high-quality debt securities, adjusted as appropriate for duration, and high-quality bond yield curves applicable to the expected benefit payments of the SRBAs. The SRBAs expected rate of increase in compensation levels is based on the anticipated increases in annual compensation.\nThe projected benefit payments under the SRBAs are as follows:\nFiscal year(s)\nIn thousands\n$\n-\n4,706\nRetirement savings plan. In 1996, we adopted the Retirement Savings Plan of Insteel Industries, Inc. (the Plan) to provide retirement benefits and stock ownership for our employees. The Plan is an amendment and restatement of our Employee Stock Ownership Plan. As allowed under Sections 401(a) and 401(k) of the Internal Revenue Code, the Plan provides for tax-deferred salary deductions for eligible employees.\nThe Plan allows for discretionary contributions to be made by us as determined by the Board of Directors, which are allocated among eligible participants based on their compensation relative to the total compensation of all participants. Employees are permitted to contribute up to 75% of their annual compensation to the Plan, limited to a maximum annual amount as set periodically by the Internal Revenue Code. We match employee contributions up to 100% of the first 1% and 50% of the next 5% of eligible compensation that is contributed by employees. Our contributions to the Plan were $1.7 million in 2022, $1.5 million in 2021 and $1.3 million in 2020.\nVoluntary Employee Beneficiary Associations (VEBA). We have a VEBA which allows both us and our employees to make contributions to pay for medical costs. Our contributions to the VEBA were $5.4 million in 2022, $6.4 million in 2021 and $6.0 million in 2020. We are primarily self-insured for our employees healthcare costs, carrying stop-loss insurance coverage for individual claims in excess of $175,000 per benefit plan year. Our self-insurance liabilities are based on the total estimated costs of claims filed and claims incurred but not reported, less amounts paid against such claims. We review current and historical claims data in developing our estimates.\n(12) Commitments and Contingencies\nPurchase commitments. As of October 1, 2022, we had $57.1 million in non-cancelable purchase commitments for raw material extending as long as approximately 30 days and $31.9 million of contractual commitments for the purchase of certain equipment that had not been fulfilled and are not reflected in our consolidated financial statements.\nLegal proceedings. We are involved in lawsuits, claims, investigations and proceedings, including commercial, environmental and employment matters, which arise in the ordinary course of business. We do not expect the ultimate outcome or cost to resolve these matters will have a material adverse effect on our financial position, results of operations or cash flows.\nSeverance and change of control agreements. We have entered into a severance agreement with our Chief Executive Officer that provides him with certain termination benefits in the event his employment with us is terminated without cause. The initial term of the agreement was two years, and it automatically renews for successive one-year terms unless we or our Chief Executive Officer provide notice of termination as specified in the agreement. In the event of termination of the Chief Executive Officers employment without cause, this agreement provides that he would receive termination benefits equal to one and one-half times his annual base salary in effect on the termination date and the continuation of health and welfare benefits for eighteen months. In addition, all of his stock options and restricted stock units would vest immediately, and outplacement services would be provided.\nWe have also entered into change in control agreements with key members of management, including our executive officers, which specify the terms of separation in the event that termination of their employment followed a change in control. The initial term of each agreement is two years, and they automatically renew for successive one-year terms unless we or the executive provide notice of termination as specified in the agreement. The agreements do not provide assurances of continued employment or specify the terms of an executives termination should one occur in the absence of a change in control. The compensation payable under the terms of these agreements differs between the Chief Executive Officer and the other covered executives. In the event of termination of the Chief Executive Officer within two years of a change of control, he would receive severance benefits equal to two times base compensation, two times the average bonus for the prior three years and the continuation of health and welfare benefits for two years. In the event of such a termination of the other key members of management, including our other four executive officers, within two years of a change of control, they would receive severance benefits equal to one times base compensation, one times the average bonus for the prior three years and the continuation of health and welfare benefits for one year. In addition, for any covered executive that is terminated within two years of a change of control, all of their stock options and restricted stock units would vest immediately, and outplacement services would be provided.\n(13) Leases\nWe have operating leases for certain equipment, office space and vehicles. We determine whether an arrangement is a lease at its inception if the contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. Leases with an initial term of twelve months or less are not recorded on our consolidated balance sheet. Lease expense for operating leases with original terms of more than twelve months was $1.4 million in 2022, $1.4 million in 2021 and $1.3 million in 2020.\nMost of our leases include options to extend or terminate the leases which are exercised at our sole discretion. As most of our leases do not provide an implicit interest rate, we use our incremental borrowing rate as of the commencement date in determining the present value of lease payments, which represents an estimate of the interest rate we would incur at the lease commencement to borrow an amount equal to the lease payments on a collateralized basis over the term.\nSupplemental cash flow and non-cash information related to leases is as follows:\nYear Ended\n(In thousands)\nOctober 1, 2022\nOctober 2, 2021\nCash paid for operating leases included in operating cash flows\n$ 1,418\n$ 1,413\nRight-of-use assets obtained in exchange for new lease obligations\n1,206\nSupplemental balance sheet information related to leases is as follows:\n(In thousands)\nOctober 1, 2022\nOctober 2, 2021\nRight-of-use assets:\nOther assets\n$ 1,565\n$ 1,717\nLease liabilities:\nAccrued expenses\n$\n$ 1,030\nOther liabilities\nTotal operating lease liabilities\n$ 1,569\n$ 1,725\nThe weighted average remaining lease terms and discount rates for operating leases are as follows:\nOctober 1, 2022\nOctober 2, 2021\nWeighted average lease term (in years)\n1.7\n1.8\nWeighted average discount rate\n3.7 %\n4.1 %\nAggregate future operating lease payments as of October 1, 2022 are as follows:\n(In thousands)\n$ 1,034\nTotal future operating lease payments\n1,618\nLess: imputed interest\n(49 )\nPresent value of lease liabilities\n$ 1,569\n(14) Earnings Per Share\nThe computation of basic and diluted earnings per share attributable to common shareholders is as follows:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\n(In thousands, except per share amounts)\nNet earnings\n$ 125,011\n$ 66,610\n$ 19,009\nBasic weighted average shares outstanding\n19,517\n19,344\n19,278\nDilutive effect of stock-based compensation\nDiluted weighted average shares outstanding\n19,629\n19,534\n19,383\nNet earnings per share:\nBasic\n$ 6.41\n$ 3.44\n$ 0.99\nDiluted\n6.37\n3.41\n0.98\nOptions and RSUs that were antidilutive and not included in the diluted EPS calculation amounted to 49,000 shares in 2022, 142,000 shares in 2021 and 369,000 shares in 2020.\n(15) Business Segment Information\nOur operations are entirely focused on the manufacture and marketing of steel wire reinforcing products for concrete construction applications. Our concrete reinforcing products consist of two product lines: PC strand and WWR. Based on the criteria specified in ASC Topic 280, Segment Reporting, we have one reportable segment.\nOur net sales by geographic region are as follows:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\n(In thousands)\nNet sales:\nUnited States\n$ 820,641\n$ 583,458\n$ 470,420\nForeign\n6,191\n7,143\n2,198\nTotal\n$ 826,832\n$ 590,601\n$ 472,618\nOur sales by product line are as follows:\nYear Ended\nOctober 1,\nOctober 2,\nOctober 3,\n(In thousands)\nNet sales:\nWelded wire reinforcement\n$ 495,401\n$ 358,334\n$ 294,129\nPrestressed concrete strand\n331,431\n232,267\n178,489\nTotal\n$ 826,832\n$ 590,601\n$ 472,618\nThere were no customers that accounted for 10% or more of our net sales in 2022, 2021 and 2020.\n(16) Other Financial Data\nBalance sheet information:\nOctober 1,\nOctober 2,\n(In thousands)\nAccounts receivable, net:\nAccounts receivable\n$ 82,043\n$ 68,274\nLess allowance for credit losses\n(397 )\n(357 )\nTotal\n$ 81,646\n$ 67,917\nInventories:\nRaw materials\n$ 108,894\n$ 50,459\nWork in process\n8,817\n6,680\nFinished goods\n79,943\n21,910\nTotal\n$ 197,654\n$ 79,049\nOther current assets:\nPrepaid insurance\n$ 4,563\n$ 5,169\nOther\n3,153\n4,887\nTotal\n$ 7,716\n$ 10,056\nOther assets:\nCash surrender value of life insurance policies\n$ 9,938\n$ 12,501\nAssets held for sale\n-\n6,306\nRight-of-use assets\n1,565\n1,717\nCapitalized financing costs, net\nOther\nTotal\n$ 11,665\n$ 20,767\nProperty, plant and equipment, net:\nLand and land improvements\n$ 14,947\n$ 14,554\nBuildings\n55,044\n53,182\nMachinery and equipment\n191,790\n180,654\nConstruction in progress\n11,745\n10,191\n273,526\n258,581\nLess accumulated depreciation\n(165,370 )\n(152,957 )\nTotal\n$ 108,156\n$ 105,624\nAccrued expenses:\nSalaries, wages and related expenses\n$ 8,128\n$ 8,229\nCustomer rebates\n2,760\n2,354\nProperty taxes\n1,782\n1,575\nSales allowance reserves\n1,013\nOperating lease liabilities\n1,030\nState sales and use taxes\nIncome taxes\n-\n4,014\nOther\nTotal\n$ 15,800\n$ 19,406\nOther liabilities:\nDeferred compensation\n$ 11,747\n$ 12,832\nDeferred income taxes\n7,086\n6,296\nOperating lease liabilities\nTotal\n$ 19,405\n$ 19,823\n(17) Product Warranties\nOur products are used in applications which are subject to inherent risks including performance deficiencies, personal injury, property damage, environmental contamination or loss of production. We warrant our products to meet certain specifications, and actual or claimed deficiencies from these specifications may give rise to claims. We do not maintain a reserve for warranties as the historical claims have been immaterial. We maintain product liability insurance coverage to minimize our exposure to such risks.\n(18) Share Repurchases\nOn November 18, 2008, our Board of Directors approved a share repurchase authorization to buy back up to $25.0 million of our outstanding common stock (the Authorization). Under the Authorization, repurchases may be made from time to time in the open market or in privately negotiated transactions subject to market conditions, applicable legal requirements and other factors. We are not obligated to acquire any particular amount of common stock and the program may be commenced or suspended at any time at our discretion without prior notice. The Authorization continues in effect until terminated by the Board of Directors. During the year ended October 1, 2022, the Company repurchased $1.2 million or 41,706 shares of its common stock. As of October 1, 2022, there was $23.6 million remaining available for future share repurchases under this Authorization. There were no share repurchases during 2021 or 2020.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nCONSOLIDATED FINANCIAL STATEMENTS\nBoard of Directors and Shareholders\nInsteel Industries, Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of Insteel Industries, Inc. (a North Carolina corporation) and subsidiaries (the Company) as of October 1, 2022 and October 2, 2021, the related consolidated statements of operations, comprehensive income, changes in shareholders equity, and cash flows for each of the three years in the period ended October 1, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 1, 2022 and October 2, 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 1, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of October 1, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated October 27, 2022 expressed an unqualified opinion.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Grant Thornton LLP\nWe have served as the Companys auditor since 2002.\nCharlotte, North Carolina\nOctober 27, 2022 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe have conducted an evaluation of the effectiveness of our disclosure controls and procedures as of October 1, 2022. This evaluation was conducted under the supervision and with the participation of management, including our principal executive officer and our principal financial officer. Based upon that evaluation, our principal executive officer and our principal financial officer concluded that our disclosure controls and procedures were effective to ensure that information required to be disclosed in the reports that we file or submit under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in the Commissions rules and forms. Furthermore, we concluded that our disclosure controls and procedures were effective to ensure that such information is accumulated and communicated to management, including our principal executive officer and our principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of our financial statements for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting includes: (1) maintaining records that in reasonable detail accurately and fairly reflect the transactions and dispositions of assets; (2) providing reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that receipts and expenditures are made only in accordance with authorizations of management and directors; and (3) providing reasonable assurance that unauthorized acquisition, use or disposition of assets that could have a material effect on financial statements would be prevented or detected on a timely basis. Because of its inherent limitations, internal control over financial reporting can only provide reasonable assurance that a misstatement of financial statements would be prevented or detected. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting based on the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in the 2013 Internal Control - Integrated Framework. Based on this assessment, our management concluded that our internal control over financial reporting was effective as of October 1, 2022. During the quarter ended October 1, 2022, there were no changes in our internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nOur independent registered public accounting firm has issued an audit report on the effectiveness of our internal control over financial reporting as of October 1, 2022, which appears below.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nINTERNAL CONTROL OVER FINANCIAL REPORTING\nBoard of Directors and Shareholders\nInsteel Industries, Inc.\nOpinion on internal control over financial reporting\nWe have audited the internal control over financial reporting of Insteel Industries, Inc. (a North Carolina corporation) and subsidiaries (the Company) as of October 1, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 1, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements of the Company as of and for the year ended October 1, 2022, and our report dated October 27, 2022 expressed an unqualified opinion on those financial statements.\nBasis for opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Reports on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and limitations of internal control over financial reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Grant Thornton LLP\nCharlotte, North Carolina\nOctober 27, 2022 Item 9B. Other Information.\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe information called for by this item and not presented herein appears under the captions Item Number One: Election of Directors, Security Ownership of Directors and Executive Officers - Delinquent Section 16(a) Reports and Corporate Governance Guidelines and Board Matters in our Proxy Statement for the 2023 Annual Meeting of Shareholders and is incorporated herein by reference. Information on executive officers appears under the caption Information About Our Executive Officers in Part I of this report.\nWe have adopted a Code of Business Conduct that applies to all directors, officers and employees, which is available on our website at https://investor.insteel.com. To the extent permissible under applicable law (the rules of the SEC or NYSE listing standards), we intend to satisfy the disclosure requirement under Item 5.05 of Form 8-K by posting on our website any amendment or waiver to a provision of our Code of Business Conduct that requires disclosure under applicable law (the rules of the SEC or NYSE listing standards). Our website does not constitute part of this Annual Report on Form 10-K. Item 11. Executive Compensation.\nThe information called for by this item appears under the captions Executive Compensation, Compensation Committee Interlocks and Insider Participation and Director Compensation in our Proxy Statement for the 2023 Annual Meeting of Shareholders and is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe information called for by this item appears under the captions Security Ownership of Certain Beneficial Owners, Security Ownership of Directors and Executive Officers and Equity Compensation Plan Information in our Proxy Statement for the 2023 Annual Meeting of Shareholders and is incorporated herein by reference. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe information called for by this item appears under the captions Certain Relationships and Related Person Transactions and Corporate Governance Guidelines and Board Matters in our Proxy Statement for the 2023 Annual Meeting of Shareholders and is incorporated herein by reference. Item 14. Principal Accounting Fees and Services.\nThe information called for by this item appears under the caption Item Number Three: Ratification of the Appointment of Grant Thornton LLP in our Proxy Statement for the 2023 Annual Meeting of Shareholders and is incorporated herein by reference.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a)(1) Financial Statements\nThe financial statements as set forth under Item 8 are filed as part of this report.\n(a)(2) Financial Statement Schedules\nAll other schedules have been omitted because they are either not required or not applicable.\n(a)(3) Exhibits\nThe list of exhibits filed as part of this annual report is set forth on the Exhibit Index immediately preceding the signatures to this annual report and is incorporated herein by reference.\n(b) Exhibits\nSee Exhibit Index on pages 46 and 47.\n(c) Financial Statement Schedules\nSee Item 15(a)(2) above.\nItem 16. Form 10-K Summary\nNone.\nEXHIBIT INDEX\nExhibit\nNumber\nDescription\n3.1\nRestated Articles of Incorporation for the Company (incorporated by reference to Exhibit 3.1 of the Companys Registration Statement on Form S-1 filed on May 2, 1985).\n3.2\nArticles of Amendment to the Restated Articles of Incorporation of the Company (incorporated by reference to Exhibit 3.1 of the Companys Current Report on Form 8-K dated May 3, 1988).\n3.3\nArticles of Amendment to the Restated Articles of Incorporation of the Company (incorporated by reference to Exhibit 3.1 of the Companys Quarterly Report on Form 10-Q for the quarter ended April 3, 1999 filed on May 14, 1999).\n3.4\nArticles of Amendment to the Restated Articles of Incorporation of the Company (incorporated by reference to Exhibit 3.1 of the Companys Quarterly Report on Form 10-Q for the quarter ended April 3, 2010 filed on April 26, 2010).\n3.5\nBylaws of the Company (as last amended December 19, 2016) (incorporated by reference to Exhibit 3.1 of the Companys Quarterly Report on Form 10-Q filed on January 19, 2017).\n4.1\nRights Agreement dated April 27, 1999 by and between the Company and First Union National Bank, as Rights Agent (incorporated by reference to Exhibit 99.1 of the Companys Registration Statement on Form 8-A filed on May 7, 1999).\n4.2\nAmendment No. 1 to the Rights Agreement dated as of April 25, 2009, between the Company and American Stock Transfer & Trust Company, LLC (as Successor Rights Agent to First Union National Bank) (incorporated by reference to Exhibit 4.2 of the Companys Current Report on Form 8-K filed on April 27, 2009).\n4.3\nAmendment No. 2 to the Rights Agreement, dated as of November 15, 2018, by and between the Company and American Stock Transfer & Trust Company, LLC (as Successor Rights Agent to First union National Bank) (incorporated by reference to Exhibit 4.1 of the Companys Current Report on Form 8-K filed on November 19, 2018).\n4.4\nDescription of Securities (incorporated by reference to Exhibit 4.4 to the Company's Annual Report on Form 10-K filed on October 25, 2019).\n10.1\nThird Amended and Restated Credit Agreement dated as of May 15, 2019, among Insteel Wire Products Company, as Borrower; Insteel Industries, Inc., as a Credit Party; and Wells Fargo Bank, as Agent and Lender (incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed on May 16, 2019).\n10.2\nGuaranty and Second Amended and Restated Security Agreement dated as of May 15, 2019, among Insteel Industries, Inc., Insteel Wire Products Company, Intercontinental Metals Corporation, and Wells Fargo Bank, as administrative agent (incorporated by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed May 16, 2019).\n10.3*\nChange in Control Severance Agreement between the Company and James F. Petelle dated November 14, 2006 (incorporated by reference to Exhibit 99.3 of the Companys Current Report on Form 8-K filed on November 16, 2006).\n10.4*\nAmended and Restated Retirement Security Agreement by and between the Company and H.O. Woltz III dated September 19, 2007 (incorporated by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed on September 21, 2007).\n10.5*\nForm of Retirement Security Agreement between the Company and each of Michael C. Gazmarian, James F. Petelle and Richard T. Wagner, respectively, dated September 19, 2007; each agreement is substantially identical to the form in all material respects (incorporated by reference to Exhibit 10.3 of the Company's Current Report on Form 8-K filed on September 21, 2007).\n10.6*\nForm of Amended and Restated Change in Control Severance Agreements between the Company and each of H.O. Woltz III and Michael C. Gazmarian, respectively, each dated November 14, 2006; each agreement is substantially identical to the form in all material respects (incorporated by reference to Exhibit 99.1 of the Company's Current Report on Form 8-K filed on November 16, 2006).\n10.7*\nForm of Amended and Restated Severance Agreements with H.O. Woltz III and Michael C. Gazmarian dated November 14, 2006 (each agreement is substantially identical to the form in all material respects) (incorporated by reference to Exhibit 99.6 of the Company's Current Report on Form 8-K filed on November 16, 2006).\nEXHIBIT INDEX\nExhibit\nNumber\nDescription\n10.8*\nLetter of Employment between the Company and James F. Petelle, dated August 23, 2006 (incorporated by reference to Exhibit 99.7 of the Companys Current Report on Form 8-K filed on November 16, 2006).\n10.9*\nAmended and Restated Change in Control Severance Agreement between the Company and Richard T. Wagner dated November 14, 2006 (incorporated by reference to Exhibit 99.1 of the Companys Current Report on Form 8-K filed on February 15, 2007).\n10.10*\n2005 Equity Incentive Plan of Insteel Industries, Inc., as amended on November 8, 2011 (incorporated by reference to Exhibit 10.22 to the Company's Annual Report on Form 10-K for the fiscal year ended October 1, 2011 filed on November 10, 2011).\n10.11*\nSummary of amendments to the Insteel Industries, Inc. Director Compensation Plan (incorporated by reference to exhibit 10.23 of the Company's Annual Report on Form 10-K for the fiscal year ended September 27, 2008 filed on November 18, 2008).\n10.12*\nForm of Notice of Grant of Restricted Stock Units and Restricted Stock Unit Agreement (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed on January 23, 2009).\n10.13*\nInsteel Industries, Inc. Return on Capital Incentive Compensation Plan (as amended and restated effective August 12, 2008) (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed on February 13, 2009).\n10.14*\nForm of Amendment to 2005 Equity Incentive Plan of Insteel Industries, Inc. dated August 20, 2013 (incorporated by reference to Exhibit 10.20 of the Company's Annual Report on Form 10-K filed on October 29, 2013).\n10.15*\n2015 Equity Incentive Plan of Insteel Industries, Inc. (incorporated by reference to Exhibit 99 filed with the Companys Registration Statement on Form S-8, filed with the SEC on February 17, 2015 (File No. 333-202128)).\n10.16*\nForm of Restricted Stock Unit Agreement under the 2015 Equity Incentive Plan of Insteel Industries, Inc. (incorporated by reference to Exhibit 10.21 of the Company's Annual Report on Form 10-K filed on October 25, 2019).\n10.17*\nForm of Stock Option Agreement under the 2015 Equity Incentive Plan of Insteel Industries, Inc. (incorporated by reference to Exhibit 10.21 of the Company's Annual Report on Form 10-K filed on October 25, 2019).\n10.18*\n2019 Declaration of Amendment to 2015 Equity Incentive Plan of Insteel Industries, Inc. (incorporated by reference to Exhibit 99.2 to the Companys Registration Statement on Form S-8 filed on February 28, 2020 (File No. 333-236744)).\n10.19*\nOffer Letter to Mark A. Carano (incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on May 4, 2020).\n10.20*\nChange in Control Severance Agreement between Insteel Industries Inc. and Mark A. Carano, dated May 27, 2020 (incorporated by reference to Exhibit 10.2 of the Company's Quarterly Report on Form 10-Q filed on July 16, 2020).\n10.21*\nInsteel Industries Inc. Retirement Security Agreement between Insteel Industries Inc. and Mark A. Carano, dated May 27, 2020 (incorporated by reference to Exhibit 10.2 of the Company's Quarterly Report on Form 10-Q filed on July 16, 2020).\n10.22*\nForm of Amendment of Restricted Stock Unit Agreement under the 2015 Equity Incentive Plan of Insteel Industries, Inc. (incorporated by reference to Exhibit 10.1 of the Company's Quarterly Report on Form 10-Q filed on March 21, 2022)\n10.23*\nForm of Amendment of Stock Option Agreement under the 2015 Equity Incentive Plan of Insteel Industries, Inc. (incorporated by reference to Exhibit 10.2 of the Company's Quarterly Report on Form 10-Q filed on March 21, 2022)\n10.24*\nInsteel Industries, Inc. Retirement Security Agreement between Insteel Industries, Inc. and James R. York, dated July 9, 2018.\n10.25*\nChange in Control Severance Agreement between Insteel Industries Inc. and James R. York, dated July 9, 2018.\n21.1\nList of Subsidiaries of Insteel Industries, Inc. at October 1, 2022.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification of the Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of the Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of the Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nThe following financial information from our Annual Report on Form 10-K for the fiscal year ended October 1, 2022, filed on October 27, 2022, formatted in iXBRL (Inline eXtensible Business Reporting Language) includes: (i) the Consolidated Statements of Operations for the years ended October 2, 2021, October 3, 2020 and September 28, 2019, (ii) the Consolidated Statements of Comprehensive Income for the years ended October 1, 2022, October 2, 2021, and October 3, 2020, (iii) the Consolidated Balance Sheets as of October 1, 2022 and October 2, 2021, (iv) the Consolidated Statements of Cash Flows for the years ended October 1, 2022, October 2, 2021 and October 3, 2020, (v) the Consolidated Statements of Shareholders Equity as of October 1, 2022, October 2, 2021 and October 3, 2020 and (vi) the Notes to Consolidated Financial Statements.\nThe cover page from our Annual Report on Form 10-K for the year ended October 1, 2022, filed October 27, 2022, formatted in iXBRL (included in Exhibit 101).\n*\nManagement contracts or compensation plans or arrangements in which directors or executive officers are eligible to participate.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nINSTEEL INDUSTRIES, INC.\nRegistrant\nDate: October 27, 2022\nBy:\n/s/ Mark A. Carano\nMark A. Carano\nSenior Vice President, Chief Financial Officer and\nTreasurer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed on October 27, 2022 below by the following persons on behalf of the registrant and in the capacities indicated:\nName and Signature\nPosition(s)\n/s/ H. O. WOLTZ III\nH. O. WOLTZ III\nPresident, Chief Executive Officer and Chairman of the\nBoard (Principal Executive Officer)\n/s/ MARK A. CARANO\nMARK A. CARANO\nSenior Vice President, Chief Financial Officer and\nTreasurer (Principal Financial Officer)\n/s/ SCOT R. JAFROODI\nSCOT R. JAFROODI\nVice President, Chief Accounting Officer and\nCorporate Controller (Principal Accounting Officer)\n/s/ ABNEY S. BOXLEY III\nABNEY S. BOXLEY III\nDirector\n/s/ ANNE H. LLOYD\nANNE H. LLOYD\nDirector\n/s/ W. ALLEN ROGERS II\nW. ALLEN ROGERS II\nDirector\n/s/ JON M. RUTH\nJON M. RUTH\nDirector\n/s/ JOSEPH A. RUTKOWSKI\nJOSEPH A. RUTKOWSKI\nDirector\n/s/ G. KENNEDY THOMPSON\nG. KENNEDY THOMPSON\nDirector"
}