{
    "cik": "771497",
    "company": "ABM INDUSTRIES INC /DE/",
    "filing_type": "10-K",
    "filing_date": "2023-12-18",
    "period_of_report": "2023-10-31",
    "sic": "7340",
    "state_of_inc": "DE",
    "state_location": "NY",
    "fiscal_year_end": "1031",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/771497/0000771497-23-000025-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/771497/000077149723000025/abm-20231031.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/771497/0000771497-23-000025.txt",
    "filename": "771497_10K_2023_0000771497-23-000025.htm",
    "content": "ITEM 1. BUSINESS.\nGeneral\nABM Industries Incorporated, which operates through its subsidiaries (collectively referred to as ABM, we, us, our, or the Company), is a leading provider of integrated facility, infrastructure, and mobility solutions with a mission to make a difference, every person, every day. Our history dates back to 1909, when American Building Maintenance Company began as a window washing company in San Francisco with one employee. In 1985, we were incorporated in Delaware under the name American Building Maintenance Industries, Inc., as the successor to the business originally founded in 1909. In 1994, we changed our name to ABM Industries Incorporated. Since that time, we have grown into a multi-segment facility solutions company, primarily through strategic acquisitions and new service offerings, increasing our revenue to more than $8.0 billion.\nThe acquisitions of OneSource and Linc Group in the early 2000s established ABM as a leader in the commercial janitorial market and also enhanced our ability to be a full-service facility solutions provider with new service offerings, including lighting, mechanical, and electrical technical solutions. With demand increasing for industry-specific service providers, the acquisition of Air Serv established Aviation as our first industry group. In recent years, we have strategically acquired companies in the United Kingdom (UK) and the Republic of Ireland (Ireland), which expanded our janitorial and technical solutions businesses overseas.\nIn 2015, we began a comprehensive transformational initiative (2020 Vision) to drive long-term, profitable growth through an industry-based, go-to-market approach. Through this initiative, we centralized key functional areas and industry groups, strengthened our sales capabilities, and initiated investments in service delivery tools and processes to help support standard operating practices that we believe remain foundational to our long-term success.\nAs part of the transformation initiative, we also evaluated all of our service offerings and sold our Security and Government Services businesses, which did not align with our long-term focus on specialized industry groups.\nIn 2017, we acquired GCA Services Group (GCA), a provider of integrated facility services to educational institutions and commercial facilities, for approximately $1.3 billion, representing the largest acquisition in ABM history. The acquisition accelerated the Companys position as a leading facility solutions provider in the education market.\nIn 2021, we acquired Crown Building Maintenance Co. and Crown Energy Services, Inc. (collectively, Able), a leading facilities services company headquartered in San Francisco, California, with the goal to provide additional scaling to the Companys core businesses and key geographies and bolstering ABMs janitorial and facilities services service lines. In addition, the acquisition of Able (the Able Acquisition) further expanded ABMs sustainability and energy efficiency offerings amid growing demand for environmentally responsible solutions.\nIn 2022, we acquired RavenVolt, Inc. (RavenVolt), a leading nationwide provider of advanced turn-key microgrid systems utilized by diversified commercial and industrial customers, national retailers, utilities, and municipalities. A complementary extension of ABMs Technical Solutions service offerings, the addition of RavenVolt enhanced ABMs position as a market leader in electric vehicle (EV) charging infrastructure, power, and bundled energy solutions.\nIn 2022, we acquired Momentum Support (Momentum), a leading independent provider of facility services, primarily janitorial, across Ireland and Northern Ireland. The addition of Momentum provided greater access to Momentums blue-chip customer base as well as an opportunity to cross sell ABM services to existing U.S.- and UK-based clients who also have an operational footprint in Ireland and Northern Ireland.\nThe above acquisitions and divestitures weve made since 2015 largely reflect strategies first introduced in our 2020 Vision initiative and also strategies included in our follow-on launched strategic plan called ELEVATE, which was introduced in 2021 and is described below.\nAs a result of these strategic initiatives and investments, we have strengthened our ability to offer janitorial, engineering, parking and eMobility, infrastructure, electrical, lighting and energy solutions, HVAC and mechanical services, landscaping and turf services, and mission critical solutions across aviation, education, manufacturing and distribution, and commercial business industries, on a standalone basis or in combination, and positioned ourselves as a leading integrated facilities management company.\nUnless otherwise indicated, all references to years are to our fiscal year, which ends on October 31.\nForward-Looking Strategic Plan\nLeveraging the various accomplishments achieved through 2020 Vision, the Company embarked on the next step of its journey in 2021 with a multiyear strategic plan called ELEVATE. The ELEVATE strategy is designed to strengthen our industry leadership position through end-market repositioning and building on our core services, which we expect together will drive significant long-term value for our stakeholders.\nWe will continue to make significant investments over the life of the program, which are expected to total $200 - $215 million, and we will continue to implement various measures with the aim to ELEVATE:\nthe client experience, by serving as a trusted advisor who can provide innovative multiservice solutions and consistent service delivery;\nthe team member experience, by investing in workforce management, training, developing the next generation of ABM leaders, and building on our inclusive culture; and\nour use of technology and data to power client and employee experiences with cutting-edge data and analytics, processes, and tools that will fundamentally change how we operate our business.\nContract Types\nWe generate revenues under several types of contracts, as explained below. Generally, the type of contract is determined by the nature of the services. Although many of our service agreements are cancelable on short notice, we have historically had a high rate of client retention and expect to continue maintaining long-term relationships with our clients. See Note 2, Basis of Presentation and Significant Accounting Policies, in the Notes to consolidated financial statements for additional information regarding the contract types that are most common in each of our service lines.\nContract Type Description\nMonthly Fixed-Price These arrangements are contracts in which the client agrees to pay a fixed fee every month over a specified contract term.\nSquare-Foot Square-foot arrangements are contracts in which the client agrees to pay a fixed fee every month based on the actual square footage serviced over a specified contract term.\nCost-Plus These arrangements are contracts in which the clients reimburse us for the agreed-upon amount of wages and benefits, payroll taxes, insurance charges, and other expenses associated with the contracted work, plus a profit margin.\nWork Orders Work orders generally consist of supplemental services requested by clients outside of the standard service specification and include cleanup after tenant moves, construction cleanup, flood cleanup, snow removal, and high touchpoint disinfecting services.\nTransaction-Price These are arrangements in which customers are billed a fixed price for each transaction performed on a monthly basis (e.g., wheelchair passengers served or airplane cabins cleaned).\nHourly In hourly arrangements, the client is billed a fixed hourly rate for each labor hour provided.\nManagement Reimbursement Under these parking arrangements, we manage a parking facility for a management fee and pass through the revenue and expenses associated with the facility to the owner.\nLeased Location Under these parking arrangements, we pay a fixed amount of rent plus a percentage of revenues derived from monthly and transient parkers to the property owner. We retain all revenues received and are responsible for most operating expenses incurred.\nAllowance Under these parking arrangements, we are paid a fixed amount or hourly fee to provide parking services, and we are responsible for certain operating expenses, as specified in the contract.\nEnergy Savings Contracts and Fixed-Price Repair and Refurbishment Under these arrangements, we agree to develop, design, engineer, and construct a project. Additionally, as part of bundled energy solutions arrangements, we guarantee the project will satisfy agreed-upon performance standards. The client agrees to pay us based on s predetermined contractual milestone schedule.\nFranchise We franchise certain engineering services through individual and area franchises under the Linc Service and TEGG brands, which are part of ABM Technical Solutions.\nMicrogrid Systems Installation Under these arrangements, we provide electrical contracting services for energy related products such as the installation of solar solutions, battery storage, distributed generation, and other specialized electric trades. The client agrees to pay us based on a predetermined contractual milestone schedule.\nSegment and Geographic Financial Information\nOur current reportable segments consist of Business & Industry (B&I), Manufacturing & Distribution (M&D), Education, Aviation, and Technical Solutions. For segment and geographic financial information, see Note 17, Segment and Geographic Information, in the Notes to consolidated financial statements.\nREPORTABLE SEGMENTS AND DESCRIPTIONS\nB&I, our largest reportable segment, encompasses janitorial, facilities engineering, and parking services for commercial real estate properties (including corporate offices for high tech clients), sports and entertainment venues, and traditional hospitals and non-acute healthcare facilities. B&I also provides vehicle maintenance and other services to rental car providers. We typically provide these services pursuant to monthly fixed-price, square-foot, cost-plus, and parking arrangements (i.e., management reimbursement, leased location, or allowance) that are obtained through a competitive bid process as well as pursuant to work orders.\nM&D provides integrated facility services, engineering, janitorial, and other specialized services to a variety of manufacturing, distribution, and data center facilities. We typically provide these services pursuant to monthly fixed-price, square-foot, and cost-plus, that are obtained through a competitive bid process as well as pursuant to work orders. One client accounted for approximately 32% of revenues for this segment in 2023.\nEducation delivers janitorial, custodial, landscaping and grounds, facilities engineering, and parking services for public school districts, private schools, colleges, and universities. These services are typically provided pursuant to monthly fixed-price, square-foot, and cost-plus arrangements that are obtained through either a competitive bid process or re-bid upon renewal as well as pursuant to work orders.\nAviation supports airlines and airports with services ranging from parking and janitorial to passenger assistance, catering logistics, air cabin maintenance, and transportation. We typically provide services to clients in this segment under master services agreements. These agreements are typically re-bid upon renewal and are generally structured as monthly fixed-price, square-foot, cost-plus, parking, transaction-price, and hourly arrangements. One client accounted for approximately 18% of revenues for this segment in 2023.\nTechnical Solutions specializes in facility infrastructure, mechanical and electrical services, including EV power design, installation and maintenance, as well as microgrid systems design and installation. These services can also be leveraged for cross-selling across all of our industry groups, both domestically and internationally. Contracts for this segment are generally structured as electrical contracting services for energy related products such as the installation of solar solutions, battery storage, distributed generation, and other specialized electric trade..\nService Marks, Trademarks, and Trade Names\nWe hold various service marks, trademarks, and/or trade names, such as ABM, ABM Building Value, ABM GreenCare, ABM EnhancedClean, ABM EnhancedFacility, Linc Service, TEGG, ABM Connect, ABM Vantage, Momentum Support Services, and RavenVolt, which we deem important to our marketing activities, to our business, and, in some cases, to the franchising activities conducted by our Technical Solutions segment.\nDependence on Significant Client\nNo single client accounted for more than 10% of our consolidated revenues during 2023, 2022, or 2021.\nCompetition\nWe believe that each aspect of our business is highly competitive and that such competition is based primarily on price, quality of service, efficiency, and productivity enhancements, adapting to changing workplace conditions, and ability to anticipate and respond to industry changes. A majority of our revenue is derived from projects requiring competitive bids; however, an invitation to bid is often conditioned upon prior experience, industry expertise, and financial strength. The low cost of entry in the facility services business results in a very competitive market. We mainly compete with regional and local owner-operated companies that may have more acute vision into local markets and significantly lower labor and overhead costs, providing them with competitive advantages in those regards. We also compete indirectly with companies that can perform for themselves one or more of the services we provide.\nSales and Marketing\nOur sales and marketing activities include digital engagement and direct interactions with prospective and existing clients, pricing, proposal management, and customer relationship management by dedicated business development teams, operations personnel, and management. These activities are executed by branch and regional sales, marketing, and operations teams assigned to our industry groups and are supported by centralized sales support teams, inside sales teams, and marketing personnel. The sales and marketing teams acquire, nurture, and manage leads through the sales buying process, as well as train personnel on product offerings, sales tools, and proposal systems, all governed by standard operating procedures.\nMacro-Economic Environment in Commercial Real Estate\nWe actively monitor the economic environment and its potential impact on demand for our services and our financial condition. Largely driven by the lingering effects of the pandemic, especially the normalization of hybrid work, the commercial real estate industry, particularly multi-tenant and owner-occupied commercial office buildings, is experiencing an increase in vacancy rates. Given that Class A and high-quality commercial office buildings are a key end market for the Company, we expect a decline in demand for janitorial services and work orders in these markets near-term. Longer term, we expect the vacancy rates of Class A and high-quality buildings to gradually decrease and our volume of work to stabilize.\nRegulatory Environment\nOur operations are subject to various federal, state, and/or local laws, rules, and regulations regulating among other things, labor, wages, and health and safety matters, as well as laws and regulations relating to the discharge of materials into the environment or otherwise relating to the protection of the environment. Historically, the cost of complying with these laws, rules, and regulations has not had a material adverse effect on our financial position, results of operations, or cash flows.\nEnvironmental, Social, and Governance (ESG) Strategy and Oversight\nAs a company with over 110 years of history we understand the importance of embedding and integrating responsible and community-minded business practices into our operations and commit to standards to create value and support the long-term success of our business, shareholders, employees, and clients.\nOur Board of Directors and its committees are responsible for overseeing the Companys activities and practices relating to ESG. Our Board of Directors receives regular reports from meetings of its Governance Committee, which is responsible for oversight of the Companys overall ESG-related framework, as well as from meetings of its Stakeholder and Enterprise Risk Committee, which is responsible for oversight of environmental and social matters within ESG. Additionally, our internal culture, sustainability, diversity, equity and inclusion teams work\nin cross functional collaboration with departments throughout and across the enterprise to advance our ESG strategies, and regularly present to the Board of Directors Stakeholder and Enterprise Risk Committee.\nSince 2011, we have voluntarily published an ESG Impact Report on an annual basis in alignment with the Global Reporting Initiative framework and the Sustainability Accounting Standards Board to address our business, our employees, and the environment. More information about our ESG performance, progress, and goals can be found in the Human Capital section of this report and in the ESG section of the Companys corporate website.\nHuman Capital\nGiven that ABM is a service-oriented business, our employees are the driving force behind our success, and we believe our ability to attract, develop, and retain our employees at all levels of our organization has a direct impact on client satisfaction and our ability to grow the Company. To succeed in a competitive labor market, ABM has developed key recruitment and retention strategies, objectives, and measures that we focus on as part of the overall management of our business. These strategies, objectives, and measures form the pillars of our human capital management framework and are advanced through the programs, policies and initiatives described below.\nDirect labor costs represented 69% of our total revenue for 2023. As of October 31, 2023, we employed approximately 123,000 employees, of whom approximately 46,000, or 37%, were subject to various local collective bargaining agreements. As of October 31, 2023, our frontline employees represented 92% of our total workforce, while staff and management employees represented the other 8%.\nOur human capital strategy is grounded and guided by our values and our employees. We prioritize our human capital development in order to do business in a responsible way and enable our employees and clients success. The execution of this strategy is overseen at the highest levels of our organization, from our Board of Directors, our Board of Directors Stakeholder and Enterprise Risk Committee, and across our senior management.\nBusiness ethics\nOur Code of Business Conduct drives the application of our core values of respect, integrity, collaboration, innovation, trust, and excellence throughout our operations. Our Code of Business Conduct serves as a critical tool to help all ABM team members to recognize and report unethical conduct, while preserving and nurturing our culture of honesty and accountability. We provide comprehensive annual training and certification programs on our Code of Business Conduct for our Board of Directors and all of our staff and management employees.\nHuman resources, hiring, and training\nWith a team of approximately 123,000 employees across the United States, UK, Ireland, and other locations, we have invested in and implemented a variety of systems and tools designed to centralize and standardize hiring and training practices, including regional recruitment strategies, applicant tracking technology, and incorporating modeling and advanced analytics that provide actionable insights relative to the candidate life cycle and turnover trends in our HR processes to drive ongoing improvement in the attraction, retention, and engagement of our frontline employees, who constitute the majority of our workforce.\nIn 2021, we successfully piloted a frontline leadership training program, which was launched enterprise-wide in 2022 and expanded further in 2023. This program is designed to enhance the management and coaching skills of frontline supervisors to improve the employee experience, create an environment for career growth, and increase retention.\nOur online training platform, ABM University, provides our staff and management employees with access to a multitude of training courses, videos, reference material, and other tools. Outside of ABM University, our frontline employees receive on-the-job training to enable us to execute for our clients in a safe and efficient manner.\nCompensation and employee benefits\nIn addition, we offer competitive wages and salaries in our served markets and full-time employees have access to a continuum of health and wellness benefits, including medical, dental, vision, disability, and basic life and voluntary supplemental life and AD&D insurance, 401K employee savings and employee stock purchase programs, a 24/7 employee assistance program, healthcare flexible spending accounts, telemedicine options, legal support, as well as commuter, fitness, and other discount programs.\nLabor relations\nWith approximately 46,000 union-represented employees, we are party to more than 250 collective bargaining agreements nationwide, with 20 major labor unions. Our collective bargaining agreements include regional multiemployer agreements covering thousands of employees, as well as localized site agreements covering smaller groups. We strive to engage with our labor partners in an atmosphere of mutual respect, and seek to resolve disputes in a fair and equitable manner.\nSafe working environment\nABMs commitment to its team members is evidenced in its approach to risk management and safety. The Companys programs are designed to meet or exceed compliance standards of the Occupational Safety and Health Administration and other regulatory bodies, and to protect the health and welfare of our employees and our clients. A cornerstone of ABMs comprehensive risk management and safety program is safety awareness to confirm our employees are:\neducated on how to complete tasks safely;\ntrained in hazard identification;\nmade aware of emergency response procedures to immediately address challenges; and\nproficient in reporting accidents and utilizing applicable procedures to confirm appropriate loss mitigation techniques are implemented should a loss occur.\nOur Think Safe approach to safety includes establishing a safety mindset from day one of employment. This safety culture is continuously reinforced through daily moments for safety messaging, relevant monthly training topics, and unique programs and materials created for our employees.\nOne of the cornerstones of our ThinkSafe program is designed to help leaders identify workplace hazards and implement changes to prevent accident or injury. In our frontline leader training, participants are guided in creating a culture of safety and provided guidance on practices to support our employees receiving the right care at the right time to expedite their recovery.\nCulture and inclusion\nWith a widely distributed workforce serving over 20,000 clients across multiple nations and geographic regions, ABMs culture, and the team member experience it supports, plays a vital role in attracting, retaining, and engaging talent. The Company works to develop an increasingly inclusive culture, where individuals from all backgrounds are equally able to contribute and are provided with opportunities to grow in their careers.\nGuided by ABMs mission and values and aligned with its ELEVATE strategy, the Companys inclusive culture strategy is activated through its Culture & Inclusion Council. ABMs President and CEO and Chief Human Resources Officer each serve as executive sponsors of the Culture & Inclusion Council, and reports of Culture & Inclusion Council activities are provided to the Boards Stakeholder and Enterprise Risk Committee.\nAdditionally, we are an Equal Opportunity and Affirmative Action employer in compliance with the requirements of the Executive Order 11246 of the Rehabilitation Act of 1973 and the Vietnam Era Veterans Readjustment Assistance Act.\nAvailable Information\nOur corporate website is www.abm.com. The content on any website referred to in this filing does not constitute, and should not be viewed as, a part of this Annual Report, and our website is not incorporated into this or any of our other filings with the Securities and Exchange Commission (SEC). We make available, free of charge through our website, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 as soon as reasonably practicable after such reports are electronically filed with or furnished to the SEC. Additionally, the SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\nExecutive Officers of Registrant\nExecutive Officers on December 18, 2023\nName Age Principal Occupations and Business Experience\nScott Salmirs\n61 President and Chief Executive Officer of ABM since March 2015; Executive Vice President of ABM from September 2014 to March 2015, with global responsibility for ABMs Aviation division and all international activities; Executive Vice President of ABMs Onsite Services division focused on the Northeast from 2003 to September 2014; Member of the Board of Directors of ABM since January 2015.\nEarl R. Ellis 58\nExecutive Vice President and Chief Financial Officer of ABM since November 2020; Senior Vice President, Finance and Procurement of Best Buy Co. Inc. from January 2018 to November 2020; Chief Financial Officer of Best Buy Canada from May 2016 to December 2017; Vice President, Finance, Retail of Canadian Tire Corporation Limited from May 2014 to May 2016.\nJoshua H. Feinberg 49 Executive Vice President, Chief Strategy and Transformation Officer of ABM since November 2019; Managing Director and Partner of The Boston Consulting Group from July 2014 to November 2019.\nRene Jacobsen 62 Executive Vice President and Chief Operating Officer of ABM since November 2020; Executive Vice President and Chief Facilities Services Officer of ABM from October 2019 to November 2020; President of ABMs Business & Industry Group from February 2016 to October 2019; Executive Vice President of ABMs West Region from April 2012 to February 2016; Executive Vice President and Chief Operating Officer of Temco Service Industries from November 2007 to April 2012.\nSean M. Mahoney 57 Executive Vice President and President, Sales and Marketing of ABM since November 2020; Senior Vice President, Sales of ABM from August 2017 to October 2020; Vice President, Sales of Honeywell from July 2015 to July 2017.\nAndrea R. Newborn 60 Executive Vice President, General Counsel, and Corporate Secretary of ABM since July 2017; Executive Vice President and General Counsel of TravelClick, Inc. from July 2014 to June 2017; Senior Vice President, General Counsel, and Secretary of The Readers Digest Association, Inc. from March 2007 to February 2014.\nRaúl Valentin 60\nExecutive Vice President and Chief Human Resources Officer of ABM since September 2021; Senior Vice President, Human Resources of ABM from February 2019 to August 2021; Senior Vice President, Human Resources of Coty Inc. from 2016 to 2018; Vice President, Human Resources of Comcast Strategic & Business Development from 2015 to 2016; Vice President, Talent Acquisition of Comcast from 2011 to 2015.\nDean A. Chin 55\nTreasurer of ABM since May 2021; Senior Vice President, Chief Accounting Officer, and Corporate Controller of ABM since June 2010; Interim Chief Financial Officer of ABM from July 2020 to November 2020; Vice President and Assistant Controller of ABM from June 2008 to June 2010. ITEM 1A. RISK FACTORS.\nThe following risks, some of which have occurred and any of which may occur in the future, could materially and adversely affect our business, financial condition, cash flows, results of operations, and/or the trading price of our common stock. The risks described below identify the material risks we face; however, our business could also be affected by factors that are not presently known to us or that we currently consider to be immaterial. You should carefully consider the risks described below in addition to the other information set forth in this Annual Report on Form 10-K, including Managements Discussion and Analysis of Financial Condition and Results of Operations (MD&A) and the consolidated financial statements and accompanying notes (the Financial Statements).\nRisks Relating to Our Strategy and Operations\nOur success depends on our ability to gain profitable business despite competitive market pressures.\nEach market we provide services for is highly competitive and such competition is based primarily on price, quality of service, reputation, and ability to anticipate and respond to industry changes. A majority of our revenue is derived from services that require competitive bids from multiple suppliers. The low barrier of entry in the facility services business results in a very competitive market. We compete mainly with regional and local owner-operated companies that may have more insight into local market dynamics and significantly lower operating costs, which could provide them with a competitive advantage in those regards. We also compete indirectly with companies that can perform for themselves one or more of the services we provide. Further, if we are unable to respond adequately to market shifts and changing technology, we may lose existing clients and fail to win future business opportunities. A failure to respond effectively to competitive pressures or failure in our ability to increase prices as costs rise could reduce margins and materially adversely affect our financial performance.\nOur results of operations can be adversely affected by labor shortages, turnover, and labor cost increases.\nWe employ approximately 123,000 persons, and our operations depend on the services of a large and diverse workforce. We must attract, train, and retain a large and growing number of qualified employees while controlling related labor costs. Our ability to control labor and benefit costs is subject to numerous internal and external factors, including changes in the unemployment rate, changes in immigration policy, regulatory changes, prevailing wage rates, and competition we face from other companies for similarly skilled employees. During 2023, we continued to be impacted by labor shortages, inflationary pressures on wages, and an increasingly competitive labor market. Continued labor shortages or increased turnover rates within our employee base could lead to increased costs, such as increased overtime incurred and/or increased usage of temporary labor to meet the demands of our customers, as well as increased wage rates to attract and retain employees. Further, many of our contracts provide that our clients pay certain costs at specified rates, such as insurance, healthcare costs, salary and salary-related expenses, and other costs. If actual costs exceed the rates specified in the contracts, our profitability may be negatively impacted. There is no assurance that in the future we will be able to attract or retain qualified employees or effectively manage labor and benefit costs, which could have a material adverse effect on our business, financial condition, and results of operations.\nWe may not be able to attract and retain qualified personnel and senior management we need to support our business.\nOur future performance depends on the continuing efforts and contributions of our senior management and on our continued ability to attract and retain qualified personnel. Unplanned turnover in senior management or inability to attract and retain qualified personnel could have a negative effect on our results of operations. In addition, activities related to identifying, recruiting, hiring, and integrating qualified management employees may require significant time and expense. We may not be able to locate suitable replacements for any key employees who leave, or offer employment to potential replacements on reasonable terms, each of which may adversely affect our business and financial results.\nInvestments in and changes to our businesses, operating structure, or personnel relating to our ELEVATE strategy, including the implementation of strategic transformations, enhanced business processes, and technology initiatives, may not have the desired effects on our financial condition and results of operations.\nWe have made significant investments and expect to make additional investments in various initiatives intended to drive long-term profitable growth and increase operational efficiency. These investments in and changes\nto our business systems and processes may not create the growth, operational efficiencies, competitive advantage, or cost benefits that we expect and could result in unanticipated consequences, including disruptions to our back-office operations and service delivery. Moreover, the execution and/or benefits of our ELEVATE strategy may not be realized on the expected timeline and/or may result in expenses in excess of what is currently forecast, which could negatively affect our financial condition.\nOur ability to preserve long-term client relationships is essential to our continued success.\nWe depend to a large extent on our relationships with clients and our reputation for quality integrated facility solutions. Maintaining our existing client relationships, particularly with our largest clients, is an important factor contributing to our business success. We primarily provide services pursuant to agreements that are cancelable by either party upon 30 to 90 days notice. As we generally incur higher initial costs on new contracts until the labor management and facilities operations normalize, our business associated with long-term client relationships is generally more profitable than short-term client relationships. If we lose a significant number of long-term clients and/or all or a portion of the services for our larger clients, our financial results could be negatively impacted.\nOur use of subcontractors or joint venture partners to perform work under customer contracts exposes us to liability and financial risk.\nWe depend on subcontractors or other parties, such as joint venture partners, to perform work in situations in which we are not able to self-perform the work involved. Such arrangements may involve subcontracts or joint venture relationships where we do not have direct control over the performing party. We may be exposed to liability whenever one or more of our subcontractors or joint venture partners, for whatever reason, fails to perform or allegedly negligently performs the agreed-upon services. Although we have controls and programs in place to monitor the work of our subcontractors and our joint venture partners, there can be no assurance that these controls or programs will have the desired effect, and we may incur significant liability as a result of the actions or inactions of one or more of our subcontractors or joint venture partners.\nOur international business involves risks different from those we face in the United States that could negatively impact our results of operations and financial condition.\nWe have business operations in jurisdictions outside of the United States, most significantly in the UK and Ireland. Our international operations are subject to risks that are different from those we face in the United States and subject us to complex and frequently changing laws and regulations, including differing labor laws and regulations relating to the protection of certain information that we collect and maintain about our employees, clients, and other third parties. Among these laws is the UK Modern Slavery Act, the Criminal Law (Human Trafficking) Act 2008 (Ireland), the UK Bribery Act, the Criminal Justice (Corruption Offences) Act 2018 (Ireland), and the UK and European Union General Data Protection Regulations (the GDPR). The failure to comply with these laws or regulations could subject us to significant litigation, monetary damages, regulatory enforcement actions, or fines in one or more jurisdictions.\nIn addition, when we participate in joint ventures that operate outside of the United States where we are not a controlling party, we may have limited control over the joint venture. Any improper actions by our joint venture employees, partners, or agents, including, but not limited to, failure to comply with the U.S. Foreign Corrupt Practices Act, the UK Bribery Act, and/or laws relating to human trafficking, could result in civil or criminal investigations, monetary and non-monetary penalties, or other consequences, any of which could have an adverse effect on our financial position as well as on our reputation and ability to conduct business.\nAdditionally, the operating results of our non-U.S. subsidiaries are translated into U.S. dollars, and those translations are affected by movements in foreign currencies relative to the U.S. dollar. There can be no assurance that the foregoing factors will not have a material adverse effect on our international operations or on our consolidated financial condition and results of operations.\nRisks Relating to Market and Economic Conditions\nDecreases in commercial office space utilization due to hybrid work models could adversely affect our financial condition.\nA key part of our business involves providing janitorial, facilities engineering, and parking services for commercial office building properties. Across the United States, vacant office spaces have increased and total office space under construction has decreased, compared to pre-pandemic levels. Driven by lower in-office occupancy,\nlessees are projected to continue to decrease their office space requirements as existing leases expire or are renewed and/or renegotiated over the next several years. As existing clients decrease office space, the areas that we service for those clients decreases as does the demand for our highly profitable supplemental services (work orders) requested by our clients outside the scope of our standard service specifications. As new tenants occupy vacant office spaces, there may be delays and additional expenses incurred in securing client relationships with such new tenants. These factors could adversely affect our revenues and financial results.\nNegative changes in general economic conditions, such as recessionary pressures, high interest rates, durable and non-durable goods pricing, changes in energy prices, or changes in consumer goods pricing could reduce the demand for our services and, as a result, reduce our revenue and earnings and adversely affect our financial condition.\nSlowing economic activity or other negative changes in global, national, and local economic conditions could have a negative impact on our business. These adverse economic conditions could cause a decline in our clients demand for our services and/or in scope of work, including work orders and our clients ability to pay for such services, or attempts by our clients to defer payments owed to us. Further, potential declines in economic conditions could result in depressed prices for our services, which could affect our financial condition.\nWe offer a portfolio of capital projects, which are designed to reduce a clients overall consumption of commodities, such as electricity and natural gas. Downward fluctuations in commodity prices, and/or elevated interest rates, may reduce client demand for such projects. Additionally, we depend, in part, on federal and state legislation and policies that support energy efficiency projects. If current legislation or policies are amended, eliminated, or not extended beyond their current expiration dates, or if funding for energy incentives is reduced or delayed, it could also adversely affect our ability to obtain new capital projects. All of these factors could have an adverse effect on our financial condition, results of operations, and cash flows.\nRisks Relating to Acquisitions, Divestitures, or Strategic Transactions\nAcquisitions, divestitures, and other strategic transactions could fail to achieve financial or strategic objectives, disrupt our ongoing business, and adversely impact our results of operations.\nIn furtherance of our business strategy, we routinely evaluate opportunities and may enter into agreements for possible acquisitions, divestitures, or other strategic transactions. A significant portion of our growth has been generated by acquisitions, and we may continue to acquire businesses in the future as part of our growth strategy. However, we may encounter challenges identifying opportunities in a timely manner or on terms acceptable to us. Furthermore, there is no assurance that any such transaction will result in synergistic benefits. A potential acquisition, divestiture, or other strategic transaction may involve a number of risks including, but not limited to:\nthe transaction may not effectively advance our business strategy, and its anticipated benefits may never materialize;\nour ongoing operations may be disrupted, and management time and focus may be diverted;\nclients or key employees of an acquired business may not remain, which could negatively impact our ability to grow that acquired business;\nintegration of an acquired businesss accounting, information technology, HR, and other administrative systems may fail to permit effective management and expense reduction;\nunforeseen challenges may arise in implementing internal controls, procedures, and policies;\nadditional indebtedness incurred as a result of an acquisition may impact our financial position, results of operations, and cash flows; and\nunanticipated or unknown liabilities may arise related to an acquired business.\nRisks Relating to Information Technology and Cybersecurity\nWe may experience breaches of, or disruptions to, our information technology systems or those of our third-party providers or clients, or other compromises of our data that could adversely affect our business.\nOur information technology systems and those of our third-party providers or clients could be the target of cyberattacks, ransomware attacks, hacking, unauthorized access, phishing, computer viruses, malware, or other\nintrusions, which could result in operational disruptions or information misappropriation, such as theft of intellectual property or inappropriate disclosure of confidential, proprietary, or personal information. We maintain confidential, proprietary, and personal information in our information technology systems and in systems of third-party providers relating to our current, former, and prospective employees, clients, and other third parties. We have experienced certain data and security breaches in the past and could experience future data or security breaches stemming from the intentional or negligent acts of our employees or other third parties. Furthermore, while we continue to devote significant resources to monitoring and updating our systems and implementing information security measures to protect our systems, there can be no assurance that the controls and procedures we have in place will be sufficient to protect us from future security breaches. As cyber threats are continually evolving, our controls and procedures may become inadequate and we may be required to devote additional resources to modifying or enhancing our systems in the future. We may also be required to expend resources to remediate cyber-related incidents or to enhance and strengthen our cybersecurity.\nAny such disruptions to our information technology systems, breaches or compromises of data, and/or misappropriation of information could result in lost sales, negative publicity, litigation, violations of privacy and other laws, or business delays that could have a material adverse effect on our business. Additionally, we believe that along with the GDPR and the California Consumer Privacy Act further increased regulation is likely in the area of data privacy. Compliance with this rapidly expanding area of law will require significant management and financial resources, and we could be subjected to additional legal risk or financial losses if we are not in compliance. This expanding area of law may also lead to potentially significant additional claims, including class action claims, being alleged against us.\nOur ongoing implementation of new enterprise resource planning (ERP) and related boundary systems could adversely impact our ability to operate our business and report our financial results.\nWe utilize multiple platforms and ERP systems to record transactions, provide information to management, and prepare our financial statements. We are in the process of transitioning our ERP and other key boundary systems. This transition began in the third quarter of 2023 and will continue for the next couple of years. While we believe our new ERP and boundary systems will enhance and standardize our processes, allow better oversight, and improve our service to our customers, any disruption to this transition could impact our ability to send and track invoices, process vendor payments, pay employees, fulfill contractual obligations, report our financial results, or otherwise operate our business. Such disruption could adversely affect our profitability and reputation. Additionally, any disruption could negatively impact the effectiveness of our controls. Refer to Risk Relating to Financial Matters below for further information on the internal controls.\nRisks Relating to Insurance and Safety Matters\nWe manage our insurable risks through a combination of third-party purchased policies and self-insurance, and we retain a substantial portion of the risk associated with expected losses under these programs, which exposes us to volatility associated with those risks, including the possibility that changes in estimates to our ultimate insurance loss reserves could result in material charges against our earnings.\nWe use a combination of insured and self-insurance programs to cover workers compensation, general liability, automobile liability, property damage, and other insurable risks. We are responsible for claims both within and in excess of our retained limits under our insurance policies, and while we endeavor to purchase insurance coverage that is appropriate to our assessment of risk, we are unable to predict with certainty the frequency, nature, or magnitude of claims for direct or consequential damages. If our insurance coverage proves to be inadequate or unavailable, our business may be negatively impacted.\nThe determination of required insurance reserves is dependent upon actuarial judgments. We use the results of actuarial studies to estimate insurance rates and insurance reserves for future periods and to adjust reserves, if appropriate, for prior years. Actual experience related to our insurance reserves can cause us to change our estimates for reserves and any such changes may materially impact results, causing significant volatility in our operating results.\nShould we be unable to renew our excess, umbrella, or other commercial insurance policies, it could have a material adverse impact on our business, as would the incurrence of catastrophic uninsured claims or the inability or refusal of our insurance carriers to pay otherwise insured claims. Further, to the extent that we self-insure our losses, deterioration in our loss control and/or our continuing claim management efforts could increase the overall cost of claims within our retained limits. A material change in our insurance costs due to changes in the frequency of\nclaims, the severity of the claims, the costs of excess/umbrella premiums, or regulatory changes could have a material adverse effect on our financial position, results of operations, or cash flows.\nIn 2015, we formed a wholly owned captive insurance company, IFM Assurance Company (IFM), which we believe has provided us with increased flexibility in the end-to-end management of our insurance program. There can be no assurance that IFM will continue to bring about the intended benefits or the desired flexibility in the management of our insurance programs, because we may experience unanticipated events that could reduce or eliminate expected benefits.\nOur risk management and safety programs may not have the intended effect of reducing our liability for personal injury or property loss.\nWe attempt to mitigate risks relating to personal injury or property loss through the implementation of company-wide safety and loss control efforts designed to decrease the frequency of accidents or events that might increase our liability. However, incidents involving personal injury or property loss may be caused by multiple potential factors, a significant number of which are beyond our control. Therefore, there can be no assurance that our risk management and safety programs will have the desired effect of controlling costs and liability exposure.\nRisks Relating to Labor, Legal Proceedings, Tax, and Regulatory Matters\nUnfavorable developments in our class and representative actions and other lawsuits alleging various claims could cause us to incur substantial liabilities.\nOur business involves employing tens of thousands of employees, many of whom work at our clients facilities. We incur risks relating to our employment of these workers, including, but not limited to: claims by our employees of discrimination, harassment, violations of wage and hour requirements, or violations of other federal, state, or local laws; claims of misconduct or negligence on the part of our employees; and claims related to the employment of unlicensed personnel. We also incur risks and claims related to the imposition on our employees of policies or practices of our clients that may be different from our own. Some or all of these claims may lead to litigation, including class action litigation, and these matters may cause us to incur negative publicity with respect to alleged claims. Additionally, there are risks to all employers in some states, such as California, resulting from new and unanticipated judicial interpretations of existing laws and the application of those new interpretations against employers on a retroactive basis. It is not possible to predict the outcome of these lawsuits or any other proceeding, and our insurance may not cover all claims that may be asserted against us. These lawsuits and other proceedings may consume substantial amounts of our financial and managerial resources. An unfavorable outcome with respect to these lawsuits and any future lawsuits may, individually or in the aggregate, cause us to incur substantial liabilities that could have a material adverse effect upon our business, reputation, financial condition, results of operations, or cash flows.\nWe are subject to extensive legal and regulatory requirements, which could limit our profitability by increasing the costs of legal and regulatory compliance.\nOur business is subject to a complicated set of federal, state, and local laws and regulations as well as stakeholder views addressing, among other things, wage and hour standards, employment and labor relations, ESG-related practices, leave of absence, cybersecurity, data privacy and protection, occupational health and safety, environmental matters, anti-competition, anti-corruption, and government contracting. Many of these laws and regulations may have differing or conflicting legal standards or legal interpretations across jurisdictions, increasing the complexity and cost of compliance. When federal, state, local, or foreign minimum wage rates increase, we may have to increase the wages of both minimum wage employees and employees whose wages are above the minimum wage. We may also face increased operating costs resulting from changes in federal, state, or local laws and regulations relating to employment matters, including those relating to meal and rest breaks, eligibility for overtime, pay transparency and reporting, sick pay, and predictive scheduling requirements. In addition, we expect there will likely be increasing levels of regulation, disclosure-related and otherwise, with respect to ESG matters, and increased regulation will likely lead to increased compliance costs as well as scrutiny that could heighten all of the risks identified in this risk factor. Increased costs of legal and regulatory compliance with this constantly evolving legal and regulatory environment could reduce our profitability and adversely affect our financial condition.\nA significant number of our employees are covered by collective bargaining agreements that could expose us to potential liabilities in relation to our participation in multiemployer pension plans, requirements to make contributions to other benefit plans, and the potential for strikes, work slowdowns or similar activities, and union organizing drives.\nWe participate in various multiemployer pension plans that provide defined pension benefits to employees covered by collective bargaining agreements. Because of the nature of multiemployer pension plans, there are risks to us associated with participation in these plans that differ from single-employer plans. Assets contributed by an employer to a multiemployer pension plan are not segregated into a separate account and are not restricted to provide benefits only to employees of that contributing employer. In the event another participating employer in a multiemployer pension plan no longer contributes to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers, including us. In the event of the termination of a multiemployer pension plan or a complete or partial withdrawal from a multiemployer pension plan, under applicable law we could incur material withdrawal liabilities. We further discuss our participation in multiemployer pension and postretirement plans in Note 12, Employee Benefit Plans, in the Notes to consolidated financial statements. In addition, the terms of collective bargaining agreements require us to contribute to various fringe benefit plans, including health and welfare, pension, and training plans, all of which require us to have appropriate systems in place to assure timely and accurate payment of contributions. The failure to make timely and accurate contributions as a result of a systems failure could have a negative impact on our financial position.\nAt October 31, 2023, approximately 37% of our employees were subject to various local collective bargaining agreements, some of which will expire or become subject to renegotiation during 2024. In addition, at any given time we may face union organizing activity. When one or more of our major collective bargaining agreements becomes subject to renegotiation or when we face union organizing drives, any disagreement between us and the union on important issues may lead to a strike, work slowdown, or other job actions at one or more of our locations. In a market where we are unionized but competitors are not unionized, we could lose clients to such competitors. A strike, work slowdown, or other job action could disrupt our services, resulting in reduced revenues or contract cancellations. Moreover, negotiating a first time collective bargaining agreement or renegotiating an existing agreement could result in increases in labor and benefits expenses that we may be unable to pass through to clients.\nOur business may be materially affected by changes to fiscal and tax policies. Negative or unexpected tax consequences could adversely affect our results of operations.\nWe are subject to a variety of taxes and tax collection and remittance obligations in the United States and foreign jurisdictions, primarily the UK and Ireland. We compute our income tax provision based on enacted tax rates in the jurisdictions in which we operate. As tax rates vary among taxing jurisdictions, a change in earnings attributable to the various jurisdictions in which we operate could result in an unfavorable change in our overall tax provision. Additionally, at any point in time, we may be under examination from taxing jurisdictions. We regularly assess the likelihood of adverse outcomes resulting from these audits to determine the adequacy of our income tax related provision. We may recognize additional tax expense, be subject to additional tax liabilities, or incur losses and penalties due to adverse outcomes in tax audits or changes in laws, regulations, treaties, administrative practices, principles, assessments by authorities, and interpretations related to tax laws, including tax rules in various jurisdictions, which could have an adverse effect on our operating results and financial condition.\nRisks Relating to Financial Matters\nFuture increases in the level of our borrowings or in interest rates could affect our results of operations.\nThe Federal Reserve Board increased interest rates in 2022 and 2023, and these increases may continue in 2024 and beyond. Such rate increases have corresponding impact to our costs of borrowing and may have an adverse impact on our ability to raise funds through the offering of our securities or through the issuance of debt due to higher debt capital costs, diminished credit availability, and less favorable equity markets. Any significant additional federal fund rate increases may have a material adverse effect on our business, results of operations, and financial condition, and may cause our customers to implement cost saving strategies that could reduce the demand of our services.\nOur future ability to make payments on our debt, fund our other liquidity needs, and make planned capital expenditures will depend on our ability to generate cash. Our ability to generate cash, to a certain extent, is subject to general economic, financial, competitive, and other factors that are beyond our control. We cannot guarantee that our business will generate sufficient cash flow from our operations or that future borrowings will be available to us in an amount sufficient to enable us to service our debt, fund other liquidity needs, make planned capital expenditures, or continue our dividend.\nThe degree to which we are leveraged could have important consequences for shareholders. For example, being highly leveraged could: require us to dedicate a substantial portion of our cash flows from operations to the\npayment of debt service, reducing the availability of our cash flow to fund working capital, share repurchases, capital expenditures, acquisitions, and other general corporate purposes; limit our availability to obtain additional financing in the future to enable us to react to changes in our business; and place us at a competitive disadvantage compared to businesses in our industry that have less debt.\nFurther, our credit facility contains both financial covenants and other covenants that limit our ability to engage in specific transactions. Any failure to comply with covenants in the credit facility could result in an event of default that, if not cured or waived, would have a material adverse effect on us.\nImpairment of goodwill and long-lived assets could have a material adverse effect on our financial condition and results of operations.\nWe evaluate goodwill for impairment annually, in the fourth quarter, or more often if impairment indicators exist. We also review long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. If the fair value of one of our reporting units is less than its carrying value, or if as a result of a recoverability test we conclude that the projected undiscounted cash flows are less than the carrying amount, we would record an impairment charge related to goodwill or long-lived assets, respectively. (For example, during the second quarter of 2020, given the general deterioration in economic and market conditions arising from the COVID-19 pandemic (the Pandemic), we identified a triggering event that resulted in the impairment of goodwill and intangible assets.) The assumptions used to determine impairment require significant judgment, and the amount of the impairment could have a material adverse effect on our reported financial results for the period in which the charge is taken.\nIf we fail to maintain proper and effective internal control over financial reporting in the future, our ability to produce accurate and timely financial statements could be negatively impacted, which could harm our operating results and investor perceptions of our Company and as a result may have a material adverse effect on the value of our common stock.\nPursuant to Section 404 of the Sarbanes-Oxley Act of 2002 and related rules, our management is required to report on, and our independent registered public accounting firm is required to attest to, the effectiveness of our internal control over financial reporting. The rules governing the standards that must be met for management to assess our internal control over financial reporting are complex and require significant documentation, testing, and, in some instances, remediation. We have acquired entities that had no publicly traded debt or equity and therefore were not previously required to conform to the rules and regulations of the SEC, especially related to their internal control structure. When we acquire such entities, they may not have in place all the necessary controls as required by the Public Company Accounting Oversight Board. Integrating acquired entities into our internal control over financial reporting has required and will continue to require significant time and resources from our management and other personnel, which increases our compliance costs. We are required to include our assessment of the effectiveness of the internal controls over financial reporting of entities we acquire in our overall assessment, so we must plan to complete the evaluation and integration of internal controls over financial reporting and report our assessment within the required time frame.\nIn addition, with the increasing frequency of cyber-related frauds perpetrated to obtain inappropriate payments, we need to ensure our internal controls related to authorizing the transfer of funds and changing our vendor master files are adequate. Furthermore, the introduction of new, and changes to existing, ERP and financial reporting information systems create implementation and change management risks that require effective internal controls to mitigate. Failure to maintain an effective internal control environment could have a material adverse effect on our ability to accurately report our financial results, the markets perception of our business, and our stock price.\nGeneral Risk Factors\nOur business may be negatively impacted by adverse weather conditions.\nWeather conditions such as snow storms, heavy flooding, hurricanes, and fluctuations in temperatures can negatively impact portions of our business. Within our Technical Solutions segment, cooler than normal temperatures in the summer could reduce the need for servicing of air conditioning units, resulting in reduced revenues and profitability. Within Parking and Aviation services and portions of our Technical Solutions business, adverse weather conditions can lead to reduced activity, as well as increases in certain costs, both of which negatively affect gross profit. On the other hand, the absence of snow during the winter could cause us to\nexperience reduced revenues in our B&I segment, as many of our contracts specify additional payments for snow-related services.\nCatastrophic events, disasters, pandemics, and terrorist attacks could disrupt our services.\nWe may encounter disruptions involving power, communications, transportation or other utilities, or essential services depended upon by us or by third parties with whom we conduct business. This could include disruptions due to disasters, pandemics, weather-related or similar events (such as fires, hurricanes, blizzards, earthquakes, and floods), political instability, labor strikes, or war (including acts of terrorism or hostilities) that could impact our markets. If a disruption occurs in one location and persons in that location are unable to communicate with or travel to or work from other locations, our ability to service and interact with our clients and others may suffer, and we may not be able to successfully implement contingency plans that depend on communications or travel. These events may increase the volatility of financial results due to unforeseen costs with partial or no corresponding compensation from clients. There also can be no assurance that the disaster recovery and crisis management procedures we employ will suffice in any particular situation to avoid a significant loss. In addition, to the extent centralized administrative locations are disabled for a long period of time, key business processes, such as accounts payable, information technology, payroll, and general management operations, could be interrupted.\nActions of activist investors could disrupt our business.\nPublic companies have been the target of activist investors. In the event that a third party, such as an activist investor, proposes to change our governance policies, board of directors, or other aspects of our operations or strategy, our review and consideration of such proposals may create a significant distraction for our management and employees. This could negatively impact our ability to execute various strategic initiatives and may require management to expend significant time and resources responding to such proposals. Such proposals may also create uncertainties with respect to our financial position and operations and may adversely affect our ability to attract and retain key employees. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES.\nOur principal executive office is located at One Liberty Plaza, 7th Floor, New York, New York 10006.\nPrincipal Properties as of October 31, 2023\nLocation Character of Office Approximate Square Feet Lease Expiration Date, Unless Owned Segment\nDallas, Texas Warehouse and Operations Support 27,500 9/30/2028 Technical Solutions, B&I, Aviation, Corporate, and M&D\nAtlanta, Georgia Operations Support 37,000 10/31/2027 All\nNew York, New York Corporate Headquarters 44,000 1/3/2032 Corporate and B&I\nSugar Land, Texas Enterprise Services 62,500 3/31/2028 All\nTustin, California Operations Support 40,000 7/31/2029 B&I and Technical Solutions\nSan Francisco, California Operations Support 21,324 6/30/2029 B&I and Corporate\nCummings, Georgia Operations Support 57,637 1/31/2034 Technical Solutions\nIn addition to the above properties, we have other offices, warehouses, and parking facilities in various locations, primarily in the United States. See Note 5, Leases, in the Notes to consolidated financial statements for additional information regarding leases. We believe that these properties are well-maintained, in good operating condition, and suitable for the purposes for which they are used. ITEM 3. LEGAL PROCEEDINGS.\nInformation with respect to legal matters is set forth in Note 13, Commitments and Contingencies, in the Notes to consolidated financial statements (included in Part II., Item 8 of this Form 10-K) and is incorporated herein by reference. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information, Dividends, and Stockholders\nOur common stock is listed on the New York Stock Exchange (NYSE: ABM). We have paid cash dividends every quarter since 1965. Future dividends will be determined based on our earnings, capital requirements, financial condition, and other factors considered relevant by our Board of Directors.\nAt December 15, 2023, there were 2,945 registered holders of our common stock.\nCommon Stock Repurchases\nEffective December 18, 2019, our Board of Directors replaced our then-existing share repurchase program with a new share repurchase program under which we may repurchase up to $150.0 million of our common stock (the Share Repurchase Program). Effective December 9, 2022, and December 13, 2023, our Board of Directors expanded the Share Repurchase Program by $150.0 million and $150.0 million, respectively. Share repurchases may take place on the open market or otherwise, and all or part of the repurchases may be made pursuant to Rule 10b5-1 plans or in privately negotiated transactions. The timing of repurchases is at our discretion and will depend upon several factors, including market and business conditions, future cash flows, share price, share availability, and other factors. Repurchased shares are retired and returned to an authorized but unissued status. At October 31, 2023, authorization for $60.3 million of repurchases remained under the Share Repurchase Program.\nIssuer Purchases of Equity Securities\n(in millions, except per share amounts) Total Number of Shares Purchased Average Price Paid per Share(1)\nTotal Number of Shares Purchased as Part of Publicly Announced Plan Approximate Dollar Value of Shares that May Yet Be Purchased Under the Plan\nPeriod\n8/1/2023 - 8/31/2023\n- - $ - $ 170.3\n9/1/2023 - 9/30/2023\n$ 1.4 $ 40.24 $ 1.4 $ 115.3\n10/1/2023 - 10/31/2023\n1.3 $ 41.41 1.3 $ 60.3\nTotal 2.7 $ 40.82 2.7\n(1) Average price paid per share does not include any excise tax for stock repurchases as part of the Inflation Reduction Act of 2022.\nPerformance Graph\nThe following graph compares the five-year cumulative total return for our common stock against the Standard & Poors 500 Index (S&P 500) and the Standard & Poors SmallCap 600 Index (S&P 600). As our competitors are principally privately held, we do not believe it is feasible to construct a peer group comparison on an industry or line-of-business basis.\nINDEXED RETURNS\nYears Ended October 31,\nCompany / Index 2018 2019 2020 2021 2022 2023\nABM Industries Incorporated $ 100.0 $ 121.0 $ 117.8 $ 151.9 $ 156.5 $ 141.2\nS&P 500 Index $ 100.0 114.3 125.4 179.3 153.1 168.6\nS&P SmallCap 600 Index $ 100.0 103.2 95.3 151.4 133.5 123.3\nThis performance graph shall not be deemed to be soliciting material or filed with the SEC, or subject to Regulation 14A or 14C, or subject to the liabilities of Section 18 of the Securities Exchange Act of 1934, as amended. The comparisons in the performance graph are based on historical data and are not indicative of, or intended to forecast, the possible future performance of our common stock. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following MD&A is intended to facilitate an understanding of the results of operations and financial condition of ABM. This MD&A is provided as a supplement to, and should be read in conjunction with, our Financial Statements. This MD&A contains both historical and forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995, that involve risks and uncertainties. We make forward-looking statements related to future expectations, estimates, and projections that are uncertain and often contain words such as anticipate, believe, could, estimate, expect, forecast, intend, likely, may, outlook, plan, predict, should, target, or other similar words or phrases. These statements are not guarantees of future performance and are subject to known and unknown risks, uncertainties, and assumptions that are difficult to predict. Factors that might cause such differences include, but are not limited to, those discussed in Part 1. of this Form 10-K under Item 1A., Risk Factors, which are incorporated herein by reference. Our future results and financial condition may be materially different from those we currently anticipate. Throughout the MD&A, amounts and percentages may not recalculate due to rounding. Unless otherwise indicated, all information in the MD&A and references to years are based on our fiscal year, which ends on October 31.\nBusiness Overview\nABM is a leading provider of integrated facility solutions, customized by industry, with a mission to make a difference, every person, every day. Our principal operations are in the United States, and in 2023 our U.S. operations generated approximately 93% of our revenues.\nStrategic Growth\nWe remain focused on long-term, profitable growth by delivering valued service offerings to both new and existing clients within our industry groups and across our many service lines. Our revenue growth strategy is predicated on pursuing new sales and targeting a favorable retention rate among existing contracts. Cross-selling and up-selling projects and services is also an integral part of our strategy. We believe our strategic growth initiatives, coupled with our continued focus on marketing, capital, and sales resources, will increase profitability.\nELEVATE Transformation\nThrough our ELEVATE strategy, as described in Item 1., Business., we continue to focus our efforts on:\nthe client experience, by serving as a trusted advisor who can provide innovative multiservice solutions and consistent service delivery;\nthe team member experience, by investing in workforce management, training, developing the next generation of ABM leaders, and building on our inclusive culture; and\nour use of technology and data to power client and employee experiences with cutting-edge data and analytics, processes, and tools that we expect to fundamentally change how we operate our business.\nWe believe that our technology and data investments will enable: the development and deployment of client-facing technology to improve service delivery to our clients; the use of advanced data analytics for sales targeting, employee retention, and recruiting; and the upgrade of our Enterprise Resource Planning and payroll systems.\nDevelopments and Trends\nMacro-Economic Environment in Commercial Real Estate and Other\nWe actively monitor the economic environment and its potential impact on demand for our services and our financial condition. Largely driven by the lingering effects of the Pandemic, especially the normalization of hybrid work, the commercial real estate industry, particularly multi-tenant and owner-occupied commercial office buildings, is experiencing an increase in vacancy rates. Given that Class A and high-quality commercial office buildings are a key end market for the Company, we expect a decline in demand for janitorial services and work orders in these markets near-term. As a result, we expect our B&I industry to experience muted growth in the near-term. Longer term, we expect the vacancy rates of Class A and high-quality buildings to gradually decrease and our volume of work to stabilize.\nWe expect a large client within M&D to rebid and rebalance their work needs in 2024 as part of their procurement process. While we still expect to retain a large portion of this business, we expect M&Ds financial results to be impacted in the near-term.\nInsurance Reserves\nWe use a combination of insured and self-insurance programs to cover workers compensation, general liability, automobile liability, property damage, and other insurable risks. Insurance claim liabilities represent our estimate of retained risks without regard to insurance coverage. We retain a substantial portion of the risk related to certain workers compensation and medical claims. Liabilities associated with these losses include estimates of both filed claims and incurred but not reported claims (IBNR Claims).\nWith the assistance of third-party actuaries, we review our estimate of ultimate losses for IBNR Claims on a quarterly basis and adjust our required self-insurance reserves as appropriate. As part of this evaluation, we review the status of existing and new claim reserves as established by third-party claims administrators. The third-party claims administrators establish the case reserves based upon known factors related to the type and severity of the claims, demographic factors, legislative matters, and case law, as appropriate. We compare actual trends to expected trends and monitor claims developments. The specific case reserves estimated by the third-party administrators are provided to the actuary who assists us in projecting an actuarial estimate of the overall ultimate losses for our self-insured or high deductible programs, which includes the case reserves plus an actuarial estimate of reserves required for additional developments, such as IBNR Claims. We utilize the results of actuarial studies to estimate our insurance rates and insurance reserves for future periods and to adjust reserves, if appropriate, for prior years.\nThe actuarial reviews demonstrate that the changes we have made to our risk management program continue to positively impact the frequency and severity of claims. Furthermore, we continue to adjust our reserves consistent with known fact patterns. Based on the results of the actuarial reviews performed, we decreased our total reserves related to prior years for known claims as well as our estimate of the loss amounts associated with IBNR Claims during 2023 by $14.8 million. In 2022, we decreased our total reserves related to prior year claims by $36.8 million.\nKey Financial Highlights\nRevenues increased by $289.8 million, or 3.7%, to $8,096.4 million during 2023, as compared to 2022. Revenue growth was comprised of organic growth of 2.4% and acquisition growth of 1.3%. Acquisition growth of $104.4 million was driven by the RavenVolt and Momentum acquisitions, completed in the fourth and second quarter of 2022, respectively. Organic growth was primarily driven by the strong leisure and business travel markets served by Aviation, expansion of new business and growth with current customers in M&D, and net new business wins in Education. The increase in revenues was partially offset by a decrease in the overall volume of work orders, lower project revenues within Technical Solutions, and soft commercial office market conditions in B&I.\nOperating profit increased by $60.7 million to $409.5 million during 2023, as compared to 2022. The increase in operating profit was attributable to the revenue increase and:\na decrease in the fair value of the contingent consideration related to the RavenVolt Acquisition; and\nan Employee retention credit (ERC) refund received.\nThe increase was partially offset by:\na decrease in favorable self-insurance adjustments related to prior year claims as a result of actuarial evaluations completed on our workers compensation, general liability, automobile liability, and property damage insurance plans; and\na decrease in work orders, which are generally more profitable than contracted service.\nOur effective tax rate on income was 24.1% for 2023, as compared to 25.7% during 2022.\nNet cash provided by operating activities was $243.3 million during 2023. Our net cash provided by operating cash activities were higher than prior year, primarily due to the timing of certain working capital requirements, which included a $143.8 million payment for the Bucio case in 2022, and the related income tax benefit.\nDividends of $57.5 million were paid to shareholders, and dividends totaling $0.88 per common share were declared during 2023. Additionally, we repurchased 3.3 million of shares for $138.1 million, including excise taxes during 2023.\nAt October 31, 2023, total outstanding borrowings under our Amended Credit Facility were $1,313.8 million, and we had up to $483.0 million of borrowing capacity.\nResults of Operations\nConsolidated\nYears Ended October 31, 2023 vs. 2022\n($ in millions) 2023 2022 2021 Increase / (Decrease)\nRevenues $ 8,096.4 $ 7,806.6 $ 6,228.6 $ 289.8 3.7%\nOperating expenses 7,037.6 6,757.5 5,258.2 280.1 4.1%\nGross margin 13.1 % 13.4 % 15.6 % (36) bps\nSelling, general and administrative expenses 572.8 628.3 719.2 (55.5) (8.8)%\nAmortization of intangible assets 76.5 72.1 45.0 4.4 6.1%\nOperating profit 409.5 348.8 206.3 60.7 17.4%\nIncome from unconsolidated affiliates 3.9 2.4 2.1 1.5 60.1%\nInterest expense (82.3) (41.1) (28.6) (41.2) (99.9)%\nIncome before income taxes\n331.1 310.0 179.8 21.1 6.8%\nIncome tax provision (79.7) (79.6) (53.5) (0.1) (0.2)%\nNet income 251.3 230.4 126.3 20.9 9.1%\nOther comprehensive income\nInterest rate swaps (0.5) 36.7 4.5 (37.2) NM*\nForeign currency translation and other 7.3 (19.8) 5.3 27.1 NM*\nIncome tax provision 0.1 (10.5) (1.5) 10.6 NM*\nComprehensive income $ 258.1 $ 236.9 $ 134.5 $ 21.2 9.0%\n*Not meaningful\nThe Year Ended October 31, 2023, Compared with the Year Ended October 31, 2022\nRevenues\nRevenues increased by $289.8 million, or 3.7%, to $8,096.4 million during 2023, as compared to 2022. Revenue growth was comprised of organic growth of 2.4% and acquisition growth of 1.3%. Acquisition growth of $104.4 million was driven by the RavenVolt and Momentum acquisitions, completed in the fourth and second quarter of 2022, respectively. Organic growth was primarily driven by the strong leisure and business travel markets served by Aviation, expansion of new business and growth with current customers in M&D, and net new business wins in Education. The increase in revenues was partially offset by a decrease in the overall volume of work orders, lower project revenues within Technical Solutions, and soft commercial office market conditions in B&I.\nOperating Expenses\nOperating expenses increased by $280.1 million, or 4.1%, to $7,037.6 million during 2023, as compared to 2022. Gross margin decreased by 36 bps to 13.1% in 2023, as compared to 13.4% in 2022. The decrease in gross margin was primarily driven by the decrease in favorable self-insurance adjustments related to prior year claims as a result of actuarial evaluations completed on our workers compensation, general liability, automobile liability, and property damage insurance plans. In addition, gross margins were impacted by a decrease in work orders, which are generally more profitable than contracted service.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses decreased by $55.5 million, or 8.8%, to $572.8 million during 2023, as compared to 2022. The decrease in selling, general and administrative expenses was primarily attributable to:\na $45.6 million decrease in the fair value of contingent consideration related to the RavenVolt Acquisition;\na $24.0 million benefit from ERC refunds received; and\na $6.6 million decrease in certain technology projects primarily attributable to discrete transformational costs under our ELEVATE strategy for developing the new ERP system, client-facing technology, workforce management tools, and data analytics;\nThis decrease was partially offset by:\na $10.8 million increase in bad debt, of which $7.7 million relates to a favorable adjustment in the prior year;\nan absence of a $7.6 million gain on the sale of a group of customer contracts related to healthcare technology management services within Technical Solutions during 2022; and\na $4.6 million increase in unfavorable self-insurance adjustment related to prior year claims as the result of actuarial evaluations completed on our medical and dental self-insurance plans.\nAmortization of Intangible Assets\nAmortization of intangible assets increased by $4.4 million, or 6.1%, to $76.5 million during 2023, as compared to 2022. This increase was primarily due to the amortization of intangibles acquired as part of the RavenVolt and Momentum acquisitions.\nInterest Expense\nInterest expense increased by $41.2 million, or 99.9%, to $82.3 million during 2023, as compared to 2022, primarily driven by higher interest rates on our debt borrowings.\nIncome Taxes\nDuring 2023 and 2022, we had effective tax rates of 24.1% and 25.7%, respectively, resulting in a provision for tax of $79.7 million and $79.6 million, respectively. . Our effective tax rate for 2023 was impacted by a $12.8 million benefit related to the non-taxable change in the fair value of the contingent consideration related to the RavenVolt Acquisition, a $2.2 million benefit for share-based compensation; and a $1.5 million benefit for return to provision adjustment primarily related to state and local deferred income taxes; partially offset by a $4.8 million expense related to non-deductible executive compensation. Our effective tax rate for 2022 was impacted by the following items: an $8.1 million benefit for uncertain tax positions with expiring statutes; a $1.4 million benefit for share-based compensation; and a $1.3 million return to provision adjustments.\nInterest Rate Swaps\nWe had a loss of $0.5 million on interest rate swaps during the year ended October 31, 2023, as compared to a gain of $36.7 million during the year ended October 31, 2022, primarily due to underlying changes in the fair value of our interest rate swaps.\nForeign Currency Translation and Other\nWe had a foreign currency translation gain of $7.3 million during the year ended October 31, 2023, as compared to a foreign currency translation loss of $19.8 million during the year ended October 31, 2022. This change was due to fluctuations in the exchange rate between the U.S. Dollar (USD) and the British pound sterling (GBP). Future gains and losses on foreign currency translation will be dependent upon changes in the relative value of foreign currencies to the USD and the extent of our foreign assets and liabilities.\nThe Year Ended October 31, 2022, Compared with the Year Ended October 31, 2021\nFor a comparison of our Results of Operations for the year ended October 31, 2022, to the year ended October 31, 2021, see Part II, Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations of our Form 10-K for the fiscal year ended October 31, 2022, filed with the SEC on December 21, 2022.\nSegment Information\nOur current reportable segments consist of B&I, M&D, Education, Aviation, and Technical Solutions.\nFinancial Information for Each Reportable Segment\nYears Ended October 31, 2023 vs. 2022\n($ in millions) 2023 2022 2021 Increase / (Decrease)\nRevenues\nBusiness & Industry $ 4,089.4 $ 4,095.9 $ 2,853.8 $ (6.5) (0.2)%\nManufacturing & Distribution 1,526.7 1,445.2 1,363.1 81.5 5.6%\nEducation 880.4 834.7 830.8 45.7 5.5%\nAviation 925.7 804.0 651.1 121.7 15.1%\nTechnical Solutions 674.2 626.8 529.8 47.4 7.6%\n$ 8,096.4 $ 7,806.6 $ 6,228.6 $ 289.8 3.7%\nOperating profit (loss)\nBusiness & Industry $ 315.6 $ 334.9 $ 285.9 $ (19.3) (5.7)%\nOperating profit margin 7.7 % 8.2 % 10.0 % (46) bps\nManufacturing & Distribution 161.7 161.8 155.5 (0.1) -%\nOperating profit margin 10.6 % 11.2 % 11.4 % (60) bps\nEducation 49.7 47.1 61.5 2.6 5.5%\nOperating profit margin 5.6 % 5.6 % 7.4 % - bps\nAviation 60.0 29.3 32.1 30.7 NM*\nOperating profit margin 6.5 % 3.6 % 4.9 % 283 bps\nTechnical Solutions 53.2 63.8 49.4 (10.6) (16.5)%\nOperating profit margin 7.9 % 10.2 % 9.3 % (228) bps\nGovernment Services - (0.3) (0.2) 0.3 NM*\nOperating profit margin NM* NM* NM* NM*\nCorporate (226.6) (284.5) (374.6) (57.9) 20.3%\nAdjustment for income from unconsolidated\naffiliates, included in Aviation (3.9) (2.4) (2.1) (1.5) (60.1)%\nAdjustment for tax deductions for energy\nefficient government buildings, included in\nTechnical Solutions (0.3) (0.9) (1.2) 0.6 66.8%\n$ 409.5 $ 348.8 $ 206.3 $ 60.7 17.4%\n*Not meaningful\nThe Year Ended October 31, 2023, Compared with the Year Ended October 31, 2022\nBusiness & Industry\nYears Ended October 31,\n($ in millions) 2023 2022 Increase\nRevenues $ 4,089.4 $ 4,095.9 $ (6.5) (0.2)%\nOperating profit 315.6 334.9 (19.3) (5.7)%\nOperating profit margin 7.7 % 8.2 % (46) bps\nB&I revenues decreased by $6.5 million, or 0.2%, to $4,089.4 million during 2023, as compared to 2022. This decrease in revenue was comprised of acquisition growth of 0.8%, offset by organic decrease of 0.9%. Acquisition growth of $32.1 million was driven by the Momentum Acquisition, completed in the second quarter of 2022. Organic decrease was primarily driven by decrease in work orders, soft commercial office market conditions, and the expected attrition of certain engineering clients. Management reimbursement revenues for this segment totaled $270.1 million and $227.8 million during 2023 and 2022, respectively.\nOperating profit decreased by $19.3 million, or 5.7%, to $315.6 million during 2023, as compared to 2022. Operating profit margin decreased by 46 bps to 7.7% in 2023 from 8.2% in 2022. The decrease in operating profit margin was primarily driven by a decrease in work orders, which are generally more profitable than contracted service, the change in contract mix, and an increase in direct labor and related costs due to a limited labor supply in certain non-union markets. The decrease was partially offset by lower amortization of intangible assets.\nManufacturing & Distribution\nYears Ended October 31,\n($ in millions) 2023 2022 Increase\nRevenues $ 1,526.7 $ 1,445.2 $ 81.5 5.6%\nOperating profit 161.7 161.8 (0.1) -%\nOperating profit margin 10.6 % 11.2 % (60) bps\nM&D revenues increased by $81.5 million, or 5.6%, to $1,526.7 million during 2023, as compared to 2022. The increase was primarily attributable to the net new business wins and the expansion of business with existing customers, partially offset by a decrease in work orders.\nOperating profit decreased by $0.1 million, to $161.7 million during 2023, as compared to 2022. Operating profit margin decreased by 60 bps to 10.6% in 2023 from 11.2% in 2022. The decrease in operating profit margin was primarily attributable to the change in contract mix and decrease in work orders, which are generally more profitable than contracted service.\nEducation\nYears Ended October 31,\n($ in millions) 2023 2022 Increase\nRevenues $ 880.4 $ 834.7 $ 45.7 5.5%\nOperating profit 49.7 47.1 2.6 5.5%\nOperating profit margin 5.6 % 5.6 % - bps\nEducation revenues increased by $45.7 million, or 5.5%, to $880.4 million during 2023, as compared to 2022. The increase was primarily attributable to net new business wins, partially offset by a decrease in work orders.\nOperating profit increased by $2.6 million, or 5.5% to $49.7 million during 2023, as compared to 2022. Operating profit margin of 5.6% in 2023 was consistent with 2022. The operating profit margin was positively impacted by labor efficiencies and lower amortization of intangible assets, offset by an increase in start-up supplies to support new business growth and the decrease in work orders, which are generally more profitable than contracted service.\nAviation\nYears Ended October 31,\n($ in millions) 2023 2022 Increase\nRevenues $ 925.7 $ 804.0 $ 121.7 15.1%\nOperating profit 60.0 29.3 30.7 NM*\nOperating profit margin 6.5 % 3.6 % 283 bps\nAviation revenues increased by $121.7 million, or 15.1% to $925.7 million, during 2023, as compared to 2022. The increase was primarily attributable to a recovery in leisure and business travel (both domestic and international) and new parking-related services. In addition, we recognized $11.4 million in revenue from an Aviation parking project, whereby all the direct labor and related costs were recognized in prior periods. The related revenue was not recognized in the prior periods since the criteria for revenue recognition was not met until February 2023. Management reimbursement revenues for this segment totaled $31.8 million and $52.6 million during 2023 and 2022, respectively.\nOperating profit increased by $30.7 million, to $60.0 million during 2023, as compared to 2022. Operating profit margin increased to 6.5% during 2023, from 3.6% during 2022. The increase in operating profit margin was primarily attributable to the $11.4 million in revenue from an Aviation parking project. Operating profit margin was negatively impacted by an increase in direct labor and related costs due to increased headcounts as travel continues to recover.\nTechnical Solutions\nYears Ended October 31,\n($ in millions) 2023 2022 Increase / (Decrease)\nRevenues $ 674.2 $ 626.8 $ 47.4 7.6%\nOperating profit 53.2 63.8 (10.6) (16.5)%\nOperating profit margin 7.9 % 10.2 % (228) bps\nTechnical Solutions revenues increased by $47.4 million, or 7.6%, to $674.2 million during 2023, as compared to 2022. Revenue growth included acquisition growth of 11.5%, which was partially offset by an organic decrease of 3.9%. Acquisition growth of $72.3 million was driven by the RavenVolt Acquisition, which was completed in the fourth quarter of 2022. The organic revenue decrease was primarily driven by the decline in electric vehicle charging station installation sales and lower project revenues due to the timing of completions of certain bundled energy solutions projects.\nOperating profit decreased by $10.6 million, or 16.5%, to $53.2 million during 2023, as compared to 2022. Operating profit margin decreased by 228 bps to 7.9% in 2023 from 10.2% in 2022. The decrease in operating profit margin was primarily attributable to a $7.6 million gain recognized on the sale of a group of customer contracts related to healthcare technology management services recognized in the prior year, and amortization of intangible assets related to the RavenVolt Acquisition, partially offset by the contract mix.\nCorporate\nYears Ended October 31,\n($ in millions) 2023 2022 Decrease\nCorporate expenses $ (226.6) $ (284.5) $ (57.9) 20.3%\nCorporate expenses decreased by $57.9 million, or 20.3%, to $226.6 million during 2023, as compared to 2022. The decrease in corporate expenses was primarily related to:\na $45.6 million decrease in the fair value of contingent consideration related to the RavenVolt Acquisition;\na $24.0 million benefit from ERC refunds received;\na $6.6 million decrease in certain technology projects primarily attributable to discrete transformational costs under our ELEVATE strategy for developing the new ERP system, client-facing technology, workforce management tools, and data analytics;\na $6.4 million decrease in compensation and related expenses primarily due to lower compensation under certain incentive plans; and\na $2.4 million decrease in acquisition and integration costs primarily attributable to our prior years acquisitions.\nThis decrease was partially offset by:\na $22.0 million decrease in favorable self-insurance adjustments related to prior year claims as the result of actuarial evaluations completed on our workers compensation, general liability, automobile liability, and property damage insurance plans; and\na $4.6 million increase in unfavorable self-insurance adjustment related to prior year claims as the result of actuarial evaluations completed on our medical and dental self-insurance plans.\nThe Year Ended October 31, 2022, Compared with the Year Ended October 31, 2021\nFor a comparison of our Segment Information for the year ended October 31, 2022, to the year ended October 31, 2021, see Part II, Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations of our Form 10-K for the fiscal year ended October 31, 2022, filed with the SEC on December 21, 2022.\nLiquidity and Capital Resources\nOur primary sources of liquidity are operating cash flows and borrowing capacity under our credit facility. We assess our liquidity in terms of our ability to generate cash to fund our short- and long-term cash requirements. As such, we project our anticipated cash requirements as well as cash flows generated from operating activities to meet those needs.\nIn addition to normal working capital requirements, we anticipate that our short- and long-term cash requirements will include funding insurance claims, dividend payments, capital expenditures, share repurchases, mandatory loan repayments, and systems and technology transformation initiatives under our ELEVATE strategy. We anticipate long-term cash uses may also include strategic acquisitions. On a long-term basis, we will continue to rely on our credit facility for any long-term funding not provided by operating cash flows.\nWe believe that our operating cash flows and borrowing capacity under our credit facility are sufficient to fund our cash requirements for at least a 12-month period from the issuance of these financial statements. In the event that our plans change or our cash requirements are greater than we anticipate, we may need to access the capital markets to finance future cash requirements. However, there can be no assurance that such financing will be available to us should we need it or, if available, that the terms will be satisfactory to us and not dilutive to existing shareholders.\nDebt Facilities\nOn September 1, 2017, we refinanced and replaced our then-existing $800.0 million credit facility with a new senior, secured five-year syndicated credit facility (the Credit Facility), consisting of a $900.0 million revolving line of credit and an $800.0 million amortizing term loan. In accordance with the terms of the Credit Facility, the revolving line of credit was reduced to $800.0 million on September 1, 2018.\nOn June 28, 2021, the Company amended and restated the Credit Facility (the Second Amendment, and the Credit Facility as amended, the Amended Credit Facility), extending the maturity date to June 28, 2026, and increasing the capacity of the revolving credit facility from $800.0 million to $1.3 billion and the then-remaining term loan outstanding from $620.0 million to $650.0 million. The Amended Credit Facility provides for the issuance of up to $350.0 million for standby letters of credit and the issuance of up to $75.0 million in swingline advances. The obligations under the Amended Credit Facility are secured on a first-priority basis by a lien on substantially all of our assets and properties, subject to certain exceptions. We may repay amounts borrowed under the Amended Credit Facility at any time without penalty.\nAt November 1, 2022, we amended our Amended Credit Facility pursuant to the LIBOR Transition Amendment and the Fifth Amendment to replace the benchmark rate at which U.S.-dollar-denominated borrowings bear interest from LIBOR to the forward-looking SOFR term rate administered by CME Group Benchmark Administration Limited. As a result of these amendments, we can borrow at Term SOFR plus a credit spread adjustment of 0.10% subject to a floor of zero.\nThe Amended Credit Facility contains certain covenants, including a maximum total net leverage ratio of 5.00 to 1.00, a maximum secured net leverage ratio of 4.00 to 1.00, and a minimum interest coverage ratio of 1.50 to 1.00, as well as other financial and non-financial covenants. In the event of a material acquisition, as defined in the Amended Credit Facility, we may elect to increase the maximum total net leverage ratio to 5.50 to 1.00 for a total of four fiscal quarters and increase the maximum secured net leverage ratio to 4.50 to 1.00 for a total of four fiscal quarters. Our borrowing capacity is subject to, and limited by, compliance with the covenants described above. At October 31, 2023, we were in compliance with these covenants and expect to be in compliance in the foreseeable future.\nOn March 1, 2022, we entered into a new uncommitted receivable repurchase facility (the Receivables Facility) of up to $150 million, which expired on March 30, 2023. This facility was considered a secured borrowing and provided the buyer with customary rights of termination upon the occurrence of certain events of default. We have guaranteed all of the sellers obligations under the facility.\nDuring 2023, we made $32.5 million of principal payments under the term loan. At October 31, 2023, the total outstanding borrowings and standby letters of credit were $1,313.8 million and $58.2 million, respectively. At October 31, 2023, we had up to $483.0 million of borrowing capacity.\nReinvestment of Foreign Earnings\nWe plan to reinvest our foreign earnings to fund future non-U.S. growth and expansion, and we do not anticipate remitting such earnings to the United States. While U.S. federal tax expense has been recognized as a result of the Tax Cuts and Jobs Act of 2017, no deferred tax liabilities with respect to federal and state income taxes or foreign withholding taxes have been recognized. We believe that our cash on hand in the United States, along with our Amended Credit Facility and future domestic cash flows, are sufficient to satisfy our domestic liquidity requirements.\nShare Repurchases\nEffective December 18, 2019, our Board of Directors replaced our then-existing share repurchase program with a new share repurchase program under which we may repurchase up to $150.0 million of our common stock. Effective December 9, 2022, and December 13, 2023, our Board of Directors expanded the Share Repurchase Program by $150.0 millionand $150.0 million, respectively. We repurchased shares under the share repurchase program during the year ended October 31, 2023, as summarized below. At October 31, 2023, authorization for $60.3 million of repurchases remained under the Share Repurchase Program.\nYears Ended October 31,\n(in millions, except per share amounts) 2023 2022\nTotal number of shares purchased 3.3 2.3\nAverage price paid per share(1)\n$ 41.06 $ 42.15\nTotal cash paid for share repurchases(1)\n$ 137.1 $ 97.5\n(1) Average price paid per share and total cash paid for share repurchases do not include any excise tax for stock repurchases as part of the Inflation Reduction Act of 2022.\nProceeds from Federal Energy Savings Performance Contracts\nAs part of our Technical Solutions business, we enter into energy savings performance contracts (ESPC) with the federal government pursuant to which we agree to develop, design, engineer, and construct a project and guarantee that the project will satisfy agreed-upon performance standards. Proceeds from ESPC projects are generally received in advance of construction through agreements to sell the ESPC receivables to unaffiliated third parties. We use the advances from the third parties under these agreements to finance the projects, which are recorded as cash flows from financing activities. The use of the cash received under these arrangements to pay project costs is classified as operating cash flows.\nEffect of Inflation\nThe rates of inflation experienced in recent years have not had a material impact on our Financial Statements. We attempt to recover increased costs by increasing prices for our services to the extent permitted by contracts and competition.\nRegulatory Environment\nOur operations are subject to various federal, state, and/or local laws, rules, and regulations regulating among other things, labor, wages, and health and safety matters, as well as laws and regulations relating to the discharge of materials into the environment or otherwise relating to the protection of the environment. Historically, the cost of complying with these laws, rules, and regulations has not had a material adverse effect on our financial position, results of operations, or cash flows.\nCash Flows\nIn addition to revenues and operating profit, our management views operating cash flows as a good indicator of financial performance, because strong operating cash flows provide opportunities for growth both organically and through acquisitions. Operating cash flows primarily depend on: revenue levels; the quality and timing of collections of accounts receivable; the timing of payments to suppliers and other vendors; the timing and amount of income tax payments; and the timing and amount of payments on insurance claims and legal\nsettlements.\nYears Ended October 31,\n(in millions) 2023 2022 2021\nNet cash provided by operating activities 243.3 20.4 314.3\nNet cash used in investing activities (62.1) (241.5) (740.0)\nNet cash (used in) provided by financing activities (186.3) 235.5 92.4\nOperating Activities\nNet cash provided by operating activities of continuing operations increased by $222.9 million during 2023, as compared to 2022. The increase was primarily driven by a $143.8 million payments made for the Bucio settlement in 2022, and the related income tax benefit.\nNet cash provided by operating activities of continuing operations decreased by $293.9 million during 2022, as compared to 2021. The decrease was primarily driven by payments made for the Bucio settlement, which was recorded within Other Accrued Liabilities in the Consolidated Balance Sheets, and deferred remittance of payroll taxes in the current year and the timing of client receivable collections and vendor payments.\nInvesting Activities\nNet cash used in investing activities changed by $179.5 million during 2023, as compared to 2022. The change was primarily related to the Momentum and RavenVolt acquisitions, completed in 2022.\nNet cash used in investing activities changed by $498.5 million during 2022, as compared to 2021. The change was primarily related to the Able Acquisition during the fourth quarter of 2021, partially offset by Momentum and RavenVolt acquisitions.\nFinancing Activities\nNet cash used in financing activities was $186.3 million in 2023, as compared to net cash provided by financing activities of $235.5 million in 2022. The change was primarily related to a decrease in net borrowings from our Amended Credit Facility, as in 2022 we had higher borrowings to fund Momentum and RavenVolt acquisitions, and higher share repurchases in 2023.\nNet cash provided by financing activities was $235.5 million in 2022, as compared to $92.4 million in 2021, primarily due to higher net borrowings to fund acquisitions and working capital requirements.\nDividends\nOn December 13, 2023, we announced a quarterly cash dividend of $0.225 per share on our common stock, payable on February 5, 2024, to shareholders of record on January 4, 2024. We declared a quarterly cash dividend on our common stock every quarter during 2023, 2022, and 2021. We paid total annual dividends of $57.5 million, $51.9 million, and $51.0 million during 2023, 2022, and 2021, respectively.\nMaterial Cash Requirements from Contractual and Other Obligations\nAs of October 31, 2023, our material cash requirements for our known contractual and other obligations were as follows:\nDebt Obligations and Interest Payments - Outstanding payments on our Amended Credit Facility were $1,313.8 million, with $32.5 million payable within 12 months. We have future interest payments based on our hedged borrowings under our Amended Credit Facility of $16.8 million, which is payable within 12 months. The interest payments on our remaining borrowings under the Amended Credit Facility will be determined based upon the average outstanding balance of our borrowings and the prevailing interest rate during that time. See Note 11, Debt, in the Financial Statements for further detail of our debt and the timing of expected future principal and interest payments.\nOperating and Finance Leases - We enter into various noncancelable lease agreements for office space, parking facilities, warehouses, vehicles, and equipment used in the normal course of business. Operating\nand finance lease obligations were $168.0 million, with $42.2 million payable within 12 months. See Note 5, Leases, in the Financial Statements for further detail of our obligations and the timing of expected future payments.\nService Concession Arrangements - As defined under Topic 853, Service Concession Arrangements, our leased location parking arrangements are represented as service concession arrangements. We had contractual payments for these arrangements of $88.2 million, with $25.0 million payable within 12 months.\nInformation Technology Service Agreements - Information technology service agreements represent outsourced services and licensing costs pursuant to our information technology agreements. We had contractual payments for these agreements of $122.4 million, with $41.0 million payable within 12 months.\nBenefit Obligations - Expected future payments relating to our defined benefit, postretirement, and deferred compensation plans were $38.2 million, with $3.3 million payable in 12 months. These amounts are based on expected future service and were calculated using the same assumptions used to measure our benefit obligation at October 31, 2023.\nIn addition, our material cash requirements for other obligations, for which we cannot reasonably estimate future payments, include the following:\nMultiemployer Benefit Plans - In addition to our company sponsored benefit plans, we participate in certain multiemployer pension and other postretirement plans. The cost of these plans is equal to the annual required contributions determined in accordance with the provisions of negotiated collective bargaining arrangements. During 2023, 2022, and 2021, contributions made to these plans were $574.6 million, $555.1 million, and $348.8 million, respectively; however, our future contributions to the multiemployer plans are dependent upon a number of factors, including the funded status of the plans, the ability of other participating companies to meet ongoing funding obligations, and the level of our ongoing participation in these plans. Amounts of future contributions that we would be contractually obligated to make pursuant to these plans cannot be reasonably estimated. See Note 12, Employee Benefit Plans, in the Financial Statements for more information.\nSelf-Insurance Obligations - We may make payments for exposures for which we are self-insured, including workers compensation, general liability, automobile liability, property damage, and other insurable risks. At October 31, 2023, our self-insurance reserves, net of recoverables, were $487.9 million. As these obligations do not have scheduled maturities, we are unable to make a reliable estimate of the amount or timing of cash that may be required to settle these matters. See Note 10, Insurance, in the Financial Statements for further detail.\nUnrecognized Tax Benefits - At October 31, 2023, our total liability for unrecognized tax benefits was $11.6 million. The resolution or settlement of these tax positions with the taxing authorities is subject to significant uncertainty, and therefore we are unable to make a reliable estimate of the amount or timing of cash that may be required to settle these matters. In addition, certain of these matters may not require cash settlements due to the utilization of credits and net operating loss carryforwards as well as other offsets, including the indirect benefit from other taxing jurisdictions that may be available.\nContingent Consideration Payable in Connection with Our Acquisition of RavenVolt - At October 31, 2023, contingent consideration of up to $280.0 million in cash may be paid in calendar years 2024, 2025, and 2026, if the RavenVolt business achieves certain financial targets, as defined in the merger agreement, in calendar years 2023, 2024, and 2025. We do not expect the RavenVolt business to achieve the aforementioned financial targets for calendar year 2023, and as such, we do not expect contingent consideration to be payable in the next 12 months.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements other than unrecorded standby letters of credit and surety bonds. We use letters of credit and surety bonds in the ordinary course of business to ensure the performance of contractual obligations and to collateralize self-insurance obligations in the event we are unable to meet our claim payment obligations. As we already have reserves on our books for the claims costs, these do not represent additional liabilities. The surety bonds typically remain in force for one to five years and may include optional renewal periods. As of October 31, 2023, these letters of credit totaled $58.2 million, and surety bonds and surety-backed letters of credit totaled $776.2 million, respectively. Neither of these arrangements has a material current effect, or is reasonably likely to have a material future effect, on our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources.\nCritical Accounting Policies and Estimates\nThe preparation of consolidated financial statements in accordance with United States generally accepted accounting principles (U.S. GAAP) requires our management to make certain estimates that affect the reported amounts. We base our estimates on historical experience, known or expected trends, independent valuations, and various other assumptions that we believe to be reasonable under the circumstances. As future events and their effects cannot be determined with precision, actual results could differ significantly from these estimates. We removed Contingent Consideration from our critical accounting policies and estimates in 2023. There have been no other significant changes to our critical accounting policies and estimates for the year ended October 31, 2023. We believe the following critical accounting policies govern the more significant judgments and estimates used in the preparation of our Financial Statements.\nDescription Judgments and Uncertainties Effect if Actual Results Differ from Assumptions\nValuation of Long-Lived Assets\nWe evaluate our fixed assets and amortizable intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. These events and circumstances include, but are not limited to: higher than expected attrition for customer relationships; a current expectation that a long-lived asset will be disposed of significantly before the end of its previously estimated useful life, such as when we classify a business as held for sale; a significant adverse change in the extent or manner in which we use a long-lived asset; or a change in the physical condition of a long-lived asset. Undiscounted cash flow analyses are used to determine if impairment exists; if impairment is determined to exist, the loss is calculated based on estimated fair value. Goodwill is not amortized but rather tested at least annually for impairment or more often if events or changes in circumstances indicate it is more likely than not that the carrying amount of the asset may not be recoverable. Goodwill is tested for impairment at the reporting unit level, which represents an operating segment or a component of an operating segment. Goodwill is tested for impairment by either performing a qualitative evaluation or a quantitative test. The qualitative evaluation is an assessment of factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. We may elect not to perform the qualitative assessment for some or all of our reporting units and instead perform a quantitative impairment test.\nOur impairment evaluations require us to apply judgment in determining whether a triggering event has occurred, including the evaluation of whether it is more likely than not that a long-lived asset will be disposed of significantly before the end of its previously estimated useful life. Incorrect estimation of useful lives may result in inaccurate depreciation and amortization charges over future periods leading, to future impairment.\nOur impairment loss calculations contain uncertainties because they require management to make assumptions and to apply judgment to estimate future cash flows and asset fair values, including forecasting useful lives of the assets and selecting the discount rate that reflects the risk inherent in future cash flows.\nWe estimate the fair value of each reporting unit using a combination of the income approach and the market approach.\nThe income approach incorporates the use of a discounted cash flow method in which the estimated future cash flows and terminal value are calculated for each reporting unit and then discounted to present value using an appropriate discount rate.\nThe valuation of our reporting units requires significant judgment in evaluation of recent indicators of market activity and estimated future cash flows, discount rates, and other factors. Our impairment analyses contain inherent uncertainties due to uncontrollable events that could positively or negatively impact anticipated future economic and operating conditions.\nIn making these estimates, the weighted-average cost of capital is utilized to calculate the present value of future cash flows and terminal value. Many variables go into estimating future cash flows, including estimates of our future revenue growth and operating results. When estimating our projected revenue growth and future operating results, we consider industry trends, economic data, and our competitive advantage.\nThe market approach estimates fair value of a reporting unit by using market comparables for reasonably similar public companies.\nDuring the last three years, we have not made any changes in the accounting methodology used to evaluate the impairment of long-lived assets or to estimate the useful lives of our long-lived assets. Additionally, we have not made any changes in the accounting methodology used to evaluate impairment of goodwill during the last three years.\nAt October 31, 2023, we had $2.5 billion of goodwill. Our goodwill is included in the following segments:\n$1.1 billion - B&I\n$502.2 million - M&D\n$459.3 million - Education\n$69.0 million - Aviation\n$368.0 million - Technical Solutions\nA goodwill impairment analysis was performed for each of our reporting units on August 1, 2023. Based on these studies, the implied fair value of each of our reporting units was substantially in excess of its carrying value, with the exception of the Education reporting unit, where the excess of the fair value over its carrying value was less than 20%. A 10% decrease in the estimated fair value of any of our reporting units would not have resulted in a different conclusion. We concluded there were no indicators of impairment.\nDuring the third quarter of 2021, we recognized a non-cash impairment charge totaling $9.1 million in our Corporate segment for previously capitalized internal-use software related to our ERP system implementation. The Company determined that certain components that were previously developed would no longer be integrated into the new ERP system. The impairment charge reduced the carrying value to zero for those components.\nDescription Judgments and Uncertainties Effect if Actual Results Differ from Assumptions\nInsurance Reserves\nWe use a combination of insured and self-insurance programs to cover workers compensation, general liability, automobile liability, property damage, and other insurable risks.\nInsurance claim liabilities represent our estimate of retained risks without regard to insurance coverage. We retain a substantial portion of the risk related to certain workers compensation and medical claims. Liabilities associated with these losses include estimates of both claims filed and IBNR Claims.\nWith the assistance of third-party actuaries, we periodically review our estimate of ultimate losses for IBNR Claims and adjust our required self-insurance reserves as appropriate. As part of this evaluation, we review the status of existing and new claim reserves as established by our third-party claims administrators.\nThe third-party claims administrators establish the case reserves based upon known factors related to the type and severity of the claims, demographic data, legislative matters, and case law, as appropriate.\nWe compare actual trends to expected trends and monitor claims development.\nThe specific case reserves estimated by the third-party administrators are provided to an actuary who assists us in projecting an actuarial estimate of the overall ultimate losses for our self-insured or high deductible programs. The projection includes the case reserves plus an actuarial estimate of reserves required for additional developments, including IBNR Claims.\nWe utilize the results of actuarial studies to estimate our insurance rates and insurance reserves for future periods and to adjust reserves, if appropriate, for prior years.\nOur self-insurance liabilities contain uncertainties due to assumptions required and judgment used.\nCosts to settle our obligations, including legal and healthcare costs, could fluctuate and cause estimates of our self-insurance liabilities to change.\nIncident rates, including frequency and severity, could fluctuate and cause the estimates in our self-insurance liabilities to change.\nThese estimates are subject to: changes in the regulatory environment; fluctuations in projected exposures, including payroll, revenues, and the number of vehicle units; and the frequency, lag, and severity of claims.\nThe full extent of certain claims, especially workers compensation and general liability claims, may not be fully determined for several years.\nIn addition, if the reserves related to self-insurance or high deductible programs from acquired businesses are not adequate to cover damages resulting from future accidents or other incidents, we may be exposed to substantial losses arising from future claim developments. We have not made any changes in the accounting methodology used to establish our self-insurance liabilities during the past three years.\nAfter analyzing recent loss development patterns, comparing the loss development patterns against benchmarks, and applying actuarial projection methods to estimate the ultimate losses, we decreased our total reserves related to prior years known claims as well as our estimate of the loss amounts associated with IBNR Claims during 2023 by $14.8 million. In 2022, we decreased our total reserves related to prior years claims by $36.8 million.\nIt is possible that actual results could differ from recorded self-insurance liabilities. A 10% change in our projected ultimate losses would have affected net income by approximately $35.1 million for 2023.\nAccounting Pronouncements\nAccounting Standard Updates Topic Summary Effective Date/\nMethod of Adoption\n2022-04\nLiabilities - Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations This Accounting Standard Update (ASU), issued in September 2022, is designed to enhance transparency around supplier finance programs by requiring new disclosures that would allow a user of the financial statements to understand the programs nature, activity during the period, changes from period to period, and potential magnitude.\nWhile we are currently evaluating the impact of implementing this guidance on our financial statements, we do not expect adoption to have a material impact. This ASU is effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, except for the amendment on rollforward information, which is effective for fiscal years beginning after December 15, 2023. Early adoption is permitted.\n2023-07\nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\nThis ASU, issued in November 2023, improves reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. This ASU requires disclosure, on an annual and interim basis, of significant segment expenses that are regularly provided to the chief operating decision maker, and an amount for other segment items by reportable segment, with a description of its composition. We are currently evaluating the impact of implementing this guidance on our financial statements; however, we do not expect adoption to have a material impact.\nThis ASU is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nWe have market risk exposure related to interest rates and foreign currency exchange rates. Market risk is measured as the potential negative impact on earnings, cash flows, or fair values resulting from a hypothetical change in interest rates or foreign currency exchange rates.\nInterest Rate Risk\nWe are primarily exposed to interest rate risk through our variable rate borrowings under our Amended Credit Facility, as further described in Note 11, Debt, in the Financial Statements. Under the Amended Credit Facility, the term loan and U.S.-dollar-denominated borrowings under the revolver bear interest at a rate equal to one-month SOFR plus a spread. Euro- and sterling-denominated borrowings under the revolver bear at rate equal to the EURIBOR and SONIA reference rates, respectively, plus a spread. At October 31, 2023, we had total outstanding borrowings of $1,313.8 million. To limit exposure to upward movements in interest rates associated with our floating-rate, SOFR-based borrowings, we entered into interest rate swap agreements to fix the interest rates on a portion of our outstanding borrowings. At October 31, 2023, we had interest rate swaps with an underlying notional amount of $820.1 million and fixed interest rates ranging from 1.72% to 3.81%. Based on our average borrowings, interest rates, and interest rate swaps in effect at October 31, 2023 and 2022, a 100 basis point increase in SOFR, EURIBOR, and SONIA would decrease our future earnings and cash flows by $5.4 million and $5.2 million, respectively. As actual interest rate movements over time are uncertain, our interest rate swaps pose potential interest rate risks if interest rates decrease. As of October 31, 2023, the fair value of our interest rate swap agreements was an asset of $36.4 million.\nForeign Currency Exchange Rate Risk\nWe are primarily exposed to the impact of foreign exchange rate risk through our UK and Ireland operations where the functional currency is the British pound sterling (GBP) and Euro (EUR), respectively. As we intend to remain permanently invested in these foreign operations, we do not utilize hedging instruments to mitigate foreign currency exchange risks. If we change our intent with respect to such international investment, we would expect to implement strategies designed to manage those risks in an effort to mitigate the effect of foreign currency fluctuations on our earnings and cash flows. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nABM Industries Incorporated:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of ABM Industries Incorporated and subsidiaries (the Company) as of October 31, 2023 and 2022, the related consolidated statements of comprehensive income, stockholders equity, and cash flows for each of the years in the three-year period ended October 31, 2023, and the related notes and financial statement schedule II (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of October 31, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the three-year period ended October 31, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of October 31, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated December 18, 2023, expressed an unqualified opinion on the effectiveness of the Companys internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nValuation of self-insurance liabilities\nAs discussed in Notes 2 and 10 to the consolidated financial statements, the Company uses a combination of insured and self-insurance programs to cover workers compensation, general liability, automobile liability, property damage, and other\ninsurable risks. The balance of casualty program insurance reserves, net of recoverables, as of October 31, 2023, amounted to $487.9 million. The Company engages actuaries to estimate its self-insurance liabilities at least annually.\nWe identified the evaluation of certain self-insurance liabilities as a critical audit matter because it involves a high degree of judgment and actuarial expertise to assess: (1) the actuarial models used and (2) estimated incurred but not reported claims based on application of loss development factors to historical claims experience.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls over the Companys self-insurance liability process, including controls related to (1) evaluation of claims information sent to the actuary, (2) estimation of incurred but not reported claims based on the application of loss development factors to historical claims experience, and (3) evaluation of the actuarial report and the external actuarial specialists qualifications and competency. We evaluated the Companys historical ability to estimate self-insurance liabilities by comparing the prior year recorded amounts to the subsequent claim development. We tested a sample of the claims data utilized by the Companys actuaries by comparing it to underlying claims details; and involved an actuarial professional with specialized skills and knowledge who assisted in the:\nassessment of the actuarial models used by the Company for consistency with generally accepted actuarial standards and\ndevelopment of an actuarial estimate of self-insurance liabilities based on the Companys underlying historical paid and incurred loss data for comparison with the liabilities recorded by the Company.\n/s/ KPMG LLP\nWe have served as the Companys auditor since 1980.\nNew York, New York\nDecember 18, 2023\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nABM Industries Incorporated:\nOpinion on Internal Control Over Financial Reporting\nWe have audited ABM Industries Incorporated and subsidiaries' (the Company) internal control over financial reporting as of October 31, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 31, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of October 31, 2023 and 2022, the related consolidated statements of comprehensive income, stockholders equity, and cash flows for each of the years in the three-year period ended October 31, 2023, and the related notes and financial statement schedule II (collectively, the consolidated financial statements), and our report dated December 18, 2023, expressed an unqualified opinion on those consolidated financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nNew York, New York\nDecember 18, 2023\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nOctober 31,\n(in millions, except share and per share amounts) 2023 2022\nASSETS\nCurrent assets\nCash and cash equivalents $ 69.5 $ 73.0\nTrade accounts receivable, net of allowances of $25.0 and $22.6 at\nOctober 31, 2023 and 2022, respectively\n1,365.0 1,278.7\nCosts incurred in excess of amounts billed 139.2 75.8\nPrepaid expenses 78.5 82.1\nOther current assets 58.6 51.6\nTotal current assets 1,710.7 1,561.2\nOther investments 28.8 14.5\nProperty, plant and equipment, net of accumulated depreciation of $326.5 and\n$296.9 at October 31, 2023 and 2022, respectively\n131.5 125.4\nRight-of-use assets 113.4 115.2\nOther intangible assets, net of accumulated amortization of $438.3 and\n$459.8 at October 31, 2023 and 2022, respectively\n302.9 378.5\nGoodwill 2,491.3 2,485.6\nOther noncurrent assets 155.0 188.5\nTotal assets $ 4,933.7 $ 4,868.9\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities\nCurrent portion of debt, net $ 31.5 $ 181.5\nTrade accounts payable 299.1 315.5\nAccrued compensation 249.7 246.6\nAccrued taxes-other than income 58.9 124.7\nDeferred revenue\n90.1 46.3\nInsurance claims 177.0 171.4\nIncome taxes payable 17.9 6.6\nCurrent portion of lease liabilities 32.5 30.3\nOther accrued liabilities 261.2 230.2\nTotal current liabilities 1,217.9 1,353.2\nLong-term debt, net 1,279.8 1,086.3\nLong-term lease liabilities 98.8 104.5\nDeferred income tax liability, net 85.0 89.7\nNoncurrent insurance claims 387.5 387.7\nOther noncurrent liabilities 61.1 126.0\nNoncurrent income taxes payable 3.7 4.2\nTotal liabilities 3,133.8 3,151.7\nCommitments and contingencies\nStockholders Equity\nPreferred stock, $0.01 par value; 500,000 shares authorized; none issued\n- -\nCommon stock, $0.01 par value; 100,000,000 shares authorized;\n62,847,387 and 65,587,894 shares issued and outstanding at\nOctober 31, 2023 and 2022, respectively\n0.6 0.7\nAdditional paid-in capital 558.9 675.5\nAccumulated other comprehensive loss, net of taxes (9.2) (16.2)\nRetained earnings 1,249.6 1,057.2\nTotal stockholders equity 1,799.9 1,717.2\nTotal liabilities and stockholders equity $ 4,933.7 $ 4,868.9\nSee accompanying notes to consolidated financial statements.\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYears Ended October 31,\n(in millions, except per share amounts) 2023 2022 2021\nRevenues $ 8,096.4 $ 7,806.6 $ 6,228.6\nOperating expenses 7,037.6 6,757.5 5,258.2\nSelling, general and administrative expenses 572.8 628.3 719.2\nAmortization of intangible assets 76.5 72.1 45.0\nOperating profit 409.5 348.8 206.3\nIncome from unconsolidated affiliates 3.9 2.4 2.1\nInterest expense (82.3) (41.1) (28.6)\nIncome before income taxes 331.1 310.0 179.8\nIncome tax provision (79.7) (79.6) (53.5)\nNet income 251.3 230.4 126.3\nOther comprehensive income\nInterest rate swaps (0.5) 36.7 4.5\nForeign currency translation and other 7.3 (19.8) 5.3\nIncome tax provision 0.1 (10.5) (1.5)\nComprehensive income $ 258.1 $ 236.9 $ 134.5\nNet income per common share\nBasic $ 3.81 $ 3.44 $ 1.87\nDiluted 3.79 3.41 1.86\nWeighted-average common and common equivalent shares outstanding\nBasic 66.0 67.1 67.4\nDiluted 66.3 67.5 68.0\nSee accompanying notes to consolidated financial statements.\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nYears Ended October 31,\n2023 2022 2021\n(in millions, except per share amounts) Shares Amount Shares Amount Shares Amount\nCommon Stock\nBalance, beginning of year 65.5 $ 0.7 67.3 $ 0.7 66.7 $ 0.7\nStock issued under employee stock purchase and share-based\ncompensation plans 0.6 - 0.6 - 0.6 -\nRepurchase of common stock, including excise taxes\n(3.3) (0.1) (2.3) - - -\nBalance, end of year 62.8 0.6 65.5 0.7 67.3 0.7\nAdditional Paid-in Capital\nBalance, beginning of year 675.5 750.9 724.1\nTaxes withheld under employee stock purchase and share-based compensation plans, net\n(9.0) (8.4) (6.7)\nShare-based compensation expense 30.5 30.5 33.5\nRepurchase of common stock, including excise taxes\n(138.1) (97.5) -\nBalance, end of year 558.9 675.5 750.9\nAccumulated Other Comprehensive Loss, Net of Taxes\nBalance, beginning of year (16.2) (22.5) (30.8)\nOther comprehensive income\n6.9 6.3 8.2\nBalance, end of year (9.2) (16.2) (22.5)\nRetained Earnings\nBalance, beginning of year 1,057.2 880.2 806.4\nNet income 251.3 230.4 126.3\nDividends\nCommon stock ($0.88, $0.78, and $0.76 per share)\n(57.5) (51.9) (51.0)\nStock issued under share-based compensation plans (1.5) (1.5) (1.5)\nBalance, end of year 1,249.6 1,057.2 880.2\nTotal Stockholders Equity $ 1,799.9 $ 1,717.2 $ 1,609.2\nSee accompanying notes to consolidated financial statements.\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended October 31,\n(in millions) 2023 2022 2021\nCash flows from operating activities\nNet income $ 251.3 $ 230.4 $ 126.3\nAdjustments to reconcile net income to net cash provided\nby operating activities\nDepreciation and amortization 120.7 112.4 89.9\nImpairment loss on fixed assets - - 9.1\nDeferred income taxes (4.9) 67.7 (48.0)\nShare-based compensation expense 30.5 30.5 33.5\nProvision for/(Recovery of) bad debt 3.0 (7.7) 0.6\nAmortization of accumulated other comprehensive gain on interest rate swaps - (4.8) (6.4)\nDiscount accretion on insurance claims 0.4 0.1 0.1\n(Gain)/Loss on sale of assets (0.1) (0.8) 0.2\nIncome from unconsolidated affiliates (3.9) (2.4) (2.1)\nDistributions from unconsolidated affiliates 1.9 1.9 1.9\nChange in fair value of contingent consideration (45.6) - -\nChanges in operating assets and liabilities, net of effects of acquisitions\nTrade accounts receivable and costs incurred in excess of amounts billed (152.7) (143.8) (124.5)\nPrepaid expenses and other current assets (7.4) 19.7 6.8\nRight-of-use assets 1.8 14.7 19.3\nOther noncurrent assets 33.8 (21.2) 13.8\nTrade accounts payable and other accrued liabilities (3.8) (143.0) 265.7\nLong-term lease liabilities (5.7) (15.2) (16.3)\nInsurance claims 5.0 (17.4) (28.4)\nIncome taxes payable 15.1 (31.8) 8.3\nOther noncurrent liabilities 3.8 (69.0) (35.4)\nTotal adjustments (8.0) (210.0) 188.0\nNet cash provided by operating activities 243.3 20.4 314.3\nCash flows from investing activities\nAdditions to property, plant and equipment (52.6) (50.8) (34.3)\nProceeds from sale of assets 2.9 6.0 4.4\nInvestments in equity securities (12.4) (2.1) -\nPurchase of business, net of cash acquired - (194.6) (710.2)\nNet cash used in investing activities (62.1) (241.5) (740.0)\nCash flows from financing activities\nTaxes withheld from issuance of share-based compensation awards, net (10.5) (9.9) (8.1)\nRepurchases of common stock, including excise taxes (138.1) (97.5) -\nDividends paid (57.5) (51.9) (51.0)\nDeferred financing costs paid - - (6.4)\nBorrowings from debt 1,178.5 1,479.4 357.7\nRepayment of borrowings from debt (1,136.0) (1,096.9) (194.2)\nChanges in book cash overdrafts (20.3) 4.3 (17.9)\nFinancing of energy savings performance contracts 0.5 9.9 15.1\nRepayment of finance lease obligations (3.0) (1.9) (2.8)\nNet cash (used in) provided by financing activities (186.3) 235.5 92.4\nEffect of exchange rate changes on cash and cash equivalents 1.6 (4.2) 1.9\nNet (decrease) increase in cash and cash equivalents (3.5) 10.2 (331.4)\nCash and cash equivalents at beginning of year 73.0 62.8 394.2\nCash and cash equivalents at end of year $ 69.5 $ 73.0 $ 62.8\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(continued)\nYears Ended October 31,\n(in millions) 2023 2022 2021\nSupplemental cash flow information\nIncome tax payments, net $ 69.1 $ 46.4 $ 93.5\nInterest paid on credit facility 89.4 28.9 14.3\nSee accompanying notes to consolidated financial statements.\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. THE COMPANY AND NATURE OF OPERATIONS\nABM is a leading provider of integrated facility services with a mission to make a difference, every person, every day. We are organized into four industry groups and one Technical Solutions segment:\nThrough these groups, we offer janitorial, facilities engineering, parking, and specialized mechanical and electrical technical solutions, on a standalone basis or in combination with other services.\n2. BASIS OF PRESENTATION AND SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation and Principles of Consolidation\nThe Financial Statements have been prepared in accordance with United States generally accepted accounting principles (U.S. GAAP) and with the rules and regulations of the SEC, specifically Regulation S-X and the instructions to Form 10-K. Unless otherwise indicated, all references to years are to our fiscal year, which ends on October 31.\nThe Financial Statements include the accounts of ABM and all of our consolidated subsidiaries. We account for ABMs investments in unconsolidated affiliates under the equity method of accounting. We include the results of acquired businesses in the Consolidated Statements of Comprehensive Income from their respective acquisition dates. All intercompany accounts and transactions have been eliminated in consolidation.\nThe preparation of consolidated financial statements in accordance with U.S. GAAP requires our management to make certain estimates that affect reported amounts. We base our estimates on historical experience, known or expected trends, independent valuations, and various other assumptions that we believe to be reasonable under the circumstances. As future events and their effects cannot be determined with precision, actual results could differ significantly from these estimates.\nWe round amounts in the Financial Statements to millions and calculate all percentages and per-share data from the underlying whole-dollar amounts. Thus, certain amounts may not foot, crossfoot, or recalculate based on reported numbers due to rounding.\nCash and Cash Equivalents\nWe consider all highly liquid securities with an original maturity of three months or less to be cash and cash equivalents. As part of our cash management system, we use zero balance accounts to fund our disbursements. Under this system, at the end of each day the bank balance is zero, while the book balance is usually a negative amount due to reconciling items, such as outstanding checks. We report the changes in these book cash overdrafts as cash flows from financing activities.\nTrade Accounts Receivable and Costs Incurred in Excess of Amounts Billed\nTrade accounts receivable arise from services provided to our clients and are usually due and payable on varying terms from receipt of the invoice to net 90 days, with the exception of certain Technical Solutions project receivables that may have longer collection periods. These receivables are recorded at the invoiced amount and normally do not bear interest. In addition, our trade accounts receivable include unbilled receivables, such as invoices for services that have been provided but are not yet billed.\nCosts incurred in excess of amounts billed arise from Technical Solutions project contracts that typically provide for a schedule of billings or invoices to the client based on our performance to date of specific tasks inherent in the fulfillment of our performance obligation(s). The schedules for such billings usually do not precisely match the schedule on which costs are incurred. As a result, revenues generally differ from amounts that can be billed or invoiced to the client at any point during the contract.\nAllowance for Doubtful Accounts\nWe determine the allowance for doubtful accounts based on historical write-offs, known or expected trends, and the identification of specific balances deemed uncollectible. For the specifically identified balances, we establish the reserve upon the earlier of a clients inability to meet its financial obligations or after a period of 12 months, unless our management believes such amounts will ultimately be collectible.\nSales Allowance\nIn connection with our service contracts, we periodically issue credit memos to our clients that are recorded as a reduction in revenues and an increase to the allowance for billing adjustments. These credits can result from client vacancy discounts, job cancellations, property damage, and other items. We estimate our potential future losses on these client receivables based on an analysis of the historical rate of sales adjustments (credit memos, net of re-bills) and known or expected trends.\nOther Current Assets\nAt October 31, 2023 and 2022, other current assets primarily consisted of other receivables, short-term insurance recoverables, and capitalized commissions.\nOther Investments\nAt October 31, 2023 and 2022, other investments primarily consisted of preferred equity investments and investments in unconsolidated affiliates and were $28.8 million and $14.5 million, respectively. We did not recognize any impairment charges on these investments in 2023, 2022, or 2021.\nPreferred Equity investments\nWe own non-controlling interests (generally under 20%) in entities that provide specialized services. Our investments do not have readily determinable fair values; therefore, we measure the investment at initial cost less impairment, if any.\nInvestments in Unconsolidated Affiliates\nWe own non-controlling interests (generally 20% to 50%) in certain affiliated entities that predominantly provide facility solutions to governmental and commercial clients, primarily in the United States and the Middle East. We have significant influence over such investments and account for them under the equity method of accounting. We evaluate our equity method investments for impairment whenever events or changes in circumstances indicate that the carrying amounts of such investments may not be recoverable. An impairment loss is recognized to the extent that the estimated fair value of the investment is less than its carrying amount and we determine that the impairment is other than temporary.\nProperty, Plant and Equipment\nWe record property, plant and equipment at cost. Repairs and maintenance expenditures are expensed as incurred. In contrast, we capitalize major renewals or replacements that substantially extend the useful life of an asset. We determine depreciation for financial reporting purposes using the straight-line method over the following estimated useful lives:\nCategory Years\nComputer equipment and software 3-7\nMachinery and other equipment 3-5\nTransportation equipment 1.5-10\nBuildings 10-40\nFurniture and fixtures 5\nIn addition, we depreciate assets under finance leases and leasehold improvements over the shorter of their estimated useful lives or the remaining lease term. Upon retirement or sale of an asset, we remove the cost and accumulated depreciation from our Consolidated Balance Sheets. When applicable, we record corresponding gains or losses within the accompanying Consolidated Statements of Comprehensive Income.\nLeases\nWe account for our leases in accordance with ASU 2016-02, Leases (Topic 842). Topic 842 requires lessees to recognize substantially all leases on their balance sheet as a right-of-use (ROU) asset and a lease liability. We made the accounting policy election to not recognize leases with an initial term of 12 months or less on the balance sheet and will expense payments for such leases on a straight-line basis over the lease term. We also elected to not separate lease components from non-lease components.\nWe enter into various noncancelable lease agreements for office space, parking facilities, warehouses, vehicles, and equipment used in the normal course of business. We determine if an arrangement is a lease at inception and begin recording lease activity at the commencement date. ROU assets and lease liabilities are recognized based on the present value of lease payments over the lease term with lease expense recognized on a straight-line basis. The present value of future lease payments is determined using our incremental borrow rate (IBR) unless the implicit rate in the lease is readily determinable. Our IBR is equal to our rate of interest adjusted for term differences. This IBR is applied to the minimum lease payments within each lease agreement to determine the amounts of our ROU assets and lease liabilities.\nOur lease terms range from one to 30 years. Some leases include options to renew or extend. We typically include extension options in a lease term when it is reasonably certain that we will exercise that option and when doing so is at our sole discretion. Certain equipment and vehicle leases may also include options to purchase the leased property. The depreciable life of assets and leasehold improvements are limited by the expected lease term, unless there is a transfer of title or purchase option reasonably certain of exercise. Typically, if we decide to cancel or terminate a lease before the end of its term, then we would owe the lessor the remaining lease payments under the term of such lease. Our lease agreements generally do not contain any material residual value guarantees or material restrictive covenants. We may rent or sublease certain real estate assets that we no longer use to third parties.\nLease agreements may contain rent escalation clauses, rent holidays, or certain landlord incentives, including tenant improvement allowances. ROU assets include amounts for scheduled rent increases and are reduced by lease incentive amounts.\nCertain of our lease agreements include variable rent payments consisting primarily of rental payments adjusted periodically for inflation, maintenance, and utilities. These costs are expensed as incurred. Certain of our parking arrangements also contain variable rent payments that are a percentage of parking services revenue based on contractual levels. We record contingent rent as it becomes probable that specified targets will be met. Variable rent lease components are not included in the lease liability.\nService concession arrangements within the scope of ASU No. 2017-10, Service Concession Arrangements (Topic 853): Determining the Customer of the Operation Services, are excluded from the scope of Topic 842. Lease costs associated with these arrangements are recorded as a reduction of revenues. See Note 4, Revenues, for further discussion.\nGoodwill and Other Intangible Assets\nGoodwill represents the excess purchase price of acquired businesses over the fair value of the assets acquired and liabilities assumed. We have elected to make the first day of our fourth quarter, August 1, the annual impairment assessment date for goodwill. However, we could be required to evaluate the recoverability of goodwill\nmore often if impairment indicators exist. Goodwill is tested for impairment at a reporting unit level by performing either a qualitative evaluation or a quantitative test. The qualitative evaluation is an assessment of factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. We may elect not to perform the qualitative assessment for some or all reporting units and instead perform a quantitative test under which we estimate the fair value using a weighting of fair values derived from an income approach and a market approach. The discounted estimates of future cash flows include significant management assumptions, such as revenue growth rates, operating margins, weighted average cost of capital, and future economic and market conditions.\nOther intangible assets primarily consist of acquired customer contracts and relationships that are amortized using the sum-of-the-years-digits method over their useful lives, consistent with the estimated useful life considerations used in the determination of their fair values. This accelerated method of amortization reflects the pattern in which the economic benefits from the intangible assets of customer contracts and relationships are expected to be realized. We amortize other non-customer acquired intangibles using a straight-line method of amortization. We evaluate other intangible assets, as well as our long-lived assets, for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. When this occurs, a recoverability test is performed that compares the projected undiscounted cash flows from the use and eventual disposition of an asset or asset group to its carrying amount. If the projected undiscounted cash flows are less than the carrying amount, then we calculate an impairment loss. The impairment loss calculation compares the fair value, which is based on projected discounted cash flows, to the carrying value.\nSee Note 9, Goodwill and Other Intangible Assets, for further information on goodwill, other intangible assets, and impairment charges.\nOther Noncurrent Assets\nAt October 31, 2023 and 2022, other noncurrent assets primarily consisted of long-term insurance recoverables, interest rate swap assets, capitalized commissions, cloud computing arrangements, prepayments to carriers for future insurance claims, and insurance deposits.\nFederal Energy Savings Performance Contract Receivables\nAs part of our Technical Solutions business, we enter into ESPCs with the federal government pursuant to which we agree to develop, design, engineer, and construct a project and to guarantee that the project will satisfy agreed-upon performance standards. ESPC receivables represent the amount to be paid by various federal government agencies for work we have satisfactorily performed under specific ESPCs. We assign certain of our rights to receive those payments to unaffiliated third parties that provide construction financing, which we record as a liability, for such contracts. This construction financing is recorded as cash flows from financing activities, while the use of the cash received to pay project costs under these arrangements is classified as operating cash flows. The ESPC receivable is recognized as revenue as each project is constructed. Upon completion and acceptance of the project by the government and upon satisfaction of true sale criteria, the assigned ESPC receivable from the government and corresponding ESPC liability are eliminated from our consolidated financial statements.\nFair Value of Financial Instruments\nFair value is the price we would receive to sell an asset or pay to transfer a liability in an orderly transaction with a market participant at the measurement date. In the absence of active markets for identical assets or liabilities, such measurements involve developing assumptions based on market observable data and, in the absence of such data, internal information that is consistent with what market participants would use in a hypothetical transaction that occurs at the measurement date.\nObservable inputs reflect market data obtained from independent sources, while unobservable inputs reflect our market assumptions. Preference is given to observable inputs. These two types of inputs create the following fair value hierarchy:\nLevel 1 - Quoted prices for identical instruments in active markets;\nLevel 2 - Quoted prices for similar instruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable; and\nLevel 3 - Significant inputs to the valuation model are unobservable.\nWe evaluate assets and liabilities subject to fair value measurements on a recurring and non-recurring basis to determine the appropriate level at which to classify them for each reporting period. Some non-financial assets are measured at fair value on a non-recurring basis only in certain circumstances, including the event of impairment. See Note 7, Fair Value of Financial Instruments, for the fair value hierarchy table and for details on how we measure fair value for our assets and liabilities.\nInsurance Reserves\nWe use a combination of insured and self-insurance programs to cover workers compensation, general liability, automobile liability, property damage, and other insurable risks. Insurance claim liabilities represent our estimate of retained risks without regard to insurance coverage. We retain a substantial portion of the risk related to certain workers compensation and medical claims. Liabilities associated with these losses include estimates of both filed claims and IBNR Claims.\nWith the assistance of third-party actuaries, we review our estimate of ultimate losses for IBNR Claims on a quarterly basis and adjust our required self-insurance reserves as appropriate. See Note 10, Insurance, for further details on the quarterly review procedures. As part of this evaluation, we review the status of existing and new claim reserves as established by third-party claims administrators. The third-party claims administrators establish the case reserves based upon known factors related to the type and severity of the claims, demographic factors, legislative matters, and case law, as appropriate. We compare actual trends to expected trends and monitor claims developments. The specific case reserves estimated by the third-party administrators are provided to an actuary who assists us in projecting an actuarial estimate of the overall ultimate losses for our self-insured or high deductible programs, which includes the case reserves plus an actuarial estimate of reserves required for additional developments, such as IBNR Claims. We utilize the results of actuarial studies to estimate our insurance rates and insurance reserves for future periods and to adjust reserves, if appropriate, for prior years.\nIn general, our insurance reserves are recorded on an undiscounted basis. We allocate current-year insurance expense to our operating segments based upon their underlying exposures, while actuarial adjustments related to prior year claims are recorded within Corporate expenses. We classify claims as current or long-term based on the expected settlement date. Estimated insurance recoveries related to recorded liabilities are reflected as assets in our Consolidated Balance Sheets when we believe the receipt of such amounts is probable.\nOther Accrued Liabilities\nAt October 31, 2023 and 2022, other accrued liabilities primarily consisted of contract liabilities, employee benefits, ESPC liabilities, unclaimed property, legal fees and settlements, and dividends payable.\nOther Noncurrent Liabilities\nAt October 31, 2023 and 2022, other noncurrent liabilities primarily consisted of deferred compensation, contingent consideration liability, long-term finance leases, and retirement plan liabilities.\nContracts with Customers\nWe account for a contract when it has approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance, and collectability of consideration is probable. Once a contract is identified, we evaluate whether it is a combined or single contract and whether it should be accounted for as more than one performance obligation. Generally, most of our contracts are cancelable by either party without a substantive penalty, and the majority of our contracts have a notification period of 30 to 90 days. If a contract includes a cancellation clause, the remaining contract term is limited to the required termination notice period.\nAt contract inception, we assess the services promised to our customers and identify a performance obligation for each promise to transfer to the customer a service, or a bundle of services, that is distinct. To identify the performance obligation, we consider all of our services promised in the contract, regardless of whether they are explicitly stated or are implied by customary business practices.\nThe majority of our contracts contain multiple promises that represent an integrated bundle of services comprised of activities that may vary over time; however, these activities fulfill a single integrated performance obligation since we perform a continuous service that is substantially the same and has the same pattern of transfer to the customer. Our performance obligations are primarily satisfied over time as we provide the related services.\nWe allocate the contract transaction price to this single performance obligation and recognize revenue as the services are performed, as further described in Contract Types below.\nCertain arrangements involve variable consideration (primarily per transaction fees, reimbursable expenses, and sales-based royalties). We do not estimate the variable consideration for these arrangements; rather, we recognize these variable fees in the period they are earned. Some of our contracts, often related to Airline Services, may also include performance incentives based on variable performance measures that are ascertained exclusively by future performance and therefore cannot be estimated at contract inception and are recognized as revenue once known and mutually agreed upon. We include estimated amounts in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of our anticipated performance and all information (historical, current, and forecasted) that is reasonably available to us.\nWe primarily account for our performance obligations under the series guidance, using the as-invoiced practical expedient when applicable. We apply the as-invoiced practical expedient to record revenue as the services are provided, given the nature of the services provided and the frequency of billing under the customer contracts. Under this practical expedient, we recognize revenue in an amount that corresponds directly with the value to the customer of our performance completed to date and for which we have the right to invoice the customer.\nWe typically bill customers on a monthly basis and have the right to consideration from customers in an amount that corresponds directly with the performance obligation satisfied to date. The time between completion of the performance obligation and collection of cash is generally 30 to 60 days. Sales-based taxes are excluded from revenue.\nContracts generally can be modified to account for changes in specifications and requirements. We consider contract modifications to exist when the modification either changes the consideration, creates new performance obligations, or changes the existing scope of the contract and related performance obligations. Historically, contract modifications have been for services that are not distinct from the existing contract, since we are providing a bundle of services that are highly interrelated, and are therefore treated as if they were part of that existing contract. Such modifications are generally accounted for retrospectively as part of the existing contract.\nContract Types\nWe have arrangements under various contract types, as described below.\nMonthly Fixed-Price\nMonthly fixed-price arrangements are contracts in which the client agrees to pay a fixed fee every month over a specified contract term. We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized at the agreed-upon contractual amount over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nSquare-Foot\nSquare-foot arrangements are contracts in which the client agrees to pay a fixed fee every month based on the actual square footage serviced over a specified contract term. We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized at the agreed-upon contractual amount over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nCost-Plus\nCost-plus arrangements are contracts in which the clients reimburse us for the agreed-upon amount of wages and benefits, payroll taxes, insurance charges, and other expenses associated with the contracted work, plus a profit margin. We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized at the agreed-upon contractual amount over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nWork Orders\nWork orders generally consist of supplemental services requested by clients outside of the standard service specification and include cleanup after tenant moves, construction cleanup, flood cleanup, and snow removal. The nature of these short-term contracts involves performing one-off type services, and revenue is recognized at the agreed-upon contractual amount over time as the services are provided, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nTransaction-Price\nTransaction-price contracts are arrangements in which customers are billed a fixed price for each transaction performed on a monthly basis (e.g., wheelchair passengers served, airplane cabins cleaned). We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized at the agreed-upon contractual amount over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nHourly\nHourly arrangements are contracts in which the client is billed a fixed hourly rate for each labor hour provided. We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized at the agreed-upon contractual amount over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nManagement Reimbursement\nUnder management reimbursement arrangements, we manage a parking facility for a management fee and pass through the revenue and expenses associated with the facility to the owner. We measure progress toward satisfaction of the performance obligation over time as the services are provided. Under these contracts we recognize both revenues and expenses, in equal amounts, that are directly reimbursed from the property owner for operating expenses, as such expenses are incurred. Such revenues do not include gross customer collections at the managed locations, because they belong to the property owners. We have determined we are the principal in these transactions, because the nature of our performance obligation is for us to provide the services on behalf of the customer and we have control of the promised services before they are transferred to the customer.\nManagement reimbursement revenue was $302.3 million, $280.6 million, and $240.3 million during 2023, 2022, and 2021, respectively.\nLeased Location\nUnder leased location parking arrangements, we pay a fixed amount of rent, plus a percentage of revenues derived from monthly and transient parkers, to the property owner. We retain all revenues received and we are responsible for most operating expenses incurred. We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nRental expense and certain other expenses under contracts that meet the definition of service concession arrangements are recorded as a reduction of revenue.\nAllowance\nUnder allowance parking arrangements, we are paid a fixed amount or hourly rate to provide parking services, and we are responsible for certain operating expenses that are specified in the contract. We measure progress toward satisfaction of the performance obligation as the services are provided, and revenue is recognized at the agreed-upon contractual rate over time, because the customer simultaneously receives and consumes the benefits of the services as they are performed.\nEnergy Savings Contracts and Fixed-Price Repair and Refurbishment\nUnder energy savings contracts and fixed-price repair and refurbishment arrangements, we agree to develop, design, engineer, and construct a project. Additionally, as part of bundled energy solutions arrangements, we guarantee the project will satisfy agreed-upon performance standards.\nWe use the cost-to-cost method, which compares the actual costs incurred to date with the current estimate of total costs to complete, to measure the satisfaction of the performance obligation and recognize revenue as work progresses and we incur costs on our contracts; we believe this method best reflects the transfer of control to the customer. This measurement and comparison process requires updates to the estimate of total costs to complete the contract, and these updates may include subjective assessments and judgments. Equipment purchased for these projects is project-specific and considered a value-added element to our work. Equipment costs are incurred when the title is transferred to us, typically upon delivery to the work site. Revenue for uninstalled equipment is recognized at cost and the associated margin is deferred until installation is substantially complete.\nWe recognize revenue over time for all of our services as we perform them, because (i) control continuously transfers to the customer as work progresses, or (ii) we have the right to bill the customer as costs are incurred. The customer typically controls the work in process, as evidenced either by contractual termination clauses or by our rights to payment for work performed to date plus a reasonable profit to deliver products or services that do not have an alternative use to us.\nCertain project contracts include a schedule of billings or invoices to the customer based on our job-to-date percentage of completion of specific tasks inherent in the fulfillment of our performance obligation(s) or in accordance with a fixed billing schedule. Fixed billing schedules may not precisely match the actual costs incurred. Therefore, revenue recognized may differ from amounts that can be billed or invoiced to the customer at any point during the contract, resulting in balances that are considered revenue recognized in excess of amounts billed or amounts billed in excess of revenue recognized. Advanced payments from our customers generally do not represent a significant financing component as the payments are used to meet working capital demands that can be higher in the early stages of a contract, as well as to protect us from our customer failing to meet its obligations under the contract.\nCertain projects include service maintenance agreements under which existing systems are repaired and maintained for a specific period of time. We generally recognize revenue under these arrangements over time. Our service maintenance agreements are generally one-year renewable agreements.\nFranchise\nWe franchise certain engineering services through individual and area franchises under the Linc Service and TEGG brands, which are part of ABM Technical Solutions. Initial franchise fees result from the sale of a franchise license and include the use of the name, trademarks, and proprietary methods. The franchise license is considered symbolic intellectual property, and revenue related to the sale of this right is recognized at the agreed-upon contractual amount over the term of the initial franchise agreement.\nRoyalty fee revenue consists of sales-based royalties received as part of the consideration for the franchise right, which is calculated as a percentage of the franchisees revenue. We recognize royalty fee revenue at the agreed-upon contractual rates over time as the customer revenue is generated by the franchisees. A receivable is recognized for an estimate of the unreported royalty fees, which are reported and remitted to us in arrears.\nMicrogrid Systems Installation\nWe provide electrical contracting services for energy related products such as the installation of solar solutions, battery storage, distributed generation, and other specialized electric trades.\nWe use the cost-to-cost method, which compares the actual costs incurred to date with the current estimate of total costs to complete, to measure the satisfaction of the performance obligation and recognize revenue as work progresses and we incur costs on our contracts; we believe this method best reflects the transfer of control to the customer. This measurement and comparison process requires updates to the estimate of total costs to complete the contract, and these updates may include subjective assessments and judgments.\nCosts to Obtain a Contract with a Customer\nWe capitalize the incremental costs of obtaining a contract with a customer, primarily commissions, as contract assets and recognize the expense on a straight-line basis over a weighted average expected customer relationship period. Capitalized commissions are classified as current or noncurrent based on the timing of when we expect to recognize the expense.\nContract Balances\nThe timing of revenue recognition, billings, and cash collections results in contract assets and contract liabilities, as further explained below. The timing of revenue recognition may differ from the timing of invoicing to customers. If a contract includes a cancellation clause that allows for the termination of the contract by either party without a substantive penalty, then the contract term is limited to the termination notice period.\nContract assets primarily consist of billed trade receivables, unbilled trade receivables, and costs incurred in excess of amounts billed. Billed and unbilled trade receivables represent amounts from work completed in which we have an unconditional right to bill our customer. Costs incurred in excess of amounts billed typically arise when the revenue recognized on projects exceeds the amount billed to the customer. These amounts are transferred to billed trade receivables when the rights become unconditional. Contract assets also include the capitalization of incremental costs of obtaining a contract with a customer, primarily commissions.\nContract liabilities consist of deferred revenue and advance payments and billings in excess of revenue recognized. We generally classify contract liabilities as current since the related contracts are generally for a period of one year or less. Contract liabilities decrease as we recognize revenue from the satisfaction of the related performance obligation.\nAdvertising\nAdvertising costs are expensed as incurred. During 2023, 2022, and 2021, advertising expense was $8.8 million, $6.0 million, and $6.2 million, respectively.\nShare-Based Compensation\nOur current share-based awards principally consist of restricted stock units (RSUs) and performance share awards. We recognize compensation costs associated with these awards in selling, general and administrative expenses. For RSUs and performance share awards, the amount of compensation cost is measured based on the grant-date fair value of the equity instruments issued. Since our total shareholder return (TSR) performance share awards are performance awards with a market condition, the compensation costs associated with these awards are determined using a Monte Carlo simulation valuation model. For RSUs and TSR performance share awards, compensation cost is recognized over the period that an employee provides service in exchange for the award. We recognize compensation cost associated with other performance share awards over the requisite service period based on the probability of achievement of performance criteria.\nTaxes Collected from Clients and Remitted to Governmental Agencies\nWe record taxes on client transactions due to governmental agencies as receivables and liabilities on the Consolidated Balance Sheets.\nNet Income Per Common Share\nBasic net income per common share is net income divided by the weighted-average number of common shares outstanding during the period. Diluted net income per common share is based on the weighted-average number of common shares outstanding during the period, adjusted to include the potential dilution from the conversion of RSUs, vesting of performance shares, and exercisable stock options.\nContingencies and Litigation\nWe are a party to a number of lawsuits, claims, and proceedings incident to the operation of our business, including those pertaining to labor and employment, contracts, personal injury, and other matters, some of which allege substantial monetary damages. Some of these actions may be brought as class actions on behalf of a class or purported class of employees. We accrue for loss contingencies when losses become probable and are reasonably estimable. If the reasonable estimate of the loss is a range and no amount within the range is a better estimate, then the minimum amount of the range is recorded as a liability. We recognize legal costs as an expense in the period incurred.\nIncome Taxes\nWe account for income taxes using the asset and liability method. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement\ncarrying amount of existing assets and liabilities and their respective tax bases. We measure deferred tax assets and liabilities using enacted tax rates expected to be applied to taxable income in the years in which those temporary differences are expected to be recovered. Deferred tax assets are reviewed for recoverability on a quarterly basis. A valuation allowance is recorded to reduce the carrying amount of a deferred tax asset to its realizable value unless it is more likely than not that such asset will be realized. We recognize accrued interest and penalties related to unrecognized tax benefits in income tax expense in our Consolidated Statements of Comprehensive Income.\nEmployee Retention Tax Credit\nIn 2020, the U.S. government enacted the Coronavirus Aid, Relief and Security Act (the CARES Act) to provide certain relief as a result of the COVID-19 pandemic. The CARES Act provides tax relief, along with other stimulus measures, including a provision for an Employee Retention Credit (ERC). ERC is a refundable tax credit for employers who kept employees on their payroll during the COVID-19 pandemic.\nDuring the year ended October 31, 2023, we received and recorded an employee retention credit totaling $24.0 million, within the Selling, general and administrative expenses on the unaudited Consolidated Statements of Comprehensive Income.\nRecently Adopted Accounting Standards\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848), Facilitation of the Effects of Reference Rate Reform on Financial Reporting. This ASU provides optional expedients to assist with the discontinuance of London Interbank Offered Rate (LIBOR). The expedients allow companies to ease the potential accounting burden when modifying contracts and hedging relationships that use LIBOR as a reference rate, if certain criteria are met. In January 2021, FASB issued ASU 2021-01, Reference Rate Reform (Topic 848): Scope. This ASU clarifies that derivatives affected by the discounting transition are explicitly eligible for certain optional expedients and exceptions under Topic 848. Effective November 1, 2022, we applied available practical expedients under Topic 848 to account for modifications, changes in critical terms, and updates to the designated hedged risks as qualifying changes have been made to applicable debt and derivative contracts as if they were not substantial.\nRecently Issued Accounting Standards\nIn September 2022, the FASB issued ASU 2022-04, Liabilities - Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations, designed to enhance transparency around supplier finance programs by requiring new disclosures that would allow a user of the financial statements to understand the programs nature, activity during the period, changes from period to period, and potential magnitude. This ASU is effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, except for the amendment on rollforward information, which is effective for fiscal years beginning after December 15, 2023, with early adoption permitted. We are currently evaluating the impact of implementing this guidance on our financial statements; however, we do not expect adoption to have a material impact.\nIn November 2023, the FASB issued ASU 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures. This accounting update improves reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses. This ASU requires disclosure, on an annual and interim basis, of significant segment expenses that are regularly provided to the chief operating decision maker, and an amount for other segment items by reportable segment, with a description of its composition. This ASU is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted. We are currently evaluating the impact of implementing this guidance on our financial statements; however, we do not expect adoption to have a material impact.\nWe do not expect any other recently issued accounting pronouncements to have a material impact on our consolidated financial statements and related disclosures.\n3. ACQUISITIONS AND DISPOSITIONS\nAcquisition of RavenVolt\nOn September 1, 2022, we completed the acquisition of all of the equity interests of RavenVolt, Inc. (RavenVolt), a nationwide provider of advanced turn-key microgrid systems utilized by diversified commercial and industrial customers, national retailers, utilities, and municipalities. RavenVolts operations are included within our Technical Solutions segment. The transaction met the definition of a business combination. We applied the acquisition method of accounting.\nThe initial purchase price for the acquisition was approximately $170.0 million in cash at closing (subject to customary working capital and net debt adjustments) plus the potential of post-closing contingent consideration of up to $280.0 million. The post closing contingent consideration is payable in cash in calendar years 2024, 2025, and 2026 if RavenVolts earnings before interest, taxes, depreciation, and amortization (EBITDA), as defined in the RavenVolt merger agreement, meets or exceeds certain defined targets. The maximum contingent consideration that is payable in calendar years 2024, 2025, and 2026 is $75.0 million, $75.0 million, and $130.0 million, respectively. If the EBITDA achieved for calendar years 2023 - 2025 cumulatively meets the defined EBITDA targets, the entire $280.0 million would be paid in calendar year 2026, minus any earn-out payments made in 2024 and 2025.\nTo estimate the fair value of the contingent consideration on the date of acquisition, we used the Real Options method. The key assumptions used in our valuation were: i) forecast of revenues and EBITDA margins; ii) the volatility associated with the EBITDA; iii) risk-adjusted discount rate applied to forecasted EBITDA; and (iv) the credit-adjusted discount rate related to the payment of the contingent consideration. A simulation of one million scenarios was performed with the assistance of a third-party valuation specialist, resulting in a fair value for the cumulative contingent consideration for calendar years 2023 through 2025 totaling $59.0 million. There were no material adjustments to the fair value of the contingent consideration from September 1, 2022 to October 31, 2022.\nAt October 31, 2023, the estimate of the fair value of the contingent consideration was $13.4 million. Results of operations subsequent to the acquisition date and changes to managements forecasts, as well as the accretion of the liability, resulted in a total decrease in fair value of $45.6 million. This decrease is recognized within the Selling, general and administrative expenses of the Consolidated Statements of Comprehensive Income. We do not expect the RavenVolt business to achieve the financial targets for calendar year 2023, and as such we do not expect contingent consideration to be payable in the next 12 months.\nFinal Acquisition Accounting\nThe assets acquired and liabilities assumed were recognized at their acquisition date fair values. Goodwill arising from the RavenVolt Acquisition is not deductible for tax reporting purposes. There were no material changes made to preliminary acquisition accounting.\nThe following table summarizes the final acquisition accounting:\n(in millions)\nCash and cash equivalents $ 29.0\nTrade accounts receivable 16.5\nOther assets 3.8\nIntangible assets 16.7\nGoodwill 207.4\nTrade accounts payable (5.2)\nDeferred revenue (31.6)\nOther accrued liabilities (3.2)\nDeferred income tax liability, net (4.5)\nNet assets acquired $ 228.9\nAcquisition of Momentum\nEffective April 7, 2022, we acquired Maybin Support Services Limited, Momentum Support Limited (UK), and Momentum Property Support Services Limited (collectively Momentum), a leading independent provider of\nfacility services, primarily janitorial, across Ireland and Northern Ireland, for a purchase price of approximately $54.8 million. We have completed the acquisition accounting, and recorded final goodwill and intangibles of $42.9 million and $10.4 million, respectively. The total assets acquired, excluding goodwill and intangibles, and liabilities assumed amounted to $20.4 million and $18.9 million, respectively. Goodwill is not deductible for income tax purposes. There were no material changes made to preliminary acquisition accounting.\nDisposition of Assets\nDuring 2022, we sold a group of customer contracts for healthcare technology management within our Technical Solutions segment for $8.5 million and recognized a gain of $7.6 million, which is included in Selling, general and administrative expenses in the accompanying Consolidated Statements of Comprehensive Income.\nAcquisition of Able\nOn September 30, 2021, we completed the Able Acquisition for a net cash purchase price of $741.7 million. Pursuant to the terms of the purchase agreement, approximately $12.1 million of the cash consideration was placed into escrow accounts, of which approximately $8.2 million was placed into escrow to satisfy any applicable indemnification claims for a period of 12 months. To fund the cash purchase price, we used cash on hand and borrowed $325.0 million on September 30, 2021, at an average interest rate of 1.58% from our revolving line of credit.\n4. REVENUES\nDisaggregation of Revenues\nWe generate revenues under several types of contracts, which are further described in Note 2, Basis of Presentation and Significant Accounting Policies. Generally, the type of contract is determined by the nature of the services provided by each of our major service lines throughout our reportable segments; therefore, we disaggregate revenues from contracts with customers into major service lines. We have determined that disaggregating revenues into these categories best depicts how the nature, amount, timing, and uncertainty of revenues and cash flows are affected by economic factors. Our reportable segments are B&I, M&D, Education, Aviation, and Technical Solutions, as described in Note 17, Segment and Geographic Information.\nYear Ended October 31, 2023\n(in millions) B&I M&D Education Aviation Technical Solutions Total\nMajor Service Line\nJanitorial(1)\n$ 2,745.2 $ 1,330.8 $ 774.8 $ 146.9 $ - $ 4,997.7\nParking(2)\n408.2 42.5 0.8 329.3 - 780.8\nFacility Services(3)\n936.0 153.4 104.8 32.0 - 1,226.2\nBuilding & Energy Solutions(4)\n- - - - 674.2 674.2\nAirline Services(5)\n- - - 417.5 - 417.5\nTotal $ 4,089.4 $ 1,526.7 $ 880.4 $ 925.7 $ 674.2 $ 8,096.4\nYear Ended October 31, 2022\n(in millions) B&I M&D Education Aviation Technical Solutions Total\nMajor Service Line\nJanitorial(1)\n$ 2,746.6 $ 1,242.4 $ 720.6 $ 119.8 $ - $ 4,829.4\nParking(2)\n354.3 36.6 0.9 311.7 - 703.6\nFacility Services(3)\n995.0 166.2 113.2 28.3 - 1,302.7\nBuilding & Energy Solutions(4)\n- - - - 626.8 626.8\nAirline Services(5)\n- - - 344.2 - 344.2\nTotal $ 4,095.9 $ 1,445.2 $ 834.7 $ 804.0 $ 626.8 $ 7,806.6\n(1) Janitorial arrangements provide a wide range of essential cleaning services for commercial office buildings, airports and other transportation centers, educational institutions, government buildings, health facilities, industrial buildings, retail stores, and stadiums and arenas. These arrangements are often structured as monthly fixed-price, square-foot, cost-plus, and work order contracts.\n(2) Parking arrangements provide parking and transportation services for clients at various locations, including airports and other transportation centers, commercial office buildings, educational institutions, health facilities, hotels, and stadiums and arenas. These arrangements are structured as management reimbursement, leased location, and allowance contracts. Certain of these arrangements are considered service concession agreements and are accounted for under the guidance of Topic 853; accordingly, rent expense related to these arrangements is recorded as a reduction of the related parking service revenues.\n(3) Facility Services arrangements provide onsite mechanical engineering and technical services and solutions relating to a broad range of facilities and infrastructure systems that are designed to extend the useful life of facility fixed assets, improve equipment operating efficiencies, reduce energy consumption, lower overall operational costs for clients, and enhance the sustainability of client locations. These arrangements are generally structured as monthly fixed-price, cost-plus, and work order contracts.\n(4) Building & Energy Solutions arrangements provide custom energy solutions, including microgrid systems installation, electrical, HVAC, lighting, electric vehicle charging station installation, and other general maintenance and repair services for clients in the public and private sectors and are generally structured as Energy Savings and Fixed-Price Repair and Refurbishment contracts. We also franchise certain operations under franchise agreements relating to our Linc Network and TEGG brands pursuant to franchise contracts.\n(5) Airline Services arrangements support airlines and airports with services such as passenger assistance, catering logistics, and airplane cabin maintenance. These arrangements are often structured as monthly fixed-price, cost-plus, transaction price, and hourly contracts.\nRemaining Performance Obligations\nAt October 31, 2023, performance obligations that were unsatisfied or partially unsatisfied for which we expect to recognize revenue totaled $332.8 million. We expect to recognize revenue on approximately 69% of the remaining performance obligations over the next 12 months, with the remainder recognized thereafter, based on our estimates of project timing.\nThese amounts exclude variable consideration primarily related to: (i) contracts where we have determined that the contract consists of a series of distinct service periods and revenues are based on future performance that cannot be estimated at contract inception; (ii) parking contracts where we and the customer share the gross revenues or operating profit for the location; and (iii) contracts where transaction prices include performance incentives that are based on future performance and therefore cannot be estimated at contract inception. We apply the practical expedient that permits exclusion of information about the remaining performance obligations with original expected durations of one year or less.\nContract Balances\nThe following tables present the balances in our contract assets and contract liabilities:\nAs of October 31,\n(in millions) 2023 2022\nContract assets\nBilled trade receivables(1)\n$ 1,219.6 $ 1,138.8\nUnbilled trade receivables(1)\n170.4 162.5\nCosts incurred in excess of amounts billed(2)\n139.2 75.8\nCapitalized commissions(3)\n30.2 30.9\n(1) Included in Trade accounts receivable, net on the Consolidated Balance Sheets. The fluctuations correlate directly to the execution of new customer contracts and to invoicing and collections from customers in the normal course of business.\n(2) Fluctuation is primarily due to the timing of payments on our contracts measured using the cost-to-cost method of revenue recognition.\n(3) Included in Other current assets and Other noncurrent assets on the Consolidated Balance Sheets. During the year ended October 31, 2023, we capitalized $14.5 million of new costs and amortized $15.2 million of previously capitalized costs. There was no impairment loss recorded on the costs capitalized.\n(in millions) Year Ended\nOctober 31, 2023\nContract liabilities(1)\nBalance at beginning of year $ 79.6\nAdditional contract liabilities 335.9\nRecognition of deferred revenue\n(274.3)\nBalance at end of year\n$ 141.2\n(1) Included in other accrued liabilities on the Consolidated Balance Sheets.\n5. LEASES\nThe components of lease assets and liabilities and their classification on our Consolidated Balance Sheets were as follows:\nAs of October 31,\n(in millions) Classification 2023 2022\nLease assets\nOperating leases Right-of-use assets $ 113.4 $ 115.2\nFinance leases Property, plant and equipment, net(1)\n15.2 10.0\nTotal lease assets $ 128.6 $ 125.2\nLease liabilities\nCurrent liabilities\nOperating leases Current portion of lease liabilities $ 32.5 $ 30.3\nFinance leases Other accrued liabilities 3.1 2.8\nNoncurrent liabilities\nOperating leases Long-term lease liabilities 98.8 104.5\nFinance leases Other noncurrent liabilities 11.1 6.4\nTotal lease liabilities $ 145.5 $ 144.1\n(1) Finance lease assets are recorded net of accumulated amortization of $18.9 million and $16.9 million as of October 31, 2023 and October 31, 2022, respectively.\nThe components of lease costs and classification within the Consolidated Statements of Comprehensive Income were as follows:\nYears Ended October 31,\n(in millions) 2023 2022\nOperating lease costs:\nOperating expenses(1)(2)\n$ 70.6 $ 60.2\nSelling, general and administrative expenses(3)\n25.4 25.7\nFinance lease costs:\nOperating expenses(4)\n2.4 1.7\nInterest expense(5)\n0.5 0.4\nTotal lease costs $ 99.0 $ 88.1\n(1) Related to certain parking arrangements.\n(2) Includes short-term lease costs and variable lease costs.\n(3) Includes short-term lease costs.\n(4) Represents amortization of leased assets.\n(5) Interest on lease liabilities.\nThe following table presents information on short-term and variable lease costs:\nYears Ended October 31,\n(in millions) 2023 2022\nShort-term lease costs $ 53.5 $ 43.3\nVariable lease costs 6.4 6.0\nTotal short-term and variable lease costs $ 59.9 $ 49.3\nSublease income generated during the year ended October 31, 2023, was immaterial.\nThe amounts of future undiscounted cash flows related to the lease payments over the lease terms and the reconciliation to the present value of the lease liabilities as recorded on our Consolidated Balance Sheets as of October 31, 2023, are as follows:\n(in millions) Operating\nLease Liabilities Finance\nLease Liabilities Total\nFiscal 2024 $ 38.5 $ 3.8 $ 42.2\nFiscal 2025 27.9 3.8 31.7\nFiscal 2026 25.8 3.0 28.8\nFiscal 2027 19.4 1.4 20.8\nFiscal 2028 13.2 1.4 14.6\nThereafter 27.4 2.6 29.9\nTotal lease payments 152.1 15.9 168.0\nLess: imputed interest 20.8 1.7 22.5\nPresent value of lease liabilities $ 131.3 $ 14.2 $ 145.5\nFuture sublease rental income was excluded for the periods shown above as the amounts are immaterial.\nWe have entered into operating lease arrangements as of October 31, 2023, that are effective for future periods. The total amount of ROU assets and lease liabilities related to these arrangements is immaterial.\nThe following table includes the weighted-average remaining lease terms, in years, and the weighted-average discount rate used to calculate the present value of operating lease liabilities:\nYears Ended October 31,\n2023 2022\nWeighted-average remaining lease term (years)\nOperating leases 5.5 5.7\nFinance leases 5.2 3.5\nWeighted-average discount rate\nOperating leases 4.60 % 4.09 %\nFinance leases 5.28 % 3.82 %\nThe following table includes supplemental cash and non-cash information related to operating leases:\nYears Ended October 31,\n(in millions) 2023 2022\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases $ 37.9 $ 35.3\nOperating cash flows from finance leases 0.5 0.4\nFinancing cash flows from finance leases 3.0 1.9\nLease assets obtained in exchange for new operating lease liabilities 28.7 23.1\n6. NET INCOME PER COMMON SHARE\nBasic and Diluted Net Income Per Common Share Calculations\nYears Ended October 31,\n(in millions, except per share amounts) 2023 2022 2021\nNet income $ 251.3 $ 230.4 $ 126.3\nWeighted-average common and common equivalent\nshares outstanding - Basic 66.0 67.1 67.4\nEffect of dilutive securities\nRSUs 0.2 0.2 0.3\nPerformance shares 0.2 0.2 0.2\nWeighted-average common and common equivalent\nshares outstanding - Diluted 66.3 67.5 68.0\nNet income per common share\nBasic $ 3.81 $ 3.44 $ 1.87\nDiluted $ 3.79 $ 3.41 $ 1.86\nAnti-Dilutive Outstanding Stock Awards Issued Under Share-Based Compensation Plans\nYears Ended October 31,\n(in millions) 2023 2022 2021\nAnti-dilutive 0.3 - -\n7. FAIR VALUE OF FINANCIAL INSTRUMENTS\nFair Value Hierarchy of Our Financial Instruments\nFinancial Assets and Liabilities Measured at Fair Value on a Recurring Basis\nAs of October 31,\n(in millions) Fair Value Hierarchy 2023 2022\nCash and cash equivalents(1)\n1 $ 69.5 $ 73.0\nInsurance deposits(2)\n1 3.1 0.9\nAssets held in funded deferred compensation plan(3)\n1 4.0 4.1\nDebt facilities (4)\n2 1,313.8 1,271.3\nInterest rate swap assets(5)\n2 36.4 36.9\nPreferred equity investments(6)\n3 15.4 3.0\nContingent consideration(7)\n3 13.4 59.0\n(1) Cash and cash equivalents are stated at nominal value, which equals fair value.\n(2) Represents restricted deposits that are used to collateralize our insurance obligations and are stated at nominal value, which equals fair value. These insurance deposits are included in Other noncurrent assets on the accompanying Consolidated Balance Sheets. See Note 10, Insurance, for further information.\n(3) Represents investments held in Rabbi trusts associated with two of our deferred compensation plans, which we include in Other noncurrent assets on the accompanying Consolidated Balance Sheets. The fair value of the assets held in the funded deferred compensation plan is based on quoted market prices. See Note 12, Employee Benefit Plans, for further information.\n(4) Represents gross outstanding borrowings under our syndicated line of credit and term loan. Due to variable interest rates, the carrying value of outstanding borrowings under our line of credit and term loan approximates the fair value. See Note 11, Debt, for further information.\n(5) Represents interest rate swap derivatives designated as cash flow hedges. The fair values of the interest rate swaps are estimated based on the present value of the difference between expected cash flows calculated at the contracted interest rates and the expected cash flows at current market interest rates using observable benchmarks for the Secured Overnight Financing Rate (SOFR) forward rates at the end of the period. At October 31, 2023 and 2022, our interest rate swap assets and liabilities are included in Other noncurrent assets and Other noncurrent liabilities, respectively, on the accompanying Consolidated Balance Sheets. See Note 11, Debt, for further information.\n(6) We purchased $12.4 million in a preferred equity investment and preferred stock warrants of a privately held company that specializes in the development of electric vehicle charging stations and related software during the year ended October 31, 2023, which we include within Other investments on the accompanying Consolidated Balance Sheet. Our total investments in preferred equity securities amounted to $15.4 million at October 31, 2023. Our investments do not have a readily determinable fair value; therefore, we account for the investments using the measurement alternative under Topic 321 and measure the investments at initial cost less impairment, if any.\n(7) At October 31, 2023, our contingent consideration payable related to the RavenVolt Acquisition is recorded at fair value as a liability on the acquisition date and is remeasured at each reporting date, based on significant inputs not observable in the market, which represents a Level 3 measurement within the fair value hierarchy. At September 1, 2022, we recorded the contingent consideration at fair value of $59.0 million. After the acquisition date and until the contingency is resolved, the fair value of contingent consideration payable is adjusted each reporting period based primarily on the expected probability of achievement of the contingency targets which are subject to our estimate. These changes in fair value are recognized within Selling, general and administrative expenses of the Consolidated Statements of Comprehensive Income. See Note 3, Acquisitions, for further information.\nThere were no transfers to or from Level 3 financial assets or liabilities during 2023 and 2022. At October 31, 2022, the Company had no financial assets or liabilities recorded at fair value using Level 3 inputs.\nNon-Financial Assets Measured at Fair Value on a Non-Recurring Basis\nIn addition to assets and liabilities that are measured at fair value on a recurring basis, we are also required to measure certain items at fair value on a non-recurring basis. These assets can include: goodwill; intangible assets; property, plant and equipment; lease-related ROU assets; and long-lived assets that have been reduced to fair value when they are held for sale. If certain triggering events occur or if an annual impairment test is required,\nwe would evaluate these non-financial assets for impairment. If an impairment were to occur, the asset would be recorded at the estimated fair value, using primarily unobservable Level 3 inputs.\nDuring the first quarter of 2022, we performed a reorganization of our T&M segment, and reallocated $95.0 million of goodwill from our B&I segment to our M&D segment using a relative fair value approach. M&Ds goodwill balance was $502.2 million after the reorganization, which includes $407.2 million of previously recorded goodwill from our T&M segment. In addition, we completed an assessment of any potential goodwill impairment for all reporting units immediately prior to and following the reallocation and determined that no impairment existed.\nDuring the third quarter of 2021, we recognized a non-cash impairment charge totaling $9.1 million in our Corporate segment for previously capitalized internal-use software related to our Enterprise Resource Planning (ERP) system implementation. The Company determined that certain components that were previously developed would no longer be implemented. The impairment charge reduced the carrying value to zero for those components and is recorded in Selling, general and administrative expenses on our Consolidated Statements of Comprehensive Income for the year ended October 31, 2021.\n8. PROPERTY, PLANT AND EQUIPMENT\nProperty, Plant and Equipment\nAs of October 31,\n(in millions) 2023 2022\nMachinery and other equipment $ 170.7 $ 158.7\nComputer equipment and software 110.7 106.8\nTransportation equipment 79.0 64.1\nLeasehold improvements 69.3 67.0\nFurniture and fixtures 19.8 17.3\nBuildings 7.7 7.7\nLand 0.8 0.7\n458.0 422.2\nLess: Accumulated depreciation(1)\n326.5 296.9\nTotal $ 131.5 $ 125.4\n(1) For 2023, 2022, and 2021, depreciation expense was $44.2 million, $40.3 million, and $45.0 million, respectively.\n9. GOODWILL AND OTHER INTANGIBLE ASSETS\nGoodwill\n(in millions) Business & Industry Manufacturing & Distribution Education Aviation Technical Solutions Total\nBalance at October 31, 2021 $ 1,129.8 $ 407.2 $ 459.3 $ 69.9 $ 162.7 2,228.9\nAcquisitions\n61.7 - - - 207.5 269.2\nForeign currency translation\n(8.7) - - (1.1) (2.7) (12.6)\nReallocation (1)\n(95.0) 95.0 - - - -\nBalance at October 31, 2022 $ 1,087.8 $ 502.2 $ 459.3 $ 68.7 $ 367.4 $ 2,485.6\nAcquisitions (2)\n1.3 - - - (0.1) 1.1\nForeign currency translation 3.6 - - 0.3 0.8 4.7\nBalance at October 31, 2023 $ 1,092.9 $ 502.2 $ 459.3 $ 69.0 $ 368.0 $ 2,491.3\n(1) In connection with the reorganization of our T&M segment in the first quarter of 2022, we reallocated $95.0 million of goodwill from our B&I segment to our M&D segment using a relative fair value approach.\n(2) During 2023, represents final acquisition accounting adjustments to goodwill from RavenVolt and Momentum acquisitions. See Note 3, Acquisitions and Dispositions, for additional information.\nWe did not record goodwill impairment charges during fiscal years 2023 and 2022.\nOther Intangible Assets\nAs of October 31,\n2023 2022\n(in millions) Gross Carrying Amount Accumulated Amortization Total Gross Carrying Amount Accumulated Amortization Total\nCustomer contracts and relationships $ 714.1 $ (413.2) $ 300.9 $ 801.6 $ (442.1) $ 359.6\nTrademarks and trade names\n12.1 (11.1) 1.0 21.4 (15.4) 6.1\nContract rights and other\n15.0 (14.0) 1.1 15.3 (2.4) 12.9\nTotal(1)\n$ 741.2 $ (438.3) $ 302.9 $ 838.4 $ (459.8) $ 378.5\n(1) These intangible assets are being amortized over the expected period of benefit, with a weighted average life of approximately 11 years.\nEstimated Annual Amortization Expense for Each of the Next Five Years\n(in millions) 2024 2025 2026 2027 2028\nEstimated amortization expense(1)\n$ 54.4 $ 47.4 $ 41.3 $ 35.9 $ 30.9\n(1) These amounts could vary as acquisitions of additional intangible assets occur in the future and as acquisition accounting is finalized for existing acquisitions.\nThe estimates of future cash flows used in determining the fair value of goodwill and other intangible assets involve significant management judgment and are based upon assumptions about expected future operating performance, economic conditions, market conditions, and cost of capital. Inherent in estimating the future cash flows are uncertainties beyond our control, such as changes in capital markets. The actual cash flows could differ materially from managements estimates due to changes in business conditions, operating performance, and economic conditions.\n10. INSURANCE\nWe use a combination of insured and self-insurance programs to cover workers compensation, general liability, automobile liability, property damage, and other insurable risks. For the majority of these insurance programs, we retain the initial $1.0 million to $1.5 million of exposure on a per-occurrence basis, either through deductibles or self-insured retentions. Beginning November 1, 2023, retentions will range between $1.0 million and $5.0 million of exposure on a per-occurrence basis. Beyond the retained exposures, we have varying primary policy limits ranging between $1.0 million and $5.0 million per occurrence. To cover general liability and automobile liability losses above these primary limits, we maintain commercial umbrella insurance policies that provide aggregate limits of $200.0 million. Our insurance policies generally cover workers compensation losses to the full extent of statutory requirements. Additionally, to cover property damage risks above our retained limits, we maintain policies that provide per occurrence limits of $75.0 million. We are also self-insured for certain employee medical and dental plans. We maintain stop-loss insurance for our self-insured medical plan under which we retain up to $0.5 million of exposure on a per-participant, per-year basis with respect to claims.\nWe maintain our reserves for workers compensation, general liability, automobile liability, and property damage insurance claims based upon known trends and events and the actuarial estimates of required reserves considering the most recently completed actuarial reports. We use all available information to develop our best estimate of insurance claims reserves as information is obtained. The results of actuarial reviews are used to estimate our insurance rates and insurance reserves for future periods and to adjust reserves, if appropriate, for prior years.\nInsurance Reserve Adjustments\nActuarial Reviews and Updates Performed During 2023\nWe review our self-insurance liabilities on a quarterly basis and adjust our accruals accordingly. Actual claims activity or development may vary from our assumptions and estimates, which may result in material losses or gains. As we obtain additional information that affects the assumptions and estimates used in our reserve liability calculations, we adjust our self-insurance rates and reserves for future periods and, if appropriate, adjust our reserves for claims incurred in prior accounting periods.\nDuring the first and third quarters of 2023, we performed comprehensive actuarial reviews of the majority of our casualty insurance programs to evaluate changes made to claims reserves and claims payment activity for the periods of May 1, 2022, through October 31, 2022, and November 1, 2022, through April 30, 2023, respectively (the Actuarial Reviews). The Actuarial Reviews were comprehensive in nature and were based on loss development patterns, trend assumptions, and underlying expected loss costs during the periods analyzed.\nDuring the second and fourth quarters of 2023, we performed interim actuarial updates of the majority of our casualty insurance programs that considered changes in claims development and claims payment activity for the respective periods analyzed (the Interim Updates). These Interim Updates were abbreviated in nature based on actual versus expected development during the periods analyzed and relied on the key assumptions in the Actuarial Reviews (most notably loss development patterns, trend assumptions, and underlying expected loss costs).\nBased on the results of the Actuarial Reviews and Interim Updates, we decreased our total reserves related to prior years for known claims as well as our estimate of the loss amounts associated with IBNR Claims during 2023 by $14.8 million. In 2022, we decreased our total reserves related to prior year claims by $36.8 million.\nInsurance-Related Balances and Activity\nAs of October 31,\n(in millions) 2023 2022\nInsurance claim reserves, excluding medical and dental $ 555.0 $ 551.0\nMedical and dental claim reserves and other\n9.5 8.1\nInsurance recoverables 67.1 71.0\nAt October 31, 2023 and 2022, insurance recoverables are included in both Other current assets and Other noncurrent assets on the accompanying Consolidated Balance Sheets.\nCasualty Program Insurance Reserves Rollforward\nYears Ended October 31,\n(in millions) 2023 2022 2021\nNet balance at beginning of year $ 479.9 $ 508.3 $ 434.8\nChange in case reserves plus IBNR Claims - current year\n154.2 145.7 117.9\nChange in case reserves plus IBNR Claims - prior years\n(14.8) (36.8) (36.0)\nClaims paid (131.4) (129.1) (99.8)\nAcquisition(1)\n- (8.2) 91.6\nNet balance, October 31(2)\n487.9 479.9 508.3\nRecoverables 67.1 71.0 66.5\nGross balance, October 31 $ 555.0 $ 551.0 $ 574.8\n(1) During 2021, insurance reserves increased as a result of the Able Acquisition.\n(2) Includes reserves related to discontinued operations of approximately $0.1 million for 2023, $0.2 million for 2022, and $0.3 million for 2021.\nInstruments Used to Collateralize Our Insurance Obligations\nAs of October 31,\n(in millions) 2023 2022\nStandby letters of credit $ 53.5 $ 153.7\nSurety bonds and surety-backed letters of credit 178.0 73.2\nRestricted insurance deposits 3.1 0.9\nTotal $ 234.7 $ 227.8\n11. DEBT\nComponents of Debt\nAs of October 31,\n(in millions) 2023 2022\nCurrent portion of long-term debt\nGross term loan $ 32.5 $ 32.5\nUnamortized deferred financing costs (1.0) (1.0)\nCurrent portion of term loan $ 31.5 $ 31.5\nReceivables facility - 150.0\nCurrent portion of debt $ 31.5 $ 181.5\nLong-term debt\nGross term loan $ 536.3 $ 568.8\nUnamortized deferred financing costs (1.5) (2.4)\nTotal noncurrent portion of term loan 534.8 566.3\nRevolving line of credit(1)(2)\n745.0 520.0\nLong-term debt $ 1,279.8 $ 1,086.3\n(1) Standby letters of credit amounted to $58.2 million at October 31, 2023.\n(2) At October 31, 2023, we had borrowing capacity of $483.0 million.\nAt October 31, 2023, and October 31, 2022, the weighted average interest rate on our outstanding borrowings, not including letters of credit and swaps, was 7.17%.and 4.97%, respectively.\nOn September 1, 2017, we refinanced and replaced our then-existing $800.0 million credit facility with a new senior, secured five-year syndicated credit facility, consisting of a $900.0 million revolving line of credit and an $800.0 million amortizing term loan, both of which were scheduled to mature on September 1, 2022. In accordance with the terms of the Credit Facility, the revolving line of credit was reduced to $800.0 million on September 1, 2018.\nOn June 28, 2021, the Company amended and restated the Credit Facility with the Second Amendment, extending the maturity date to June 28, 2026, and increasing the capacity of the revolving credit facility from $800.0 million to $1.3 billion and the-then remaining term loan outstanding from $620.0 million to $650.0 million. The Amended Credit Facility provides for the issuance of up to $350.0 million for standby letters of credit and the issuance of up to $75.0 million in swingline advances. The obligations under the Amended Credit Facility are secured on a first-priority basis by a lien on substantially all of our assets and properties, subject to certain exceptions. Additionally, we may repay amounts borrowed under the Amended Credit Facility at any time without penalty.\nAt November 1, 2022, we amended our Amended Credit Facility pursuant to the LIBOR Transition Amendment and the Fifth Amendment to replace the benchmark rate at which U.S.-dollar-denominated borrowings bear interest from LIBOR to the forward-looking Secured Overnight Financing Rate (SOFR) term rate administered by CME Group Benchmark Administration Limited. As a result of these amendments, we can borrow at Term SOFR plus a credit spread adjustment of 0.10% subject to a floor of zero.\nThe Amended Credit Facility contains certain covenants, including a maximum total net leverage ratio of 5.00 to 1.00, a maximum secured net leverage ratio of 4.00 to 1.00, and a minimum interest coverage ratio of 1.50 to 1.00, as well as other financial and non-financial covenants. In the event of a material acquisition, as defined in the Amended Credit Facility, we may elect to increase the maximum total net leverage ratio to 5.50 to 1.00 for a total of four fiscal quarters and increase the maximum secured net leverage ratio to 4.50 to 1.00 for a total of four fiscal quarters. We did not make this election for the Able Acquisition. Our borrowing capacity is subject to, and limited by, compliance with the covenants described above. At October 31, 2023, we were in compliance with these covenants.\nThe Amended Credit Facility also includes customary events of default, including: failure to pay principal, interest, or fees when due, failure to comply with covenants; the occurrence of certain material judgments; and a\nchange in control of the Company. If certain events of default occur, including certain cross-defaults, insolvency, change in control, or violation of specific covenants, then the lenders can terminate or suspend our access to the Amended Credit Facility, declare all amounts outstanding (including all accrued interest and unpaid fees) to be immediately due and payable, and require that we cash collateralize the outstanding standby letters of credit.\nWe incurred deferred financing costs of $6.4 million in conjunction with the Second Amendment and carried over $6.2 million of unamortized deferred financing from the initial execution, First Amendment, and previous amendments of the Credit Facility. Total deferred financing costs of $12.6 million, consisting of $4.9 million related to the term loan and $7.7 million related to the revolver, are being amortized to interest expense over the term of the Amended Credit Facility.\nOn March 1, 2022, we entered into an uncommitted receivable repurchase facility (the Receivables Facility) of up to $150 million, which expired on March 30, 2023. We accounted for the sale of receivables under the Receivables Facility as short-term debt and carried the receivables on the Consolidated Balance Sheets, primarily as a result of the requirement to repurchase receivables sold.\nLong-Term Loan Maturities\nDuring 2023, we made principal payments under the term loan of $32.5 million. As of October 31, 2023, the following principal payments are required under the term loan.\n(in millions) 2024\nDebt maturities $ 32.5 $ 32.5 $ 1,248.8 $ - $ -\nInterest Rate Swaps\nWe enter into interest rate swaps to manage the interest rate risk associated with our floating-rate, SOFR-based borrowings. Under these arrangements, we typically pay a fixed interest rate in exchange for SOFR-based variable interest throughout the life of the agreement. We initially report the mark-to-market gain or loss on a derivative as a component of AOCL and subsequently reclassify the gain or loss into earnings when the hedged transactions occur and affect earnings. Interest payables and receivables under the swap agreements are accrued and recorded as adjustments to interest expense. All of our interest rate swaps have been designated and accounted for as cash flow hedges from inception. See Note 7, Fair Value of Financial Instruments, regarding the valuation of our interest rate swaps.\nNotional Amount Fixed Interest Rate Effective Date Maturity Date\n$ 100.0 million 1.72% February 9, 2022 June 28, 2026\n$ 150.0 million 1.85% February 25, 2022 June 28, 2026\n$ 100.0 million 2.88% May 4, 2022 June 28, 2026\n$ 218.8 million(1)\n2.83% July 7, 2022 June 28, 2026\n$ 81.3 million(1)\n2.79% July 18, 2022 June 28, 2026\n$ 170.0 million 3.81% November 1, 2022 June 28, 2026\n(1) In July 2022, we entered into interest rate swap agreements with notional values totaling $300.0 million at inception. The notional amount reduces to $250.0 million in April 2024, $175.0 million in October 2024, and $100.0 million in October 2025 before maturing on June 28, 2026.\nAt October 31, 2023 and 2022, amounts recorded in AOCL for interest rate swaps were a gain of $26.0 million, net of taxes of $10.5 million, and a gain of $26.8 million, net of taxes of $10.1 million, respectively. In 2022, these amounts included the gain associated with the interest rate swaps we terminated in 2018, which was amortized to interest expense as interest payments were made over the original term of our Credit Facility. During 2022, we amortized $3.5 million, net of taxes of $1.3 million, of that gain. At October 31, 2023, the total amount expected to be reclassified from AOCL to earnings during the next 12 months was $9.8 million, net of a taxes of $3.8 million.\n12. EMPLOYEE BENEFIT PLANS\nDefined Benefit Plans\nWe provide benefits to certain employees under various defined benefit and postretirement benefit plans (collectively, the Plans). The Plans were previously amended to preclude new participants. All but one of the Plans are unfunded.\nInformation for the Plans\nAs of October 31,\n(in millions) 2023 2022\nNet obligations $ 6.1 $ 6.0\nProjected benefit obligations(1)\n11.9 12.2\nFair value of assets 5.8 6.2\n(1) At October 31, 2023 and 2022, total projected benefit obligations related to unfunded and underfunded plans were $11.9 million and $12.2 million, respectively.\nAt October 31, 2023, assets of the Plans were fully invested in fixed income. The expected return on assets was $0.2 million in 2023, $0.4 million in 2022, and $0.3 million in 2021. The aggregate net periodic benefit cost for all Plans was $0.6 million, $0.1 million, and $0.3 million for 2023, 2022, and 2021, respectively. Future benefit payments in the aggregate are expected to be $11.0 million.\nDeferred Compensation Plans\nWe maintain deferred compensation plans that permit eligible employees and directors to defer a portion of their compensation. At October 31, 2023 and 2022, the total liability of all deferred compensation was $27.0 million and $27.5 million, respectively, and these amounts are included in Other accrued liabilities and Other noncurrent liabilities on the accompanying Consolidated Balance Sheets. Under one of our deferred compensation plans, a Rabbi trust was created to fund the obligations, and we are required to contribute a portion of the deferred compensation contributions for eligible participants. The assets held in the Rabbi trust are not available for general corporate purposes. At October 31, 2023 and 2022, the fair value of these assets was $4.0 million and $4.1 million, respectively, and these amounts are included in Other noncurrent assets on the accompanying Consolidated Balance Sheets. Aggregate expense recognized under these deferred compensation plans was $0.5 million, $0.3 million, and $0.2 million for 2023, 2022, and 2021, respectively.\nDefined Contribution Plans\nWe sponsor two defined contribution plans covering certain employees that are subject to the applicable provisions of the Employee Retirement Income Security Act of 1974 and the Internal Revenue Code (IRC). Certain plans permit a company match of a portion of the participants contributions or a discretionary contribution after the participant has met the eligibility requirements set forth in the plan. During 2023, 2022, and 2021, we made matching contributions required by the plans of $29.8 million, $27.7 million, and $21.6 million, respectively.\nMultiemployer Pension and Postretirement Plans\nWe participate in various multiemployer pension plans under union and industry-wide agreements that provide defined pension benefits to employees covered by collective bargaining agreements. Because of the nature of multiemployer plans, there are risks associated with participation in these plans that differ from single-employer plans. Assets contributed by an employer to a multiemployer plan are not segregated into a separate account and are not restricted to provide benefits only to employees of that contributing employer. In the event another participating employer in a multiemployer plan no longer contributes to the plan, the unfunded obligations of the plan may be borne by the remaining participating employers, including us. In the event of the termination of a multiemployer pension plan or a withdrawal from a multiemployer pension plan, we could incur material liabilities under applicable law.\nKey Information for Individually Significant Multiemployer Defined Benefit Pension Plans(1)\n($ in millions) Pension Protection Act\nZone Status(3)\nFIP/RP\nStatus(4)\nContributions by ABM Surcharge\nImposed(5)\nExpiration Dates of Collective Bargaining Agreements\nPension Fund EIN/PN(2)\n2023 2022 Pending/\nImplemented 2023 2022 2021\nBuilding Service 32BJ Pension Fund 13-1879376 / 001 Yellow 6/30/2022 Yellow 6/30/2021 Implemented $ 21.4 $ 22.7 $ 18.8 No 12/15/2023 - 12/31/2027\nS.E.I.U National Industry Pension Fund 52-6148540 / 001 Red 12/31/2022 Red 12/31/2021 Implemented 19.3 17.6 10.9 Yes 6/30/2024 - 7/31/2025\nCentral Pension Fund of the IUOE & Participating Employers 36-6052390 / 001 Green 1/31/2023 Green 1/31/2022 N/A*\n13.0 12.8 5.3 N/A* 12/23/2023 - 6/30/2026\nSEIU Local 1 & Participating Employers Pension Trust 36-6486542 / 001 Green 9/30/2022 Green 9/30/2021 N/A*\n4.8 5.8 3.9 N/A* 11/30/2023 - 5/31/2026\nIUOE Stationary Engineers Local 39 Pension Plan 94-6118939 / 001 Green 12/31/2022 Green 12/31/2021 N/A*\n4.6 4.4 6.6 N/A* 11/30/2026 - 12/31/2029\nWestern Conference of Teamsters Pension Plan 91-6145047 / 001 Green 12/31/2022 Green 12/31/2021 N/A*\n2.4 2.2 2.0 N/A* 11/30/2026 - 12/31/2029\nAll Other Plans: 8.0 8.2 9.3\nTotal Contributions $ 73.6 $ 73.8 $ 56.8\n*Not applicable\n(1) To determine individually significant plans, we evaluated several factors, including our total contributions to the plan, our significance to the plan in terms of participating employees and contributions, and the funded status of the plan.\n(2) The EIN/PN column provides the Employer Identification Number and the three-digit plan number assigned to the plan by the IRS.\n(3) The Pension Protection Act Zone Status columns provide the two most recently available Pension Protection Act zone statuses from each plan. The zone status is based on information provided to us and other participating employers and is certified by each plans actuary. Among other factors, plans in the red zone are generally less than 65% funded, plans in the yellow zone are less than 80% funded, and plans in the green zone are at least 80% funded.\n(4) Indicates whether a Financial Improvement Plan (FIP) for yellow zone plans or a Rehabilitation Plan (RP) for red zone plans is pending or implemented.\n(5) Indicates whether our contribution in 2023 included an amount as imposed by a plan in the red zone in addition to the contribution rate specified in the applicable collective bargaining agreement.\nMultiemployer Pension Plans for which ABM Is a Significant Contributor\nPension Fund Contributions to the plan exceeded more than 5% of total contributions per most currently available Forms 5500\n(as of the plans year end)\nApartment Employees Trust Fund* 12/31/2022, 12/31/2021, and 12/31/2020\nArizona Sheet Metal Pension Trust Fund* 6/30/2022, 6/30/2021, and 6/30/2020\nBuilding Service 32BJ Pension Fund 6/30/2022, 6/30/2021, and 6/30/2020\nBuilding Service Pension Plan* 4/30/2022, 4/30/2021, and 4/30/2020\nCentral Pension Fund of the IUOE & Participating Employers 1/31/2023\nContract Cleaners Service Employees' Pension Plan* 12/31/2022, 12/31/2021, and 12/31/2020\nIUOE Stationary Engineers Local 39 Pension Plan 12/31/2022, 12/31/2021, and 12/30/2020\nLocal 210's Pension Plan* 12/31/2022, 12/31/2021, and 12/31/2020\nLocal 670 Pension Plan* 12/31/2022\nMassachusetts Service Employees Pension Plan* 12/31/2022, 12/31/2021, and 12/31/2020\nS.E.I.U National Industry Pension Fund 12/31/2022, 12/31/2021, and 12/31/2020\nSEIU Local 1 & Participating Employers Pension Trust 9/30/2022, 9/30/2021, and 9/30/2020\nService Employees International Union Local 1 Cleveland Pension Plan* 12/31/2022, 12/31/2021, and 12/31/2020\nService Employees International Union Local 32BJ, District 36 Building Operators Pension Trust Fund* 12/31/2022, 12/31/2021, and 12/31/2020\nTeamsters Local 617 Pension Fund* 2/28/2022, 2/28/2021, and 2/29/2020\nU.S.W.U. Local 74 Welfare Fund* 12/31/2022, 12/31/2021, and 12/31/2020\n* These plans are not separately listed in our multiemployer table as they represent an insignificant portion of our total multiemployer pension plan contributions.\nMultiemployer Defined Contribution Plans\nIn addition to contributions noted above, we also make contributions to multiemployer defined contribution plans. During 2023, 2022, and 2021, our contributions to the defined contribution plans were $59.2 million, $54.7 million, and $21.2 million, respectively.\nOther Multiemployer Benefit Plans\nWe also contribute to several multiemployer postretirement health and welfare plans based on obligations arising under collective bargaining agreements covering union-represented employees. These plans may provide medical, pharmacy, dental, vision, mental health, and other benefits to employees as determined by the trustees of each plan. The majority of our contributions benefit active employees and, as such, may not constitute contributions to a postretirement benefit plan. However, since we are unable to separate contribution amounts to postretirement benefit plans from contribution amounts paid to benefit active employees, we categorize all such amounts as contributions to postretirement benefit plans. During 2023, 2022, and 2021, our contributions to such plans were $441.8 million, $426.6 million, and $270.8 million, respectively. There have been no significant changes that affect the comparability of total contributions for any of the periods presented,except for the additions associated with the Able acquisition in 2022.\n13. COMMITMENTS AND CONTINGENCIES\nLetters of Credit and Surety Bonds\nWe use letters of credit and surety bonds to secure certain commitments related to insurance programs and for other purposes. As of October 31, 2023, these letters of credit totaled $58.2 million, and surety bonds and surety-backed letters of credit totaled $776.2 million, respectively.\nGuarantees\nIn some instances, we offer clients guaranteed energy savings under certain energy savings contracts. At October 31, 2023 and 2022, total guarantees were $218.0 million and $230.5 million, respectively, and these guarantees extend through 2043 and 2042, respectively. We accrue for the estimated cost of guarantees when it is probable that a liability has been incurred and the amount can be reasonably estimated. Historically, we have not incurred any material losses in connection with these guarantees.\nIndemnifications\nWe are party to a variety of agreements under which we may be obligated to indemnify the other party for certain matters. These agreements are primarily standard indemnification arrangements entered into in our ordinary course of business. Pursuant to these arrangements, we may agree to indemnify, hold harmless, and reimburse the indemnified parties for losses suffered or incurred by the indemnified party, generally our clients, in connection with any claims arising out of the services that we provide. We also incur costs to defend lawsuits or settle claims related to these indemnification arrangements, and in most cases these costs are paid from our insurance program. Although we attempt to place limits on such indemnification arrangements related to the size of the contract, the maximum obligation may not be explicitly stated and, as a result, we are unable to determine the maximum potential amount of future payments we could be required to make under these arrangements.\nOur certificate of incorporation and bylaws may require us to indemnify our directors and officers for certain liabilities that were incurred as a result of their status or service to ABM as a director or officer. The amount of these obligations cannot be reasonably estimated.\nUnclaimed Property Audits\nWe routinely remit escheat payments to states in compliance with applicable escheat laws, and we are subject to unclaimed property audits by states in the ordinary course of business. The property subject to review in the audit process may include unclaimed wages, vendor payments, or customer refunds. State escheat laws generally require entities to report and remit abandoned or unclaimed property to the state, and failure to do so can result in assessments that could include interest and penalties in addition to the payment of the escheat liability.\nLegal Matters\nWe are a party to a number of lawsuits, claims, and proceedings incident to the operation of our business, including those pertaining to labor and employment, contracts, personal injury, and other matters, some of which allege substantial monetary damages. Some of these actions may be brought as class actions on behalf of a class or purported class of employees.\nAt October 31, 2023, the total amount accrued for probable litigation losses where a reasonable estimate of the loss could be made was $13.9 million. We do not accrue for contingent losses that, in our judgment, are considered to be reasonably possible but not probable. The estimation of reasonably possible losses also requires the analysis of multiple possible outcomes that often depend on judgments about potential actions by third parties. Our management currently estimates the range of loss for all reasonably possible losses for which a reasonable estimate of the loss can be made is between zero and $5.7 million. Factors underlying this estimated range of loss may change from time to time, and actual results may vary significantly from this estimate.\nLitigation outcomes are difficult to predict and the estimation of probable losses requires the analysis of multiple possible outcomes that often depend on judgments about potential actions by third parties. If one or more matters are resolved in a particular period in an amount in excess of, or in a manner different than, what we anticipated, this could have a material adverse effect on our financial position, results of operations, or cash flows.\nIn some cases, although a loss is probable or reasonably possible, we cannot reasonably estimate the maximum potential losses for probable matters or the range of losses for reasonably possible matters. Therefore, our accrual for probable losses and our estimated range of loss for reasonably possible losses do not represent our maximum possible exposure.\n14. PREFERRED AND COMMON STOCK\nPreferred Stock\nWe are authorized to issue 500,000 shares of preferred stock. None of these preferred shares are issued.\nCommon Stock\nEffective December 18, 2019, our Board of Directors replaced our then-existing share repurchase program with a new share repurchase program under which we may repurchase up to $150.0 million of our common stock. Effective December 9, 2022, and December 13, 2023, our Board of Directors expanded the Share Repurchase Program by $150.0 millionand $150.0 million, respectively. Share repurchases may take place on the open market or otherwise, and all or part of the repurchases may be made pursuant to Rule 10b5-1 plans or in privately negotiated transactions. The timing of repurchases is at our discretion and will depend upon several factors, including market and business conditions, future cash flows, share price, share availability, and other factors. Repurchased shares are retired and returned to an authorized but unissued status. The repurchase program may be suspended or discontinued at any time without prior notice.\nRepurchase Activity\nWe repurchased shares under the share repurchase program during the year ended October 31, 2023, as summarized below. At October 31, 2023, authorization for $60.3 million of repurchases remained under the Share Repurchase Program.\nYears Ended October 31,\n(in millions, except per share amounts) 2023 2022\nTotal number of shares purchased 3.3 2.3\nAverage price paid per share(1)\n$ 41.06 $ 42.15\nTotal cash paid for share repurchases(1)\n$ 137.1 $ 97.5\n(1) Average price paid per share and total cash paid for share repurchases does not include any excise tax for stock repurchases as part of the Inflation Reduction Act of 2022.\n15. SHARE-BASED COMPENSATION PLANS\nWe use various share-based compensation plans to provide incentives for our key employees and non-employee members of our Board of Directors. Currently, these incentives primarily consist of RSUs and performance shares.\nOn May 2, 2006, our stockholders approved the 2006 Equity Incentive Plan, which was last amended and restated on March 7, 2018 (as amended and restated, the 2006 Equity Plan). The 2006 Equity Plan is an omnibus plan that provides for a variety of equity and equity-based award vehicles, including stock options, stock appreciation rights, RSUs, performance shares, and other share-based awards. Shares subject to awards that terminate without vesting or exercise are available for future awards under the 2006 Equity Plan. Certain of the awards under the 2006 Equity Plan may qualify as performance-based compensation under the IRC.\nOn March 24, 2021, our stockholders approved the 2021 Equity and Incentive Compensation Plan (the 2021 Equity Plan). The 2021 Equity Plan is an omnibus plan that provides for a variety of equity and equity-based award vehicles, including stock options, stock appreciation rights, RSUs, performance shares, and other share-based awards. Shares subject to awards that terminate without vesting or exercise are available for future awards under the 2021 Equity Plan. Certain of the awards under the 2021 Equity Plan may qualify as performance-based compensation under the IRC.\nNo further shares are authorized for issuance under the 2006 Equity Plan. There are 3,975,000 total shares of common stock authorized for issuance under the 2021 Equity Plan, and at October 31, 2023, there were 2,363,005 shares of common stock available for grant for future equity-based compensation awards. In addition, there are certain plans under which we can no longer issue awards, such as the 2006 Equity Plan, although awards outstanding under such plans may still vest and be exercised.\nWe also maintain an employee stock purchase plan, which our stockholders approved on March 9, 2004 (the 2004 Employee Stock Purchase Plan). As amended, there are 4,000,000 total shares of common stock authorized for issuance under the 2004 Employee Stock Purchase Plan. Effective May 1, 2006, the 2004 Employee Stock Purchase Plan is no longer considered compensatory and the values of the awards are no longer treated as share-based compensation expense. Additionally, as of that date, the purchase price became 95% of the fair value of our common stock price on the last trading day of the month. Employees may designate up to 10% of their compensation for the purchase of stock, subject to a $25,000 annual limit. Employees are required to hold their shares for a minimum of six months from the date of purchase. At October 31, 2023, there were 357,656 remaining unissued shares under the 2004 Employee Stock Purchase Plan.\nCompensation Expense by Type of Award and Related Income Tax Benefit\nYears Ended October 31,\n(in millions) 2023 2022 2021\nRSUs $ 17.7 $ 18.5 $ 17.6\nPerformance shares 12.7 12.0 15.8\nShare-based compensation expense before income taxes 30.5 30.5 33.5\nIncome tax benefit (8.6) (8.6) (9.4)\nShare-based compensation expense, net of taxes $ 21.8 $ 21.9 $ 24.1\nRSUs and Dividend Equivalent Rights\nWe award RSUs to eligible employees and non-employee members of our Board of Directors (each, a Grantee) that entitle the Grantee to receive shares of our common stock as the units vest. RSUs granted to eligible employees after 2020 generally vest ratably over three years. RSUs granted to eligible employees prior to 2020 generally vest with respect to 50% of the underlying award on the second and fourth anniversary of the award. Upon the retirement of certain executive employees at age 60 with a minimum of 10 years of service to the Company, pursuant to the terms of their respective employment agreements, RSUs granted to such executive employees that were granted at least one year prior to termination by reason of retirement will continue to be eligible for vesting, exercise, and settlement, as applicable, on the originally scheduled vesting date. RSUs granted to non-employee directors vest on the first anniversary date of the grant date. In general, the receipt of RSUs is subject to the grantees continuing employment or service as a non-employee director.\nRSUs are credited with dividend equivalent rights that are converted to RSUs at the fair market value of our common stock on the dates the dividend payments are made and are subject to the same terms and conditions as the underlying award.\nRSU Activity\nNumber of\nShares\n(in millions) Weighted-Average\nGrant Date\nFair Value per Share\nOutstanding at October 31, 2022\n1.0 $ 38.58\nGranted 0.5 44.37\nVested (including 0.2 shares withheld for income taxes)\n(0.4) 38.80\nForfeited\n(0.1) 42.71\nOutstanding at October 31, 2023 1.0 $ 41.09\nAt October 31, 2023, total unrecognized compensation cost, net of estimated forfeitures, related to RSUs was $19.5 million, which is expected to be recognized ratably over a weighted-average vesting period of 2.0 years.\nIn 2023, 2022, and 2021, the weighted-average grant date fair value per share of awards granted was $44.37, $41.63, and $40.22, respectively. In 2023, 2022, and 2021, the total grant date fair value of RSUs vested and converted to shares of ABM common stock was $17.1 million, $16.4 million, and $16.9 million, respectively.\nPerformance Shares, Including TSR Performance Shares\nPerformance shares consist of a contingent right to receive shares of our common stock based on performance targets adopted by our Compensation Committee. Performance shares are credited with dividend equivalent rights that will be converted to performance shares at the fair market value of our common stock beginning after the performance targets have been satisfied and are subject to the same terms and conditions as the underlying award.\nFor certain performance share awards, the number of performance shares that will vest is based on pre-established internal financial performance targets and typically a three-year service and performance period. The number of TSR-modified awards that will vest over the respective three-year performance period is based on our total shareholder return relative to the S&P 1500 Composite Commercial Services & Supplies Index. Vesting of 0% to 150% of the awards originally granted may occur depending on the respective performance metrics.\nPerformance Share Activity\nNumber of Shares\n(in millions) Weighted-Average\nGrant Date\nFair Value\nper Share\nOutstanding at October 31, 2022\n1.0 $ 41.30\nGranted 0.4 46.47\nVested (including 0.1 shares withheld for income taxes)\n(0.4) 38.08\nPerformance adjustments - 52.78\nForfeited - 42.30\nOutstanding at October 31, 2023 0.9 $ 44.43\nAt October 31, 2023, total unrecognized compensation cost related to performance share awards was $18.3 million, which is expected to be recognized ratably over a weighted-average vesting period of 1.9 years. Except for TSR performance shares, these costs are based on estimated achievement of performance targets and estimated costs are periodically reevaluated. For our TSR performance shares, these costs are based on the fair value of awards at the grant date and are recognized on a straight-line basis over the service period of three years.\nIn 2023, 2022, and 2021, the weighted-average grant date fair value per share of awards granted was $46.47, $43.06, and $39.97, respectively. In 2023, 2022, and 2021, the total grant date fair value of performance shares vested and converted to shares of ABM common stock was $14.6 million, $13.6 million, and $9.0 million, respectively.\nIn 2023, 2022, and 2021, we used the Monte Carlo simulation valuation technique to estimate the fair value of TSR performance share grants, which used the assumptions in the table below.\nMonte Carlo Assumptions\n2023 2022 2021\nExpected life(1)\n2.81 years 2.81 years 2.81 years\nExpected stock price volatility(2)\n39.9 % 41.8 % 42.9 %\nRisk-free interest rate(3)\n4.0 % 1.1 % 0.2 %\nStock price(4)\n$ 46.19 $ 42.88 $ 40.75\n(1) The expected life represents the remaining performance period of the awards.\n(2) The expected volatility for each grant is determined based on the historical volatility of our common stock over a period equal to the remaining term of the performance period from the date of grant for all awards.\n(3) The risk-free interest rate is based on the continuous compounded yield on U.S. Treasury Constant Maturity Rates with varying remaining terms; the yield is determined over a time period commensurate with the performance period from the grant date.\n(4) The stock price is the closing price of our common stock on the valuation date.\nEmployee Stock Purchase Plan\nYears Ended October 31,\n(in millions, except per share amounts) 2023 2022 2021\nWeighted-average fair value of granted purchase rights per share $ 2.23 $ 2.19 $ 2.17\nCommon stock issued 0.1 0.1 0.1\nFair value of common stock issued per share $ 42.40 $ 41.68 $ 41.18\nAggregate purchases $ 3.4 $ 3.4 $ 3.3\n16. INCOME TAXES\nGeographic Sources of Income Before Income Taxes\nYears Ended October 31,\n(in millions) 2023 2022 2021\nUnited States $ 294.3 $ 278.5 $ 152.8\nForeign 36.8 31.5 27.0\nIncome before income taxes\n$ 331.1 $ 310.0 $ 179.8\nComponents of Income Tax Provision\nYears Ended October 31,\n(in millions) 2023 2022 2021\nCurrent:\nFederal $ (50.6) $ 3.5 $ (66.3)\nState (25.0) (6.0) (27.4)\nForeign (9.0) (9.4) (7.8)\nDeferred:\nFederal (0.5) (46.1) 34.9\nState 5.3 (22.1) 13.2\nForeign 0.1 0.5 (0.1)\nIncome tax provision $ (79.7) $ (79.6) $ (53.5)\nReconciliation of the U.S. Statutory Tax Rate to Annual Effective Tax Rate\nYears Ended October 31,\n2023 2022 2021\nU.S. statutory rate 21.0 % 21.0 % 21.0 %\nState and local income taxes, net of federal tax benefit 6.9 7.7 6.8\nFederal and state tax credits (1.0) (1.5) (2.6)\nImpact of foreign operations 0.8 (0.1) 0.3\nChanges in uncertain tax positions 0.1 (2.5) 1.5\nIncremental tax benefit from share-based compensation awards (0.7) (0.5) (0.4)\nEnergy efficiency incentives (0.1) (0.3) (0.7)\nNondeductible executive compensation\n1.4 1.4 0.4\nNontaxable RavenVolt contingent consideration\n(3.9) - -\nOther nondeductible expenses 0.6 0.3 2.3\nOther, net (1.0) 0.2 1.2\nEffective tax rate 24.1 % 25.7 % 29.8 %\nDuring 2023 and 2022, we had effective tax rates of 24.1% and 25.7%, respectively, resulting in a provision for tax of $79.7 million and $79.6 million, respectively. Our effective tax rate for 2023 was impacted by a $12.8 million benefit related to the non-taxable change in the fair value of the contingent consideration related to the RavenVolt Acquisition, a $2.2 million benefit for share-based compensation; and a $1.5 million benefit for return to provision adjustment primarily related to state and local deferred income taxes; partially offset by a $4.8 million expense related to non-deductible executive compensation. Our effective tax rate for 2022 was impacted by the following items: an $8.1 million benefit for uncertain tax positions with expiring statutes; a $1.4 million benefit for share-based compensation; and a $1.3 million return to provision adjustments.\nUnder various payroll tax provisions included in the CARES Act, through December 31, 2020, we deferred approximately $132 million of payroll tax. The deferred payroll tax has been remitted in full: $66 million was paid in\nDecember 2021 and the remaining $66 million was paid in December 2022. The CARES Act did not have a material impact on our income tax provision.\nComponents of Deferred Tax Assets and Liabilities\nAs of October 31,\n(in millions) 2023 2022\nDeferred tax assets attributable to:\nSelf-insurance claims (net of recoverables) $ 95.2 $ 96.1\nDeferred and other compensation 31.4 33.0\nAccounts receivable allowances 7.8 5.8\nSettlement liabilities 4.5 10.4\nOther accruals 4.3 4.8\nState taxes 1.5 1.2\nState net operating loss carryforwards 2.6 3.2\nTax credits 2.3 3.1\nUnrecognized tax benefits 3.6 3.3\nDeferred payroll taxes - 18.1\nOperating lease liabilities 27.3 31.0\nGross deferred tax assets 180.5 210.0\nValuation allowance (1.2) (1.6)\nTotal deferred tax assets 179.3 208.4\nDeferred tax liabilities attributable to:\nProperty, plant and equipment (4.3) (5.4)\nGoodwill and other acquired intangibles (200.0) (222.9)\nRight-of-use assets (28.6) (31.9)\nTax accounting method change (11.7) (17.1)\nOther comprehensive Income (8.4) (9.0)\nOther (11.3) (11.8)\nTotal deferred tax liabilities (264.3) (298.1)\nNet deferred tax liabilities $ (85.0) $ (89.7)\nNet Operating Loss Carryforwards and Credits\nState net operating loss carryforwards totaling $48.7 million at October 31, 2023, are being carried forward in several state jurisdictions where we are permitted to use net operating losses from prior periods to reduce future taxable income. These losses will expire between 2024 and 2043. Federal net operating loss carryforwards were fully utilized during 2022. Federal and state tax credit carryforwards totaling $2.7 million are available to reduce future cash taxes and will expire between 2024 and 2043.\nThe valuation allowance represents the amount of tax benefits related to state net operating loss carryforwards that are not likely to be realized. We believe the remaining deferred tax assets are more likely than not to be realizable based on estimates of future taxable income.\nChanges to the Valuation Allowance\nYears Ended October 31,\n(in millions) 2023 2022 2021\nValuation allowance at beginning of year $ 1.6 $ 2.2 $ 4.1\nOther, net (0.4) (0.6) (1.9)\nValuation allowance at end of year $ 1.2 $ 1.6 $ 2.2\nUnrecognized Tax Benefits\nAt October 31, 2023, 2022, and 2021, there were $20.7 million, $22.0 million, and $30.4 million, respectively, of unrecognized tax benefits that if recognized in the future would impact our effective tax rate. We estimate that a decrease in unrecognized tax benefits of up to approximately $0.7 million is reasonably possible over the next 12 months due to lapses of applicable statutes of limitations. At October 31, 2023 and 2022, accrued interest and penalties were $1.4 million and $0.7 million, respectively. For interest and penalties, we recognized a $0.7 million expense, a $0.9 million benefit, and a $0.1 million expense in 2023, 2022, and 2021, respectively.\nReconciliation of Total Unrecognized Tax Benefits\nYears Ended October 31,\n(in millions) 2023 2022 2021\nBalance at beginning of year $ 22.0 $ 30.4 $ 35.5\nAdditions for tax positions related to the current year - - 3.7\nAdditions for tax positions related to prior years 2.1 0.3 0.3\nReductions for tax positions related to prior years (1.5) (1.5) (5.3)\nReductions for lapse of statute of limitations (1.9) (7.2) (2.5)\nSettlements - - (1.3)\nBalance at end of year $ 20.7 $ 22.0 $ 30.4\nJurisdictions\nWe conduct business in all 50 states, significantly in California, Texas, and New York, as well as in various foreign jurisdictions. Our most significant income tax jurisdiction is the United States. Due to expired statutes and closed audits, our federal income tax returns for years prior to fiscal 2020 are no longer subject to examination by the U.S. Internal Revenue Service. Generally, for the majority of state and foreign jurisdictions where we do business, periods prior to fiscal 2020 are no longer subject to examination. We are currently being examined by the tax authorities of California, New York City, Montana, Massachusetts, and Oregon.\n17. SEGMENT AND GEOGRAPHIC INFORMATION\nSegment Information\nOur current reportable segments consist of B&I, M&D, Education, Aviation, and Technical Solutions, as further described below.\nREPORTABLE SEGMENTS AND DESCRIPTIONS\nB&I B&I, our largest reportable segment, encompasses janitorial, facilities engineering, and parking services for commercial real estate properties (including corporate offices for high tech clients), sports and entertainment venues, and traditional hospitals and non-acute healthcare facilities. B&I also provides vehicle maintenance and other services to rental car providers.\nM&D M&D provides integrated facility services, engineering, janitorial, and other specialized services in different types of manufacturing, distribution, and data center facilities. Manufacturing facilities include traditional motor vehicles, electric vehicles, batteries, pharmaceuticals, steel, semiconductors, chemicals, and many others. Distribution facilities include e-commerce, cold storage, logistics, general warehousing, and others.\nEducation Education delivers janitorial, custodial, landscaping and grounds, facilities engineering, and parking services for public school districts, private schools, colleges, and universities.\nAviation Aviation supports airlines and airports with services ranging from parking and janitorial to passenger assistance, catering logistics, air cabin maintenance, and transportation.\nTechnical Solutions Technical Solutions specializes in facility infrastructure, mechanical and electrical services, including EV power design, installation and maintenance, as well as microgrid systems installations. These services can also be leveraged for cross-selling across all of our industry groups, both domestically and internationally.\nThe accounting policies for our segments are the same as those disclosed within our significant accounting policies in Note 2, Basis of Presentation and Significant Accounting Policies. Our management evaluates the performance of each reportable segment based on its respective operating profit results, which include the allocation of certain centrally incurred costs. Corporate expenses not allocated to segments include certain CEO and other finance and human resource departmental expenses, certain information technology costs, share-based compensation, certain legal costs and settlements, restructuring and related costs, certain actuarial adjustments to self-insurance reserves, and direct acquisition costs. Management does not review asset information by segment, therefore we do not present assets in this note.\nFinancial Information by Reportable Segment\nYears Ended October 31,\n(in millions) 2023 2022 2021\nRevenues\nBusiness & Industry $ 4,089.4 $ 4,095.9 $ 2,853.8\nManufacturing & Distribution 1,526.7 1,445.2 1,363.1\nEducation 880.4 834.7 830.8\nAviation 925.7 804.0 651.1\nTechnical Solutions 674.2 626.8 529.8\n$ 8,096.4 $ 7,806.6 $ 6,228.6\nOperating profit\nBusiness & Industry $ 315.6 $ 334.9 $ 285.9\nManufacturing & Distribution 161.7 161.8 155.5\nEducation\n49.7 47.1 61.5\nAviation 60.0 29.3 32.1\nTechnical Solutions(1)\n53.2 63.8 49.4\nGovernment Services - (0.3) (0.2)\nCorporate(2) (3)\n(226.6) (284.5) (374.6)\nAdjustment for income from unconsolidated affiliates, included in Aviation (3.9) (2.4) (2.1)\nAdjustment for tax deductions for energy efficient government buildings, included in Technical Solutions\n(0.3) (0.9) (1.2)\n409.5 348.8 206.3\nIncome from unconsolidated affiliates 3.9 2.4 2.1\nInterest expense (82.3) (41.1) (28.6)\nIncome before income taxes $ 331.1 $ 310.0 $ 179.8\nDepreciation and amortization\nBusiness & Industry $ 44.9 $ 47.1 $ 18.4\nManufacturing & Distribution 13.1 13.4 13.4\nEducation 22.5 25.4 30.5\nAviation 9.6 8.2 9.1\nTechnical Solutions 17.5 7.0 5.9\nCorporate 13.1 11.4 12.7\n$ 120.7 $ 112.4 $ 89.9\n(1) Reflects a $7.6 million gain on the sale of assets during the year ended October 31, 2022.\n(2) Reflects adjustments to the fair value of the contingent consideration payable related to the RavenVolt Acquisition of $45.6 million and an employee retention credit totaling $24.0 million during the year ended October 31, 2023.\n(3) Reflects accrued litigation settlement reserve totaling $142.9 million for the Bucio case during the year ended October 31, 2021.\nGeographic Information Based on the Country in Which the Sale Originated(1)\nYears Ended October 31,\n(in millions) 2023 2022 2021\nRevenues\nUnited States $ 7,565.6 $ 7,335.3 $ 5,847.8\nAll other countries 530.8 471.3 380.8\n$ 8,096.4 $ 7,806.6 $ 6,228.6\n(1) Substantially all of our long-lived assets are related to U.S. operations.\n18. SUBSEQUENT EVENTS\nShare Repurchase Program\nEffective December 18, 2019, our Board of Directors replaced our then-existing share repurchase program with a new share repurchase program under which we may repurchase up to $150.0 million of our common stock. Effective December 9, 2022, and December 13, 2023, our Board of Directors expanded the Share Repurchase Program by $150.0 million and $150.0 million, respectively. Repurchases of our common stock may take place on the open market or otherwise, and all or part of the repurchases may be made pursuant to Rule 10b5-1 plans or in privately negotiated transactions. The timing of repurchases is at our discretion and will depend upon several factors, including market and business conditions, future cash flows, share price, and share availability. Repurchased shares are retired and returned to an authorized but unissued status. The Share Repurchase Program may be suspended or discontinued at any time without prior notice. At December 13, 2023, authorization for $210.3 million of repurchases remained under the Share Repurchase Program. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\na. Disclosure Controls and Procedures.\nAs of the end of the period covered by this report, our Principal Executive Officer and Principal Financial Officer evaluated our disclosure controls and procedures, as such term is defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act. Based upon that evaluation, our Principal Executive Officer and Principal Financial Officer concluded that as of the end of the period covered by this report, our disclosure controls and procedures were effective to ensure that information required to be disclosed by us in reports we file or submit under the Exchange Act is (1) recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission and (2) accumulated and communicated to our management, including our Principal Executive Officer and Principal Financial Officer, to allow timely decisions regarding required disclosure.\nb. Managements Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Under the supervision and with the participation of our management, including our Principal Executive Officer and Principal Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based upon the framework in Internal Control - Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that evaluation, our management concluded that our internal control over financial reporting was effective as of October 31, 2023.\nAudit Report on Internal Controls Over Financial Reporting of the Registered Public Accounting Firm\nKPMG LLP, an independent registered public accounting firm, has audited the consolidated financial statements included in this Annual Report on Form 10-K and, as part of their audit, has issued their report, included herein, on the effectiveness of our internal control over financial reporting.\nc. Changes in Internal Control Over Financial Reporting.\nTo support the growth of our financial shared service capabilities and standardize our financial systems, we continue to update several key platforms, including our HR information systems, enterprise resource planning system, and labor management system. The implementation of several key platforms involves changes in the systems that include internal controls. During the year ended October, 31 2023, we had a change in our internal control over financial reporting as a result of our implementation of a new ERP for the Education industry group that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. The new ERP system for the Education industry group replaced our legacy system in which a significant portion of our business transactions originate, are processed, and recorded. The rest of our industry groups will transition to our new ERP system over the next several years. Our new ERP system is intended to provide us with enhanced transactional processing and management tools compared with our legacy system and is intended to enhance internal controls over financial reporting. We believe our new ERP system will facilitate better transactional reporting and oversight, enhance our internal control over financial reporting, and function as an important component of our disclosure controls and procedures. Although some of the transitions have proceeded to date without material adverse effects, the possibility exists that they could adversely affect our internal controls over financial reporting and procedures.\nOther than the change of our ERP system for the Education industry group, there have been no other changes in our internal control over financial reporting during the fiscal year 2023 identified in connection with the evaluation required by Rules 13a-15(d) and 15d-15(d) of the Exchange Act that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE.\nInformation about our executive officers is found in Part I, Item 1, of this Annual Report on Form 10-K under Executive Officers of Registrant. Additional information required by this Item will be set forth under the captions Proposal No. 1-Election of Directors, Corporate Governance and Board Matters, and Audit-Related Matters in our Definitive Proxy Statement for our 2024 Annual Meeting of Stockholders (the 2024 Proxy Statement). Such information is incorporated herein by reference. Our 2024 Proxy Statement will be filed with the Securities and Exchange Commission within 120 days after the conclusion of our fiscal year ended October 31, 2023.\nOn March 29, 2023, we filed our Annual CEO Certification as required by Section 303A.12 of the NYSE Listed Company Manual.\nCode of Business Conduct\nWe have adopted and posted on our website (www.abm.com) the ABM Code of Business Conduct. Our Code of Business Conduct qualifies as a code of ethics within the meaning of Item 406 of Regulation S-K. Our Code of Business Conduct applies to all of our directors, officers, and employees, including our Principal Executive Officer, Principal Financial Officer, and Principal Accounting Officer. If any amendments are made to the Code of Business Conduct or if any waiver, including any implicit waiver, from a provision of the Code of Business Conduct is granted to our Principal Executive Officer, Principal Financial Officer, or Principal Accounting Officer, we will disclose the nature of such amendment or waiver on our website at the address specified above. ITEM 11. EXECUTIVE COMPENSATION.\nInformation with respect to executive compensation required by this Item will be set forth under the captions Director Compensation for Fiscal Year 2023, Executive Compensation, and Corporate Governance and Board Matters-Compensation Committee Interlocks and Insider Participation in our 2024 Proxy Statement and is incorporated herein by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nInformation with respect to security ownership of certain beneficial owners and management and equity compensation plan information and related stockholder matters required by this Item will be set forth under the captions General Information-Security Ownership of Certain Beneficial Owners, General Information-Security Ownership of Directors and Executive Officers, and General Information-Equity Compensation Plan Information in our 2024 Proxy Statement and is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nInformation with respect to certain relationships and related transactions and with respect to director independence required by this Item will be set forth under the captions General Information-Certain Relationships and Transactions with Related Persons and Corporate Governance and Board Matters in our 2024 Proxy Statement and is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nInformation with respect to our Audit Committees pre-approval policy for audit services performed by KPMG LLP (PCAOB ID 185) and our principal accounting fees and services required by this Item will be set forth under the caption Audit-Related Matters in our 2024 Proxy Statement and is incorporated herein by reference.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\n(a)The following documents are filed as part of this report:\n1. Financial Statements: Index to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at October 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income for the Years Ended October 31, 2023, 2022, and 2021\nConsolidated Statements of Stockholders Equity for the Years Ended October 31, 2023, 2022, and 2021\nConsolidated Statements of Cash Flows for the Years Ended October 31, 2023, 2022, and 2021\n2. Financial Statement Schedule\nValuation and Qualifying Accounts for the Years Ended October 31, 2023, 2022, and 2021\n3. Exhibits\nExhibit Index\nABM INDUSTRIES INCORPORATED AND SUBSIDIARIES\nSCHEDULE II-VALUATION AND QUALIFYING ACCOUNTS\n(in millions) Balance\nBeginning of Year Additions from Acquisitions Charges to\nCosts and Expenses Write-offs(1)/ Allowance Taken\nBalance\nEnd of Year\nAccounts receivable and sales allowances\n2023 $ 22.6 - 76.0 (73.6) $ 25.0\n2022 32.7 1.4 60.6 (72.1) 22.6\n2021 35.5 1.3 44.3 (48.4) 32.7\n(1) Write-offs are net of recoveries.\nEXHIBIT INDEX\nExhibit Exhibit Description Incorporated by Reference\nNo. Form File No. Exhibit Filing Date\n1.1 Underwriting Agreement, dated March 14, 2018, among ABM Industries Incorporated, Goldman Sachs & Co LLC, and UBS Securities LLC\n8-K 001-08929 1.1 March 19, 2018\n2.1 Agreement and Plan of Merger, dated July 11, 2017, among GCA Holding Corp., ABM Industries Incorporated, Grade Sub One, Inc., Grade Sub Two, LLC and Thomas H. Lee Equity Fund VII, L.P. and Broad Street Principal Investments Holdings, L.P., acting jointly as the Securityholder Representative\n8-K 001-08929 2.1 July 14, 2017\n2.2 Purchase Agreement, dated August 25, 2021, among Crown Building Maintenance Co., Crown Energy Services, Inc., ABM Industries Incorporated and the sellers and sellers representative party thereto\n8-K 001-08929 2.1 August 25, 2021\n2.3 Agreement and Plan of Merger, dated August 17, 2022, by and among ABM Industries Incorporated, RavenVolt Merger Sub, Inc., RavenVolt, Inc. and Jonathan Hinton, as shareholders representative\n8-K 001-08929 2.1 August 18, 2022\n3.1 Restated Certificate of Incorporation of ABM Industries Incorporated, dated March 26, 2020\n8-K 001-08929 3.1 March 27, 2020\n3.2 Amended and Restated Bylaws of ABM Industries Incorporated, dated March 26, 2020\n8-K 001-08929 3.2 March 27, 2020\n4.1 Description of Registrants Securities\n10-K 001-08929 4.1 December 17, 2020\n10.1 Credit Agreement, dated as of September 1, 2017, by and among ABM Industries Incorporated, a Delaware corporation, certain subsidiaries of ABM Industries Incorporated from time to time party thereto, the lenders from time to time party thereto and Bank of America, N.A., as administrative agent\n8-K 001-08929 10.2 September 8, 2017\n10.2 Letter Agreement, dated November 6, 2017, between ABM Industries Incorporated and Bank of America, N.A., as Swingline Lender with respect to the Credit Agreement dated as of September 1, 2017, among ABM Industries Incorporated, the Designated Borrowers party thereto, the Lenders party thereto and Bank of America, N.A., as administrative agent\n10-K 001-08929 10.3 December 22, 2017\n10.3 First Amendment, dated as of July 3, 2018, to the Credit Agreement dated September 1, 2017, by and among ABM Industries Incorporated, a Delaware corporation, the Designated Borrowers identified on the signature pages thereto, the Guarantors identified on the signature pages thereto, the Lenders identified on the signature pages thereto, and Bank of America, N.A., as administrative agent\n10-Q 001-08929 10.1 September 7, 2018\n10.4 Second Amendment, dated as of September 5, 2018, to the Credit Agreement dated September 1, 2017, by and among ABM Industries Incorporated, a Delaware corporation, the Designated Borrowers identified on the signature pages thereto, the Guarantors identified on the signature pages thereto, the Lenders identified on the signature pages thereto, and Bank of America, N.A., as administrative agent\n10-Q 001-08929 10.2 September 7, 2018\n10.5 Third Amendment, dated as of May 28, 2020, to the Credit Agreement dated September 1, 2017, by and among ABM Industries Incorporated, a Delaware corporation, the Designated Borrowers identified on the signature pages thereto, the Guarantors identified on the signature pages thereto, the Lenders identified on the signatures pages thereto and Bank of America, N.A., as administrative agent\n10-Q 001-08929 10.1 June 18, 2020\n10.6 Fourth Amendment, dated as of June 28, 2021, to the Credit Agreement dated September 1, 2017, by and among ABM Industries Incorporated, a Delaware corporation, the Designated Borrowers identified on the signature pages thereto, the Guarantors identified on the signature pages thereto, the Lenders identified on the signature pages thereto and Bank of America, N.A., as administrative agent\n10-Q 001-08929 10.1 September 9, 2021\n10.7\nFifth Amendment, dated as of November 1, 2022, to the Credit Agreement dated September 1, 2017, by and among ABM Industries Incorporated, a Delaware corporation, the Designated Borrowers identified on the signature pages thereto, the Subsidiary Guarantors identified on the signature pages thereto, the Lenders identified on the signature pages thereto and Bank of America, N.A., as administrative agent\n10-K\n001-08929 10.7 December 21, 2022\n10.8\nLIBOR Transition Amendment, dated as of November 1, 2022, by and among ABM Industries Incorporated, a Delaware corporation, the Designated Borrowers identified on the signature pages thereto, the Subsidiary Guarantors identified on the signature pages thereto, the Lenders identified on the signature pages thereto and Bank of America, N.A., as administrative agent\n10-K\n001-08929 10.8 December 21, 2022\n10.9* ABM Executive Retiree Healthcare and Dental Plan\n10-K 001-08929 10.17 January 14, 2005\n10.10*\nDeferred Compensation Plan for Non-Employee Directors, as amended and restated December 13, 2010\n10-K 001-08929 10.7 December 23, 2010\n10.11*\nForm of Directors Indemnification Agreement\n10-K 001-08929 10.9 December 21, 2018\n10.12*\n2006 Equity Incentive Plan, as amended and restated March 7, 2018\n8-K 001-08929 10.1 March 8, 2018\n10.13*‡\nABM Industries Incorporated 2021 Equity and Incentive Compensation Plan, as amended and restated October 2, 2023\n10.14*\nStatement of Terms and Conditions Applicable to Options, Restricted Stock and Restricted Stock Units, and Performance Shares Granted to Employees Pursuant to the 2006 Equity Incentive Plan, for Awards Granted on or after March 4, 2015\n10-Q 001-08929 10.2 June 3, 2015\n10.15*\nStatement of Terms and Conditions Applicable to Options, Restricted Stock and Restricted Stock Units, and Performance Shares Granted to Employees Pursuant to the 2006 Equity Incentive Plan, for Awards Granted on or after January 1, 2020\n10-Q 001-08929 10.1 March 5, 2020\n10.16*\nStatement of Terms and Conditions Applicable to Awards Granted to Employees Pursuant to the 2021 Equity and Incentive Compensation Plan\n10-Q 001-08929 10.1 June 9, 2021\n10.17*\nStatement of Terms and Conditions Applicable to Awards Granted to UK Employees Pursuant to the 2021 Equity and Incentive Compensation Plan\n10-K\n001-08929 10.20 December 21, 2022\n10.18*\nStatement of Terms and Conditions Applicable to Awards Granted to Employees Pursuant to the 2021 Equity and Incentive Compensation Plan, for Awards Granted on or after January 1, 2022\n10-Q 001-08929 10.1 March 9, 2022\n10.19*‡\nStatement of Terms and Conditions Applicable to Awards Granted to Employees Pursuant to the 2021 Equity and Incentive Compensation Plan, for Awards Granted on or after October 2, 2023\n10.20*\nStatement of Terms and Conditions Applicable to Options, Restricted Stock, and Restricted Stock Units Granted to Directors Pursuant to the 2006 Equity Incentive Plan, for Awards Granted on or after March 4, 2015\n10-Q 001-08929 10.3 June 3, 2015\n10.21*\nStatement of Terms and Conditions Applicable to Options, Restricted Stock, and Restricted Stock Units Granted to Directors Pursuant to the 2006 Equity Incentive Plan, for Awards Granted on or after January 1, 2020\n10-Q 001-08929 10.2 March 5, 2020\n10.22*\nStatement of Terms and Conditions Applicable to Awards Granted to Non-Employee Directors Pursuant to the 2021 Equity and Incentive Compensation Plan\n10-Q 008-08929 10.2 June 9, 2021\n10.23*\nForm of Restricted Stock Unit Agreement - 2006 Equity Plan\n10-K 001-08929 10.18 December 20, 2019\n10.24*\nForm of Restricted Stock Unit Agreement for Employees - 2021 Equity and Incentive Compensation Plan\n10-Q 001-08929 10.2 March 9, 2022\n10.25*\nForm of Performance Share Agreement - 2006 Equity Plan\n10-K 001-08929 10.19 December 20, 2019\n10.26*\nForm of Performance Share Agreement for Employees - 2021 Equity and Incentive Compensation Plan\n10-Q 001-08929 10.3 March 9, 2022\n10.27*\nExecutive Stock Option Plan (aka Age-Vested Career Stock Option Plan), as amended and restated June 4, 2012\n10-Q 001-08929 10.1 September 6, 2012\n10.28*\nDeferred Compensation Plan for Executives, amended and restated October 25, 2010\n10-K 001-08929 10.22 December 23, 2010\n10.29*‡\nDeferred Compensation Plan for Executives, amended and restated October 2, 2023\n10.30*\nSupplemental Executive Retirement Plan, as amended and restated June 3, 2008\n10-Q 001-08929 10.4 September 8, 2008\n10.31*\nService Award Benefit Plan, as amended and restated June 3, 2008\n10-Q 001-08929 10.5 September 8, 2008\n10.32*\nExecutive Severance Pay Policy, as amended and restated March 7, 2011\n10-Q 001-08929 10.1 March 10, 2011\n10.33*\nAmended and Restated Executive Employment Agreement, dated as of September 22, 2017, by and between ABM Industries Incorporated and Scott Salmirs\n10-K 001-08929 10.28 December 22, 2017\n10.34*\nAmended and Restated Change in Control Agreement, dated as of September 22, 2017, by and between ABM Industries Incorporated and Scott Salmirs\n10-K 001-08929 10.29 December 22, 2017\n10.35*\nExecutive Employment Agreement, dated as of January 1, 2018, by and between ABM Industries Incorporated and Rene Jacobsen\n10-Q 001-08929 10.3 March 7, 2018\n10.36*\nChange in Control Agreement, dated as of January 1, 2018, by and between ABM Industries Incorporated and Rene Jacobsen\n10-Q 001-08929 10.4 March 7, 2018\n10.37*\nExecutive Employment Agreement, dated as of March 1, 2018, by and between ABM Industries Incorporated and Andrea Newborn\n10-Q 001-08929 10.1 March 7, 2019\n10.38*\nChange in Control Agreement, dated as of March 1, 2018, by and between ABM Industries Incorporated and Andrea Newborn\n10-Q 001-08929 10.2 March 7, 2019\n10.39*\nExecutive Employment Agreement, dated as of October 28, 2019, by and between ABM Industries Incorporated and Joshua H. Feinberg\n10-K 001-08929 10.35 December 20, 2019\n10.40*\nChange in Control Agreement, dated as of February 8, 2020, by and between ABM Industries Incorporated and Joshua H. Feinberg\n10-Q 001-08929 10.4 June 9, 2021\n10.41*\nExecutive Employment Agreement, dated as of November 1, 2020, by and between ABM Industries Incorporated and Earl R. Ellis\n10-Q 001-08929 10.6 June 9, 2021\n10.42*\nChange in Control Agreement, dated as of November 30, 2020, by and between ABM Industries Incorporated and Earl R. Ellis\n10-Q 001-08929 10.7 June 9, 2021\n10.43*\nChange in Control Agreement, dated as of April 1, 2011, by and between ABM Industries Incorporated and Dean A. Chin\n10-Q 001-08929 10.3 June 9, 2021\n10.44*\nSenior Executive Severance Pay Policy, as amended and restated March 7, 2011\n10-Q 001-08929 10.4 March 9, 2022\n21.1‡ Subsidiaries of the Registrant\n23.1‡ Consent of Independent Registered Public Accounting Firm\n31.1‡ Certification of Chief Executive Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2‡ Certification of Chief Financial Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1 Certifications pursuant to Securities Exchange Act of 1934 Rule 13a-14(b) or 15d-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n97*‡ ABM Industries Incorporated Amended and Restated Recoupment Policy, effective October 2, 2023\n101.INS ‡ Inline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH ‡ Inline XBRL Taxonomy Extension Schema Document\n101.CAL‡ Inline XBRL Taxonomy Calculation Linkbase Document\n101.LAB ‡ Inline XBRL Taxonomy Label Linkbase Document\n101.PRE ‡ Inline XBRL Presentation Linkbase Document\n101.DEF ‡ Inline XBRL Taxonomy Extension Definition Linkbase Document\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n* Indicates management contract or compensatory plan, contract, or arrangement\n‡ Indicates filed herewith\nIndicates furnished herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nABM Industries Incorporated\nBy: /s/ Scott Salmirs\nScott Salmirs\nPresident and Chief Executive Officer and Director\nDecember 18, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of ABM Industries and in the capacities and on the dates indicated.\nBy: /s/ Scott Salmirs\nScott Salmirs\nPresident and Chief Executive Officer and Director\n(Principal Executive Officer)\nDecember 18, 2023\n/s/ Earl R. Ellis /s/ Dean A. Chin\nEarl R. Ellis\nExecutive Vice President and\nChief Financial Officer\nDean A. Chin\nSenior Vice President, Chief Accounting Officer,\nCorporate Controller and Treasurer\n(Principal Financial Officer) (Principal Accounting Officer)\nDecember 18, 2023 December 18, 2023\n/s/ Sudhakar Kesavan /s/ Quincy L. Allen\nSudhakar Kesavan Quincy L. Allen, Director\nChairman of the Board and Director December 18, 2023\nDecember 18, 2023\n/s/ LeighAnne G. Baker /s/ Donald F. Colleran\nLeighAnne G. Baker, Director Donald F. Colleran, Director\nDecember 18, 2023 December 18, 2023\n/s/ James D. DeVries /s/ Art A. Garcia\nJames D. DeVries, Director Art A. Garcia, Director\nDecember 18, 2023 December 18, 2023\n/s/ Thomas M. Gartland /s/ Jill M. Golder\nThomas M. Gartland, Director Jill M. Golder, Director\nDecember 18, 2023 December 18, 2023\n/s/ Winifred M. Webb\nWinifred M. Webb, Director\nDecember 18, 2023"
}