{
    "cik": "772263",
    "company": "NITCHES INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-07",
    "period_of_report": "2023-08-31",
    "sic": "2330",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/772263/0001393905-23-000404-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/772263/000139390523000404/nich-20230831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/772263/0001393905-23-000404.txt",
    "filename": "772263_10K_2023_0001393905-23-000404.htm",
    "content": "ITEM 1. BUSINESS\nCompany Overview and Plan of Operation\nThe Company was founded with the name, Beebas Creations, Inc., originally as a California corporation and was a wholesale importer and distributor of clothing, home décor and tabletop products it manufactured under its own specifications and distributed in the United States under its own brand labels and other retailer-owned private labels. It changed its name to Nitches, Inc. in 1995 and the Company moved jurisdiction to Nevada in 2008.\nOn November 5, 2020, International Ventures Society, LLC, a Nevada limited liability company, was appointed custodian of the Company pursuant to an Order of District Court of Clark County, Nevada. On November 6, the Company adopted amended Articles of Incorporation, which created the 2020 Series A Preferred Stock, with one share authorized. This one share effectively controls the Company by representing no less than 60% of all combined votes of Common and Preferred Stock at any time, and was issued to International Ventures Society LLC on the same day.\nOn December 16, 2020, International Ventures Society, LLC sold the one outstanding share of 2020 Series A Preferred Stock to Accelerate Global Market Solutions, a change of control transactions that resulted in John Morgan becoming CEO and launching the Companys new business plan.\nBusiness Overview\nNitches works one-on-one with social media influencers from design concept through final manufacturing and distribution to deliver select, superior quality products that reflect the personalities of their unique brands. The social media influencers market the products to their followers on their own social media platforms versus spending excessive amounts on advertising in traditional media.\nThe Nitches corporation is focused on distribution and production of household, lifestyle, travel & leisure, and sports goods and clothing, with a long-term objective of bringing sustainable business practices to the supply chain for these products. Our method is to identify business partners that are innovating outside of the box of what is currently trendy in the market and outside of the box of traditional marketing. Nitches aims to find the diamonds in the rough before the world knows about them. Our objective is to find brands (or people that have brands and people that ARE brands) that are on their way to the top of their verticals with new tech, new concepts, or state-of-the-art patents … and then we take them there; these social influencers are our partners (our Social Media Partners) for whom we will white-label and back-end brand merchandise and with whom we will drive demand for goods from sustainable supply chains.\nThe Company is again in the business of wholesale manufactured goods, but it white-labels them under the brand names of our Social Media Partners and also distributes them in an on-line department store where each of our Social Media Partners can sell their respective white-labeled merchandise marketing them first to their own social media followers as the patient zeros of their viral marketing campaigns to commercialize the personal brands they have built. Our business plan is place orders with global manufacturers of high margin household, lifestyle, travel & leisure, and sporting goods, white label these products under the brands that Our Social Media Partners have already cultivated, and then use the social media follower base of Our Social Media Partners to market and promote the products and distribute them through on-line store on the Nitches website, https://nitchescorp.com/brands/. This marketplace stitches niches of fans together in an on-line bazaar - hence Nitches.\nManagement believes we will not need an actual sales team to market our white-labeled products as our stable of Social Media Partners each have a built-in market to advertise their merchandise to simply by featuring their own brand merchandise in their social media content.\nManagement plans to create an equity incentive program whereby our Social Media Partners can earn and vest shares of our common stock by achieving certain social media analytics and sales thresholds thereby being compensated them for the strength of their social media follower base. Management believes this strategy will be key to attracting strong social media influencers as their modus operandi is capitalizing on their influence, or follower base. We do not anticipate launching our equity incentive plan before the 4th quarter of 2023 and do not yet have a specific time-frame for doing so.\nThe first line of goods we have made available to our Social Media Partners to white-label is athleisure clothing (clothing designed for exercise and everyday use) as management believes the purpose of the first good to be sold should be to test the market and build brand awareness. We believe our Nitches clothing and lifestyle products will mesh seamlessly with the social media content of our Social Media Partners as social media is all about showcasing lifestyle.\nOne Social Media Partners on-line store is already open and selling its first product and another one is opening soon; one can check them out here: https://nitchescorp.com/brands/. So far both brands have placed bulk orders for merchandise which have been fulfilled, but sales have just begun so far only selling a dozen or so items.\nNitches developed the NITCHES OVS its industry-changing Owner Verification System (OVS™) mobile app called NITCHES OVS, an application (app) that can be used to verify authenticity and ownership of Nitches luxury products, apparel and streetwear clothing items. The Company believes registering the product and its unique QR code as an NFT will help protect each brand and their name, image and likeness as well as make the purchase of its goods a unique irreplaceable experience for customers.\nNitches has successfully submitted the NITCHES OVS app to Apple iTunes (iPhone) and Google Play (Android) stores. It is now available for buyers who purchase products from stores registered with Nitches. NITCHES OVS is On October 21, 2021, Nitches signed its first Celebrity Influencer Mr. John Lewis aka The Badass Vegan (https://badassvegan.com) for its first branded clothing line. As part of the contract, Nitches will be launching 10 clothing items for Mr. John Lewis aka The Badass Vegan, our brand ambassador, with a lead time of 30 days for the first 10 clothing items and styles to be produced and custom manufactured through Nitches. The collection is now for sale and a limited number of orders have already been placed and fulfilled.\nA template of our Brand Ambassador Agreement is attached at Exhibit 6.1, a version of which we sign with each of our Social Media Partners. The agreements have a term of three years and may be extended by written agreement of both parties. The agreements grant the Company a license to use the ambassadors image in our public relations, advertising and marketing to promote company products. The ambassador has the responsibility to use their social media and participate in certain activities to help promote the Companys products. The ambassador is entitled to 50% of the Companys net profits from the ambassadors brand. For more information regarding these agreements, see the Brand Ambassador Agreement attached as Exhibit 6.1.\nA rundown of our agreements with each of our Social Media Partners follows:\nOn March 8, 20211, Nitches signed an agreement with visual artist Anthony Piper will design and write the creative concepts around the collaborative Peace on Marz campaign. Peace on Marz is the result of a collaboration with Viral Vegan Influencer and Filmmaker John Lewis to create a luxury athleisure clothing collection and comprehensive NFT strategy aimed at protecting our planet. An important part of the project is developing an animated story for Peace on Marz, which will have a similar creative artistic flair as to Trill League, his celebrated web comic and graphic novel. Trill League is a hip-hop infused vision of a black superhero universe. For the Peace on Marz campaign, Piper will develop and creative direct a new Intellectual Property (IP) consisting of multi-faceted Marz Variant characters, eye-catching drawings and compelling storylines.\nOn March 22, 2022, Nitches signed an agreement to design a limited-edition capsule collection with illustrious Football Coach Steve Calhoun and his Armed and Dangerous Football Camp. The pro-style training camps prepare quarterbacks, wide receivers, tight ends, running backs, defensive backs, safeties and linebackers for the next level and beyond. In addition to designing a capsule collection of branded clothing and apparel items, Nitches renowned artists will work with Armed and Dangerous to create collectible NFTs (non-fungible tokens) that can be used by buyers as Digital Art. Managements strategy use the white-labeled sporting goods ordered under this influencers brand to further develop relationships with manufacturers of high margin goods as a necessary step in diversifying the Nitches branded product lines outward from the athleisure clothing.\nManagement believes Nitches Corporation will give our clients and partners access to many of the key alternative production countries. To date, the manufacturers we have used have been located in Hong Kong, but we are continually evaluating other prospects located in different countries. China manufacturing is not the only place that you can get quality mass production at high levels. Working with multiple partner facilities across Asia gives us the best ability to get the right quality production capacity coupled with the lowest price to ensure your high-volume output. Because we work on a per-project basis and have not yet entered into any long-term partnerships with any single manufacturer,\nwe are able to better protect ourselves from risks related to any individual market and ensure we are receiving quality results at a low price.\nOn November 25, 2022, management decided to close-down all of its metaverse and NFT initiatives due to prohibitive costs of development, uncertainty of their monetization, and the early results of so-called industry leaders in metaverse development. The only remaining activities/initiatives involving NFTs are in regards to our Nitches OVS platform, as described below.\nAdditionally, management abandoned plans to accept cryptocurrency for our online stores due to volatility of price and the concerns that created for management in managing its supply chain. We had not yet begun to accept any cryptocurrencies in our online store(s).\nThe company finalized its obligations to assist and launch the Peace on Mars (POM) NFT collection on behalf of the project owner, our Social Media Partner, John Lewis. The Company was responsible to contract with the artist and pay the fees to mint the collection on opensea.io. The collection has been minted and can be viewed at the following address: https://opensea.io/collection/peace-on-marz. Custody of the NFT will be with the individual that goes to the link to mint it, from there it will be distributed to the individual users digital (Ethereum) wallet. The purpose of the making the POM NFTs available for minting is just to build brand recognition for POM.\nThey will be transferable and able to be sold on opensea.io, a website to explore, collect, and sell NFTs (OpenSea). Open Sea charges a transaction fee on trade of an NFT called a gas fee1. Nitchess role in the minting of the NFTs is hosting the mint page on its website from the which the NFT connects to the block chain and will be transferred to the users digital wallet. As the host of the mint page for the NFTs, the Company is eligible to receive a portion of the gas fees from any sales of the NFTs on the Open Sea platform, which equate to about 6% of any resale through the Open Sea platform. However, the POM NFTs were minted just to build brand recognition for the collection. We do not anticipate any meaningful revenue from the NFTs but are optimistic that they will help with brand recognition and therefore increase product sales. Our only remaining obligations with the POM project relate to promoting and offering the product line in accordance with our Brand Ambassador Agreement.\nAnti-Knockoff Owner Verification System (OVSä)\nIn March of 2022, Nitches completed its industry-changing Owner Verification System (OVS™) mobile app called NITCHES OVS. Nitches has successfully submitted the NITCHES OVS app to Apple iTunes (iPhone) and Google Play (Android) stores. It is now available for buyers who purchase products from stores registered with Nitches. NITCHES OVS is an application (app) that can be used to prove ownership of Nitches luxury products, apparel and streetwear clothing items.\nNitches developed the NITCHES OVS to show the authenticity of its limited-edition capsule collections and NFTs (non-fungible tokens) that are created with well-known celebrities and influencers. To reduce costs on Ethereum gas fees, Nitches minted its NFTs on the polygon blockchain network. Polygon is faster and less expensive for transactions than Ethereum.\nNitches plans to provide its NITCHES OVS to other businesses that want to protect their products, apparel and clothing from counterfeiting. According to Ghost Data, about 20 percent of fashion products advertised on social media are fake.\nThe NFTs minted through NITCHES OVS are a digital asset designed to help protect businesses from counterfeiters and to provide consumers with verification that the good purchased is authentic and not a pirated good. Each product sold by the Company will have a unique QR code that, if the purchaser so desires, can be linked to an NFT which will verify the identity of that product and confirm its authenticity. The Company does not anticipate the NFTs to have any value separate from the goods they are authenticating, and any transfer of the NFTs will come in conjunction with the sale of the goods which they are authenticating. The minting of each NFT will be complete at the time of purchase and there will be no fractionalization of the NFTs. There is no dividends, royalties, or other common enterprise that the holders of the NFTs will be entitled to. The NFTs are purely a verification token designed to protect businesses and consumers from counterfeit goods.\n1 This FAQ on the OpenSea website explains what gas fees are, why they are needed, who gets them: https://support.opensea.io/hc/en-us/articles/1500006315941-What-are-gas-fees-\nThe Company believes registering the product and its unique QR code as an NFT will help protect each brand and their name, image and likeness as well as make the purchase of its goods a unique irreplaceable experience for customers by owning a unique wearable NFT clothing item. The Company believes this will increase engagement with the Companys social media presence creating an on-line community of its customers thereby improving brand identity for the Company - while also preventing counterfeiting and allowing true verification (consumers and customers can verify they are real and authentic) of authentication (authenticity) of its products with various entertainers, celebrities and social media influencers. However the Company does not believe the NFT will have any value separate from the value of the physical item and purchasers of the physical goods should not expect any capital appreciation of the NFT.\nThe OVS App is being built on the Ethereum, an open public decentralized platform, where no single person or group has control. The App will integrate with leading Ethereum/Polygon wallets, including MetaMask, Ledger Nano X, TronLink, Scatter, Coinbase and Trust. The purpose of the NFT created in the OVS App is to verify the good purchased and verify to anyone that it is authentic and not a pirated good infringing on the brand using the OVS App.\nThe decision whether to mint the NFT is solely within the purchaser of the good and the purchaser has custody over the NFT it decides to mint; each NFT minted has a unique QR code that links to a verification of the good purchased with its purchase date, which also serves to verify if the good was purchased as part of a capsule collection. The NFT is transferable and designed to be transferred to a buyer of the good it authenticates, however that is purely up to the buyer and seller to decide and negotiate between themselves. There does exist a second-hand market for vintage clothing and sneakers, in which Nitches OVS verified goods could be sold with ownership of the minted NFT authenticating the good being transferred to the buyer along with the transfer of the actual verified vintage good being purchased.\nWe do not anticipate the NFT having any value separate from the good it authenticates in that it is not likely to be bought or sold and only transferred with the sale of the good it verifies, however there will be no restrictions on the transfer of the NFT minted by the purchaser of the good. As Nitches will have zero custody over the minted NFT, these decisions will not be made by management but instead by consumers, and Nitches will not profit from or participate in the NFT in any way; the opportunity to mind the NFT is being provided by the Nitches through its Nitches OVS App solely to prohibit piracy of the goods sold by our Social Media Partners.\nManagement believes it is quite possible a NFT OVS verified good may sell for more on a secondary market than an unverified good but does not assert any particular expertise in how development of the metaverse and NFTs will go from here. It only asserts that we believe there is a need to verify the authenticity of purchase goods which the NFTs minted with the Nitches OVS App. Purchasers of NFTs including those minting NFTs with the Nitches OVS App should be advised that NFT are not a reliable store of value and that they may lose any and all money or other costs incurred in obtaining custody of an NFT.\nA second phase of our growth plan will be to consult for, partner with, or acquire our manufacturing vendors to rework their supply chains to qualify for certain Sustainable Manufacturing Certifications. We have not yet begun any partnerships with any manufacturers and so far only vendor-customer relationships with the manufacturers we have done business with.\nIn our business plan, the brands of our Social Media Partners that we white-labels products under are an entryway to strategic partnerships with global manufacturers of product ready to scale production to take advantage of the effects of our marketing campaigns. We will act as consultants - and financiers - to these manufacturers to scale their production in a sustainable supply and distribution chain. The demand for sustainable products will be driven by the follower base our Social Media Partners for whom it will be important because it is important to the social media influencers they are following and with whom we are partnering.\nManagement plans for the payments for such consultancies, will be in the form of revenue or profit-sharing arrangements with these manufacturers in order to give multiple streams of revenue, which management believes could be bundled and securitized once matured for later stage financing, which the Company could use to finance or acquire and scale those of these manufacturers that have shown growth and/or the most innovation in sustainability.\nWe could even use a portion of this bundled stream of income for cash giveaway sweepstakes run by our influencers with their follower base as product and cash giveaways is a proven effective means to increase social media engagement, which will attached more influencers to Nitches because they would then be able to use our giveaways to increase their followers while promoting our Nitches branded products.\nManagement believes this phase of our business plan will lead to residual streams of income from the financing we provide to our manufacturing partners. As these streams of income mature and become more credit-worthy, our plan is to bundle those streams of income - whose credit is bolstered by the marketing of our Nitches lifestyle influencers - to offer a corporate bond, the proceeds of which will be used to finance the expansion and creation of a totally sustainable supply chain and distribution chain for our global manufacturers. Because the use of funds would be used to scale sustainable carbon-neutral manufacturing, management believes such financing would qualify as for ESG (Environmental, Social, or Governance) financing. ESG investing is investing in companies that score highly on environmental and societal responsibility scales as determined by third-party, independent companies and research groups. ESG investing is investing in companies that score highly on environmental and societal responsibility scales as determined by third-party, independent companies and research groups. Management believes Nitches will score well on such scales by living our company ethos and vision -- as well as through the use of consultants expert in qualifying for ESG investing.\nA third phase will be when those influencers that meet certain analytics and sales thresholds begin to qualify for the Nitches Equity Incentive Plan for Social Media Influencers (Equity Incentive Plan), however we do not intend to begin the Equity Incentive Plan until after our planned growth with our manufacturing vendors and not have not yet set any thresholds or benchmarks for when equity would be granted and/or vested. Management does not believe it will be able to set any such benchmarks at least until the August 31, 2023 financials have been reported. For the Equity Incentive Program, we will use our publicly traded common stock for an Equity Incentive Plan for Social Media Influencers with the equity vesting based upon their achievement of certain social media analytics milestones based upon impressions and conversions when posting content showcasing our Nitches products.\nCompany Ethos, Vision is reflected in the Nitches Brand.\nOur business model is anchored in a long-term vision that builds on the heritage of our brands and stimulates creativity and excellence for the next generation of sustainable living. The success of the marketing of our products will be based on our company living this vision with its operations.\nThe Nitches Corporation, as a company committed to excellence, we believe that our integrity and ethics are the most important thing. Thats why we conduct ourselves with exemplary integrity and ethics in the conduct of our business and in our relations with all stakeholders.\nRules of conduct, principles and guidelines governing ethics and environmental and social responsibility have been defined to establish the behavior required of the Groups executives and employees, as well as our suppliers and partners. The Nitches Corporation Code of Conduct constitutes the cornerstone of our ethics and compliance policy.\nFIVE OPERATING KEYS TO NITCHES:\n1.Discovering Niche Overlooked Concepts & Businesses\n2.Collaborative Creative Verticals\n3.Advocating Sustainable Materials\n4.Global Manufacturing Partnerships\n5.Providing Experienced Fundamentals\nThese areas will be where the Company will be focusing its efforts moving forward. Notwithstanding, the three different areas of focus the Company will consolidate its financials into one statement and not report as different segments.\nIntellectual Property\nWe do not own any trademarks or patents; however, we have our own proprietary source code that we use in operating our app for our Apparel Ownership Verification System, which is called Nitches OVS.\nEmployees\nThe Companys only employee is its CEO, John Morgan, who is employed full-time. All other individuals who perform work for the company do so on a contract basis.\nAvailable Information and Reports to Security Holders\nWhen this Registration Statement becomes effective, we will begin to file reports, proxy statements, information statements, and other information with the SEC. Our SEC filings will also be available to the public from commercial document retrieval services and at the website maintained by the SEC at http://www.sec.gov.\nOur website address is http://www.nitchescorp.com. Information contained on the website does not constitute part of this Registration Statement. We have included our website address in this Registration Statement solely as an inactive textual reference. When this Registration Statement is effective, we will make available, through a link to the SECs website, electronic copies of the materials we file with the SEC, including annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, the Section 16 reports filed by our executive officers, directors and 10% stockholders and amendments to those reports. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company, as defined in Item 10(f)(1) of Regulation S-K, and therefore are not required to provide the information specified in Item 1A. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe do not own any significant property. We are currently working remotely.\nWe lease and maintain our primary offices at 1333 N. Buffalo Dr., Suite 210, Las Vegas, NV 89128, which is a shared/virtual office facility. ITEM 3. LEGAL PROCEEDINGS\nWe are not presently a party to any legal or regulatory proceedings that in the opinion of our management, if determined adversely to us, would individually or taken together have a material adverse effect on our business, results of operations and financial condition. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is traded on the Pink Tier of the OTC Markets Group under the symbol NICH.\nHolders of Record\nAs of August 31, 2023, there were 343,759,644 shares of Common Stock outstanding held by 82 holders of record.\nDividends\nThe Company does not expect to declare dividends for holders of Common Stock in the foreseeable future. Dividends will be declared, if at all (and subject to rights of holders of additional classes of securities, if any), in the discretion of the Companys Board of Directors. Dividends, if ever declared, may be paid in cash, in property, or in shares of the capital stock of the Company, subject to the provisions of law, the Companys Bylaws and the Certificate of Incorporation. Before payment of any dividend, there may be set aside out of any funds of the Company available for dividends such sums as the Board of Directors, in its absolute discretion, deems proper as a reserve for working capital, to meet contingencies, for equalizing dividends, for repairing or maintaining any property of the Company, or for such other purposes as the Board of Directors shall deem in the best interests of the Company.\nRecent Sales of Unregistered Securities\nOn March 9, 2023, the Company issued 200,000,000 shares of Common Stock to its CEO as partial compensation for services rendered.\nOn July 7, 2023, the Company issued 17,000,000 shares of Common Stock to an investor in satisfaction of $17,000 due and owing under a convertible promissory note.\nUse of Proceeds\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion and analysis of our financial condition and results of operations together with the section entitled Selected Financial Data and our financial statements and related notes included elsewhere in this Registration Statement. Some of the information contained in this discussion and analysis or set forth elsewhere in this Registration Statement, including information with respect to our plans and strategy for our business and related financing, includes forward-looking statements that involve risks and uncertainties. See Cautionary Note Regarding Forward-Looking Statements. Our actual results may differ materially from those described below.\nWe define our accounting periods as follows: Fiscal 2023 - September 1, 2022 through August 31, 2023.\nThis Managements Discussion and Analysis (MD&A) reports on the operating results and financial condition of the Company for the years ended August 31, 2023 and August 31, 2022. The MD&A should be read in conjunction with the Companys audited consolidated financial statements for the year ended August 31, 2023 (Annual Financial Statements).\nThe MD&A and Annual Financial Statements have been prepared in accordance with general accepted principles in the United States of America (GAAP).\nAll significant intercompany balances and transactions were eliminated on consolidation.\nCompany History and Summary\nNitches Inc is a diversified company that specializes in creating merchandise, manufacturing high end luxury brands, goods and collectibles for influencers and celebrities. Nitches is focused on sports clothing, athleisure brands, sustainable products, NFTs and technology. We are also taking tremendous steps to protect Nitches and our clients intellectual property by innovating technology to help prevent counterfeiting. In addition to the merchandise and manufacturing, Nitches is partnering with brands that are innovating outside of the box. Our business model is anchored in a long-term vision that builds on the heritage of our brands and stimulates creativity and excellence. Nitches empowers brands, celebrities and influencers with customized merchandise to increase their bottom line from their notoriety and social fame in this social age.\nThe Company was founded originally as a California corporation as a wholesale importer and distributor of clothing, home décor and tabletop products manufactured to our specifications and distributed in the United States under our brand labels and retailer-owned private labels. The Company moved jurisdiction to Nevada in 2008.\nOn November 5, 2020, International Ventures Society, LLC, a Nevada limited liability company, was appointed custodian of the Company pursuant to an Order of District Court of Clark County, Nevada. On November 6, the Company adopted amended Articles of Incorporation, which created the 2020 Series A Preferred Stock, with one share authorized. This one share effectively controls the Company by representing no less than 60% of all combined votes of Common and Preferred Stock at any time, and was issued to International Ventures Society LLC on the same day.\nOn December 16, 2020, International Ventures Society, LLC sold the one outstanding share of 2020 Series A Preferred Stock to Accelerate Global Market Solutions, Inc., a change of control transactions that resulted in John Morgan becoming CEO. This share of 2020 Series A Preferred Stock was converted into 100,000,000 shares of Common Stock on November 4, 2021.\nSince February 2022, the Company has announced the completion and launch of its Nitches OVS mobile app, which can be used to prove ownership of the Companys luxury products, apparel and streetwear clothing items, as well as clothing collections in collaboration with legendary football coach Steve Calhoun; superstar vocal coach Nick Cooper; vegan influencer John Lewis; and world-famous artist Voodoo Fe with a collection to honor the legendary Miles Davis. In addition, the Company has announced an NFT campaign to focus on inclusivity and the development of its own exclusive clothing line to promote mental well- being.\nOn April 5, 2022, the Company executed amended loan notes which, in each case, changed the conversion terms from $0.00001 per share to a 50% discount to the lowest market price experienced in the 20 trading days prior to conversion.\nOn July 21, 2022, the Company announced it had repaid all outstanding loan notes and convertible loan notes, leaving the Company completely debt-free. To the end of August 2022, the Company continued to work on development and promotion of its clothing ranges.\nOn November 25, 2022, the Company announced that it had ceased its involvement in the Metaverse project to focus on selling merchandise in the short term.\nOn March 22, 2023, the Company announced an expansion into the liquor industry with the launch of lifestyle of spirits, focused on the launch of an exclusive premium aged whiskey under the ‘Tover brand name. In furtherance of this expansion, the Company entered into a beverage brand developer agreement with Brenton Foster in March 2023.\nOn May 18, 2023, the Company announced two new initiatives: a collaboration with the Association of Luxury Suite Directors (‘ALSD) as an exclusive vendor, providing premium staff clothing for the 2023 ALSD Conference and Tradeshow on July 9-11 at JW Marriott Indianapolis. Secondly, the Company is in talks with an unnamed Major League Baseball team to expand custom clothing options for their premium fans.\nComparison of Year Ended August 31, 2023 to Year Ended August 31, 2022\nResults of Operations\nYear ended August 31,\nPercent\nChange\nChange\nRevenues\n$\n4,224\n$\n$\n3,514\n495%\nGross profit\n(17,130)\n(4,369)\n12,761\n292%\nOperating expenses\n426,070\n833,743\n(407,673)\n(49%)\nOther income (expense)\n(383,818)\n4,248\n(388,066)\n(9.135%)\nNet loss\n$\n(827,018)\n$\n(834,134)\n$\n7,116\n(1%)\nNet revenues for the year ended August 31, 2023 were $4,224, as compared to $710 for the year ended August 31, 2022, due to the launch of our Miles Davis clothing line.\nGross profits for the year ended August 31, 2023 were $(17,130), as compared to $(4,369) for the year ended August 31, 2022.\nTotal operating expenses were $426,070 for the year ended August 31, 2023, compared to $833,743 for the year ended August 31, 2022. The change is primarily derived from a decrease in selling, general, and administrative expenses of $420,811 in 2023, as compared to $832,183 in 2022.\nOther income (expense) was $(383,818) for the year ended August 31, 2023 compared to $4,248 for the year ended August 31, 2022. The $388,066 decrease was primarily $128,090 in amortization of debt discount and derivative expenses associated with embedded liabilities in convertible debt, $222,277 in change in fair market value of derivatives, and $457,801 increase in interest expenses associated with borrowings.\nFor the year ended August 31, 2023, the Company reported a net loss of $(827,018) as compared to a net loss of $(834,134) for the year ended August 31, 2022.\nLiquidity and Capital Resources\nAs of August 31, 2023, the Company had $344 in cash to fund its operations. The Company reported working capital deficit of $(391,316) on August 31, 2023, as compared to a working capital of $167,942 at August 31, 2022, representing an increase in working capital deficit of $559,258.\nThe Company does not believe its current cash balance will be sufficient to allow the Company to fund its planned operating activities for the next twelve months. The ability of the Company to continue as a going concern is dependent on the Company obtaining adequate capital to fund operating losses until it becomes profitable. If the Company is unable to obtain adequate capital, it could be forced to cease operations or substantially curtail some of its planned activities. These conditions raise substantial doubt as to the Companys ability to continue as a going concern. The accompanying financial statements do not include any adjustments relating to the recoverability and classification of recorded assets and classification of liabilities should the Company be unable to continue as a going concern.\nAs the Company continues to incur losses, achieving profitability is dependent on achieving a level of revenues adequate to support the Companys cost structure. The Company may never achieve profitability, and unless and until it does, the Company will continue to need to raise additional capital. Management intends to fund future operations through additional private or public equity offerings and may seek additional capital through arrangements with strategic partners from other sources. There can be no assurances, however, that additional funding will be available on terms acceptable to the Company, or at all. Any equity financing may be dilutive to existing shareholders.\nOperating Activities:\nFor the year ended August 31, 2023, net cash flow used by operating activities was $462,901, compared to $482,951 for the year ended August 31, 2022.\nFinancing Activities:\nNet cash flows provided by financing activities for the year ended August 31, 2023, were $416,353, of which $287,000 was from sales of common stock shares and $158,521 in proceeds from borrowings, compared to $570,038 for the year ended August 31, 2022.\nLiquidity and Capital Resource Measures:\nThe Companys primary source of liquidity has been convertible loans and third party and related party loans.\nGoing Concern\nThe Company has experienced a net loss and had an accumulated deficit of $30,924,986 as of August 31, 2023. The success of our business plan during the next 12 months and beyond will be contingent upon generating sufficient revenue to cover our costs of operations and/or upon obtaining additional financing.\nTransaction with Related Parties:\nNone\nCritical Accounting Policies\nRefer to Note 2 in the Consolidated Financial Statements for a summary of recently adopted and recently issued accounting standards and their related effects or anticipated effects on our consolidated results of operations and financial condition.\nOff-Balance Sheet Arrangements\nWe did not have any off-balance sheet arrangements that are reasonably likely to have a current or future material effect on our financial condition, revenue or expenses, results of operations, liquidity, capital expenditures, or capital resources.\nInflation and Changing Prices\nWe do not believe that inflation nor changing prices for the year ended August 31, 2023 had a material effect on our operations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company, as defined in Item 10(f)(1) of Regulation S-K, and therefore are not required to provide the information specified in Item 7A. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nNITCHES, INC.\nANNUAL REPORT\nFOR THE YEAR ENDING AUGUST 31, 2023 and 2022\nIndex to the Financial Statements\nReport of Independent Registered Public Accounting Firm\nConsolidated Audited Balance Sheet as at August 31, 2023 and 2022\nConsolidated Audited Statement of Operations for the Year Ending August 31, 2023 and 2022\nAudited Statement of Changes in Stockholders Equity for the Year Ending August 31, 2023 and 2022\nConsolidated Audited Statement of Cash Flow for the Year Ending August 31, 2023 and 2022\nNotes to the Consolidated Audited Financial Statements\nReport of the Independent Registered Public Accounting Firm\nThe Board of Directors and Stockholders of\nNitches, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Nitches, Inc (the ‘Company) as of August 31, 2023, and 2022, and the related consolidated statements of operations, changes in stockholders equity and cash flows for the year ended August 31, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023, and 2022, and the results of its operations and its cash flows for the year ended August 31, 2023, in conformity with accounting principles\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3, the Company suffered an accumulated deficit of $(30,924,986), net loss of $827,018 and a negative working capital of $391,316. These matters raise substantial doubt about the Companys ability to continue as a going concern. Managements plans with regards to these matters are also described in Note 3 to the financial statements. These financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis of Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. Communication of critical audit matters does not alter in any way our opinion on the financial statements taken as a whole and we are not, by communicating the critical audit matters, providing separate opinions on the critical audit matter or on the accounts or disclosures to which they relate. As of August 31, 2023, we do not have any critical audit matters to communicate.\n/s/ OLAYINKA OYEBOLA & CO.\nOLAYINKA OYEBOLA & CO.\nPCAOB#: 5968\nLagos Nigeria\nNITCHES, INC.\nConsolidated Audited Financial Statements\nBalance Sheet\nNotes\nAs at\nAugust 31,\nAs at\nAugust 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$\n$\n71,392\nDeposits & prepayments\n8,500\nInventory\n135,030\n130,550\nTotal Current Assets\n143,874\n201,942\nFixed assets\nProperty, plant & equipment\n8,649\n8,649\nAccumulated depreciation\n(3,599)\n(720)\nSoftware\n11,900\n8,400\nOther intangible assets\n21,000\n-\nAccumulated amortization\n(3,220)\n(840)\nTOTAL ASSETS\n$\n178,604\n$\n217,431\nLIABILITIES & STOCKHOLDERS EQUITY\nCurrent Liabilities\nAccrued expenses\n$\n10,020\n$\n22,000\nLoans & notes payable, short-term or current,\nnet of unamortized debt discount of $22,355\n137,610\n-\nRelated party loans & notes payable, short-term or current\n3,036\n12,000\nDerivative liability\n384,524\n-\nTOTAL LIABILITIES\n535,190\n34,000\nSTOCKHOLDERS EQUITY (DEFICIT)\nPreferred stock Series A: par value $0.001, 1 authorized\nand 1 issued and outstanding at August 31, 2023 and\nAugust 31, 2022\n-\n-\nCommon stock: par value $0.001, 750,000,000 and 300,000,000\nauthorized and 343,759,644 and 56,759,644 issued and\noutstanding at August 31, 2023 and August 31, 2022, respectively\n343,759\n56,759\nAdditional Paid-In-Capital\n30,224,641\n30,224,641\nAccumulated Deficit\n(30,924,986)\n(30,097,969)\nTOTAL STOCKHOLDERS EQUITY (DEFICIT)\n(356,586)\n183,431\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\n$\n178,604\n$\n217,431\nSee accompanying notes to these consolidated audited financial statements.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nStatement Of Operations\nFor the Year Ended\nAugust 31,\nRevenues\n$\n4,224\n$\nCost of goods sold\n21,354\n5,349\nGross profit\n(10,337)\n4,237\nOperating expenses\nSelling, general & administrative expenses\n420,811\n832,183\nDepreciation & amortization\n5,259\n1,560\nTotal operating expenses\n426,070\n833,743\nLoss from operations\n(443,200)\n(838,382)\nOther income (expenses)\nFinancing costs\n(1,555)\n(1,807)\nLoan interest accrued\n(18,649)\n6,055\nNon-cash interest, convertible loan\n(457,801)\n-\nAmortization of debt discount\n(128,090)\n-\nGain (loss) on revaluation of derivative liability\n222,277\n-\nLoss before income taxes\n$\n(827,018)\n$\n(834,134)\nProvision for income taxes\n-\n-\nNet loss\n$\n(827,018)\n$\n(834,134)\nNet loss per share\n$\n(0.00)\n$\n(0.01)\nWeighted average shares outstanding\n194,592,977\n136,709,644\nSee accompanying notes to these consolidated audited financial statements.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nStatement of Changes in Stockholders Equity\nPreferred Stock\nCommon Stock\nShares\nValue\nShares\nValue\nAdditional\nPaid-In-\nCapital\nAccumulated\nSurplus (Deficit)\nTotal\nBalance, September 1, 2021\n-\n$\n-\n105,659,644\n$\n105,659\n$\n28,954,341\n$\n(29,247,001)\n$\n(187,001)\nPreferred stock issued in\nexchange for common stock\n-\n-\n-\n-\n-\n-\nCommon stock issued on\nconversion of preferred stock\n-\n-\n100,000,000\n100,000\n-\n-\n100,000\nCommon stock issued\nfor services\n-\n14,000,000\n14,000\n406,000\n-\n420,000\nCommon stock issued\nfor investment\n-\n(162,900,000)\n(162,900)\n864,300\n-\n701,400\nNet loss, year ending\nAugust 31, 2022\n-\n-\n-\n-\n-\n(850,968)\n(850,968)\nBalance, September 1, 2022\n-\n56,759,644\n56,759\n30,224,641\n(30,097,969)\n183,431\nCommon stock issued\nfor services\n-\n200,000,000\n200,000\n-\n-\n200,000\nCommon stock issued\nfor investment\n-\n87,000,000\n87,000\n-\n-\n87,000\nNet loss, year ended\nAugust 31, 2023\n-\n-\n-\n-\n-\n(827,018)\n(827,018)\nBalance, August 31, 2023\n$\n-\n343,759,644\n$\n343,759\n$\n30,224,641\n$\n(30,924,986)\n$\n(356,586)\nSee accompanying notes to these consolidated audited financial statements.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nStatement of Cash Flows\nYear Ended\nAugust 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$\n(827,018)\n$\n(850,968)\nAdjustments to reconcile net loss to net cash (used in) operating activities:\nStock issued for services\n-\n520,000\nDepreciation and amortization\n5,259\n1,560\nAmortization of debt discount\n128,090\n-\n(Gain) loss on revaluation of derivative liability\n(222,277)\n-\nNon-cash interest, convertible loan\n476,450\n-\nFinancing costs\n1,555\n1,807\nChanges in operating assets and liabilities:\nOther current assets\n(8,500)\n-\nInventory\n(4,480)\n(130,550)\nAccounts payable and other current liabilities\n(11,980)\n(24,800)\nNET CASH (USED IN) OPERATING ACTIVITIES\n(462,901)\n(482,951)\nCASH FLOWS FROM INVESTING ACTIVITIES\nSale (purchase) of tangible assets\n-\n(8,400)\nSale (purchase) of intangible assets\n(24,500)\n(8,649)\nNET CASH PROVIDED BY (USED IN) INVESTING ACTIVITIES\n(24,500)\n(17,049)\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from issuance of equity\n287,000\n701,400\nProceeds from (repayment of) debt instruments\n158,521\n(141,555)\nRelated party loans\n(8,964)\n12,000\nFinancing costs\n(20,204)\n(1,807)\nNET CASH PROVIDED BY FINANCING ACTIVITIES\n416,353\n570,038\nNET INCREASE (DECREASE) IN CASH\n(71,048)\n70,038\nCash, beginning of year\n71,392\n1,354\nCash, end of year\n$\n$\n71,392\nSUPPLEMENTAL DISCLOSURES\nSupplemental schedules of non-cash investing and financing activities\nInterest paid\n$\n-\n$\n16,834\nSee accompanying notes to these consolidated audited financial statements.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nNOTE 1. NATURE AND BACKGROUND OF BUSINESS\nThe accompanying consolidated audited financial statements include Nitches, Inc. (‘NICH or the Company), a Nevada corporation, its wholly-owned subsidiaries and any majority controlled interests.\nNitches Inc is a diversified company that specializes in creating merchandise, manufacturing high end luxury brands, goods and collectibles for influencers and celebrities. Nitches is focused on sports clothing, athleisure brands, sustainable products, NFTs and technology. We are also taking tremendous steps to protect Nitches and our clients intellectual property by innovating technology to help prevent counterfeiting. In addition to the merchandise and manufacturing, Nitches is partnering with brands that are innovating outside of the box. Our business model is anchored in a long-term vision that builds on the heritage of our brands and stimulates creativity and excellence. Nitches empowers brands, celebrities and influencers with customized merchandise to increase their bottom line from their notoriety and social fame in this social age.\nThe Company was founded originally as a California corporation as a wholesale importer and distributor of clothing, home décor and tabletop products manufactured to our specifications and distributed in the United States under our brand labels and retailer-owned private labels. The Company moved jurisdiction to Nevada in 2008.\nOn November 5, 2020, International Ventures Society, LLC, a Nevada limited liability company, was appointed custodian of the Company pursuant to an Order of District Court of Clark County, Nevada. On November 6, the Company adopted amended Articles of Incorporation, which created the 2020 Series A Preferred Stock, with one share authorized. This one share effectively controls the Company by representing no less than 60% of all combined votes of Common and Preferred Stock at any time, and was issued to International Ventures Society LLC on the same day.\nOn December 16, 2020, International Ventures Society, LLC sold the one outstanding share of 2020 Series A Preferred Stock to Accelerate Global Market Solutions, Inc., a change of control transactions that resulted in John Morgan becoming CEO. This share of 2020 Series A Preferred Stock was converted into 100,000,000 shares of Common Stock on November 4, 2021.\nSince February 2022, the Company has announced the completion and launch of its Nitches OVS mobile app, which can be used to prove ownership of the Companys luxury products, apparel and streetwear clothing items, as well as clothing collections in collaboration with legendary football coach Steve Calhoun; superstar vocal coach Nick Cooper; vegan influencer John Lewis; and world-famous artist Voodoo Fe with a collection to honor the legendary Miles Davis. In addition, the Company has announced an NFT campaign to focus on inclusivity and the development of its own exclusive clothing line to promote mental well- being.\nOn April 5, 2022, the Company executed amended loan notes which, in each case, changed the conversion terms from $0.00001 per share to a 50% discount to the lowest market price experienced in the 20 trading days prior to conversion.\nOn July 21, 2022, the Company announced it had repaid all outstanding loan notes and convertible loan notes, leaving the Company completely debt-free.\nTo the end of August 2022, the Company continued to work on development and promotion of its clothing ranges.\nOn November 25, 2022, the Company announced that it had ceased its involvement in the Metaverse project to focus on selling merchandise in the short term.\nOn March 22, 2023, the Company announced an expansion into the liquor industry with the launch of lifestyle of spirits, focused on the launch of an exclusive premium aged whiskey under the ‘Tover brand name.\nOn May 18, 2023, the Company announced two new initiatives: a collaboration with the Association of Luxury Suite Directors (‘ALSD) as an exclusive vendor, providing premium staff clothing for the 2023 ALSD Conference and Tradeshow on July 9-11 at JW Marriott Indianapolis. Secondly, the Company is in talks with an unnamed Major League Baseball team to expand custom clothing options for their premium fans.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements have been prepared for Nitches, Inc. in accordance with accounting principles generally accepted in the United States of America (US GAAP), with all numbers shown in US Dollars.\nIn the opinion of management, all adjustments (consisting of normal recurring accruals) considered necessary for fair presentation of the financial statements have been included. The financial statements include acquired subsidiaries, as discussed below, and include all consolidation entries required to include those subsidiaries.\nRevenue Recognition\nThe Company recognizes revenue under the Financial Accounting Standards Boards Topic 606, Revenue from Contracts with Customers (‘Topic 606). Topic 606 has established a five-step process to determine the amount of revenue to record from contracts with customers. The five steps are:\n·Determine if we have a contract with a customer;\n·Determine the performance obligations in that contract;\n·Determine the transaction price;\n·Allocate the transaction price to the performance obligations; and\n·Determine when to recognize revenue.\nOur revenues are generally earned under formal contracts with our customers and are derived from sales of branded clothing products to customers. Our contracts do not include the possibility for additional contingent consideration so that our determination of the contract price does not involve having to consider potential additional variable consideration.\nFor arrangements with multiple performance obligations (eg. multiple deliveries), we recognize product revenue by allocating the transaction revenue to each performance obligation based on the relative fair value of each deliverable and recognize revenue when performance obligations are met including when product is delivered. Our contracts sometimes require customer payments in advance of revenue recognition. These are recognized as revenue when the Company has fulfilled its obligations under the respective contracts. Until such time, we recognize this prepayment as deferred revenue.\nContracts in progress are included in revenue recognition as unbilled revenues until delivery is made and billing occurs.\nOn a quarterly basis, we examine all of our fixed-price contracts to determine if there are any losses to be recognized during the period. Any such loss is recorded in the quarter in which the loss first becomes apparent based upon costs incurred to date and the estimated costs to complete as determined by experience from similar contracts. Variations from estimated contract performance could result in adjustments to operating results.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nFor the Balance Sheet and Statement of Cash Flows, all highly liquid investments with maturity of three months or less are considered to be cash equivalents. The Company had no cash equivalents as at August 31, 2023 or August 31, 2022.\nAccounts Receivable\nAccounts receivable are shown net of any allowance for doubtful accounts, determined as such when management has made a decision that an account is not collectible. As at August 31, 2023, the allowance for doubtful or non-collectible accounts receivable was nil.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nInventory\nInventory is stated at the lower of cost (First in, First Out method) or net realizable value. As at August 31, 2023, inventory was held according to the following breakdown:\nAugust 31, 2023\nRaw materials\n$\n-\nWork in progress\n-\nFinished goods\n135,030\nTotal\n$\n135,030\nDepreciation and Amortization\nDepreciation is applied to all tangible fixed assets in accordance with the useful life of the type of asset, using the straight line method, for the following types of assets:\n·Land and buildings - 40 years\n·Plant and equipment - 3 years\n·Motor vehicles - 3 years\n·Leasehold improvements - based on the length of the lease\nAmortization is applied to non-tangible assets in accordance with the useful life of the type of asset, using the straight line method, for the following types of assets:\n·Software - 5 years\nGoodwill is not amortized but is tested for impairment at the end of each financial year to assess the carrying value. If the carrying value is higher than the asset balance, then no impairment is charged to amortization. If the carrying value is lower than the asset balance then an impairment charge is made to amortization for the difference between the values.\nIncome Taxes\nIncome taxes are provided in accordance with the FASB Accounting Standards (ASC 740), Accounting for Income Tax. A deferred tax asset or liability is recorded for all temporary differences between financial and tax reporting and net operating loss carry forwards. Any deferred tax expense (benefit) resulting from the net change during the year is shown as deferred tax assets and liabilities. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it was more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nBasic and Diluted Net Income (Loss) Per Share\nNet income (loss) per unit is calculated in accordance with Codification topic 260, Earnings per Share for the periods presented. Basic net loss per share is computed using the weighted average number of common shares outstanding. Diluted loss per share has not been presented because the shares of common stock equivalents have not been included in the per share calculations as such inclusion would be anti-dilutive. Diluted earnings per share is based on the assumption that all dilutive stock options, warrants and convertible debt are converted or exercised applying the treasury stock method. Under this method, options, warrants and convertible debt are assumed exercised at the beginning of the period (or at the time of issuance, if later), and as if funds obtained thereby were used to purchase shares of common stock at the average market price during the period. Options, warrants and/or convertible debt will have a dilutive effect during periods of net profit only when the average market price of the units during the period exceeds the exercise or conversion price of the items.\nStock Based Compensation\nCodification topic 718 Stock Compensation requires that the cost resulting from all share-based transactions be recorded in the financial statements and establishes fair value as the measurement objective for share-based payment transactions with employees and acquired goods or services from non-employees. The codification also provides guidance on valuing and expensing these awards, as well as disclosure requirements of these equity arrangements. The Company adopted the codification upon creation of the Company and will expense share-based costs in the period\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nincurred. The Company has not yet adopted a stock option plan and all share-based transactions and share based compensation has been expensed in accordance with the codification guidance.\nConvertible Instruments\nThe Company evaluates and accounts for conversion options embedded in its convertible instruments in accordance with professional standards for Accounting for Derivative Instruments and Hedging Activities. Professional standards generally provide three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free standing derivative financial instruments. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instruments are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur, and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument. Professional standards also provide an exception to this rule when the host instrument is deemed to be conventional as defined under professional standards as The Meaning of Conventional Convertible Debt Instrument.\nThe Company accounts for convertible instruments when it has determined that the embedded conversion options should not be bifurcated from their host instruments in accordance with professional standards when Accounting for Convertible Securities with Beneficial Conversion Features, as those professional standards pertain to Certain Convertible Instruments. Accordingly, the Company records, when necessary, discounts to convertible notes for the intrinsic value of conversion options embedded in debt instruments based upon the differences between the fair value of the underlying shares of common stock at the commitment date of the note transaction and the effective conversion price embedded in the note. Debt discounts under these arrangements are amortized over the term of the related debt to their earliest date of redemption. The Company also records when necessary deemed dividends for the intrinsic value of conversion options embedded in preferred shares of common stock based upon the differences between the fair value of the underlying shares at the commitment date of the note transaction and the effective conversion price embedded in the note.\nASC 815-40 provides that, among other things, generally, if an event not within the entitys control could require net cash settlement, then the contract shall be classified as an asset or a liability.\nFair Value of Financial Instruments\nWe adopted the guidance of ASC-820 for fair value instruments, which clarifies the definition of fair value, prescribes methods for determining fair value, and establishes a fair value hierarchy to classify the inputs used in measuring fair value, as follows:\nLevel 1 - Inputs are unadjusted quoted prices in active markets for identical assets or liabilities available at the measurement date.\nLevel 2 - Inputs are quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets and liabilities in markets that are not active, inputs other than quoted prices that are observable, and inputs derived from or corroborated by observable market data.\nLevel 3 - Inputs are unobservable inputs which reflect the reporting entitys own assumptions on what assumptions the market participants would use in pricing the asset or liability based on the best available information.\nThe carrying amounts for cash, accounts receivable, accounts payable and accrued expenses, and loans payable approximate their fair value based on the short- term maturity of these instruments. We did not identify any assets or liabilities that are required to be presented on the balance sheet at fair value in accordance with the accounting guidance as at August 31, 2023 but we did identify such assets or liabilities as at August 31, 2022, as detailed in Note 9, Derivative Liabilities.\nASC 825-10 Financial Instruments allows entities to voluntarily choose to measure certain financial assets and liabilities at fair value (fair value option). The fair value option may be elected on an instrument-by-instrument basis and is irrevocable, unless a new election date occurs. If the fair value option is elected for an instrument, unrealized\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\ngains and losses for that instrument should be reported in earnings at each subsequent reporting date. We did not elect to apply the fair value option to any outstanding instruments.\nDerivative Liabilities\nDerivative financial instruments consist of convertible instruments and rights to shares of the Companys common stock. The Company assessed that it had no derivative liabilities as at August 31, 2023 and derivative liabilities as at August 31, 2022, as detailed in Note 9, Derivative Liabilities.\nASC 815 generally provides three criteria that, if met, require companies to bifurcate conversion options from their host instruments and account for them as free standing derivative financial instruments. These three criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument subject to the requirement of ASC 815. ASC 815 also provides an exception to this rule when the host instrument is deemed to be conventional, as described.\nImpact of New Accounting Standards\nThe Company does not expect the adoption of recently issued accounting pronouncements to have a significant impact on the Companys results of operations, financial position, or cash flow.\nNOTE 3. GOING CONCERN\nThe Companys financial statements are prepared in accordance with generally accepted accounting principles applicable to a going concern. This contemplates the realization of assets and the liquidation of liabilities in the normal course of business. Realization values may be substantially different from carrying values as shown and these financial statements do not give effect to adjustments that would be necessary to the carrying values and classification of assets and liabilities should the Company be unable to continue as a going concern. Currently, the Company does not have significant cash or other material assets, nor does it have operations or a source of revenue sufficient to cover its operation costs and allow it to continue as a going concern.\nThe Company has a limited operating history and had a cumulative net loss from inception to August 31, 2023 of $30,924,986. The Company has a working capital deficit of $391,316 as at August 31, 2023.\nThese financial statements for the year ending August 31, 2023 have been prepared assuming the Company will continue as a going concern, which is dependent upon the Companys ability to generate future profits and/or obtain necessary financing to meet its obligations as they come due.\nThe management has committed to an aggressive growth plan for the Company. The Companys future operations are dependent upon external funding and its ability to execute its business plan, realize sales and control expenses. Management believes that sufficient funding will be available from additional borrowings and private placements to meet its business objectives including anticipated cash needs for working capital, for a reasonable period of time. However, there can be no assurance that the Company will be able to obtain sufficient funds to continue the development of its business operation, or if obtained, upon terms favorable to the Company.\nNOTE 4. OTHER CURRENT ASSETS\nThe Company had other current assets at August 31, 2023 and August 31, 2022 as follows:\nAugust 31, 2023\nAugust 31, 2022\nPrepaid salary CEO\n$\n8,500\n$\n-\nTotal\n$\n8,500\n$\n-\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nNOTE 5. FIXED ASSETS\nThe Company holds fixed assets with values at August 31, 2023 and August 31, 2022 as follows:\nAsset\nUseful Life\n(years)\nAugust 31,\nAugust 31,\nProperty and equipment\n$\n8,649\n$\n8,649\nAccumulated depreciation\n(3,599)\n(720)\nTotal\n$\n5,050\n$\n7,929\nDuring the year ended August 31, 2023, a total of $2,879 was charged to the Statement of Operations for depreciation.\nNOTE 6. INTANGIBLE ASSETS\nThe Company owned the following intangible assets as at August 31, 2023 and August 31, 2022:\nAsset\nAugust 31, 2023\nAugust 31, 2022\nNitches software app development\n$\n11,900\n$\n8,400\nTover Whiskey brand development\n21,000\n-\nAccumulated depreciation\n(3,220)\n(840)\nTotal\n$\n29,680\n$\n7,560\nDuring the year ended August 31, 2023, a total of $2,380 was charged to the Statement of Operations for amortization.\nNOTE 7. LOANS AND NOTES PAYABLE\nThe Company had loans and notes payable as at August 31, 2023 and August 31, 2022 totaling $158,371 and nil respectively, as follows:\nDescription\nPrincipal\nAmount\nDate of\nLoan Note\nMaturity\nDate\nAugust 31,\nAugust 31,\nConvertible loan note from World Market Ventures for 12 months, interest rate of 9%, convertible at 50% disc. to lowest price in past 30 days\n27,500\n10/19/2022\n7/19/2023\n29,740\n-\nConvertible loan note from CC Strategic Enterprises LLC for 12 months, interest rate of 9%, convertible at 50% disc. to lowest price in past 30 days\n27,500\n10/19/2022\n7/19/2023\n29,740\n-\nConvertible loan note from World Market Ventures for 12 months at interest rate of 12%, convertible at 50% disc. to lowest price in past 30 days\n22,000\n12/21/2022\n9/21/2023\n23,830\n-\nConvertible loan note from John Morgan for 12 months at interest rate of 12%, convertible at $0.0001 per share\n50,000\n3/9/2023\n9/5/2023\n52,877\n-\nConvertible loan note from World Market Ventures for 12 months at interest rate of 9%, convertible at 50% disc. to bid price on day before conversion - see note 6\n22,000\n7/282023\n4/28/2024\n22,184\n-\nTotal\n$\n158,371\n$\n-\nLong-term total\n$\n-\n$\n-\nShort-term total\n$\n158,371\n$\n-\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nLoans and Notes Amortization\nAmount Due\nDue within 12 months\n$\n158,371\nDue within 24 months\n-\nDue within 36 months\n-\nDue within 48 months\n-\nDue after 48 months\n-\nTotal\n$\n158,371\nNOTE 8. CAPITAL STOCK\nThe Company is a Nevada corporation with shares of preferred and common stock authorized and issued. As at August 31, 2023 and August 31, 2022, the Company was authorized to issue Preferred Stock and Common Stock as detailed below.\nPreferred Stock\nAt August 31, 2023 the Company had authorized Preferred Stock in one designation totaling 1 share:\nPreferred Stock Series A\nThe Company is authorized to issue 1 share of Series A, with a par value of $0.001 per share. As at September 1, 2020, the Company had no shares of Series A preferred stock issued and outstanding.\nOn November 6, 2020, the Company adopted amended Articles of Incorporation, which created the 2020 Series A Preferred Stock, with one share authorized with a par value of $0.001. This one share effectively controls the Company by representing no less than 60% of all combined votes of Common and Preferred Stock at any time. This one share is also convertible into 100,000,000 shares of common stock at any time.\nOn November 6, 2020, in accordance with a Court Order, the Company issued the one authorized share of 2020 Series A Preferred Stock to its legally appointed Custodian, International Ventures Society, LLC.\nOn December 16, 2020, International Venture Society, LLC sold the one share of issued and outstanding 2020 Series A Preferred Stock to Accelerate Global Market Solutions for a total of $55,000, resulting in a change of control.\nOn November 4, 2021, the holder of the one share of issued and outstanding 2020 Series A Preferred Stock converted this share into 100,000,000 shares of Common Stock.\nIn March 2022, the Company agreed that it would issue 1 share of Series A Preferred Stock to John Morgan in exchange for the cancellation of 175,000,000 shares of Common Stock. Those shares were cancelled on March 31, 2022. In fulfillment of this agreement, one share of Series A Preferred Stock was issued to John Morgan on January 23, 2023.\nAt August 31, 2023 the Company had 1 share of Preferred Stock Series A issued and outstanding.\nAs at August 31, 2023, the Company had 1 share of Preferred Stock issued and outstanding.\nCommon Stock\nAs at May 31, 2023, the Company is authorized to issue up to 750,000,000 shares of Common Stock with par value $0.001.\nAs at September 1, 2021, the Company had 105,659,644 shares of Common Stock issued and outstanding.\nOn August 3, 2021, the Company issued 100,000,000 shares of Common Stock to an officer for services of $14,000,000, or $0.14 per share.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nOn October 12, 2021, the Company issued 1,000,000 shares of Common Stock to an investor for investment of $30,000, or $0.03 per share.\nOn October 12, 2021, the Company issued 9,000,000 shares of Common Stock to an officer for services of $270,000, or $0.03 per share.\nOn November 4, 2021, the Company issued 1,000,000 shares of Common Stock to an investor for investment of $30,000, or $0.03 per share.\nOn November 4, 2021, the Company issued 100,000,000 shares of Common Stock to an investor for preferred stock conversion of $100,000, or $0.001 per share.\nOn November 4, 2021, the Company issued 5,000,000 shares of Common Stock to an officer for services of $150,000, or $0.03 per share.\nOn December 14, 2021, the Company issued 2,000,000 shares of Common Stock to an investor for investment of $60,000, or $0.03 per share.\nOn January 7, 2022, the Company issued 2,000,000 shares of Common Stock to an investor for investment of $60,000, or $0.03 per share.\nOn March 9, 2022, the Company issued 2,000,000 shares of Common Stock to an investor for investment of $60,000, or $0.03 per share.\nOn March 18, 2022, the Company issued 1,000,000 shares of Common Stock to an investor for investment of $30,000, or $0.03 per share.\nOn March 31, 2022, the Company bought back and canceled 189,000,000 shares of Common Stock from various shareholders.\nOn April 11, 2022, the Company issued 2,500,000 shares of Common Stock to an investor for investment of $75,000, or $0.03 per share.\nOn April 11, 2022, the Company issued 1,000,000 shares of Common Stock to an investor for investment of $30,000, or $0.03 per share.\nOn May 9, 2022, the Company issued 2,100,000 shares of Common Stock to an investor for investment of $50,400, or $0.024 per share.\nOn June 7, 2022, the Company issued 4,500,000 shares of Common Stock to an investor for investment of $108,000, or $0.024 per share.\nOn July 15, 2022, the Company issued 1,000,000 shares of Common Stock to an investor for investment of $24,000, or $0.024 per share.\nOn July 19, 2022, the Company issued 3,000,000 shares of Common Stock to an investor for investment of $72,000, or $0.024 per share.\nOn July 25, 2022, the Company issued 3,000,000 shares of Common Stock to an investor for investment of $72,000, or $0.024 per share.\nOn March 9, 2023, the Company issued 200,000,000 shares of Common Stock to a consultant for services of $200,000, or $0.001 per share.\nOn March 14, 2023, the Company issued 13,000,000 shares of Common Stock to an investor for investment of $13,000, or $0.001 per share.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nOn March 27, 2023, the Company issued 12,000,000 shares of Common Stock to an investor for investment of $12,000, or $0.001 per share.\nOn April 3, 2023, the Company issued 14,000,000 shares of Common Stock to an investor for investment of $14,000, or $0.001 per share.\nOn May 5, 2023, the Company issued 15,000,000 shares of Common Stock to an investor for investment of $15,000, or $0.001 per share.\nOn May 26, 2023, the Company issued 16,000,000 shares of Common Stock to an investor for investment of $16,000, or $0.001 per share.\nOn July 7, 2023, the Company issued 17,000,000 shares of Common Stock to an investor for investment of $17,000, or $0.001 per share.\nAs at August 31, 2023, there were 343,759,644 shares of Common Stock issued and outstanding.\nNOTE 9. DERIVATIVE LIABILITIES\nThe Company applies the provisions of ASC Topic 815-40, Contracts in Entitys Own Equity (ASC Topic 815-40), under which convertible instruments, which contain terms that protect holders from declines in the stock price (reset provisions), may not be exempt from derivative accounting treatment. As a result, embedded conversion options in convertible debt are recorded as a liability and are revalued at fair value at each reporting date. If the fair value of the note exceeds the face value of the related debt, the excess is recorded as change in fair value in operations on the issuance date.\nThe Company identified embedded derivatives as a Beneficial Conversion Feature of the 2020 Series A Preferred Stock, issued on November 6, 2020. This was evaluated as $5,000,000, based on the conversion terms of one share of preferred stock for 100,000,000 shares of Common Stock and the price of the Common Stock on the date of issue of $0.05 per share. This was posted to Additional Paid-in Capital and as a loss to the Statement of Operations for the year ended August 31, 2021.\nOn October 19, 2022, the Company entered into two identical convertible loan notes with a face value of $27,500 each, including an original issuer discount (‘OID) of $2,500 in each. The Company identified embedded derivatives related to these Convertible Loan Notes totaling $56,094 for each loan note. These embedded derivatives included certain conversion features, whereby they are convertible at an initial price of $0.0025 per share of common stock, or 50% of the lowest price in the past 30 days. The accounting treatment of derivative financial instruments requires that the Company record the fair value of the derivatives as of the inception date of the Convertible Promissory Notes and to adjust the fair value as of each subsequent balance sheet date. At the inception of the Convertible Promissory Notes, the Company determined a fair value for the embedded derivative using the Black Scholes Model based on the following assumptions:\nDividend yield\n0.00%\nVolatility\n248.05%\nRisk-free rate\n4.35%\nThe initial fair value of the embedded debt derivative was $112,188. The proceeds of the note of $55,000, including the Original Issuer Discount of $5,000, was allocated as a debt discount. The amount in excess of the proceeds of the loan note of $57,188 was charged as interest to the Statement of Operations for the period.\nOn December 21, 2022, the Company entered into a convertible loan note with a face value of $22,000, including an original issuer discount (‘OID) of $2,000. The Company identified embedded derivatives related to this Convertible Loan Note totaling $43,993. The embedded derivatives included certain conversion features, whereby they are convertible at an initial price of $0.00495 per share of common stock, or 50% of the lowest price in the past 30 days. The accounting treatment of derivative financial instruments requires that the Company record the fair value of the derivatives as of the inception date of the Convertible Promissory Notes and to adjust the fair value as of each\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nsubsequent balance sheet date. At the inception of the Convertible Promissory Notes, the Company determined a fair value for the embedded derivative using the Black Scholes Model based on the following assumptions:\nDividend yield\n0.00%\nVolatility\n243.35%\nRisk-free rate\n3.78%\nThe initial fair value of the embedded debt derivative was $43,993. The proceeds of the note of $22,000, including the Original Issuer Discount of $2,000, were allocated as a debt discount. The amount in excess of the proceeds of the loan note of $21,993 was charged as interest to the Statement of Operations for the period.\nOn March 9, 2023, the Company entered into a convertible loan note with a face value of $50,000. The Company identified embedded derivatives related to this Convertible Loan Note totaling $406,654. The embedded derivatives included certain conversion features, whereby they are convertible at an initial price of $0.001 per share of common stock. The accounting treatment of derivative financial instruments requires that the Company record the fair value of the derivatives as of the inception date of the Convertible Promissory Notes and to adjust the fair value as of each subsequent balance sheet date. At the inception of the Convertible Promissory Notes, the Company determined a fair value for the embedded derivative using the Black Scholes Model based on the following assumptions:\nDividend yield\n0.00%\nVolatility\n212.03%\nRisk-free rate\n4.34%\nThe initial fair value of the embedded debt derivative was $406,654. The proceeds of the note of $50,000 were allocated as a debt discount. The amount in excess of the proceeds of the loan note of $356,654 was charged as interest to the Statement of Operations for the period.\nOn July 28, 2023, the Company entered into a convertible loan note with a face value of $22,000. The Company identified embedded derivatives related to this Convertible Loan Note totaling $43,966. The embedded derivatives included certain conversion features, whereby they are convertible at a price per share of 50% of the lowest market price of the stock since the issuance of the Note. The accounting treatment of derivative financial instruments requires that the Company record the fair value of the derivatives as of the inception date of the Convertible Promissory Notes and to adjust the fair value as of each subsequent balance sheet date. At the inception of the Convertible Promissory Notes, the Company determined a fair value for the embedded derivative using the Black Scholes Model based on the following assumptions:\nDividend yield\n0.00%\nVolatility\n213.59%\nRisk-free rate\n4.25%\nThe initial fair value of the embedded debt derivative was $43,966. The proceeds of the note of $22,000 were allocated as a debt discount. The amount in excess of the proceeds of the loan note of $21,966 was charged as interest to the Statement of Operations for the period.\nThe fair value of the embedded debt derivative was reviewed at August 31, 2023, using the following inputs:\nDividend yield\n0.00%\nVolatility\n223.03%\nRisk-free rate\n4.27%\nThe fair value of the embedded debt derivative was $384,524, a decrease in the valuation of the embedded debt derivative of $222,277 for the year. This decrease was charged as a gain on revaluation of the derivative liability to the statement of operations.\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nThe following table provides a summary of changes in fair value of the Companys Level 3 derivative liabilities as at August 31, 2023:\nAugust 31,\nAugust 31,\nBalance, beginning of period\n$\n-\n$\n-\nAdditions\n606,801\n-\nMarket-to-market at modification date\n(222,277)\n-\nReclassified to additional paid-in capital upon modification of term\n-\n-\nBalance, August 31, 2023\n$\n384,524\n$\n-\nNet gain due to change in fair value for the period included in Statement of Operations\n$\n222,277\n$\n-\nThis mark-to-market decrease of $222,277 for the year ending August 31, 2023 was charged to the statement of operations as a gain on change in value of derivative liabilities.\nNOTE 10. INCOME TAXES\nThe Company uses the assets and liability method of accounting for income taxes pursuant to SFAS No. 109 Accounting for Income Taxes. Under the assets and liability method of SFAS No. 109, deferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statements carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nIn June 2006, the FASB issued FASB Interpretation No. 48, Accounting for Uncertainty in Income Taxes. Specifically, the pronouncement prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken from year ended December 31, 2015 tax return onwards. The interpretation also provides guidance on the related derecognition, classification, interest and penalties, accounting for interim periods, disclosure and transition of uncertain tax positions. The Company adopted this interpretation effective on inception.\nFor the year ended August 31, 2023, the Company had available for US federal income tax purposes net operating loss carryovers of $30,921,950, all of which will expire by 2043.\nThe Company has provided a full valuation allowance against the full amount of the net operating loss benefit, since, in the opinion of management, based upon the earnings history of the Company, it is more likely than not that the benefits will not be realized:\nAugust 31, 2023\nAugust 31, 2022\nStatutory federal income tax rate\n21.00%\n21.00%\nStatutory state income tax rate\n0.00%\n0.00%\nValuation allowance\n(21.00%)\n(21.00%)\nEffective tax rate\n0.00%\n0.00%\nDeferred income taxes result from temporary differences in the recognition of income and expenses for financial reporting purposes and for tax purposes. The tax effect of these temporary differences representing deferred tax assets result principally from the following:\nDeferred Tax Assets (Gross Values)\nAugust 31, 2023\nAugust 31, 2022\nNet operating loss carryforward\n$\n(25,540,462)\n$\n(25,097,969)\nLess: Valuation allowance\n25,540,462\n25,097,969\nNet deferred asset\n$\n-\n$\n-\nNITCHES, INC.\nConsolidated Audited Financial Statements\nNotes For the Years Ending August 31, 2023 and 2022\nNOTE 11. RELATED PARTY TRANSACTIONS\nThere were related party transactions during the year ending August 31, 2023 and 2022. The Companys CEO accrued pay and expenses of $12,000 as at August 31, 2022. In addition, the CEO paid certain invoices on behalf of the Company and accrued more pay, totaling $33,915, for a total of $45,931 due to the CEO at February 28, 2023.\nThe $45,931 due to the CEO was repaid via the issuance of 200,000,000 shares of common stock on March 9, 2023. In addition, a loan note for $50,000 was issued to repay the balance of $16,000 due to the CEO and prepay four months salary at $8,500 per month, for a total of $34,000.\nNOTE 12. SUBSEQUENT EVENTS\nThere were no events to report subsequent to August 31, 2023. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nWe are a smaller reporting company as defined in Item 10(f)(1) of Regulation S-K, and are a non-accelerated filer, and therefore are not required to provide the information specified in Item 9A. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nBelow are the names of and certain information regarding the Companys current executive officers and directors:\nName\nPosition\nDate of Appointment\nJohn Morgan\nPresident, CEO, Director\nJanuary 2021\nAhsan Zeb\nCTO\nJanuary 19, 2022\nThe following are brief biographies of the officers and directors:\nJohn Morgan (46) - CEO, Sole Director\nMr. Morgan received an education and multiple certifications from the University of South Alabama, Columbia Southern, and Mississippi State. From 2010 to December 2022, he was a sales executive in the retail segment for a Fortune 100 telecommunications company, managing sales teams of as many as 800 people with a cumulative value of approximately $24 million USD across 20 locations. In addition to this position, Mr. Morgan has held management positions at multiple micro-cap public companies. He was the CEO at ZA Group, Inc. from 2018 to January 2023; the CEO of Nitches, Inc. from 2020 to the present; the CEO of RONN (f/k/a Lee Pharmaceuticals, Inc.) from January 2021 to March 2023.-march or 2023.\nAhsan Zeb (30) - CTO\nMr. Zeb received a bachelors degree in computer science from National University of Sciences & Technology of Pakistan Islamabad. As the Chief Technology Officer, he demonstrates profound knowledge in technology strategy, implementation, and innovation. He successfully leads cross-functional teams and played a pivotal role in driving digital transformation initiatives. His ability to align technology solutions with business objectives significantly contributed to the growth and success of our organization. Moreover, Mr. Zeb has been instrumental in fostering a culture of collaboration, creativity, and continuous improvement within the technology department. His exceptional communication skills enable him to effectively liaise with stakeholders at all levels, ensuring the successful delivery of projects and initiatives. He consistently demonstrates a strong work ethic, reliability, and the ability to adapt to changing circumstances. Prior to joining the Company in January 2022, Mr. Zeb worked in the IT department of his local municipality in Pakistan.\nBoard of Directors\nOur board of directors currently consists of one director, who is not independent as defined in Rule 4200 of FINRAs listing standards. We may appoint additional independent directors to our board of directors in the future, particularly to serve on committees should they be established.\nCommittees of the Board of Directors\nWe may establish an audit committee, compensation committee, a nominating and governance committee and other committees to our Board of Directors in the future but have not done so as of the date of this Offering Circular. Until such committees are established, matters that would otherwise be addressed by such committees will be acted upon by the Board of Directors.\nDirector Compensation\nThe Company currently does not pay any cash compensation to members of its board of directors for their services as directors of the Company. However, the Company reimburses its directors for all reasonable out-of-pocket expenses incurred in connection with their attendance at meetings of the board of directors. The Company may determine to grant to each new director, at the time of such directors appointment, an option to purchase its common shares. In the future, the Company may also elect to offer directors cash compensation.\nLimitation of Liability and Indemnification of Officers and Directors\nOur Certificate of Incorporation and bylaws both provide for the indemnification of our officers and directors to the fullest extent permitted by the Nevada Business Corporation Act. Our Certificate of Incorporation states that a director of the company shall not be personally liable to the company or its stockholders for monetary damages for breach of fiduciary duty as a director.\nThe bylaws state that the company shall, to the maximum extent and in the manner permitted by the Nevada Business Corporation Act, indemnify each of its directors and officers against expenses (including attorneys fees), judgments, fines, settlements, and other amounts actually and reasonably incurred in connection with any proceeding, arising by reason of the fact that such person is or was an agent of the company. ITEM 11. EXECUTIVE COMPENSATION\nThe following table sets forth for the two years ended August 31, 2023 and 2022, the compensation awarded to, paid to, or earned by, the Companys officers.\nSummary Compensation Table\nName &\nPrincipal\nPosition\nFiscal\nYear\nEnded\nAugust\n31,\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNon-Qualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nJohn Morgan,\n120,000\n200,000\n320,000\nPresident, CEO\n102,000\n102,000\nAhsan Zeb\n42,000\n42,000\nCTO\n24,000\n24,000 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth information regarding beneficial ownership of our Stock as of the date of this report.\nName and Position\nAddress\nClass\nShares Owned\nNumber\nPercent\nJohn Morgan, President, CEO\n1333 N Buffalo Dr.\nLas Vegas, NV 89128\nCommon Stock\nSeries A Preferred\n225,000,000\n42.19%\n100.0% ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nAll related transactions have been reported in Part II Item 8 Financial Statements. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit Fees\n$\n5,375\n$\n5,375\nAudit Related Fees\n-\n-\nTax Fees\n10,000\n10,000\nAll Other Fees\n$\n15,375\n$\n15,375\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the Securities and Exchange Commission, other accounting consulting and other audit services.\nTax Fees - This category consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\nPolicy for Pre-Approval of Audit and Non-Audit Services\nWe have not established an audit committee. Our board of directors approved the services rendered and fees charged by our independent registered public accounting firm.\nOur board of directors policy is to pre-approve all audit services and all non-audit services that our independent registered public accounting firm is permitted to perform for us under applicable federal securities regulations. As permitted by the applicable regulations, our board of directors policy utilizes a combination of specific pre-approval on a case-by-case basis of individual engagements of the independent registered public accounting firm.\nAll engagements of the independent registered public accounting firm to perform any audit services and non-audit services since that date have been pre-approved by our board of directors in accordance with the pre-approval policy. The policy has not been waived in any instance. All engagements of the independent registered public accounting firm to perform any audit services and non-audit services prior to the date the pre-approval policy was implemented were approved by our board of directors in accordance with its normal functions. ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nIncorporated by\nReference\nExhibit\nNo.\nDescription\nFiled\nHerewith\n(*)\nFiling\nType\nDate Filed\n2.1\nOrder Granting Application for Appointment of International Venture Society as Custodian of Nitches, Inc.\n1-A/A\n09/08/2021\n3.1\nArticles of Incorporation, as amended\n1-A\n08/04/2021\n3.2\nBylaws\n1-A\n08/04/2021\n4.1\nSeries A Preferred Stock Designation\n1-A/A\n09/08/2021\n10.1\nBeverage Brand Developer Agreement (March 2023)\n*\n23.1\nAuditors Consent\n*\n31.1\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 of Principal Executive Officer and Principal Financial Officer\n*\n32.1\nCertification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 of the Principal Executive and Financial Officer\n*\n101.INS\nInline XBRL Instances Document\n*\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n*\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n*\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n*\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n*\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n*\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\n*\nSIGNATURES\nPursuant to the requirements of Section 13 or 15 of the Securities Exchange Act, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nNITCHES, INC.\nDecember 7, 2023\nBy:\n/s/ John Morgan\nName:\nJohn Morgan\nTitle:\nPrincipal Executive Officer & Principal Accounting/Financial Officer"
}