{
    "cik": "773318",
    "company": "VERITEC INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "8741",
    "state_of_inc": "NV",
    "state_location": "MN",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/773318/0001607062-23-000457-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/773318/000160706223000457/vrtc063023form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/773318/0001607062-23-000457.txt",
    "filename": "773318_10K_2023_0001607062-23-000457.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nSummary\nVeritec, Inc. (the Company) is primarily engaged in the development, sales, and licensing of products and providing services related to its mobile banking solutions.\nAs a Cardholder Independent Sales Organization, Veritec is able to promote and sell Visa-branded card programs. As a Third-Party Servicer, Veritec provides back-end cardholder transaction processing services for Visa-branded card programs on behalf of its sponsoring bank. Veritec has a portfolio of five United States and eight foreign patents. In addition, we have seven U.S. and twenty-eight foreign pending patent applications. Veritec has had agreements with various banks in the past and is currently seeking a bank to sponsor its Prepaid Card programs.\nThe Company was also previously engaged in its proprietary two-dimensional matrix symbology technology (also commonly referred to as two-dimensional barcodes, 2D barcodes, or Barcode Technology) which it sold on September 30, 2015 to The Matthews Group, a related party. The Company subsequently entered into a management services agreement with The Matthews Group to manage all facets of The Matthews Groups Barcode Technology operations through June 30, 2024.\nIn this Form 10-K, the Companys mobile software banking technology will hereafter be referred to as its Mobile Banking Technology. The Mobile Banking Technology is used to offer Prepaid Card Programs to sponsor banks and approved applicants/cardholders. These programs may also be referred to as the MTC™ card or the Blinx ON-OFF™ Prepaid Card programs.\nCompany History\nAs a Cardholder Independent Sales Organization, Veritec is able to promote and sell Visa-branded card programs. As a Third-Party Servicer, Veritec provides back-end cardholder transaction processing services for Visa-branded card programs on behalf of its sponsoring bank. Veritec has a portfolio of five United States and eight foreign patents. In addition, we have seven U.S. and twenty-eight foreign pending patent applications. Veritec has had agreements with various banks in the past and is currently seeking a bank to sponsor its Prepaid Card programs.\nOur Products and Solutions\nThe Company believes that its Mobile Banking Technology platform and its blinx On-Off™ debit card and blinxPay™ mobile wallet programs are a significant advance in mobile banking and close loop/open loop debit technology and is capable of bringing significant value to card issuing and sponsoring organizations, whether they be commercial or government.\n(a) MTC™ Debit Card - Visa® Prepaid Card Programs\nIn fiscal year 2009, the Company announced the release of its Mobile Toggle Card (MTC™) Program on the Companys mobile banking software platform under a sponsoring bank. Veritecs mobile banking software platform is a debit based, pre-paid and gift card solution that is licensed by Veritecs wholly owned subsidiary, Veritec Financial Systems, Inc., to debit card issuers and sponsoring organizations. Under the MTC™ Program, card issuers and sponsors may provide the MTC™ branded debit or gift cards to individuals with and without demand deposit accounts (e.g., the latter the under-banked). The MTC™ card may be part of a Visa® branded program and, as such, the cards are accepted anywhere in the world that Visa cards are accepted.\nWith an MTC™ card, the cardholders are empowered to combat unpermitted and fraudulent use of their debit cards by toggling their cards on and off with their mobile phones. Cardholders no longer have to completely rely on their card issuers to monitor possible fraudulent activity on their accounts. Cardholders can now de-activate their cards themselves, in real-time, any time they choose to do so. In addition to this toggling feature, cardholders may apply for their cards online, arrange for direct deposits to be made to their cards, and transfer money to their card from another account. Cardholders may also elect to receive various alerts on their mobile phones about activity on their card. In the fiscal year 2010, the Company began accepting applications for the MTC™ card from individual applicants and issuing live Visa® branded debit cards under the MTC Mobile Toggle Card Program.\n(b) blinx ON-OFF Debit Card - Visa® Prepaid Card Programs\nIn fiscal year 2011, Veritec began marketing the blinx ON-OFF™ branded card under a bank sponsorship. The blinx ON-OFF™ card is based on the Mobile Banking Technology platform and offers the same features and functions as the MTC™ branded card but with different pricing for bank-sponsored cards.\n(c) Custom Branded Debit Card Programs\nIn addition to the MTC™ and blinx ON-OFF™ branded program, the Company enables card issuers and sponsors to issue debit, pre-paid and gift cards under their own branded programs through licensed use of the mobile banking platform and the Companys provision of related professional services.\n(d) blinxPay™ Mobile Wallet App\nThe Company released its blinxPay™ mobile wallet application during fiscal year 2016. blinxPay™ is a secure payment processing system and mobile app that enables customers to make purchases at participating merchants using funds loaded into their blinxPay™ virtual account. The blinxPay™ mobile app is available for download for free at both Google Pay and Apple iTunes stores.\nVeritecs mobile banking solution also enables member card programs to be processed and settled member rewards to its members in either an open or closed loop processing environment. In addition to its front-end licensing and professional services, the Company also provides back-end card processing services to the card issuing institutions for all cardholder transactions on the licensed platform. The Companys Mobile Banking Technology resides within a Payment Card Industry (PCI) compliant data processing center.\nIntellectual Property Rights\nThe Company was founded upon its intellectual property on its belief that its intellectual property will give the Company a commercial advantage in the global marketplace. The Company relies on patent, trade secret, copyright and trademark law, as well as the companys contractual terms with its customers, to define, maintain and enforce the Companys intellectual property rights in its Mobile Banking Technology and other technologies and relationships.\nThe Company has a portfolio of seven United States and eight foreign patents. In addition, we have three U.S. and eight foreign pending patent applications.\nA significant amount of the Companys intellectual property takes the form of trade secrets and copyrighted works of authorship. The Company treats the source code to its Mobile Banking Technology as trade secrets, and its licensed software applications are copyrightable subject matter.\nWe have a portfolio of registered and pending trademarks in the U.S. and foreign jurisdictions, including registrations for the marks VSCode® and VeriCode®. The Company uses Veritec as a trademark and service mark, as well as serving as the Companys trade name.\nMajor Customers\nDuring the year ended June 30, 2023, we had three customers, that represented 61% (a related party) 14% and 13% of our revenues, respectively. During the year ended June 30, 2022, we had two customers, that represented 75% (a related party) and 15% of our revenues, respectively. No other customer represented more than 10% of our revenues.\nCompetition\nOur Mobile Banking Technology competes with other independent sales organizations and third party services of Visa-branded card programs, including TransCash Corporation, Ready Debit Card by MetaBank, Millenium Advantage Card by New Millenium Bank, and Wired Plastic by Bancorp Bank. The Company believes, however, that there are very few companies that have the Companys collective attributes of (1) being an independent sales organization of Visa-branded and non-branded prepaid card programs, (2) being a third party servicer (e.g., back end processor) for banks issuing Visa-branded and non-branded prepaid card programs, (3) being the developer, marketer and licensor of the mobile banking platform on which Visa-branded and non-branded card program cardholder transactions take place, and (4) having a mobile banking platform that enables real-time transaction processing and enabling cardholders to manage their accounts by enabling cardholders to toggle their cards and their website accounts on and off via their mobile phones.\nEmployees\nAs of June 30, 2023, the Company employed seven employees and six independent contractor consultants.\nFinancial Information about Geographic Areas\nFor the years ended June 30, 2023, and 2022, United States customers accounted for 100% of the Companys total revenue. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. DESCRIPTION OF PROPERTY\nWe lease approximately 4,200 square feet of office and laboratory space at 2445 Winnetka Avenue North, Golden Valley, Minnesota, which serves as our primary place of business. This lease is with Van Thuy Tran, the Chairman of the Board and the Chief Executive Officer of the Company. Our lease is currently on a month-to-month term and requires monthly payments of $4,000. ITEM 3. LEGAL PROCEEDINGS\nOn September 21, 2016, the Company entered into a settlement agreement with an individual who was a former officer of the Company. The individual in prior years was also issued 500,000 shares of common stock for services. The Company alleged that the individual used the Company's intellectual property without approval. Under the terms of the settlement agreement, the individual agreed to relinquish a convertible note payable and unpaid interest aggregating $364,686 and return 500,000 shares of common stock previously issued to him. In turn, the Company agreed to release and discharge the individual against all claims arising on or prior to the date of the settlement agreement. As of June 30, 2023, the 500,000 shares have not been relinquished. When the Company receives the shares, it will record a cancellation of shares. ITEM 4. MINE SAFETY DISCLOSURE\nNot applicable.\nPART II ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS AND SMALL BUSINESS ISSUER PURCHASES OF EQUITY SECURITIES.\nOur common stock is quoted on the OTCPink marketplace under the symbol VRTC. Prior to that, our common stock was quoted on the OTC Bulletin Board. Prior to September 4, 2009, our common stock was traded in the over the counter markets and quoted on the OTC Pink Sheets. The following table sets forth the range of high and low bid quotes of our common stock per quarter as provided by the National Quotation Bureau (which reflect inter-dealer prices without retail mark-up, mark-down or commission and may not necessarily represent actual transactions).\nMarket Price Range of Common Stock Fiscal Fiscal\nQuarter Ended High Low High Low\nSeptember $ 0.04 $ 0.03 $ 0.10 $ 0.03\nDecember $ 0.03 $ 0.02 $ 0.05 $ 0.04\nMarch $ 0.02 $ 0.02 $ 0.05 $ 0.03\nJune $ 0.03 $ 0.02 $ 0.04 $ 0.03\nShareholders\nAs of June 30, 2023, there were approximately 797 shareholders of record, inclusive of those brokerage firms and/or clearinghouses holding our common shares for their clientele.\nDividend Information\nWe have not declared any cash dividends since inception and do not anticipate paying any dividends in the foreseeable future. The payment of dividends is within the discretion of the Board of Directors and will depend on the Companys earnings, capital requirements, financial condition, and other relevant factors. There are no restrictions that currently limit the Registrants ability to pay dividends on its Common Stock other than those generally imposed by applicable state law.\nUnregistered Sales of Equity Securities\nNo unregistered sales of equity securities occurred during the years ended June 30, 2023, and 2022.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following table sets forth information with respect to shares of common stock issuable under outstanding awards granted pursuant to our equity compensation plan.\nPlan Category Number of securities to be issued upon exercise of outstanding options, warrants and rights Weighted-average exercise price of outstanding options, warrants and rights Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in column (a))\nEquity compensation plans approved by security holders - - -\nEquity compensation plans not approved by security holders(1) 900,000 $ 0.03 -\nTotal 900,000 $ 0.03 -\n(1) The Board of Directors authorized the Chief Executive Officer to issue up to 1,000,000 shares of the Companys common stock in the form of options or stock bonuses to employees and consultants. The Company has agreements with certain employees that provide for five years of annual grants of options, on each employment anniversary date, to purchase shares of the Companys common stock. The option price is determined based on the market price on the date of grant, the options vest one year from the date of grant, and the options expire five years after vesting. The Board of Directors granted 1,150,000 stock options to directors and employees under this arrangement in 2019. The Company granted no stock options or stock bonuses to employees and consultants under this arrangement in 2023 and 2022. ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OR PLAN OF OPERATION\nThe following discussion and analysis of financial condition and results of operations should be read in conjunction with our consolidated financial statements and related notes included elsewhere in this report. This discussion contains forward-looking statements that involve risks, uncertainties, and assumptions. See Note Regarding Forward-Looking Statements. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of certain factors discussed elsewhere in this report.\nThe following discussion and analysis of the Companys financial condition and results of operations is based on the preparation of our financial statements in accordance with U.S. generally accepted accounting principles. You should read this discussion and analysis together with such financial statements and the related notes thereto.\nInflation\nGlobal inflation increased during 2022 and in 2023. The Russia Ukraine conflict and other geopolitical conflicts, as well as related international response, have exacerbated inflationary pressures, including causing increases in the price for goods and services and global supply chain disruptions, which have resulted and may continue to result in shortages in food products, materials and services. Such shortages have resulted and may continue to result in inflationary cost increases for labor, fuel, food products, materials and services, and could continue to cause costs to increase as well as result in the scarcity of certain materials. We cannot predict any future trends in the rate of inflation or other negative economic factors or associated increases in our operating costs and how that may impact our business. To the extent we are unable to recover higher operating costs resulting from inflation or otherwise mitigate the impact of such costs on our and their business, our revenues and operating results could decrease, and our financial condition and results of operations could be adversely affected.\nRecent Events\nOn July 4, 2022, we entered a Memorandum of Understanding (the MOU) for the purpose of forming a strategic partnership between the Company and Nugen Universe, LLC (Nugen), a corporation located in Wrightsville Beach, North Carolina. Nugen seeks us to modify, create, or build a private label system for Nugen, with an initial interest in our blinxPay technology and Bio-ID verification system. Nugen paid us $50,000 at the date of the MOU signing and during the year ended June 30, 2023, we completed our performance obligations, and recorded the $50,000 payment as Mobile banking technology revenue during the year ended June 30, 2023. Nugen further agreed to pay the us a 5% ongoing royalty for licensing the Companys blinxPay technology and Bio-ID verification system. As of June 30, 2023, no royalties have been realized under the MOU.\nOn October 10, 2022, the Company entered into a License and Distributor Agreement (License Agreement) with Nugen. The License Agreement became effective on receipt of $200,000 in December 31, 2022 and extends through August 31, 2027. The License Agreement grants Nugen a Worldwide license and distribution for the Companys blinxPay Close-Loop Virtual Wallet and blinxPay Open-Loop Visa Debit and all hardware products of the Company. Per the terms of the License Agreement, Nugen agrees to pay the Company a one-time license payment of $1,000,000 for the right to market the Companys products noted above, of which $200,000 was received by the Company in December 2022. The initial $200,000 has been recorded as deferred revenue in the Consolidated Balance Sheet. The deferred revenue balance of $200,000 at June 30, 2023, will begin being amortized to Mobile banking technology revenue starting once the Company has met its performance obligations under the License Agreement through the remaining term of the License Agreement, which expires on August 31, 2027. The remaining balance of $800,000 is scheduled to be paid as follows: $100,000 when the Companys identifies a domestic sponsor bank, $350,000 to integrate the Companys blinxPay software platform, and interface blinxPay with a sponsor foreign bank, and $350,000 on the completion of the final stage of testing, installation, and launch. In addition to the one-time license payment, Nugen agrees to pay a minimum monthly support fee plus 5% royalty from all sales of products noted above. As of June 30, 2023, no royalty related revenues have been realized under the License Agreement.\nResults of Operations - June 30, 2023 compared to June 30, 2022\nRevenues\nDetails of revenues are as follows:\nYear Ended June 30, Increase (Decrease)\n$ %\nMobile banking technology $ 140,000 $ 90,000 $ 50,000 55.6\nOther revenue, management fee - related party 216,000 263,000 (47,000 ) (17.9 )\nTotal Revenues $ 356,000 $ 353,000 $ 3,000 0.1\nMobile banking technology\nMobile Banking Technology revenues include products such as the Companys Blinx On-Off™ prepaid toggle Card and its Open Loop/Close Loop System and Bio ID Card Platform. Mobile Banking Technology uses web-based mobile technology to offer financial cardholders the very best technology in conducting secure financial transactions in real time, protecting personal identity, and financial account security. Mobile Banking Technology revenues for the years ended June 30, 2023, and 2022 were $140,000 and $90,000, respectively. The increase in Mobile Banking Technology revenues was related to a development contract of the Companys blinxPay product that concluded during the period ended June 30, 2023. No similar sale occurred during the same period of the prior year.\nOther revenue, management fee - related party\nOn December 31, 2015, the Company sold all of its assets of its Barcode Technology, which was comprised solely of its intellectual property, to The Matthews Group, a related party. The Company subsequently entered into a management services agreement with The Matthews Group to manage all facets of the barcode technology operations through June 30, 2024. The Company earns a fee of 35% of all revenues billed up to June 30, 2024, and recognizes management fee revenue as services are performed. For the years ended June 30, 2023 and 2022, revenue earned from the management services agreement was $216,000 and $263,000, respectively.\nCost of Revenue\nCost of revenue for the years ended June 30, 2023 and 2022 totaled $211,000 and $199,000, respectively.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the years ended June 30, 2023 and 2022 totaled $883,000 and $728,000, respectively. The increase in general and administrative expenses was primarily due to increased legal and professional fees as compared to the same period of the prior year.\nOther Income (Expenses)\nDuring the year ended June 30, 2022, the Company identified certain vendor related accounts payable balances that exceeded the status of limitations for collections. The Company engaged legal counsel to review the matter and received a legal letter supporting a write off of dated accounts payable balances totaling $397,000. No similar activity occurred in the current year period.\nOn October 22, 2022, the Company was notified that its PPP loan forgiveness applications totaling $118,000 were approved. No similar activity occurred in the current year period.\nInterest expense for the years ended June 30, 2023 and 2022, was $496,000 and $447,000, respectively. The increase was due to the increase in our notes payable balance.\nNet Loss\nOur net loss for the years ended June 30, 2023 and 2022, was $1,234,000 and $506,000, respectively.\nLiquidity and Capital Resources\nOur cash balance on June 30, 2023 decreased to $61,000 as compared to $66,000 on June 30, 2022. The decrease was the result of the $494,000 cash provided by financing activities offset by $499,000 cash used in operating activities. Net cash used in operations during the period ended June 30, 2023, was $499,000, compared with $675,000 of net cash used in operations during the same period of the prior year. Cash used in operations during the period ended June 30, 2023, was primarily from our net loss of $1,234,000, offset by a general net increase to our working capital accounts of $240,000, and increased interest accrued on notes payable of $495,000. Net cash provided by financing activities of $494,000 was from proceeds received from notes payable during the period ended June 30, 2023. During the same period of the prior year, net cash provided by financing activities of $503,000 was from proceeds received from notes payable.\nThe accompanying Consolidated Financial Statements have been prepared assuming the Company will continue as a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. During the year ended June 30, 2023, the Company incurred a net loss of $1,234,000 and used cash in operating activities of $499,000, and at June 30, 2023, the Company had a stockholders deficiency of $8,670,000. In addition, as of June 30, 2023, the Company is in default on $767,000 of its convertible notes and notes payable. These factors, among others, raise substantial doubt about our ability to continue as a going concern within one year of the date that the financial statements are issued. In addition, the Companys independent registered public accounting firm, in its report on our June 30, 2023 financial statements, has raised substantial doubt about the Companys ability to continue as a going concern. The Companys financial statements do not include any adjustments that might result from the outcome of this uncertainty be necessary should we be unable to continue as a going concern.\nThe Company believes its cash and forecasted cash flow from operations will not be sufficient to continue operations through fiscal 2024 without continued external investment. Subsequent to June 30, 2023, the Company issued a $22,000 convertible promissory note to Van Tran, the Companys CEO/Executive Chair and a director, as additional working capital. The Company believes it will require additional funds to continue its operations through fiscal 2024 and to continue to develop its existing projects and plans to raise such funds by finding additional investors to purchase the Companys securities, generating sufficient sales revenue, implementing dramatic cost reductions or any combination thereof. There is no assurance that the Company can be successful in raising such funds, generating the necessary sales or reducing major costs. Further, if the Company is successful in raising such funds from sales of equity securities, the terms of these sales may cause significant dilution to existing holders of common stock.\nThe Company has traditionally been dependent on The Matthews Group, LLC, a related party, for its financial support. The Matthews Group is owned 50% by Ms Tran, and 50% by Lawrence J. Johanns, a significant Company stockholder.\nConvertible notes and notes payable\nConvertible and notes payable includes principal and accrued interest and consist of the following at June 30, 2023 and June 30, 2022:\nJune 30,\nJune 30,\n(a) Unsecured convertible notes ($21,000 and $20,000 in default) $ 66,000 $ 64,000\n(b) Notes payable (in default) 475,000 458,000\n(c) Notes payable (in default) 29,000 28,000\nTotal notes-third parties $ 570,000 $ 550,000\n(a) The notes are unsecured, convertible into common stock at amounts ranging from $0.08 to $0.30 per share, bear interest at rates ranging from 5% to 8% per annum, were due through 2011 and are in default or due on demand.\nAt June 30, 2021, convertible notes totaled $62,000. During the year ended June 30, 2022, interest of $2,000 was added to the principal resulting in a balance owed of $64,000 at June 30, 2022. During the year ended June 30, 2023, interest of $2,000 was added to the principal resulting in a balance owed of $66,000 at June 30, 2023. On June 30, 2023, $21,000 of the convertible notes were in default and convertible at a conversion price of $0.30 per share into 69,286 shares of the Companys common stock. The balance of $45,000 is due on demand and convertible at a conversion price of $0.08 per share into 567,180 shares of the Companys common stock.\n(b) The notes are either secured by the Companys intellectual property or unsecured and bear interest ranging from 6.5% to 10% per annum, were due in 2012, and are in default.\nAt June 30, 2021, the notes totaled $440,000. During the year ended June 30, 2022, interest of $18,000 was added to principal resulting in a balance owed of $458,000 at June 30, 2022. During the year ended June 30, 2023, interest of $17,000 was added to principal resulting in a balance owed of $475,000 at June 30, 2023. At June 30, 2023, $427,000 of notes are secured by the Companys intellectual property and $48,000 of notes are unsecured.\n(c) The notes are unsecured and bear interest of 4% per annum and were due on March 17, 2020 and are in default.\nAt June 30, 2021 the notes totaled $27,000. During the year ended June 30, 2022, interest of $1,000 was added to the principal resulting in a balance owed of $28,000 at June 30, 2022. During the year ended June 30, 2023, interest of $1,000 was added to the principal resulting in a balance owed of $29,000 at June 30, 2023.\nConvertible notes and notes payable-related parties\nConvertible and notes payable-related parties include principal and accrued interest and consist of the following at June 30, 2023 and June 30, 2022:\nJune 30,\nJune 30,\n(a) Convertible notes-The Matthews Group $ 1,970,000 $ 1,855,000\n(b) Notes payable-The Matthews Group 4,988,000 4,177,000\n(c) Convertible notes-other related parties ($242,000 and $233,000 in default) 364,000 321,000\nTotal notes-related parties $ 7,322,000 $ 6,353,000\n(a) The notes are unsecured, convertible into common stock at $0.08 per share, bear interest at rates ranging from 8% to 10% per annum and are due on demand.\nThe Matthews Group is a related party (see Note 8) and is owned 50% by Ms. Van Tran, the Companys CEO, and 50% by Larry Johanns, a significant shareholder of the Company. At June 30, 2021, convertible notes due to The Matthews Group totaled $1,741,000. During the year ended June 30, 2022, $114,000 of interest was added to principal, resulting in a balance payable of $1,855,000 at June 30, 2022. During the year ended June 30, 2023, $115,000 of interest was added to principal, resulting in a balance payable of $1,970,000 at June 30, 2023. At June 30, 2023, the notes are convertible at a conversion price of $0.08 per share into 24,621,824 shares of the Companys common stock.\n(b) The notes are unsecured, accrue interest at 10% per annum, and are due on demand. The notes were issued relating to a management services agreement with The Matthews Group (see Note 8) dated September 30, 2015.\nAt June 30, 2021, notes due to The Matthews Group totaled $3,375,000. During the year ended June 30, 2022, $503,000 of notes payable were issued and interest of $299,000 was added to principal, resulting in a balance owed of $4,177,000 at June 30, 2022. During the year ended June 30, 2023, $464,000 of notes payable were issued and interest of $347,000 was added to principal, resulting in a balance owed of $4,988,000 at June 30, 2023.\n(c) The notes are due to a current and a former director, are unsecured, convertible into common stock at per share amounts ranging from $0.04 to $0.30, and bear interest at rates ranging from 8% to 10% per annum.\nAt June 30, 2021, convertible notes due to other related parties totaled $308,000. During the year ended June 30, 2022, interest of $13,000 was added to principal resulting in a balance owed of $321,000 at June 30, 2022. During the year ended June 30, 2023, $30,000 of notes payable were issued and interest of $13,000 was added to principal, resulting in a balance owed of $364,000 at June 30, 2023. During the year ended June 30, 2023, $30,000 of notes payable were issued and interest of $13,000 was added to principal, resulting in a balance owed of $364,000 at June 30, 2023. At June 30, 2023, $242,000 of the notes were due in 2010 and are in default, and $122,000 is due on demand. At June 30, 2023, $242,000 of the notes are convertible at a conversion price of $0.30 per share into 807,081 shares of the Companys common stock, $92,000 of the notes are convertible at a conversion price of $0.09 per share into 1,076,347 shares of the Companys common stock, and $30,000 of the notes are convertible at a conversion price of $0.04 per share into 759,863 shares of the Companys common stock .\nCommitments and Contractual Obligations\nThe Company leases its corporate office building from Ms. Tran, our chief executive officer, on a month-to-month basis, for $4,000 per month. The corporate office is located at 2445 Winnetka Avenue North, Golden Valley, Minnesota.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nManagements discussion and analysis of our financial condition and results of operations are based on our financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an ongoing basis, management evaluates its estimates, including those related to impairment of long-lived assets, including finite lived intangible assets, accrued liabilities, fair value of warrant derivatives and certain expenses. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ materially from these estimates under different assumptions or conditions.\nOur significant accounting policies are more fully described in Note 1 to our financial statements. The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, and expenses, and the related disclosures of contingent assets and liabilities. Actual results could differ from those estimates under different assumptions or conditions.\nRevenue Recognition\nRevenues for the Company are classified into mobile banking technology and management fee revenue.\na. Mobile Banking Revenue\nThe Company, as a merchant payment processor and a distributor, recognizes revenue from transaction fees charged to cardholders for the use of its issued mobile debit cards. The fees are recognized on a monthly basis after all cardholder transactions have been summarized and reconciled with third party processors.\nb. Other revenue, management fee - related party\nOn September 30, 2015, the Company sold all of its assets of its Barcode Technology comprised solely of its intellectual property to The Matthews Group and entered into a management services agreement with The Matthews Group to manage all facets of the barcode technology operations, on behalf of The Matthews Group, through June 30, 2024. The Company earned a fee of 35% of all revenues billed up to June 30, 2024.\nRecently Issued Accounting Standards\nSee Footnote 1 of consolidated financial statements for a discussion of recently issued accounting standards. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTAL DATA\nPage\nPART I - FINANCIAL INFORMATION\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Deficiency for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements to\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Stockholders\nVeritec, Inc.\nGolden Valley, Minnesota\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Veritec, Inc. (the Company) and subsidiaries as of June 30, 2023 and 2022, the related consolidated statements of operations, stockholders deficiency, and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company and its subsidiary as of June 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the consolidated financial statements, the Company has had recurring losses from operations and had a stockholders deficiency as of June 30, 2023. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2 to the consolidated financial statements. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue recognition - Revenue from Related Party\nAs described in Notes 4 and 8 to the consolidated financial statements, the Company has entered into a management services agreement (the Agreement) with The Matthews Group (TMG), to manage all facets of their barcode technology operations through June 30, 2024. TMG is owned 50% by Ms. Tran, the Companys CEO/Executive Chair and a director, and 50% by Larry Johanns, a significant stockholder of the Company. Pursuant to the Agreement, the Company earns a fee of 35% of all revenues billed by TMG to its customers. The Company recognizes management fee revenue as services are performed by TMG. In addition, all net cash flow from the barcode technology operations is retained by the Company and reflected as proceeds from notes payable to TMG. Management fee revenue from the Agreement represented approximately 61% of the Companys total revenue for the fiscal year ended June 30, 2023.\nWe identified the Companys recording of revenue as a critical audit matter because of the complexity involved in the recognition of such revenue, in particular given its related party nature. In turn, the auditing of revenue from related party required a high degree of auditor judgment, subjectivity and effort in performing audit procedures and evaluating the results of those procedures to ensure revenue has been properly recorded.\nThe primary procedures we performed to address this critical audit matter included:\nWe obtained and evaluated documentation prepared by management which outlines the Companys revenue recognition policies and their processes to determine the revenue to be recognized from TMG sales pursuant to the underlying agreements and current accounting guidelines.\nWe evaluated whether the Companys conclusion in such documentation was consistent with relevant accounting standards.\nWe obtained a schedule of all revenue recognized by TMG and reconciled the recorded revenue to the underlying accounting records.\nWe selected a sample of revenue transactions recorded by TMG and performed detail testing including the following for each selection:\nObtained evidence of a contract with the customer;\nCompared the amounts recognized and timing of revenue recognition to underlying source documents such as invoices, form of payments, and executed contracts and related modifications, if any;\nEvaluated the Companys application of their accounting policies to determine the timing and amount recognized; and\nFor each sample tested, we recalculated the Companys share of revenue based upon the terms of the agreement and reconciled to the Companys accounting records.\nWe obtained and tested a schedule of net receipts retained by the Company and reflected as a note payable to TMG.\nWe confirmed the balance of the note to TMG as of June 30, 2023.\nWe read and evaluated managements disclosure of the nature of the transaction and identification as related party transaction.\n/s/ Weinberg & Company, P.A.\nLos Angeles, California\nOctober 13, 2023\nID#572\nWe have served as the Companys auditor since 2008\nVERITEC, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent Assets:\nCash $ 61,000 $ 66,000\nAccounts receivable 7,000 7,000\nPrepaid expenses 6,000 6,000\nTotal Assets $ 74,000 $ 79,000\nLIABILITIES AND STOCKHOLDERS DEFICIENCY\nCurrent Liabilities:\nAccounts payable $ 289,000 $ 271,000\nAccounts payable, related party 119,000 102,000\nAccrued expenses 60,000 59,000\nCustomer deposits 29,000 25,000\nConvertible notes and notes payable ($525,000 and $506,000 in default) 570,000 550,000\nConvertible notes and notes payable, related parties ($242,000 and $233,000 in default) 7,322,000 6,353,000\nTotal Current Liabilities 8,389,000 7,360,000\nDeferred revenues 200,000 -\nContingent earnout liability 155,000 155,000\nTotal Liabilities 8,744,000 7,515,000\nCommitments and Contingencies - -\nStockholders' Deficiency:\nConvertible preferred stock, par value $1.00; authorized 10,000,000 shares, 276,000 shares of Series H authorized, 1,000 shares issued and outstanding 1,000 1,000\nCommon stock, par value $.01; authorized 150,000,000 shares; 39,988,007 and 39,988,007 shares issued and outstanding, respectively 400,000 400,000\nCommon stock to be issued, 145,000 shares to be issued 12,000 12,000\nAdditional paid-in capital 18,143,000 18,143,000\nAccumulated deficit (27,226,000 ) (25,992,000 )\nTotal Stockholders' Deficiency (8,670,000 ) (7,436,000 )\nTotal Liabilities and Stockholders Deficiency $ 74,000 $ 79,000\nSee accompanying notes.\nVERITEC, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFiscal Years Ended\nJune 30,\nRevenue:\nMobile banking technology revenue $ 140,000 $ 90,000\nOther revenue, management fee - related party 216,000 263,000\nTotal revenue 356,000 353,000\nCost and Expense:\nCost of revenue 211,000 199,000\nSelling, general and administrative expenses (including $51,000 and $51,000, respectively, to a related party) 883,000 728,000\nTotal operating expenses 1,094,000 927,000\nLoss from operations (738,000 ) (574,000 )\nOther Income (Expense):\nGain on extinguishment of accounts payable - 397,000\nGain on forgiveness of SBA PPP loans - 118,000\nInterest expense (including $475,000 and $426,000, respectively, to related parties) (496,000 ) (447,000 )\nTotal other income (expense), net (496,000 ) 68,000\nNet Loss $ (1,234,000 ) $ (506,000 )\nNet Loss Per Common Share - Basic and Diluted $ (0.03 ) $ (0.01 )\nWeighted Average Number of Shares Outstanding - Basic and Diluted 39,988,007 39,988,007\nSee accompanying notes.\nVERITEC, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIENCY\nPreferred Stock Common Stock\nShares Amount Shares Amount Common Stock to be\nIssued\nAdditional Paid-in Capital Accumulated Deficit Stockholders\nDeficiency\nBalance, June 30, 2021 1,000 $ 1,000 39,998,007 $ 400,000 $ 12,000 $ 18,143,000 $ (25,486,000 ) $ (6,930,000 )\nNet Loss - - - - - - (506,000 ) (506,000 )\nBalance, June 30, 2022 1,000 1,000 39,988,007 400,000 12,000 18,143,000 (25,992,000 ) (7,436,000 )\nNet Loss - - - - - - (1,234,000 ) (1,234,000 )\nBalance, June 30, 2023 1,000 $ 1,000 39,988,007 $ 400,000 $ 12,000 $ 18,143,000 $ (27,226,000 ) $ (8,670,000 )\nSee accompanying notes.\nVERITEC, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFiscal Years Ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (1,234,000 ) $ (506,000 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nInterest accrued on notes payable 495,000 447,000\nGain on extinguishment of accounts payable - (397,000 )\nGain on forgiveness of SBA PPP loan - (118,000 )\nChanges in operating assets and liabilities:\nAccounts receivable - 1,000\nPrepaid expenses - (1,000 )\nCustomer deposits 4,000 (72,000 )\nDeferred revenue 200,000 -\nAccounts payable 18,000 (23,000 )\nAccounts payable, related party 17,000 6,000\nAccrued expenses 1,000 (12,000 )\nNet cash used in operating activities (499,000 ) (675,000 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from notes payable-related party 494,000 503,000\nNet cash provided by financing activities 494,000 503,000\nNET DECREASE IN CASH (5,000 ) (172,000 )\nCASH AT BEGINNING OF PERIOD 66,000 238,000\nCASH AT END OF PERIOD $ 61,000 $ 66,000\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION\nCash paid for interest $ - $ -\nSee accompanying notes.\nVERITEC, INC. AND SUBSIDIARIES\nNOTES TO CONDENSED CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE FISCAL YEARS ENDED JUNE 30, 2023 AND 2022\nNOTE 1 - OPERATIONS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe Company\nVeritec, Inc. (Veritec) was formed in the State of Nevada on September 8, 1982.\nVeritec is primarily engaged in the development, sales, and licensing of products and providing services related to its mobile banking solutions.\nAs a Cardholder Independent Sales Organization, Veritec is able to promote and sell Visa-branded card programs. As a Third-Party Servicer, Veritec provides back-end cardholder transaction processing services for Visa-branded card programs on behalf of its sponsoring bank. Veritec has a portfolio of five United States and eight foreign patents. In addition, we have seven U.S. and twenty-eight foreign pending patent applications. Veritec has had agreements with various banks in the past and is currently seeking a bank to sponsor its Prepaid Card programs.\nOn December 31, 2015, the Company sold all of its assets of its barcode technology, which was comprised solely of its intellectual property, to The Matthews Group, a related party (see Note 8). The Company subsequently entered into a management services agreement with The Matthews Group to manage all facets of the barcode technology operations through June 30, 2024. The Company earns a fee of 35% of all revenues billed up to June 30, 2024, and recognizes management fee revenue as services are performed.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries Veritec Financial Systems, Inc., Tangible Payment Systems, Inc., and Public Bell, Inc. (collectively the Company). Intercompany transactions and balances were eliminated in consolidation.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that may affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and reported amounts of revenues and expenses during the reporting period. Those estimates and assumptions include estimates for reserves of uncollectible accounts, analysis of impairments of long-lived assets, accruals for potential liabilities, assumptions made in valuing stock instruments issued for services, and valuation of deferred tax assets. Actual results could differ from those estimates.\nCash and cash equivalents\nInvestments with original maturities of three months or less are considered to be cash equivalents. The Company held no cash equivalents as of June 30, 2023 and 2022.\nAccounts Receivable\nThe Company grants uncollateralized credit to customers but requires deposits on unique orders. Management periodically reviews its accounts receivable and provides an allowance for doubtful accounts after analyzing the age of the receivable, payment history and prior experience with the customer. The estimated loss that management believes is probable is included in the allowance for doubtful accounts. While the ultimate loss may differ, management believes that any additional loss will not have a material impact on the Company's financial position. Due to uncertainties in the settlement process, however, it is at least reasonably possible that management's estimate will change during the near term. Based on managements assessment, no allowance for doubtful accounts was considered necessary at June 30, 2023, or 2022.\nRevenue Recognition\nRevenues for the Company are classified into management fee revenue and mobile banking technology.\nThe Company recognizes revenue in accordance with the Financial Accounting Standards Boards (FASB) Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers (Topic 606) (ASC 606). The underlying principle of ASC 606 is to recognize revenue to depict the transfer of goods or services to customers at the amount expected to be collected. ASC 606 creates a five-step model that requires entities to exercise judgment when considering the terms of contracts, which includes (1) identifying the contracts or agreements with a customer, (2) identifying the Companys performance obligations in the contract or agreement, (3) determining the transaction price, (4) allocating the transaction price to the separate performance obligations, and (5) recognizing revenue as each performance obligation is satisfied. The Company only applies the five-step model to contracts when it is probable that the Company will collect the consideration it is entitled to in exchange for the services it transfers to its clients.\nMobile Banking Technology Revenue\nThe Company, as a merchant payment processor and a distributor, recognizes revenue from transaction fees charged to cardholders for the use of its issued mobile debit cards. The fees are recognized on a monthly basis after all cardholder transactions have been summarized and reconciled with third party processors.\nOther Revenue, Management Fee - Related Party\nOn September 30, 2015, the Company sold all of its assets of its Barcode Technology, which was comprised solely of its intellectual property, to The Matthews Group (a related party, see Note 8). The Company subsequently entered into a management services agreement with The Matthews Group to manage all facets of the barcode technology operations through June 30, 2024. The Company earned a fee of 35% of all revenues billed up to June 30, 2023. The Company recognizes management fee revenue as services are performed.\nDisaggregation of Net Sales\nThe following table shows the Companys disaggregated net sales by product type:\nSchedule of disaggregated net sales\nFiscal years ended June 30,\nMobile banking technology revenue $ 140,000 $ 90,000\nOther revenue, management fee - related party 216,000 263,000\nTotal revenue $ 356,000 $ 353,000\nThe following table shows the Companys disaggregated net sales by customer type:\nFiscal years ended June 30,\nMedical $ 46,000 $ 53,000\nAssociations 12,000 12,000\nEducation 12,000 12,000\nBanking 50,000 -\nOther 20,000 13,000\nOther revenue, management fee related party 216,000 263,000\nTotal revenue $ 356,000 $ 353,000\nMobile banking technology revenues during the year ended June 30, 2023 included the aggregate fees of $50,000 recognized as revenue under the agreements entered into by the Company with Nugen Universe, LLC in July 2022 and October 2022 (see Note 9). During the years ended June 30, 2023 and 2022, all of the Companys Mobile banking technology revenues were earned in the United States of America.\nOther revenue, management fee - related party revenue was $216,000 and $263,000 for the years ended June 30, 2023 and 2022, respectively, and realized from our management services agreement with The Matthews Group, a related party, which requires us to manage The Matthews Groups barcode technology operations. The Matthews Groups barcode technology customers are primarily manufacturing companies located in China.\nIncome Taxes\nThe Company accounts for income taxes using the asset and liability method whereby deferred tax assets are recognized for deductible temporary differences, and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nLoss per Common Share\nBasic earnings (loss) per share are computed by dividing the net income (loss) applicable to Common Stockholders by the weighted average number of shares of Common Stock outstanding during the year. Diluted earnings (loss) per share is computed by dividing the net income (loss) applicable to Common Stockholders by the weighted average number of common stock outstanding plus the number of additional common stock that would have been outstanding if all dilutive potential common stock had been issued, using the treasury stock method.\nFor the years ended June 30, 2023 and 2022, the calculations of basic and diluted loss per share are the same because potential dilutive securities would have an anti-dilutive effect.\nAs of June 30, 2023 and 2022, we excluded the outstanding securities summarized below, which entitle the holders thereof to acquire shares of common stock, from our calculation of earnings per share, as their effect would have been anti-dilutive.\nSchedule of calculation of earnings per share\nJune 30,\nSeries H Preferred Stock 10,000 10,000\nConvertible Notes Payable 27,901,581 25,677,568\nOptions 900,000 900,000\nTotal 28,811,581 26,587,568\nFair Value of Financial Instruments\nThe Company determines the fair value of its assets and liabilities based on the exchange price in U.S. dollars that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value maximize the use of observable inputs and minimize the use of unobservable inputs. The Company uses a fair value hierarchy with three levels of inputs, of which the first two are considered observable and the last unobservable, to measure fair value:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Inputs, other than Level 1, that are observable, either directly or indirectly, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe carrying amounts of financial instruments such as cash, accounts receivable, and accounts payable and accrued liabilities, approximate the related fair values due to the short-term maturities of these instruments. The carrying values of convertible and notes payable approximate their fair values due to the fact that the interest rates on these obligations are based on prevailing market interest rates.\nConcentrations\nDuring the year ended June 30, 2023, the Company had three customers, that represented 61% (a related party), 14% and 13% of our revenues, respectively. During the year ended June 30, 2022, the Company had two customers, that represented 75% (a related party) and 15% of our revenues, respectively. No other customer represented more than 10% of our revenues.\nSegments\nThe Company operates in one segment, the mobile financial banking industry. In accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in: economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes. Since the Company operates in one segment, all financial information required by Segment Reporting can be found in the accompanying consolidated financial statements.\nRecently Issued Accounting Standards\nIn June 2016, the FASB issued ASU No. 2016-13, Credit Losses - Measurement of Credit Losses on Financial Instruments (ASC 326). The standard significantly changes how entities will measure credit losses for most financial assets, including accounts and notes receivables. The standard will replace todays incurred loss approach with an expected loss model, under which companies will recognize allowances based on expected rather than incurred losses. Entities will apply the standards provisions as a cumulative-effect adjustment to retained earnings as of the beginning of the first reporting period in which the guidance is effective. As small business filer, the standard will be effective for us for interim and annual reporting periods beginning after December 15, 2022. The Company is currently assessing the impact of adopting this standard on the Companys financial statements and related disclosures.\nIn August 2020, the FASB issued ASU No. 2020-06 (ASU 2020-06) Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40). ASU 2020-06 reduces the number of accounting models for convertible debt instruments by eliminating the cash conversion and beneficial conversion models. The diluted net income per share calculation for convertible instruments will require the Company to use the if-converted method. For contracts in an entitys own equity, the type of contracts primarily affected by this update are freestanding and embedded features that are accounted for as derivatives under the current guidance due to a failure to meet the settlement conditions of the derivative scope exception. This update simplifies the related settlement assessment by removing the requirements to (i) consider whether the contract would be settled in registered shares, (ii) consider whether collateral is required to be posted, and (iii) assess shareholder rights. ASU 2020-06 is effective January 1, 2024, for the Company and the provisions of this update can be adopted using either the modified retrospective method or a fully retrospective method. Early adoption is permitted, but no earlier than January 1, 2021, including interim periods within that year. The Company is currently assessing the impact of adopting this standard on the Companys financial statements and related disclosures.\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt-Modifications and Extinguishments (Subtopic 470-50), Compensation-Stock Compensation (Topic 718), and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40): Issuers Accounting for Certain Modifications or Exchanges of Freestanding Equity-Classified Written Call Options. ASU 2021-04 provides clarification and reduces diversity in an issuers accounting for modifications or exchanges of freestanding equity-classified written call options (such as warrants) that remain equity classified after modification or exchange. An issuer measures the effect of a modification or exchange as the difference between the fair value of the modified or exchanged warrant and the fair value of that warrant immediately before modification or exchange. ASU 2021-04 introduces a recognition model that comprises four categories of transactions and the corresponding accounting treatment for each category (equity issuance, debt origination, debt modification, and modifications unrelated to equity issuance and debt origination or modification). ASU 2021-04 is effective for all entities for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. An entity should apply the guidance provided in ASU 2021-04 prospectively to modifications or exchanges occurring on or after the effective date. Early adoption is permitted for all entities, including adoption in an interim period. If an entity elects to early adopt ASU 2021-04 in an interim period, the guidance should be applied as of the beginning of the fiscal year that includes that interim period. The adoption of ASU 2021-04 did not have a material impact on the Companys financial statements or disclosures.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Company's present or future financial statements.\nNOTE 2 - GOING CONCERN\nThe accompanying Consolidated Financial Statements have been prepared assuming the Company will continue as a going concern, which contemplates the realization of assets and satisfaction of liabilities in the normal course of business. During the year ended June 30, 2023, the Company recorded a net loss of $1,234,000, used cash in operating activities of $499,000, and at June 30, 2023, the Company had a stockholders deficiency of $8,670,000. In addition, as of June 30, 2023, the Company is delinquent in payment of $767,000 of its convertible notes and notes payable. These factors, among others, raise substantial doubt about our ability to continue as a going concern within one year of the date that the financial statements are issued. The Companys financial statements do not include any adjustments that might result from the outcome of this uncertainty be necessary should we be unable to continue as a going concern.\nThe Company believes its cash and forecasted cash flow from operations will not be sufficient to continue operations through fiscal 2024 without continued external investment. Subsequent to June 30, 2023, the Company issued a $22,000 convertible promissory note to Van Tran, the Companys CEO/Executive Chair and a director, as additional working capital (see Note 12). The Company believes it will require additional funds to continue its operations through fiscal 2024 and to continue to develop its existing projects and plans to raise such funds by finding additional investors to purchase the Companys securities, generating sufficient sales revenue, implementing dramatic cost reductions or any combination thereof. There is no assurance that the Company can be successful in raising such funds, generating the necessary sales or reducing major costs. Further, if the Company is successful in raising such funds from sales of equity securities, the terms of these sales may cause significant dilution to existing holders of common stock. The consolidated financial statements do not include any adjustments that may result from this uncertainty.\nNOTE 3 -CONTINGENT EARNOUT LIABILITY\nOn September 30, 2014, the Company acquired certain assets and liabilities of the Tangible Payments LLC. A portion of the purchase price for Tangible Payments LLC was an earnout payment of $155,000. The earnout payment is payable on a monthly basis from the net profits derived from the acquired assets commencing three months after the closing. The earnout payment is accelerated and the balance of the earnout payment shall be due in full at such time as Veritec receives equity investments aggregating $1,300,000. For the years ended June 30, 2023 and 2022, there was no net profit derived from the acquired assets, and the Company had not yet received the required equity investments. Accordingly, no payments were made on the earnout.\nNOTE 4 - CONVERTIBLE NOTES AND NOTES PAYABLE\nConvertible notes and notes payable\nConvertible and notes payable includes principal and accrued interest and consist of the following at June 30, 2023 and June 30, 2022:\nSchedule of convertible and notes payable includes principal and accrued interest\nJune 30,\nJune 30,\n(a) Unsecured convertible notes ($21,000 and $20,000 in default) $ 66,000 $ 64,000\n(b) Notes payable (in default) 475,000 458,000\n(c) Notes payable (in default) 29,000 28,000\nTotal notes-third parties $ 570,000 $ 550,000\n(a) The notes are unsecured, convertible into common stock at amounts ranging from $0.08 to $0.30 per share, bear interest at rates ranging from 5% to 8% per annum, were due through 2011 and are in default or due on demand.\nAt June 30, 2021, convertible notes totaled $62,000. During the year ended June 30, 2022, interest of $2,000 was added to the principal resulting in a balance owed of $64,000 at June 30, 2022. During the year ended June 30, 2023, interest of $2,000 was added to the principal resulting in a balance owed of $66,000 at June 30, 2023. On June 30, 2023, $21,000 of the convertible notes were in default and convertible at a conversion price of $0.30 per share into 69,286 shares of the Companys common stock. The balance of $45,000 is due on demand and convertible at a conversion price of $0.08 per share into 567,180 shares of the Companys common stock.\n(b) The notes are either secured by the Companys intellectual property or unsecured and bear interest ranging from 6.5% to 10% per annum, were due in 2012, and are in default.\nAt June 30, 2021, the notes totaled $440,000. During the year ended June 30, 2022, interest of $18,000 was added to principal resulting in a balance owed of $458,000 at June 30, 2022. During the year ended June 30, 2023, interest of $17,000 was added to principal resulting in a balance owed of $475,000 at June 30, 2023. At June 30, 2023, $427,000 of notes are secured by the Companys intellectual property and $48,000 of notes are unsecured.\n(c) The notes are unsecured and bear interest of 4% per annum and were due on March 17, 2020 and are in default.\nAt June 30, 2021 the notes totaled $27,000. During the year ended June 30, 2022, interest of $1,000 was added to the principal resulting in a balance owed of $28,000 at June 30, 2022. During the year ended June 30, 2023, interest of $1,000 was added to the principal resulting in a balance owed of $29,000 at June 30, 2023.\nConvertible notes and notes payable-related parties\nConvertible and notes payable-related parties include principal and accrued interest and consist of the following at June 30, 2023 and June 30, 2022:\nSchedule of convertible and notes payable related parties\nJune 30,\nJune 30,\n(a) Convertible notes-The Matthews Group $ 1,970,000 $ 1,855,000\n(b) Notes payable-The Matthews Group 4,988,000 4,177,000\n(c)Convertible notes-other related parties ($242,000 and $233,000 in default) 364,000 321,000\nTotal notes-related parties $ 7,322,000 $ 6,353,000\n(a) The notes are unsecured, convertible into common stock at $0.08 per share, bear interest at rates ranging from 8% to 10% per annum and are due on demand.\nThe Matthews Group is a related party (see Note 8) and is owned 50% by Ms. Van Tran, the Companys CEO, and 50% by Larry Johanns, a significant shareholder of the Company. At June 30, 2021, convertible notes due to The Matthews Group totaled $1,741,000. During the year ended June 30, 2022, $114,000 of interest was added to principal, resulting in a balance payable of $1,855,000 at June 30, 2022. During the year ended June 30, 2023, $115,000 of interest was added to principal, resulting in a balance payable at June 30, 2023 of $1,970,000. At June 30, 2023, the notes are convertible at a conversion price of $0.08 per share into 24,621,824 shares of the Companys common stock.\n(b) The notes are unsecured, accrue interest at 10% per annum, and are due on demand. The notes were issued relating to a management services agreement with The Matthews Group (see Note 8) dated September 30, 2015.\nAt June 30, 2021, notes due to The Matthews Group totaled $3,375,000. During the year ended June 30, 2022, $503,000 of notes payable were issued and interest of $299,000 was added to principal, resulting in a balance owed of $4,177,000 at June 30, 2022. During the year ended June 30, 2023, $464,000 of notes payable were issued and interest of $347,000 was added to principal, resulting in a balance owed of $4,988,000 at June 30, 2023.\n(c) The notes are due to a current and a former director, are unsecured, convertible into common stock at per share amounts ranging from $0.04 to $0.30, and bear interest at rates ranging from 8% to 10% per annum.\nAt June 30, 2021, convertible notes due to other related parties totaled $308,000. During the year ended June 30, 2022, interest of $13,000 was added to principal resulting in a balance owed of $321,000 at June 30, 2022. During the year ended June 30, 2023, $30,000 of notes payable were issued and interest of $13,000 was added to principal, resulting in a balance owed of $364,000 at June 30, 2023. At June 30, 2023, $242,000 of the notes were due in 2010 and are in default, and $122,000 is due on demand. At June 30, 2023, $242,000 of the notes are convertible at a conversion price of $0.30 per share into 807,081 shares of the Companys common stock, $92,000 of the notes are convertible at a conversion price of $0.09 per share into 1,076,347 shares of the Companys common stock, and $30,000 of the notes are convertible at a conversion price of $0.04 per share into 759,863 shares of the Companys common stock .\nNOTE 5 - STOCKHOLDERS DEFICIENCY\nPreferred Stock\nThe articles of incorporation of Veritec authorize 10,000,000 shares of preferred stock with a par value of $1.00 per share. The Board of Directors is authorized to determine any number of series into which shares of preferred stock may be divided and to determine the rights, preferences, privileges, and restrictions granted to any series of the preferred stock.\nIn 1999, a new Series H convertible preferred stock was authorized. Each share of Series H convertible preferred stock is convertible into 10 shares of the Companys common stock at the option of the holder. As of June 30, 2023 and 2022, there were 1,000 shares of Series H convertible preferred stock issued and outstanding.\nCommon Stock to be Issued\nAt June 30, 2023 and 2022, 145,000 shares of common stock to be issued with an aggregate value of $12,000 have not been issued and are reflected as common stock to be issued in the accompanying consolidated financial statements.\nNOTE 6 - STOCK OPTIONS\nA summary of stock options as of June 30, 2023 and for the two years then ended is as follows:\nSchedule of stock options\nNumber of Shares Weighted - Average Exercise Price\nOutstanding at June 30, 2021 3,400,000 $ 0.08\nGranted - -\nForfeited (2,500,000 ) $ (0.08 )\nOutstanding at June 30, 2022 900,000 $ 0.03\nGranted - -\nForfeited\n$ -\nOutstanding at June 30, 2023 900,000 $ 0.03\nExercisable at June 30, 2023 900,000 $ 0.03\nAs of June 30, 2023, the Company had no outstanding unvested options with future compensation costs. The outstanding and exercisable stock options had no intrinsic value on June 30, 2023, and June 30, 2022, respectively.\nAdditional information regarding options outstanding as of June 30, 2023, is as follows:\nSchedule of additional information regarding options outstanding\nOptions Outstanding and Exercisable at June 30, 2023\nRange of Exercise Price Number of Shares Outstanding Weighted Average Remaining Contractual Life (Years) Weighted Average Exercise Price\n$ 0.03 900,000 2.48 $ 0.03\nNOTE 7 - INCOME TAXES\nFor the year ended June 30, 2023, net loss was $1,234,000, as compared to a net loss of $506,000 for the year ended June 30, 2022. For the years ended June 30, 2023 and 2022, no provision for income taxes was recorded.\nReconciliation between the expected federal income tax rate and the actual tax rate is as follows:\nSchedule of reconciliation between the federal and actual tax rate\nYear Ended June 30,\nFederal statutory tax rate 21 % 21 %\nState tax, net of federal benefit 6 % 6 %\nTotal tax rate 27 % 27 %\nAllowance (27 )% (27 )%\nEffective tax rate - % - %\nThe following is a summary of the deferred tax assets:\nSchedule of deferred tax assets\nYear Ended June 30,\nNet operating loss carryforwards $ 4,315,000 $ 3,982,000\nDeferred tax assets before valuation allowance 4,315,000 3,982,000\nValuation allowance (4,315,000 ) (3,982,000 )\nNet deferred tax asset $ - $ -\nThe Company has provided a valuation allowance on the deferred tax assets at June 30, 2023 and 2022 to reduce such asset to zero, since there is no assurance that the Company will generate future taxable income to utilize such asset. Management will review this valuation allowance requirement periodically and make adjustments as warranted. The net change in the valuation allowance for the year ended June 30, 2023, was an increase of $333,000.\nVeritec has net operating loss carryforwards of approximately $15,983,000 as of June 30, 2023 for federal purposes available to offset future taxable income that expires in varying amounts through 2044. The ability to utilize the net operating loss carryforwards could be limited by Section 382 of the Internal Revenue Code which limits their use if there is a change in control (generally a greater than 50% change in ownership). The Company is subject to examination by tax authorities for all years for which a loss carryforward is utilized in subsequent periods.\nThe Company follows FASB guidelines that address the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the financial statements. Under this guidance, we may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement. This guidance also provides guidance on derecognition, classification, interest, and penalties on income taxes, accounting in interim periods and requires increased disclosures. As of June 30, 2023 and 2022, the Company did not have a liability for unrecognized tax benefits, and no adjustment was required at adoption.\nThe Companys policy is to record interest and penalties on uncertain tax provisions as income tax expense. As of June 30, 2023 and 2022, the Company has no accrued interest or penalties related to uncertain tax positions.\nNOTE 8 - RELATED PARTY TRANSACTIONS\nThe Matthews Group is owned 50% by Ms. Tran, the Companys CEO/Executive Chair and a director, and 50% by Larry Johanns, a significant stockholder of the Company. The Company has relied on The Matthews Group for funding (see Note 4).\nManagement Services Agreement and Related Notes Payable with Related Party\nThe Companys Barcode Technology was invented by the founders of Veritec as a product identification system for identification and tracking of parts, components and products mostly in the liquid crystal display (LCD) markets and for secure identification documents, financial cards, medical records, and other high-security applications. On September 30, 2015, the Company sold all of its assets of its Barcode Technology comprised solely of its intellectual property to The Matthews Group. The Company then entered into a management services agreement with The Matthews Group to manage all facets of the barcode technology operations, on behalf of The Matthews Group, through June 30, 2024. The Matthews Group bears the risk of loss from the barcode operations and has the right to the residual benefits of the barcode operations.\nIn consideration of the services provided by the Company to The Matthews Group, the Company earned a fee of 35% of all revenues up to June 30, 2024, from the barcode technology operations. During the years ended June 30, 2023 and 2022, the Company recorded management fee revenue related to this agreement of $216,000 and $263,000, respectively.\nAdditionally, pursuant to the management services agreement, all cash flow (all revenues collected less direct costs paid) of the barcode technology operations is retained by the Company and reflected as proceeds from unsecured notes payable due The Matthews Group. During the years ended June 30, 2023 and 2022, cash flow loans of $464,000 and $503,000, respectively, were made to the Company at 10% interest per annum and due on demand. At June 30, 2023, cash flow loans of $4,988,000 are due to The Matthews Group (see Note 4).\nAdvances from Related Parties\nFrom time to time, Ms. Tran, the Companys CEO/Executive Chair, provides advances to finance the Companys working capital requirements. As of June 30, 2023 and 2022, total advances to Ms. Tran amounted to $119,000 and $102,000, respectively, and have been presented as accounts payable, related party on the accompanying Consolidated Balance Sheets. The advances are unsecured, non-interest bearing, and due on demand.\nOther Transactions with Related Parties\nThe Company leases its office facilities from Ms. Tran who owns the building, the Companys CEO/Executive Chair. For both the years ended June 30, 2023 and 2022, lease payments to Ms. Tran totaled $51,000.\nNOTE 9 - AGREEMENTS WITH NUGEN\nOn July 4, 2022, the Company entered a Memorandum of Understanding (the MOU) for the purpose of forming a strategic partnership between the Company and Nugen Universe, LLC (Nugen), a corporation located in Wrightsville Beach, North Carolina. Nugen seeks the Company to modify, create, or build a private label system for Nugen, with an initial interest in the Companys blinxPay technology and Bio-ID verification system. Nugen paid the Company $50,000 at the date of the MOU signing and during the year ended June 30, 2023, the Company completed its performance obligations, and recorded the $50,000 payment as Mobile banking technology revenue during the year ended June 30, 2023. Nugen further agreed to pay the Company a 5% ongoing royalty for licensing the Companys blinxPay technology and Bio-ID verification system. As of June 30, 2023, no royalties have been realized under the MOU.\nOn October 10, 2022, the Company entered into a License and Distributor Agreement (License Agreement) with Nugen. The License Agreement became effective on receipt of $200,000 in December 2022 and extends through August 31, 2027. The License Agreement grants Nugen a Worldwide license and distribution for the Companys blinxPay Close-Loop Virtual Wallet and blinxPay Open-Loop Visa Debit and all hardware products of the Company. Per the terms of the License Agreement, Nugen agrees to pay the Company a one-time license payment of $1,000,000 for the right to market the Companys products noted above, of which $200,000 was received by the Company in December 2022. The initial $200,000 has been recorded as deferred revenue in the Consolidated Balance Sheet. The deferred revenue balance of $200,000 at June 30, 2023, will begin being amortized to Mobile banking technology revenue starting once the Company has met its performance obligations under the License Agreement through the remaining term of the License Agreement, which expires on August 31, 2027. The remaining balance of $800,000 is scheduled to be paid as follows: $100,000 when the Companys identifies a domestic sponsor bank, $350,000 to integrate the Companys blinxPay software platform, and interface blinxPay with a sponsor foreign bank, and $350,000 on the completion of the final stage of testing, installation, and launch. In addition to the one-time license payment, Nugen agrees to pay a minimum monthly support fee plus 5% royalty from all sales of products noted above. As of June 30, 2023, no royalty related revenues have been realized under the License Agreement.\nNOTE 10 - LEGAL PROCEEDINGS\nOn September 21, 2016, the Company entered into a settlement agreement with an individual who was a former officer of the Company. The individual in prior years was also issued 500,000 shares of common stock for services. The Company alleged that the individual used the Company's intellectual property without approval. Under the terms of the settlement agreement, the individual agreed to relinquish a convertible note payable and unpaid interest aggregating $365,000 and return 500,000 shares of common stock previously issued to him. In turn, the Company agreed to release and discharge the individual against all claims arising on or prior to the date of the settlement agreement. As of June 30, 2023, the 500,000 shares have not been relinquished. When the Company receives the shares, it will record a cancellation of shares.\nNOTE 11 - COMMITMENTS AND CONTINGENCIES\nOn March 26, 2022, as amended on May 10, 2022, the Company and Es Solo Holdings Ltd (Es Solo), an England & Wales limited liability company, entered into a Prepaid Card Client Program Management Agreement (Management Agreement). Es Solo develops, markets, and operates prepaid card programs through its affiliations with issuing banks, and the Company desires to have Es Solo develop a prepaid card program to be marketed by the Company for card issuing purposes, pursuant to the terms of the Management Agreement. Es Solo agreed to pay the Company $10,000 as a program setup fee. The Company and Es Solo agreed to a 50%/50% revenue share arrangement based on fees collected from customers using the Companys prepaid, Bio-ID, and debit card products. As of June 30, 2023, no revenues have been realized under the Management Agreement.\nOn November 1, 2021, the Company and Elite Web Technology Inc. (Marketer) entered into a Sales and Marketing Agreement (Agreement). The Company agreed that Marketer can market and sale certain Company products as defined in the Agreement. The Company agreed to pay Marketer a sales commission of 15% of gross revenues, and to set aside 500,000 shares of Company common stock, as a bonus, once Marketer achieves $2 million in gross revenues within the first year of the Agreement. In addition, the Company will issue 25,000 stock options for each additional $1.0 million of gross revenues. As of June 30, 2023, the Marketer had not met any of its revenue targets and no commissions or equity compensation was due.\nOn December 5, 2008, the Company adopted an incentive compensation bonus plan to provide payments to key employees in the aggregated amount of 10% of pre-tax earnings in excess of $3,000,000 after the end of each fiscal year to be distributed annually to employees. As of June 30, 2023, the Company had not achieved annual pre-tax earnings in excess of $3,000,000.\nOn December 5, 2008, the Company entered into an employment agreement with Van Thuy Tran, its Chief Executive Officer, providing for an annual base salary of $150,000 and customary medical and other benefits. The agreement may be terminated by either party upon 30 days notice. In the event the Company terminates the agreement without cause, Ms. Tran will be entitled to $1,000,000 payable upon termination, and she will be entitled to severance equal to 12 months compensation and benefits. The Company has also agreed to indemnify Ms. Tran against any liability or damages incurred within the scope of her employment. During the years ended June 30, 2023 and 2022, salaries paid to Van Thuy Tran under this agreement totaled $150,000 and $150,000.\nNOTE 12 - SUBSEQUENT EVENTS\nOn July 23, 2023, the Company issued a $22,000 convertible promissory note to Van Thuy Tran, its Chief Executive Officer. The convertible note is due upon demand, is unsecured, convertible into common stock at a per share amount of $0.04, and bears interest at a rate of 10% per annum. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of disclosure controls and procedures\nBased upon an evaluation of the effectiveness of our disclosure controls and procedures performed by our Chief Executive Officer as of the end of the period covered by this report, our Chief Executive Officer concluded that our disclosure controls and procedures have not been effective as a result of a weakness in the design of internal control over financial reporting identified below.\nAs used herein, disclosure controls and procedures mean controls and other procedures of our company that are designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act is accumulated and communicated to our management, including our principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f) under the Securities Exchange Act of 1934. Our Chief Executive Officer/Chief Accounting Officer conducted an evaluation of the effectiveness of our control over financial reporting based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on managements evaluation under the framework, management has concluded that our internal control over financial reporting was not effective as of June 30, 2023.\nWe identified material weaknesses in our internal control over financial reporting primarily attributable to (i) lack of segregation of incompatible duties; and (ii) insufficient Board of Directors representation. These weaknesses are due to our inadequate staffing during the period covered by this report and our lack of working capital to hire additional staff. Management has retained an outside, independent financial consultant to record and review all financial data, as well as prepare our financial reports, in order to mitigate this weakness. Although management will periodically re-evaluate this situation, at this point it considers that the risk associated with such lack of segregation of duties and the potential benefits of adding employees to segregate such duties are not cost-justified. We intend to hire additional accounting personnel to assist with financial reporting as soon as our finances will allow.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit us to provide only managements report in this annual report.\nChanges in Internal Control over Financial Reporting\nNo changes in our internal control over financial reporting occurred during the year ended June 30, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, PROMOTERS, CONTROL PERSONS AND CORPORATE GOVERNANCE; COMPLIANCE WITH SECTION 16(A) OF THE EXCHANGE ACT\nAs of June 30, 2023, the members of the present Board of Directors and Officers are:\nName Office Age\nVan Thuy Tran Chief Executive Officer, Chairman of the Board, Treasurer\nLaird Powers Director\nEach director will serve until the next annual meeting of shareholders, or until their respective successors have been elected and duly qualified. Directors serve one-year terms. The Board of Directors appoints officers.\nMs. Van Thuy Tran is the Chief Executive Officer and Chairman of the Board. Ms. Tran controls a majority interest in the Company. She was President of Asia Consulting and Trading Company from 1979 to 1999, a company dealing with trade in the Pacific Rim countries. She is the co-founder of Circle of Love, providing mission work in Vietnam since 1993. She is the founder of Caring for Others, a non-profit organization with the vision of sharing what we have with others. She was the founder of Equal Partners, Inc., a construction and building company in Minnesota. Ms. Van Tran has a medical degree and worked in the medical field for over 17 years.\nLaird E. Powers is a member of the Board and is a private investor in emerging technology companies. He has been involved with the Company since its early stages in 1986. In addition, for the past 32 years, he is the president and owner of a construction company in Northern California. He holds a Bachelor of Science degree in Psychology with a Mathematics minor from California State University - Hayward.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection16(a) of the Securities Exchange Act of 1934 (the 34 Act) requires our officers and directors and persons owning more than ten percent of the Common Stock, to file initial reports of ownership and changes in ownership with the Securities and Exchange Commission (SEC). Additionally, Item 405 of Regulation S-K under the 34 Act requires us to identify in our Form 10-K and proxy statement those individuals for whom one of the above referenced reports was not filed on a timely basis during the most recent year or prior years. To the best of our knowledge, all required reports were filed.\nCommittee and Board Meetings\nNo meetings of our Board of Directors was held in fiscal 2023. The Audit Committee is currently comprised of one independent director who does qualify as an audit committee financial expert, as defined by the rules of the Securities and Exchange Commission and the NASDAQ Capital Market.\nDirector Independence\nEach of our current board of directors is independent under the revised listing standards of The NASDAQ Stock Market, Inc.\nCode of Ethics\nWe have adopted a code of ethics, which is available on our website at https://www.veritecinc.com/management-team. Our code of ethics applies to all of our employees, including our officers and directors. If our Board grants any waivers of, or amendments to, the code of ethics to any of our executive officers or directors, we will disclose these matters through our website.\nFamily Relationships\nNo family relationship has ever existed between any director, executive officer of the Company, and any person contemplated to become such.\nInvolvement in Certain Legal Proceedings\nOur directors, executive officers, and control persons have not been involved in any of the following events during the past five years:\n1. any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities; or\n4. being found by a court of competent jurisdiction (in a civil action), the Securities and Exchange Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nCorporate Governance\nWe are committed to having sound corporate governance principles. We believe that such principles are essential to running our business efficiently and to maintaining our integrity in the marketplace.\nThere have been no changes to the procedures by which stockholders may recommend nominees to our Board of Directors.\nDirector Qualifications\nWe believe that our directors should have the highest professional and personal ethics and values, consistent with our longstanding values and standards. They should have broad experience at the policy-making level in business or banking. They should be committed to enhancing stockholder value and should have sufficient time to carry out their duties and to provide insight and practical wisdom based on experience. Their service on other boards of public companies should be limited to a number that permits them, given their individual circumstances, to perform responsibly all director duties for us. Each director must represent the interests of all stockholders. When considering potential director candidates, the board of directors also considers the candidates character, judgment, diversity, age and skills, including financial literacy and experience in the context of our needs and the needs of the board of directors. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table summarizes all compensation for fiscal years 2023 and 2022 who was the only individual that served as a principal executive officer, and who was the only Named Executive Officer of the Company.\nName Year Salaries\n($) Bonus\n($) Stock Awards\n($) Option Awards\n($) All\nOther Compensation\n($) Total\n($)\nVan Thuy Tran\nChief Executive Officer $ 150,000 - - - - $ 150,000\nVan Thuy Tran\nChief Executive Officer $ 150,000 - - - - $ 150,000\nEmployment Agreements\nOn December 5, 2008, the Company entered into an employment agreement with Van Thuy Tran providing for an annual base salary of $150,000 and customary medical and other benefits. The agreement may be terminated by either party upon 30 days notice. In the event the Company terminates the agreement without cause, Ms. Tran will be entitled to $1,000,000 payable upon termination and entitled to severance equal to 12 months compensation and benefits. The Company has also agreed to indemnify Ms. Tran against any liability or damages incurred within the scope of her employment.\nDirector Compensation\nThe following table summarizes the compensation paid to our directors for the year ended June 30, 2023:\nName Year Fees Earned or Paid in Cash\n($) Bonus\n($) Stock Awards\n($) (3) Option Awards\n($) All\nOther Compensation\n($) Total\n($)\nVan Tran\nDirector and Chief Executive Officer (1) - - - - - -\nLaird Powers, Director (1) - - - - - -\n(1) Directors who are employed by the Company do not receive separate compensation for services on the Board of Directors. Members of the Board of Directors who are not employees of the Company currently receive no fees. In addition, members of the Board of Directors are reimbursed for any expenses incurred in attending the meetings.\nOutstanding Equity Awards at Fiscal Year End\nNone of our named executive officers has outstanding equity awards received as compensation, including unexercised options, stock that has not vested, or equity incentive plan awards, as of the end of the Company's last completed fiscal year. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information as of June 30, 2023 with respect to the holdings of: (1) each person known to us to be the beneficial owner of more than 5% of our Common Stock; (2) each of our directors, nominees for director and named executive officers; and (3) all directors and executive officers as a group. To the best of our knowledge, each of the persons named in the table below as beneficially owning the shares set forth therein has sole voting power and sole investment power with respect to such shares, unless otherwise indicated.\nExcept as otherwise indicated below, the persons named in the table have sole voting and investment power with respect to all shares of common stock held by them. Unless otherwise indicated, the principal address of each listed executive officer and director is 2445 Winnetka Avenue North, Golden Valley, MN 55427.\nName Number of Shares Beneficially Owned Percent of Shares\nLaird Powers 252,984 0.6 %\nVan Thuy Tran 229,250 0.6 %\nAll Officers and Directors as a group (3 persons) 482,234 1.2 %\nThe Matthews Group LLC (1) 29,352,547 73.4 %\n(1) The above shares include 50% of the shares owned or issuable to The Matthews Group. Van Thuy Tran and Lawrence J. Johanns each own 50% of The Matthews Group. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe Company's transactions with its officers, directors, and affiliates have been, and such future transactions will be, on terms no less favorable to the Company than could have been realized by the Company in arms-length transactions with non-affiliated persons and will be approved by the board of directors.\nThe Matthews Group is owned 50% by Ms. Van Tran, the Companys CEO, Executive Chair, and a director, and 50% by Larry Johanns, a significant stockholder of the Company. The Company has relied on The Matthews Group for funding.\nManagement Services Agreement and Related Notes Payable with Related Party\nOn September 30, 2015, the Company sold all of its assets of its Barcode Technology comprised solely of its intellectual property to The Matthews Group. The Companys Barcode Technology was originally invented by the founders of Veritec as a product identification system for identification and tracking of parts, components and products mostly in the liquid crystal display (LCD) markets and for secure identification documents, financial cards, medical records and other high security applications. The Company has a management services agreement with The Matthews Group to manage all facets of the barcode technology operations, on behalf of The Matthews Group, through June 30, 2023. The Matthews Group bears the risk of loss from the barcode operations and has the right to the residual benefits of the barcode operations. In consideration, the Company earns a fee of 20% of all revenues up to May 31, 2017, and 35% of all revenues up to June 30, 2024, from the barcode technology operations. During the years ended June 30, 2023 and 2022, the Company recorded management fee revenue related to this agreement of $216,000 and $263,000, respectively. Pursuant to the management services agreement, all cash flow (all revenues collected less direct costs paid) of the barcode technology operations is retained by the Company as proceeds from unsecured notes payable due The Matthews Group. During the years ended June 30, 2023 and 2022, cash flow loans of $464,000 and $503,000, respectively, were made to the Company at 10% interest per annum and due on demand. At June 30, 2023, cash flow loans of $4,988,000 are due to The Matthews Group.\nAdvances from Related Parties\nAs of both June 30, 2023 and 2022, $119,000 and $102,000 of advances due to Ms. Van Tran have been presented as accounts payable, related party on the accompanying Consolidated Balance Sheets, respectively. The advances are unsecured, non-interest bearing, and due on demand.\nOther Transactions with Related Parties\nThe Company leases its office facilities from Ms. Tran, who owns the building. For both the years ended June 30, 2023 and 2022, lease payments to Ms. Van Tran totaled $51,000. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table sets forth the fees billed to the Company for professional services rendered by the Companys independent registered public accounting firm, for the years ended June 30, 2023 and 2022:\nFees\nWeinberg & Company, CPAs\nAudit fees $ 72,000 $ 43,000\nAudit Related fees - -\nTax fees - -\nAll other fees - -\nTotal Fees $ 72,000 $ 43,000\nAudit Fees: Consist of fees billed for professional services rendered for the audits of our financial statements and reviews of our interim consolidated financial statements included in quarterly reports.\nPART IV Item 15. EXHIBITS\nExhibit Number Ref Description of Document\n3.1\nRestated Articles of Incorporation of Veritec, Inc. dated May 3, 1997 (incorporated by reference to Exhibit 3(i) to Veritecs Quarterly Report on Form 10QSB for the quarter ended March 31, 2007, as filed on May 15, 2007).\n3.2\nBylaws of Veritec, Inc. (incorporated by reference to Exhibit 3(ii) to Veritecs Quarterly Report on Form 10QSB for the quarter ended December 31, 2006, as filed on February 14, 2007).\n31.1 * Certification of Principal Executive Officer and Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1 * Certification of Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS * XBRL Instance Document\n101.SCH * XBRL Taxonomy Extension Schema Document\n101.CAL * XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF * XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB * XBRL Taxonomy Extension Label Linkbase Document\n101.PRE * XBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith.\nItem 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15 (d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVERITEC, INC.\na Nevada corporation\nOctober 13, 2023 By: /s/ Van Thuy Tran\nVan Thuy Tran\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ VAN THUY TRAN Chief Executive Officer and Chairman of the Board of Directors (Principal Executive Officer) October 13, 2023\nVan Thuy Tran\n/s/ LAIRD POWERS Director October 13, 2023\nLaird Powers"
}