{
    "cik": "779544",
    "company": "ARK RESTAURANTS CORP",
    "filing_type": "10-K",
    "filing_date": "2022-12-20",
    "period_of_report": "2022-10-01",
    "sic": "5812",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0928",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/779544/0000779544-22-000043-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/779544/000077954422000043/arkr-20221001.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/779544/0000779544-22-000043.txt",
    "filename": "779544_10K_2022_0000779544-22-000043.htm",
    "content": "Item 1. Business\nCOVID-19 Pandemic and Inflation\nRecent global events, including the COVID-19 pandemic (\"COVID-19\"), have adversely affected global economies, disrupted global supply chains and labor force participation and created significant volatility and disruption of financial markets.\nWe experienced significant and variable disruptions to our business as federal, state and local restrictions were mandated, among other remedial measures, to mitigate the spread of the COVID-19 virus. During fiscal 2021, most of our restaurants operated with no restrictions on indoor dining, although there was a significant reduction in guest traffic at our restaurants due to changes in consumer behavior as public health officials encouraged social distancing. While restrictions on the type of permitted operating model and occupancy capacity may continue to change, during fiscal 2022 all of our restaurants operated with no restrictions.\nDuring fiscal 2022, in addition to the associated impact of COVID-19, our operating results have been impacted by geopolitical and other macroeconomic factors, leading to increased commodity and wage inflation and other increased costs. The ongoing effects of COVID-19 and its variants, along with other geopolitical and macroeconomic events, could lead to further government mandates, including but not limited to capacity restrictions, shifts in consumer behavior, wage inflation, staffing challenges, product and services cost inflation and disruptions in our supply chain. If these factors significantly impact our cash flow in the future, we may again implement mitigation actions such as suspending dividends, increasing borrowings or modifying our operating strategies. Some of these measures may have an adverse impact on our business, including possible impairments of assets.\nOverview\nWe are a New York corporation formed in 1983. As of the fiscal year ended October 1, 2022, we owned and/or operated 17 restaurants and bars, 16 fast food concepts and catering operations through our subsidiaries. Four of our restaurant and bar facilities are located in New York City, one is located in Washington, D.C., five are located in Las Vegas, Nevada, one is located in Atlantic City, New Jersey, four are located on the east coast of Florida and two are located on the gulf coast of Alabama.\nOur restaurants are typically larger, destination properties intended to benefit from high patron traffic attributable to the uniqueness of the location and catered events. All of our expansion in recent years has been through acquisitions as follows: The Rustic Inn in Dania Beach, Florida (2014); Shuckers in Jensen Beach, Florida (2016); two Original Oyster Houses, one in Gulf Shores, Alabama and one in Spanish Fort, Alabama (2017), JB's on the Beach in Deerfield Beach, Florida (2019), and Blue Moon Fish Company (2021) in Lauderdale-by-the-Sea, Florida.\nThe names and themes of each of our restaurants are different except for our two Broadway Burger Bar and Grill restaurants and two Original Oyster House restaurants. The menus in our restaurants are extensive, offering a wide variety of high-quality foods at generally moderate prices. The atmosphere at many of the restaurants is lively and extremely casual. Most of the restaurants have separate bar areas, are open seven days a week and most serve lunch as well as dinner. A majority of our net sales are derived from dinner as opposed to lunch service.\nWhile decor differs from restaurant to restaurant, interiors are marked by distinctive architectural and design elements which often incorporate dramatic interior open spaces and extensive glass exteriors. The wall treatments, lighting and decorations are typically vivid, unusual and, in some cases, highly theatrical.\nThe following table sets forth the restaurant properties we lease, own and operate as of October 1, 2022:\nName Location Year\nOpened(1)\nRestaurant Size\n(Square Feet)\nSeating\nCapacity(2)\nIndoor-\n(Outdoor)\nLease\nExpiration(3)\nSequoia Washington Harbour\nWashington, D.C. 1990 26,000 600 (400) 2035\nBryant Park Grill & Café Bryant Park\nNew York, New York 1995 25,000 180 (820) 2025\nAmerica New York-New York\nHotel and Casino\nLas Vegas, Nevada 1997 20,000 450 2034\nGallaghers Steakhouse New York-New York\nHotel and Casino\nLas Vegas, Nevada 1997 5,500 260 2033\nGonzalez y Gonzalez New York-New York\nHotel and Casino\nLas Vegas, Nevada 1997 2,000 120 2034\nBroadway Burger Bar and Grill New York-New York\nHotel and Casino\nLas Vegas, Nevada 2007 1,500 100 2034\nVillage Eateries (4) New York-New York\nHotel and Casino\nLas Vegas, Nevada 1997 6,300 400 (*) 2035\nYolos Planet Hollywood\nResort and Casino\nLas Vegas, Nevada 2007 4,100 206 2026\nRobert Museum of Arts & Design\nNew York, New York 2009 5,530 150 2035\nBroadway Burger Bar and Grill Tropicana Hotel and Casino\nAtlantic City, New Jersey 2013 6,825 225 2033\nThe Rustic Inn Dania Beach, Florida 2014 16,150 575 (75) Owned\nThe Porch at Bryant Park (5) Bryant Park\nNew York, New York 2015 2,240 - (160) 2025\nShuckers Jensen Beach, Florida 2016 7,310 220 (170) Owned\nThe Original Oyster House Gulf Shores, Alabama 2017 9,230 300 Owned\nThe Original Oyster House Spanish Fort, Alabama 2017 10,500 420 Owned\nJB's on the Beach Deerfield Beach, Florida 2019 10,000 365 (100) 2044\nBlue Moon Fish Company Lauderdale-by-the-Sea, Florida 2021 4,800 240 (30) 2046\n__________________________________\n(1)Restaurants are, from time to time, renovated, renamed and/or converted from or to managed or owned facilities. Year Opened refers to the year in which we, or an affiliated predecessor of us, first opened, acquired or began managing a restaurant at the applicable location, notwithstanding that the restaurant may have been renovated, renamed and/or converted from or to a managed or owned facility since that date.\n(2)Seating capacity refers to the seating capacity of the indoor part of a restaurant available for dining in all seasons and weather conditions. Outdoor seating capacity, if applicable, is set forth in parentheses and refers to the seating capacity of terraces and sidewalk cafes which are available for dining only in the warm seasons and then only inclement weather.\n(3)Assumes the exercise of all of our available lease renewal options.\n(4)We operate six small food court restaurants and one full-service restaurant in the Village Eateries food court at the New York-New York Hotel and Casino. We also operate that hotels room service, banquet facilities and employee cafeteria.\n(5)This location is for a kiosk located at Bryant Park, New York, NY and all seating is outdoors.\n(*)Represents common area seating.\nThe following table sets forth our less than wholly-owned properties that are managed by us, which have been consolidated as of October 1, 2022 - see Notes 1 and 2 to the Consolidated Financial Statements:\nName Location Year\nOpened(1)\nRestaurant Size\n(Square Feet)\nSeating\nCapacity(2)\nIndoor-\n(Outdoor)\nLease\nExpiration(3)\nEl Rio Grande (4)(5) Third Avenue\n(between 38th and 39th Streets)\nNew York, New York 1987 4,000 220 (60) 2029\nTampa Food Court (6)(7) Hard Rock Hotel and Casino\nTampa, Florida 2004 4,000 250 (*) 2029\nHollywood Food Court (6)(7) Hard Rock Hotel and Casino\nHollywood, Florida 2004 9,000 250 (*) 2029\n__________________________________\n(1)Restaurants are, from time to time, renovated, renamed and/or converted from or to managed or owned facilities. Year Opened refers to the year in which we, or an affiliated predecessor of us, first opened, acquired or began managing a restaurant at the applicable location, notwithstanding that the restaurant may have been renovated, renamed and/or converted from or to a managed or owned facility since that date.\n(2)Seating capacity refers to the seating capacity of the indoor part of a restaurant available for dining in all seasons and weather conditions. Outdoor seating capacity, if applicable, is set forth in parentheses and refers to the seating capacity of terraces and sidewalk cafes which are available for dining only in the warm seasons and then only inclement weather.\n(3)Assumes the exercise of all our available lease renewal options.\n(4)Management fees earned, which have been eliminated in consolidation, are based on a percentage of cash flow of the restaurant.\n(5)We own a 19.2% interest in the partnership that owns El Rio Grande.\n(6)Management fees earned, which have been eliminated in consolidation, are based on a percentage of gross sales of the restaurant.\n(7)We own a 64.4% interest in the partnership that owns the Tampa and Hollywood Food Courts.\n(*)Represents common area seating\nLeases\nWe are not currently committed to any significant development projects, except for the refresh obligations in connection with the New York-New York Hotel and Casino lease renewals discussed below; however, we may take advantage of opportunities we consider to be favorable, when they occur, depending upon the availability of financing and other factors.\nRestaurant Expansion and Other Developments\nOn April 8, 2022, the Company extended its lease for Gallagher's Steakhouse at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2032. In connection with the extension, the Company has agreed to spend a minimum of $1,500,000 to materially refresh the premises by April 30, 2023 (as extended from September 30, 2022 due to supply chain issues), subject to additional extensions as set out in the agreement.\nOn June 24, 2022, the Company extended its lease for America at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2033. In connection with the extension, the Company has agreed to spend a minimum of $4,000,000 to materially refresh the premises by December 31, 2024, subject to various extensions as set out in the agreement.\nOn July 21, 2022, the Company extended its lease for the Village Eateries at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2034. As part of this extension, the Broadway Burger Bar and Grill and Gonzalez y Gonzalez, were carved out of the Village Eateries footprint and the extended date for each of those two locations is December 31, 2033. In\nconnection with the extension, the Company has agreed to spend a minimum of $3,500,000 to materially refresh all three of these premises by June 30, 2023, subject to various extensions as set out in the agreement.\nThe above refresh obligations related to the New York-New York Hotel and Casino lease extensions are to be consistent with designs approved by the Landlord, which shall not be unreasonably withheld. We will continue to pay all rent as required by the leases without abatement during construction. Note that our substantial completion of work set forth in plans approved by the Landlord shall constitute our compliance with the requirements of the completion deadlines, regardless of whether or not the amount actually expended in connection therewith is less than the minimum.\nThe opening of a new restaurant is invariably accompanied by substantial pre-opening expenses and early operating losses associated with the training of personnel, excess kitchen costs, costs of supervision and other expenses during the pre-opening period and during a post-opening shake out period until operations can be considered to be functioning normally. The amount of such pre-opening expenses and early operating losses can generally be expected to depend upon the size and complexity of the facility being opened.\nOur restaurants generally do not achieve substantial increases in revenue from year to year, which we consider to be typical of the restaurant industry. To achieve significant increases in revenue or to replace revenue of restaurants that lose customer favor or which close because of lease expirations or other reasons, we would have to open additional restaurant facilities or expand existing restaurants. There can be no assurance that a restaurant will be successful after it is opened, particularly since in many instances we do not operate our new restaurants under a trade name currently used by us, thereby requiring new restaurants to establish their own identity.\nWe may take advantage of other opportunities we consider to be favorable, when they occur, depending upon the availability of financing and other factors.\nRecent Restaurant Dispositions\nOn July 5, 2022, the Company terminated its lease for Lucky 7 at the Foxwoods Resort Casino. The closure did not result in a material change to the Company's operations.\nInvestment in New Meadowlands Racetrack LLC\nOn March 12, 2013, the Company made a $4,200,000 investment in the New Meadowlands Racetrack LLC (NMR) through its purchase of a membership interest in Meadowlands Newmark, LLC, an existing member of NMR. On November 19, 2013, the Company invested an additional $464,000 in NMR through a purchase of an additional membership interest in Meadowlands Newmark, LLC resulting in a total ownership of 11.6% of Meadowlands Newmark, LLC, and an effective ownership interest in NMR of 7.4%, subject to dilution. In 2015, the Company invested an additional $222,000 in NMR and in February 2017 the Company invested an additional $222,000 in NMR, both as a result of capital calls, bringing its total investment to $5,108,000 with no change in ownership.\nIn addition to the Companys ownership interest in NMR, if casino gaming is approved at the Meadowlands and NMR is granted the right to conduct said gaming, the Company shall be granted the exclusive right to operate the food and beverage concessions in the gaming facility with the exception of one restaurant.\nIn conjunction with this investment, the Company, through a 97% owned subsidiary, Ark Meadowlands LLC (AM VIE), also entered into a long-term agreement with NMR for the exclusive right to operate food and beverage concessions serving the new raceway facilities (the Racing F&B Concessions) located in the new raceway grandstand constructed at the Meadowlands Racetrack in northern New Jersey. Under the agreement, NMR is responsible to pay for the costs and expenses incurred in the operation of the Racing F&B Concessions, and all revenues and profits thereof inure to the benefit of NMR. AM VIE receives an annual fee equal to 5% of the net profits received by NMR from the Racing F&B Concessions during each calendar year.\nOn April 25, 2014, the Company loaned $1,500,000 to Meadowlands Newmark, LLC. The note bears interest at 3%, compounded monthly and added to the principal, and is due in its entirety on January 31, 2024. The note may be prepaid, in whole or in part, at any time without penalty or premium. On July 13, 2016, the Company made an additional loan to Meadowlands Newmark, LLC in the amount of $200,000. Such amount is subject to the same terms and conditions as the original loan discussed above. The principal and accrued interest related to this note, after a $500,000 payment made in July 2021, in the amounts of $1,357,000 and $1,317,000, are included in Investment In and Receivable From New Meadowlands Racetrack in the consolidated balance sheets at October 1, 2022 and October 2, 2021, respectively.\nOn June 7, 2018, the New Jersey State Legislature voted to legalize sports betting at casinos and racetracks in the State. Pursuant to this legislation, NMR operates a sports book in partnership with FanDuel, a leading provider of daily fantasy sports.\nRestaurant Management\nEach restaurant is managed by its own manager and has its own chef. Food products and other supplies are purchased primarily from various unaffiliated suppliers, in most cases by our headquarters' personnel. Each of our restaurants has two or more assistant managers and sous chefs (assistant chefs). Financial and management control is maintained at the corporate level through the use of automated systems that include centralized accounting and reporting.\nPurchasing and Distribution\nWe strive to obtain quality menu ingredients, raw materials and other supplies and services for our operations from reliable sources at competitive prices. Substantially all menu items are prepared on each restaurants premises daily from scratch, using fresh ingredients. Each restaurants management determines the quantities of food and supplies required and then orders the items from local, regional and national suppliers on terms negotiated by our centralized purchasing staff. Restaurant-level inventories are maintained at a minimum dollar-value level in relation to sales due to the relatively rapid turnover of the perishable produce, poultry, meat, fish and dairy commodities that are used in operations.\nWe attempt to negotiate short-term and long-term supply agreements depending on market conditions and expected demand. However, we do not contract for long periods of time for our fresh commodities such as produce, poultry, meat, fish and dairy items and, consequently, such commodities can be subject to unforeseen supply and cost fluctuations. Independent food service distributors deliver most food and supply items daily to restaurants. The financial impact of the termination of any such supply agreements would not have a material adverse effect on our financial position. We believe that we have established stable long-term relationships with several key suppliers, particularly with respect to crabs and other shellfish. Nevertheless, as a result of global restrictions and the disruption in our product supply chain as a result of COVID-19, we have experienced, and may continue to experience, product supply delays from our third-party vendors and shortages of product supply.\nCompetition\nThe hospitality industry is highly competitive and is often affected by changes in taste and entertainment trends among the public, by local, national and economic conditions affecting spending habits, and by population and traffic patterns. We believe that the principal means of competition among restaurants include the location, type and quality of facilities and the type, quality and price of beverage and food served.\nOur restaurants compete directly or indirectly with many well-established competitors, both nationally and locally owned, some with substantially greater financial resources than we have. Their resources and market presence may provide advantages in marketing, purchasing and negotiating leases. We compete with other restaurant and retail establishments for sites and finding management personnel.\nEmployees\nAt December 10, 2022, we employed 1,901 persons (including employees at managed facilities), 339 of whom were full-time employees, and 1,562 of whom were part-time employees; 41 of whom were headquarters personnel, 172 of whom were restaurant management personnel, 650 of whom were kitchen personnel and 769 of whom were restaurant service personnel. A number of our restaurant service personnel are employed on a part-time basis. Changes in minimum wage levels may adversely affect our labor costs and the restaurant industry generally because a large percentage of restaurant personnel are paid at or slightly above the minimum wage. Our employees are not covered by any collective bargaining agreements.\nWe have experienced aggressive competition for talent, wage inflation and pressure to improve workplace conditions and benefits as a result of the COVID-19 pandemic. The pandemic itself has caused a shortage of labor for restaurant positions as concern over exposure to COVID-19 and other factors decreased the pool of available qualified talent for key roles. Our compensation packages may prove insufficient to attract and retain the best personnel in light of the challenges posed by the pandemic and wage pressures resulting from the labor shortage. Higher employee turnover levels or our failure to recruit and retain new restaurant employees in a timely manner could impact our ability to grow sales at existing restaurants or open new restaurants and result in higher than projected labor costs.\nGovernment Regulation\nWe are subject to various federal, state and local laws affecting our business. Each restaurant is subject to licensing and regulation by a number of governmental authorities that may include alcoholic beverage control, health, sanitation, environmental, zoning and public safety agencies in the state or municipality in which the restaurant is located. Difficulties in obtaining or failures to obtain the required licenses or approvals could delay or prevent the development and openings of new restaurants, or could disrupt the operations of existing restaurants.\nAlcoholic beverage control regulations require each of our restaurants to apply to a state authority and, in certain locations, county and municipal authorities for licenses and permits to sell alcoholic beverages on the premises. Typically, licenses must be renewed annually and may be subject to penalties, temporary suspension or revocation for cause at any time. Alcoholic beverage control regulations impact many aspects of the daily operations of our restaurants, including the minimum ages of patrons and employees consuming or serving such beverages; employee alcoholic beverages training and certification requirements; hours of operation; advertising; wholesale purchasing and inventory control of such beverages; seating of minors and the service of food within our bar areas; and the storage and dispensing of alcoholic beverages. State and local authorities in many jurisdictions routinely monitor compliance with alcoholic beverage laws. The failure to receive or retain, or a delay in obtaining, a liquor license for a particular restaurant could adversely affect our ability to obtain such licenses in jurisdictions where the failure to receive or retain, or a delay in obtaining, a liquor license occurred.\nThe New York State Liquor Authority must approve any transaction in which a shareholder of the licensee increases his holdings to 10% or more of the outstanding capital stock of the licensee and any transaction involving 10% or more of the outstanding capital stock of the licensee.\nWe are subject to dram-shop statutes in most of the states in which we have operations, which generally provide a person injured by an intoxicated person the right to recover damages from an establishment that wrongfully served alcoholic beverages to such person. We carry liquor liability coverage as part of our existing comprehensive general liability insurance. A settlement or judgment against us under a dram-shop statute in excess of liability coverage could have a material adverse effect on our operations.\nVarious federal and state labor laws govern our operations and our relationship with employees, including such matters as minimum wages, breaks, overtime, fringe benefits, safety, working conditions and citizenship requirements. We are also subject to the regulations of the Immigration and Naturalization Service. If our employees do not meet federal citizenship or residency requirements, their deportation could lead to a disruption in our work force. Significant government-imposed increases in minimum wages, paid leaves of absence and mandated health benefits, or increased tax reporting, assessment or payment requirements related to employees who receive gratuities could be detrimental to our profitability.\nOur facilities must comply with the applicable requirements of the Americans With Disabilities Act of 1990 (ADA) and related state statutes. The ADA prohibits discrimination on the basis of disability with respect to public accommodations and employment. Under the ADA and related state laws, when constructing new restaurants or undertaking significant remodeling of existing restaurants, we must make them more readily accessible to disabled persons.\nSeasonal Nature of Business\nOur business is highly seasonal; however, our broader geographical reach as a result of recent acquisitions mitigates some of the risk. For instance, the second quarter of our fiscal year, consisting of the non-holiday portion of the cold weather season in New York and Washington (January, February and March), is the poorest performing quarter; however, in recent years this has been partially offset by our locations in Florida as they experience increased results in the winter months. We achieve our best results during the warm weather, attributable to our extensive outdoor dining availability, particularly at Bryant Park in New York and Sequoia in Washington, D.C. (our largest restaurants) and our outdoor cafes. However, even during summer months these facilities can be adversely affected by unusually cool or rainy weather conditions. Our facilities in Las Vegas are indoor and generally operate on a more consistent basis throughout the year.\nAvailable Information\nWe make available free of charge through our Internet website, www.arkrestaurants.com, our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, statements of beneficial ownership of securities on Forms 3, 4 and 5 and amendments to these reports and statements filed or furnished pursuant to Section 13(a) and Section 16 of the Securities Exchange Act of 1934 as soon as reasonably practicable after such materials are electronically filed with, or furnished to, the United States Securities and Exchange Commission, or SEC.\nThe above information is also available at the SECs Office of Investor Education and Advocacy at United States Securities and Exchange Commission, 100 F Street, N.E., Washington, D.C. 20549-0213 or obtainable by calling the SEC at (800) 732-0330. In addition, the SEC maintains an Internet website at www.sec.gov, where the above information can be viewed.\nOur principal executive offices are located at 85 Fifth Avenue, New York, New York 10003, and our telephone number is (212) 206-8800. Unless the context specifically requires otherwise, the terms the Company, Ark, we, us and our mean Ark Restaurants Corp., a Delaware corporation, and its consolidated subsidiaries. Item 1A. Risk Factors\nNot applicable. Item 1B. Unresolved Staff Comments\nNot applicable. Item 2. Properties\nOur restaurant facilities and our executive offices, with the exception of The Rustic Inn in Dania Beach, Florida, Shuckers in Jensen Beach, Florida and the two Original Oyster House properties in Alabama, are occupied under leases. Most of our restaurant leases provide for the payment of base rents plus real estate taxes, insurance and other expenses and, in certain instances, for the payment of a percentage of our sales at such facility. As of October 1, 2022, these leases (including leases for managed restaurants) have terms (including any available renewal options) expiring as follows:\nFiscal Year Lease\nTerms Expire\nNumber of\nFacilities\n2023-2027 4\n2028-2032 3\n2033-2037 8\n2038-2042 -\n2043-2047 2\nOur executive, administrative and clerical offices are located in approximately 8,500 square feet of office space at 85 Fifth Avenue, New York, New York. Our lease for this office space expires in 2026 and contains two five-year extension options.\nFor information concerning our future minimum rental commitments under non-cancelable operating leases, see Note 9 of the Notes to Consolidated Financial Statements for additional information concerning our leases. Item 3. Legal Proceedings\nIn the ordinary course of our business, we are a party to various lawsuits arising from accidents at our restaurants and workers compensation claims, which are generally handled by our insurance carriers.\nOur employment of management personnel, waiters, waitresses and kitchen staff at a number of different restaurants has resulted in the institution, from time to time, of litigation alleging violation by us of employment discrimination laws. We do not believe that any of such suits will have a material adverse effect upon us, our financial condition or operations.\nExcept as otherwise provided below, the Company is not subject to pending legal proceedings, other than ordinary claims incidental to its business, which the Company does not believe will materially impact results of operations.\nOn May 1, 2018, two former tipped service workers (the Plaintiffs), individually and on behalf of all other similarly situated personnel, filed a putative class action lawsuit (the Complaint) against the Company and certain subsidiaries as well as certain officers of the Company (the Defendants). Plaintiffs alleged, on behalf of themselves and the putative class, that the Defendants violated certain of the New York State Labor Laws and related regulations. The Complaint sought unspecified monetary damages, together with interest, liquidated damages and attorney fees. In December 2020, the parties reached a settlement agreement resolving all issues alleged in the Complaint, which received final approval by the New York State Supreme Court in October 2022, for approximately the amount which was previously accrued. Under the terms of the court approved settlement agreement, settlement proceeds will be distributed to the Plaintiffs in the first quarter of fiscal year 2023. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market For The Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket for Our Common Stock\nOur common stock, $0.01 par value, is traded on the NASDAQ Capital Market under the symbol ARKR.\nAs of December 14, 2022 there were 29 holders of record of our common stock and approximately an additional 3,314 beneficial owners.\nDividend Policy\nOn May 11, 2022, August 10, 2022 and November 9, 2022, the Board of Directors (the \"Board\") of the Company declared quarterly cash dividends of $0.125 per share which were paid on June 13, 2022, September 13, 2022 and December 13, 2022 to the stockholders of record of each share of the Company's common stock at the close of business on May 31, 2022, August 31, 2022 and November 30, 2022. Future decisions to pay dividends, and the amount of any dividend, are at the discretion of the Board and will depend upon operating performance and other factors.\nPurchases of Equity Securities by Issuer and Affiliated Purchases\nNone\nRecent Sales of Unregistered Securities\nNone\nSecurities Authorized for Issuance under Equity Compensation Plans\nPrior to fiscal 2022, the Company had options outstanding under two stock option plans: the 2010 Stock Option Plan (the 2010 Plan) and the 2016 Stock Option Plan (the 2016 Plan). Options granted under both plans are exercisable at prices at least equal to the fair market value of such stock on the dates the options were granted and expire ten years after the date of grant.\nOn March 15, 2022, the shareholders of the Company approved the Ark Restaurants Corp. 2022 Stock Option Plan (the \"2022 Plan\"). Effective with this approval, the Company terminated the 2016 Plan along with the 63,750 authorized but unissued options under the 2016 Plan. Such termination did not affect any of the options previously issued and outstanding under the 2016 Plan, which remain outstanding in accordance with their terms. Under the 2022 Plan, 500,000 options were authorized for future grant and are exercisable at prices at least equal to the fair market value of such stock on the dates the options were granted. The options expire 10 years after the date of grant.\nDuring the year ended October 1, 2022, options to purchase 22,500 shares of common stock at an exercise price of $17.80 per share were granted to employees and directors of the Company (the \"2022 Grant\"). Such options are exercisable as to 25% of the shares commencing on the first anniversary of the date of grant and 25% each year thereafter. The grant date fair value of these stock options was $4.53 per share and totaled approximately $102,000.\nDuring the year ended October 2, 2021, options to purchase 110,500 shares of common stock at an exercise price of $10.65 per share were granted to employees and directors of the Company (the \"2021 Grant\"). Such options are exercisable as to 50% of the shares commencing on the second anniversary of the date of grant and as to 50% on the fourth anniversary of the date of grant. The grant date fair value of these stock options was $2.22 per share and totaled approximately $246,000.\nThe following is a summary of the securities issued and authorized for issuance under our Stock Option Plans at October 1, 2022:\nPlan Category (a) Number of\nsecurities to be\nissued upon\nexercise of\noutstanding\noptions, warrants\nand rights (b) Weighted -\naverage exercise\nprice of\noutstanding\noptions, warrants\nand rights (c) Number of securities\nremaining available for\nfuture issuance under equity\ncompensation plans\n(excluding securities\nreflected in column (a))\nEquity compensation plans approved by shareholders 544,125 $19.63 477,500\nEquity compensation plans not approved by shareholders (1)\nNone N/A None\nTotal 544,125 $19.63 477,500\nOf the 544,125 options outstanding as of October 1, 2022, 173,125 were held by the Companys officers and directors.\n(1)The Company has no equity compensation plans that were not approved by shareholders.\nThe Company also maintains a Section 162(m) Cash Bonus Plan. Under the Company's Section 162(m) Cash Bonus Plan, compensation paid in excess of $1,000,000 to any employee who is the chief executive officer, or one of the three highest paid executive officers on the last day of that tax year (other than the chief executive officer or the chief financial officer) is not tax deductible.\nStock Performance Graph\nThe graph set forth below compares the yearly percentage change in cumulative total shareholder return on the Companys common stock for the five-year period commencing September 30, 2017 and ending October 1, 2022 against the cumulative total return on the NASDAQ Market Index and a peer group comprised of those public companies whose business activities fall within the same standard industrial classification code as the Company. This graph assumes a $100 investment in the Companys common stock and in each index on September 30, 2017 and that all dividends paid by companies included in each index were reinvested.\nCumulative Total Return\n09/30/17 09/30/18 09/28/19 10/03/20 10/02/21 10/01/22\nArk Restaurants Corp. $100.00 $99.41 $91.17 $53.10 $71.54 $86.98\nNASDAQ Composite 100.00 125.17 125.82 177.36 231.03 170.38\nSIC Code 5812 - Eating & Drinking Places 100.00 111.90 138.17 142.80 174.89 155.75 Item 6. Selected Consolidated Financial Data\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nStatement Regarding Forward-Looking Disclosure\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Consolidated Financial Statements and related notes included under Item 8 of this annual report. This discussion contains forward-looking statements, which involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of certain factors, including but not limited to, those discussed elsewhere in this annual report. Please see the discussion of forward-looking statements at the beginning of this annual report under \"Special Note Regarding Forward-Looking Statements\".\nCOVID-19 Pandemic\nRecent global events, including the COVID-19 pandemic (\"COVID-19\"), have adversely affected global economies, disrupted global supply chains and labor force participation and created significant volatility and disruption of financial markets.\nWe experienced significant and variable disruptions to our business as federal, state and local restrictions were mandated, among other remedial measures, to mitigate the spread of the COVID-19 virus. During fiscal 2021, most of our restaurants operated with no restrictions on indoor dining, although there was a significant reduction in guest traffic at our restaurants due to changes in consumer behavior as public health officials encouraged social distancing. While restrictions on the type of permitted operating model and occupancy capacity may continue to change, during fiscal 2022 all of our restaurants operated with no restrictions.\nDuring fiscal 2022, in addition to the associated impact of COVID-19, our operating results have been impacted by geopolitical and other macroeconomic factors, leading to increased commodity and wage inflation and other increased costs. The ongoing effects of COVID-19 and its variants, along with other geopolitical and macroeconomic events, could lead to further government mandates, including but not limited to capacity restrictions, shifts in consumer behavior, wage inflation, staffing challenges, product and services cost inflation and disruptions in our supply chain. If these factors significantly impact our cash flow in the future, we may again implement mitigation actions such as suspending dividends, increasing borrowings or modifying our operating strategies. Some of these measures may have an adverse impact on our business, including possible impairments of assets.\nOverview\nAs of October 1, 2022, the Company owned and operated 17 restaurants and bars, 16 fast food concepts and catering operations, exclusively in the United States, that have similar economic characteristics, nature of products and service, class of customer and distribution methods. The Company believes it meets the criteria for aggregating its operating segments into a single reporting segment in accordance with applicable accounting guidance.\nAccounting Period\nOur fiscal year ends on the Saturday nearest September 30. We report fiscal years under a 52/53-week format. This reporting method is used by many companies in the hospitality industry and is meant to improve year-to-year comparisons of operating results. Under this method, certain years will contain 53 weeks. The fiscal years ended October 1, 2022 and October 2, 2021 both included 52 weeks.\nSeasonality\nThe Company has substantial fixed costs that do not decline proportionally with sales. Although our business is highly seasonal, our broader geographical reach as a result of recent acquisitions mitigates some of the risk. For instance, the second quarter of our fiscal year, consisting of the non-holiday portion of the cold weather season in New York and Washington (January, February and March), is the poorest performing quarter; however, in recent years this has been partially offset by our locations in Florida as they experience increased results in the winter months. We generally achieve our best results during the warm weather, attributable to our extensive outdoor dining availability, particularly at Bryant Park in New York and Sequoia in Washington, D.C. (our largest restaurants) and our outdoor cafes. However, even during summer months these facilities can be adversely affected by unusually cool or rainy weather conditions. Our facilities in Las Vegas are indoor and generally operate on a more consistent basis throughout the year.\nResults of Operations\nThe Companys operating income for the year ended October 1, 2022 increased 58.9% from $9,864,000 as compared to $6,207,000 for the year ended October 2, 2021. This increase resulted primarily from a 39.3% increase in revenues, as all of our restaurants were operating with no dining restrictions in the current period in comparison to the prior period as a result of government mandates in connection with the COVID-19 pandemic, partially offset by increases in commodity prices and other high-volume items caused by inflation, increased labor costs in connection with ongoing COVID-related labor challenges and percentage rents paid on higher sales in the current year.\nThe following table summarizes the significant components of the Companys operating results for the years ended October 1, 2022 and October 2, 2021, respectively:\nYear Ended Variance\nOctober 1,\n2022 October 2,\n2021 $ %\nREVENUES: (in thousands)\nFood and beverage sales $ 180,010 $ 128,988 $ 51,022 39.6 %\nOther revenue 3,664 2,882 782 27.1 %\nTotal revenues 183,674 131,870 51,804 39.3 %\nCOSTS AND EXPENSES:\nFood and beverage cost of sales 52,573 38,950 13,623 35.0 %\nPayroll expenses 60,000 42,579 17,421 40.9 %\nOccupancy expenses 22,181 14,747 7,434 50.4 %\nOther operating costs and expenses 21,823 16,044 5,779 36.0 %\nGeneral and administrative expenses 12,936 10,523 2,413 22.9 %\nGain on lease termination - (810) 810 N/A\nDepreciation and amortization 4,297 3,630 667 18.4 %\nTotal costs and expenses 173,810 125,663 48,147 38.3 %\nOPERATING INCOME $ 9,864 $ 6,207 $ 3,657 58.9 %\nRevenues\nDuring the year ended October 1, 2022, revenues increased 39.3% as compared to revenues for the year ended October 2, 2021. This increase resulted primarily from increased customer traffic at all of our properties as they are operating with no dining restrictions in the current period in comparison to the prior period where there were restrictions as a result of government mandates in connection with the COVID-19 pandemic combined with targeted menu price increases and in New York and Washington, D.C., strong revenues from our event business in the current period.\nFood and Beverage Same-Store Sales\nOn a Company-wide basis, same-store food and beverage sales increased 38.1% for the year ended October 1, 2022 as compared to the year ended October 2, 2021 as follows:\nYear Ended Variance\nOctober 1,\n2022 October 2,\n2021 $ %\n(in thousands)\nLas Vegas $ 55,364 $ 37,767 $ 17,597 46.6 %\nNew York 33,408 15,037 18,371 122.2 %\nWashington, D.C. 10,611 8,169 2,442 29.9 %\nAtlantic City, NJ 3,555 2,055 1,500 73.0 %\nAlabama 16,749 14,506 2,243 15.5 %\nFlorida 57,535 50,818 6,717 13.2 %\nSame-store sales 177,222 128,352 $ 48,870 38.1 %\nOther 2,788 636\nFood and beverage sales $ 180,010 $ 128,988\nThe increases in company-wide same-store sales for the year ended October 1, 2022 as compared to the prior year were driven primarily by increased customer traffic as a result of the impact of the COVID-19 pandemic on the prior period combined with targeted increases in menu pricing and a strong recovery in our event business in Washington, D.C. and New York City in the current period.\nOther food and beverage sales consist of current year for pre-acquisition periods of restaurants opened or acquired during the applicable period (Blue Moon Fish Company - see Liquidity and Capital Resources - Recent Expansion and Other Developments), sales related to properties that were closed (Clyde Frazier's Wine and Dine, Lucky 7 and Gallagher's Steakhouse and Gallagher's Burger Bar - see Liquidity and Capital Resources - Recent Restaurant Dispositions) and other adjustments and fees.\nPrior to the COVID-19 pandemic, our restaurants generally did not achieve substantial increases in revenue from year to year, which we consider to be typical of the restaurant industry. To achieve significant increases in revenue or to replace revenue of restaurants that lose customer favor or which close because of lease expirations or other reasons, we would have to open additional restaurant facilities or expand existing restaurants. There can be no assurance that a restaurant will be successful after it is opened, particularly since in many instances we do not operate our new restaurants under a trade name currently used by us, thereby requiring new restaurants to establish their own identity.\nOther Revenues\nIncluded in other revenues are purchase service fees which represent commissions earned by a subsidiary of the Company for providing purchasing services to other restaurant groups, as well as merchandise sales, license fees, property management fees and other rentals. The increase in other revenues for the year ended October 1, 2022 as compared to the year ended October 2, 2021 is primarily due to the impact of the COVID-19 pandemic in the prior year.\nCosts and Expenses\nCosts and expenses for the years ended October 1, 2022 and October 2, 2021 were as follows (in thousands):\nYear Ended\nOctober 1,\n2022 % to\nTotal Revenues Year Ended\nOctober 2,\n2021 % to\nTotal Revenues Increase\n(Decrease)\n$ %\nFood and beverage cost of sales $ 52,573 28.6 % $ 38,950 29.5 % $ 13,623 35.0 %\nPayroll expenses 60,000 32.7 % 42,579 32.3 % 17,421 40.9 %\nOccupancy expenses 22,181 12.1 % 14,747 11.2 % 7,434 50.4 %\nOther operating costs and expenses 21,823 11.9 % 16,044 12.2 % 5,779 36.0 %\nGeneral and administrative expenses 12,936 7.0 % 10,523 8.0 % 2,413 22.9 %\nGain on lease termination - - % (810) -0.6 % 810 N/A\nDepreciation and amortization 4,297 2.3 % 3,630 2.8 % 667 18.4 %\nTotal costs and expenses $ 173,810 $ 125,663 $ 48,147\nFood and beverage costs as a percentage of total revenues for the year ended October 1, 2022 decreased as compared to last year primarily as a result of targeted increases in menu pricing, changes in menu mix and a strong event business in Washington, D.C. and New York City in the current period, partially offset by increases in commodity prices and other high-volume items caused by inflation.\nPayroll expenses as a percentage of total revenues for the year ended October 1, 2022 increased as compared to last year primarily as a result of increased labor costs in connection with ongoing COVID-related labor challenges partially offset by increased volumes, targeted increases in menu pricing and changes in menu mix and a strong event business in Washington, D.C. and New York City in the current period.\nOccupancy expenses as a percentage of total revenues for the year ended October 1, 2022 increased as compared to last year primarily as a result of percentage rents paid on higher sales in the current period.\nOther operating costs and expenses as a percentage of total revenues for the year ended October 1, 2022 decreased as compared to last year as a result of the fixed nature of some of these expenses and lower sales in the prior period as a result of the COVID-19 pandemic, partially offset by increased maintenance at properties which was deferred as we were experiencing lower traffic in prior periods combined with higher restaurant-level professional fees in the current period.\nGeneral and administrative expenses (which relate solely to the corporate office in New York City) for the year ended October 1, 2022 increased as compared to last year primarily as a result of increased bonus accruals combined with salary reductions of corporate personnel in the prior period as a result of the impacts on our business from the COVID-19 pandemic.\nDepreciation and amortization expense for the year ended October 1, 2022 increased as compared to last year primarily as a result of assets placed in service in the current period.\nGain on Lease Termination\nOn September 1, 2021, the Company advised the landlord of Clyde Frazier's Wine and Dine that we would be closing the property permanently and terminating the lease. In connection with this notification, the Company recorded a gain of $810,000 during the year ended October 2, 2021 consisting of: (i) rent and other costs incurred in accordance with the termination provisions of the lease in the amount of $318,000, (ii) impairment of long-lived assets in the amount of $69,000 and (iii) the write-off of our security deposit in the amount of $121,000 offset by the write-off of ROU assets and related lease liabilities in the net amount of $1,318,000.\nImpairment loss from write-down of long-lived assets\nManagement continually evaluates unfavorable cash flows, if any, related to underperforming restaurants. Periodically it is concluded that certain properties have become impaired based on their existing and anticipated future economic outlook in their respective markets. In such instances, we may impair assets to reduce their carrying values to fair values. Estimated fair values of impaired properties are based on comparable valuations, cash flows and/or management judgment. Included in depreciation and amortization for the year ended October 2, 2021 is an impairment charge of $69,000 related to Clyde Frazier's Wine and Dine.\nIncome Taxes\nOur income tax expense, deferred tax assets and liabilities, and liabilities for uncertain tax positions reflect managements best estimate of current and future taxes to be paid. We are subject to income tax in numerous state taxing jurisdictions. Significant judgment and estimates are required in the determination of consolidated income tax expense. The provision for income taxes reflects federal income taxes calculated on a consolidated basis and state and local income taxes which are calculated on a separate entity basis.\nFor state and local income tax purposes, certain losses incurred by a subsidiary may only be used to offset that subsidiarys income, with the exception of the restaurants operating in the District of Columbia. Accordingly, our overall effective tax rate has varied depending on the level of income and losses incurred at individual subsidiaries.\nDeferred income taxes arise from temporary differences between the tax bases of assets and liabilities and their reported amounts in the consolidated financial statements, which will result in taxable or deductible amounts in the future. In evaluating our ability to recover our deferred tax assets in the jurisdiction from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax-planning strategies, and results of recent operations. The assumptions about future taxable income require the use of significant judgment and are consistent with the plans and estimates we are using to manage the underlying businesses.\nThe Inflation Reduction Act of 2022 (the Act) was signed into U.S. law on August 16, 2022. The Act includes various tax provisions, including an excise tax on stock repurchases, expanded tax credits for clean energy incentives, and a corporate alternative minimum tax that generally applies to U.S. corporations with average adjusted financial statement income over a three-year period in excess of $1 billion. The Company does not expect the Act to materially impact its financial statements.\nOn March 27, 2020, the CARES Act was enacted to provide economic relief to those impacted by the COVID-19 pandemic. In addition to the PPP loans, the CARES Act made various tax law changes including among other things (i) modifications to the federal net operating loss rules including permitting federal net operating losses incurred in 2018, 2019, and 2020 tax years to be carried back to the five preceding taxable years in order to generate a refund of previously paid income taxes, (ii) enhanced recoverability of AMT tax credit carryforwards, (iii) increased the limitation under Internal Revenue Code (\"IRC\") Section 163(j) for 2019 and 2020 to permit additional expensing of interest, and (iv) enacted a technical correction so that qualified improvement property can be immediately expensed under IRC Section 168(k).\nOn December 27, 2020, the Consolidated Appropriations Act of 2021 (CAA) was enacted and provided clarification on the tax deductibility of expenses funded with PPP loans as fully deductible for tax purposes. During the years ended October 1, 2022 and October 2, 2021, the Company recorded income of $2,420,000 and $10,400,000, respectively (including $65,000 and $84,000 of accrued interest, respectively), for financial reporting purposes related to the forgiveness of its PPP Loans. The forgiveness of these amounts is not taxable.\nAs a result of the CARES Act and the CAA, the Company carried back taxable losses from fiscal years 2020 and 2021 to generate a refund of previously paid income taxes. As a result of these carrybacks, the Company recorded income tax benefits as the taxable losses from fiscal 2020 and fiscal 2021 are being carried back to tax years in which the Company was subject to a higher federal corporate income tax rate. Included in Prepaid and Refundable Income Taxes at October 1, 2022 and October 2, 2021 is $1,360,000 and $3,766,000, respectively, related to these carryback claims.\nThe Companys overall effective tax rate in the future will be affected by factors such as the utilization of state and local net operating loss carryforwards, the generation of FICA tax credits and the mix of earnings by state taxing jurisdictions as Nevada does not impose a state income tax, as compared to the other major state and local jurisdictions in which the Company has operations. Our overall effective tax rate in the future will be affected by factors such as income earned by our VIEs, generation of FICA TIP credits and the mix of geographical income for state tax purposes as Nevada does not impose an income tax.\nLiquidity and Capital Resources\nOur primary source of capital has been cash provided by operations and, in recent years, bank and other borrowings to finance specific transactions, acquisitions and large remodeling projects. We utilize cash generated from operations to fund the cost of developing and opening new restaurants and smaller remodeling projects of existing restaurants we own. Consistent with many other restaurant operators, we typically use operating lease arrangements for our restaurants. In recent years we have been able to acquire the underlying real estate at several locations along with the restaurant operation. We believe that our operating lease arrangements provide appropriate leverage of our capital structure in a financially efficient manner. As of October 1, 2022, we\nhad a cash and cash equivalents balance of $23,439,000 and a certificate of deposit in the amount of $5,021,000 maturing in January 2023.\nWe experienced significant disruptions to our business as federal, state and local restrictions were mandated to mitigate the spread of the COVID-19 virus. While restrictions on the type of permitted operating model and occupancy capacity may continue to change, during fiscal 2022 all of our restaurants operated with no restrictions. During fiscal 2021, most of our restaurants operated with no restrictions on indoor dining, although there were impacts to our business from accelerating case counts. During fiscal 2022, along with the impacts of COVID-19, our operating results have been impacted by geopolitical and other macroeconomic factors, leading to increased commodity and wage inflation and other increased costs. The ongoing effects of COVID-19 and its variants, along with other geopolitical and macroeconomic events, could lead to further government mandates, including but not limited to capacity restrictions, shifts in consumer behavior, wage inflation, staffing challenges, product and services cost inflation and disruptions in the supply chain. If these factors significantly impact our cash flow in the future, we may again implement mitigation actions such as suspending dividends, increasing borrowings or modifying our operating strategies. Some of these measures may have an adverse impact on our business, including possible impairments of assets.\nThe Company had working capital of $4,210,000 at October 1, 2022 as compared to $2,572,000 at October 2, 2021. This increase resulted primarily from cash provided by operations offset by a change in our debt maturities in connection with conversion of our revolving credit borrowings to term loans and the resumption of the payment of dividends in June 2022. We believe that our existing cash balances and current banking facilities will be sufficient to meet our liquidity and capital spending requirements and finance our operating activities for at least the next 12 months.\nCash Flows for the Years Ended October 1, 2022 and October 2, 2021\nNet cash provided by operating activities for the year ended October 1, 2022 increased to $20,347,000 as compared to $9,294,000 for the year ended October 2, 2021. This increase was attributable to an increase in operating income as a result of the continued recovery from the COVID-19 pandemic and changes in net working capital primarily related to accounts receivable, inventory, prepaid, refundable and accrued income taxes and accounts payable and accrued expenses.\nNet cash used in investing activities for the years ended October 1, 2022 and October 2, 2021 was $(7,761,000) and $(3,450,000), respectively, and resulted primarily from purchases of fixed assets at existing restaurants and, in the current period, the purchase of a certificate of deposit in the amount of $5,000,000.\nNet cash used in financing activities for the years ended October 1, 2022 and October 2, 2021 was $(8,318,000) and $(3,559,000), respectively, and resulted primarily from principal payments on notes payable, the payment of distributions to non-controlling interest and, in the current period, the resumption of the payment of dividends, partially offset by proceeds from stock option exercises.\nOn May 11, 2022 and August 10, 2022, the Board of Directors (the \"Board\") of the Company declared quarterly cash dividends of $0.125 per share which were paid on June 13, 2022 and September 13, 2022 to the stockholders of record of each share of the Company's common stock at the close of business on May 31, 2022 and August 31, 2022. The payment of future dividends, and the amount of any dividend, is at the discretion of the Companys Board of Directors and is based on future earnings, cash flow, financial condition, capital requirements and other relevant factors.\nRestaurant Expansion and Other Developments\nOn April 8, 2022, the Company extended its lease for Gallagher's Steakhouse at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2032. In connection with the extension, the Company has agreed to spend a minimum of $1,500,000 to materially refresh the premises by April 30, 2023 (as extended from September 30, 2022 due to supply chain issues), subject to additional extensions as set out in the agreement.\nOn June 24, 2022, the Company extended its lease for America at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2033. In connection with the extension, the Company has agreed to spend a minimum of $4,000,000 to materially refresh the premises by December 31, 2024, subject to various extensions as set out in the agreement.\nOn July 21, 2022, the Company extended its lease for the Village Eateries at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2034. As part of this extension, the Broadway Burger Bar and Grill and Gonzalez y Gonzalez, were carved out of the Village Eateries footprint and the extended date for each of those two locations is December 31, 2033. In connection with the extension, the Company has agreed to spend a minimum of $3,500,000 to materially refresh all three of these premises by June 30, 2023, subject to various extensions as set out in the agreement.\nThe above refresh obligations related to the New York-New York Hotel and Casino lease extensions are to be consistent with designs approved by the Landlord which shall not be unreasonably withheld. We will continue to pay all rent as required by the leases without abatement during construction. Note that our substantial completion of work set forth in plans approved by the Landlord shall constitute our compliance with the requirements of the completion deadlines, regardless of whether or not the amount actually expended in connection therewith is less than the minimum.\nThe opening of a new restaurant is invariably accompanied by substantial pre-opening expenses and early operating losses associated with the training of personnel, excess kitchen costs, costs of supervision and other expenses during the pre-opening period and during a post-opening shake out period until operations can be considered to be functioning normally. The amount of such pre-opening expenses and early operating losses can generally be expected to depend upon the size and complexity of the facility being opened.\nOur restaurants generally do not achieve substantial increases in revenue from year to year, which we consider to be typical of the restaurant industry. To achieve significant increases in revenue or to replace revenue of restaurants that lose customer favor or which close because of lease expirations or other reasons, we would have to open additional restaurant facilities or expand existing restaurants. There can be no assurance that a restaurant will be successful after it is opened, particularly since in many instances we do not operate our new restaurants under a trade name currently used by us, thereby requiring new restaurants to establish their own identity.\nWe may take advantage of other opportunities we consider to be favorable, when they occur, depending upon the availability of financing and other factors.\nRecent Restaurant Dispositions\nOn July 5, 2022, the Company terminated its lease for Lucky 7 at the Foxwoods Resort Casino. The closure did not result in a material change to the Company's operations.\nInvestment in and Receivable from New Meadowlands Racetrack\nOn March 12, 2013, the Company made a $4,200,000 investment in the New Meadowlands Racetrack LLC (NMR) through its purchase of a membership interest in Meadowlands Newmark, LLC, an existing member of NMR. On November 19, 2013, the Company invested an additional $464,000 in NMR through a purchase of an additional membership interest in Meadowlands Newmark, LLC resulting in a total ownership of 11.6% of Meadowlands Newmark, LLC, and an effective ownership interest in NMR of 7.4%, subject to dilution. In 2015, the Company invested an additional $222,000 in NMR with no change in ownership. In February 2017, the Company funded its proportionate share ($222,000) of a $3,000,000 capital call bringing its total investment to $5,108,000 with no change in ownership.\nIn addition to the Companys ownership interest in NMR, if casino gaming is approved at the Meadowlands and NMR is granted the right to conduct said gaming, the Company shall be granted the exclusive right to operate the food and beverage concessions in the gaming facility with the exception of one restaurant.\nIn conjunction with this investment, the Company, through a 97% owned subsidiary, Ark Meadowlands LLC (AM VIE), also entered into a long-term agreement with NMR for the exclusive right to operate food and beverage concessions serving the new raceway facilities (the Racing F&B Concessions) located in the new raceway grandstand constructed at the Meadowlands Racetrack in northern New Jersey. Under the agreement, NMR is responsible to pay for the costs and expenses incurred in the operation of the Racing F&B Concessions, and all revenues and profits thereof inure to the benefit of NMR. AM VIE receives an annual fee equal to 5% of the net profits received by NMR from the Racing F&B Concessions during each calendar year.\nOn April 25, 2014, the Company loaned $1,500,000 to Meadowlands Newmark, LLC. The note bears interest at 3%, compounded monthly and added to the principal, and is due in its entirety on January 31, 2024. The note may be prepaid, in whole or in part, at any time without penalty or premium. On July 13, 2016, the Company made an additional loan to Meadowlands Newmark, LLC in the amount of $200,000. Such amount is subject to the same terms and conditions as the original loan as discussed above. The principal and accrued interest related to this note, after a $500,000 payment made in July 2021, in the amounts of $1,357,000 and $1,317,000, are included in Investment In and Receivable From New Meadowlands Racetrack in the consolidated balance sheets at October 1, 2022 and October 2, 2021, respectively.\nOn June 7, 2018, the New Jersey State Legislature voted to legalize sports betting at casinos and racetracks in the state. Pursuant to this legislation, NMR operates a sports book in partnership with FanDuel, a leading provider of daily fantasy sports.\nNotes Payable - Bank\nOn June 1, 2018, the Company refinanced (the \"Refinancing\") its then existing indebtedness with its current lender, Bank Hapoalim B.M. (BHBM), by entering into an amended and restated credit agreement (the Revolving Facility), which was to mature on May 19, 2022 (as extended). The Revolving Facility provided for total availability of the lesser of (i) $10,000,000 and (ii) $35,000,000 less the then aggregate amount of all indebtedness and obligations to BHBM. On July 26, 2021, all outstanding Revolver Borrowings, in the amount of $9,666,000, were converted to a promissory note with quarterly principal payments of $500,000 commencing on September 1, 2021, with a balloon payment of $2,166,000 on June 1, 2025. Such note bears interest at LIBOR plus 3.5% per annum. We expect that the LIBOR rate will be discontinued by June 30, 2023 and will continue to work with BHBM to identify a suitable replacement rate and amend our debt agreements to reflect this new reference rate accordingly. We do not expect the discontinuation of LIBOR as a reference rate in our debt agreements to have a material adverse effect on our financial position or materially affect our interest expense.\nBorrowings under the Revolving Facility, which include the promissory notes as discussed in Note 10 of the consolidated financial statements in the aggregate amount of $22,345,000, are secured by all tangible and intangible personal property (including accounts receivable, inventory, equipment, general intangibles, documents, chattel paper, instruments, letter-of-credit rights, investment property, intellectual property and deposit accounts) and fixtures of the Company. The loan agreements provide, among other things, that the Company meet minimum quarterly tangible net worth amounts, maintain a minimum fixed charge coverage ratio and meet minimum annual net income amounts. The loan agreements also contain customary representations, warranties and affirmative covenants as well as customary negative covenants, subject to negotiated exceptions on liens, relating to other indebtedness, capital expenditures, liens, affiliate transactions, disposal of assets and certain changes in ownership.\nPaycheck Protection Program Loans\nDuring the year ended October 3, 2020, subsidiaries (the Borrowers) of the Company received loan proceeds from several banks (the Lenders) in the aggregate amount of $14,995,000 (the PPP Loans) under the Paycheck Protection Program (the PPP) of the CARES Act, which was enacted March 27, 2020. In addition, during the 13 weeks ended April 3, 2021, one of our consolidated VIEs received a second draw PPP Loan in the amount of $111,000. The PPP Loans are evidenced by individual promissory notes of each of the Borrowers (together, the Notes) in favor of the Lender, which Notes bear interest at the rate of 1.00% per annum. Under the terms of the PPP Loans, some or all of the amounts thereunder, including accrued interest, may be forgiven if they are used for Qualifying Expenses as described in and in compliance with the CARES Act. While the Company and each Borrower believe that PPP Loan proceeds were used exclusively for Qualifying Expenses, it is unclear and uncertain whether the conditions for forgiveness of the remaining PPP Loans outstanding at October 1, 2022 will be met under the current guidelines of the CARES Act. Therefore, we cannot make any assurances that the Company, or any of the Borrowers, will be eligible for forgiveness of the remaining PPP Loans in the amount of $797,000, in whole or in part.\nDuring the years ended October 1, 2022 and October 2, 2021, $2,420,000 and $10,400,000, respectively (including $65,000 and $84,000 of accrued interest, respectively), of PPP Loans were forgiven. To the extent, if any, that any of the remaining PPP Loans are not forgiven, beginning one month following expiration of the Deferral Period, and continuing monthly for 10 months (the Maturity Date), each respective Borrower is obligated to make monthly payments of principal and interest to the Lender with respect to any unforgiven portion of the Notes, in such equal amounts required to fully amortize the principal amount outstanding on such Notes as of the last day of the applicable Deferral Period by the applicable Maturity Date.\nCritical Accounting Policies\nOur significant accounting policies are more fully described in Note 1 to our consolidated financial statements. While all of these significant accounting policies impact our financial condition and results of operations, we view certain of these policies as critical. Policies determined to be critical are those policies that have the most significant impact on our consolidated financial statements and require management to use a greater degree of judgment and estimates. Actual results may differ from those estimates.\nWe believe that given current facts and circumstances, it is unlikely that applying any other reasonable judgments or estimate methodologies would cause a material effect on our consolidated results of operations, financial position or cash flows for the periods presented in this report.\nBelow are listed certain policies that management believes are critical:\nRevenue Recognition\nWe recognize revenues when it satisfies a performance obligation by transferring control over a product or service to a restaurant guest or other customer. Revenues from restaurant operations are presented net of discounts, coupons, employee meals and complimentary meals and recognized when food, beverage and retail products are sold. Sales tax collected from customers is excluded from sales and the obligation is included in sales tax payable until the taxes are remitted to the appropriate taxing authorities. Catering service revenue is generated through contracts with customers whereby the customer agrees to pay a contract rate for the service. Revenues from catered events are recognized in income upon satisfaction of the performance obligation (the date the event is held) and all customer payments, including nonrefundable upfront deposits, are deferred as a liability until such time.\nRevenues from gift cards are deferred and recognized upon redemption. Deferrals are not reduced for potential non-use as we generally have a legal obligation to remit the value of unredeemed gift cards to the relevant jurisdictions in which they are sold.\nOther revenues include purchase service fees which represent commissions earned by a subsidiary of the Company for providing purchasing services to other restaurant groups, as well as license fees, property management fees and other rentals.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The accounting estimates that require managements most difficult and subjective judgments include allowances for potential bad debts on receivables, the useful lives and recoverability of its assets, such as property and intangibles, fair values of financial instruments and share-based compensation, the realizable value of its tax assets and determining when investment impairments are other-than-temporary. Because of the uncertainty in such estimates, actual results may differ from these estimates.\nLong-Lived Assets\nLong-lived assets, such as property, plant and equipment, and purchased intangibles subject to amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. In the evaluation of the fair value and future benefits of long-lived assets, management continually evaluates unfavorable cash flows, if any, related to underperforming restaurants. Periodically it is concluded that certain properties have become impaired based on their existing and anticipated future economic outlook in their respective markets. In such instances, we may impair assets to reduce their carrying values to fair values. Estimated fair values of impaired properties are based on comparable valuations, cash flows and/or management judgment. Management continually evaluates unfavorable cash flows, if any, related to underperforming restaurants. Periodically it is concluded that certain properties have become impaired based on their existing and anticipated future economic outlook in their respective markets. In such instances, we may impair assets to reduce their carrying values to fair values. Estimated fair values of impaired properties are based on comparable valuations, cash flows and/or management's judgment. Included in the year ended October 2, 2021 is an impairment charge of $69,000 related to Clyde Frazier's Wine and Dine.\nRecoverability of Investment in New Meadowlands Racetrack (NMR)\nThe carrying value of our investment in Meadowlands Newmark LLC, which has a 63.7% ownership in NMR, is determined using the cost method. In accordance with the cost method, our initial investment is recorded at cost and we record dividend income when applicable, if dividends are declared. We review our investment in NMR each reporting period to determine whether a significant event or change in circumstances has occurred that may have an adverse effect on its fair value.\nAs a result, we performed an assessment of the recoverability of our indirect investment in NMR as of October 1, 2022 which involved critical accounting estimates. These estimates require significant management judgment, include inherent uncertainties and are often interdependent; therefore, they do not change in isolation. Factors that management estimated include, among others, the probability of gambling being approved in northern New Jersey which is the most heavily weighted assumption and NMR obtaining a license to operate a casino, revenue levels, cost of capital, marketing spending, tax rates and capital spending.\nIn performing this assessment, we estimate the fair value of our investment in NMR using our best estimate of these assumptions which we believe would be consistent with what a hypothetical marketplace participant would use. The variability of these factors\ndepends on a number of conditions, including uncertainty about future events and our inability as a minority shareholder to control certain outcomes and thus our accounting estimates may change from period to period. If other assumptions and estimates had been used when these tests were performed, impairment charges could have resulted.\nAs mentioned above, these factors do not change in isolation and, therefore, we do not believe it is practicable or meaningful to present the impact of changing a single factor. Furthermore, if management uses different assumptions or if different conditions occur in future periods, future impairment charges could result.\nLeases\nWe determine if an arrangement contains a lease at inception. An arrangement contains a lease if it implicitly or explicitly identifies an asset to be used and conveys the right to control the use of the identified asset in exchange for consideration. As a lessee, we include operating leases in Operating lease right-of-use assets and Operating lease liabilities in our consolidated balance sheet. Right-of-use assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease right-of-use assets and liabilities are recognized upon commencement of the lease based on the present value of the lease payments over the lease term. As most of our leases do not provide an implicit interest rate, we use our incremental borrowing rate based on the information available at commencement date to determine the present value of lease payments. Our lease terms may include options to extend or terminate the lease. Options are included when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term. Amendments or modifications to lease terms are accounted for as variable lease payments. Leases with a lease term of 12 months or less are accounted for using the practical expedient which allows for straight-line rent expense over the remaining term of the lease.\nDeferred Income Tax Valuation Allowance\nWe provide such allowance due to uncertainty that some of the deferred tax amounts may not be realized. Certain items, such as state and local tax loss carryforwards, are dependent on future earnings or the availability of tax strategies. Future results could require an increase or decrease in the valuation allowance and a resulting adjustment to income in such period.\nGoodwill and Trademarks\nGoodwill and trademarks are not amortized, but are subject to impairment analysis. We assess the potential impairment of goodwill and trademarks annually (at the end of our fourth quarter) and on an interim basis whenever events or changes in circumstances indicate that the carrying value may not be recoverable. If we determine through the impairment review process that goodwill or trademarks are impaired, we record an impairment charge in our consolidated statements of income.\nSuch impairment analyses for goodwill requires a comparison of the fair value of the Companys equity to the carrying amount of goodwill since the Company operates in one segment. At October 1, 2022 and October 2, 2021, we performed qualitative assessments of factors to determine whether further impairment testing of goodwill was required. Based on this assessment, no impairment losses were warranted at October 1, 2022 and October 2, 2021. Qualitative factors considered in this assessment included industry and market considerations, overall financial performance and other relevant events, management expertise and stability at key positions. Additional impairment analyses at future dates may be performed to determine if indicators of impairment are present, and if so, such amount will be determined and the associated charge will be recorded to the consolidated statements of income.\nOur impairment analysis for trademarks consists of a comparison of the fair value to the carrying value of the assets. This comparison is made based on a review of historical, current and forecasted sales and profit levels, as well as a review of any factors that may indicate potential impairment. For the years ended October 1, 2022 and October 2, 2021, our impairment analysis did not result in any other charges related to trademarks.\nStock-Based Compensation\nThe Company measures stock-based compensation cost at the grant date based on the fair value of the award and recognizes it as expense over the applicable vesting period using the straight-line method. Excess income tax benefits related to share-based compensation expense that must be recognized directly in equity are considered financing rather than operating cash flow activities.\nThe fair value of each of the Companys stock options is estimated on the date of grant using a Black-Scholes option-pricing model that uses assumptions that relate to the expected volatility of the Companys common stock, the expected dividend yield of\nour stock, the expected life of the options and the risk-free interest rate. The Company issues new shares upon the exercise of employee stock options.\nRecently Adopted and Issued Accounting Standards\nSee Note 1 of Notes to Consolidated Financial Statements for a description of recent accounting pronouncements, including those adopted in fiscal 2022 and the expected dates of adoption and the anticipated impact on the consolidated financial statements.\nRecent Developments\nSee Note 17 of the Notes to Consolidated Financial Statements for a description of recent developments that have occurred subsequent to October 1, 2022. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot applicable. Item 8. Financial Statements and Supplementary Data\nOur consolidated financial statements are included in this report immediately following Part IV. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs of October 1, 2022 (the end of the period covered by this report), management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended). Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that, at the end of such period, our disclosure controls and procedures were effective and provided reasonable assurance that information required to be disclosed in our periodic SEC filings is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. However, in evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated can provide only reasonable assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of such possible controls and procedures.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Exchange Act Rule 13a-15(f), and for performing an assessment of the effectiveness of internal control over financial reporting as of October 1, 2022. Internal control over financial reporting is a process designed by, or under the supervision of, our principal executive and principal financial officers, or persons performing similar functions, and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U. S. generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagement performed an assessment of the effectiveness of our internal control over financial reporting as of October 1, 2022 based upon the criteria set forth in Internal Control - Integrated Framework issued by the 2013 Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on our assessment, management determined that our internal control over financial reporting was effective as of October 1, 2022.\nThis Annual Report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting as managements report was not subject to attestation by our independent registered public accounting firm pursuant to the permanent exemption of the SEC that permits us to provide only managements report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) that occurred during the fourth quarter of fiscal 2022 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nLimitations of the Effectiveness of Internal Control\nA control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the internal control system are met. Because of the inherent limitations of any internal control system, no evaluation of controls can provide absolute assurance that all control issues, if any, within a company have been detected. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nInformation relating to our directors and executive officers is incorporated by reference to the definitive proxy statement for our 2022 annual meeting of stockholders to be filed with the Securities and Exchange Commission (the SEC) pursuant to Regulation 14A no later than 120 days after the end of the fiscal year covered by this form (the Proxy Statement). Information relating to compliance with Section 16(a) of the Exchange Act is incorporated by reference to the Proxy Statement.\nCode of Ethics\nWe have adopted a code of ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, and persons performing similar functions. A copy is available free of charge through our Internet website, www.arkrestaurants.com, under the Investors-Corporate Governance caption. Item 11. Executive Compensation\nThe information required by this item is incorporated herein by reference to the Proxy Statement which will be filed no later than 120 days after October 1, 2022. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated herein by reference to the Proxy Statement which will be filed no later than 120 days after October 1, 2022. Item 13. Certain Relationships and Related Transactions\nThe information required by this item is incorporated herein by reference to the Proxy Statement which will be filed no later than 120 days after October 1, 2022. Item 14. Principal Accountant Fees and Services\nThe information required by this item is incorporated herein by reference to the Proxy Statement which will be filed no later than 120 days after October 1, 2022.\nPART IV Item 15. Exhibits and Financial Statement Schedule\n(a) (1) Financial Statements: Page\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets - at October 1, 2022 and October 2, 2021\nConsolidated Statements of Income - years ended October 1, 2022 and October 2, 2021\nConsolidated Statements of Changes in Equity - years ended October 1, 2022 and October 2, 2021\nConsolidated Statements of Cash Flows - years ended October 1, 2022 and October 2, 2021\nNotes to Consolidated Financial Statements\n(2) Financial Statement Schedules:\nNone.\n(3) Exhibits:\nThe exhibits required by Item 601 of Regulation S-K and filed herewith are listed in the Exhibit List immediately preceding the exhibits.\nReport of Independent Registered Public Accounting Firm\nThe Board of Directors and Shareholders\nArk Restaurants Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Ark Restaurants Corp. and Subsidiaries (the Company) as of October 1, 2022 and October 2, 2021, and the related consolidated statements of income, changes in shareholders equity, and cash flows for each of the years in the two-year period ended October 1, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of October 1, 2022 and October 2, 2021 and the results of its operations and its cash flows for each of the two years in the two-year period ended October 1, 2022 in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to Ark Restaurants Corp. in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nLong-lived Asset and Right-of-Use Asset Valuation (Note 1 to the Financial Statements)\nCritical Audit Matter\nLong-lived assets, such as property and plant and equipment subject to amortization, and right-of-use assets (\"ROU assets\") are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. In the evaluation of the fair value and future benefits of long-lived assets, the Company performs an analysis of the anticipated undiscounted future net cash flows of the related long-lived assets. If the carrying value of the related asset exceeds the undiscounted cash flows, the carrying value is reduced to its fair value. Various factors including estimated future sales growth and estimated profit margins are included in this analysis.\nThe Company considers a triggering event related to long-lived assets or ROU assets in a net asset position to have occurred related to a specific restaurant if the restaurants cash flows for the last 12 months are less than a minimum threshold or if\nprojected levels of undiscounted cash flows for the remaining lease period are less than the carrying value of the restaurants assets. Additionally, the Company considers a triggering event related to ROU assets to have occurred related to a specific lease if the location has been subleased and future estimated sublease income is less than current lease payments. If the Company concludes that the carrying value of certain long-lived and ROU assets will not be recovered based on expected undiscounted future cash flows, an impairment loss is recorded to reduce the long-lived or ROU assets to their estimated fair value.\nSignificant judgment is exercised by the Company in performing their long-lived asset and right-of-use asset impairment analysis specifically surrounding the development of undiscounted cash flow forecasts. The related audit effort in evaluating management's judgments in determining the cash flow forecasts to be utilized was complex, subjective, and challenging, and required a high degree of auditor judgment.\nHow our Audit Addressed the Critical Audit Matter\nOur principal audit procedures related to this critical audit matter included the following:\nWe gained an understanding of and evaluated the design and implementation of the Companys controls that address the risk of material misstatement related to potential impairment.\nWe evaluated management's significant accounting policies related to the consideration of impairment for long-lived assets for reasonableness.\nWe tested the reasonableness of the underlying data used to determine the forecasted future cash flows.\nWe evaluated the reasonableness of future cash flows utilized in the impairment analysis for the restaurants by comparing forecasted cash flows to historical cash flows from each restaurant location, and evaluating management's future operating forecasts.\nWe evaluated the reasonableness of management's estimate that no impairment charges were appropriate during the year.\n/s/ CohnReznick LLP PCAOB ID: 596\nWe have served as the Companys auditors since 2004.\nMelville, New York\nDecember 20, 2022\nARK RESTAURANTS CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In Thousands, Except Per Share Amounts)\nOctober 1,\n2022 October 2,\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents (includes $834 at October 1, 2022 and $785 at October 2, 2021\nrelated to VIEs)\n$ 23,439 $ 19,171\nCertificate of deposit, plus accrued interest 5,021 -\nAccounts receivable (includes $140 at October 1, 2022 and $358 at October 2, 2021\nrelated to VIEs)\n3,185 4,113\nEmployee receivables 440 380\nInventories (includes $38 at October 1, 2022 and $35 at October 2, 2021 related to VIEs)\n3,707 3,510\nPrepaid and refundable income taxes (includes $278 at October 1, 2022 and\nOctober 2, 2021 related to VIEs)\n1,778 3,896\nPrepaid expenses and other current assets (includes $17 at October 1, 2022 and $277 at\nOctober 2, 2021 related to VIEs)\n1,523 3,205\nTotal current assets 39,093 34,275\nFIXED ASSETS - Net (includes $212 at October 1, 2022 and $218 at October 2, 2021\nrelated to VIEs)\n34,682 36,174\nOPERATING LEASE RIGHT-OF-USE ASSETS - Net (includes $2,076 at October 1, 2022\nand $2,342 at October 2, 2021 related to VIEs)\n101,720 56,336\nINTANGIBLE ASSETS - Net 272 376\nGOODWILL 17,440 17,440\nTRADEMARKS 4,220 4,220\nDEFERRED INCOME TAXES 3,118 3,700\nINVESTMENT IN AND RECEIVABLE FROM NEW MEADOWLANDS RACETRACK 6,465 6,425\nOTHER ASSETS (includes $11 at October 1, 2022 and $82 at October 2, 2021 related to VIEs)\n2,524 2,270\nTOTAL ASSETS $ 209,534 $ 161,216\nLIABILITIES AND EQUITY\nCURRENT LIABILITIES:\nAccounts payable - trade (includes $135 at October 1, 2022 and $213 at October 2, 2021\nrelated to VIEs)\n$ 4,466 $ 4,886\nAccrued expenses and other current liabilities (includes $417 at October 1, 2022 and\n$374 at October 2, 2021 related to VIEs)\n16,312 13,679\nCurrent portion of operating lease liabilities (includes $272 at October 1, 2022 and $249 at\nOctober 2, 2021 related to VIEs)\n7,530 6,165\nCurrent portion of notes payable (includes $0 at October 1, 2022 and $95 at\nOctober 2, 2021 related to VIEs)\n6,575 6,973\nTotal current liabilities 34,883 31,703\nOPERATING LEASE LIABILITIES, LESS CURRENT PORTION (includes $1,921 at\nOctober 1, 2022 and $2,193 at October 2, 2021 related to VIEs)\n97,444 52,552\nNOTES PAYABLE, LESS CURRENT PORTION, net of deferred financing costs (includes\n$0 at October 1, 2022 and $101 at October 2, 2021 related to VIEs)\n17,089 25,509\nTOTAL LIABILITIES 149,416 109,764\nCOMMITMENTS AND CONTINGENCIES\nEQUITY:\nCommon stock, par value $0.01 per share - authorized, 10,000 shares; issued and\noutstanding, 3,600 shares at October 1, 2022 and 3,551 shares at October 2, 2021\n36 36\nAdditional paid-in capital 15,493 14,492\nRetained earnings 44,271 35,884\nTotal Ark Restaurants Corp. shareholders equity 59,800 50,412\nNON-CONTROLLING INTERESTS 318 1,040\nTOTAL EQUITY 60,118 51,452\nTOTAL LIABILITIES AND EQUITY $ 209,534 $ 161,216\nSee notes to consolidated financial statements.\nARK RESTAURANTS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME\n(In Thousands, Except Per Share Amounts)\nYear Ended\nOctober 1,\n2022 October 2,\nREVENUES:\nFood and beverage sales $ 180,010 $ 128,988\nOther revenue 3,664 2,882\nTotal revenues 183,674 131,870\nCOSTS AND EXPENSES:\nFood and beverage cost of sales 52,573 38,950\nPayroll expenses 60,000 42,579\nOccupancy expenses 22,181 14,747\nOther operating costs and expenses 21,823 16,044\nGeneral and administrative expenses 12,936 10,523\nGain on lease termination - (810)\nDepreciation and amortization 4,297 3,630\nTotal costs and expenses 173,810 125,663\nOPERATING INCOME 9,864 6,207\nOTHER (INCOME) EXPENSE:\nInterest expense 1,192 1,230\nInterest income (109) (51)\nOther income (421) -\nGain on forgiveness of PPP Loans (2,420) (10,400)\nTotal other (income) expense, net (1,758) (9,221)\nINCOME BEFORE PROVISION FOR INCOME TAXES 11,622 15,428\nProvision for income taxes 1,448 1,181\nCONSOLIDATED NET INCOME 10,174 14,247\nNet income attributable to non-controlling interests (893) (1,352)\nNET INCOME ATTRIBUTABLE TO ARK RESTAURANTS CORP. $ 9,281 $ 12,895\nNET INCOME PER ARK RESTAURANTS CORP. COMMON SHARE:\nBasic $ 2.61 $ 3.67\nDiluted $ 2.58 $ 3.58\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING:\nBasic 3,556 3,516\nDiluted 3,603 3,604\nSee notes to consolidated financial statements.\nARK RESTAURANTS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY\nFOR THE YEARS ENDED OCTOBER 1, 2022 AND OCTOBER 2, 2021\n(In Thousands, Except Per Share Amounts)\nCommon Stock Additional\nPaid-In\nCapital Retained\nEarnings Total Ark\nRestaurants\nCorp.\nShareholdersEquity Non-\ncontrolling\nInterests Total\nEquity\nShares Amount\nBALANCE - October 3, 2020 3,502 $ 35 $ 13,503 $ 22,989 $ 36,527 $ 626 $ 37,153\nNet income - - - 12,895 12,895 1,352 14,247\nExercise of stock options 49 1 709 - 710 - 710\nStock-based compensation - - 280 - 280 - 280\nDistributions to non-controlling\ninterests - - - - - (938) (938)\nBALANCE - October 2, 2021 3,551 36 14,492 35,884 50,412 1,040 51,452\nNet income - - - 9,281 9,281 893 10,174\nExercise of stock options 49 - 703 - 703 - 703\nStock-based compensation - - 298 - 298 - 298\nDistributions to non-controlling\ninterests - - - - - (1,615) (1,615)\nDividends paid - $0.25 per share\n- - - (894) (894) - (894)\nBALANCE - October 1, 2022 3,600 $ 36 $ 15,493 $ 44,271 $ 59,800 $ 318 $ 60,118\nSee notes to consolidated financial statements.\nARK RESTAURANTS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In Thousands)\nYear Ended\nOctober 1,\n2022 October 2,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nConsolidated net income $ 10,174 $ 14,247\nAdjustments to reconcile consolidated net income to net cash provided by operating activities:\nStock-based compensation 298 280\nGain on lease termination - (810)\nGain on forgiveness of PPP Loans (2,420) (10,400)\nDeferred income taxes 582 2,197\nAccrued interest on Certificate of Deposit (21) -\nAccrued interest on note receivable from NMR (40) (51)\nDepreciation and amortization 4,297 3,630\nAmortization of operating lease assets 873 1,808\nAmortization of deferred financing costs 48 60\nChanges in operating assets and liabilities:\nAccounts receivable 928 (2,375)\nInventories (197) (918)\nPrepaid, refundable and accrued income taxes 2,118 (1,026)\nPrepaid expenses and other current assets 1,682 (736)\nOther assets (254) (69)\nAccounts payable - trade (420) 2,557\nAccrued expenses and other current liabilities 2,699 900\nNet cash provided by operating activities 20,347 9,294\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of fixed assets (2,701) (2,138)\nLoans and advances made to employees (229) (92)\nPayments received on employee receivables 169 97\nPurchase of certificate of deposit (5,000) -\nPrincipal and interest payments received from NMR - 500\nPurchase of The Blue Moon Fish Company, net of cash acquired - (1,817)\nNet cash used in investing activities (7,761) (3,450)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nPrincipal payments on notes payable (4,941) (3,374)\nPrincipal payments on PPP Loans (1,571) (68)\nProceeds from PPP Loans - 111\nDividends paid (894) -\nProceeds from issuance of stock upon exercise of stock options 703 710\nDistributions to non-controlling interests (1,615) (938)\nNet cash used in financing activities (8,318) (3,559)\nNET INCREASE IN CASH AND CASH EQUIVALENTS 4,268 2,285\nCASH AND CASH EQUIVALENTS, Beginning of year 19,171 16,886\nCASH AND CASH EQUIVALENTS, End of year $ 23,439 $ 19,171\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION:\nCash paid during the year for:\nInterest $ 1,119 $ 1,067\nIncome taxes $ 826 $ 8\nNon-cash financing activities:\nNote payable in connection with the purchase of The Blue Moon Fish Company $ - $ 1,000\nRefinancing of credit facility borrowings to term notes $ - $ 9,666\nSee notes to consolidated financial statements.\nARK RESTAURANTS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1.BUSINESS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nAs of October 1, 2022, Ark Restaurants Corp. and Subsidiaries (the Company) owned and operated 17 restaurants and bars, 16 fast food concepts and catering operations, exclusively in the United States, that have similar economic characteristics, nature of products and service, class of customers and distribution methods. The Company believes it meets the criteria for aggregating its operating segments into a single reporting segment in accordance with applicable accounting guidance.\nThe Company operates four restaurants in New York City, one in Washington, D.C., five in Las Vegas, Nevada, one in Atlantic City, New Jersey, four in Florida and two on the gulf coast of Alabama. The Las Vegas operations include four restaurants within the New York-New York Hotel and Casino Resort and operation of the hotels room service, banquet facilities, employee dining room and six food court concepts and one restaurant within the Planet Hollywood Resort and Casino. In Atlantic City, New Jersey, the Company operates a restaurant in the Tropicana Hotel and Casino. The Florida operations include The Rustic Inn in Dania Beach, Shuckers in Jensen Beach, JB's on the Beach in Deerfield Beach, The Blue Moon Fish Company in Fort Lauderdale and the operation of four fast food facilities in Tampa and six fast food facilities in Hollywood, each at a Hard Rock Hotel and Casino. In Alabama, the Company operates two Original Oyster Houses, one in Gulf Shores and one in Spanish Fort.\nCOVID-19 PANDEMIC AND INFLATION - Recent global events, including the COVID-19 pandemic (\"COVID-19\"), have adversely affected global economies, disrupted global supply chains and labor force participation and created significant volatility and disruption of financial markets.\nWe experienced significant and variable disruptions to our business as federal, state and local restrictions were mandated, among other remedial measures, to mitigate the spread of the COVID-19 virus. During fiscal 2021, most of our restaurants operated with no restrictions on indoor dining, although there was a significant reduction in guest traffic at our restaurants due to changes in consumer behavior as public health officials encouraged social distancing. While restrictions on the type of permitted operating model and occupancy capacity may continue to change, during fiscal 2022 all of our restaurants operated with no restrictions.\nDuring fiscal 2022, in addition to the associated impact of COVID-19, our operating results have been impacted by geopolitical and other macroeconomic factors, leading to increased commodity and wage inflation and other increased costs. The ongoing effects of COVID-19 and its variants, along with other geopolitical and macroeconomic events, could lead to further government mandates, including but not limited to capacity restrictions, shifts in consumer behavior, wage inflation, staffing challenges, product and services cost inflation and disruptions in our supply chain. If these factors significantly impact our cash flow in the future, we may again implement mitigation actions such as suspending dividends, increasing borrowings or modifying our operating strategies. Some of these measures may have an adverse impact on our business, including possible impairments of assets.\nBasis of Presentation - The accompanying consolidated financial statements have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission (SEC) and accounting principles generally accepted in the United States of America (GAAP). The Companys reporting currency is the United States dollar.\nAccounting Period - The Company's fiscal year ends on the Saturday nearest September 30. The fiscal years ended October 1, 2022 and October 2, 2021 both included 52 weeks.\nUse of Estimates - The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities, at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. The accounting estimates that require managements most difficult and subjective judgments include projected cash flow, allowances for potential bad debts on receivables, assumptions regarding discount rates related to lease accounting, the useful lives and recoverability of its assets, such as property and intangibles, fair values of financial instruments and share-based compensation, the realizable value of its tax assets and determining when investment impairments are other-than-temporary. Because of the uncertainty in such estimates, actual results may differ from these estimates.\nPrinciples of Consolidation - The consolidated financial statements include the accounts of Ark Restaurants Corp. and all of its wholly-owned subsidiaries, partnerships and other entities in which it has a controlling interest. Also included in the consolidated financial statements are certain variable interest entities (VIEs). All significant intercompany balances and transactions have been eliminated in consolidation.\nNon-Controlling Interests - Non-controlling interests represent capital contributions, distributions and income and loss attributable to the shareholders of less than wholly-owned and consolidated entities.\nSeasonality - The Company has substantial fixed costs that do not decline proportionally with sales. Although our business is highly seasonal, our broader geographical reach as a result of recent acquisitions mitigates some of this risk. For instance, the second quarter of our fiscal year, consisting of the non-holiday portion of the cold weather season in New York and Washington (January, February and March), is the poorest performing quarter; however, in recent years this has been partially offset by our locations in Florida as they experience increased results in the winter months. We generally achieve our best results during the warm weather, attributable to our extensive outdoor dining availability, particularly at Bryant Park in New York and Sequoia in Washington, D.C. (our largest restaurants) and our outdoor cafes. However, even during summer months these facilities can be adversely affected by unusually cool or rainy weather conditions. Our facilities in Las Vegas are indoor and generally operate on a more consistent basis throughout the year.\nFair Value of Financial Instruments - Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Fair value is estimated by applying a fair value hierarchy, which requires maximizing the use of observable inputs when measuring fair value. The three levels of inputs are:\nLevel 1: Quoted prices (unadjusted) for identical assets or liabilities in active markets that the entity has the ability to access as of the measurement date.\nLevel 2: Significant other observable inputs other than Level 1 prices such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data.\nLevel 3: Significant unobservable inputs that reflect a reporting entitys own assumptions about the assumptions that market participants would use in pricing an asset or liability.\nThe carrying amount of cash and cash equivalents, receivables, accounts payable and accrued expenses approximate fair value due to the immediate or short-term maturity of these financial instruments. The fair values of notes receivable and payable are determined using current applicable rates for similar instruments as of the balance sheet date and approximate the carrying value of such debt instruments. Certificates of deposit, which are considered Level 2 assets, are valued at original cost plus accrued interest, which approximates fair value.\nCash and Cash Equivalents - Cash and cash equivalents include cash on hand, deposits with banks, highly liquid investments and certificates of deposit with original maturities of three months or less. Outstanding checks in excess of account balances, typically vendor payments, payroll and other contractual obligations disbursed after the last day of a reporting period are reported as a current liability in the accompanying consolidated balance sheets.\nConcentrations of Credit Risk - Financial instruments that potentially subject the Company to concentrations of credit risk consist primarily of cash and cash equivalents and accounts receivable. The Company reduces credit risk by placing its cash and cash equivalents with major financial institutions with high credit ratings. At times, such amounts may exceed Federally insured limits. Accounts receivable are primarily comprised of normal business receivables, such as credit card receivables, that are collected in a short period of time and amounts due from the hotel operators where the Company has a location, and are recorded upon satisfaction of the performance obligation. The Company reviews the collectability of its receivables on an ongoing basis, and provides for an allowance when it considers the counterparty unable to meet its obligation. The concentration of credit risk with respect to accounts receivable is generally limited due to the short payment terms extended by the Company and the number of customers comprising the Companys customer base.\nAs of October 1, 2022, the Company had accounts receivable balances due from two hotel operators totaling 54% of total accounts receivable. As of October 2, 2021, the Company had accounts receivable balances due from one hotel operator totaling 37% of total accounts receivable.\nFor the years ended October 1, 2022 and October 2, 2021, the Company made purchases from two vendors that accounted for 20% and 21% of total purchases, respectively.\nAs of October 1, 2022, all debt outstanding, other than Paycheck Protection Program loans and the note payable to the sellers of The Blue Moon Fish Company, is with one lender (see Note 10 - Notes Payable).\nInventories - Inventories are stated at the lower of cost (first-in, first-out) or net realizable value, and consist of food and beverages, merchandise for sale and other supplies.\nFixed Assets - Fixed assets are stated at cost less accumulated depreciation and amortization. Depreciation is determined using the straight-line method over the estimated useful lives of the assets. Estimated lives range from three to seven years for furniture, fixtures and equipment and up to 40 years for buildings and related improvements. Amortization of improvements to leased properties is computed using the straight-line method based upon the initial term of the applicable lease or the estimated useful life of the improvements, whichever is less, and ranges from 5 to 30 years. For leases with renewal periods at the Companys option, if failure to exercise a renewal option imposes an economic penalty to the Company, management may determine at the inception of the lease that renewal is reasonably assured and include the renewal option period in the determination of appropriate estimated useful lives. Routine expenditures for repairs and maintenance are charged to expense when incurred. Major replacements and improvements are capitalized. Upon retirement or disposition of fixed assets, the cost and related accumulated depreciation are removed from the consolidated balance sheets and any resulting gain or loss is recognized in the consolidated statements of income.\nThe Company includes in construction in progress, improvements to restaurants that are under construction or are undergoing substantial renovations. Once the projects have been completed, the Company begins depreciating and amortizing the assets. Start-up costs incurred during the construction period of restaurants, including rental of premises, training and payroll, are expensed as incurred.\nLong-Lived and Right-Of-Use Assets - Long-lived assets, such as property and plant and equipment subject to amortization, and right-of-use assets (\"ROU assets\") are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. In the evaluation of the fair value and future benefits of long-lived assets, the Company performs an analysis of the anticipated undiscounted future net cash flows of the related long-lived assets. If the carrying value of the related asset exceeds the undiscounted cash flows, the carrying value is reduced to its fair value. Various factors including estimated future sales growth and estimated profit margins are included in this analysis.\nThe Company considers a triggering event related to long-lived assets or ROU assets in a net asset position to have occurred related to a specific restaurant if the restaurants cash flows for the last 12 months are less than a minimum threshold or if consistent levels of undiscounted cash flows for the remaining lease period are less than the carrying value of the restaurants assets. Additionally, the Company considers a triggering event related to ROU assets to have occurred related to a specific lease if the location has been subleased and future estimated sublease income is less than current lease payments. If the Company concludes that the carrying value of certain long-lived and ROU assets will not be recovered based on expected undiscounted future cash flows, an impairment loss is recorded to reduce the long-lived or ROU assets to their estimated fair value. The fair value is measured on a nonrecurring basis using unobservable (Level 3) inputs. There is uncertainty in the projected undiscounted future cash flows used in the Company's impairment review analysis, which requires the use of estimates and assumptions. If actual performance does not achieve the projections, or if the assumptions used change in the future, the Company may be required to recognize impairment charges in future periods, and such charges could be material.\nNo impairment charges related to long-lived and ROU assets were recognized during the year ended October 1, 2022. The Company recognized impairment charges related to long-lived and ROU assets during the year ended October 2, 2021 as described in Note 4 - Recent Restaurant Dispositions. Given the inherent uncertainty in projecting results of restaurants under the current circumstances, the Company is monitoring the recoverability of the carrying value of the assets of several restaurants on an ongoing basis. For these restaurants, if expected performance is not realized, an impairment charge may be recognized in future periods, and such charge could be material.\nIntangible Assets - Intangible assets consist principally of purchased leasehold rights, operating rights and covenants not to compete. Costs associated with acquiring leases and subleases, principally purchased leasehold rights, and operating rights have been capitalized and are being amortized on the straight-line method based upon the initial terms of the applicable lease agreements. Covenants not to compete arising from restaurant acquisitions are amortized over the contractual period, typically five years.\nGoodwill and Trademarks - Goodwill and trademarks are not amortized, but are subject to impairment analysis. We assess the potential impairment of goodwill and trademarks annually (at the end of our fourth quarter) and on an interim basis whenever events or changes in circumstances indicate that the carrying value may not be recoverable. If we determine through the impairment review process that goodwill or trademarks are impaired, we record an impairment charge in our consolidated statements of income.\nDue to the recent impact of the COVID-19 pandemic to the global economy, including but not limited to, the volatility of the Company's stock price, temporary closure of the Company's restaurants and the challenging environment for the restaurant industry in general, the Company determined that there were indicators of potential impairment of its goodwill and trademarks during the years ended October 1, 2022 and October 2, 2021. As such, the Company performed a qualitative and quantitative assessment for both goodwill and its trademarks and concluded that the fair value of these assets exceeded their carrying values. Accordingly, the Company did not record any impairment to its goodwill or trademarks during the years ended October 1, 2022 and October 2, 2021.\nInvestments - Each reporting period, the Company reviews its investments in equity and debt securities, except for those classified as trading, to determine whether a significant event or change in circumstances has occurred that may have an adverse effect on the fair value of such investment. When such events or changes occur, the Company evaluates the fair value compared to cost basis in the investment. For investments in non-publicly traded companies, managements assessment of fair value is based on valuation methodologies including discounted cash flows, estimates of sales proceeds, and appraisals, as appropriate. The Company considers the assumptions that it believes hypothetical marketplace participants would use in evaluating estimated future cash flows when employing the discounted cash flow or estimates of sales proceeds valuation methodologies.\nIn the event the fair value of an investment declines below the Companys cost basis, management is required to determine if the decline in fair value is other than temporary. If management determines the decline is other than temporary, an impairment charge is recorded. Managements assessment as to the nature of a decline in fair value is based on, among other things, the length of time and the extent to which the market value has been less than the cost basis; the financial condition and near-term prospects of the issuer; and the Companys intent and ability to retain the investment for a period of time sufficient to allow for any anticipated recovery in market value.\nLeases - We determine if an arrangement contains a lease at inception. An arrangement contains a lease if it implicitly or explicitly identifies an asset to be used and conveys the right to control the use of the identified asset in exchange for consideration. As a lessee, we include operating leases in Operating lease right-of-use assets and Operating lease liabilities in our consolidated balance sheet. Right-of-use assets represent our right to use an underlying asset for the lease term and lease liabilities represent our obligation to make lease payments arising from the lease. Operating lease right-of-use assets and liabilities are recognized upon commencement of the lease based on the present value of the lease payments over the lease term. As most of our leases do not provide an implicit interest rate, we use our incremental borrowing rate based on the information available at commencement date to determine the present value of lease payments. Our lease terms may include options to extend or terminate the lease. Options are included when it is reasonably certain that we will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term. Amendments or modifications to lease terms are accounted for as variable lease payments. Leases with a lease term of 12 months or less are accounted for using the practical expedient which allows for straight-line rent expense over the remaining term of the lease.\nRevenue Recognition - The Company recognizes revenue when it satisfies a performance obligation by transferring control over a product or service to a restaurant guest or other customer. Revenues from restaurant operations are presented net of discounts, coupons, employee meals and complimentary meals and recognized when food, beverage and retail products are sold. Sales tax collected from customers is excluded from sales and the obligation is included in sales tax payable until the taxes are remitted to the appropriate taxing authorities. Catering service revenue is generated through contracts with customers whereby the customer agrees to pay a contract rate for the service. Revenues from catered events are recognized in income upon satisfaction of the performance obligation (the date the event is held). All customer payments, including nonrefundable upfront deposits, are deferred as a liability until such time. The Company recognized $11,812,000 and $3,240,000 in catering services revenue for the years ended October 1, 2022 and October 2, 2021, respectively. Unearned revenue which is included in accrued expenses and other current liabilities on the consolidated balance sheets as of October 1, 2022 and October 2, 2021 was $5,534,000 and $4,988,000, respectively.\nRevenues from gift cards are deferred and recognized upon redemption. Deferrals are not reduced for potential non-use as we generally have a legal obligation to remit the value of unredeemed gift cards to the relevant jurisdictions in which they are sold. As of October 1, 2022 and October 2, 2021, the total liability for gift cards in the amounts of approximately $309,000 and $252,000, respectively, are included in accrued expenses and other current liabilities in the consolidated balance sheets.\nOther revenues include purchase service fees which represent commissions earned by a subsidiary of the Company for providing services to other restaurant groups, as well as license fees, property management fees and other rentals.\nOccupancy Expenses - Occupancy expenses include rent, rent taxes, real estate taxes, insurance and utility costs.\nDefined Contribution Plan - The Company offers a defined contribution savings plan (the Plan) to all of its full-time employees. Eligible employees may contribute pre-tax amounts to the Plan subject to the Internal Revenue Code limitations. Company contributions to the Plan are at the discretion of the Board of Directors. During the years ended October 1, 2022 and October 2, 2021, the Company did not make any contributions to the Plan.\nIncome Taxes - Income taxes are accounted for under the asset and liability method whereby deferred tax assets and liabilities are recognized for future tax consequences attributable to the temporary differences between the financial statement carrying amounts of assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the period that includes the enactment date. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nThe Company has recorded a liability for unrecognized tax benefits resulting from tax positions taken, or expected to be taken, in an income tax return. It is the Companys policy to recognize interest and penalties related to uncertain tax positions as a component of income tax expense. Uncertain tax positions are evaluated and adjusted as appropriate, while taking into account the progress of audits of various taxing jurisdictions.\nNon-controlling interests relating to the income or loss of consolidated partnerships includes no provision for income taxes as any tax liability related thereto is the responsibility of the individual minority investors.\nIncome Per Share of Common Stock - Basic net income per share is calculated on the basis of the weighted average number of common shares outstanding during each period. Diluted net income per share reflects the additional dilutive effect of potentially dilutive shares (principally those arising from the assumed exercise of stock options). The dilutive effect of stock options is reflected in diluted earnings per share by application of the treasury stock method. Under the treasury stock method, if the average market price of a share of common stock increases above the options exercise price, the proceeds that would be assumed to be realized from the exercise of the option would be used to acquire outstanding shares of common stock. The dilutive effect of awards is directly correlated with the fair value of the shares of common stock.\nStock-based Compensation - Stock-based compensation represents the cost related to stock-based awards granted to employees and non-employee directors. The Company measures stock-based compensation at the grant date based on the estimated fair value of the award and recognize the cost (net of estimated forfeitures) as compensation expense on a straight-line basis over the requisite service period. Upon exercise of options, all excess tax benefits and tax deficiencies resulting from the difference between the deduction for tax purposes and the stock-based compensation cost recognized for financial reporting purposes are included as a component of income tax expense.\nRecently Adopted Accounting Standards - In January 2017, the Financial Accounting Standards Board (the \"FASB\") issued Accounting Standards Update (\"ASU\") No. 2017-04, Intangibles - Goodwill and Other (Topic 350) - Simplifying the Test for Goodwill Impairment (ASU 2017-04). ASU 2017-04 simplifies the accounting for goodwill impairments by eliminating the requirement to compare the implied fair value of goodwill with its carrying amount as part of step two of the goodwill impairment test referenced in Accounting Standards Codification (ASC) 350, Intangibles - Goodwill and Other (ASC 350). As a result, an entity should perform its annual, or interim, goodwill impairment test by comparing the fair value of a reporting unit with its carrying amount. An impairment charge should be recognized for the amount by which the carrying amount exceeds the reporting units fair value. However, the impairment loss recognized should not exceed the total amount of goodwill allocated to that reporting unit. The Company adopted this guidance in the first quarter of fiscal 2021. Such adoption did not have a material impact on our consolidated financial statements.\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (\"ASU 2019-12\"), which modifies Topic 740 to simplify the accounting for income taxes. ASU 2019-12 is effective for financial statements issued for annual periods beginning after December 15, 2020, and for the interim periods therein. The Company adopted this guidance in the first quarter of fiscal 2022. Such adoption did not have a material impact on our consolidated condensed financial statements.\nNew Accounting Standards Not Yet Adopted - In March 2020, the FASB issued ASU No. 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting, which provides optional expedients and exceptions for applying U.S. GAAP to contracts, hedging relationships and other transactions affected by the discontinuation of the London Interbank Offered Rate (LIBOR) or by another reference rate expected to be discontinued because of reference rate reform. The guidance was effective beginning March 12, 2020 and can be applied prospectively\nthrough December 31, 2022. In January 2021, the FASB issued ASU 2021-01, Reference Rate Reform (Topic 848): Scope (ASU 2021-01). ASU 2021-01 provides temporary optional expedients and exceptions to certain guidance in U.S. GAAP to ease the financial reporting burdens related to the expected market transition from LIBOR and other interbank offered rates to alternative reference rates, such as the Secured Overnight Financing Rate (SOFR). The guidance is effective upon issuance, on January 7, 2021, and can be applied through December 31, 2022. We do not expect that the requirements of this guidance will have a material impact on our consolidated financial statements.\n2. CONSOLIDATION OF VARIABLE INTEREST ENTITIES\nThe Company consolidates any variable interest entities in which it holds a variable interest and is the primary beneficiary. Generally, a variable interest entity, or VIE, is an entity with one or more of the following characteristics: (a) the total equity investment at risk is not sufficient to permit the entity to finance its activities without additional subordinated financial support; (b) as a group the holders of the equity investment at risk lack (i) the ability to make decisions about an entitys activities through voting or similar rights, (ii) the obligation to absorb the expected losses of the entity, or (iii) the right to receive the expected residual returns of the entity; or (c) the equity investors have voting rights that are not proportional to their economic interests and substantially all of the entitys activities either involve, or are conducted on behalf of, an investor that has disproportionately few voting rights. The primary beneficiary of a VIE is generally the entity that has (a) the power to direct the activities of the VIE that most significantly impact the VIEs economic performance, and (b) the obligation to absorb losses or the right to receive benefits that could potentially be significant to the VIE.\nThe Company has determined that it is the primary beneficiary of three VIEs and, accordingly, consolidates the financial results of these entities. Following are the required disclosures associated with the Companys consolidated VIEs:\nOctober 1,\n2022 October 2,\n(in thousands)\nCash and cash equivalents $ 834 $ 785\nAccounts receivable 140 358\nInventories 38 35\nPrepaid and refundable income taxes 278 278\nPrepaid expenses and other current assets 17 277\nDue from Ark Restaurants Corp. and affiliates (1) 400 187\nFixed assets - net 212 218\nOperating lease right-of-use assets - net 2,076 2,342\nOther assets 11 82\nTotal assets $ 4,006 $ 4,562\nAccounts payable - trade $ 135 $ 213\nAccrued expenses and other current liabilities 417 374\nCurrent portion of operating lease liabilities 272 249\nCurrent portion of notes payable - 95\nOperating lease liabilities, less current portion 1,921 2,193\nNotes payable, less current portion - 101\nTotal liabilities 2,745 3,225\nEquity of variable interest entities 1,261 1,337\nTotal liabilities and equity $ 4,006 $ 4,562\n(1)Amounts due from Ark Restaurants Corp. and affiliates are eliminated upon consolidation.\nThe liabilities recognized as a result of consolidating these VIEs do not represent additional claims on the Companys general assets; rather, they represent claims against the specific assets of the consolidated VIEs. Conversely, assets recognized as a result of consolidating these VIEs do not represent additional assets that could be used to satisfy claims against the Companys general assets.\n3. RECENT RESTAURANT EXPANSION AND OTHER DEVELOPMENTS\nOn December 1, 2020, the Company, through a newly formed, wholly-owned subsidiary, acquired the assets of Bear Ice, Inc. and File Gumbo Inc., which collectively operated a restaurant and bar named Blue Moon Fish Company located in Lauderdale-by-the-Sea, FL. The total purchase price of $2,820,000, as set out below, was paid with cash in the amount of $1,820,000 and a four-year note held by the sellers in the amount of $1,000,000 payable monthly with 5% interest. The\nacquisition was accounted for as a business combination. Concurrent with the acquisition, the Company assumed the related lease which expires in 2026 and has four five-year extension options. Rent payments under the lease are approximately $360,000 per year and increase by 15% as each option is exercised.\nThe fair values of the assets acquired were allocated as follows (amounts in thousands):\nCash $ 3\nInventory 39\nSecurity deposit 30\nTrademarks 500\nNon-compete agreement 380\nGoodwill 1,870\nLiabilities assumed (2)\n$ 2,820\nGoodwill recognized in connection with this transaction represents the residual amount of the purchase price over separately identifiable intangible assets and is expected to be deductible for tax purposes.\nThe consolidated statement of income for the year ended October 2, 2021 includes revenues and net income of approximately $5,929,000 and $981,000, respectively, related to Blue Moon Fish Company. The unaudited pro forma financial information set forth below is based upon the Companys historical consolidated statements of operations for the year ended October 2, 2021 and includes the results of operations for Blue Moon Fish Company for the period prior to acquisition. The unaudited pro forma financial information (which is presented in thousands except per share and share data), which has been adjusted for interest expense on the above-mentioned note, is presented for informational purposes only and may not be indicative of what actual results of operations would have been had the acquisition of Blue Moon Fish Company occurred on the dates indicated, nor does it purport to represent the results of operations for future periods.\nYear Ended\nOctober 2,\nTotal revenues $ 132,547\nNet income (loss) $ 12,926\nNet income (loss) per share - basic $ 3.68\nNet income (loss) per share - diluted $ 3.59\nShares - Basic 3,516\nShares - Diluted 3,604\nOn January 26, 2021, the Company exercised its right-of-first-refusal to acquire the land, building and parking lot associated with JBs on the Beach and immediately contributed such rights and interest to an unrelated entity (\"Sandcastle 1, LLC\") that purchased the properties on March 22, 2021. In exchange, the Company received a 5% interest in Sandcastle 1, LLC, which plans future development of the sites. In addition, all rights and privileges under the current lease were assigned to Sandcastle 1, LLC, as landlord and the lease terms remain unchanged.\nOn April 8, 2022, the Company extended its lease for Gallagher's Steakhouse at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2032. In connection with the extension, the Company has agreed to spend a minimum of $1,500,000 to materially refresh the premises by April 30, 2023 (as extended from September 30, 2022 due to supply chain issues), subject to additional extensions as set out in the agreement.\nOn June 24, 2022, the Company extended its lease for America at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2033. In connection with the extension, the Company has agreed to spend a minimum of $4,000,000 to materially refresh the premises by December 31, 2024, subject to various extensions as set out in the agreement.\nOn July 21, 2022, the Company extended its lease for the Village Eateries at the New York-New York Hotel and Casino in Las Vegas, NV through December 31, 2034. As part of this extension, the Broadway Burger Bar and Grill and Gonzalez y Gonzalez, were carved out of the Village Eateries footprint and the extended date for those two locations is December 31, 2033. In connection with the extension, the Company has agreed to spend a minimum of $3,500,000 to materially refresh all three of these premises by June 30, 2023, subject to various extensions as set out in the agreement.\nThe above refresh obligations related to the New York-New York Hotel and Casino lease extensions are to be consistent with designs approved by the Landlord which shall not be unreasonably withheld. We will continue to pay all rent as required by the leases without abatement during construction. Note that our substantial completion of work set forth in plans approved by the Landlord shall constitute our compliance with the requirements of the completion deadlines, regardless of whether or not the amount actually expended in connection therewith is less than the minimum.\n4. RECENT RESTAURANT DISPOSITIONS\nOn November 13, 2020, the Company was advised by the landlord that it would have to vacate Gallaghers Steakhouse and Gallaghers Burger Bar at the Resorts Casino Hotel located in Atlantic City, NJ which were on a month-to-month, no rent lease. The closure of these properties occurred on January 2, 2021 and did not result in a material charge to the Companys operations.\nAs of January 2, 2021, the Company determined that it would not reopen Thunder Grill in Washington, D.C. which had been closed since March 20, 2020. This closure did not result in a material charge to the Companys operations.\nOn September 1, 2021, the Company advised the landlord of Clyde Frazier's Wine and Dine that we would be closing the property permanently and terminating the lease. In connection with this notification, the Company recorded a gain of $810,000 during the year ended October 2, 2021 consisting of: (i) rent and other costs incurred in accordance with the termination provisions of the lease in the amount of $318,000, (ii) impairment of long-lived assets in the amount of $69,000 and (iii) the write-off of our security deposit in the amount of $121,000 offset by the write-off of ROU assets and related lease liabilities in the net amount of $1,318,000.\nOn July 5, 2022, the Company terminated its lease for Lucky 7 at the Foxwoods Resort Casino. The closure did not result in a material change to the Company's operations.\n5. INVESTMENT IN AND RECEIVABLE FROM NEW MEADOWLANDS RACETRACK\nOn March 12, 2013, the Company made a $4,200,000 investment in the New Meadowlands Racetrack LLC (NMR) through its purchase of a membership interest in Meadowlands Newmark, LLC, an existing member of NMR with a then 63.7% ownership interest. On November 19, 2013, the Company invested an additional $464,000 in NMR through a purchase of an additional membership interest in Meadowlands Newmark, LLC resulting in a total ownership of 11.6% of Meadowlands Newmark, LLC, and an effective ownership interest in NMR of 7.4%, subject to dilution. In 2015, the Company invested an additional $222,000 in NMR and on February 7, 2017, the Company invested an additional $222,000 in NMR, both as a result of capital calls, bringing its total investment to $5,108,000 with no change in ownership. The Company accounts for this investment at cost, less impairment, adjusted for subsequent observable price changes in accordance with ASU No. 2016-01. There are no observable prices for this investment.\nDuring the year ended October 1, 2022, the Company received distributions from NMR in the amount of $421,000 which are included in other income in the consolidated statement of income for the year then ended.\nThe Company evaluated its investment in NMR for impairment and concluded that its fair value exceeds the carrying value. Accordingly, the Company did not record any impairment during the year ended October 1, 2022 and October 2, 2021. The ultimate severity and longevity of the COVID-19 pandemic is unknown, and therefore, it is possible that impairments could be identified in future periods, and such amounts could be material. Any future changes in the carrying value of our investment in NMR will be reflected in earnings.\nIn addition to the Companys ownership interest in NMR through Meadowlands Newmark, LLC, if casino gaming is approved at the Meadowlands and NMR is granted the right to conduct said gaming, neither of which can be assured, the Company shall be granted the exclusive right to operate the food and beverage concessions in the gaming facility with the exception of one restaurant.\nIn conjunction with this investment, the Company, through a 97% owned subsidiary, Ark Meadowlands LLC (AM VIE), also entered into a long-term agreement with NMR for the exclusive right to operate food and beverage concessions serving the new raceway facilities (the Racing F&B Concessions) located in the new raceway grandstand constructed at the\nMeadowlands Racetrack in northern New Jersey. Under the agreement, NMR is responsible to pay for the costs and expenses incurred in the operation of the Racing F&B Concessions, and all revenues and profits thereof inure to the benefit of NMR. AM VIE receives an annual fee equal to 5% of the net profits received by NMR from the Racing F&B Concessions during each calendar year. AM VIE is a variable interest entity; however, based on qualitative consideration of the contracts with AM VIE, the operating structure of AM VIE, the Companys role with AM VIE, and that the Company is not obligated to absorb expected losses of AM VIE, the Company has concluded that it is not the primary beneficiary and not required to consolidate the operations of AM VIE.\nThe Companys maximum exposure to loss as a result of its involvement with AM VIE is limited to a receivable from AM VIEs primary beneficiary (NMR, a related party). As of October 1, 2022 and October 2, 2021, $22,000 and $0 were due AM VIE by NMR.\nOn April 25, 2014, the Company loaned $1,500,000 to Meadowlands Newmark, LLC. The note bears interest at 3%, compounded monthly and added to the principal, and is due in its entirety on January 31, 2024. The note may be prepaid, in whole or in part, at any time without penalty or premium. On July 13, 2016, the Company made an additional loan to Meadowlands Newmark, LLC in the amount of $200,000. Such amount is subject to the same terms and conditions as the original loan discussed above. The principal and accrued interest related to this note, after a $500,000 payment made in July 2021, in the amounts of $1,357,000 and $1,317,000, are included in Investment In and Receivable From New Meadowlands Racetrack in the consolidated balance sheets at October 1, 2022 and October 2, 2021, respectively.\n6. FIXED ASSETS\nFixed assets consist of the following:\nOctober 1,\n2022 October 2,\n(in thousands)\nLand and building $ 18,033 $ 18,033\nLeasehold improvements 43,054 42,200\nFurniture, fixtures and equipment 36,554 36,143\nConstruction in progress 355 38\n97,996 96,414\nLess: accumulated depreciation and amortization 63,314 60,240\nFixed Assets - Net $ 34,682 $ 36,174\nDepreciation and amortization expense related to fixed assets for the years ended October 1, 2022 and October 2, 2021 was $4,193,000 and $3,577,000, respectively.\nManagement continually evaluates unfavorable cash flows, if any, related to underperforming restaurants. Periodically it is concluded that certain properties have become impaired based on their existing and anticipated future economic outlook in their respective markets. In such instances, we may impair assets to reduce their carrying values to fair values. Estimated fair values of impaired properties are based on comparable valuations, cash flows and/or management judgment. Included in the year ended October 2, 2021 is an impairment charge of $69,000 related to Clyde Frazier's Wine and Dine (see Note 4).\n7. INTANGIBLE ASSETS, GOODWILL AND TRADEMARKS\nIntangible assets consist of the following:\nOctober 1,\n2022 October 2,\n(in thousands)\nPurchased leasehold rights (a) - fully amortized $ 1,995 $ 1,995\nNoncompete agreements and other - 5-10 years\n633 633\n2,628 2,628\nLess accumulated amortization 2,356 2,252\nIntangible Assets - Net $ 272 $ 376\n(a)Purchased leasehold rights arose from acquiring leases and subleases of various restaurants.\nAmortization expense related to intangible assets for the years ended October 1, 2022 and October 2, 2021 was $104,000 and $53,000, respectively. Amortization expense is expected to be $85,000 for fiscal 2023, 2024 and 2025 and $17,000 for fiscal 2026.\nGoodwill is the excess of cost over fair market value of tangible and intangible net assets acquired. Goodwill is not presently amortized but tested for impairment annually or when the facts or circumstances indicate a possible impairment of goodwill as a result of a continual decline in performance or as a result of fundamental changes in a market. Trademarks, which have indefinite lives, are not currently amortized and are tested for impairment annually or when facts or circumstances indicate a possible impairment as a result of a continual decline in performance or as a result of fundamental changes in a market.\nThe changes in the carrying amount of goodwill and trademarks for the years ended October 1, 2022 and October 2, 2021 are as follows:\nGoodwill Trademarks\n(in thousands)\nBalance as of October 3, 2020 $ 15,570 $ 3,720\nAcquired during the year 1,870 500\nBalance as of October 2, 2021 17,440 4,220\nAcquired during the year - -\nBalance as of October 1, 2022 $ 17,440 $ 4,220\n8. ACCRUED EXPENSES AND OTHER CURRENT LIABILITIES\nAccrued expenses and other current liabilities consist of the following:\nOctober 1,\n2022 October 2,\n(in thousands)\nSales tax payable $ 916 $ 910\nAccrued wages and payroll related costs 5,517 4,758\nCustomer advance deposits 5,534 4,988\nAccrued occupancy and other operating expenses 4,345 3,023\n$ 16,312 $ 13,679\n9. LEASES\nOther than locations where we own the underlying property, we lease our restaurant locations as well as our corporate office under various non-cancelable real-estate lease agreements that expire on various dates through 2046. We evaluate whether we control the use of the asset, which is determined by assessing whether we obtain substantially all economic benefits from the use of the asset, and whether we have the right to direct the use of the asset. If these criteria are met and we have identified a lease, we account for the contract under the requirements of ASC 842.\nUpon taking possession of a leased asset, we determine its classification as an operating or finance lease. All of our real estate leases are classified as operating leases. We do not have any finance leases as of October 1, 2022 or October 2, 2021. Generally, our real estate leases have initial terms ranging from 10 to 25 years and typically include renewal options. Renewal options are recognized as part of the ROU assets and lease liabilities if it is reasonably certain at the date of adoption that we would exercise the options to extend the lease. Our real estate leases typically provide for fixed minimum rent payments and/or contingent rent payments based upon sales in excess of specified thresholds. When the achievement of such sales thresholds are deemed to be probable, variable lease expense is accrued in proportion to the sales recognized during the period. For operating leases that include rent holidays and rent escalation clauses, we recognize lease expense on a straight-line basis over the lease term from the date we take possession of the leased property. We record the straight-line lease expense and any contingent rent, if applicable, in occupancy expenses in the consolidated statements of income.\nMany of our real estate leases also require us to pay real estate taxes, common area maintenance costs and other occupancy costs (non-lease components) which are included in occupancy related expenses in the consolidated statements of income. Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nAs there were no explicit rates provided in our leases, we used our incremental borrowing rate based on the information available at commencement date in determining the present value of lease payments.\nDuring the third quarter of 2020, the Company suspended the vast majority of lease payments while its restaurants were closed by government mandated shutdowns as a result of the COVID-19 pandemic. The Company was able to negotiate rent concessions, abatements and deferrals with landlords on many of our operating leases. In July 2020, the FASB issued a clarification to accounting for lease concessions in response to the COVID-19 pandemic to reduce the operational challenges and complexity of lease accounting. The Company used the relief provisions provided by FASB and made an election to account for the lease concessions as if they were part of the original lease agreement. As a result of the finalization of several concession agreements with landlords, the Company recognized a reduction of rent expense in the amount of $800,000 in the year ended October 2, 2021.\nThe components of lease expense in the consolidated statements of income are as follows:\nOctober 1, 2022 October 2, 2021\n(in thousands)\nOperating lease expense - occupancy expenses (1)\n$ 10,442 $ 7,557\nOccupancy lease expense - general and administrative expenses 461 396\nVariable lease expense 6,498 2,970\nTotal lease expense $ 17,401 $ 10,923\n____________________\n(1) Includes short-term leases, which are immaterial.\nSupplemental cash flow information related leases:\nOctober 1, 2022 October 2, 2021\n(in thousands)\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows related to operating leases $ 14,633 $ 10,485\nNon-cash investing activities:\nROU assets obtained in exchange for new operating lease liabilities $ 53,530 $ 8,712\nThe weighted average remaining lease terms and discount rate as of October 1, 2022 are as follows:\nWeighted Average Remaining Lease Term Weighted Average Discount Rate\nOperating leases 12.5 years 6.1 %\nThe annual maturities of our lease liabilities as of October 1, 2022 are as follows:\nFiscal Year Ending Operating Leases\n(in thousands)\nSeptember 30, 2023 $ 13,695\nSeptember 28, 2024 14,023\nSeptember 27, 2025 12,995\nOctober 3, 2026 11,867\nOctober 2, 2027 11,547\nThereafter 85,915\nTotal future lease payments 150,042\nLess imputed interest (45,068)\nPresent value of lease liabilities $ 104,974\n10. NOTES PAYABLE\nLong-term debt consists of the following:\nOctober 1,\n2022 October 2,\n(in thousands)\nPromissory Note - Rustic Inn purchase $ 3,187 $ 3,473\nPromissory Note - Shuckers purchase 3,655 3,995\nPromissory Note - Oyster House purchase 2,873 3,492\nPromissory Note - JB's on the Beach purchase 3,750 4,750\nPromissory Note - Sequoia renovation 1,714 2,171\nPromissory Note - Revolving Facility 7,166 9,166\nPromissory Note - Blue Moon Fish Company (see Note 3) 587 827\nPaycheck Protection Program Loans 797 4,722\n23,729 32,596\nLess: Current maturities (6,575) (6,973)\nLess: Unamortized deferred financing costs (65) (114)\nLong-term debt $ 17,089 $ 25,509\nNotes Payable - Bank\nOn June 1, 2018, the Company refinanced (the \"Refinancing\") its then existing indebtedness with its current lender, Bank Hapoalim B.M. (BHBM), by entering into an amended and restated credit agreement (the Revolving Facility), which was to mature on May 19, 2022 (as extended). The Revolving Facility provided for total availability of the lesser of (i) $10,000,000 and (ii) $35,000,000 less the then aggregate amount of all indebtedness and obligations to BHBM. On July 26, 2021, all outstanding Revolver Borrowings, in the amount of $9,666,000, were converted to a promissory note with quarterly principal payments of $500,000 commencing on September 1, 2021, with a balloon payment of $2,166,000 on June 1, 2025. Such note bears interest at LIBOR plus 3.5% per annum. We expect that the LIBOR rate will be discontinued by June 30, 2023 and will continue to work with BHBM to identify a suitable replacement rate and amend our debt agreements to reflect this new reference rate accordingly. We do not expect the discontinuation of LIBOR as a reference rate in our debt agreements to have a material adverse effect on our financial position or materially affect our interest expense.\nThe Revolving Facility, which includes all of the promissory notes, also requires, among other things, that the Company meet minimum quarterly tangible net worth amounts, maintain a minimum fixed charge coverage ratio and meet minimum annual net income amounts. The Revolving Facility contains customary representations, warranties and affirmative covenants as well as customary negative covenants, subject to negotiated exceptions on liens, relating to other indebtedness, capital expenditures, liens, affiliate transactions, disposal of assets and certain changes in ownership.\nBorrowings under the Revolving Facility are secured by all tangible and intangible personal property (including accounts receivable, inventory, equipment, general intangibles, documents, chattel paper, instruments, letter-of-credit rights, investment property, intellectual property and deposit accounts) and fixtures of the Company.\nOn June 12, 2020 and again on February 15, 2021, as a result of the impact of the COVID-19 pandemic on our business, BHBM agreed to modified financial covenants through fiscal Q2 2022. The Company was in compliance with all of its financial covenants under the Revolving Facility as of October 1, 2022.\nIn connection with the Refinancing, the Company also amended the principal amounts and payment terms of its then outstanding term notes with BHBM as follows:\nPromissory Note - Rustic Inn purchase - On February 25, 2013, the Company issued a promissory note to BHBM for $3,000,000. The note bore interest at LIBOR plus 3.5% per annum, and was payable in 36 equal monthly installments of $83,333, commencing on March 25, 2013. On February 24, 2014, in connection with the acquisition of The Rustic Inn, the Company borrowed an additional $6,000,000 from BHBM under the same terms and conditions as the original loan which was consolidated with the remaining principal balance from the original borrowing at that date. The new loan was payable in 60 equal monthly installments of $134,722, which commenced on March 25, 2014. In connection with the above refinancing, this note was amended and restated and increased by $2,783,333 of credit facility borrowings. The new principal amount of $4,400,000, which is secured by a mortgage on The Rustic Inn real estate, is payable in 27 equal quarterly installments of $71,333, which commenced on September 1, 2018, with a balloon payment of $2,474,000 on June 1, 2025 and bears interest at LIBOR plus 3.5% per annum.\nPromissory Note - Shuckers purchase - On October 22, 2015, in connection with the acquisition of Shuckers, the Company issued a promissory note to BHBM for $5,000,000. The note bore interest at LIBOR plus 3.5% per annum, and was payable in 60 equal monthly installments of $83,333, commencing on November 22, 2015. In connection with the above refinancing, this note was amended and restated and increased by $2,433,324 of credit facility borrowings. The new principal amount of $5,100,000, which is secured by a mortgage on the Shuckers real estate, is payable in 27 equal quarterly installments of $85,000, which commenced on September 1, 2018, with a balloon payment of $2,805,000 on June 1, 2025 and bears interest at LIBOR plus 3.5% per annum.\nPromissory Note - Oyster House purchase - On November 30, 2016, in connection with the acquisition of the Oyster House properties, the Company issued a promissory note under the Revolving Facility to BHBM for $8,000,000. The note bore interest at LIBOR plus 3.5% per annum, and was payable in 60 equal monthly installments of $133,273, commencing on January 1, 2017. In connection with the above refinancing, this note was amended and restated and separated into two notes. The first note, in the principal amount of $3,300,000, is secured by a mortgage on the Oyster House Gulf Shores real estate, is payable in 19 equal quarterly installments of $117,857, which commenced on September 1, 2018, with a balloon payment of $1,060,716 on June 1, 2023 and bears interest at LIBOR plus 3.5% per annum. The second note, in the principal amount of $2,200,000, is secured by a mortgage on the Oyster House Spanish Fort real estate, is payable in 27 equal quarterly installments of $36,667, which commenced on September 1, 2018, with a balloon payment of $1,210,000 on June 1, 2025 and bears interest at LIBOR plus 3.5% per annum.\nPromissory Note - JB's on the Beach purchase - On May 15, 2019, in connection with the previously discussed acquisition of JBs on the Beach, the Company issued a promissory note under the Revolving Facility to BHBM for $7,000,000 which is payable in 23 equal quarterly installments of $250,000, commencing on September 1, 2019, with a balloon payment of $1,250,000 on June 1, 2025 and bears interest at LIBOR plus 3.5% per annum.\nPromissory Note - Sequoia renovation - Also on May 15, 2019, the Company converted $3,200,000 of Revolving Facility borrowings incurred in connection with the Sequoia renovation to a promissory note which is payable in 23 equal quarterly installments of $114,286, commencing on September 1, 2019, with a balloon payment of $571,429 on June 1, 2025 and bears interest at LIBOR plus 3.5% per annum.\nPaycheck Protection Program Loans\nDuring the year ended October 3, 2020, subsidiaries (the Borrowers) of the Company received loan proceeds from several banks (the Lenders) in the aggregate amount of $14,995,000 (the PPP Loans) under the Paycheck Protection Program (the PPP) of the CARES Act, which was enacted March 27, 2020. In addition, during the 13 weeks ended April 3, 2021, one of our consolidated VIEs received a second draw PPP Loan in the amount of $111,000. The PPP Loans are evidenced by individual promissory notes of each of the Borrowers (together, the Notes) in favor of the Lender, which Notes bear\ninterest at the rate of 1.00% per annum. Under the terms of the PPP Loans, some or all of the amounts thereunder, including accrued interest, may be forgiven if they are used for Qualifying Expenses as described in and in compliance with the CARES Act.\nWhile the Company and each Borrower believe that PPP Loan proceeds were used exclusively for Qualifying Expenses, it is unclear and uncertain whether the conditions for forgiveness of the remaining PPP Loans outstanding at October 1, 2022 will be met under the current guidelines of the CARES Act. Therefore, we cannot make any assurances that the Company, or any of the Borrowers, will be eligible for forgiveness of the remaining PPP Loans in the amount of $797,000, in whole or in part.\nDuring the years ended October 1, 2022 and October 2, 2021, $2,420,000 and $10,400,000, respectively (including $65,000 and $84,000 of accrued interest, respectively), of PPP Loans were forgiven. To the extent, if any, that any of the remaining PPP Loans are not forgiven, beginning one month following expiration of the Deferral Period, and continuing monthly for 10 months (the Maturity Date), each respective Borrower is obligated to make monthly payments of principal and interest to the Lender with respect to any unforgiven portion of the Notes, in such equal amounts required to fully amortize the principal amount outstanding on such Notes as of the last day of the applicable Deferral Period by the applicable Maturity Date.\nAccordingly, based on the above, we have classified the PPP Loan amounts expected to be forgiven as long-term in accordance with SEC interpretative guidance and the remaining amounts expected to be repaid in the next 12 months of $797,000 and $2,032,000 as short-term in the consolidated condensed balance sheets as of October 1, 2022 and October 2, 2021, respectively. During the year ended October 1, 2022 and October 2, 2021, the Company made payments related to the unforgiven portion of PPP Loans in the aggregate amount of $1,571,000 and $68,000, respectively.\nDeferred Financing Costs\nDeferred financing costs incurred in the amount of $271,000 are being amortized over the life of the agreements using the effective interest rate method and included in interest expense. Amortization expense of $48,000 and $60,000 is included in interest expense for the years ended October 1, 2022 and October 2, 2021, respectively.\nMaturities\nAs of October 1, 2022, the aggregate amounts of notes payable maturities (excluding borrowings under the Revolving Facility) are as follows (in thousands):\nBHBM PPP Loans Blue Moon Note Total\n2023 $ 5,525 $ 797 $ 253 $ 6,575\n2024 4,229 - 266 4,495\n2025 12,591 - 68 12,659\n$ 22,345 $ 797 $ 587 $ 23,729\n11. COMMITMENTS AND CONTINGENCIES\nLeases - The Company leases several restaurants, bar facilities, and administrative headquarters through its subsidiaries under terms expiring at various dates through 2046. Most of the leases provide for the payment of base rents plus real estate taxes, insurance and other expenses and, in certain instances, for the payment of a percentage of the restaurants sales in excess of stipulated amounts at such facility and in one instance based on profits. In connection with one of our leases, the Company obtained and delivered an irrevocable letter of credit in the amount of approximately $542,000 as a security deposit under such lease.\nLegal Proceedings - In the ordinary course its business, the Company is a party to various lawsuits arising from accidents at its restaurants and workers compensation claims, which are generally handled by the Companys insurance carriers. The employment by the Company of management personnel, waiters, waitresses and kitchen staff at a number of different restaurants has resulted in the institution, from time to time, of litigation alleging violation by the Company of employment discrimination laws. Management believes, based in part on the advice of counsel, that the ultimate resolution of these matters will not have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows.\nOn May 1, 2018, two former tipped service workers (the Plaintiffs), individually and on behalf of all other similarly situated personnel, filed a putative class action lawsuit (the Complaint) against the Company and certain subsidiaries as\nwell as certain officers of the Company (the Defendants). Plaintiffs alleged, on behalf of themselves and the putative class, that the Defendants violated certain of the New York State Labor Laws and related regulations. The Complaint sought unspecified monetary damages, together with interest, liquidated damages and attorney fees. In December 2020, the parties reached a settlement agreement resolving all issues alleged in the Complaint, which received final approval by the New York State Supreme Court in October 2022, for approximately the amount which was previously accrued. Under the terms of the court approved settlement agreement, settlement proceeds will be distributed to the Plaintiffs in the first quarter of fiscal year 2023.\n12. STOCK OPTIONS\nPrior to fiscal 2022, the Company had options outstanding under two stock option plans: the 2010 Stock Option Plan (the 2010 Plan) and the 2016 Stock Option Plan (the 2016 Plan). Options granted under both plans are exercisable at prices at least equal to the fair market value of such stock on the dates the options were granted and expire ten years after the date of grant.\nOn March 15, 2022, the shareholders of the Company approved the Ark Restaurants Corp. 2022 Stock Option Plan (the \"2022 Plan\"). Effective with this approval, the Company terminated the 2016 Plan along with the 63,750 authorized but unissued options under the 2016 Plan. Such termination did not affect any of the options previously issued and outstanding under the 2016 Plan, which remain outstanding in accordance with their terms. Under the 2022 Stock Option Plan, 500,000 options were authorized for future grant and are exercisable at prices at least equal to the fair market value of such stock on the dates the options were granted. The options expire ten years after the date of grant.\nDuring the year ended October 1, 2022, options to purchase 22,500 shares of common stock at an exercise price of $17.80 per share were granted to employees and directors of the Company (the \"2022 Grant\"). Such options are exercisable as to 25% of the shares commencing on the first anniversary of the date of grant and 25% each year thereafter. The grant date fair value of these stock options was $4.53 per share and totaled approximately $102,000.\nDuring the year ended October 2, 2021, options to purchase 110,500 shares of common stock at an exercise price of $10.65 per share were granted to employees and directors of the Company (the \"2021 Grant\"). Such options are exercisable as to 50% of the shares commencing on the second anniversary of the date of grant and as to 50% on the fourth anniversary of the date of grant. The grant date fair value of these stock options was $2.22 per share and totaled approximately $246,000.\nThe Company generally issues new shares upon the exercise of employee stock options.\nThe fair value of each of the Companys stock options is estimated on the date of grant using a Black-Scholes option-pricing model that uses assumptions that relate to the expected volatility of the Companys common stock, the expected dividend yield of the Companys stock, the expected life of the options and the risk-free interest rate. The assumptions used for the 2022 Grant include a risk-free interest rate of 3.2%, volatility of 49.7%, a dividend yield of 4.2% and an expected life of 10 years. The assumptions used for the 2021 grants include a risk-free interest rate of 0.86%, volatility of 37.1%, a dividend yield of 3.0% and an expected life of 10 years.\nThe following table summarizes stock option activity under all plans:\n2022 2021\nShares Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nContractual\nTerm Aggregate\nIntrinsic\nValue Shares Weighted\nAverage\nExercise\nPrice Aggregate\nIntrinsic\nValue\nOutstanding, beginning of\nperiod 596,476 $ 19.21 6.3 years 626,500 $ 20.41\nOptions:\nGranted 22,500 $ 17.80 110,750 $ 10.65\nExercised (48,851) $ 14.40 (49,149) $ 14.40\nCanceled or expired (26,000) $ 18.27 (91,625) $ 19.64\nOutstanding and expected to\nvest, end of period 544,125 $ 19.63 6.1 years $ 840,000 596,476 $ 19.21 $ 583,000\nExercisable, end of period 302,125 $ 21.98 4.6 years $ - 246,976 $ 20.33 $ 61,000\nShares available for future\ngrant 477,500 63,750\nCompensation cost charged to operations for the years ended October 1, 2022 and October 2, 2021 for share-based compensation programs was approximately $298,000 and $280,000, respectively. The compensation cost recognized is classified as a general and administrative expense in the consolidated statements of income.\nAs of October 1, 2022, there was approximately $543,000 of unrecognized compensation cost related to unvested stock options, which is expected to be recognized over a period of four years.\nThe following table summarizes information about stock options outstanding as of October 1, 2022:\nOptions Outstanding Options Exercisable\nRange of Exercise Prices Number of\nShares Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nRemaining\ncontractual\nlife (in years) Number of\nShares Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nRemaining\ncontractual\nlife (in years)\n$10.65 103,500 $ 10.65 8.2 - $ - 0.0\n$21.90 226,500 $ 21.90 8.2 113,250 $ 21.90 8.2\n$22.50 137,625 $ 22.50 1.7 137,625 $ 22.50 1.7\n$17.80 22,500 $ 17.80 10.0 - $ - 0.0\n$19.61 - $22.30 54,000 $ 20.69 6.3 51,250 $ 20.81 6.3\n544,125 $ 19.63 6.1 302,125 $ 21.98 4.6\nThe Company also maintains a Section 162(m) Cash Bonus Plan. Under the Section 162(m) Cash Bonus Plan, compensation paid in excess of $1,000,000 to any employee who is the chief executive officer, or one of the three highest paid executive officers on the last day of that tax year (other than the chief executive officer or the chief financial officer) is not tax deductible.\n13. INCOME TAXES\nThe Inflation Reduction Act of 2022 (the Act) was signed into U.S. law on August 16, 2022. The Act includes various tax provisions, including an excise tax on stock repurchases, expanded tax credits for clean energy incentives, and a corporate alternative minimum tax that generally applies to U.S. corporations with average adjusted financial statement income over a three-year period in excess of $1 billion. The Company does not expect the Act to materially impact its financial statements.\nOn March 27, 2020, the CARES Act was enacted to provide economic relief to those impacted by the COVID-19 pandemic. In addition to the PPP loans, the CARES Act made various tax law changes including among other things (i) modifications to the federal net operating loss rules including permitting federal net operating losses incurred in 2018, 2019, and 2020 tax\nyears to be carried back to the five preceding taxable years in order to generate a refund of previously paid income taxes, (ii) enhanced recoverability of AMT tax credit carryforwards, (iii) increased the limitation under Internal Revenue Code (\"IRC\") Section 163(j) for 2019 and 2020 to permit additional expensing of interest, and (iv) enacted a technical correction so that qualified improvement property can be immediately expensed under IRC Section 168(k).\nOn December 27, 2020, the Consolidated Appropriations Act of 2021 (CAA) was enacted and provided clarification on the tax deductibility of expenses funded with PPP loans as fully deductible for tax purposes. During the years ended October 1, 2022 and October 2, 2021, the Company recorded income of $2,420,000 and $10,400,000, respectively (including $65,000 and $84,000 of accrued interest, respectively), for financial reporting purposes related to the forgiveness of its PPP loans. The forgiveness of these amounts is not taxable.\nAs a result of the CARES Act and the CAA, the Company carried back taxable losses from fiscal years 2020 and 2021 to generate a refund of previously paid income taxes. As a result of these carrybacks, the Company recorded income tax benefits as the taxable losses from fiscal 2020 and fiscal 2021 are being carried back to tax years in which the Company was subject to a higher federal corporate income tax rate. Included in Prepaid and Refundable Income Taxes at October 1, 2022 and October 2, 2021 is $1,360,000 and $3,766,000, respectively, related to these carryback claims.\nThe provision for income taxes consists of the following:\nYear Ended\nOctober 1,\n2022 October 2,\n(in thousands)\nCurrent provision (benefit):\nFederal $ 817 $ (1,093)\nState and local 49 77\n866 (1,016)\nDeferred provision (benefit):\nFederal 173 946\nState and local 409 1,251\n582 2,197\n$ 1,448 $ 1,181\nThe effective tax rate differs from the U.S. income tax rate as follows:\nYear Ended\nOctober 1,\n2022 October 2,\n(in thousands)\nProvision at Federal statutory rate (21%) $ 2,440 $ 3,240\nState and local income taxes, net of tax benefits 275 433\nGain on forgiveness of PPP Loans (432) (1,974)\nTax credits (998) (741)\nIncome (loss) attributable to non-controlling interest (188) (287)\nChanges in tax rates 22 33\nNet operating loss carryback Federal rate benefit - (159)\nChange in valuation allowance 149 845\nOther 180 (209)\n$ 1,448 $ 1,181\nDeferred income taxes reflect the net effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting and tax purposes. Significant components of the Companys deferred tax assets and liabilities are as follows:\nOctober 1,\n2022 October 2,\n(in thousands)\nDeferred tax assets:\nState net operating loss carryforwards $ 5,293 $ 5,595\nLease liabilities 22,570 12,116\nDeferred compensation 336 310\nTax credits 2,269 2,777\nOther 604 492\nDeferred tax assets, before valuation allowance 31,072 21,290\nValuation allowance (1,407) (1,258)\nDeferred tax assets, net of valuation allowance 29,665 20,032\nDeferred tax liabilities:\nDepreciation and amortization (25,886) (15,308)\nPartnership investments (271) (566)\nPrepaid expenses (390) (458)\nDeferred tax liabilities (26,547) (16,332)\nNet deferred tax assets $ 3,118 $ 3,700\nIn assessing the realizability of deferred tax assets, management considers whether it is more likely than not that the deferred tax assets will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income. In the assessment of the valuation allowance, appropriate consideration was given to all positive and negative evidence including forecasts of future earnings and the duration of statutory carryforward periods. The Company recorded a valuation allowance of $1,407,000 and $1,258,000 as of October 1, 2022 and October 2, 2021, respectively, attributable to state and local net operating loss carryforwards which are not realizable on a more-likely-than-not basis. During the years ended October 1, 2022 and October 2, 2021, the Companys valuation allowance increased by approximately $149,000 and $845,000, respectively, as the Company determined that certain state net operating losses became unrealizable on a more-likely-than-not basis due to certain restaurant closures in the related period.\nAs of October 1, 2022, the Company had General Business Credit carryforwards of approximately $2,269,000 which expire through fiscal 2042. In addition, as of October 1, 2022, the Company has New York State net operating loss carryforwards of approximately $26,966,000 and New York City net operating loss carryforwards of approximately $25,291,000 that expire through fiscal 2041.\nA reconciliation of the beginning and ending amount of unrecognized tax benefits excluding interest and penalties is as follows:\nOctober 1,\n2022 October 2,\n(in thousands)\nBalance at beginning of year $ 120 $ 102\nAdditions based on tax positions taken in current and prior years 39 18\nDecreases based on tax positions taken in prior years - -\nBalance at end of year $ 159 $ 120\nThe entire amount of unrecognized tax benefits if recognized would reduce our annual effective tax rate. For the years ended October 1, 2022 and October 2, 2021, there are no amounts accrued for the payment of interest and penalties. The Company does not expect a significant change to its unrecognized tax benefits within the next 12 months.\nThe Company files tax returns in the U.S. and various state and local jurisdictions with varying statutes of limitations. The 2019 through 2022 fiscal years remain subject to examination by the Internal Revenue Service and most state and local tax authorities.\n14. INCOME PER SHARE OF COMMON STOCK\nBasic earnings per share is computed by dividing net income attributable to Ark Restaurants Corp. by the weighted-average number of common shares outstanding for the period. Diluted earnings per share is computed similarly to basic earnings per share, except that it reflects the effect of common shares issuable upon exercise of stock options, using the treasury stock method in periods in which they have a dilutive effect.\nA reconciliation of shares used in calculating earnings per basic and diluted share follows:\nYear Ended\nOctober 1,\n2022 October 2,\n(in thousands)\nBasic 3,556 3,516\nEffect of dilutive securities:\nStock options 47 88\nDiluted 3,603 3,604\nFor the year ended October 1, 2022, the dilutive effect of options to purchase 329,125 shares of common stock at exercise prices ranging from $20.18 per share to $22.50 per share were not included in diluted earnings per share as their impact would have been anti-dilutive.\nFor the year ended October 2, 2021, the dilutive effect of options to purchase 443,500 shares of common stock at exercise prices ranging from $21.90 per share to $22.50 per share were not included in diluted earnings per share as their impact would have been anti-dilutive.\n15. DIVIDENDS\nOn May 11, 2022 and August 10, 2022, the Board of Directors (the \"Board\") of the Company declared quarterly cash dividends of $0.125 per share which were paid on June 13, 2022 and September 13, 2022 to the stockholders of record of each share of the Company's common stock at the close of business on May 31, 2022 and August 31, 2022. Future decisions to pay dividends, and the amount of any dividend, are at the discretion of the Board and will depend upon operating performance and other factors.\n16. RELATED PARTY TRANSACTIONS\nEmployee receivables totaled approximately $440,000 and $380,000 at October 1, 2022 and October 2, 2021, respectively. Such amounts consist of loans that are payable on demand, bear interest at the minimum statutory rate (3.05% at October 1, 2022 and 0.17% at October 2, 2021), and are net of reserves for collectability.\n17. SUBSEQUENT EVENTS\nOn November 9, 2022, the Board of Directors declared a quarterly cash dividend of $0.125 per share to be paid on December 13, 2022 to shareholders of record of each share of the Company's common stock at the close of business on November 30, 2022.\nIn November 2022, the Company entered into a separation agreement with the Senior Vice President of its Las Vegas operations which requires the Company to pay $500,000 on January 1, 2023, this individual's last day of employment. In addition, the Company entered into a consulting agreement with this same individual effective January 1, 2023 for $200,000 per year expiring on December 31, 2025.\n******\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nARK RESTAURANTS CORP.\nBy: /s/ Michael Weinstein\nMichael Weinstein\nChairman of the Board and Chief Executive Officer\n(Principal Executive Officer)\nDate: December 20, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been duly signed by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Michael Weinstein Chairman of the Board and Chief Executive Officer\n(Principal Executive Officer) December 20, 2022\n(Michael Weinstein)\n/s/ Vincent Pascal Senior Vice President and Director December 20, 2022\n(Vincent Pascal)\n/s/ Anthony J. Sirica President, Chief Financial Officer and Director\n(Principal Financial and Accounting Officer) December 20, 2022\n(Anthony J. Sirica)\n/s/ Marcia Allen Director December 20, 2022\n(Marcia Allen)\n/s/ Steven Shulman Director December 20, 2022\n(Steven Shulman)\n/s/ Bruce R. Lewin Director December 20, 2022\n(Bruce R. Lewin)\n/s/ Jessica Kates Director December 20, 2022\n(Jessica Kates)\n/s/ Stephen Novick Director December 20, 2022\n(Stephen Novick)\nExhibits Index\n3.1 Certificate of Incorporation of the Registrant, filed with the Secretary of State of the State of New York on January 4, 1983.\n3.2 Certificate of Amendment of the Certificate of Incorporation of the Registrant filed with the Secretary of State of the State of New York on October 11, 1985.\n3.3 Certificate of Amendment of the Certificate of Incorporation of the Registrant filed with the Secretary of State of the State of New York on July 21, 1988.\n3.4 Certificate of Amendment of the Certificate of Incorporation of the Registrant filed with the Secretary of State of the State of New York on May 13, 1997.\n3.5 Certificate of Amendment of the Certificate of Incorporation of the Registrant filed on April 24, 2002 incorporated by reference to Exhibit 3.5 to the Registrants Quarterly Report on Form 10-Q for the quarterly period ended March 30, 2002 (the Second Quarter 2002 Form 10-Q).\n3.6 By-Laws of the Registrant, incorporated by reference to Exhibit 3.2 to the Registrants Registration Statement on Form S-18 filed with the Securities and Exchange Commission on October 17, 1985.\n*4.1\nDescription of Securities.\n10.1 Amended and Restated Redemption Agreement dated June 29, 1993 between the Registrant and Michael Weinstein, incorporated by reference to Exhibit 10.1 to the Registrants Annual Report on Form 10-K for the fiscal year ended October 2, 1999 (1994 10-K).\n10.2 Form of Indemnification Agreement entered into between the Registrant and each of Michael Weinstein, Ernest Bogen, Vincent Pascal, Robert Towers, Jay Galin, Robert Stewart, Bruce R. Lewin, Paul Gordon and Donald D. Shack, incorporated by reference to Exhibit 10.2 to the 1994 10-K.\n10.3 Form of Director and Officer Indemnification Agreement, incorporated by reference to Exhibit 10.1 to the Company's Current Report on Form 8-K filed with the Securities and Exchange Commission on July 5, 2022.\n10.4 Ark Restaurants Corp. 2004 Stock Option Plan, as amended, incorporated by reference to the Registrants Definitive Proxy Statement pursuant to Section 14(a) of the Securities Exchange Act of 1934 filed on January 26, 2004.\n10.5 Ark Restaurants Corp. 2010 Stock Option Plan, incorporated by reference to the Registrants Definitive Proxy Statement pursuant to Section 14(a) of the Securities Exchange Act of 1934 filed on February 1, 2010.\n10.6 Ark Restaurants Corp. 2022 Stock Option Plan, incorporated by reference to Appendix A to the Company's Definitive Proxy Statement filed with the Securities and Exchange Commission on January 28, 2022.\n10.7 Securities Purchase Agreement, by and between the Registrant and Estate of Irving Hershkowitz, incorporated by reference to Exhibit 10.01 to the Registrants Current Report on Form 8-K filed on December 15, 2011.\n10.8 Promissory Note, in the principal amount of $2,125,000, issued by the Company to Estate of Irving Hershkowitz, incorporated by reference to Exhibit 10.02 to the Registrants Current Report on Form 8-K filed on December 15, 2011.\n10.9 Promissory Note made by the Registrant to Bank Hapoalim B.M., issued as of February 25, 2013, incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on March 1, 2013.\n10.10 Asset Purchase Agreement dated as of November 22, 2013 by and between W and O, Inc. and Ark Rustic Inn LLC, incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K filed on November 26, 2013.\n10.11 Amended and Restated Promissory Note made by the Company to Bank Hapoalim B.M., issued as of February 24, 2014, incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K filed on February 28, 2014.\n10.12 Term or Installment Loan Rider to Promissory Note to Bank Hapoalim B.M, incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed on February 28, 2014.\n10.13 Commercial Contract Agreement and Rider to Commercial Contract Agreement both dated as of August 10, 2015 by and between Ark Shuckers Real Estate LLC and D.C. Holding Company, Inc., incorporated by reference to Exhibit 10.1 and 10.2 to the Registrants Current Report on Form 8-K filed on October 28, 2015.\n10.14 Restaurant Asset Purchase Agreement dated as of August 10, 2015 by and between Ark Shuckers LLC and Ocean Enterprises, Inc. incorporated by reference to Exhibit 10.3 to the Registrants Current Report on Form 8-K filed on October 28, 2015.\n10.15 Management Purchase Agreement dated as of August 10, 2015 by and between Ark Island Beach Resort LLC and Island Beach Resort, Inc. incorporated by reference to Exhibit 10.4 to the Registrants Current Report on Form 8-K filed on October 28, 2015.\n10.16 Credit Agreement (Term Facility) between the Company and Bank Hapoalim B.M. issued as of October 21, 2015 incorporated by reference to Exhibit 10.5 to the Registrants Current Report on Form 8-K filed on October 28, 2015.\n10.17 Term Promissory Note issued by the Company in favor of Bank Hapoalim B.M. on October 21, 2015 incorporated by reference to Exhibit 10.6 to the Registrants Current Report on Form 8-K filed on October 28, 2015.\n10.18 Credit Agreement (Revolving Facility) and Form of Revolving Promissory Note between the Company and Bank Hapoalim B.M. issued as of October 21, 2015 incorporated by reference to Exhibit 10.7 and 10.8 to the Registrants Current Report on Form 8-K filed on October 28, 2015.\n10.19 Asset Purchase Agreement dated as of October 21, 2016, by and between Ark Gulf Shores Real Estate, LLC, Ark Oyster House Gulf Shores I, LLC, Original Oyster House, Inc. and Premium Properties, Inc. including the Real Estate Purchase and Sale Agreement incorporated by reference to Exhibit 2.1 to the Registrants Current Report on Form 8-K filed on November 16, 2016.\n10.20 Asset Purchase Agreement dated as of October 21, 2016, by and between Ark Oyster House Causeway II, LLC, Ark Causeway Real Estate, LLC, Original Oyster House II, Inc. and Gumbo Properties, L.L.C. including the Real Estate Purchase and Sale Agreement incorporated by reference to Exhibit 2.2 to the Registrants Current Report on Form 8-K filed on November 16, 2016.\n10.21 ROFR Purchase and Sale Agreement dated as of October 13, 2016 by and between SCFRC-HWG, LLC and Ark Jupiter RI, LLC incorporated by reference to Exhibit 2.3 to the Registrants Current Report on Form 8-K filed on November 16, 2016.\n10.22 Purchase and Sale Agreement between Ark Jupiter RI, LLC and 1065 A1A, LLC, incorporated by reference to Exhibit 2.4 to the Registrants Current Report on Form 8-K filed on November 16, 2016.\n10.23 Second Amendment to Credit Agreement (Revolving Facility) dated as of November 30, 2016, by and between Ark Restaurant Corp. and Bank Hapoalim B.M incorporated by reference to Exhibit 10.1 to the Registrants Current Report on Form 8-K/A filed on January 27, 2017.\n10.24 Mortgage and Security Agreement (Alabama) dated as of November 30, 2016, by and between Ark Gulf Shores Real Estate LLC and Ark Causeway Real Estate LLC and Bank Hapoalim B.M incorporated by reference to Exhibit 10.2 to the Registrants Current Report on Form 8-K/A filed on January 27, 2017.\n10.25 Amended and Restated Credit Agreement (Revolving Facility) dated as of June 1, 2018, by and between Ark Restaurants Corp. and Bank Hapoalim B.M.\n10.26 Amended and Restated Promissory Note, dated as of June 1, 2018, by and between Ark Restaurants Corp. and Bank Hapoalim B.M. that restates and renews the Term Promissory Note, dated October 21, 2015 secured by the assets of Ark Shuckers Real Estate LLC.\n10.27 Amended and Restated Promissory Note, dated as of June 1, 2018, by and between Ark Restaurants Corp. and Bank Hapoalim B.M. that restates and renews the Term Promissory Note, dated February 24, 2014 secured by the assets of Ark Rustic Inn Real Estate LLC.\n10.28 Amended and Restated Promissory Note, dated as of June 1, 2018, by and between Ark Restaurants Corp. and Bank Hapoalim B.M. that restates and renews the Term Promissory Note, dated November 30, 2016 secured by the assets of Ark Gulf Shores Real Estate LLC.\n10.29 Amended and Restated Promissory Note, dated as of June 1, 2018, by and between Ark Restaurants Corp. and Bank Hapoalim B.M. that restates and renews the Term Promissory Note, dated November 30, 2016 secured by the assets of Ark Causeway Real Estate LLC.\n10.30 Amended and Restated Credit Agreement (Revolving Facility), dated as of May 15, 2019, by and between Ark Restaurants Corp. and Bank Hapoalim B.M.\n10.31 Asset Purchase Agreement, dated as of February 21, 2019, by and between Ark Restaurants Corp., Beach House, LLC and Boyle Beach House, LLC.\n10.32 Promissory Note in the amount of $7,000,000, dated as of May 15, 2019, by and between Ark Restaurants Corp. and Bank Hapoalim B.M.\n10.33 Promissory Note in the amount of $3,200,000, dated as of May 15, 2019, by and between Ark Restaurants Corp. and Bank Hapoalim B.M.\n14 Code of Ethics, incorporated by reference to Exhibit 14.1 to the Registrants Annual Report on Form 10-K for the fiscal year ended September 27, 2003.\n*21 Subsidiaries of the Registrant.\n*23 Consent of CohnReznick LLP.\n*31.1 Certification of Chief Executive Officer.\n*31.2 Certification of Chief Financial Officer.\n**32 Section 1350 Certification.\n101.INS** XBRL Instance Document\n101.SCH** XBRL Taxonomy Extension Schema Document\n101.CAL** XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF** XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB** XBRL Taxonomy Extension Label Linkbase Document\n101.PRE** XBRL Taxonomy Extension Presentation Linkbase Document\n104 Cover Page Interactive Data File (formatted as inline XBRL with applicable taxonomy extension information contained in Exhibits 101)\n* Filed herewith.\n** Furnished herewith."
}