{
    "cik": "784539",
    "company": "EACO CORP",
    "filing_type": "10-K",
    "filing_date": "2022-11-04",
    "period_of_report": "2022-08-31",
    "sic": "5065",
    "state_of_inc": "FL",
    "state_location": "CA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/784539/0001410578-22-002955-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/784539/000141057822002955/eaco-20220831x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/784539/0001410578-22-002955.txt",
    "filename": "784539_10K_2022_0001410578-22-002955.htm",
    "content": "Item 1. Business\nEACO Corporation (EACO), incorporated in Florida in September 1985, is a holding company, primarily comprised of its wholly-owned subsidiary, Bisco Industries, Inc. (Bisco) and Biscos wholly-owned Canadian subsidiary, Bisco Industries Limited. Substantially all of EACOs operations are conducted through Bisco and Bisco Industries Limited. Bisco is a distributor of electronic components and fasteners with 51 sales offices and seven distribution centers located throughout the United States and Canada and 1 additional sales office location in the Philippines. Bisco supplies parts used in the manufacture of products in a broad range of industries, including the aerospace, circuit board, communication, computer, fabrication, instrumentation, industrial equipment and marine industries.\nBisco commenced operations in Illinois in 1973 and was incorporated in 1974. Biscos principal executive offices are located at 5065 East Hunter Avenue, Anaheim, California 92807, which also serves as the principal executive offices of EACO. EACOs website address is www.eacocorp.com and Biscos website address is www.biscoind.com. The inclusion of these website addresses in this annual report does not include, or incorporate by reference into this annual report, any information on or accessible through the websites.\nEACO, Bisco and Bisco Industries Limited are collectively referred to herein as the Company, we, us and our.\nOperations\nProducts and Services\nBisco stocks thousands of items from more than 260 manufacturers. Biscos products include electronic components such as spacers and standoffs, card guides and ejectors, component holders and fuses, circuit board connectors, and cable components, as well as a large variety of fasteners and hardware. The breadth of Biscos products and extensive inventory provide a one-stop shopping experience for many customers.\nBisco also provides customized services and solutions for a wide range of production needs, including special packaging, bin stocking, kitting and assembly, bar coding, electronic requisitioning, and integrated supply programs, among others.\nDivisions\nBisco Industries\nBisco sells a broad spectrum of products that it offers to many markets, but primarily sells to original equipment manufacturers (OEMs). While historically, the substantial majority of Biscos revenues have been derived from the Bisco Industries division, Bisco has also established additional divisions that specialize in specific industries and products. Bisco believes that the focus by industry and/or product enhances Biscos ability to provide superior service and devise tailored solutions for its customers.\nNational-Precision\nThe National-Precision division primarily sells electronic hardware and commercial fasteners to OEMs in the aerospace, fabrication and industrial equipment industries. National-Precision seeks to be the leading global distributor of mil-spec and commercial fasteners, hardware and distribution services used in production.\nFast-Cor\nThe Fast-Cor division was established to be a distributors source for a broad range of components and fasteners. Fast-Cor has access to the entire inventory of products that Bisco offers but primarily focuses on selling to other distributors, not manufacturers.\nCustomers and Sales\nBiscos customers operate in a wide variety of industries and range from large global companies to small local businesses. Bisco strives to provide exceptional service to all customers, including smaller businesses, and continues to focus on growing its share of that market. As of August 31, 2022, Bisco had more than 10,000 customers; however, no single customer accounted for more than 10% of Biscos revenues for the fiscal year ended August 31, 2022. For each of the fiscal years ended August 31, 2022 and 2021 (fiscal 2022 and fiscal 2021, respectively), Biscos top 20 customers represented in the aggregate approximately 12% of Biscos revenues.\nBisco generally sells its products through its sales representatives in its 51 sales offices located in the United States and Canada and 1 additional sales office in the Philippines. Customers can also place orders through Biscos website. Bisco currently maintains seven distribution centers located in Anaheim and San Jose, California; Dallas, Texas; Chicago, Illinois; Boston, Massachusetts; Atlanta, Georgia; and Toronto, Canada. Each of Biscos selling facilities and distribution centers are linked to Biscos central computer system, which provides Biscos management and salespersons with online, real-time data regarding inventory levels throughout Bisco and facilitates control of purchasing, shipping and billing. Bisco generally ships products to customers from one of its seven distribution centers, based on the geographic proximity to the customer and the location of the available ordered products.\nBisco sells its products primarily in the United States, Canada, and countries within Asia. Biscos international sales represented 11.8% and 10.6% of its sales in fiscal 2022 and fiscal 2021, respectively. Sales to customers in Canada accounted for approximately 27% and 30% of such international sales in fiscal 2022 and fiscal 2021, respectively. Sales to customers located within Asia accounted for approximately 48% of such international sales in fiscal 2022 and fiscal 2021. Sales to customers in other countries make up 25% and 22% of such international sales in fiscal 2022 and fiscal 2021, respectively\nSuppliers\nAs of August 31, 2022, Bisco offered products from over 260 manufacturers. The Companys authorized distributor agreements with most manufacturers are typically cancelable by either party at any time or on short notice. While Bisco doesnt manufacture its products, it does perform kitting and packaging of existing products for certain of its customers. Although Bisco sells more products of certain brands, Bisco believes that most of the products it sells are available from other sources at competitive prices. No single supplier accounted for more than 10% of Biscos purchases in fiscal 2022 or fiscal 2021.\nHuman Capital Resources\nAs of August 31, 2022, the Company had 506 full-time employees, which include 313 sales and marketing employees, 82 management, administrative and finance employees, 64 warehouse and fulfillment personnel and 47 supply chain management employees. None of our employees are subject to a collective bargaining agreement.\nA key element of our business strategy is to expand our operations and revenues by opening additional sales offices in new geographic locations, and we plan to add additional sales personnel to support such new offices. During fiscal 2022, the Company opened 2 new sales office locations. The Company believes it has been successful in attracting and retaining qualified sales personnel for these new positions. We continue to focus on employee development and training, and embrace diversity and inclusion. We believe an innovative workforce needs to be diverse and leverage the skills and perspectives of a wealth of backgrounds and experiences.\nCompliance with Government Regulations\nWe are not aware of the need for any government approvals for our products. Because we use contract manufacturers, any laws regarding the manufacturing of the products we distribute will typically be the responsibility of our contract manufacturers. Prior to entering into any contracts with new manufacturers, we typically conduct diligence to determine that the manufacturer has satisfied all such requirements. We do not believe that we are subject to any state or federal environmental laws. Item 1A. Risk Factors\nOur business is subject to a number of risks, some of which are discussed below. The risk factors discussed in this section should be considered together with information included elsewhere in this Annual Report on Form 10-K and should not be considered the only risks to which the Company is exposed. If any of the risks actually occur, our business, financial condition, or results of operations could be seriously harmed. In that event, the market price for shares of our common stock may decline, and you could lose all or part of your investment.\nCOVID-19 Risks\nOur business and results of operations may be adversely impacted as a result of the recent COVID-19 outbreak.\nOn March 11, 2020, the World Health Organization designated the coronavirus (COVID-19) as a pandemic. The Company has incurred some disruptions to its business activities and supply chain during this time. The Company has had to temporarily close its 52 sales offices to the public, and has experienced temporary closures of certain offices from time to time to keep our employees safe. We have also shifted more than half of our sales force to remote operations and have implemented changes our warehouse and distribution operations to protect our employees. As a result, we may experience delays in our responses to our customers and possible delays in shipments of our products, which could harm our customer relations and adversely impact our sales. In addition, certain of our customers have closed or reduced their operations during this pandemic, and government restrictions could also further restrict our business and result in supply chain interruptions in the future. While our sales continue to remain strong, we cannot predict how long the pandemic will last or the impact of such pandemic on our financial condition and results of operations.\nCompany and Operational Risks\nWe generally do not have long-term supply agreements or guaranteed price or delivery arrangements with the majority of our suppliers.\nIn most cases, we have no guaranteed price or delivery arrangements with our suppliers. Consequently, we may experience inventory shortages on certain products from time to time. Furthermore, our industry occasionally experiences significant product supply shortages and customer order backlogs due to the inability of certain manufacturers to supply products as needed. We cannot assure you that our suppliers will maintain an adequate supply of products to fulfill our orders on a timely basis, at a recoverable cost, or at all, or that we will be able to obtain particular products on favorable terms or at all. Additionally, we cannot assure you that product lines currently offered by suppliers will continue to be available to us. A decline in the supply or continued availability of the products of our suppliers, or a significant increase in the price of those products, could reduce our sales, harm our reputation and negatively affect our operating results.\nOur supply agreements are generally terminable at the suppliers discretion.\nSubstantially all of the agreements we have with our suppliers, including our authorized distributor agreements, are terminable with little or no notice or penalty. Suppliers that currently sell their products through us could decide to sell, or increase their sales of, their products directly or through other distributors or channels. Any termination, interruption or adverse modification of our relationship with a key supplier or a significant number of other suppliers would likely adversely affect our operating income, cash flow and future prospects.\nWe generally do not have long-term sales contracts with our customers.\nMost of our sales are made on a purchase order basis, rather than through long-term sales contracts. As such, our customers typically do not have any obligation to purchase any products from us. A variety of conditions, both specific to each customer and generally affecting each customers industry, may cause customers to reduce, cancel or delay orders that were either previously made or anticipated. In addition, customers may go bankrupt or fail, or default on their payments. Significant or numerous cancellations, reductions, delays in orders by customers, losses of customers, and/or customer defaults on payment could materially adversely affect our business and revenues.\nWe rely on third party suppliers for most of our products, and may not be able to identify and procure relevant new products and products lines that satisfy our customers needs on favorable terms and prices, or at all.\nWe currently rely on a large number of third party suppliers for most of our products. Since we do not manufacture our products, we rely on these suppliers to provide quality products that are in demand by our customers. Our success depends in part on our ability to develop product expertise and continue to identify and provide future high quality products and product lines that complement our existing products and product lines and that respond to our customers needs. We may not be able to compete effectively unless we can continue to offer a broad range of high quality, reliable products that address the trends in the markets in which we compete.\nOur advertising and marketing efforts may be costly and may not achieve desired results.\nWe expect to continue to incur substantial expense in connection with our advertising and marketing efforts. Postage represents a significant advertising expense for us because we generally mail flyers to current and potential customers through the U.S. Postal Service. Any future increases in postal rates will increase our mailing expenses and could have a material adverse effect on our business, financial condition and results of operations. For fiscal 2022 and fiscal 2021, we spent $427,000 and $415,000 on advertising, respectively.\nIncreases in the costs of energy, shipping and raw materials used in our products could impact our cost of goods and distribution and occupancy expenses, which would result in lower operating margins.\nCosts of raw materials used in our products and energy costs have been rising during the last several years, which has resulted in increased production costs for our suppliers. These suppliers typically look to pass their increased costs along to us through price increases. The shipping costs for our products have risen as well and may continue to rise. While we typically try to pass increased supplier prices and shipping costs through to our customers or to modify our activities to mitigate the impact, we may not be successful. Failure to fully pass these increased prices and costs through to our customers or to modify our activities to mitigate the impact would have an adverse effect on our operating margins and could make our products less competitive, either of which could adversely impact our margins and results of operations.\nThe unauthorized access to, or theft or destruction of, customer or employee personal, financial or other data or of our proprietary or confidential information that is stored in our information systems or by third parties on our behalf could impact our reputation and brand and expose us to potential liability and loss of revenues.\nThe protection of customer, employee and Company data is critical to us. We are subject to laws relating to information security, privacy, cashless payments, consumer credit and fraud. Additionally, an increasing number of government and industry groups have established laws and standards for the protection of personal information. The regulatory environment surrounding information security and privacy is increasingly demanding, with the frequent imposition of new and constantly changing requirements. Compliance with these requirements may result in cost increases due to necessary system changes and the development of new administrative processes. If we fail to comply with laws and regulations regarding privacy and security, we could be subject to significant fines, and become subject to investigations, litigation and the disruption of our operations.\nIn the ordinary course of business, we receive and maintain credit card and other personal information from our customers, employees and vendors. Customers and employees have a high expectation that we will adequately protect their personal information. Third parties may have the technology or know-how to breach the security of this customer information, and our security measures and those of our technology vendors may not effectively prohibit others from obtaining improper access to this information. A number of retailers have experienced security breaches in which credit and debit card information may have been stolen. While we have not experienced a cyber attack, we are working with a third party vendor to assist us in safeguarding our systems and protecting the personal information of our customers, employees and vendors. Our analysis may not be able to adequately address or remedy the potential harm, which could result in the assessment against us for large remedial costs and other penalties, and could damage our reputation and adversely impact our customers.\nWe rely heavily on our internal information systems, which, if not properly functioning, could materially and adversely affect our business.\nOur information systems have been in place for many years and are subject to system failures as well as problems caused by human error, which could have a material adverse effect on our business. Many of our systems consist of a number of legacy or internally developed applications, which can be more difficult to upgrade to commercially available software. It may be time consuming and costly for us to retrieve data that is necessary for management to evaluate our systems of control and information flow. In the future, management may decide to convert our information systems to a single enterprise solution. Such a conversion, while it would enhance the accessibility and reliability of our data, could be expensive and would not be without risk of data loss, delay or business interruption. Maintaining and operating these systems requires continuous investments. Failure of any of these internal information systems or material difficulties in upgrading these information systems could have material adverse effects on our business and our timely compliance with our reporting obligations.\nWe may not be able to attract and retain key personnel.\nOur future performance will depend to a significant extent upon the efforts and abilities of certain key management and other personnel, including Glen Ceiley, our Chairman and CEO, as well as other executive officers and senior management. The loss of service of one or more of our key management members could have a material adverse effect on our business.\nThe competitive pressures we face could have a material adverse effect on our business.\nThe market for our products and services is very competitive. We compete for customers with other distributors, who sell similar or sometimes identical products, as well as with many of our suppliers. A failure to maintain and enhance our competitive position could adversely affect our business and prospects. Furthermore, our efforts to compete in the marketplace could cause deterioration of gross profit margins and, thus, overall profitability. Some of our competitors may have greater financial, personnel, capacity and other resources or a more extensive customer base than we do.\nExpansion Risks\nOur strategy of expanding into new geographic areas could be costly and may not expand our revenues.\nOne of our primary growth strategies is to grow our business through the opening of sales offices in new geographic markets. This strategy requires continued investment, both financially, as well as managements efforts to get the new offices operational. Based on our analysis of demographics in the United States, Canada, Mexico and countries within Asia, we currently estimate there is potential market opportunity in North America and Asia to support additional sales offices. We cannot guarantee that our estimates are accurate or that we will open enough offices to capitalize on the full market opportunity or that any new offices will be successful or profitable in the near future, or at all. In addition, a particular local markets ability to support a sales office may change due to competition or local economic conditions.\nWe may be unable to meet our goals regarding new office openings.\nOur growth, in part, is primarily dependent on our ability to attract new customers. Historically, our most effective way to attract new customers has been opening new sales offices in additional geographic regions or new markets. During fiscal 2022, the Company opened two new geographical sales locations and relocated some existing locations to larger office locations within its original region. Given the recent economic uncertainty, we may not be able to open or grow new offices at our projected or desired rates or hire the qualified sales personnel necessary to make such new offices successful. Failure to do so could negatively impact our long-term growth and market share.\nOpening sales offices in new markets presents increased risks that may prevent us from being profitable in these new locations, and/or may adversely affect our operating results.\nOur new sales offices do not typically achieve operating results comparable to our existing offices until after several years of operation. The added expenses relating to payroll, occupancy, and transportation costs can impact our ability to generate earnings. Offices in new geographic areas face additional challenges to achieving profitability, and we cannot guarantee how long it will take new offices to become profitable, or that such offices will ever become profitable. In new markets, we have less familiarity with local customer preferences and customers in these markets are less familiar with our name and capabilities. Entry into new markets may also bring us into competition with new, unfamiliar competitors. These challenges associated with opening new offices in new markets may have an adverse effect on our business and operating results.\nOur ability to successfully attract and retain qualified sales personnel is uncertain.\nOur success depends in large part on our ability to attract, motivate, and retain a sufficient number of qualified sales employees, who understand and appreciate our strategy and culture and are able to adequately represent us to our customers. Qualified individuals of the requisite caliber and number needed to fill these positions may be in short supply in some areas, and the turnover rate in the industry is high. If we are unable to hire and retain personnel capable of consistently providing a high level of customer service, as demonstrated by their enthusiasm for our culture and product knowledge, our sales could be materially adversely affected. Additionally, competition for qualified employees could require us to pay higher wages to attract a sufficient number of employees. An inability to recruit and retain a sufficient number of qualified individuals in the future may also delay the planned openings of new offices. Any such delays, material increases in existing employee turnover rates, or increases in labor costs, could have a material adverse effect on our business, financial condition or operating results.\nFinancial Risks\nWe have incurred significant losses in the past from trading in securities, and we may incur such losses in the future, which may also cause us to be in violation of covenants under our loan agreement.\nBisco has historically supplemented its capital resources in part from cash generated by trading in marketable domestic equity securities. Biscos investment strategy includes taking both long and short positions, as well as utilizing options to maximize return. This strategy can lead, and has led, to significant losses from time to time based on market conditions and trends, as well as the performance of the specific companies in which we invest. We may incur losses in future periods from such trading activities, which could materially and adversely affect our liquidity and financial condition.\nIn addition, unanticipated losses from our trading activities may cause Bisco to be in violation of certain covenants under its line of credit agreement with Citizens Business Bank, located in Anaheim, CA. The agreement is secured by substantially all of Biscos assets. The loan agreement contains covenants which require that, on a quarterly basis, Biscos losses from trading in securities not exceed its pre-tax operating income. We cannot assure you that unanticipated losses from our trading activities will not cause us to violate our covenants in the future or that the bank will grant a waiver for any such default or that it will not exercise its remedies, which could include the refusal to allow additional borrowings on the line of credit or the acceleration of the obligations maturity date and foreclosure on Biscos assets, with respect to any such noncompliance, which could have a material adverse effect on our business and operations.\nWe may not have adequate or cost-effective liquidity or capital resources.\nOur ability to satisfy our cash needs depends on our ability to generate cash from operations and to access our line of credit and the capital markets, which are subject to general economic, financial, competitive, legislative, regulatory and other factors that are beyond our control. As of August 31, 2022, there was zero outstanding on our line of credit, which line of credit is secured by substantially all of Biscos assets. Further, the Company has a loan agreement with the Bank for approximately $4.6 million that financed the tenant improvements on the new corporate headquarters. See Note 4 of the Notes to Consolidated Financial Statements, included in Part II, Item 8 of this report for further explanation. Our ability to continue to secure financing is subject to our satisfaction of certain covenants contained in such agreements. As a result of the recent economic uncertainty due to the COVID pandemic, we may need to pursue additional debt or equity financing, which funding may not be available on acceptable or favorable terms, on a timely basis or at all. The securities that might be issued in any future equity financing may have rights, preferences, and privileges that are senior to our common stock. Our failure to obtain such funding could adversely impact our ability to execute our business plan and our financial condition and results of operations.\nWe are exposed to foreign currency exchange rate risk, and changes in foreign exchange rates could increase our costs to procure products and impact our foreign sales.\nBecause the functional currency related to our Canadian operations and certain of our foreign vendor purchases is the applicable local currency, we are exposed to foreign currency exchange rate risk arising from transactions in the normal course of business. Fluctuations in the relative strength of foreign economies and their related currencies could adversely impact our ability to procure products overseas at competitive prices and our foreign sales. Historically, our primary exchange rate exposure has been with the Canadian dollar.\nConcentration of Ownership Risks\nThe Companys Chairman and CEO holds almost all of our voting stock and can control the election of directors and significant corporate actions.\nGlen Ceiley, our Chairman and CEO, beneficially owns or controls approximately 96% of our outstanding voting stock. As such, Mr. Ceiley is able to exert significant influence over the outcome of almost all corporate matters, including the election of the Board of Directors and significant corporate transactions requiring a stockholder vote, such as a merger or a sale of the Company or our assets. This concentration of ownership and influence in management and board decision-making could also harm the price of our common stock by, among other things, discouraging a potential acquirer from seeking to acquire shares of our common stock (whether by making a tender offer or otherwise) or otherwise attempting to obtain control of the Company.\nSales of our common stock by Glen Ceiley could cause the price of our common stock to decline.\nThere is currently no established trading market for our common stock, and the volume of any stock sales has generally been low. As of August 31, 2022, the number of shares held by non-affiliates of Mr. Ceiley was less than 200,000 shares. If Mr. Ceiley sells or seeks to sell a substantial number of his shares of our common stock in the future, the market price of our common stock could decline. The perception among investors that these sales may occur could produce the same effect. Due to the limited available public float, certain investors may not be able or willing to invest in the Companys securities, which could also impact the market price of our common stock.\nGeneral Risk Factors\nChanges and uncertainties in the economy have harmed and could continue to harm our operating results.\nAs a result of the continuing economic uncertainties primarily caused by the impact of the COVID-19 pandemic, our operating results, and the economic strength of our customers and suppliers, are increasingly difficult to predict. Sales of our products are affected by many factors, including, among others, general economic conditions, interest rates, inflation, liquidity in the credit markets, unemployment trends, shipping costs, geopolitical events, and other factors. Although we sell our products to customers in a broad range of industries, if economic conditions significantly weaken on a global scale it may cause some of our customers to experience a slowdown, from time to time, which may in turn have an adverse effect on our sales and operating results. Changes and uncertainties in the economy also increase the risk of uncollectible accounts receivable. The pricing we receive from suppliers may also be impacted by general economic conditions. Continued and future changes and uncertainties in the economic climate in the United States and elsewhere could have a similar negative impact on the rate and amounts of purchases by our current and potential customers, create price inflation for our products, or otherwise have a negative impact on our expenses, gross margins and revenues, and could hinder our growth.\nIf we fail to maintain an effective system of internal controls over financial reporting or experience material weaknesses in our system of internal controls, we may not be able to report our financial results accurately or timely or detect fraud, which could have a material adverse effect on the market price of our common stock and our business.\nWe have from time to time had material weaknesses in our internal controls over financial reporting due to a variety of issues, including, without limitation, significant deficiencies in the process related to the preparation of our financial statements, segregation of duties, sufficient control in the area of financial reporting oversight and review, and appropriate personnel to ensure the complete and proper application of GAAP as it relates to certain routine accounting transactions. Although we believe we have addressed these material weaknesses, we may experience material weaknesses or significant deficiencies in the future and may fail to maintain a system of internal control over financial reporting that complies with the applicable reporting. Our failure to address any deficiencies or weaknesses in our internal control over financial reporting or to properly maintain an effective system of internal control over financial reporting could impact our ability to prevent fraud or to issue our financial statements in a timely manner that presents fairly, in accordance with GAAP, our financial condition and results of operations. The existence of any such deficiencies and/or weaknesses, even if cured, may also lead to the loss of investor confidence in the reliability of our financial statements, could harm our business and negatively impact the trading price of our common stock. Such deficiencies or material weaknesses may also subject us to lawsuits, investigations and other penalties. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nWe have 51 sales offices and seven distribution centers located throughout the United States and in Canada and have 1 additional sales office location in Asia located in the Philippines. In September 2019, Bisco entered into Commercial Lease Agreement (the Hunter Lease) with the Glen F. Ceiley and Barbara A. Ceiley Revocable Trust (the Trust), which is the grantor trust of Glen Ceiley, our Chief Executive Officer, Chairman of the Board and majority shareholder (the Trust), and has a lease term that expires on August 31, 2029. Pursuant to the Hunter Lease, Bisco has leased from the Trust approximately 80,000 square feet of office and warehouse space located at 5065 East Hunter Avenue, Anaheim, California (the Hunter Property). The Company moved its corporate headquarters to the Hunter Property in March 2020. The initial base rent for the Hunter Lease is $66,300 per month, which increases by 2.5% annually over the term of the lease.\nBisco also leases its Chicago area sales office and distribution center located in Glendale Heights, Illinois under an operating lease agreement (the Chicago Lease) from the Trust, which has a term that expires in May 2029. The initial base rent for this lease is $22,600 per month, which increases by 2.5% annually over the term of the lease.\nAll of our other properties are leased, consisting of sales offices and warehouse space. Leases of sales offices generally have a lease term of three years and warehouse locations usually have a lease term of five to ten years. For additional information regarding our obligations under property leases, see Note 8 of the Notes to Consolidated Financial Statements, included in Part II, Item 8 of this report. Item 3. Legal Proceedings\nFrom time to time, the Company may be named in claims arising in the ordinary course of business. Currently, we are not a party to any legal proceedings that, in the opinion of our management, would reasonably be expected to have a material adverse effect on our business or financial condition. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information and Holders\nThe Companys common stock is quoted on OTC Pink operated by the OTC Markets Group Inc., and previously on the OTC Bulletin Board, under the trading symbol EACO; however, the Companys common stock typically has low trading volumes.\nAs of August 31, 2022, the Company had no equity compensation plans. The Company did not grant or issue any unregistered shares of common stock during the fiscal 2022. The Company did not repurchase any of its own common stock during fiscal 2022.\nAs of November 4, 2022, the Company had approximately 214 shareholders of record.\nDividend Policy\nThe Company has never paid cash dividends on its common stock and does not expect to pay any cash dividends on its common stock in the foreseeable future. Item 6. Selected Financial Data\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and is not required to provide the information required under this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results Of Operations\nYou should read the following discussion of our financial condition and results of operations in conjunction with our consolidated financial statements and the related notes included in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K. In addition to our historical consolidated financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to these differences include those discussed below and elsewhere in this Annual Report on Form 10-K, particularly in Part I, Item 1A, Risk Factors.\nOverview\nEACO is a holding company primarily comprised of its wholly-owned subsidiary, Bisco, and includes Biscos wholly-owned Canadian subsidiary, Bisco Industries Limited. Bisco is a distributor of electronic components and fasteners with 51 sales offices and seven distribution centers located throughout North America and 1 sales office in Asia located in the Philippines. Bisco supplies parts used in the manufacture of products in a broad range of industries, including the aerospace, circuit board, communication, computer, fabrication, instrumentation, industrial equipment and marine industries.\nImpact of COVID-19 on our Business\nWith respect to the ongoing and evolving coronavirus (COVID-19) outbreak, which was designated as a pandemic by the World Health Organization on March 11, 2020, the outbreak has caused substantial disruption in international and U.S. economies and markets. The outbreak has had, and may continue to have, an adverse impact on the Company, as well as the industries that the Company serves, such as the aerospace, electronic parts, and industrial equipment industries. The Company has had to temporarily close its 52 sales offices to the public, and has experienced temporary closures of certain offices from time to time to keep our employees safe. We have also shifted more than half of our sales force to remote operations and have implemented changes to our warehouse and distribution operations to protect our employees. If repercussions of the outbreak are prolonged, it could have a significant adverse impact to the underlying industries of some of the Companys customers. To date, the Company has incurred disruptions to its business activities and supply chain. Management cannot, at this point, estimate ultimate losses related to the COVID-19 outbreak, if any, and accordingly no adjustments were reflected in the accompanying financial statements related to this matter.\nCritical Accounting Policies and Estimates\nRevenue Recognition\nWe derive our revenue primarily from product sales. We determine revenue recognition through the following steps: (1) identification of the contract with a customer; (2) identification of the performance obligations in the contract; (3) determination of the transaction price; (4) allocation of the transaction price to the performance obligations in the contract; and (5) recognition of revenue when, or as, we satisfy a performance obligation.\nThe Companys performance obligations consist solely of product shipped to customers. Revenue from product sales is recognized upon transfer of control of promised products to customers at a point in time in an amount that reflects the consideration we expect to receive in exchange for these products. Revenue is recognized net of returns and any taxes collected from customers. We offer industry standard contractual terms in our purchase orders.\nDeferred Tax Assets\nOur income tax expense, deferred tax assets (DTAs) and deferred tax liabilities (DTLs) reflect managements best estimate of current and future taxes to be paid. We are subject to income taxes in the United States. Significant judgments and estimates are required in the determination of the consolidated income tax expense.\nDeferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements, which will result in taxable or deductible amounts in the future. In evaluating our ability to recover our DTAs in the jurisdiction from which they arise, we consider all available positive and negative evidence, including scheduled reversals of DTLs, projected future taxable income, tax-planning strategies, and results of recent operations. In projecting future taxable income, we begin with historical results adjusted for the results of discontinued operations and incorporate assumptions about the amount of future state, federal, and foreign pretax operating income adjusted for items that do not have tax consequences. The assumptions about future taxable income require the use of significant judgment and are consistent with the plans and estimates we are using to manage the underlying businesses. In evaluating the objective evidence that historical results provide, we consider three years of cumulative operating income.\nInventory\nThe Companys inventory provisions for obsolescence are based upon managements review of inventories on-hand over their expected future utilization and length of time held by the Company. The Companys methodology for estimating these adjustments to the cost basis is evaluated for factors that could require changes to the cost basis including significant changes in product demand, market conditions, condition of the inventory or net realizable value. If business or economic conditions change, the Companys estimates and assumptions may be adjusted as deemed appropriate.\nResults of Operations\nComparison of the Fiscal Years Ended August 31, 2022 and 2021\nRevenues and Gross Margin (dollars in thousands)\nFiscal Years Ended August 31,\n$\n%\nChange\nChange\nRevenues\n$\n292,562\n$\n237,962\n$\n54,600\n22.9\n%\nCost of revenues\n209,060\n177,177\n31,883\n18.0\n%\nGross margin\n$\n83,502\n60,785\n$\n22,717\n37.4\n%\nPercent of revenues\n28.5\n%\n25.5\n%\nRevenues consist primarily of sales of component parts and fasteners and also include, to a lesser extent, kitting charges and special order fees, as well as freight charged to customers. The increase in revenues in fiscal 2022 compared to fiscal 2021 was largely due to a higher volume of product sales due to a better economic environment creating additional buying from manufacturers. Revenues have also increased due to added employees during fiscal 2022, increasing by 22 employees when comparing to fiscal 2021. There was also an increased focus to sell to international customers, which increased $9.1 million or 1% as a percentage of revenues when comparing fiscal 2022 to fiscal 2021.\nThe gross margins in fiscal 2022 increased by 3.0%, as a percentage of revenues, when compared to fiscal 2021. This increase in margins is due to better economic conditions and the Company carrying local inventory stock that other distributors did not have available. Further, in fiscal 2021, the Company had higher material expenses due to the global industry-wide shortages and the impacts from the COVID-19 pandemic.\nSelling, General and Administrative Expense (dollars in thousands)\nFiscal Years Ended\nAugust 31,\n$\n%\nChange\nChange\nSelling, general and administrative expenses\n$\n53,970\n$\n48,072\n$\n5,898\n12.3\n%\nPercent of revenues\n18.4\n%\n20.2\n%\n(1.9)\n%\nSelling, general and administrative expense (SG&A) consists primarily of payroll and related expenses for the sales and administrative staff, professional fees (including accounting, legal and technology costs and expenses), and advertising costs. SG&A in fiscal 2022 increased from fiscal 2021 largely due to an increase in the number of sales and administrative employees, from 484 employees in fiscal 2021 to 506 employees in fiscal 2022. Fiscal 2022 also incurred additional employee travel costs due to the economy opening up and sales personnel visiting customers, vendors, and sales office locations. In fiscal 2022 and fiscal 2021, the Company received federal tax credits related to the Employee Retention Credit (ERC) of $5.3 million and $5.4 million, respectively, which have been offset against SG&A. SG&A as a percentage of revenue in fiscal 2022 decreased from fiscal 2021 primarily due to higher sales growth due to expanding customer base and increased sales to existing customers.\nOther Income (Expense), Net (dollars in thousands)\nFiscal Years Ended\nAugust 31,\n$\n%\nOther income (expense):\nChange\nChange\nRealized gain (loss) on sales of marketable trading securities\n$\n$\n(890)\n$\n1,028\n115.5\n%\nUnrealized gain (loss) on marketable trading securities\n(351)\n(434)\n(522.9)\n%\nInterest and other (expense)\n(201)\n(226)\n11.1\n%\nOther income (expense), net\n$\n(414)\n$\n(1,033)\n$\n59.9\n%\nOther income (expense), net as a percent of revenues\n(0.1)\n%\n(0.4)\n%\nOther income (expense) includes income or losses on investments in marketable equity securities of other publicly-held domestic corporations, interest income (expense), and other nonoperating activities. The Companys investment strategy consists of both long and short positions. The Company experienced net realized and unrealized losses from trading securities of approximately $213,000 and $807,000 in fiscal 2022 and fiscal 2021, respectively. The trading securities losses in fiscal 2022 and fiscal 2021 was primarily due to timing of sale of investments and general market climate of investment positions at year-end.\nInterest and other expense decreased by $25,000, which was primarily due to reduced interest expense due to a zero balance held on our line of credit during fiscal 2022.\nIncome Tax Provision (dollars in thousands)\nFiscal Years Ended\nAugust 31,\n$\n%\nChange\nChange\nProvision for income taxes\n$\n7,810\n$\n3,293\n$\n4,517\n137.2\n%\nPercent of pre-tax income\n26.8\n%\n28.2\n%\n(1.4)\n%\nThe provision for income taxes increased by $4,517,000 in fiscal 2022 compared to fiscal 2021, which was primarily a result of higher book income in fiscal 2022 as compared to fiscal 2021. The income tax provision as a percentage of pre-tax income decreased by 1.4% in fiscal 2022 compared to fiscal 2021, which was primarily due to a lower blended state tax rate used in fiscal 2022 and also due to the fiscal 2021 tax provision having a larger return to provision and deferred true ups when comparing to fiscal 2022.\nLiquidity and Capital Resources\nAs of August 31, 2022 and 2021, the Company held approximately $17,386,000 and $4,455,000 of unrestricted cash and cash equivalents, respectively. The Company also held $3,925,000 and $3,741,000 of marketable securities at August 31, 2022 and August 31, 2021, respectively, which could be liquidated, if necessary.\nThe Company currently has a $15.0 million line of credit agreement with the Bank. On December 4, 2019, the Company entered into a Change in Terms Agreement dated November 27, 2019 with the Bank (the Amendment), which modified the Companys $10.0 million line of credit between the Company and the Bank to increase the maximum amount that may be borrowed thereunder from $10.0 million to $15.0 million. In addition, the Amendment removed the Companys interest rate options and set the rate at the bank prime rate, but provided that in no event would such interest rate be less than 3.0% per annum. On July 5, 2022, the expiration date of the line of credit under the line of credit agreement was extended to November 5, 2022 and the Company intends to renew the line of credit beyond maturity. Borrowings are secured by substantially all of the assets of the Company and its subsidiaries. The amounts outstanding under this line of credit as of August 31, 2022 and August 31, 2021 were zero.\nIn September 2019, Bisco entered into the Hunter Lease with the Trust, which is the grantor trust of Glen Ceiley, our Chief Executive Officer, Chairman of the Board and the Companys majority shareholder. Under the Hunter Lease, Bisco leased from the Trust the Hunter Property, which consists of approximately 80,000 square feet of office and warehouse space located at 5065 East Hunter Avenue, Anaheim, California, which serves as the Companys new corporate headquarters. The Hunter Lease has a term that expires on August 31, 2029.\nThe Company entered into a new Construction Loan with the Bank to borrow up to $5,000,000 for the primary purpose of financing tenant improvements at the Hunter Property. The Construction Loan was a line of credit evidenced by a Promissory Note in the principal amount of up to $5,000,000 with a maturity date of May 15, 2027. The terms of the Construction Loan provide that the Company may only request advances through July 15, 2020, and thereafter, the Construction Loan would convert to a term loan with a fixed rate of 4.6% and entitled to a .25% rate discount if a demand deposit account is held with the Bank. On July 15, 2020, the amount drawn on the Construction Loan and converted to a term loan was $4,807,000. Interest on the Construction Loan is payable monthly (4.35% at August 31, 2022 and 2021). Concurrent with the execution of this Construction Loan, Bisco entered into a commercial security agreement, dated July 12, 2019, with the Bank, pursuant to which Bisco granted the Bank a security interest in substantially all of Biscos personal property to secure Biscos obligations under the Construction Loan. The outstanding balance of the Construction Loan at August 31, 2022 and August 31, 2021 was $4,584,000 and $4,698,000, respectively.\nEACO has also entered into a business loan agreement (and related $100,000 promissory note) with the Bank that is renewed annually in order to obtain a $100,000 letter of credit as security for the Companys workers compensation requirements.\nCash Flows from Operating Activities\nDuring fiscal 2022, the Company provided $16,866,000 in net cash from its operating activities. The current period cash provided by operating activities was primarily due to net income of $21,308,000 and an increase in trade accounts payable and accrued expenses. This was partially offset by increases in trade accounts receivable and inventory. Increases in accounts payable and accrued expenses is primarily due to increases in inventory.\nDuring fiscal 2021, the Company provided $8,818,000 in net cash from its operating activities. Fiscal 2021 cash provided by operating activities was primarily due to net income of $8,387,000 and an increase in accrued expenses. This was partially offset by increases in trade accounts receivable and prepaid expenses. Increases in accrued expenses was primarily due to increases in accrued bonuses due to higher sales and margin borrowings of $848,000 on the brokerage account.\nCash Flows from Investing Activities\nCash used in investing activities was $2,098,000 for fiscal 2022. This was primarily due to the purchase of equipment for offices and distribution centers and the purchase of marketable securities.\nCash used in investing activities was $7,042,000 for fiscal 2021. This was primarily due to the purchase of marketable securities and a decrease in liability of short sales, which is due to timing of investing activities.\nCash Flows from Financing Activities\nCash used in financing activities for fiscal 2022 was $1,231,000, which was primarily due a reduction in bank overdraft when comparing fiscal 2022 to fiscal 2021.\nCash used in financing activities for fiscal 2021 was $6,308,000, which was primarily due net payments of $5,100,000 in fiscal 2021 to pay down the line of credit with the Bank to a zero balance.\nContractual Financial Obligations\nIn addition to using cash flow generated from operations, the Company finances its operations through borrowings from banks. These financial obligations are recorded in accordance with accounting rules applicable to the underlying transactions, with the result that debt agreements are recorded as liabilities in the accompanying consolidated balance sheets while obligations under operating leases are disclosed in the notes to the accompanying consolidated financial statements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and is not required to provide the information required under this item. Item 8. Financial Statements and Supplementary Data\nEACO CORPORATION\nIndex to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID 200)\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Operations for the years ended August 31, 2022 and 2021\nConsolidated Statement of Comprehensive Income for the years ended August 31, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the years ended August 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2022 and 2021\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nShareholders of EACO Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of EACO Corporation (the Company) as of August 31, 2022 and 2021, and the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for each of the years in the two-year period ended August 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended August 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which they relate.\nAccounting for Employee Retention Credits (Note 7)\nCritical Audit Matter Description\nThe Company applied for Employee Retention Credits (ERCs) as provided for by provision of the Coronavirus Aid, Relief, and Economic Security Act (CARES Act). ERCs related to eligible quarterly periods aggregated $5,395,574 and were recorded as reductions of payroll taxes for the year ended August 31, 2022. As of August 31, 2022, $1,950,006 is reflected in prepaid expenses and other current assets, which is net of amounts received from the Internal Revenue Service (IRS) prior to August 31, 2022.\nHow the Critical Audit Matter was Addressed in the Audit\nOur principal audit procedures related to the Companys recording of the ERCs included the following:\n● We obtained an understanding of the provisions for the ERCs as afforded by the CARES Act and notices published by the IRS.\n● We evaluated the qualifications of, and work performed by a specialist engaged by management to determine eligibility and perform the calculations supporting the ERCs.\n● We evaluated managements analyses of the underlying circumstances and data and, in our judgment, found the conclusions to be reasonable.\nHASKELL & WHITE LLP\nWe have served as the Companys auditor since 2022.\nIrvine, California\nNovember 4, 2022\nEACO Corporation and Subsidiaries\nConsolidated Balance Sheets\n(in thousands, except share and per share information)\nAugust 31,\nAugust 31,\nASSETS\nCurrent Assets:\nCash and cash equivalents\n$\n17,386\n$\n4,455\nRestricted cash\nTrade accounts receivable, net\n44,637\n33,929\nInventory, net\n48,808\n40,448\nMarketable securities, trading\n3,925\n3,741\nPrepaid expenses and other current assets\n5,008\n6,780\nTotal current assets\n119,774\n89,363\nNon-current Assets:\nProperty, equipment and leasehold improvements, net\n8,479\n8,269\nOperating lease right-of-use assets\n10,389\n11,084\nOther assets, net\n1,039\n1,669\nTotal assets\n$\n139,681\n$\n110,385\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent Liabilities:\nTrade accounts payable\n$\n21,762\n$\n16,413\nAccrued expenses and other current liabilities\n15,020\n10,964\nCurrent portion of operating lease liabilities\n3,375\n3,096\nCurrent portion of long-term debt\nTotal current liabilities\n40,276\n30,586\nNon-current Liabilities:\nLong-term debt\n4,465\n4,585\nOperating lease liabilities\n7,192\n8,092\nTotal liabilities\n51,933\n43,263\nCommitments and Contingencies (Notes 6, 8 and 9)\nShareholders Equity:\nConvertible preferred stock, $0.01 par value per share; 10,000,000 shares authorized; 36,000 shares outstanding (liquidation value $900)\nCommon stock, $0.01 par value per share; 8,000,000 shares authorized; 4,861,590 shares outstanding\nAdditional paid-in capital\n12,378\n12,378\nAccumulated other comprehensive income\nRetained earnings\n75,146\n53,914\nTotal shareholders equity\n87,748\n67,122\nTotal liabilities and shareholders equity\n$\n139,681\n$\n110,385\nSee accompanying notes to consolidated financial statements.\nEACO Corporation and Subsidiaries\nConsolidated Statements of Operations\n(in thousands, except per share amounts)\nYear Ended\nAugust 31,\nRevenues\n$\n292,562\n$\n237,962\nCost of revenues\n209,060\n177,177\nGross margin\n83,502\n60,785\nOperating expenses:\nSelling, general and administrative expenses\n53,970\n48,072\nIncome from operations\n29,532\n12,713\nOther income (expense):\nNet loss on trading securities\n(213)\n(807)\nInterest and other expense\n(201)\n(226)\nOther income (expense), net\n(414)\n(1,033)\nIncome before income taxes\n29,118\n11,680\nProvision for income taxes\n7,810\n3,293\nNet income\n21,308\n8,387\nCumulative preferred stock dividend\n(76)\n(76)\nNet income attributable to common shareholders\n$\n21,232\n$\n8,311\nBasic and diluted earnings per common share\n$\n4.37\n$\n1.71\nBasic and diluted weighted average common shares outstanding\n4,861,590\n4,861,590\nSee accompanying notes to consolidated financial statements.\nEACO Corporation and Subsidiaries\nConsolidated Statements of Comprehensive Income\n(in thousands)\nYear Ended\nAugust 31,\nNet income\n$\n21,308\n$\n8,387\nOther comprehensive income, net of tax\nForeign currency translation loss\n(606)\n(8)\nTotal comprehensive income\n$\n20,702\n$\n8,379\nSee accompanying notes to consolidated financial statements.\nEACO Corporation and Subsidiaries\nConsolidated Statements of Shareholders Equity\nFor the Years Ended August 31, 2022 and 2021\n(in thousands, except share information)\nAccumulated\nConvertible\nAdditional\nOther\nTotal\nPreferred Stock\nCommon Stock\nPaid-in\nComprehensive\nRetained\nShareholders\nShares\nAmount\nShares\nAmount\nCapital\nIncome\nEarnings\nEquity\nBalance, August 31, 2020\n36,000\n$\n4,861,590\n$\n$\n12,378\n$\n$\n45,603\n$\n58,819\nPreferred dividends\n-\n-\n-\n-\n-\n-\n(76)\n(76)\nForeign translation loss\n-\n-\n-\n-\n-\n(8)\n-\n(8)\nNet income\n-\n-\n-\n-\n-\n-\n8,387\n8,387\nBalance, August 31, 2021\n36,000\n$\n4,861,590\n$\n$\n12,378\n$\n$\n53,914\n$\n67,122\nPreferred dividends\n-\n-\n-\n-\n-\n-\n(76)\n(76)\nForeign translation loss\n-\n-\n-\n-\n-\n(606)\n-\n(606)\nNet income\n-\n-\n-\n-\n-\n-\n21,308\n21,308\nBalance, August 31, 2022\n36,000\n$\n4,861,590\n$\n$\n12,378\n$\n$\n75,146\n$\n87,748\nSee accompanying notes to consolidated financial statements\nEACO Corporation and Subsidiaries\nConsolidated Statements of Cash Flows\n(in thousands)\nYear Ended August 31,\nOperating activities:\nNet income\n$\n21,308\n$\n8,387\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n1,491\n1,525\nBad debt expense\nUnrealized loss on trading securities\nDeferred tax provision\n-\nIncrease (decrease) in cash flow from change in:\nTrade accounts receivable\n(10,746)\n(4,351)\nInventory\n(8,360)\n(903)\nPrepaid expenses and other assets\n2,069\n(1,950)\nOperating lease right-of-use assets\n1,735\nTrade accounts payable\n6,390\nAccrued expenses and other current liabilities\n4,056\n4,332\nOperating lease liabilities\n(621)\n(1,754)\nNet cash provided by operating activities\n17,004\n8,818\nInvesting activities:\nAdditions to property, equipment, and leasehold improvements\n(1,701)\n(946)\nSale of marketable securities, trading\n(535)\n(3,180)\nNet change in liabilities for short sales of trading securities\n-\n(2,906)\nNet cash used in by investing activities\n(2,236)\n(7,032)\nFinancing activities:\nPayments on revolving credit facility, net\n-\n(5,100)\nRepayments on long-term debt\n(114)\n(109)\nPreferred stock dividend\n(76)\n(76)\nBank overdraft\n(1,041)\n(1,023)\nNet cash used in by financing activities\n(1,231)\n(6,308)\nEffect of foreign currency exchange rate changes on cash and cash equivalents\n(606)\n(8)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n12,931\n(4,530)\nCash, cash equivalents, and restricted cash - beginning of period\n4,465\n8,995\nCash, cash equivalents, and restricted cash - end of period\n$\n17,396\n$\n4,465\nSupplemental disclosures of cash flow information:\nCash paid for interest\n$\n$\nCash paid for income taxes\n$\n3,222\n$\n2,780\nSee accompanying notes to consolidated financial statements.\nEACO CORPORATION AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAugust 31, 2022 and 2021\nNote 1. Organization and Basis of Presentation\nEACO Corporation (EACO), incorporated in Florida in September 1985, is a holding company, primarily comprised of its wholly-owned subsidiary, Bisco Industries, Inc. (Bisco) and Biscos wholly-owned Canadian subsidiary, Bisco Industries Limited. Substantially all of EACOs operations are conducted through Bisco and Bisco Industries Limited. Bisco was incorporated in Illinois in 1974 and is a distributor of electronic components and fasteners with 51 sales offices and seven distribution centers located throughout the United States and Canada and 1 sales office in Asia. Bisco supplies parts used in the manufacture of products in a broad range of industries, including the aerospace, circuit board, communication, computer, fabrication, instrumentation, industrial equipment and marine industries.\nNote 2. Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements for all periods presented include the accounts of EACO, Bisco and Bisco Industries Limited (which are collectively referred to herein as the Company, we, us and our). All significant intercompany transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. These estimates include allowance for doubtful trade accounts receivable, provisions for slow moving and obsolete inventory, recoverability of the carrying value and estimated useful lives of long-lived assets, and the valuation allowance against deferred tax assets. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents.\nTrade Accounts Receivable\nTrade accounts receivable are carried at original invoice amount, less an estimate for an allowance for doubtful accounts. Management determines the allowance for doubtful accounts by identifying probable credit losses in the Companys accounts receivable and reviewing historical data to estimate the collectability on items not yet specifically identified as problem accounts. Trade accounts receivable are written off when deemed uncollectible. Recoveries of trade accounts receivable previously written off are recorded when received. A trade account receivable is considered past due if any portion of the receivable balance is outstanding for more than 30 days. The Company does not charge interest on past due balances. The allowance for doubtful accounts was approximately $ 164,000 and $161,000 at August 31, 2022 and 2021, respectively.\nInventories\nInventories consist primarily of electronic fasteners and components, and are stated at the lower of cost or estimated net realizable value. Cost is determined using the average cost method. Inventories are adjusted for slow moving or obsolete items approximating $1,697,000 and $1,578,000 at August 31, 2022 and 2021, respectively. The adjustments to inventory costs are based upon managements review of inventories on-hand over their expected future utilization and length of time held by the Company.\nProperty, Equipment, and Leasehold Improvements\nProperty, equipment, and leasehold improvements are stated at cost net of accumulated depreciation and amortization. Depreciation and amortization expense is determined using the straight-line method over the estimated useful lives of the assets. The depreciable life for buildings is thirty-five years and five to seven years for furniture, fixtures and equipment. Leasehold improvements are amortized over the estimated useful life of the asset or the remaining lease term, whichever is less. Maintenance and repairs are charged to expense as incurred. Renewals and improvements of a major nature are capitalized. At the time of retirement or disposition of the asset, the cost and accumulated depreciation or amortization are removed from the accounts and any gains or losses are reflected in earnings.\nImpairment of Long Lived Assets\nThe Companys policy is to review long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. For the purpose of the impairment review, assets are tested on an individual basis. The recoverability of the assets is measured by a comparison of the carrying value of each asset to the future net undiscounted cash flows expected to be generated by such assets. If such assets are considered impaired, the impairment to be recognized is measured by the amount by which the carrying value of the assets exceeds their estimated fair value. There was no impairment as of August 31, 2022 and 2021.\nMarketable Trading Securities\nThe Company invests in marketable trading securities, which include long and short positions in equity securities. Short positions represent securities sold, but not yet purchased. Short sales result in obligations to purchase securities at a later date and are separately presented as a liability in the Companys consolidated balance sheets. As of August 31, 2022 and 2021, the Companys total obligation for securities sold, but not yet purchased was approximately zero. Restricted cash to collateralize the Companys obligations for short sales was zero at August 31, 2022 and 2021.\nThese securities are stated at fair value, which is determined using the quoted closing prices at each reporting date. Realized gains and losses on investment transactions are recognized as incurred in the consolidated statements of operations. Net unrealized gains and losses are reported in the statements of operations and represent the change in the market value of investment holdings during the period. See Note 10.\nRevenue Recognition\nWe derive our revenue primarily from product sales. We determine revenue recognition through the following steps: (1) identification of the contract with a customer; (2) identification of the performance obligations in the contract; (3) determination of the transaction price; (4) allocation of the transaction price to the performance obligations in the contract; and (5) recognition of revenue when, or as, we satisfy a performance obligation.\nThe Companys performance obligations consist solely of product shipped to customers. Revenue from product sales is recognized upon transfer of control of promised products to customers at a point in time in an amount that reflects the consideration we expect to receive in exchange for these products. Revenue is recognized net of returns and any taxes collected from customers. We offer industry standard contractual terms in our purchase orders.\nFreight revenue associated with product sales are recognized at point of shipment and when the criteria discussed above have been met. Freight revenues have represented less than 1% of total revenues for fiscal 2022 and fiscal 2021.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which requires the recognition of DTAs and DTLs for the expected future tax consequences of events that have been included in the financial statements. Under this method, we determine DTAs and DTLs on the basis of the differences between the financial statement and tax bases of assets and liabilities by using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on DTAs and DTLs is recognized in income in the period that includes the enactment date.\nWe recognize DTAs to the extent that we believe that these assets are more likely than not to be realized. In making such a determination, we consider all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, carryback potential if permitted under the tax law, and results of recent operations. If we determine that we would not be able to realize our DTAs in the future in excess of their net recorded amount, we would make an adjustment to the DTAs through recognizing a valuation allowance, which would increase the provision for income taxes.\nWe record uncertain tax positions in accordance with ASC 740 on the basis of a two-step process in which (1) we determine whether it is more likely than not that the tax positions will be sustained on the basis of the technical merits of the position and (2) for those tax positions that meet the more-likely-than-not recognition threshold, we recognize the largest amount of tax benefit that is more than 50 percent likely to be realized upon ultimate settlement with the related tax authority.\nWe recognize interest and penalties related to unrecognized tax benefits on the income tax expense line in the accompanying consolidated statements of operations. Accrued interest and penalties are included on the related tax liability line in the consolidated balance sheets.\nFreight and Shipping/Handling\nShipping and handling expenses are included in cost of revenues and were approximately $5,225,000 and $4,281,000 for the years ended August 31, 2022 and 2021, respectively.\nAdvertising Costs\nAdvertising costs are expensed as incurred. For fiscal 2022 and fiscal 2021, the Company spent approximately $427,000 and $415,000 respectively, on advertising.\nOperating Leases\nThe Company determines if a contractual arrangement contains a lease, for accounting purposes, at contract inception. Operating leases are included in operating lease right-of-use (ROU) assets, the current portion of operating lease liabilities, and the operating lease liabilities in the accompanying consolidated balance sheets.\nThe ROU assets represent the Companys right to control the use of a leased asset for the contractual term, and lease liabilities represent the related obligation to make lease payments arising from the contractual arrangement. Operating lease ROU assets and lease liabilities are recognized at the commencement date based on the present value of lease payments over the contractual term. The operating lease ROU assets also include any prepaid lease payments made and exclude lease incentives. Lease expense is recognized on a straight-line basis over the contractual term.\nMany of the Companys leases include both lease (such as fixed payment amounts including rent, taxes, and insurance costs) and nonlease components (such as common-area or other maintenance costs) which are accounted for as a single lease component as the Company has elected the practical expedient to group lease and nonlease components for all leases.\nMany leases include one or more options to renew the contract. Therefore, renewals to extend the lease terms are not included in our ROU assets and lease liabilities as they are not reasonably certain to be exercised. The Company regularly evaluates the renewal options each reporting period and when they are reasonably certain to be exercised, management will include the lease renewal period in our contractual term when estimating the ROU assets and related liabilities.\nSince most of the Companys leases do not provide an implicit rate, as defined by GAAP, we use an incremental borrowing rate based on information available to us at the lease commencement date in order to determine the present value of the lease payments. The Company applies a portfolio approach for determining the incremental borrowing rate. As of August 31, 2022, the Company has right of use assets of approximately $10.4 million and lease liabilities of approximately $10.6 million recorded in the consolidated balance sheet.\nEarnings Per Common Share\nBasic earnings per common share for the years ended August 31, 2022 and 2021 were computed based on the weighted average number of common shares outstanding. Diluted earnings per share for those periods have been computed based on the weighted average number of common shares outstanding, giving effect to all potentially dilutive common shares that were outstanding during the respective periods. Potentially dilutive common shares represent 40,000 common shares issuable upon conversion of 36,000 shares of Series A convertible preferred stock, which were outstanding at August 31, 2022 and 2021. Such securities are excluded from the weighted average shares outstanding used to calculate diluted earnings per common share for the years ended August 31, 2022 and 2021 as their inclusion would be anti-dilutive since the conversion price was greater than the average market price of the Companys common stock during these periods.\nForeign Currency Translation and Transactions\nAssets and liabilities recorded in functional currencies other than the U.S. dollar (Canadian dollars for Biscos Canadian subsidiary) are translated into U.S. dollars at the period-end rate of exchange. The exchange rate for Canadian dollars at August 31, 2022 and 2021 was $0.77 and $0.79, respectively. The resulting balance sheet translation adjustments are charged or credited directly to accumulated other comprehensive income (loss). Revenue and expenses are transacted at the average exchange rates for the years ended August 31, 2022 and 2021. The average exchange rates for the years ended August 31, 2022 and 2021 was $0.79 for both periods. The percentage of total assets held outside the United States, in Canada, was 3% as of August 31, 2022 and 2021. All foreign sales, excluding Canadian sales, are denominated in U.S. dollars and, therefore, are not subject to foreign currency risk exposure.\nConcentrations\nFinancial instruments that subject the Company to credit risk include cash balances in excess of federal depository insurance limits and accounts receivable. Cash accounts maintained by the Company at U.S. and Canadian financial institutions are insured by the Federal Deposit Insurance Corporation and Canadian Deposit Insurance Corporation, respectively. A portion of the Companys cash was held by its Canadian subsidiary. The Company has not experienced any losses in such accounts.\nNet sales to customers outside the United States and related trade accounts receivable were approximately 12% and 13%, respectively, at August 31, 2022, and 11% and 13%, respectively at August 31, 2021. No single customer accounted for more than 10% of total revenues for either of the years ended August 31, 2022 or 2021.\nThe following table presents our sales within geographic regions as a percentage of net revenue, which is based on the bill-to location of our customers:\nYears Ended August 31,\nU.S.\n88.2\n%\n89.4\n%\nAsia\n5.7\n%\n5.1\n%\nCanada\n3.2\n%\n3.2\n%\nOther\n2.9\n%\n2.3\n%\nTotal\n%\n%\nEstimated Fair Value of Financial Instruments and Certain Nonfinancial Assets and Liabilities\nThe Companys financial instruments other than its marketable securities include cash and cash equivalents, trade accounts receivable, prepaid expenses, security deposits, trade accounts payable, line of credit, accrued expenses and long-term debt. Management believes that the fair value of these financial instruments approximate their carrying amounts based on their relatively short-term nature and current market indicators, such as prevailing interest rates. The Companys marketable securities are measured at fair value on a recurring basis. See Note 10.\nDuring the years ended August 31, 2022 and 2021, the Company did not have any nonfinancial assets or liabilities that were measured at estimated fair value on a recurring or nonrecurring basis.\nSignificant Recent Accounting Pronouncements\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses, which will require the measurement of all expected credit losses for financial assets held at the reporting date based on historical experience, current conditions, and reasonable and supportable forecasts. The guidance is effective for annual reporting periods beginning after December 15, 2019 and interim periods within those fiscal years. In November 2019, the FASB deferred the effective dates of the new credit losses standard for all entities except SEC filers that are not smaller reporting companies to fiscal year beginning after December 15, 2022, including interim periods within those fiscal years. The Company is currently evaluating this statement and its impact on its results of operations or financial position.\nNote 3. Property, Equipment and Leasehold Improvements\nProperty, equipment and leasehold improvements are summarized as follows:\nAugust 31,\nHeld for use:\nMachinery and equipment\n$\n10,759,000\n$\n10,482,000\nFurniture and fixtures\n3,016,000\n2,645,000\nVehicles\n137,000\n137,000\nLeasehold improvements\n7,405,000\n6,743,000\nConstruction in progress\n497,000\n104,000\nTotal held for use\n21,814,000\n20,111,000\nLess: accumulated depreciation and amortization\n(13,335,000)\n(11,842,000)\nTotal property, equipment, and leasehold improvements held for use, net\n$\n8,479,000\n$\n8,269,000\nIn September 2019, Bisco entered into Commercial Lease Agreement with the Trust (the Hunter Lease), pursuant to which Bisco leased from the Trust approximately 80,000 square feet of office and warehouse space located at 5065 East Hunter Avenue in Anaheim, California (the Hunter Property). During fiscal 2019, the Company started construction of leasehold improvements on the Hunter Property to house its new corporate headquarters, which was financed by the Construction Loan from the Bank. See Note 4. As of August 31, 2022, construction in progress included solar power roof installation on Hunter Property and other minor leasehold improvements awaiting city permits for completion.\nFor the years ended August 31, 2022 and 2021, depreciation and amortization expense was $1,491,000 and $1,525,000, respectively.\nNote 4. Debt\nThe Company currently has a $15.0 million line of credit agreement with the Bank. On December 4, 2019, the Company entered into the Amendment, which modified the Companys $10.0 million line of credit between the Company and the Bank to increase the maximum amount that may be borrowed thereunder from $10.0 million to $15.0 million. In addition, the Amendment removed the Companys interest rate options but provided that in no event would such interest rate be less than 3.0% per annum. On July 5, 2022, the expiration date of the line of credit under the line of credit agreement was extended from July 5, 2022 to November 5, 2022 and the Company intends to renew the line of credit beyond maturity. The amounts outstanding under this line of credit as of August 31, 2022 and August 31, 2021 are currently all under the bank prime index rate. Borrowings are secured by substantially all of the assets of the Company and its subsidiaries. The amounts outstanding under this line of credit as of August 31, 2022 and August 31, 2021 was zero.\nThe Company also entered into the Construction Loan for the primary purpose of financing tenant improvements at the Hunter Property. The Construction Loan was a line of credit evidenced by a Promissory Note in the principal amount of up to $5,000,000 with a maturity date of May 15, 2027. The terms of the Construction Loan provide that the Company may only request advances through July 15, 2020, and thereafter, the Construction Loan would convert to a term loan with a fixed rate of 4.6%, which is entitled to a .25% rate discount if a demand deposit account is held with the Bank. On July 15, 2020, the amount drawn on the Construction Loan and converted to a term loan was $4,807,000. Interest on the Construction Loan is payable monthly (4.35% at August 31, 2022 and August 31, 2021). Concurrent with the execution of this Construction Loan, Bisco entered into a commercial security agreement, dated July 12, 2019, with the Bank, pursuant to which Bisco granted the Bank a security interest in substantially all of Biscos personal property to secure Biscos obligations under the Construction Loan. The outstanding balance of the Construction Loan at August 31, 2022 and August 31, 2021 was $4,584,000 and $4,698,000, respectively.\nThe Company has also entered into a business loan agreement (and related $100,000 promissory note) with the Bank in order to obtain a $100,000 letter of credit as security for the Companys workers compensation requirements.\nNote 5. Shareholders Equity\nEarnings Per Common Share (EPS)\nThe following is a reconciliation of the numerators and denominators used in the basic and diluted computations of earnings per common share:\nYears Ended August 31,\n(In thousands, except per share information)\nEPS - basic and diluted:\nNet income\n$\n21,308\n$\n8,387\nLess: cumulative preferred stock dividend\n(76)\n(76)\nNet income attributable to common shareholders for basic and diluted EPS computation\n$\n21,232\n$\n8,311\nWeighted average common shares outstanding for basic and diluted EPS computation\n4,861,590\n4,861,590\nEarnings per common share - basic and diluted\n$\n4.37\n$\n1.71\nFor the years ended August 31, 2022 and 2021, 40,000 potential common shares (issuable upon conversion of 36,000 shares of the Companys Series A cumulative convertible preferred stock) have been excluded from the computation of diluted earnings per share because their inclusion would be anti-dilutive since the conversion price was greater than the average market price of the common stock.\nPreferred Stock\nThe Companys Board of Directors is authorized to establish the various rights and preferences for the Companys preferred stock, including voting, conversion, dividend and liquidation rights and preferences, at the time shares of preferred stock are issued. In September 2004, the Company sold 36,000 shares of its Series A cumulative convertible preferred stock (the Preferred Stock) to the Companys CEO, with an 8.5% dividend rate at a price of $25 per share for a total cash purchase price of $900,000. The holder of the Preferred Stock has the right at any time to convert the Preferred Stock and accrued but unpaid dividends into shares of the Companys common stock at the conversion price of $22.50 per share. In the event of a liquidation or dissolution of the Company, the holder of the Preferred Stock is entitled to be paid out of the assets of the Company available for distribution to shareholders at $25.00 per share plus all unpaid dividends before any payments are made to the holders of common stock.\nNote 6. Profit Sharing Plan\nThe Company has a defined contribution 401(k) profit sharing plan (401(k) plan) for all eligible employees. Employees are eligible to contribute to the 401(k) plan after six months of employment. Under the 401(k) plan, employees may contribute up to 15% of their compensation. The Company has the discretion to match 50% of the employee contributions up to 6% of employees compensation. The Companys contributions are subject to a five-year vesting period beginning the second year of service. The Companys contribution expense was approximately $638,000 and $479,000 for the years ended August 31, 2022 and 2021, respectively.\nNote 7. Income Taxes\nThe following summarizes the Companys provision for income taxes on income from operations:\nYears Ended August 31,\nCurrent:\nFederal\n$\n5,547,000\n$\n2,489,000\nState\n1,608,000\n868,000\nForeign\n322,000\n(62,000)\n7,477,000\n3,295,000\nDeferred:\nFederal\n63,000\n(2,000)\nState\n270,000\n-\nForeign\n-\n-\n333,000\n(2,000)\nTotal\n$\n7,810,000\n$\n3,293,000\nIncome taxes for the years ended August 31, 2022 and 2021 differ from the amounts computed by applying the federal blended and statutory corporate rates of 21% for both 2022 and 2021 to the pre-tax income. The differences are reconciled as follows:\nYears Ended August 31,\nCurrent:\nExpected income tax provision at statutory rate\n21.0\n%\n21.0\n%\nIncrease (decrease) in taxes due to:\nState tax, net of federal benefit\n4.4\n%\n4.6\n%\nPermanent differences\n0.1\n%\n(0.3)\n%\nOther, net\n1.3\n%\n2.9\n%\nIncome tax expense\n26.8\n%\n28.2\n%\nThe components of deferred taxes at August 31, 2022 and 2021 are summarized below:\nAugust 31,\nDeferred tax assets (liabilities):\nNet operating loss\n$\n174,000\n$\n357,000\nAccruals and reserves\n1,148,000\n1,401,000\nIncome tax credits\n1,000\n1,000\nCapital loss\n40,000\n49,000\nLease liability\n2,789,000\n2,968,000\nProperty and equipment, net\n(958,000)\n(957,000)\nOperating lease, right-of-use assets\n(2,742,000)\n(2,941,000)\nUnrealized gains/losses\n85,000\n(7,000)\n537,000\n871,000\nValuation allowance\n--\n-\nTotal deferred tax assets, net\n$\n537,000\n871,000\nManagement assesses the available positive and negative evidence to estimate whether sufficient future taxable income will be generated to permit use of the existing DTA. On the basis of this evaluation, as of August 31, 2022, no valuation allowance has been recorded.\nOn March 27, 2020, President Trump signed into law the Coronavirus Aid, Relief, and Economic Security Act (CARES Act). The CARES Act provides tax relief and tax incentives to business, including provisions relating to net operating loss carryback, refundable payroll tax credits, OASDI payroll tax deferral, alternative minimum tax credit refunds, modifications to the net interest deduction limitations, and technical corrections to tax depreciation methods for qualified improvement property. The Company did not apply for SBA Paycheck Protection Program loan based on the advice of its legal counsel due to stable cash flow and available cash from the Companys line of credits. The Company has taken advantage of the Employee Retention Credit (ERC), which is a refundable tax credit against certain employment taxes equal to 50% of the qualified wages an eligible employer pays to employees after March 12, 2020, and before January 1, 2022. Eligible employers can get immediate access to the credit by reducing employment tax deposits they are otherwise required to make. The amount of the refundable tax credit for fiscal year 2022 and 2021 is $5.3 million and $5.4 million, respectively, and the ERC was applied against and reduced the payroll tax expense included in SG&A.\nWe are subject to taxation in the United States and various states and foreign jurisdictions. With few exceptions, as of August 31, 2022, we are no longer subject to U.S. federal, state, local, Canadian examinations by tax authorities for years before 2018.\nNote 8. Commitments and Contingencies\nLegal Matters\nFrom time to time, we may be subject to legal proceedings and claims that arise in the normal course of our business. Any such matters and disputes could be costly and time consuming, subject us to damages or equitable remedies, and divert our management and key personnel from our business operations. We currently are not a party to any material legal proceedings, the adverse outcome of which, in managements opinion, individually or in the aggregate, would have a material adverse effect on our consolidated results of operations, financial position or cash flows.\nOperating Lease Obligations\nThe Company leases its facilities and automobiles under operating lease agreements (three leased facilities are leased from the Trust, which is beneficially owned by the Companys Chief Executive Officer, Chairman of the Board and majority shareholder - see Note 9), which expire on various dates through September 2029 and require minimum rental payments ranging from $1,000 to $67,000 per month. Certain of the leases contain options for renewal under varying terms.\nMinimum future rental payments under operating leases are as follows:\nYears Ending August 31:\n$\n3,075,000\n2,494,000\n1,580,000\n1,334,000\n1,283,000\nThereafter\n1,991,000\n$\n11,757,000\nRental expense for all operating leases for the years ended August 31, 2022 and 2021 was approximately $3,552,000 and $3,285,000, respectively.\nNote 9. Related Party Transactions\nOn November 21, 2017, the Company entered into the Chicago Lease with the Trust, which is the grantor trust of Glen Ceiley, our Chief Executive Officer, Chairman of the Board and the Companys majority shareholder, for the lease of a facility in Glendale Heights, Illinois. The Company relocated its Chicago sales office and distribution center to this facility in December 2017. The Chicago Lease is a ten year triple net lease with an initial monthly rental rate of $22,600, which is subject to annual rent increases of approximately 2.5% as set forth in the Chicago Lease.\nOn July 26, 2019, the Company entered into the Hunter Lease with the Trust, for the lease of the Hunter Property, which houses the Companys new corporate headquarters. The Company completed its move to the new headquarters located at the Hunter Property in March 2020. The Hunter Lease is a ten year triple net lease, which commenced on September 2, 2019 and ends on August 31, 2029 with an initial monthly rental rate of $66,300, which is subject to annual rent increases of approximately 2.5% as set forth in the Hunter Lease.\nDuring fiscal 2022 and fiscal 2021, the Company paid approximately $1,134,000 and $1,106,000, respectively, of rent related to all leases with the Trust.\nNote 10. Fair Value of Financial Instruments\nManagement estimates the fair value of its assets or liabilities measured at fair value based on the three levels of the fair-value hierarchy are described as follows:\nLevel 1: Quoted prices (unadjusted) in active markets for identical assets and liabilities. For the Company, Level 1 inputs include marketable securities and liabilities for short sales of trading securities that are actively traded.\nLevel 2: Inputs other than Level 1 are observable, either directly or indirectly. The Company does not hold any Level 2 financial instruments.\nLevel 3: Unobservable inputs. The Company does not hold any Level 3 financial instruments.\nMarketable Trading Securities - The Company holds marketable trading securities, which include long and short positions that are all publicly traded securities with quoted prices in active markets. These securities are stated at fair value, which is determined using the quoted closing prices at each reporting date. Short positions represent securities sold, but not yet purchased. Short sales result in obligations to purchase securities at a later date and are separately presented as a liability in the Companys consolidated balance sheets. The fair value of the marketable trading securities and short positions are considered to be Level 1 measurements.\nThe following table sets forth by level, within the fair value hierarchy, certain assets at estimated fair value as of August 31, 2022 and 2021:\nQuoted Prices in\nSignificant Other\nSignificant\nActive Markets for\nObservable\nUnobservable\nIdentical Assets\nInputs\nInputs\n(Level 1)\n(Level 2)\n(Level 3)\nTotal\nAugust 31, 2022\nMarketable securities\n$\n3,925,000\n-\n-\n$\n3,925,000\nAugust 31, 2021\nMarketable securities\n$\n3,741,000\n-\n-\n$\n3,741,000\nNote 11. Subsequent Events\nManagement has evaluated events subsequent to August 31, 2022, through the date that these consolidated financial statements are being filed with the Securities and Exchange Commission, for transactions and other events that may require adjustment of and/or disclosure in such financial statements. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\n(a) Evaluation of disclosure controls and procedures. As required by Rule 13a-15(e) and 15d-15(e) under the Exchange Act, as of the end of the period covered by this report the Company carried out an evaluation of the effectiveness of the design and operation of the Companys disclosure controls and procedures. This evaluation was carried out under the supervision and with the participation of the Companys Chief Financial Executive, who also serves as the Companys principal financial officer. Based upon that evaluation, the Companys Chief Financial Executive has concluded that the Companys controls and procedures were not effective as of August 31, 2022, due to a material weakness related to the Companys internal controls over the financial statement closing process\n(b) Managements annual report on internal control over financial reporting. Management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. The Companys internal control over financial reporting is intended to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nThe Companys management, with the participation of its Chief Financial Executive, assessed the effectiveness of the Companys internal control over financial reporting as of August 31, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in its report entitled Internal Control-Integrated Framework (2013). Based on that assessment under such criteria, management concluded that the Companys internal control over financial reporting has a material weakness as of August 31, 2022, related to the Companys internal controls over the financial statement closing process, including manual journal entries recorded in the preparation of the financial statements.\nDue to its inherent limitations, internal control over financial reporting may not prevent or detect all misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, and/or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Exchange Act. As such, this annual report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting.\n(c) Changes in internal control over financial reporting. There was no change in our internal control over financial reporting that occurred during the fourth quarter of the year ended August 31, 2022 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nSet forth below is certain information, as of August 31, 2022, regarding our directors and executive officers, including information regarding the experience, qualifications, attributes or skills of each director that led the Board of Directors to conclude that such individual should serve on the Board.\nDirectors and Executive Officers\nDirectors\nEach director serves a one-year term, or until such directors successor has been elected and qualified.\nGlen F. Ceiley, age 76, has served as EACOs Chief Executive Officer and Chairman of the Board since 1999. Mr. Ceiley is also the Chief Executive Officer and Chairman of the Board of Bisco, and has held those positions since he founded Bisco in 1973. He also served as President of Bisco prior to June 2010. In addition, Mr. Ceiley is a former director of Data I/O Corporation, a publicly-held company that provides programming systems for electronic device manufacturers. Mr. Ceiley has served as a director of EACO since 1998. As the founder of Bisco with over 45 years of experience in that industry, Mr. Ceiley is uniquely qualified to provide insights into and guidance on the industry, and growth and development of the Company.\nWilliam L. Means, age 79, served as the Vice President of Information Technology of Bisco from 2001 until his retirement in June 2010. Prior to that, from 1997 to 2001, Mr. Means was Vice President of Corporate Development of Bisco. Mr. Means has served as a director of EACO since July 1999. He holds an M.B.A. degree from San Jose State University. Mr. Means provides extensive industry expertise to the Board, as well as a deep and broad understanding of the Company and its operations resulting from his years of service as an officer of Bisco.\nStephen Catanzaro, age 69, currently has an accounting and tax practice. Prior to that, Mr. Catanzaro served as the Chief Financial Officer of Allied Business Schools, Inc., a company that provides home study courses and distance education, from April 2004 until May 2018. He also served as the Chief Financial Officer of V&M Restoration, Inc., a building restoration company, from September 2002 to February 2004, and the Chief Financial Officer of Bisco from September 1992 to March 2002. Mr. Catanzaro has served as a director of EACO since 1999. He holds a B.S. degree in Accounting from Lehman College of The City University of New York and an M.B.A. degree from Golden Gate University. Mr. Catanzaro offers to the Board valuable business and strategic insights obtained through his work in a variety of industries, as well as experience as a certified public accountant which is invaluable to his service in the Audit Committee. Mr. Catanzaro serves as the Companys audit committee chair.\nExecutive Officers\nEach executive officer holds office at the discretion of the Companys Board, or until the officers successor has been elected and qualified. See above for biographical information for Mr. Ceiley, our Chief Executive Officer and Chairman of the Board.\nDonald S. Wagner, age 60, has served as the President of Bisco since June 2010 and as its Chief Operating Officer since November 2007. Prior to his promotion to President, Mr. Wagner also held the title of Executive Vice President of Bisco since November 2007. Mr. Wagner has worked at Bisco since 1994 in a number of other capacities, including as Vice President of Product Management. Prior to joining Bisco, Mr. Wagner worked in the defense division at Rockwell International. He holds a B.A. degree in Communications from California State University, Fullerton.\nMichael Narikawa, age 41, has served as the Chief Financial Executive and the Principal Accounting Officer of EACO and Bisco since May 2014. Prior to his promotion as Chief Financial Executive, Mr. Narikawa served as Biscos Accounting Supervisor from February 2009 to April 2014. Prior to joining Bisco, he was a Senior Auditor at KPMG, LLP from June 2005 to December 2008. Mr. Narikawa has a B.S. degree in Business Administration with a concentration in Accountancy from California Polytechnic State University, San Luis Obispo.\nZach Ceiley, age 42, has served as the Executive Vice President of Bisco since December 2019. Prior to such promotion, Mr. Ceiley served as Vice President of Sales and Marketing of Bisco since September 2012 and was the Northern Regional Manager of Bisco from September 2010. Since he joined Bisco in February 2003, Mr. Ceiley has served the Company in a number of other capacities in the sales department, including as Cell Manager and Area Manager. Mr. Ceiley has a B.S. degree in Communications from the University of Colorado. Zach Ceiley is the son of Glen Ceiley, who is EACOs Chairman of the Board, Chief Executive Officer and majority shareholder and Biscos Chief Executive Officer and Chairman of the Board.\nCORPORATE GOVERNANCE\nCode of Ethics\nEACO has adopted a code of ethics applicable to its senior executive and financial officers. You may receive, without charge, a copy of the Financial Code of Ethical Conduct by contacting our Corporate Secretary, c/o Bisco Industries, Inc., at 5065 East Hunter Avenue, Anaheim, California 92807.\nConcerns relating to accounting, internal controls or auditing matters should be brought to the attention of a member of our senior management or the Audit Committee as appropriate, and will be handled in accordance with the procedures established by the Audit Committee with respect to such matters.\nDirector Independence\nEACOs Board currently consists of the following directors: Stephen Catanzaro, Glen Ceiley, and William L. Means. The Board has determined that two of its three directors, Stephen Catanzaro and William L. Means, are independent as defined by the NASDAQ Stock Markets Marketplace Rules. In addition to such rules, the Board considered transactions and relationships between each director (and his immediate family) and the Company to determine whether any such relationships or transactions were inconsistent with a determination that the director is independent. As a result, the Board determined that Mr. Ceiley is not independent, as he is an executive officer of EACO and Bisco, a member of Biscos steering committee and the holder of a majority of the outstanding voting stock of the Company. Biscos steering committee handles the day to day operations of the Company, and Mr. Ceiley has been intimately involved with decision-making that directly affects the financial statements of the Company.\nBoard Structure\nThe Board does not have a policy regarding the separation of the roles of the Chief Executive Officer and Chairman of the Board as the Board believes it is in the best interest of the Company to make that determination based on the position and direction of the Company and the membership of the Board from time to time. Currently, Glen Ceiley, serves as the Chairman of the Board and CEO of both EACO and Bisco. The Board does not have a separate lead independent director, but the independent directors of the Company are actively involved in decision making by the Board. The Board has determined that the current structure is appropriate for the Company and enhances the Companys ability to execute its business and strategic plans and makes the best use of the CEOs knowledge of the Company and the industries that it serves, while maintaining strong independence over Board decisions and oversight through the involvement and participation of the independent directors.\nBoard Meetings and Committees\nIn accordance with the Bylaws of EACO, which empower the Board to appoint such committees as it deems necessary and appropriate, the Board has established an Audit Committee and an Executive Compensation Committee (the Compensation Committee). During the fiscal 2022, the Board of Directors and the various committees of the Board held the following number of meetings: Board of Directors - 2; Audit Committee - 2; and Compensation Committee. During fiscal 2022, no director attended fewer than 75% of the aggregate of the total number of meetings of the Board of Directors and the total number of meetings of any committees of the Board held while he was serving on the Board or such committee.\nAudit Committee\nThe Audit Committees basic functions are to assist the Board in discharging its fiduciary responsibilities to the shareholders and the investment community in the preservation of the integrity of the financial information published by the Company, to maintain free and open means of communication between the Companys directors, independent auditors and financial management, and to ensure the independence of the independent auditors. The Board has adopted a written charter for the Audit Committee, a copy of which was attached as Annex A to the Companys proxy statement for the 2016 Annual Meeting of Shareholders, as filed with the SEC on April 12, 2016. The Audit Committee charter is not available on EACOs website.\nThe members of the Audit Committee are Messrs. Catanzaro (Chairman) and Means. The Board has determined that each of Messrs. Catanzaro and Means is independent under the independence standards for audit committee members as set forth in the NASDAQ Stock Markets Marketplace Rules and the applicable SEC rules. The Board has identified Mr. Catanzaro as the member of the Audit Committee who qualifies as an audit committee financial expert under applicable SEC rules and regulations governing the composition of the Audit Committee.\nCompensation Committee\nThe Compensation Committee is generally responsible for establishing the salary and annual bonuses paid to executive officers of EACO and administering EACOs equity incentive plans, if any, including granting stock options to officers and employees of EACO. The Compensation Committee has not adopted a formal charter. The current members of the Compensation Committee are Messrs. Glen Ceiley (Chairman) and William Means. The Board has determined that Mr. Means is independent under the independence standards for Compensation Committee members as set forth in the NASDAQ Stock Markets Marketplace Rules. Mr. Ceiley is not an independent director.\nNomination of Directors\nThe Board does not have a Nominating Committee, but each director participates in the consideration of director nominees. Given the size and resources of EACO (and the large number of shares of common stock held by our majority shareholder), the Board believes that this approach is appropriate. The Board believes that having a separate committee would not enhance the nomination process. While the Board does not have a formal policy with regard to the consideration of diversity in identifying director nominees, it strives to nominate directors with a variety of complementary skills and backgrounds so that, as a group, the Board will possess the appropriate talent, skills, insight and expertise to oversee our business. These factors, and others as considered useful by the Board, are reviewed in the context of an assessment of the perceived needs of the Board at a particular point in time. As a result, the priorities and emphasis of the Board may change from time to time to take into account changes in business and other trends, and the portfolio of skills and experience of current and prospective directors. The Board periodically reviews the performance of each Board member and concludes whether or not the member should continue in their current capacity. EACO has not adopted a charter relating to the director nomination process, however, the Board will consider candidates for directors recommended by our shareholders who meet the eligibility requirements for submitting recommendations as set forth in EACOs Bylaws. Eligible stockholders who seek to recommend a nominee must submit such recommendation in writing to the our Corporate Secretary (c/o Bisco Industries, Inc., at 5065 East Hunter Ave, Anaheim, California 92807), by the deadline for director nominations set forth in our last proxy statement, specifying the following information: (i) the name and address of the candidate; (ii) a brief biographical description, including the candidates occupation for at least five years; (iii) a statement of the qualifications of the candidate; and (iv) the additional information concerning the candidate and the shareholder proposing such candidate as required by EACOs Bylaws. Such notice must be accompanied by a written consent of each candidate to being named as a nominee and to serve as a director if elected. Directors should possess qualities such as an understanding of the Companys business and operations and corporate governance principles. In connection with its evaluation, the Board may request additional information from the candidate or the recommending shareholder, and may request an interview with the candidate. The Board has the discretion to decide which individuals to recommend for nomination as directors. No candidates for director nominations were submitted to the Corporate Secretary by any shareholder in connection with the election of directors at the Annual Meeting.\nRisk Oversight\nWhile our management has the primary responsibility for identifying and mitigating risks, the Board has the overall responsibility for the oversight of such risks, with a focus on the most significant risks facing the Company. The Boards duties in this regard are supplemented by committees of the Board. In particular, the Audit Committee focuses on financial risk, including internal controls, and is responsible for discussing with management and our independent auditors policies with respect to risk assessment and risk management, including the process by which we undertake major financial and accounting decisions. Risks related to our compensation programs are reviewed by the Compensation Committee. In connection with its responsibilities relating to risk assessment, our full Board receives reports on risk management from senior officers of the Company, including the CEO of the Company, and from the Chairman of the Audit Committee, and periodically engages in discussions of the most significant risks that the Company is facing and how these risks are being managed. While the Company has not experienced any material cyber attack or breach, the Board is currently evaluating cyber security risks and has retained a third party consultant to assist it in this regard. Throughout the year, the Board will dedicate a portion of their meetings to review and discuss specific risk topics in greater detail.\nShareholder Communications\nThe Board has established a process by which shareholders may send written communications to the attention of the Board, any committee of the Board or any individual Board member, care of our Corporate Secretary. The name of any specific intended Board recipient should be noted in the communication. Our Corporate Secretary will be primarily responsible for collecting, organizing and monitoring communications from shareholders and, where appropriate depending on the facts and circumstances outlined in the communication, providing copies of such communications to the intended recipients. Communications will be forwarded to directors if they relate to appropriate and important substantive corporate or Board matters. Communications that are of a commercial or frivolous nature, or are offensive or otherwise inappropriate for the Boards consideration will not be forwarded to the Board. Shareholders who wish to communicate with the Board can write to the Corporate Secretary at EACO Corporation, c/o Bisco Industries, Inc., at 5065 East Hunter Avenue, Anaheim, California 92807. Item 11. Executive Compensation\nThe Compensation Committee is responsible for assisting with the establishment of the salary and annual bonuses paid to executive officers of EACO and administering EACOs equity incentive plans, if any, including granting stock options to officers and employees of EACO. The Compensation Committee has not adopted a formal charter. The current members of the Compensation Committee are Messrs. Glen Ceiley and William Means.\nThe officers of EACO are Mr. Ceiley, the Companys Chief Executive Officer and Chairman of the Board, and Mr. Michael Narikawa, the Companys Chief Financial Executive and Principal Accounting Officer. Due to the nature of EACOs operations and related consolidated financial results, no additional salary or other compensation for their service as officers of EACO was determined to be necessary, and no such compensation was provided to Mr. Ceiley or Mr. Narikawa during fiscal 2021 or fiscal 2020. However, both of them receive compensation from Bisco for their services provided to Bisco.\nAll compensation for the named executive officers for fiscal 2022 and fiscal 2021 was paid by Bisco. The compensation of named executive officers who serve as officers of Bisco are determined by Biscos Chairman of the Board, Glen Ceiley. Mr. Ceiley has received quarterly cash dividends in the amount of $19,125 on his shares of preferred stock of EACO.\nSummary Compensation\nThe following table sets forth information regarding compensation earned from the Company (including from Bisco, our wholly-owned subsidiary) during fiscal 2022 and fiscal 2021 by (i) our Chief Executive Officer, and (ii) the two other most highly compensated executive officers who were employed by the Company (including Bisco) as of August 31, 2022 and whose total compensation exceeded $100,000 during that year. The officers listed below are collectively referred to as the named executive officers in this report.\nFiscal\nAll Other\nName and Principal Position\nYear\nSalary\nBonus\nCompensation\nTotal\nGlen F. Ceiley\n$\n188,000\n(1)\n$\n4,338\n$\n5,860\n(2)\n$\n198,198\nChief Executive Officer and Chairman of the Board of EACO and Bisco\n224,000\n(1)\n4,338\n3,847\n(2)\n232,185\nDonald S. Wagner\n262,310\n368,025\n15,732\n(3)\n646,067\nPresident and Chief Operating Officer of Bisco\n262,310\n61,365\n12,421\n(3)\n336,096\nZachary Ceiley\n191,607\n332,754\n13,842\n(3)\n538,203\nExecutive Vice President of Bisco\n191,607\n56,726\n11,522\n(3)\n259,855\n(1) Includes $18,200 consulting fees payable to Glen Ceileys spouse, Barbara Ceiley, in each of fiscal 2022 and fiscal 2021.\n(2) Consists of the Companys matching contribution for Mr. G. Ceiley pursuant to the Companys Section 401(k) plan.\n(3) Includes (i) auto allowance of $6,696 payable to each of Messrs. Z. Ceiley and Wagner in fiscal 2022 and fiscal 2021; (ii) Section 401(k) matching contributions of $7,145 and $4,826 payable to Mr. Z. Ceiley in fiscal 2022 and fiscal 2021, respectively; and (iii) Section 401(k) matching contributions of $9,036 and $5,725 payable to Mr. Wagner in each of fiscal 2022 and fiscal 2021, respectively.\nOutstanding Equity Awards at Fiscal Year-End\nThe Company did not grant any equity awards during fiscal 2022 to any named executive officer, and no outstanding equity awards were held by the named executive officers at August 31, 2022.\nDirector Compensation\nThe Company pays $12,000 per year in cash to each director who is not employed by EACO or its subsidiary as compensation for their Board services. In addition, directors who do not receive a salary from EACO or its subsidiaries receive a fee of $600 for each Board meeting attended. The Chairman of the Audit Committee receives a fee of $800 per meeting attended. No additional fees are paid to directors for attendance at meetings of the Audit Committee or the Compensation Committee of the Board.\nThe following table sets forth the compensation of certain Company directors for the year ended August 31, 2022. (See the above Summary Compensation for information regarding Mr. Ceiley).\nFees Earned or\nDirector\nPaid in Cash\nTotal\nStephen Catanzaro\n$\n13,600\n$\n13,600\nWilliam Means\n13,200\n13,200 Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners and Management\nThe table below presents certain information regarding beneficial ownership of the Companys common stock (the Companys only voting security) as of October 31, 2022 (i) by each shareholder known to the Company to own more than five percent (5%) of the outstanding common stock, (ii) by each named executive officer and director of the Company, and (iii) by all directors and executive officers of the Company as a group. Under the rules of the SEC, the determinations of beneficial ownership of the Companys common stock are based upon Rule 13d-3 under the Exchange Act. Under Rule 13d-3, shares will be deemed to be beneficially owned when a person has, either solely or with others, the power to vote or to direct the voting of shares and/or the power to dispose, or to direct the disposition of shares, or where a person has the right to acquire any such power within 60 days after the date such beneficial ownership is determined. Shares of the Companys common stock that a beneficial owner has the right to acquire within 60 days are deemed to be outstanding for the purpose of computing the percentage ownership of such owner but are not deemed outstanding for the purpose of computing the percentage ownership of any other person.\nName and Address of\nShares of Common Stock\nPercent of\nBeneficial Owner (1)\nBeneficially Owned\nClass(2)\nStephen Catanzaro\n-\n-\nGlen F. Ceiley(3)\n4,702,813\n95.9\n%\nJay Conzen\n-\n-\nWilliam L. Means\n*\nDonald Wagner\n-\n-\nZachary Ceiley\n-\n-\nMichael Narikawa\n-\n-\nAll executive officers and directors as a group (7 persons)(3)\n4,703,135\n95.9\n%\n* Less than 1%\n(1) The address for each person named in the table is c/o Bisco Industries, Inc., 5065 East Hunter Ave, Anaheim, California 92807.\n(2) Based on 4,861,590 shares of common stock outstanding as of November 4, 2022.\n(3)\nIncludes (i) 4,662,813 shares of common stock held by the Trust; (ii) 40,000 shares of common stock issuable upon conversion of the 36,000 shares of Series A cumulative convertible preferred stock held by the Trust (assuming no accrued unpaid dividends). Item 13. Certain Relationships and Related Transactions and Director Independence\nCertain Relationships and Related Transactions\nSince September 1, 2018, except as described below or under Item 11 (Executive Compensation), there has not been, nor is there any proposed transaction, where we (or any of our subsidiaries) were or will be a party in which the amount involved exceeded or will exceed the lesser of $120,000 or one percent of the average of the Companys total assets at year end for the last two fiscal years and in which any director, director nominee, executive officer, holder of more than 5% of any class of our voting securities, or any member of the immediate family of any of the foregoing persons had or will have a direct or indirect material interest.\nThe Company leases the Glendale Heights Property and the Hunter Property under operating lease agreements with the Trust, which is a grantor trust of Glen Ceiley, the Companys Chief Executive Officer, Chairman of the Board and majority shareholder. During fiscal 2022 and fiscal 2021, the Company paid approximately $1,134,000 and $1,106,000, respectively, of rent related to these leases.\nOn November 21, 2017, Bisco entered into the Chicago Lease with the Trust for the Glendale Heights Property, which consists of office and warehouse space in Glendale Heights, Illinois. The initial base monthly rent is $22,600, which is subject to a 2.5% annual increase.\nOn July 26, 2019, the Company entered into the Hunter Lease with the Trust, for the lease of the Hunter Property, which houses the Companys new corporate headquarters. The Company completed its move to the new headquarters in March 2020. The term of the Hunter Lease commenced on September 2, 2019 and ends on August 31, 2029 with an initial monthly rental rate of $66,300, which is subject to annual rent increases of approximately 2.5% as set forth in the Hunter Lease. Item 14. Principal Accounting Services\nAudit Committee Pre-Approval Policies and Procedures\nThe Audit Committee is required to pre-approve all auditing services and permissible non-audit services, including related fees and terms, to be performed for the Company by its independent auditor, subject to the de minimus exceptions for non-audit services described under the Exchange Act, which are approved by the Audit Committee prior to the completion of the audit. The Audit Committee also considers whether the provision by its independent accounting firm of any non-audit related services is compatible with maintaining the independence of such firm. For fiscal 2022 and fiscal 2021, the Audit Committee pre-approved all services performed for the Company by the auditor.\nPrincipal Accountant Fees\nOn February 16, 2022, the Audit Committee of the Company approved the engagement of Haskell & White LLP (Haskell) to serve as the Companys independent registered public accounting firm for the Companys fiscal year ended August 31, 2021 and fiscal year ended August 31, 2022, effective as of February 17, 2022 and August 10, 2022, respectively. On February 16, 2022, the Audit Committee dismissed Baker Tilly US, LLP (Baker Tilly) as the Companys independent registered public accounting firm, effective as of February 17, 2022.\nDuring fiscal 2022 and fiscal 2021, the Company paid Baker Tilly $252,000 and $117,000, respectively, for audit fees. During fiscal 2022, the Company paid Haskell $225,000 in audit fees.\nAudit Fees\nAudit fees consist of fees billed for professional services rendered in connection with the audit of the financial statements included in the Companys annual reports on Form 10-K and for the reviews of the unaudited financial statements included in the Companys quarterly reports on Form 10-Q for the quarters ended during the years ended August 31, 2022 and 2021 and for other regulatory filings for such fiscal years.\nOther Fees\nThere were no other fees billed by Baker Tilly or Haskell during fiscal 2022 or fiscal 2021.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) Documents filed as part of this report:\n1. Financial Statements.\nOur consolidated financial statements are listed in the Index to Consolidated Financial Statements under Part II, Item 8 of this report.\n2. Financial Statement Schedules.\nAll financial schedules have been omitted because they are not required or are not applicable, or the required information is shown in our consolidated financial statements or notes thereto.\n3. Exhibits.\nEXHIBIT INDEX\nNumber\nExhibit\n3.1\nArticles of Incorporation of Family Steak Houses of Florida, Inc., as filed with the Florida Secretary of State on September 26, 1985. (Exhibit 3.01 to the Companys Registration Statement on Form S-1, Registration No. 33-1887, is incorporated herein by reference.)\n3.2\nArticles of Amendment to the Articles of Incorporation of Family Steak Houses of Florida, Inc., as filed with the Florida Secretary of State on March 26, 1986. (Exhibit 3.03 to the Companys Registration Statement on Form S-1, Registration No. 33-1887, is incorporated herein by reference.)\n3.3\nArticles of Amendment to the Articles of Incorporation of Family Steak Houses of Florida, Inc., as filed with the Florida Secretary of State on May 1, 1987. (Exhibit 3.04 to the Companys Registration Statement on Form S-1, Registration No. 33-17620, is incorporated herein by reference.)\n3.4\nArticles of Amendment to the Articles of Incorporation of Family Steak Houses of Florida, Inc., as filed with the Florida Secretary of State on March 3, 1998. (Exhibit 3.08 to the Companys Annual Report on Form 10-K, as filed with the SEC on March 31, 1998, is incorporated herein by reference.)\n3.5\nArticles of Amendment to the Articles of Incorporation of Family Steak Houses of Florida, Inc., as filed with the Florida Secretary of State on August 5, 2002 (Exhibit 3.09 to the Companys Annual Report on Form 10-K, as filed with the SEC on March 29, 2004 is incorporated herein by reference.)\n3.6\nArticles of Amendment to the Articles of Incorporation of Family Steak Houses of Florida, Inc., changing the name of the corporation to EACO Corporation, as filed with the Florida Secretary of State on June 18, 2004 (Exhibit 3.10 to the Companys Quarterly Report on Form 10-Q, as filed with the SEC on September 3, 2004, is incorporated herein by reference.)\n3.7\nArticles of Amendment Designating the Preferences of Series A Cumulative Convertible Preferred Stock $0.10 Par Value, as filed with the Florida Secretary of State on September 2, 2004 (Exhibit 3.1 to the Companys Current Report on Form 8-K, as filed with the SEC on September 8, 2004, is incorporated herein by reference.)\n3.8\nArticles of Amendment to Articles of Amendment Designating the Preferences of Series A Cumulative Convertible Preferred Stock, as filed with the Secretary of State of the State of Florida on December 22, 2009 (Exhibit 3.11 to the Companys Transition Report on Form 10-KT, as filed with the SEC on December 23, 2009, is incorporated herein by reference.)\n3.9\nAmended and Restated Bylaws of Family Steak Houses of Florida, Inc. (Exhibit 4 to the Companys Registration Statement on Form 8-A, filed with the SEC on March 19, 1997, is incorporated herein by reference.)\n3.10\nAmendment to Amended and Restated Bylaws of Family Steak Houses of Florida, Inc. (Exhibit 3.08 to the Companys Annual Report on Form 10-K filed with the SEC on March 15, 2000, is incorporated herein by reference.)\n3.11\nCertificate of Amendment to Amended and Restated Bylaws effective December 21, 2009 (Exhibit 3.10 to the Companys Transition Report on Form 10-K filed with the SEC on December 23, 2009 is incorporated herein by reference.)\nNumber\nExhibit\n10.1\nBusiness Loan Agreement dated July 12, 2019 ($10,000,000) between Bisco Industries, Inc. (Bisco) and Citizens Business Bank (Exhibit 10.1 to the Companys Current Report on Form 8-K filed with the SEC on July 24, 2019).\n10.2\nChange in Terms Agreement dated July 12, 2019 ($10,000,000) between Bisco and Citizens Business Bank (Exhibit 10.2 to the Companys Current Report on Form 8-K, as filed with the SEC on July 24, 2019, is incorporated herein by reference).\n10.3\nCommercial Guaranty dated July 12, 2019 ($10,000,000) issued by EACO Corporation (EACO) as guarantor in favor of Citizens Business Bank. (Exhibit 10.3 to the Companys current report on Form 8-K, as filed with the SEC on July 24, 2019, is incorporated herein by reference).\n10.4\nChange in Terms Agreement dated July 12, 2019 ($10,000,000) between Bisco and Citizens Business Bank. (Exhibit 10.1 to the Companys Current Report on Form 8-K, as filed with the SEC on July 30, 2018, is incorporated herein by reference).\n10.5\nCommercial Security Agreement dated July 12, 2018 ($10,000,000) among Bisco, EACO and Community Bank. (Exhibit 10.2 to the Companys Current Report on Form 8-K filed with the SEC on July 24, 2018, is incorporated herein by reference).\n10.6\nChange in Terms Agreement dated May 11, 2017 ($10,000,000) among Bisco, EACO and Citizens Business Bank. (Exhibit 10.1 to the Companys Current Report on Form 8-K, as filed with the SEC on May 23, 2017, is incorporated herein by reference).\n10.7\nBusiness Loan Agreement dated July 14, 2017 ($10,000,000) between Bisco and Community Bank (Exhibit 10.1 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference).\n10.8\nPromissory Note in the original principal amount of $10,000,000 dated July 14, 2016 issued by Bisco and payable to Community Bank. (Exhibit 10.3 to the Companys Current Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference).\n10.9\nBusiness Loan Agreement dated July 12, 2019 ($5,000,000) between Bisco and Citizens Business Bank (Exhibit 10.4 to the Companys Current Report on Form 8-K, as filed with the SEC on July 24, 2019, is incorporated herein by reference).\n10.10\nPromissory Note dated July 12, 2019 ($5,000,000) issued by Bisco in favor of Citizens Business Bank (Exhibit 10.5 to the Companys Current Report on Form 8-K, as filed with the SEC on July 24, 2019, is incorporated herein by reference).\n10.11\nCommercial Security Agreement dated July 12, 2019 ($5,000,000) between Bisco and Citizens Business Bank. (Exhibit 10.6 to the Companys Current Report on Form 8-K filed, as with the SEC on July 24, 2019, is incorporated herein by reference).\n10.12\nChange in Terms Agreement dated July 13, 2018 ($100,000 CD) among EACO and Community Bank (executed on July 24, 2018). (Exhibit 10.3 to the Companys Current Report on Form 8-K, as filed with the SEC on July 30, 2018, is incorporated herein by reference).\n10.13\nPromissory Note dated July 12, 2016 ($100,000) issued by EACO and payable to Comerica Bank (Exhibit 10.7 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference).\n10.14\nBusiness Loan Agreement dated May 15, 2017 ($5,400,000) between Bisco and Community Bank (Exhibit 10.8 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference).\n10.15\nPromissory Note dated May 15, 2017 ($5,400,000) issued by Bisco and payable to Community Bank. (Exhibit 10.9 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference).\n10.16\nCommercial Guaranty dated May 15, 2017 issued by EACO in favor of Community Bank. (Exhibit 10.10 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference).\n10.17\nDeed of Trust dated May 15, 2017 ($5,400,000) between Bisco and Community Bank (Exhibit 10.3 to the Companys Current Report on Form 8-K. as filed with the SEC on May 23, 2017, is incorporated herein by reference.)\n10.18\nAssignment of Leases and Rents dated May 15, 2017 ($5,400,000) between Bisco and Community Bank (Exhibit 10.4 to the Companys Current Report on Form 8-K, as filed with the SEC on May 23, 2017, is incorporated herein by reference.)\nNumber\nExhibit\n10.19\nStandard Offer, Agreement and Escrow Instructions for Purchase of Real Estate dated September 19, 2019 (Lakeview sale and lease back) between Bisco and Charles S. Alemi or his assignee (Exhibit 10.1 to the Companys Current Report on Form 8-K, as filed with the SEC on September 25, 2019, is incorporated herein by reference.)\n10.20\nCommercial and Industrial Lease Agreement dated November 21, 2017 (Chicago Lease) between Bisco and the Glen F. Ceiley and Barbara A. Ceiley Revocable Trust (the Trust) (Exhibit 10.33 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 22, 2017, is incorporated herein by reference.)\n10.21\nCommercial and Industrial Lease Agreement dated July 26, 2019 (Hunter Lease) between Bisco and the Trust (Exhibit 10.1 to the Companys Current Report on Form 8-K, as filed with the SEC on August 1, 2019, is incorporated herein by reference.)\n10.22\nBusiness Loan Agreement dated November 27, 2019 ($15,000,000) between Bisco and Citizens Business Bank (executed on December 4, 2019). (Exhibit 10.1 to the Companys Current Report on Form 8-K, as filed with the SEC on December 6, 2019, is incorporated herein by reference.)\n10.23\nChange in Terms Agreement dated November 27, 2019 ($15,000,000) between Bisco and Citizens Business Bank (executed on December 4, 2019) (Exhibit 10.2 to the Companys Current Report on Form 8-K, as filed with the SEC on December 6, 2019, is incorporated herein by reference.)\n10.24\nCommercial Guaranty dated November 27, 2019 ($15,000,000) between EACO and Citizens Business Bank (executed on December 4, 2019). (Exhibit 10.3 to the Companys Current Report on Form 8-K, as filed with the SEC on December 6, 2019, is incorporated herein by reference.)\n21.1\nSubsidiaries of the Company (Exhibit 21.1 to the Companys Annual Report on Form 10-K, as filed with the SEC on November 29, 2011, is incorporated herein by reference.)\n31.1*\nCertification of Chief Executive Officer (principal executive officer and principal financial officer) pursuant to Securities and Exchange Act Rules 13a-14(a) and 15d-14(a) as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1*\nCertification of Chief Executive Officer (principal executive officer and principal financial officer) pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nNovember 4, 2022\nEACO Corporation\n/s/ Glen F. Ceiley\nBy: Glen F. Ceiley\nIts: Chairman of the Board and Chief Executive Officer\n(principal executive officer and principal financial officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the Registrant in the capacities and on the date indicated.\nSignature\nTitle\nDate\n/s/ Glen F. Ceiley\nChairman of the Board and Chief Executive Officer\n11/4/2022\nGlen F. Ceiley\n(principal executive officer and principal financial officer)\n/s/ Michael Narikawa\nChief Financial Executive (principal accounting officer)\n11/4/2022\nMichael Narikawa\n/s/ Steve Catanzaro\nDirector\n11/4/2022\nSteve Catanzaro\n/s/ William Means\nDirector\n11/4/2022\nWilliam Means"
}