{
    "cik": "785557",
    "company": "DLH Holdings Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-12-05",
    "period_of_report": "2022-09-30",
    "sic": "7363",
    "state_of_inc": "NJ",
    "state_location": "GA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/785557/0000785557-22-000046-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/785557/000078555722000046/dlhc-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/785557/0000785557-22-000046.txt",
    "filename": "785557_10K_2022_0000785557-22-000046.htm",
    "content": "ITEM 1. BUSINESS\nOverview and Background\nDLH Holdings Corp. (\"DLH\"), founded in 1969 as a New Jersey Corporation, is a holding company whose direct 100%-owned operating subsidiaries include DLH Solutions, Inc. (\"DLH Solutions\"), Social & Scientific Systems, Inc. (\"S3\"), Irving Burton Associates, LLC (\"IBA\"), and Danya International LLC (\"Danya\").\nDLH is a provider of technology-enabled business process outsourcing, program management solutions, and public health research and analytics. We bring a unique combination of government sector experience, proven methodology, and unwavering commitment to public health to improve the lives of millions. We combine our expertise and technical capabilities to build upon our strong record of delivering improved health and readiness solutions for federal programs through research, development, and innovative care processes including technology-enabled solutions, public health research, advance analytics, and other services. The Company's expertise in public health, performance evaluation, and health operations solve the complex problems faced by civilian and military customers alike, leveraging digital transformation, artificial intelligence, advanced analytics, cloud-based applications, telehealth systems, and more.\nCompetitive Advantages\nWe believe we are advantageously positioned within our markets by a number of features including, but not limited to:\nspecialized credentials and licenses held by a substantial component of our employee base;\nprimarily performing as the prime contractor;\nstrong past performance record across our government contracts; and\ntargeted expansion in critical national priority markets with Federal budget stability to include public health and epidemiological support related to COVID-19\nWe continue to invest in credentials that drive excellence in our support to current clients and create differentiation as we compete in this space. These investments include development of secure IT platforms, sophisticated data analytic tools and techniques, and implementation of a lean six sigma environment. We are actively pursuing additional credentials that will support our customer's needs in providing a secure cloud computing environment.\nSolutions and Services\nWe primarily focus on improved deployment of large-scale federal health and human services initiatives for the Department of Veterans Affairs (\"VA\"), Department of Health and Human Services (\"HHS\"), Department of Defense (\"DoD\"), Department of Homeland Security (\"DHS\"), and many of their sub-agencies.\nOur following services and solutions are aligned with the long-term needs of our customers:\nDefense and Veteran Health Solutions;\nHuman Services and Solutions;\nPublic Health and Life Sciences; and\nInfinibyte® Cloud Services\nWe operate primarily through prime contracts awarded by the government through competitive bidding processes. We have a diverse mix of contract vehicles with various agencies of the United States Government, which supports our overall corporate growth strategy. Our revenue is distributed to time and materials contracts (78%), cost reimbursable contracts (12%) and the remaining are firm fixed price contracts (10%). We also provide services under Indefinite Duration, Indefinite Quantity (\"IDIQ\") and government wide acquisition contracts, such as General Services Administration (\"GSA\") schedule contracts. The Company currently holds multiple GSA schedule contracts, under which we provide services that constitute a significant percentage of our total revenue. These Federal contract schedules are renewed on a recurring basis for multi-year periods.\nDefense and Veteran Health Solutions\nWe provide critical healthcare, technology, and logistics solutions to the VA, Defense Health Agency (\"DHA\"), Tele-medicine and Advanced Technology Research Center (\"TATRC\"), Navy Bureau of Medicine and Surgery, and the Army Medical Research and Material Command (\"MRDC\"). Our professionals specialize in supporting our customers' evolving needs by rapidly deploying resources, solutions, and services. We support our customers' missions by providing leading technology-enabled solutions and services encompassing new capabilities at the forefront of technology to include artificial intelligence, machine learning, health informatics, and robotics.\nWe are at the forefront of ensuring that veterans receive their out-patient prescriptions on time, each day, through our award winning VA Consolidated Mail Order Pharmacy (\"CMOP\") program. Further, we support our customer's efforts to broaden its abilities to reach veterans and their families through telemedicine technology and practices.\nHuman Services and Solutions\nWe support our customers by providing a wide range of services and solutions to HHS, DHS, and Department of State (\"State\"). Our professionals provide a range of support services critical to the customers' missions and their respective operating divisions, to include the Office of Head Start (\"OHS\"), Administration for Children and Families (\"ACF\"), the Federal Emergency Management Agency (\"FEMA\"), and the United States Agency of International Development (\"USAID\"). In this market, we combine subject matter expertise with our experience in information technology and analytics to provide large-scale program monitoring and evaluation; electronic medical records migration; data collection and management; and nutritional and social health assessments. Additionally, we also provide large-scale data analytics as well as enterprise-level IT system architecture design, migration planning, and ongoing management of system implementation and capacity building using experienced subject matter experts and project management resources. During the COVID-19 pandemic, we have supported our customers' efforts by rapidly deploying specialty resources to support resource constrained health-care providers.\nPublic Health and Life Sciences\nWe provide services to multiple operating divisions within HHS, including the National Institutes of Health (\"NIH\"), the Center for Disease Control and Prevention (\"CDC\"), and the Centers for Medicare and Medicaid Services (\"CMS\"). We have partnered with our customers to deliver solutions to combat the COVID-19 pandemic that allow the nation and its people to combat the pandemic and sustain operations and services.\nOur professionals provide services include clinical trials, epidemiology studies, advancing disease prevention methods and health promotion to underserved and at-risk communities. We deliver our services through development of strategic communication campaigns, research on emerging trends, health informatics analyses, and application of best practices including mobile, social, and interactive media. We leverage evidence-based methods and web technology to drive health equity to our most vulnerable populations through public engagement. Projects often involve highly specialized expertise and research methodologies.\nInfinibyte® Cloud Service\nWe built Infinibyte® Cloud as a platform-as-a-service cloud service offering, specially architected and engineered to meet federal information security and compliance requirements. It delivers a computing and storage platform to U.S. government agencies, enabling them to develop, run, and manage applications in a FedRAMP compliant environment. FedRAMP is the government's rigorous security compliance certification which provides a standardized approach to security assessment, authorization, and continuous monitoring for cloud service providers and prescribes the security requirements and processes cloud service providers must follow in order for the U.S. government to use their service. The solution has received a FedRAMP Moderate authorization and is one of the few platform-as-a-service solutions listed on the FedRAMP marketplace, further enhancing our ability to demonstrate our technical expertise and offer our customers a secure cloud environment. We have invested in agile software development credentials for our technical staff, and have achieved Capability Maturity Model Integration (\"CMMI\") level 3. We believe that these qualifications will further enhance our value propositions for current programs, as well as future business we pursue. In addition, we continue to build upon our heritage of excellent customer satisfaction in support of key federal programs. We have achieved Joint Commission certification for the safety and quality of our healthcare services delivery against national standards. These nationally recognized best practices certifications demonstrate our commitment to continuous improvement and performance excellence that is critical to our organic growth objectives.\nWe continue to invest in credentials that drive excellence in our support to current clients and create differentiation as we compete in this space. These investments include development of secure IT platforms, sophisticated data analytic tools and techniques, and implementation of a lean six sigma environment. We continue to actively pursue additional credentials that will support our customers' needs in providing a secure cloud computing environment.\nMajor Customers\nThe majority of our revenues are from agencies of the United States Federal government. A major customer is defined as a customer from whom we derive at least 10% of our revenues. The following table summarizes the revenues by customer for the years ended September 30, 2022 and 2021, respectively (in thousands):\n2022 2021\nRevenue Percent of total revenue Revenue Percent of total revenue\nDepartment of Homeland Security $ 126,576 32.0 % $ 2,485 1.0 %\nDepartment of Veterans Affairs 126,106 31.9 % 110,078 44.7 %\nDepartment of Health and Human Services 102,201 25.9 % 91,543 37.2 %\nDepartment of Defense 33,612 8.5 % 30,930 12.6 %\nCustomers with less than 10% share of total revenue 6,678 1.7 % 11,058 4.5 %\nTotal revenue $ 395,173 100.0 % $ 246,094 100.0 %\nMajor Contracts\nWe operate primarily through prime contracts awarded by the government through competitive bidding processes. We have a diverse mix of contract vehicles with various agencies of the United State government, which supports our overall corporate growth strategy. Our Federal contract schedules are renewed on a recurring basis for multi-year periods.\nThe revenue attributable to the VA customers was derived from 16 separate contracts for our performance of pharmacy and logistics services in support of the VAs consolidated mail outpatient pharmacy program.\nNine contracts for pharmacy services, which represent approximately $70.4 million and $62.8 million of revenues for the years ended September 30, 2022 and 2021, respectively, are currently operating under a bridge contract through October 2023.\nSeven contracts for logistics services represent approximately $55.7 million and $47.2 million of revenues for the years ended September 30, 2022 and 2021, respectively, are currently operating under a bridge contract through November 2023.\nThe government has neither indicated nor announced its future procurement strategy with respect to these contracts. Due to the time required to conduct a procurement process, we expect these contracts to be further extended.\nPursuant to its customary acquisition process, the VA has indicated its intention to pursue renewal of these contracts with a service-disabled veteran owned small business (\"SDVOSB\") as the prime contractor. DLH maintains relationships with SDVOSB partners. Should the new contracts for performance of these services be awarded to a partner of DLH, the Company expects to continue to perform a significant amount of the contracts volume of business as a subcontractor.\nShould the VA conclude that an award to an SDVOSB prime contractor is not in the best interest of the government, they may reissue a solicitation in an unrestricted competition. DLH believes that its service excellence over many years on the program would provide an advantage in an unrestricted competition.\nOur contract with HHS in support of the Head Start program generated $34.2 million and $28.2 million of revenue for the years ended September 30, 2022 and 2021, respectively. This contract has a period of performance through April 2025.\nAs previously reported, we were awarded two short-term task orders under a FEMA contract to provide support for states seeking temporary medical staffing support and COVID-19 related community testing, vaccination and therapy. Those contracts generated $125.8 million of revenue for the fiscal year ended September 30, 2022. The contract to support COVID-19 related community testing, vaccination and therapy ended on December 31, 2021. The contract to provide temporary medical staffing support completed on March 20, 2022.\nBacklog\nAt September 30, 2022, our backlog was approximately $482.5 million, of which $98.9 million was funded backlog. At September 30, 2021 our backlog was $651.5 million, of which $191.0 million was funded backlog.\nWe define backlog as our estimate of remaining future revenue from existing signed contracts, assuming the exercise of all options relating to such contracts and including executed task orders issued under Indefinite Quantity/Indefinite Delivery (\"IDIQ\") contracts or if the contract is a single award IDIQ contract.\nWe define funded backlog as the portion of backlog for which funding is appropriated and allocated to the contract by the customer and authorized for payment by the customer, once specified work is completed. Funded backlog does not include the full contract value as Congress often appropriates funding for contracts on a yearly or quarterly basis.\nCircumstances and events may cause changes in the amount of our backlog and funded backlog, including the execution of new contracts, extension of existing contracts, non-renewal or completion of current contracts, early termination, and adjustments to estimates. Changes in funded backlog may be affected by the funding cycles of the government. While no assurances can be given that existing contracts will result in earned revenue in any future period, or at all, our major customers have historically exercised their contractual renewal options.\nBacklog value is quantified from management's judgment and assumptions about the volume of services based on past volume trends and current planning developed with customers.\nCompetitive Landscape\nCompetitive solicitations and long business development cycles are characteristics of the government and defense industry in which we operate. For major program competition, the business acquisition cycle typically ranges from 18 to 36 months. Companies may pursue work either as prime contractor or partner with other companies in a subcontractor role. Those competing as prime contractors normally expend substantially more resources than those in subcontractor roles. We partner and compete with several large and small-business companies in pursuit of acquiring new business.\nOur competitors include operating units within, among others: Booz Allen Hamilton Holding Corp., CACI International, Inc., ICF International, Inc., Leidos Holdings, Inc., Mantech International Corp., MAXIMUS, Inc., UnitedHealth Group, Inc. operating under Optum, RTI International, and Westat, Inc.\nWe compete with these companies by leveraging our differentiating suite of tools and uniquely integrating people and processes resulting in highly competitive proposals and a solid track record of past performance. We believe that our proprietary tools and processes, including e-PRAT® and SPOT-m®, along with our Infinibyte® cloud-based management system differentiate us from our competitors. We compete for awards through a full and open competition on a best-value basis. We draw heavily from our consistently high-quality past performance ratings, proven and evolving technical differentiators, key personnel credentials and growing market recognition to compete. We believe that our track record, knowledge and processes with respect to government contract bidding represent significant competitive advantages. Further, we believe that the range and depth of educational experience and professional credentials and certifications held by our employees allows us to deploy highly-qualified teams to implement solutions to address the needs of our customers. Our recent and future success in this competitive landscape hinges on our ability to continue to uniquely integrate people, processes and technology tools to deliver best value solutions for our targeted clients (both government and industry partners).\nAdditionally, the Federal government may elect to restrict certain procurement activity, including renewals of our current contracts, to bidders that qualify for certain special statuses such as veteran owned, small, or small disadvantaged businesses. For those efforts, we would be limited to a subcontractor role.\nSeasonality\nThe U.S. government's fiscal year ends on September 30 each year. It is not uncommon for U.S. government agencies to award extra tasks or complete other contract actions within this timeframe leading up to the fiscal year end in order to avoid losses of unexpended fiscal year funds.\nRegulation\nOur business is affected by numerous laws and regulations relating to the award, administration and performance of U.S. Government contracts. In addition, many federal and state laws materially affect our operations. These laws relate to ethics, labor, tax, and employment matters. As any employer is, we are subject to federal and state statutes and regulations governing their standards of business conduct with the government, including that government contracts typically contain provisions permitting government clients to terminate contracts without cause with limited notice or compensation. The development of additional statutes and regulations and interpretation of existing statutes and regulations with respect to our industry can be expected to evolve over time. Through our corporate membership with the Professional Services Council and other affiliations, we monitor proposed and pending regulations from relevant congressional committees and government agency policies that have potential impact upon our industry and our specific strategically targeted markets. As with any commercial enterprise, we cannot predict with certainty the nature or direction of the development of Federal statutes and regulations that will affect its business operations. See Risk Factors in Part I, ITEM 1A. RISK FACTORS\nAs provided for under the Private Securities Litigation Reform Act of 1995 (\"1995 Reform Act\"), we wish to caution shareholders and investors that the following important factors, among others discussed throughout this Annual Report on Form 10-K for the fiscal year ended September 30, 2022, have affected, and in some cases could affect, our actual results of operations and cause our results to differ materially from those anticipated in forward looking statements made herein. Our business, results of operations, cash flows and financial condition may be materially and adversely affected due to any of the following risks. The risks described below are not the only ones we face. Additional risks we are not presently aware of or that we currently believe are immaterial may also impair our business operations. The trading price of our common stock could decline due to any of these risks. In assessing these risks, you should also refer to the other information contained or incorporated by reference in this Annual Report on Form 10-K, including our consolidated financial statements and related notes.\nRisks Relating to Our Business and the Industry in which we Compete\nOur results of operations could in the future be materially adversely impacted by global, macroeconomic events, such as the coronavirus pandemic (COVID-19), and the response to contain it.\nThe coronavirus (COVID-19) pandemic and the mitigation efforts to control its spread have created significant volatility, uncertainty and economic disruption. The extent to which the coronavirus pandemic and recovery activity impacts our business, operations and financial results will depend on numerous evolving factors that we may not be able to accurately predict, including: the duration and scope of the pandemic; governmental, business and individuals actions that have been and continue to be taken in response to the pandemic, including our ability to fully perform on our contracts as a result of government actions or reduction in personnel due to the federal vaccine mandate which requires all federal contractors to be vaccinated; the impact of the pandemic on economic activity and actions taken in response; the effect on our clients and client demand for our services and solutions; our ability to sell and provide our services and solutions, including as a result of travel restrictions and people working from home (as described below in the Management Discussion & Analysis, this has resulted in certain delays in our provision of services and postponements of project work requiring travel) and any closures of our and our clients offices and facilities, particularly at our pharmacy distribution centers. Furthermore, the significant increase in remote working of our employees may exacerbate certain risks to our business, including an increased demand for information technology resources and the increased risk of malicious technology-related events, such as cyberattacks and phishing attacks. Customers may also slow down decision making, delay planned work or seek to terminate existing agreements. Government agencies are our primary customers and the long-term impact of increased government spending in response to COVID-19 remains uncertain. The duration and spread of the pandemic still may cause reduced demand for certain services we provide, particularly if its results in a recessionary economic environment or the spending priorities of the U.S. government shift in ways adverse to our business focus. Any of these events could materially adversely affect our business, financial condition, results of operations and the market price of our common stock.\nWe depend on contracts with the Federal government for virtually all of our revenue and our business could be seriously harmed if the Federal government decreased or ceased doing business with us.\nAt present, we derive 99% of our revenue from agencies of the Federal government, primarily as a prime contractor but also as a subcontractor to other Federal prime contractors. In addition, substantially all accounts receivable, including unbilled accounts receivable, are from agencies of the U.S. Government as of September 30, 2022 and 2021. We believe that the credit risk associated with our receivables is limited due to the creditworthiness of these customers. In general, if we were suspended or debarred from contracting with the federal government or if the government otherwise ceased doing business with us or significantly decreased the amount of business it does with us, our business, financial condition and operating results would be materially and adversely affected.\nA significant portion of our revenue is concentrated in a small number of contracts and we could be seriously harmed if we were unable to continue providing services under, or unsuccessful in our recompete efforts on, these contracts.\nWe are dependent upon the continuation of our relationships with the VA and HHS as a significant portion of our revenue is concentrated in a small number of contracts with these customers. There can be no assurance as to the actual amount of services that we will ultimately provide to VA and HHS under our current contracts, or that we will be successful in recompete efforts. As described in greater detail above in \"Item 1 - Business - Major Contracts\", our contracts with the VA for the provision of services to its CMOP operations are expected to be subject to renewal solicitations. We believe that our strong working relationships and effective service delivery support ongoing performance for the terms of the contracts and recompete efforts as a prime or subcontractor. Our results of operations, cash flows and financial condition would be materially adversely affected if we were unable to continue our relationship with either of these customers, if we were to lose any of our material current contracts, or if the amount of services we provide to them is materially reduced.\nThe U.S. government may prefer veteran-owned, minority-owned, women-owned and small disadvantaged businesses; therefore, we may have fewer opportunities to bid for or could lose a portion of our existing work to small businesses.\nAs a result of the Small Business Administration (\"SBA\") set-aside program, the U.S. government may decide to restrict certain procurement activity only to bidders that qualify as veteran owned, minority-owned, small, or small disadvantaged businesses. In such cases, we would not be eligible to perform as a prime contractor on those programs and would be limited to work as a subcontractor on those programs. As previously reported, various agencies within the federal government have policies that support small business goals, including the adoption of the Rule of Two by the VA, which provides that the agency shall award contracts by restricting competition for the contract to service-disabled or other veteran owned businesses. To restrict competition pursuant to this rule, the contracting officer must reasonably expect that at least two of these businesses, which are capable of delivering the services, will submit offers and that the award can be made at a fair and reasonable price that offers the best value to the United States. The effect of these set-aside provisions may limit our ability to compete for prime contractor positions on programs that we have targeted for growth and to maintain our prime contractor position as current contracts are subject to renewal.\nLoss of our GSA schedule contracts or other contracting vehicles could impair our ability to win new business and perform under existing contracts.\nWe currently hold multiple GSA schedule contracts, including a Federal supply schedule contract for professional and allied healthcare services and the logistics worldwide services contract. If we were to lose one or more of these contracts or other contracting vehicles, we could lose a significant revenue source and our operating results and financial condition could be materially and adversely affected.\nFuture legislative or government budgetary and spending changes could negatively impact our business.\nU.S. Government programs are subject to annual congressional budget authorization and appropriation processes. For many programs, Congress appropriates funds on a fiscal year basis even though the program performance period may extend over several years. Consequently, programs are often partially funded initially and additional funds are committed only as Congress makes further appropriations. Further, congressional seats may change during election years, and the balance of spending priorities may change along with them.\nIn recent years, we have seen frequent debates regarding the scope of funding of our customers, thereby leading to budgetary uncertainty for our Federal customers. Changes in federal government budgetary priorities could directly affect our financial performance. A significant decline in government expenditures, a shift of expenditures away from programs that we support or a change in federal government contracting policies could cause federal government agencies to reduce their purchases under contracts, to exercise their right to terminate contracts at any time without penalty or not to exercise options to renew contracts. In the event the budgets or budgetary priorities of the U.S. Government entities with which we do business are delayed, decreased or underfunded, our consolidated revenues and results of operations could be materially and adversely affected.\nWe may experience disruption of existing programs, delays in contract awards, and other actions, including partial or complete contract terminations. VA programs, which accounted for approximately 32% and 45% of Company revenue for the years ended September 30, 2022 and 2021, respectively, were exempt from the spending caps established under Federal government sequestration targets enacted in 2013.\nThe government is currently operating under a continuing resolution (CR) which expires December 16, 2022. When a CR expires, unless appropriations bills have been passed by Congress and signed by the President, or a new CR is passed and signed into law, the government must cease operations, or shutdown, except in certain emergency situations or when the law authorizes continued activity. We continuously review our operations in an attempt to identify programs potentially at risk from CRs so that we can consider appropriate contingency plans.\nThe markets in which we operate are highly competitive, and many of the companies we compete against have substantial resources. Further, the U.S. Government contract bid process is highly competitive, complex and sometimes lengthy, and is subject to protest and implementation delays.\nThe markets in which we operate are highly competitive. Further, many of our contracts and task orders with the Federal government are awarded through a competitive bidding process, which is complex and sometimes lengthy. We expect that much of the opportunities we will seek in the foreseeable future will be awarded through competitive bidding. Furthermore, budgetary pressures and developments in the procurement process have caused many government customers to increasingly purchase goods and services through IDIQ contracts, GSA schedule contracts and other government-wide acquisition contracts. These contracts, some of which are awarded to multiple contractors, have increased competition and pricing pressure, requiring that we make sustained post-award efforts to realize revenue under each such contract. Many of our competitors are larger and have greater resources than we do, larger client bases and greater brand recognition. Our competitors, individually or through relationships with third parties, may be able to provide clients with different or greater capabilities or benefits than we can provide. If we are unsuccessful in competing with these other companies, our revenues and margins may materially decline.\nOverall, the competitive bidding process presents a number of risks, including the following: (i) we expend substantial cost and managerial time and effort to prepare bids and proposals for contracts that we may not win, and to defend those bids through any protest process; (ii) we may be unable to estimate accurately the resources and cost structure that will be required to service any contract we win; and (iii) we may encounter expenses and delays if our competitors protest or challenge awards of contracts to us in competitive bidding, and any such protest or challenge could result in the resubmission of bids on modified specifications, or in the termination, reduction or modification of the awarded contract. If we are unable to win particular contracts, we may be prevented from providing the services that are purchased under those contracts for a number of years. If we are unable to consistently win new contract awards over any extended period, our business and prospects will be adversely affected and that could cause our actual results to differ materially and adversely from those anticipated. In addition, upon the expiration of a contract, if the customer requires further services of the type provided by the contract, there is frequently a competitive rebidding process. There can be no assurance that we will win any particular bid, or that we will be able to replace business lost upon expiration or completion of a contract, and the termination or non-renewal of any of our significant contracts could cause our actual results to differ materially and adversely from those anticipated.\nIf a bid is won and a contract awarded, there still is the possibility of a bid protest or other delays in implementation. Our business could be adversely affected by delays caused by our competitors protesting major contract awards received by us, resulting in the delay of the initiation of work. It can take many months to resolve protests by one or more of our competitors of contract awards we receive. The resulting delay in the startup and funding of the work under these contracts may cause our actual results to differ materially and adversely from those anticipated, and there can be no assurance that such protest process or implementation delays will not have a material adverse effect on our financial condition or results of operations in the future.\nOur business may suffer if we or our employees are unable to obtain and maintain the necessary security clearances or other qualifications required to perform services for our clients.\nMany federal government contracts require us to have security clearances and employ personnel with specified levels of education, work experience and security clearances. Depending on the level of clearance, security clearances can be difficult and time-consuming to obtain. If we or our employees lose or are unable to obtain necessary security clearances, we may not be able to win new business and our existing clients could terminate their contracts with us or decide not to renew them. To the extent we cannot obtain or maintain the required security clearances for our employees working on a particular contract, we may not derive the revenue anticipated from the contract, which could cause our results to differ materially and adversely from those anticipated.\nOur business is regulated by complex federal procurement and contracting laws and regulations, and we are subject to periodic compliance reviews by governmental agencies.\nWe must comply with complex laws and regulations relating to the formation, administration, and performance of federal government contracts, including the Federal Acquisition Regulation, which, among other things, requires us to certify and disclose cost and pricing data and to divest work in the event of certain organizational conflicts of interest. These laws and regulations create compliance risk and affect how we do business with our federal agency clients, and may impose added costs on our business. The government may in the future reform its procurement practices or adopt new contracting rules and regulations, including cost accounting standards, that could be costly to satisfy or that could impair our ability to obtain new contracts. Additionally, the government may face restrictions from new legislation, regulations or government union pressures, on the nature and amount of services the government may obtain from private contractors. Any reduction in the governments use of private contractors to provide federal services could cause our actual results to differ materially and adversely from those anticipated.\nOur performance on our U.S. Government contracts and our compliance with applicable laws and regulations, including submission of invoices to our customers, are subject to audit by the government. The scope of any such audits could span multiple fiscal years. These agencies review our performance on contracts, pricing practices, cost structure and compliance with applicable laws, regulations and standards. They also evaluate the adequacy of internal controls over our business systems, including our purchasing, accounting, estimating, earned value management, and government property systems. Any costs found to be improperly allocated or assigned to contracts will not be reimbursed, and any such costs already reimbursed must be refunded and certain penalties may be imposed. Moreover, if any of the administrative processes and systems are found not to comply with requirements, we may be subjected to increased government scrutiny and approval that could delay or otherwise adversely affect our ability to compete for or perform contracts or collect our revenues in a timely manner. Therefore, an unfavorable outcome of an audit could cause actual results to differ materially and adversely from those anticipated. If a government review or investigation uncovers illegal activities or activities not in compliance with a particular contract's terms or conditions, we may be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, harm to our reputation, suspension of payments, fines, and suspension or debarment from doing business with Federal government agencies. Any of these events could lead to a material reduction in our revenues, cash flows and operating results. Further, as the reputation and relationships that we have established and currently maintain with government personnel and agencies are important to our ability to maintain existing business and secure new business, damage to our reputation or relationships could have a material adverse effect on our revenue and operating results.\nFederal government contracts may be terminated at will and may contain other provisions that may be unfavorable to us.\nMany of the U.S. Government programs in which we participate as a contractor or subcontractor may extend for several years. The U.S. Government may modify, curtail or terminate its contracts and subcontracts for convenience and to the extent that a contract award contemplates one or more option years, the Government may decline to exercise such option periods. Accordingly, the maximum contract value specified under a government contract or task order awarded to us is not necessarily indicative of the revenue that we will realize under that contract. Due to our dependence on these programs, the modification, curtailment or termination of our major programs or contracts may have a material adverse effect on our results of operations and financial condition. In addition, federal government contracts contain provisions and are subject to laws and regulations that give the government rights and remedies, some of which are not typically found in commercial contracts, including allowing the government to (i) cancel multi-year contracts and related orders if funds for contract performance for an subsequent year become unavailable; (ii) claim rights in systems and software developed by us; (iii) suspend or debar us from doing business with the federal government or with a governmental agency; and (iv) impose fines and penalties and subject us to criminal prosecution. If the government terminates a contract for convenience, we may recover only our incurred or committed costs, settlement expenses and profit on work completed prior to the termination. If the government terminates a contract for default, we may be unable to recover even those amounts and instead may be liable for excess costs incurred by the government in procuring undelivered items and services from another source. Depending on the value of a contract, such termination could cause our actual results to differ materially and adversely from those anticipated.\nCertain contracts also contain organizational conflict of interest (OCI) clauses that limit our ability to compete for or perform certain other contracts. OCIs arise any time we engage in activities that (i) make us unable or potentially unable to render impartial assistance or advice to the government; (ii) impair or might impair our objectivity in performing contract work; or (iii) provide us with an unfair competitive advantage. For example, when we work on the design of a particular system, we may be precluded from competing for the contract to develop and install that system. Depending upon the value of the matters affected, an OCI issue that precludes our participation in or performance of a program or contract could cause our actual results to differ materially and adversely from those anticipated.\nWe may not receive the full amounts authorized under the contracts included in our backlog, which could reduce our revenue in future periods below the levels anticipated.\nOur total backlog consists of funded and unfunded amounts and may include estimates and assumptions about matters that cannot be determined with certainty at the time the backlog is calculated. Funded backlog represents contract value that has been appropriated by a customer and is expected to be recognized into revenue. Unfunded backlog represents the sum of the unappropriated contract value on executed contracts and unexercised option years that is expected to be recognized into revenue. The maximum contract value specified under a government contract or task order awarded to us is not necessarily indicative of the revenue that we will realize under that contract. For example, we generate revenue from IDIQ contracts, which do not require the government to purchase a pre-determined amount of goods or services under the contract. Action by the government to obtain support from other contractors or failure of the government to order the quantity of work anticipated could cause our actual results to differ materially and adversely from those anticipated. Additionally, many of our multi-year contracts may only be partially-funded at any point during their term with the unfunded portion subject to future appropriations by Congress. As a result of a lack of appropriated funds or efforts to reduce federal government spending, our backlog may not result in revenue. Accordingly, our backlog may not result in actual revenue in any particular period, or at all, which could cause our actual results to differ materially and adversely from those anticipated.\nOur business growth and profitable operations require that we develop and maintain strong relationships with other contractors with whom we partner or otherwise depend on.\nWe may enter into future teaming ventures with other companies, which carry risk in regards to maintaining strong, trusted working relationships in order to successfully fulfill contract obligations. Teaming arrangements may include being engaged as a subcontractor to a prime contractor, engaging a subcontractor on a contract for which we are the prime contractor, or entering into a joint venture with another company. We may lack control over fulfillment of such contracts, and poor performance on the contract could impact our customer relationship, even if we perform as required. We expect to depend on relationships with other contractors for a portion of our revenue in the foreseeable future. Our revenue and operating results could differ materially and adversely from those anticipated if any such prime contractor or teammate chooses to offer directly to the client services of the type that we provide or if they team with other companies to provide those services.\nRestrictions on or other changes to the federal governments use of service contracts may harm our operating results.\nWe derive virtually all of our revenue from service contracts with the federal government. The government may face restrictions from new legislation, regulations or government union pressures, on the nature and amount of services the government may obtain from private contractors (i.e., insourcing versus outsourcing). Any reduction in the governments use of private contractors to provide federal services could cause our actual results to differ materially and adversely from those anticipated.\nOur earnings and margins may vary based on the mix of our contracts and programs.\nAt September 30, 2022, our backlog includes cost reimbursable, time-and-materials, and firm-fixed-price contracts. Our earnings and margins may vary depending on the relative mix of contract types, the costs incurred in their performance, the achievement of other performance objectives and the stage of performance at which the right to receive fees, particularly under incentive and award fee contracts, is finally determined.\nOur employees, or those of our teaming partners, may engage in misconduct or other improper activities which could harm our business.\nWe are exposed to risk from misconduct or fraud by our employees, or employees of our teaming partners. Such violations could include intentional disregard for Federal government procurement regulations, engaging in unauthorized activities, seeking reimbursement for improper expenses, or falsifying time records. Employee misconduct could also involve the improper use of our clients' sensitive or classified information and result in a serious harm to our reputation. While we have appropriate policies in effect to deter illegal activities and promote proper conduct, it is not always possible to deter employee misconduct. Precautions to prevent and detect this activity may not be effective in controlling such risks or losses. As a result of employee misconduct, we could face fines and penalties, loss of security clearance and suspension or debarment from contracting with the federal government, which could materially and adversely affect our business, results of operations, financial condition, cash flows, and liquidity.\nIf we are unable to attract qualified personnel, our business may be negatively affected.\nWe rely heavily on our ability to attract and retain qualified professionals and other personnel who possess the skills, experience, and licenses necessary in order to provide our solutions for our assignments. Our business is materially dependent upon the continued availability of such qualified personnel. Our inability to secure qualified personnel would have a material adverse effect on our business. The cost of attracting qualified personnel and providing them with attractive benefits packages may be higher than we anticipate and, as a result, if we are unable to pass these costs on to our clients, our profitability could decline. Moreover, if we are unable to attract and retain qualified personnel, the quality of our services may decline and, as a result, we could lose clients.\nIf our subcontractors do not perform their contractual obligations, our performance as a prime contractor and our ability to obtain future business could be materially and adversely impacted and our actual results could differ materially and adversely from those anticipated.\nOur performance of government contracts may involve the issuance of subcontracts to other companies upon which we rely to perform all or a portion of the work we are obligated to deliver to our customers. Unsatisfactory performance by one or more of our subcontractors to deliver on a timely basis the agreed-upon supplies, perform the agreed-upon services, or appropriately manage their vendors may materially and adversely impact our ability to perform our obligations as a prime contractor. A subcontractors performance deficiency could result in the government terminating our contract for default. A default termination could expose us to liability for excess costs of reprocurement by the government and have a material adverse effect on our ability to compete for future contracts and task orders. Depending upon the level of problem experienced, such problems with subcontractors could cause our actual results to differ materially and adversely from those anticipated.\nChanges to U.S. tax laws may adversely affect our financial condition or results of operations and create the risk that we may need to adjust our accounting for these changes.\nThe accounting treatment of these tax law changes is complex, and some of the changes may affect both current and future periods. Consistent with guidance from the SEC, our consolidated financial statements reflect our estimates of the tax effects of the current tax laws and regulation.\nThe federal governments appropriation process and other factors may delay the collection of our receivables, and our business may be adversely affected if we cannot collect our receivables in a timely manner.\nWe depend on the collection of our receivables to generate cash flow, provide working capital, pay debt and continue our business operations. If the federal government or any prime contractor for whom we are a subcontractor fails to pay or delays the payment of their outstanding invoices for any reason, our business and financial condition may be materially and adversely affected. The government may fail to pay outstanding invoices for a number of reasons, including lack of appropriated funds or lack of an approved budget. Contracting officers have the authority to impose contractual withholdings, which can also adversely affect our ability to collect timely. If we experience difficulties collecting receivables, it could cause our actual results to differ materially and adversely from those anticipated. In addition, from time to time, when we are awarded a contract, we incur significant expenses before we receive any contract payments. These expenses include leasing and outfitting office space, purchasing office equipment, and hiring personnel. In other situations, contract terms provide for billing upon achievement of specified project milestones. As a result, in these situations, we are required to expend significant sums of money before receiving related contract payments. In addition, payments due to us from government agencies may be delayed due to billing cycles or as a result of failures by the government to approve governmental budgets in a timely manner. In addition to these factors, poor execution on project startups could impact us by increasing our use of cash. In certain circumstances, we may defer recognition of costs incurred at the inception of a contract. Such action assumes that we will be able to recover these costs over the life of the contract. To the extent that a project does not perform as anticipated, these deferred costs may not be considered recoverable resulting in an impairment charge.\nRisks Relating to Our Information Technology Systems and Intellectual Property\nWe are highly dependent on the proper functioning of our information systems.\nWe are highly dependent on the proper functioning of our information systems in operating our business. Critical information systems used in daily operations match employee resources and client assignments and track regulatory credentialing. They also perform payroll, billing and accounts receivable functions. While we have multiple back up plans for these types of contingencies, our information systems are vulnerable to fire, storm, flood, power loss, telecommunication outages, physical break-ins, cyber-attack, ransomware, and similar events. If our information systems become inoperable, or are otherwise unavailable, these functions would have to be accomplished manually, which in turn could impact our financial viability, due to the increased cost associated with performing these functions manually.\nOur systems and networks may be subject to cybersecurity breaches.\nMany of our operations rely heavily upon technology systems and networks to receive, input, maintain and communicate participant and client data pertaining to the programs we manage. Any systems failures, whether caused by us, a third-party service provider, or unauthorized intruders and hackers, or due to situations such as computer viruses, natural disasters, or power shortages, could cause loss of data or interruptions or delays in our business or that of our customers. If our systems or networks were compromised by a security breach, we could be adversely affected by losing confidential or protected information of program participants and clients, and we could suffer reputational damage and a loss of confidence from prospective and existing clients. Similarly, if our internal networks were compromised, we could be adversely affected by the loss of proprietary, trade secret or confidential technical and financial data. The loss, theft or improper disclosure of that information could subject the Company to sanctions under the relevant laws, lawsuits from affected individuals, negative press articles and a loss of confidence from our government clients, all of which could adversely affect our existing business, future opportunities and financial condition. Further, our property and cyber insurance may be inadequate to compensate us for all losses that may occur as a result of any system or operational failure or disruption and, as a result, our actual results could differ materially and adversely from those anticipated. In addition, in order to provide services to our customers, we often depend upon or use customer systems that are supported by the customer or third parties. Any security breach or system failure in such systems could result in an interruption of our customers operations which could cause us to experience significant delays under a contract, and a material adverse effect on our results of operations.\nAdditionally, a number of projects require us to receive, maintain and transmit protected health information or other types of confidential personal information. That information may be regulated by the Health Insurance Portability and Accountability Act (HIPAA), the Health Information Technology for Economic and Clinical Health Act of 2009, Internal Revenue Service regulations and other laws. The loss, theft or improper disclosure of that information could subject us to sanctions under these laws, breach of contract claims, lawsuits from affected individuals, negative press articles and a loss of confidence from our government clients, all of which could adversely affect our existing business, future opportunities and financial condition.\nFailure to adequately protect, maintain, or enforce our rights in our intellectual property may adversely limit our competitive position.\nWe rely upon a combination of nondisclosure agreements and other contractual arrangements, as well as copyright, trademark, and trade secret laws to protect our proprietary information. We also enter into proprietary information and intellectual property agreements with employees, which require them to disclose any inventions created during employment, to convey such rights to inventions to us, and to restrict any disclosure of proprietary information. Trade secrets are generally difficult to protect. Although our employees are subject to confidentiality obligations, this protection may be inadequate to deter or prevent misappropriation of our confidential information and/or the infringement of our trademarks and copyrights. Further, we may be unable to detect unauthorized use of our intellectual property or otherwise take appropriate steps to enforce our rights. Failure to adequately protect, maintain, or enforce our intellectual property rights may adversely limit our competitive position.\nWe may face from time to time, allegations that we or a supplier or customer have violated the intellectual property rights of third parties. If, with respect to any claim against us for violation of third-party intellectual property rights, we are unable to prevail in the litigation or retain or obtain sufficient rights or develop non-infringing intellectual property or otherwise alter our business practices on a timely or cost-efficient basis, our business and competitive position may be adversely affected.\nAny infringement, misappropriation or related claims, whether or not meritorious, are time consuming, divert technical and management personnel, and are costly to resolve. As a result of any such dispute, we may have to develop non-infringing intellectual property, pay damages, enter into royalty or licensing agreements, cease utilizing certain products or services, or take other actions to resolve the claims. These actions, if required, may be costly or unavailable on terms acceptable to us.\nRisks Relating to Acquisitions\nWe may have difficulty identifying and executing acquisitions on favorable terms and therefore may grow at slower than anticipated rates.\nOne of our potential paths to growth is to selectively pursue acquisitions. Through acquisitions, we may be able to expand our base of customers, increase the range of solutions we offer to our customers and deepen our penetration of existing markets and customers. We may not identify and execute suitable acquisitions. To the extent that management is involved in identifying acquisition opportunities or integrating new acquisitions into our business, our management may be diverted from operating our core business. Without acquisitions, we may not grow as rapidly otherwise, which could cause our actual results to differ materially and adversely from those anticipated.\nWe may encounter other risks in regard to making acquisitions, including:\nincreased competition for acquisitions may increase the costs of our acquisitions;\nnon-discovery or non-disclosure of material liabilities during the due diligence process, including omissions by prior owners of any acquired businesses or their employees in complying with applicable laws or regulations, or their inability to fulfill their contractual obligations to the federal government or other customers; and\nacquisition financing may not be available on reasonable terms or at all.\nAny of these risks could cause our actual results to differ materially and adversely from those anticipated.\nWe may have difficulty integrating the operations of companies we acquire, which could cause actual results to differ materially and adversely from those anticipated.\nThe success of a potential future acquisition strategy depends upon our ability to successfully integrate the businesses. We may have difficulty integrating a business that we may acquire in the future. The integration of a business into our operations may result in unforeseen operating difficulties, absorb significant management attention and require significant financial resources that would otherwise be available for the ongoing development of our business. These integration difficulties include the integration of personnel with disparate business backgrounds, the transition to new information systems, coordination of geographically dispersed organizations, loss of key employees of acquired companies, and reconciliation of different corporate cultures. For these or other reasons, we may be unable to retain key customers of acquired companies. Moreover, any acquired business may not generate the revenue or net income we expected or produce the efficiencies or cost-savings we anticipated. Any of these outcomes could cause our actual results to differ materially and adversely from those anticipated.\nWe have a substantial amount of goodwill on our balance sheet. Future write-offs of goodwill may have the effect of decreasing our earnings or increasing our losses.\nWe have obtained growth through acquisitions of other companies and businesses. Under existing accounting standards, we are required to periodically review goodwill for possible impairment. In the event that we are required to write down the value of any assets under these pronouncements, it may materially and adversely affect our earnings. See the more detailed discussion appearing as part of our Management's Discussion and Analysis of Financial Condition and Results of Operations in Item 7 herein.\nRisks Relating to Our Outstanding Indebtedness\nWe have incurred debt in connection with acquisitions and we must make the scheduled principal and interest payments on the facility and maintain compliance with other debt covenants.\nOn September 30, 2020, we entered into an amended and restated credit agreement with First National Bank of Pennsylvania and certain other lenders (the Credit Agreement). The Credit Agreement requires compliance with a number of financial covenants and contains restrictions on our ability to engage in certain transactions, including limitations on: granting liens; incurring other indebtedness; disposing assets; making investments in other entities; and completing other mergers and consolidations. Also, the Credit Agreement requires us to comply with certain financial covenants including a minimum fixed charge coverage ratio and a maximum total leverage ratio. In addition, the Credit Agreement also requires prepayments of a percentage of excess cash flow. Accordingly, a portion of our cash flow from operations was dedicated to the repayment of our indebtedness and we expect future cash flow to be used to reduce our indebtedness. The loan agreement provides for customary events of default, including, among other things, a payment default, covenant default or defaults on other indebtedness or judgments in excess of a stipulated amount, change of control events, suspension or disbarment from contracting with the federal government and the material inaccuracy of our representations and warranties. If we are unable to make the scheduled principal and interest payments on the Credit Agreement or maintain compliance with other debt covenants, we may be in default under the loan agreement, which if not waived, could cause our debt to become immediately due and payable and enable the lenders to enforce their rights under the Credit Agreement. Such an event would likely have a material adverse effect on our business, financial condition and results of operations.\nIn addition, a transition away from the London Interbank Offering Rate (LIBOR) as a benchmark for establishing the applicable interest rate may affect the cost of servicing our debt under the Credit Agreement. The indebtedness outstanding under the Credit Agreement initially incurs interest based on LIBOR. In March 2021, the Financial Conduct Authority of the United Kingdom has announced that LIBOR will no longer be provided for the one-week and two-month U.S. dollar settings after December 31, 2021 and that publication of the U.S. dollar settings for the overnight, one-month, three-month, six-month and 12-month LIBOR rates will cease after June 30, 2023. Although our Credit Agreement provides for an alternative base rate, the consequences of the phase out of LIBOR cannot be entirely predicted at this time. For example, if any alternative base rate or means of calculating interest with respect to our outstanding indebtedness leads to an increase in the interest rates charged, it could result in an increase in the cost of such indebtedness or otherwise have a material adverse impact on our business, financial condition and results of operations.\nRisks Relating to Our Corporate Structure and Capital Stock\nOur stock price may be volatile and your investment in our common stock may suffer a decline in value.\nThe price of our common stock could be subject to fluctuations and may decline in the future due to risks defined herein, or due to factors beyond our control, including changes in market conditions such as increased interest rates, a recession, or a change in Federal spending priorities. Stock markets in general have experienced volatility that has often been unrelated to the operating performance of a particular company. These broad market fluctuations could adversely affect the trading price of our common stock.\nSince we have not paid dividends on our common stock, you cannot expect dividend income from an investment in our common stock.\nWe have not paid any dividends on our common stock since our inception and do not contemplate or anticipate paying any dividends on our common stock in the foreseeable future. Current lenders do and future potential lenders may prohibit us from paying dividends without prior consent. Therefore, holders of our common stock may not receive any dividends on their investment in us. Earnings, if any, may be retained and used to finance the development and expansion of our business.\nWe may issue preferred stock with rights senior to our common stock, which may adversely impact the voting and other rights of the holders of our common stock.\nOur certificate of incorporation authorizes the issuance of \"blank check\" preferred stock with such designations, rights and preferences as may be determined from time to time by our board of directors up to an aggregate of 5,000,000 shares of preferred stock. Accordingly, our board of directors is empowered, without stockholder approval, to issue preferred stock with dividend, liquidation, conversion, voting or other rights, which would adversely affect the voting power or other rights of the holders of our common stock. In the event of issuance, the preferred stock could be utilized, under certain circumstances, as a method of discouraging, delaying or preventing a change in control of our Company, which could have the effect of discouraging bids for our Company and thereby prevent stockholders from receiving the maximum value for their shares. Although we have no present intention to issue any shares of our preferred stock, in order to discourage or delay a change of control of our Company, we may do so in the future. In addition, we may determine to issue preferred stock in connection with capital raising efforts and the terms of the stock so issued could have special voting rights or rights related to the composition of our Board.\nThe exercise or vesting of our outstanding common stock options and restricted stock units may depress our stock price and dilute your ownership of the Company.\nTo the extent that options are exercised or restricted stock units vest, dilution to our shareholders will occur. We cannot foresee the impact of any potential sales of our common shares on the market, but it is possible that if a significant percentage of such available shares were attempted to be sold within a short period of time, the market for our shares would be adversely affected. It is also unclear whether or not the market for our common stock could absorb a large number of attempted sales in a short period of time. Moreover, the terms upon which we will be able to obtain additional equity capital may be adversely affected, since the holders of these securities can be expected to exercise them at a time when we would, in all likelihood, be able to obtain any needed capital on terms more favorable to us than the exercise terms provided by those securities. To the extent that these securities are exercised, dilution to our shareholders will occur. Moreover, the terms upon which we will be able to obtain additional equity capital may be adversely affected, since the holders of these securities can be expected to exercise them at a time when we would, in all likelihood, be able to obtain any needed capital on terms more favorable to us than the exercise terms provided by those securities.\nAnti-takeover provisions in our Articles of Incorporation make a change in control of our Company more difficult.\nThe provisions of our Articles of Incorporation and the New Jersey Business Corporation Act, together or separately, could discourage potential acquisition proposals, delay or prevent a change in control and limit the price that certain investors might be willing to pay in the future for our common stock. Among other things, these provisions:\nrequire certain supermajority votes; and\nestablish certain advance notice procedures for nomination of candidates for election as directors and for shareholders' proposals to be considered at shareholders' meetings.\nIn addition, the New Jersey Business Corporation Act contains provisions that, under certain conditions, prohibit business combinations with 10% shareholders and any New Jersey corporation for a period of five years from the time of acquisition of shares by the 10% shareholder. The New Jersey Business Corporation Act also contains provisions that restrict certain business combinations and other transactions between a New Jersey corporation and 10% shareholders.\nOur executive officers, directors and significant stockholders will be able to influence matters requiring stockholder approval.\nAs of September 30, 2022, our executive officers, directors and largest shareholder (Wynnefield Capital, Inc. and its affiliates) own approximately 45% of our outstanding common stock. Within this amount, Wynnefield Capital, Inc. and its affiliates own approximately 30% of our outstanding common stock. This concentration of ownership may have the effect of delaying, preventing or deterring a change in control of the Company, could deprive our stockholders of an opportunity to receive a premium for their common stock as part of a sale or merger of our company and may negatively affect the market price of our common stock. These matters might include proxy contests, tender offers, mergers or other purchases of common stock that could give our stockholders the opportunity to realize a premium over the then-prevailing market price for shares of our common stock.\nIn addition, persons associated with Wynnefield Capital, Inc. currently serve on our Board of Directors. As a result of this share ownership and relationships on our Board of Directors, our largest stockholder will be able to influence all affairs and actions of our company, including matters requiring stockholder approval such as the election of directors and approval of significant corporate transactions. The interests of our principal stockholders may differ from the interests of the other stockholders.\nGeneral Business Risks\nWe may experience fluctuations in our revenues and operating results from period to period.\nOur revenue and operating results may fluctuate significantly and unpredictably in the future. We have expended, and will continue to expend, substantial resources to enhance our health services offerings and expansion into the Federal health market. We may incur growth expenses before new business revenue is realized, thus showing lower profitability in a particular period or consecutive periods. Other factors which may cause our cash flows and results of operations to vary from quarter to quarter include: the terms and progress of contracts; expenses related to certain contracts which may be incurred in periods prior to revenue being recognized; the commencement, completion or termination of contracts during any particular quarter; the timing and terms of award contracts; and government budgetary delays or shortfalls. We may be unable to achieve desired levels of revenue growth due to circumstances that are beyond our control, as already expressed regarding competition, government budgets, and the procurement process in general. In particular, if the federal government does not adopt, or delays adoption of, a budget for each fiscal year beginning on October 1, or fails to pass a continuing resolution, federal agencies may be forced to suspend our contracts and delay the award of new and follow-on contracts and orders due to a lack of funding. Also, some aspects of this work can be seasonal with regard to resources and funding and it is difficult to predict the timing of when those resources will be expended. Although we continue to manage our operating costs and expenses, there is no guarantee that we will significantly increase future revenue and profit in any particular future period. Revenue levels achieved from our customers, the mix of solutions that we offer and our performance on future contracts will affect our financial results. Further, changes in the volume of activity and the number of contracts commenced, completed or terminated during any quarter may cause significant variations in our cash flows and results of operations. Therefore, period-to-period comparisons of our operating results may not be a good indication of our future performance.\nAn increase in the prices of goods and services could raise the costs associated with providing our services, diminish our ability to compete for new contracts or task orders and/or reduce customer buying power.\nWe may experience an increase in the costs in our supply and labor markets due to global inflationary pressures and other various geopolitical factors. We generate a portion of our revenues through various fixed price and multi-year government contracts which anticipate moderate increases in costs over the term of the contract. With the current pace of inflation our standard approach to moderate annual price escalations in our bids for multi-year work may be insufficient to counter inflationary cost pressures. This could result in reduced profits, or even losses, as inflation increases, particularly for fixed priced contracts and our longer-term multi-year contracts. In the competitive environment in which we operate as a government contractor, the lack of pricing leverage and ability to renegotiate long-term, multi-year contracts, could reduce our profits, disrupt our business, or otherwise materially adversely affect our results of operations.\nOur profits and revenues could suffer if we are involved in legal proceedings, investigations, and disputes.\nWe are exposed to legal proceedings, investigations and disputes. In addition, in the ordinary course of our business we may become involved in legal disputes regarding personal injury or employee disputes. While we provide for these types of incidents through commercial third-party insurance carriers, we often defray these types of cost through higher deductibles. Any unfavorable legal ruling against us could result in substantial monetary damages by losing our deductible portion of carried insurance. We maintain insurance coverage as part of our overall legal and risk management strategy to lower our potential liabilities. If we sustain liabilities that exceed our insurance coverage or for which we are not insured, it could have a material adverse impact on our results of operations, cash flows and financial condition, including our profits, revenues and liquidity.\nWe are dependent upon certain of our management personnel and do not maintain \"key personnel\" life insurance on our executive officers.\nOur success to date has resulted in part from the significant contributions of our executive officers. Our executive officers are expected to continue to make important contributions to our success. As of September 30, 2022, certain of our officers are under employment contracts. However, we do not maintain \"key personnel\" life insurance on any of our executive officers. Loss for any reason of the services of our key personnel could materially affect our operations.\nWe may not be fully covered by the insurance we procure and our business could be adversely impacted if we were not able to renew all of our insurance plans.\nAlthough we carry multiple lines of liability insurance (including coverage for medical malpractice and workers' compensation), they may not be sufficient to cover the total cost of any judgments, settlements or costs relating to any present or future claims, suits or complaints. If we are unable to secure renewal of our insurance contracts or the renewal of such contracts with favorable rates and with competitive benefits, our business could be adversely affected. In addition, sufficient insurance may not be available to us in the future on satisfactory terms or at all. Further, the fact that the majority of our employees are located at customer locations increases our potential liability for negligence and professional malpractice and such liabilities may not become immediately apparent. Any increase in our costs of insurance will impact our profitability to the extent that we cannot offset these increases into our costs of services. If the insurance we carry is not sufficient to cover any judgments, settlements or costs relating to any present or future claims, suits or complaints, our business, financial condition, results of operations and liquidity could be materially adversely affected.\nOur financial condition may be affected by increases in employee healthcare claims and insurance premiums, and workers' compensation claims and insurance rates.\nOur current workers' compensation and medical plans are partially self-funded insurance programs. The Company currently pays base premiums plus actual losses incurred, not to exceed certain individual and aggregate stop-loss limits. In addition, health insurance premiums, and workers' compensation rates for the Company are in large part determined by our claims experience. These categories of expenditure comprise a significant portion of our direct costs. If we experience a large increase in claim activity, our direct expenditures, health insurance premiums, unemployment taxes or workers' compensation rates may increase. Although we employ internal and external risk management procedures in an attempt to manage our claims incidence and estimate claims expenses and structure our benefit contracts to provide as much cost stability as reasonably possible given the self-funded nature of our plans, we may not be able to prevent increases in claim activity, accurately estimate our claims expenses or pass the cost of such increases on to our clients. Since our ability to incorporate such increases into our fees to our clients is constrained by contractual arrangements with our clients, a delay could occur before such increases could be reflected in our fees, which may reduce our profit margin. As a result, such increases could have a material adverse effect on our financial condition, results of operations and liquidity.\nWe may be subject to fines, penalties and other sanctions if we do not comply with laws governing our business.\nOur business lines operate within a variety of complex regulatory schemes, including but not limited to the FAR, Federal Cost Accounting Standards, the Truth in Negotiations Act, as well as the regulations governing accounting standards. If a government audit finds improper or illegal activities by us or we otherwise determine that these activities have occurred, we may be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, suspension of payments, fines and suspension or disqualification from doing business with the government. Any adverse determination could adversely impact our ability to bid in response to RFPs in one or more jurisdictions. Further, as a government contractor subject to the types of regulatory schemes described above, we are subject to an increased risk of investigations, criminal prosecution, civil fraud, whistleblower lawsuits and other legal actions and liabilities to which private sector companies are not, the result of which could have a material adverse effect on our operating results, cash flows and financial condition.\nWe are exposed to increased costs and risks associated with complying with increasing and new regulation of corporate governance and disclosure standards.\nSince the implementation of the Sarbanes-Oxley Act of 2002, we spend a significant amount of management's time and resources (both internal and external) to comply with changing laws, regulations and standards relating to corporate governance and public disclosures. This compliance requires management's annual review and evaluation of our internal control systems. This process has caused us to engage outside advisory services and has resulted in additional accounting and legal expenses. We may encounter problems or delays in completing these reviews and evaluation and the implementation of improvements. If we are not able to timely comply with the requirements set forth in the Sarbanes-Oxley Act of 2002, we might be subject to sanctions or investigation by regulatory authorities. Any such action could materially adversely affect our business and our stock price. ITEM 1B. UNRESOLVED STAFF COMMENTS\nThere are no unresolved staff comments. ITEM 2. PROPERTIES\nWe do not own any real estate or other properties. As of September 30, 2022, we operate five locations in the United States and one location in Kampala, Uganda; occupying a total of approximately 118 thousand square feet. The Company's corporate headquarters is located at 3565 Piedmont Road NE, Building 3 Suite 700, Atlanta, Georgia 30305, and we presently maintain a National Capital Region office in Silver Spring, Maryland. All of our offices are in reasonably modern and well-maintained buildings and we believe that our facilities are adequate for present operations and the foreseeable future. For the fiscal year ended September 30, 2022, our total lease expense was approximately $3.5 million. See Note 5. Leases in Part II of this Annual Report on Form 10-K for additional information. ITEM 3. LEGAL PROCEEDINGS\nAs a commercial enterprise and employer, the Company is subject to various claims and legal actions in the ordinary course of business. These matters can include professional liability, employment-relations issues, workers compensation, tax, payroll and employee-related matters, other commercial disputes arising in the course of its business, and inquiries and investigations by governmental agencies regarding our employment practices or other matters. The Company is not aware of any pending or threatened litigation that it believes is reasonably likely to have a material adverse effect on its results of operations, financial position or cash flows. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nPrincipal Market\nOur common stock is currently traded on The Nasdaq Capital Market under the symbol \"DLHC.\"\nEquity Holders\nAs of September 30, 2022, the number of shareholders of our common stock of record was approximately 74 persons. The number of stockholders of record is not representative of the number of beneficial stockholders due to the fact that many shares are held by depositories, brokers, or nominees. We estimate there are approximately 750 beneficial owners of our common stock.\nDividends\nWe have not declared or paid any cash dividends on its common stock since inception. We do not intend to pay any cash dividends at this time or in the foreseeable future.\nRecent Sales of Unregistered Securities\nNone.\nRepurchase of Equity Securities\nNone.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company presently utilizes one shareholder-approved equity compensation plan under which it makes equity compensation awards available to officers, directors, employees and consultants. The table set forth below discloses outstanding and available awards under our equity compensation plans as of September 30, 2022. All grants of equity securities made to executive officers and directors are presently made under the 2016 Omnibus Equity Incentive Plan (the 2016 Plan). Prior to the adoption of the 2016 Plan, awards of equity securities were made under the 2006 Long Term Incentive Plan.\nEquity Compensation Plan Information\nPlan Category (a)\nNumber of Securities\nto be issued\nupon exercise of\noutstanding options,\nwarrants and rights (b)\nWeighted Average\nexercise price of\noutstanding options,\nwarrants and rights\n(or fair value at\ndate of grant) (c)\nNumber of securities\nremaining available for\nfuture issuances under\nequity compensation\nplans (excluding securities\nreflected in column (a))\nEquity Compensation Plans Approved by Security Holders:\nEmployee stock options 2,391,500 $ 7.05 1,409,367 ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward Looking and Cautionary Statements\nYou should read the following discussion in conjunction with the consolidated financial statements and the notes to those statements included elsewhere in this Annual Report on Form 10-K for the year ended September 30, 2022. This discussion contains certain statements that are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. Certain statements contained in this Managements Discussion and Analysis are forward-looking statements that involve risks and uncertainties. In addition, any statements that refer to expectations, projections or other characterizations of future events or circumstances are forward-looking statements. The forward-looking statements are not historical facts, but rather are based on current expectations, estimates, assumptions and projections about our industry and business. Our actual results could differ materially from the results contemplated by these forward-looking statements.\nBusiness Overview:\nWe are a provider of technology-enabled business process outsourcing and program management solutions, and public health research and analytics; primarily focused to improve and better deploy large-scale federal health and human service initiatives. We derive 99% of our revenue from agencies of the Federal government, providing services to several agencies including the Department of Veterans Affairs, Department of Health and Human Services, Department of Defense, and Department of Homeland Security. The following table summarizes the revenues by customer for the years ended September 30, 2022 and 2021, respectively (in thousands):\n2022 2021\nRevenue Percent of total revenue Revenue Percent of total revenue\nDepartment of Homeland Security $ 126,576 32.0 % $ 2,485 1.0 %\nDepartment of Veterans Affairs 126,106 31.9 % 110,078 44.7 %\nDepartment of Health and Human Services 102,201 25.9 % 91,543 37.2 %\nDepartment of Defense 33,612 8.5 % 30,930 12.6 %\nCustomers with less than 10% share of total revenue 6,678 1.7 % 11,058 4.5 %\nTotal revenue $ 395,173 100.0 % $ 246,094 100.0 %\nSee Item 1A - Risk Factors - A significant portion of our revenue is concentrated in a small number of contracts and we could be seriously harmed if we were unable to continue providing services under, or unsuccessful in our recompete efforts on, these contracts.\" for a discussion of concentration risk within our VA and HHS portfolio of contracts\nThe Company is a full-service provider of technology-enabled health and human services, providing solutions to three market focus areas: Defense and Veteran Health Solutions, Human Solutions and Services, and Public Health and Life Sciences. We deliver domain-specific expertise, industry best-practices and innovations to customers across these markets leveraging seven core competencies: secure data analytics, clinical trials and laboratory services, case management, performance evaluation, system modernization, operational logistics and readiness, and strategic digital communications. The Company manages its operations from its principal executive offices in Atlanta, Georgia, and we have a complementary headquarters office in Silver Spring, Maryland. We employ over 2,400 skilled employees working in more than 30 locations throughout the United States and one location overseas.\nIn recent years we have successfully completed acquisitions to increase future organic growth, diversify our customer base, and to expand into adjacent markets. On June 7, 2019 we acquired Social & Scientific Systems, Inc. (\"S3\") and on September 30, 2020, we acquired Irving Burton Associates, LLC (\"IBA\").\nThe following table summarizes revenues by our markets for the years ended September 30, 2022 and 2021, respectively (in thousands):\n2022 2021\nRevenue Percent of total revenue Revenue Percent of total revenue\nHuman Services and Solutions $ 165,970 42.0 % $ 37,260 15.1 %\nDefense and Veteran Health Solutions 159,719 40.4 % 141,435 57.0 %\nPublic Health and Life Sciences 69,484 17.6 % 67,399 27.9 %\nTotal revenue $ 395,173 100.0 % $ 246,094 100.0 %\nForward Looking Business Trends:\nOur mission is to expand our position as a trusted provider of technology-enabled healthcare and public health services, medical logistics, and readiness enhancement services to active duty personnel, veterans, and civilian populations and communities. Our primary focus within the defense agency markets include military service members' and veterans' requirements for telehealth services, behavioral healthcare, medication therapy management, process management, clinical systems support, and healthcare delivery. Our primary focus within the civilian agency markets includes healthcare and social programs delivery and readiness. These include compliance monitoring on large scale programs, technology-enabled program management, consulting, and digital communications solutions ensuring that education, health, and social standards are being achieved within underserved and at-risk populations. We believe these business development priorities will position the Company to expand within top national priority programs and funded areas.\nCOVID-19 impact\nWe are exposed to and impacted by macroeconomic factors and U.S. government policies. Current general economic conditions continue to be impacted by the COVID-19 pandemic, which resulted in both market size contractions due to economic slowdowns and government restrictions on movement during the height of the pandemic. While the rollout of vaccines has positively correlated to an improvement in macroeconomic indicators, the lifting of various public health constraints, and a reduction of many restrictions on economic activity, there continues to be significant uncertainty as to the effects of the pandemic on the economy, which may impact our results of operations or cash flows in future periods. We have seen continued demand for the services we provide under our current contract portfolio as the services we provide are largely deemed essential. Although we have also been successful in winning new contracts tied to the need to support public health initiatives in response to the pandemic, as the public health situation improves, there may be fewer such opportunities in the future.\nGeneral uncertainty related to the pandemic, the long-term efficacy of vaccines and the spread of new variants, may nonetheless cause reduced demand for certain services we provide, particularly if it results in a recessionary economic environment or the spending priorities of the U.S. government shift in ways adverse to our business focus. Our ability to continue to operate without any significant negative impacts will in part depend on our continued ability to protect our employees. We have endeavored to follow recommended actions of government and health authorities to protect our employees and have been able to broadly maintain our operations. Further, we have partnered with our clients to adopt particular measures to protect our employees at distribution centers, and we have been and expect to continue to execute on the remainder of our contracts through remote and teleworking arrangements. We continue to monitor the evolving situation related to the COVID-19 pandemic and intend to continue to work with government authorities and other stakeholders to assess further potential implications to us, continue with employee safety measures to ensure that we are able to continue our operations during the pandemic, and take other actions where appropriate to mitigate other adverse consequences. However, uncertainty resulting from the pandemic could result in an unforeseen disruption to our operations (for example a closure of a key distribution facility) that may not be fully mitigated. To date we have experienced continuity in the majority of our work for our government clients. While there have been postponements of events and challenges around some project work requiring travel, overall, our government clients have continued to require our services. We are unable to predict whether, and to what extent, this trend will continue. It would be reasonable to expect some restriction of certain client activities due to COVID-19.\nDue to our ability to continue to perform on our contract portfolio and generate cash flow, we do not presently expect nor have experienced liquidity constraints related to COVID-19. We are presently in compliance with all covenants in our secured term loan and have access to a secured revolving line of credit to meet any short-term cash needs that cannot be funded by operations. As such, mandatory demands on our cash flow remain low. Further, we have not observed any material impairments of our assets or a significant change in the fair value of our assets due to the COVID-19 pandemic. For additional information on risk factors that could impact our results, please refer to Risk Factors in Part I, Item 1A of this Form 10-K.\nFederal budget outlook for fiscal year 2023:\nThe Presidents budget proposal for fiscal year (\"FY\") 2023 outlines many initiatives that include investments to rebuild our countrys physical infrastructure, strengthen supply chains, combat inflation, expand economic opportunity, respond to the changing climate, sustain and strengthen national defense, and bolster America's public health infrastructure. Specifically, the investment in public health infrastructure involves improving the nations readiness for future pandemics and other biological threats, expanding access to vaccines and healthcare, and defeating diseases and epidemics such as, but not limited to, the opioid and HIV/AIDs epidemics. The budget's initiatives are further reflected in the budget requests for the Department of Health and Human Services, Department of Veterans Affairs, and Department of Defense.\nWhile Congress has not completed the final appropriation bills for the governments 2023 fiscal year, the Company continues to believe that its key programs benefit from bipartisan support and does not expect a material impact on its current business base from budget negotiations. If the appropriations bills are not timely enacted, government agencies operate under a continuing resolution (\"CR\"), which may negatively impact our business due to delays in new program starts, delays in contract award decisions, and other factors. On September 30, 2022, the President signed a CR providing funds to the federal government through December 16, 2022. When a CR expires, unless appropriations bills have been passed by Congress and signed by the President, or a new CR is passed and signed into law, the government must cease operations, or shutdown, except in certain emergency situations or when the law authorizes continued activity. We continuously review our operations in an attempt to identify programs potentially at risk from CRs so that we can consider appropriate contingency plans.\nOur customer's missions have received broad support from the legislative and executive branches of the federal government. As such, we do not anticipate or expect any significant changes to our operations.\nDepartment of Veterans Affairs\nThe VA is requesting a total of $301.4 billion for FY 2023, an increase of $30.7 billion above the FY 2022 request. It includes $139.1 billion in discretionary funding, an increase of $21.9 billion, and $161.3 billion in mandatory funding, an increase of $8.6 billion from FY 2022 enacted. The VA research program is expected to allocate increased funding to advance the Departments understanding of the impact of traumatic brain injury and toxic exposure(s) on long-term health outcomes, coronavirus related research and impacts, and precision oncology. The 2023 budget request for the VA's research enterprise is $916 million, an increase of $34 million from the 2022 budget, excluding mandatory funding. In addition, the 2023 budget estimates $4.8 billion will be spent on telehealth treatment in 2023, an increase of $622 million from the 2022 current estimate. The VA is continuing to expand this program because of its ability to leverage VA providers and provide better services to veterans.\nDepartment of Health and Human Services\nThe FY 2023 budget request proposes $127.3 billion in discretionary budget authority for HHS and $1.7 trillion in mandatory funding for the department. The budget proposes $63 billion in discretionary and mandatory resources for NIH, an increase of $16 billion above FY 2022 enacted, to address the opioid crisis and ending HIV crises, make new investments in pandemic preparedness and nutrition research, and drive biomedical innovations. The budget also requests $45 million for telehealth, which is $9 million above FY 2022 enacted, to promote health services with telehealth technologies. The budget also provides for investment in programs that improve the health and well-being of young children and their families. This includes $12.2 billion for the Office of Head Start, principally to expand eligibility for participation in the program.\nDepartment of Defense\nThe Military Health System (\"MHS\") is one of the largest health care systems, serving over 9 million beneficiaries. As a part of the DoD, the Defense Health Agency (\"DHA\") manages a global health care network of military and civilian medical professionals, military hospitals and clinics around the world, and supports the delivery of integrated health services to MHS beneficiaries. The funding and personnel to support MHSs mission is referred to as the Unified Medical Budget (\"UMB\"). The FY 2023 UMB request for the Defense Health Program (\"DHP\") is $36.9 billion, a decrease of $0.4 billion from FY 2022 enacted. It is anticipated that COVID-19 costs will decrease in FY 2023, driving a reduction in the budget request for DHP In Direct Care and Private Sector Care.\nIndustry consolidation among federal government contractors:\nThere has been active consolidation and a strong increase in merger and acquisition activity among federal government contractors over the past few years that we expect to continue, fueled by public companies leveraging strong balance sheets. Companies often look to acquisitions that augment core capabilities, contracts, customers, market differentiators, stability, cost synergies, and higher margin and revenue streams.\nPotential impact of federal contractual set-aside laws and regulations:\nThe Federal government has an overall goal of 23% of prime contracts flowing through small businesses. As previously reported, various agencies within the federal government have policies that support small business goals, including the adoption of the Rule of Two by the VA, which provides that the agency shall award contracts by restricting competition for the contract to service-disabled or other veteran owned businesses. To restrict competition pursuant to this rule, the contracting officer must reasonably expect that at least two of these businesses, which are capable of delivering the services, will submit offers and that the award can be made at a fair and reasonable price that offers best value to the United States. When two qualifying small businesses cannot be identified, the VA may proceed to award contracts following a full and open bid process.\nThe Company believes that its past performance in this market and track record of success provide a competitive advantage. However, the effect of set-aside provisions may limit our ability to compete for prime contractor positions on programs that we recompete or that we have targeted for growth. In these cases, the Company may elect to join a team with an eligible contractor as prime for specific pursuits that align with our core markets and corporate growth strategy.\nResults of Operations\nFiscal Year Ended September 30, 2022 as Compared to Fiscal Year Ended September 30, 2021\nThe following table summarizes, for the years indicated, consolidated statements of operations data expressed (in thousands except for per share amounts, and as percentages of revenue):\nYear Ended September 30,\n2022 2021 Change\nRevenue $ 395,173 100.0 % $ 246,094 100.0 % $ 149,079\nCost of operations\nContract costs 322,886 81.7 % 194,614 79.1 % 128,272\nGeneral and administrative costs 30,730 7.8 % 25,054 10.2 % 5,676\nCorporate development costs 614 0.2 % 1,088 0.4 % (474)\nDepreciation and amortization 7,665 1.9 % 8,115 3.3 % (450)\nTotal operating costs 361,895 91.6 % 228,871 93.0 % 133,024\nIncome from operations 33,278 8.4 % 17,223 7.0 % 16,055\nInterest expense 2,215 0.6 % 3,784 1.6 % (1,569)\nIncome before provision for income taxes 31,063 7.8 % 13,439 5.4 % 17,624\nProvision for income taxes 7,775 2.0 % 3,294 1.3 % 4,481\nNet income $ 23,288 5.8 % $ 10,145 4.1 % $ 13,143\nNet income per share - basic $ 1.82 $ 0.81 $ 1.01\nNet income per share - diluted $ 1.64 $ 0.75 $ 0.89\nRevenue\nFor the year ended September 30, 2022 revenue was $395.2 million, an increase of $149.1 million or 60.6% over the prior year period. The increase in revenue is due primarily to the two task orders awarded under a FEMA contract to support Alaska with its response to COVID-19. The revenue contribution from those task orders was $125.8 million. The remainder of our revenue growth of approximately $25 million was from our remaining contract portfolio was primarily due to additional contracts awarded in late fiscal 2021 and increased volume on existing contracts.\nCost of Operations\nContract costs primarily include the costs associated with providing services to our customers. These costs are generally comprised of direct labor and associated fringe benefit costs, subcontract cost, other direct costs, and the related management and infrastructure costs. For the year ended September 30, 2022, contract costs increased by approximately $128.3 million principally due to the direct costs associated with the two task orders awarded under a FEMA contract to support Alaska with its response to COVID-19.\nGeneral and administrative costs are for those employees not directly providing services to our customers, including but not limited to executive management, bid and proposal, accounting, and human resources. These costs increased as compared to the prior fiscal year by $5.7 million to approximately $30.7 million primarily due to increased investment in the human capital and business development functions, increased regulatory compliance costs, primarily increased external accounting fees, and increased stock compensation expense from employees option grants awarded in the current fiscal year..\nCorporate development costs are incremental due diligence costs, such as legal and accounting fees. Fiscal year 2021 costs were due to a transaction that was evaluated but was not executed.\nFor the year ended September 30, 2022, depreciation and amortization costs were approximately $1.1 million and $6.6 million, respectively, as compared to approximately $1.5 million and $6.6 million for the prior fiscal year, an aggregate decrease of $0.5 million.\nInterest Expense\nInterest expense includes items such as, interest expense and amortization of deferred financing costs on debt obligations. For the year ended September 30, 2022, interest expense was $2.2 million compared to interest expense, net of $3.8 million in the prior year, a decrease of approximately $1.6 million over the prior year period. The decrease in interest expense was primarily due to the decreased balance on our secured term loan.\nProvision for Income Taxes\nProvision for Income taxes for the fiscal year ended September 30, 2022 was $7.8 million, an increase of approximately $4.5 million from the prior fiscal year. The effective tax rate was 24.8% and 24.5% for the fiscal years ending September 30, 2022 and 2021 respectively.\nNon-GAAP Financial Measures for Fiscal 2022 and 2021\nThe Company uses EBITDA as a supplemental non-GAAP measures of our performance. The Company defines EBITDA as net income excluding (i) interest expense, (ii) provision for or benefit from income taxes, if any, and (iii) depreciation and amortization.\nOn a non-GAAP basis, Earnings Before Interest Taxes Depreciation and Amortization (EBITDA) for the year ended September 30, 2022 was approximately $40.9 million, an increase of approximately $15.6 million, or 61.6%, over the prior fiscal year. The increase from the prior fiscal year was principally due to the two task orders awarded under a FEMA contract to support Alaska with its response to COVID-19. Those contracts contributed a significant percentage of the growth we experienced for the year-to-date period, reflecting stronger margins than initially anticipated. The increased margins were achieved by effectively staffing the projects with internal resources, rather than subcontractors, where appropriate.\nThe Company is presenting additional non-GAAP measures to describe the impact from two short-term FEMA task orders on its financial performance for the year ended September 30, 2022. The measures presented are revenue, operating income, net income, diluted earnings per share, and EBITDA for our enterprise contract portfolio less the respective performance on the FEMA task orders. These resulting measures present the contract portfolio's financial performance compared to results delivered in the prior year period. Definitions of these additional non-GAAP measures are set forth in the footnotes to the reconciliation table below.\nThese non-GAAP measures of our performance are used by management to conduct and evaluate its business during its regular review of operating results for the periods presented. Management and our Board utilize these non-GAAP measures to make decisions about the use of our resources, analyze performance between periods, develop internal projections and measure\nmanagement's performance. We believe that these non-GAAP measures are useful to investors in evaluating our ongoing operating and financial results and understanding how such results compare with our historical performance. By providing this non-GAAP measure as a supplement to GAAP information, we believe this enhances investors understanding of our business and results of operations.\nGAAP net income to EBITDA, a non-GAAP measure for the years ended September 30, 2022 and 2021 (in thousands):\n2022 2021 Change\nNet income $ 23,288 $ 10,145 $ 13,143\n(i) Interest expense 2,215 3,784 (1,569)\n(ii) Provision for income taxes 7,775 3,294 4,481\n(iii) Depreciation and amortization 7,665 8,115 (450)\nEBITDA $ 40,943 $ 25,338 $ 15,605\nGAAP revenue, operating income, net income, diluted earnings per share, and non-GAAP EBITDA reported for the years ended September 30, 2022 and 2021 to the same metrics for our contract portfolio less the FEMA task orders (in thousands except for per share amounts):\n2022 2021 Change\nRevenue (a)\nTotal enterprise $ 395,173 $ 246,094 $ 149,079\nLess: FEMA task orders to support Alaska 125,773 1,727 124,046\nRemaining contract portfolio $ 269,400 $ 244,367 $ 25,033\nOperating income (b)\nTotal enterprise $ 33,278 $ 17,223 $ 16,055\nLess: FEMA task orders to support Alaska 12,479 117 12,362\nRemaining contract portfolio $ 20,799 $ 17,106 $ 3,693\nNet income (c)\nTotal enterprise $ 23,288 $ 10,145 $ 13,143\nLess: FEMA task orders to support Alaska 9,235 117 9,118\nRemaining contract portfolio $ 14,053 $ 10,028 $ 4,025\nDiluted earnings per share (d)\nTotal enterprise $ 1.64 $ 0.75 $ 0.89\nLess: FEMA task orders to support Alaska 0.65 0.01 0.64\nRemaining contract portfolio $ 0.99 $ 0.74 $ 0.25\nEBITDA (e)\nTotal enterprise $ 40,943 $ 25,338 $ 15,605\nLess: FEMA task orders to support Alaska 12,479 117 12,362\nRemaining contract portfolio $ 28,464 $ 25,221 $ 3,243\n(a): Revenue for the Companys remaining contract portfolio less the FEMA task orders represents our consolidated revenues less the revenues generated from the FEMA task orders.\n(b): Operating income attributable to the remaining contract portfolio less the FEMA task orders represents the Companys consolidated operating income, determined in accordance with GAAP, less the operating income derived from the FEMA task orders. Similarly, for the year ended September 30, 2022 operating income for the FEMA task orders is derived by subtracting from the revenue attributable to the tasks orders of $125.8 million the following amounts associated with such task orders: contract costs $112.1 million and general & administrative costs of $1.2 million.\n(c): Net income attributable to the remaining contract portfolio less the FEMA task orders represents the Companys consolidated net income, determined in accordance with GAAP, less the net income derived from the FEMA task orders. For the year ended September 30, 2022 net income for the FEMA task orders is derived by subtracting from the revenue attributable to the tasks orders of $125.8 million the following amounts associated with such task orders: contract costs of $112.1 million, general & administrative costs of $1.2 million, and provision for income taxes of $3.2 million.\n(d): Diluted earnings per share (diluted EPS) for the FEMA task orders is calculated using the net income attributable to such task orders as opposed to GAAP net income. Diluted EPS for the remaining contract portfolio (total contract portfolio excluding the FEMA task orders) is calculated by subtracting the diluted EPS for the FEMA task orders from the Company's total diluted EPS.\n(e): EBITDA attributable to the FEMA task orders of $12.5 million for the year ended September 30, 2022, is arrived at through the same calculation as operating income as there are not any depreciation and amortization costs attributable to the FEMA task orders. EBITDA for the remaining contract portfolio is calculated by subtracting the EBITDA attributable to the FEMA task orders from the Companys total EBITDA.\nLiquidity and Capital Management\nFor the year ended September 30, 2022, the Company generated operating income of approximately $33.3 million and net income of approximately $23.3 million. Cash flows from operations totaled approximately $1.2 million and $45.7 million for the years ended September 30, 2022 and 2021, respectively. The decrease in cash from operations was principally a result of performance of the deferred contract obligations on the FEMA task orders, for which an advance payment was received at the end of fiscal 2021.\nWe used less than $0.9 million and $0.1 million of cash in investing activities during fiscal years 2022 and 2021, respectively. The cash utilized was predominantly due to capital expenditures in fiscal year 2022 and 2021.\nCash used in financing activities during the fiscal years ended September 30, 2022 and 2021 was approximately $24.2 million and $22.9 million, respectively. The activity in each fiscal year was primarily early repayment of principal on our secured term loan. During the year ended September 30, 2022 and 2021, the Company repaid approximately $24.8 million and $23.3 million of secured term loan principal, respectively. We expect to continue to use operating cash flow to pay outstanding debt.\nA summary of the change in cash is presented below for the years ended September 30, 2022 and 2021 (in thousands):\n2022 2021\nNet cash provided by operating activities $ 1,243 $ 45,665\nNet cash used in investing activities (872) (44)\nNet cash used in by financing activities (24,194) (22,927)\nNet change in cash $ (23,823) $ 22,694\nSources of Cash\nAs of September 30, 2022, our immediate sources of liquidity include cash of approximately $0.2 million, accounts receivable, and access to our secured revolving line of credit. This credit facility provides us with access of up to $25.0 million, subject to certain conditions including eligible accounts receivable. As of September 30, 2022, we had unused borrowing capacity of $23.0 million. The Company's present operating liabilities are largely predictable and consist of vendor and payroll related obligations. We believe that our current investment and financing obligations are adequately covered by cash generated from profitable operations and that planned operating cash flow should be sufficient to support our operations for twelve months from the date of issuance of these consolidated financial statements.\nCredit Facilities\nA summary of our credit facilities as of September 30, 2022 is as follows (in millions):\nLender Arrangement Loan Balance Interest * Maturity Date\nFirst National Bank of Pennsylvania Secured term loan (a) $ 22.0 LIBOR* + 2.5% 09/30/25\nFirst National Bank of Pennsylvania Secured revolving line of credit (b) $ - LIBOR* + 2.5% 09/30/25\n*LIBOR rate as of September 30, 2022 was 2.52%. The interest rate spread ranges from 2.5% to 4.5% depending on the funded indebtedness to adjusted EBITDA ratio.\n(a) Represents the principal amounts payable on our secured term loan, which is secured by liens on substantially all of the assets of the Company. The principal of the secured term loan is payable in quarterly installments with the remaining balance due on September 30, 2025.\nOn September 30, 2019, we executed a floating-to-fixed interest rate swap, with First National Bank (\"FNB\") as counter party. The notional amount in the floating-to-fixed interest rate swap as of September 30, 2022 is $16.2 million and matures in 2024. The remaining outstanding balance of our secured term loan is subject to interest rate fluctuations.\n(b) The secured revolving line of credit has a ceiling of up to $25.0 million and a maturity date of September 30, 2025. The Company accessed funds from the secured revolving line of credit during the year, but has no outstanding balance at September 30, 2022.\nThe secured term loan and secured revolving line of credit are secured by liens on substantially all of the assets of the Company. The provisions of the secured term loan and secured revolving line of credit, including financial covenants, are fully described in Note 7 to the consolidated financial statements.\nContractual Obligations as of September 30, 2022\nPayments Due By Period\nNext 12 2-3 4-5 More than 5\n(Amounts in thousands) Total Months Years Years Years\nDebt obligations $ 22,000 $ - $ 22,000 $ - $ -\nFacility operating leases 23,407 3,216 6,099 5,579 8,513\nEquipment operating lease 135 83 52 - -\nTotal contractual obligations $ 45,542 $ 3,299 $ 28,151 $ 5,579 $ 8,513\nCritical Accounting Policies and Estimates\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include valuation of goodwill and intangible assets, stock-based compensation, and measurement of loss development on workers' compensation claims. In addition, the Company estimates overhead charges and allocates such charges throughout the year. Actual results could differ from those estimates.\nRevenue Recognition\nWe recognize revenue over time when there is a continuous transfer of control to our customer. For our U.S. government contracts, this continuous transfer of control to the customer is supported by clauses in the contract that allow the U.S. government to unilaterally terminate the contract for convenience, pay us for costs incurred plus a reasonable profit and take control of any work in process. When control is transferred over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. For services contracts, we satisfy our performance obligations as services are rendered. We use cost-based input and time-based output methods to measure progress.\nFor time-and-materials contracts, revenue is recognized to the extent of billable rates times hours delivered plus materials and other reimbursable costs incurred. Revenue for cost-reimbursable contracts is recorded as reimbursable costs are incurred, including an estimated share of the applicable contractual fees earned. For firm-fixed-price contracts, the consideration received for our performance is set at a predetermined price. Revenue for our firm-fixed-price contracts is recognized over time using a straight-line measure of progress or using the percentage-of-completion method whereby progress toward completion is based on a comparison of actual costs incurred to total estimated costs to be incurred over the contract term. Contract costs are expensed as incurred. Estimated losses are recognized when identified.\nRefer to Note 4 of the accompanying notes to our consolidated financial statements contained elsewhere in this Annual Report on Form 10-K for discussion relative to the Company's revenue recognition in accordance with ASC-606.\nLong-lived Assets\nOur long-lived assets include equipment and improvements, right-of-use assets, intangible assets, and goodwill. The Company continues to review its long-lived assets for possible impairment or loss of value at least annually or more frequently upon the occurrence of an event or when circumstances indicate that a reporting units carrying amount is greater than its fair value.\nEquipment and improvements are stated at cost. Depreciation and amortization are provided using the straight-line method over the estimated useful asset lives (3 to 7 years) and the shorter of the initial lease term or estimated useful life for leasehold improvements.\nCosts incurred to place the asset in service are capitalized and costs incurred after implementation are expensed. Amortization expense is recorded when the software is placed in service on a straight-line basis over the estimated useful life of the software.\nRight-of-use assets are measured at the present value of future minimum lease payments, including all probable renewals, plus lease payments made to the lessor before or at lease commencement and indirect costs, less incentives received. Our right-of-use assets include long-term leases for facilities and equipment and are amortized over their respective lease terms.\nIntangible assets are originally recorded at fair value and amortized on a straight-line basis over their assessed useful lives. The assessed useful lives of the assets are 10 years.\nGoodwill\nThe Company continues to review its goodwill for possible impairment or loss of value at least annually or more frequently upon the occurrence of an event or when circumstances indicate that a reporting units carrying amount is greater than its fair value. At September 30, 2022, we performed an internal goodwill impairment evaluation. We performed a qualitative assessment of factors to determine whether it was necessary to perform the goodwill impairment test. Based on the results of the work performed, the Company has concluded that no impairment loss was warranted at September 30, 2022, as no change in business conditions occurred which would have a material adverse effect on the valuation of goodwill. Our assessment incorporated effects of the COVID-19 pandemic, which did not have a meaningful impact on our financial results. Notwithstanding this evaluation, factors including non-renewal of a major contract or other substantial changes in business conditions could have a material adverse effect on the valuation of goodwill in future periods and the resulting charge could be material to future periods results of operations.\nProvision for Income Taxes\nThe Company accounts for income taxes in accordance with the liability method, whereby deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities, using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reflected on the consolidated balance sheet when it is determined that it is more likely than not that the asset will be realized. This guidance also requires that deferred tax assets be reduced by a valuation allowance if it is more likely than not that some or all of the deferred tax asset will not be realized. The Company has fully utilized its net operating loss carryforwards.\nStock-based Equity Compensation\nThe Company uses the fair value-based method for stock-based equity compensation. Options issued are designated as either an incentive stock or a non-statutory stock option. No option may be granted with a term of more than 10 years from the date of grant. Option awards may depend on achievement of certain performance measures determined by the Compensation Committee of our Board. Shares issued upon option exercise are newly issued common shares. All awards to employees and non-employees are recorded at fair value on the date of the grant and expensed over the period of vesting. The Company uses a Monte Carlo method to estimate the fair value of each stock option at the date of grant. Any consideration paid by the option holders to purchase shares is credited to capital stock.\nNew Accounting Pronouncements\nA discussion of recently issued accounting pronouncements is described in Note 3 of the accompanying notes to our consolidated financial statements contained elsewhere in this Annual Report, and we incorporate such discussion by reference. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nExcept as described in this Item 7A, the Company has not engaged in trading practices in securities or other financial instruments and therefore does not have any material exposure to interest rate risk, foreign currency exchange rate risk, commodity price risk or other similar risks, which might otherwise result from such practices. The Company has limited foreign operations and therefore is not materially subject to fluctuations in foreign exchange rates, commodity prices or other market rates or prices from market sensitive instruments. On September 30 2019, we executed a floating-to-fixed interest rate swap with FNB as counter party. The notional amount in the floating-to-fixed interest rate swap is $16.2 million at the end of fiscal year 2022. The remaining outstanding balance of our secured term loan is subject to interest rate fluctuations. As interest rates rise due to inflation-related pressures in the economy, we expect to continue to use interest rate swaps to mitigate our cash risk of rising rates. The Company has determined that a 1.0% increase to the LIBOR rate would incrementally impact our interest expense by approximately $0.3 million per year. As of September 30, 2022, the interest rate was 5.02%. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTAL DATA\nConsolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID Number 100)\nConsolidated Statements of Operations for the years ended September 30, 2022 and 2021\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended September 30, 2022 and 2021\nConsolidated Statements of Changes in Shareholders' Equity for the years ended September 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of DLH Holdings Corp.\nOpinion on the Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of DLH Holdings Corp. and Subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, cash flows, and changes in shareholders equity for each of the years in the two-year period ended September 30, 2022, and the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Companys internal control over financial reporting as of September 30, 2022, based on the criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework (2013) issued by the COSO.\nBasis for Opinion\nThe Companys management is responsible for these financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying managements report on internal control over financial reporting. Our responsibility is to express an opinion on the Companys financial statements and an opinion on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that responds to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. An entitys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the entity; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the entity are being made only in accordance with authorizations of management and directors of the entity; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the entitys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue Recognition\nCritical Audit Matter Description\nAs described in Note 4 to the consolidated financial statements, the Company generally recognizes revenue over time as services are provided, as most of its contracts involve a continuous transfer of control to the customer. This continuous transfer of control to the customer is supported by clauses in the contract that allow the customer to unilaterally terminate the contract for convenience, pay the Company for costs incurred plus a reasonable profit and take control of any work in process. When control is transferred over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. For services contracts, the Company satisfies performance obligations as services are rendered. We identified the Companys revenue recognition as a critical audit matter because of subjective auditor judgment on the assessment of completion of the contract performance obligations in the contracts that have a continuous transfer of control. Auditing these assumptions involved a degree of judgment and subjectivity as changes in these assumptions could have an impact on the amount of revenue recognized.\nResponse:\nThe following are the primary procedures we performed to address this critical audit matter. To test the recognition of revenue, our audit procedures included among others, testing the internal controls over the proper accumulation of labor costs by contract as well as the approval of monthly and weekly invoices for accuracy and completeness and reviewing key provisions and deliverables within customer contracts. We evaluated managements application of their revenue recognition policies in the determination of revenue recognition conclusions. We selected a sample of revenue transactions and performed the following procedures: we reviewed the signed contract; we reviewed the recorded timesheet data related to the selected invoices, which corroborated management's assessment towards the completion of the performance obligation; and we reviewed the signed contract related to the selected invoice, noting each task has an agreed upon unit price per contract and the unit price matched what was shown on the invoice. We also tested for proper revenue recognition cut off.\nWorkers' Compensation Claims Liabilities\nCritical Audit Matter Description\nThe Company uses a combination of insured and self-insurance programs to cover workers compensation claims. Workers compensation claims liabilities represent managements estimate of future amounts necessary to pay claims and related expenses with respect to workplace injuries that have occurred as of a given reporting date. The estimated liability of workers compensation claims is based on an evaluation of information provided by the Companys third-party administrators for workers compensation claims, coupled with an actuarial estimate of future adverse loss development with respect to reported claims and incurred but not reported claims (together, IBNR). The process of arriving at an estimate of unpaid claims and claims adjustment expense involves a high degree of judgment and is affected by both internal and external events, including the Company's claims experience. The Companys estimates are based on informed judgment, derived from individual experience and expertise applied to multiple sets of data and analyses. Given the high degree of judgment required to estimate the value of the workers compensation claims liabilities, performing audit procedures to evaluate the workers compensation claims liabilities recorded as of September 30, 2022 required an increased extent of effort. As a result, we identified the Companys workers compensation claims liabilities as a critical audit matter because of certain significant assumptions management makes when estimating future incurred but not reported claims using both internal and external events to drive the accruals. Auditing these assumptions involved a high degree of judgement and subjectivity as changes in these assumptions could have a significant impact on the accruals recorded to estimate unpaid claims and the related expenses.\nResponse:\nThe following are the primary procedures we performed to address this critical audit matter. We assessed whether there were any changes to the Companys estimation process during the current year. We assessed whether any changes in the business or environment, including any changes to claims handling practices, were appropriately considered in the reserve setting process as well. We tested the underlying data that served as inputs into the Companys analysis, including historical claims from third party and claims paid, to evaluate whether inputs and assumptions were reasonable. We compared managements prior-year assumptions of expected claims development and ultimate loss to actuals incurred during the current year to identify and evaluate potential management bias in the determination of the workers compensation claims liabilities. We compared the estimated ultimate loss per each insurance year to prior years estimated ultimate loss by year to reassess the Companys estimation process. We tested the mathematical accuracy of the accrual as of September 30, 2022. We reviewed supporting vendor documentation related to the current years base premiums. We also analyzed the qualifications of the Companys third-party administrators for their expertise in this area.\n/s/ WithumSmith+Brown, PC\nWe have served as the Company's auditor since 2007.\nEast Brunswick, New Jersey\nDecember 5, 2022\nPCAOB ID Number 100\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands except per share amounts)\nYear Ended\nSeptember 30,\n2022 2021\nRevenue $ 395,173 $ 246,094\nCost of Operations\nContract costs 322,886 194,614\nGeneral and administrative costs 30,730 25,054\nCorporate development costs 614 1,088\nDepreciation and amortization 7,665 8,115\nTotal operating costs 361,895 228,871\nIncome from operations 33,278 17,223\nInterest expense 2,215 3,784\nIncome before provision for income taxes 31,063 13,439\nProvision for income taxes 7,775 3,294\nNet income $ 23,288 $ 10,145\nNet income per share - basic $ 1.82 $ 0.81\nNet income per share - diluted $ 1.64 $ 0.75\nWeighted average common shares outstanding\nBasic 12,830 12,549\nDiluted 14,179 13,597\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(Amounts in thousands except par value of shares)\nSeptember 30,\n2022 September 30,\nASSETS\nCurrent assets:\nCash $ 228 $ 24,051\nAccounts receivable 40,496 33,447\nOther current assets 2,878 4,265\nTotal current assets 43,602 61,763\nEquipment and improvements, net 1,704 1,912\nOperating lease right-of-use-assets 16,851 19,919\nGoodwill 65,643 65,643\nIntangible assets, net 40,884 47,469\nOther long-term assets 328 464\nTotal assets $ 169,012 $ 197,170\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nOperating lease liabilities - current $ 2,235 $ 2,261\nAccrued payroll 9,444 9,125\nDeferred revenue - 22,273\nAccounts payable and accrued liabilities 26,862 32,717\nTotal current liabilities 38,541 66,376\nLong-term liabilities:\nDeferred taxes, net 1,534 1,176\nOperating lease liabilities - long-term 16,461 19,374\nDebt obligations - long-term, net of deferred financing costs 20,416 44,636\nTotal long-term liabilities 38,411 65,186\nTotal liabilities 76,952 131,562\nShareholders' equity:\nCommon stock, $0.001 par value; authorized 40,000 shares; issued and outstanding 13,047 and 12,714 at September 30, 2022 and 2021, respectively\n13 13\nAdditional paid-in capital 91,057 87,893\nRetained earnings (accumulated deficit) 990 (22,298)\nTotal shareholders equity 92,060 65,608\nTotal liabilities and shareholders' equity $ 169,012 $ 197,170\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Amounts in thousands)\nYear Ended\nSeptember 30,\n2022 2021\nOperating activities\nNet income $ 23,288 $ 10,145\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 7,665 8,115\nAmortization of deferred financing costs charged to interest expense 664 792\nStock-based compensation expense 2,608 1,660\nDeferred taxes, net 358 1,213\nChanges in operating assets and liabilities\nAccounts receivable (7,049) (906)\nOther current assets 1,387 (766)\nAccrued payroll 319 (1,486)\nDeferred revenue (22,273) 22,273\nAccounts payable and accrued liabilities (5,855) 4,139\nOther long-term assets and liabilities 131 486\nNet cash provided by operating activities 1,243 45,665\nInvesting activities\nBusiness acquisition adjustment - 59\nPurchase of equipment and improvements (872) (103)\nNet cash used in investing activities (872) (44)\nFinancing activities\nProceeds from debt obligations 17,000 30,950\nRepayments of debt obligations (41,750) (54,200)\nPayments of deferred financing costs - (43)\nProceeds from issuance of common stock upon exercise of options and warrants 837 366\nPayment of tax obligations resulting from net exercise of stock options (281) -\nNet cash used in financing activities (24,194) (22,927)\nNet change in cash (23,823) 22,694\nCash - beginning of year 24,051 1,357\nCash - end of year $ 228 $ 24,051\nSupplemental disclosures of cash flow information\nCash paid during the year for interest $ 1,528 $ 2,941\nCash paid during the year for income taxes $ 9,282 $ 936\nSupplemental disclosures of non-cash activity\nCommon stock surrendered for the exercise of stock options $ 256 $ -\nCancellation of common stock $ - $ 68\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS' EQUITY\nFor the years ended September 30, 2022 and 2021\n(Amounts in thousands)\nCommon Stock Additional\nPaid-In\nCapital Retained Earnings (Accumulated\nDeficit) Total Shareholders' Equity\nShares Amount\nYear Ended September 30, 2022\nBalance at September 30, 2021\n12,714 $ 13 $ 87,893 $ (22,298) $ 65,608\nExpense related to director restricted stock units - - 648 - 648\nExpense related to employee stock options - - 1,960 - 1,960\nStock issued for director restricted stock units 53 - - - -\nExercise of stock options 257 - 637 - 637\nCommon stock surrendered for the exercise of stock options (31) - (281) - (281)\nExercise of stock warrants 54 - 200 - 200\nNet income - - - 23,288 23,288\nBalance at September 30, 2022\n13,047 $ 13 $ 91,057 $ 990 $ 92,060\nCommon Stock Additional\nPaid-In\nCapital Accumulated\nDeficit Total Shareholders' Equity\nShares Amount\nYear Ended September 30, 2021\nBalance at September 30, 2020\n12,404 $ 12 $ 85,868 $ (32,443) $ 53,437\nExpense related to director restricted stock units 141 - 467 - 467\nExpense related to employee stock options - - 1,193 - 1,193\nExercise of stock options 175 1 433 - 434\nCancellation of common stock (6) - (68) - (68)\nNet income - - - 10,145 10,145\nBalance at September 30, 2021\n12,714 $ 13 $ 87,893 $ (22,298) $ 65,608\nThe accompanying notes are an integral part of these consolidated financial statements\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSeptember 30, 2022\n1. Basis of Presentation and Principles of Consolidation\nThe accompanying consolidated financial statements include the accounts of DLH Holdings Corp. and its subsidiaries (together with its subsidiaries, \"DLH\" or the \"Company\" and also referred to as \"we,\" \"us,\" and \"our\"), all of which are wholly-owned. All significant intercompany balances and transactions have been eliminated in consolidation. The accompanying financial statements have been prepared in accordance with U.S. generally accepted accounting principles (\"GAAP\") and with the instructions to Form 10-K, Regulation S-X, and Regulation S-K. Certain amounts reported in our prior year consolidated financial statements have been reclassified to conform to current year presentation.\n2. Significant Accounting Policies\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles in the United States (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting periods. The most significant of these estimates and assumptions relate to estimating revenues and costs including overhead and its allocation, estimating progress toward the completion of performance obligations, assessing fair value of acquired assets and liabilities accounted for through business acquisitions, valuing and determining the amortization periods for long-lived intangible assets, interest rate swaps, stock-based compensation, right-of-use assets and leases liabilities, and loss development on workers' compensation claims. We evaluate these estimates and judgments on an ongoing basis and base our estimates on historical experience, current and expected future outcomes, third-party evaluations, and various other assumptions that we believe are reasonable under the circumstances. The results of these estimates form the basis for making judgments about the carrying values of assets and liabilities as well as identifying and assessing the accounting treatment with respect to commitments and contingencies. We revise material accounting estimates if changes occur, such as more experience is acquired, additional information is obtained, or there is new information on which an estimate was or can be based. Actual results could differ from those estimates.\nRevenue\nThe Company's revenues from contracts with customers are derived from offerings that include technology-enabled business process outsourcing, program management solutions, and public health research and analytics, substantially within the U.S. government and its agencies, and to a lesser extent, subcontractors. The Company has various types of contracts of which include time-and-materials contracts, cost-reimbursable contracts, and firm-fixed-price contracts.\nWe consider a contract with a customer to exist when there is a commitment by both parties (customer and Company), payment terms are determinable, there is commercial substance, and collectability is probably in accordance with Accounting Standards Codification (\"ASC\") No. 606, Revenue from Contracts with Customers (\"Topic 606\").\nWe recognize revenue over time when there is a continuous transfer of control to our customer as performance obligations are satisfied. For our U.S. government contracts, this continuous transfer of control to the customer is transferred over time and revenue is recognized based on the extent of progress toward completion of the performance obligation. We consider control to transfer when we have a right to payment. In some instances, the Company commences providing services prior to formal approval to begin work from the customer. The Company considers these factors, the risks associated with commencing work, and legal enforceability in determining whether a contract exists under Topic 606.\nContract modification can occur throughout the life of the contract and can affect the transaction price, extend the period of performance, adjust funding, or create new performance obligations. We review each modification to assess the impact of these contract changes to determine if it should be treated as part of the original performance obligation or as a separate contract. Contract modifications impact performance obligations when the modification either creates new or changes the existing enforceable rights and obligations. The effect of a contract modification on the transaction price and our measure of progress for the performance obligation to which it relates is recognized as an adjustment to revenue and profit cumulatively. Furthermore, a significant change in one or more estimates could affect the profitability of our contracts. We recognize adjustments in estimated profit on contracts in the period identified.\nFor service contracts, we satisfy our performance obligations as services are rendered. We use cost-based input and time-based output methods to measure progress based on the contract type.\nTime and material - We bill the customer per labor hour and per material, and revenue is recognized in the amount invoiced as the amount corresponds directly to the value of our performance to date. Revenue is recognized to the extent of billable rates times hours delivered plus materials and other reimbursable costs incurred.\nCost reimbursable - We record reimbursable costs as incurred, including an estimated share of the contractual fee earned.\nFirm fixed price - We recognize revenue over time using a straight-line measure of progress or percentage of completion method whereby progress toward completion is based on a comparison of actual costs incurred to total estimated costs to be incurred over the contract terms.\nContract costs generally include direct costs such as labor, materials, subcontract costs, and indirect costs identifiable with or allocable to a specific contract. Costs are expensed as incurred and include an estimate of the contractual fees earned. Contract costs incurred for U.S. government contracts, including indirect costs, are subject to audit and adjustment by various government audit agencies. Historically, our adjustments have not been material.\nContract assets - Amounts are invoiced as work progresses in accordance with agreed-upon contractual terms. In part, revenue recognition occurs before we have the right to bill, resulting in contract assets. These contract assets are reported within Accounts receivable, net on our consolidated balance sheets and are invoiced in accordance with payment terms defined in each contract. Period end balances will vary from period to period due to agreed-upon contractual terms.\nContract liabilities - Amounts are a result of billings in excess of costs incurred or prepayment for services to be rendered. Contract liabilities are primarily due to contract start-up funding provided under a contract awarded at the end of the fiscal year 2021, for which all performance obligations were completed by March 31, 2022.\nFair Value of Financial Instruments\nThe carrying amounts of the Company's cash and cash equivalents, accounts receivable, contract assets, accrued expenses, and accounts payable approximate fair value due to the short-term nature of these instruments. The fair values of the Company's debt instruments approximate fair value because the underlying interest rates approximate market rates that the Company could obtain for similar instruments at the balance sheet dates.\nLong-lived Assets\nOur long-lived assets include equipment and improvements, intangible assets, right-of-use assets, and goodwill. The Company continues to review its long-lived assets for possible impairment or loss of value at least annually or more frequently upon the occurrence of an event or when circumstances indicate that a reporting units carrying amount is greater than its fair value.\nEquipment and improvements are stated at cost. Depreciation and amortization are provided using the straight-line method over the estimated useful asset lives (3 to 7 years) and the shorter of the initial lease term or estimated useful life for leasehold improvements. Intangible assets (other than goodwill) are originally recorded at fair value and are amortized on a straight-line basis over their estimated useful lives of 10 years. Maintenance and repair costs are expensed as incurred.\nRight-of-use assets are measured at the present value of future minimum lease payments, including all probable renewals, plus lease payments made to the lessor before or at lease commencement and indirect costs paid, less incentives received. Our right-of-use assets include long-term leases for facilities and equipment and are amortized over their respective lease terms. Our right-of-use-assets are recognized as the present value of the future minimum lease payments over the lease term less unamortized lease incentives and the balance remaining in deferred rent liability under ASC 840.\nLease Liabilities\nWe have leases for facilities and office equipment. Our lease liabilities are recognized as the present value of the future minimum lease payments over the lease term. Our lease payments consist of fixed and in-substance fixed amounts attributable to the use of the underlying asset over the lease term. Variable lease payments that do not depend on an index rate or are not in-substance fixed payments are excluded in the measurement of right-of-use assets and lease liabilities and are expensed in the period incurred. The incremental borrowing rate on our secured term loan is used in determining the present value of future minimum lease payments. Some of our lease agreements include options to extend the lease term or terminate the lease. These options are accounted for in our right-of-use assets and lease liabilities when it is reasonably certain that the Company will extend the lease term or terminate the lease. The Company does not have any finance leases. As of September 30, 2022, operating leases for facilities and equipment have remaining lease terms of 0.2 to 8.5 years.\nGoodwill\nAt September 30, 2022, we performed an internal goodwill impairment evaluation on the year-end carrying value of approximately $65.6 million. We performed a qualitative assessment of factors to determine whether it was necessary to perform the goodwill impairment test. Based on the results of the work performed, the Company has concluded that no impairment loss was warranted at September 30, 2022, as no change in business conditions occurred which would have a material adverse effect on the valuation of goodwill. Our assessment incorporated effects of the COVID-19 pandemic, which is not expected to have a meaningful impact on our financial results. Notwithstanding this evaluation, factors including non-renewal of a major contract or other substantial changes in business conditions could have a material adverse effect on the valuation of goodwill in future periods and the resulting charge could be material to future periods results of operations. Similarly, there were no impairments during the prior year ended September 30, 2021.\nProvision for Income Taxes\nThe Company accounts for income taxes in accordance with the asset and liability method, whereby deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities, using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reflected on the consolidated balance sheet when it is determined that it is more likely than not that the asset will be realized. This guidance also requires that deferred tax assets be reduced by a valuation allowance if it is more likely than not that some or all of the deferred tax asset will not be realized. We account for uncertain tax positions by recognizing the financial statement effects of a tax position only when, based upon the technical merits, it is more-likely-than-not that the position will be sustained upon examination. We had no uncertain tax positions at either September 30, 2022 and 2021. We report interest and penalties as a component of provision for income taxes. For the years ended September 30, 2022 and 2021, we recognized no interest and no penalties related to income taxes.\nStock-based Equity Compensation\nThe Company uses the fair value-based method for stock-based equity compensation. Options issued are designated as either an incentive stock or a non-statutory stock option. No option may be granted with a term of more than 10 years from the date of grant. Option awards may depend on achievement of certain performance measures determined by the Compensation Committee of our Board. Shares issued upon option exercise are newly issued common shares. All awards to employees and non-employees are recorded at fair value on the date of the grant and expensed over the period of vesting. The Company uses a Monte Carlo method to estimate the fair value of each stock option at the date of grant. Any consideration paid by the option holders to purchase shares is credited to capital stock.\nCompensation Expense\nCompensation expense for the portion of equity awards for which the requisite service has not been rendered is recognized as the requisite service is rendered. The compensation expense for that portion of awards has been based on the grant-date fair value of those awards as calculated for recognition purposes under applicable guidance. For options that vest based on the Companys common stock achieving and maintaining defined market prices, the Company values the awards with a Monte Carlo method that utilizes various probability factors and other criterion in establishing fair value of the grant. The related compensation expense is recognized over the service period.\nCash and Cash Equivalents\nWe consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. We maintain cash balances at financial institutions that are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250,000. Deposits held with financial institutions may exceed the $250,000 limit.\nReceivables\nReceivables include amounts billed and currently due from customers where the right to consideration is unconditional and amounts unbilled. Both billed and unbilled amounts are non-interest bearing, unsecured, and recognized at an estimated realizable value that include costs and fees, and are generally expected to be billed and received within a single year. We evaluate our receivables on a quarterly basis and determine whether an allowance is appropriate based on specific collection issues. No allowance for doubtful accounts was deemed necessary at either September 30, 2022 or September 30, 2021.\nEarnings per Share\nBasic earnings per share is calculated by dividing income available to common shareholders by the weighted average number of common stock outstanding and restricted stock grants that vested or are likely to vest during the period. Diluted earnings per share is calculated by dividing income available to common shareholders by the weighted average number of basic common shares outstanding, adjusted to reflect potentially dilutive securities. Diluted earnings per share is calculated using the treasury stock method.\nTreasury Stock\nThe Company periodically purchases its own common stock that is traded on public markets as part of announced stock repurchase programs. The repurchased common stock is classified as treasury stock on the consolidated balance sheets and held at cost. As of September 30, 2022 and 2021, the Company did not hold any treasury stock.\nPreferred Stock\nOur certificate of incorporation authorizes the issuance of \"blank check\" preferred stock with such designations, rights and preferences as may be determined from time to time by our board of directors up to an aggregate of 5,000,000 shares of preferred stock. As of September 30, 2022 and 2021, the Company has not issued any preferred stock.\nInterest Rate Swap\nThe Company uses derivative financial instruments to manage interest rate risk associated with its variable debt. The Company's objective in using these interest rate derivatives is to manage its exposure to interest rate movements and reduce volatility of interest expense. The gains and losses due to changes in the fair value of the interest rate swap agreements completely offset changes in the fair value of the hedged portion of the underlying debt. Offsetting changes in fair value of both the interest rate swaps and the hedged portion of the underlying debt are recognized in interest expense in the consolidated statements of operations. The Company does not hold or issue any derivative instrument for trading or speculative purposes.\nRisks & Uncertainties\nManagement continues to evaluate the impact of the COVID-19 pandemic on the industry and has concluded\nthat while it is reasonably possible that the virus could have a negative effect on the Companys consolidated financial position and the results of its operations, the specific impact is not readily determinable as of the date of these consolidated financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\n3. New Accounting Pronouncements\nIn March 2020 and January 2021, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2020-04, \"Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting and ASU No. 2021-01, Reference Rate Reform (Topic 848): Scope, respectively (collectively, Topic 848). Topic 848 provides optional expedients and exceptions for applying GAAP to contracts, hedging relationships and other transactions that reference the London Interbank Offered Rate (LIBOR) or another reference rate expected to be discontinued because of reference rate reform. The optional expedients and exceptions provided by Topic 848 can be applied for all entities\nas of March 12, 2020 through December 31, 2022. The Company is currently assessing the impact of electing this standard on its consolidated financial statements and related disclosures and does not expect the impact to be material.\n4. Revenue Recognition\nThe following table summarizes the contract balances recognized within the Company's consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nContract assets $ 7,682 $ 7,307\nContract liabilities $ - $ 22,473\nDisaggregation of revenue from contracts with customers\nWe disaggregate our revenue from contracts with customers by customer, contract type, as well as whether the Company acts as prime contractor or subcontractor. We believe these categories best depict how the nature, amount, timing and uncertainty of our revenue and cash flows are affected by economic factors. The following series of tables presents our revenue disaggregated by these categories:\nRevenue by customer for the years ended September 30, 2022 and 2021 (in thousands):\n2022 2021\nDepartment of Homeland Security $ 126,576 $ 2,485\nDepartment of Veterans Affairs 126,106 110,078\nDepartment of Health and Human Services 102,201 91,543\nDepartment of Defense 33,612 30,930\nOther 6,678 11,058\nTotal Revenue $ 395,173 $ 246,094\nRevenue by contract type for the years ended September 30, 2022 and 2021 (in thousands):\n2022 2021\nTime and Materials $ 308,944 $ 185,656\nCost Reimbursable 46,231 48,101\nFirm Fixed Price 39,998 12,337\nTotal Revenue $ 395,173 $ 246,094\nRevenue by whether the Company acts as a prime contractor or a subcontractor for the years ended September 30, 2022 and 2021(in thousands):\n2022 2021\nPrime Contractor $ 366,571 $ 215,241\nSubcontractor 28,602 30,853\nTotal Revenue $ 395,173 $ 246,094\n5. Leases\nThe following table summarizes lease balances presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nOperating lease right-of-use assets $ 16,851 $ 19,919\nOperating lease liabilities, current $ 2,235 $ 2,261\nOperating lease liabilities, long-term 16,461 19,374\nTotal operating lease liabilities $ 18,696 $ 21,635\nFor the years ended September 30, 2022 and 2021, total lease costs for our operating leases are as follows (in thousands):\n2022 2021\nOperating $ 3,548 $ 3,653\nShort-term 114 103\nVariable 120 81\nSublease income (a) (258) (302)\nTotal lease costs $ 3,524 $ 3,535\n(a): The Company subleases a portion of one of its leased facilities. The sublease is classified as an operating lease with respect to the underlying asset. The sublease term is 5 years and includes two additional 1 year term extension options.\nThe Company's future minimum lease payments as of September 30, 2022 are as follows:\nFor the Fiscal Year Ending September 30, (in thousands)\n2023 $ 3,299\n2024 3,156\n2025 2,995\n2026 3,092\n2027 2,487\nThereafter 8,513\nTotal future minimum lease payments 23,542\nLess: imputed interest (4,846)\nPresent value of future minimum lease payments 18,696\nLess: current portion of operating lease liabilities (2,235)\nLong-term operating lease liabilities $ 16,461\nAt September 30, 2022, the weighted-average remaining lease term and weighted-average discount rate are 7.5 years and 6.0%, respectively. The calculation of the weighted-average discount rate was determined based on borrowing terms from our secured term loan.\nOther information related to our leases is as follows for the years ending September 30, 2022 and 2021 (in thousands):\n2022 2021\nCash paid for amounts included in the measurement of lease liabilities $ 3,411 $ 3,306\n6. Supporting Financial Information\nAccounts receivable\nThe following table summarizes Accounts receivable presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nBilled receivables $ 32,814 $ 26,140\nContract assets 7,682 7,307\nAllowance for doubtful accounts - -\nAccounts receivable $ 40,496 $ 33,447\nOther current assets\nThe following table summarizes Other current assets presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nPrepaid insurance and benefits $ 737 $ 655\nOther receivables 945 995\nPrepaid expenses 1,196 2,615\nOther current assets $ 2,878 $ 4,265\nEquipment and improvements, net\nThe following table summarizes Equipment and improvements, net presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nFurniture and equipment $ 893 $ 958\nComputer equipment 2,316 1,262\nComputer software 4,407 4,353\nLeasehold improvements 1,614 1,595\nTotal equipment and improvements 9,230 8,168\nLess: accumulated depreciation and amortization (7,526) (6,256)\nEquipment and improvements, net $ 1,704 $ 1,912\nDepreciation and amortization was $1.1 million and $1.5 million for the years ended September 30, 2022 and 2021, respectively.\nIntangible assets, net\nThe following table summarizes Intangible assets, net presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nIntangible assets\nCustomer contracts and related customer relationships $ 62,281 $ 62,281\nCovenants-not-to-compete 522 522\nTrade names 3,051 3,051\nTotal intangible assets 65,854 65,854\nLess accumulated amortization\nCustomer contracts and related customer relationships (23,606) (17,378)\nCovenants-not-to-compete (316) (264)\nTrade names (1,048) (743)\nTotal accumulated amortization (24,970) (18,385)\nIntangible assets, net $ 40,884 $ 47,469\nTotal amount of amortization expense for each of the years ended September 30, 2022 and 2021 was $6.6 million.\nAs of September 30, 2022, the estimated annual amortization expense is as follows:\nFor the Fiscal Year Ending September 30, (in thousands)\n2023 $ 6,585\n2024 6,585\n2025 6,585\n2026 5,851\n2027 4,823\nThereafter 10,455\nTotal amortization expense $ 40,884\nAccounts payable and accrued liabilities\nThe following table summarizes Accounts payable and accrued liabilities presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nAccounts payable $ 11,886 $ 16,684\nAccrued benefits 3,857 2,916\nAccrued bonus and incentive compensation 3,625 2,381\nAccrued workers' compensation insurance 4,880 7,014\nOther accrued expenses 2,614 3,722\nAccounts payable and accrued liabilities $ 26,862 $ 32,717\nDebt obligations\nThe following table summarizes Debt obligations presented on our consolidated balance sheets at September 30, 2022 and 2021 (in thousands):\n2022 2021\nSecured term loan $ 22,000 $ 46,750\nLess: unamortized deferred financing costs (1,584) (2,114)\nLong-term portion of debt obligations, net of deferred financing costs $ 20,416 $ 44,636\nAs of September 30, 2022 and 2021, we had no outstanding balance on our secured revolving line of credit and have satisfied mandatory principal payments on our secured term loan for the next twelve months.\nInterest expense\nThe following table summarizes Interest expense presented on our consolidated statements of operations for the years ending September 30, 2022 and 2021 (in thousands):\n2022 2021\nInterest expense (a) $ 1,551 $ 2,992\nAmortization of deferred financing costs (b) 664 792\nInterest expense $ 2,215 $ 3,784\n(a): Interest expense on borrowing\n(b): Amortization of expenses related to secured term loan and secured revolving line of credit.\n7. Credit Facilities\nA summary of our credit facilities as of September 30, 2022 and 2021 is as follows (in millions):\n2022 2021\nArrangement Loan Balance Interest Loan Balance Interest\nSecured term loan (a) due September 30, 2025 $ 22.0 LIBOR* + 2.5%\n$ 46.8 LIBOR* + 3.5%\nSecured revolving line of credit (b) due September 30, 2025 $ - LIBOR* + 2.5%\n$ - LIBOR* + 3.5%\n*LIBOR rate as of September 30, 2022 and 2021 was 2.52% and 0.08%, respectively. As of September 30, 2022 and 2021, our LIBOR rate is subject to a minimum floor of 0.5%.\n(a) Represents the principal amounts payable on our secured term loan, which is secured by liens on substantially all of the assets of the Company. The principal of the secured term loan is payable in quarterly installments with the remaining balance due on September 30, 2025.\nThe Credit Agreement requires compliance with a number of financial covenants and contains restrictions on our ability to engage in certain transactions. Among other matters, we must comply with limitations on: granting liens; incurring other indebtedness; maintenance of assets; investments in other entities and extensions of credit; mergers and consolidations; and changes in nature of business. The loan agreement also requires us to comply with certain quarterly financial covenants including: (i) a minimum fixed charge coverage ratio of at least 1.25 to 1.00, and (ii) a Funded Indebtedness to Adjusted EBITDA ratio not exceeding the ratio of 3.75:1.0 to 2.75:1.0 through maturity. Adjusted EBITDA ratio is calculated by dividing the Company's total interest-bearing debt by net income adjusted to exclude (i) interest and other expenses, (ii) provision for or benefit from income taxes, if any, (iii) depreciation and amortization, and (iv) non-recurring charges, losses or expenses to include transaction and non-cash equity expense. The secured term loan has an interest rate spread range from 2.5% to 4.5% depending on the funded indebtedness to adjusted EBITDA ratio. We are in compliance with all loan covenants and restrictions.\nWe are required to pay quarterly amortization payments commencing in December 2020 through September 2025. The annual amortization amounts are $7.0 million each for fiscal years 2021 and 2022 and $8.75 million each for fiscal years 2023 through 2025, with the remaining unpaid loan balance due at maturity in September 2025. The quarterly payments are in equal installments. As of September 30, 2022, the Company made voluntary prepayments of $34.0 million, bringing the total amount paid on the secured term loan to $48.0 million. As of September 30, 2022, we have satisfied mandatory principal amortization until September 30, 2025.\nIn addition to quarterly payments of the outstanding indebtedness, the loan agreement also requires annual payments of a percentage of excess cash flow, as defined in the loan agreement. The loan agreement states that an excess cash flow recapture payment must be made equal to (a) 75% of the excess cash flow for the immediately preceding fiscal year in which indebtedness to consolidated EBITDA ratio is greater than or equal to 2.50:1.0; (b) 50% of the excess cash flow for the immediately preceding fiscal year in which the funded indebtedness to consolidated EBITDA Ratio is less than 2.50:1.0 but greater than or equal to 1.5:1.0; or (c) 0% of the excess cash flow for the immediately preceding fiscal year in which the funded indebtedness to consolidated EBITDA Ratio is less than 1.5:1.0. In addition, the Company must make additional mandatory prepayment of amounts outstanding based on proceeds received from asset sales and sales of certain equity securities or other indebtedness. Due to the voluntary prepayment of term debt, there was no excess cash flow payment required. For additional information regarding the schedule of future payment obligations, please refer to Note 10 Commitments and Contingencies.\nOn September 30, 2019, we executed a floating-to-fixed interest rate swap with First National Bank (\"FNB\") as counter party. The notional amount in the floating-to-fixed interest rate swap on September 30, 2022 is $16.2 million and matures in 2024. The remaining outstanding balance of our secured term loan is subject to interest rate fluctuations and the minimum LIBOR floor. On the notional amount, the Company pays a base fixed rate of 1.61%, plus applicable credit spread. As a result, for the year ended September 30, 2022, interest expense increased by approximately $0.2 million.\n(b) The secured revolving line of credit has a ceiling of up to $25.0 million; as of September 30, 2022, we had unused borrowing capacity of $23.0 million, which is net of outstanding letters of credit. Borrowing on the secured revolving line of credit is secured by liens on substantially all of the assets of the Company. The Company accessed funds from the secured revolving line of credit during the year, but has no outstanding balance at September 30, 2022.\nThe Company's total borrowing availability, based on eligible accounts receivables at September 30, 2022, was $25.0 million. As part of the secured revolving line of credit, the lenders agreed to a sublimit of $5 million for letters of credit for the account of the Company, subject to applicable procedures.\nThe secured revolving line of credit has a maturity date of September 30, 2025 and is subject to loan covenants as described above. The Company is fully compliant with those covenants.\n8. Stock-based Compensation and Equity Grants\nStock-based compensation expense\nOptions issued under equity incentive plans were designated as either an incentive stock or a non-statutory stock option. No option was granted with a term of more than 10 years from the date of grant. Exercisability of option awards may depend on achievement of certain performance measures determined by the Compensation Committee of our Board. Shares issued upon option exercise are newly issued shares. As of September 30, 2022, there were 1.4 million shares available for grant.\nStock-based compensation expense, presented in the table below, is recorded in general and administrative expenses included in our consolidated statements of operations for the years ending September 30, 2022 and 2021 (in thousands):\n2022 2021\nDLH employees (a) $ 1,960 $ 1,193\nNon-employee directors (b) 648 467\nTotal stock option expense $ 2,608 $ 1,660\n(a): Included in this amount are equity grants of restricted stock units to Named Executive Officers (\"NEO\"), which were issued in accordance with the DLH long-term incentive compensation policy, and stock option grants to NEO and non-NEO company employees. The restricted stock units totaled 140,404 restricted stock units issued and outstanding at September 30, 2022.\n(b): In the first quarter of fiscal year 2022, we issued 53,510 restricted stock units to the Company's non-employee directors, all of which vested as of September 30, 2022. The shares of common stock underlying such restricted stock units were issued on September 30, 2022.\nUnrecognized stock-based compensation expense\nUnrecognized stock-based compensation expense is presented in the table below for the years ending September 30, 2022 and 2021 (in thousands):\n2022 2021\nUnrecognized expense for DLH employees (a) $ 5,214 $ 4,468\n(a): On a weighted average basis, this expense is expected to be recognized within the next 4.20 years.\nStock option activity for the year ended September 30, 2022:\nThe aggregate intrinsic value in the table below represents the total pretax intrinsic value (i.e., the difference between the Companys closing stock price on the last trading day of the period and the exercise price, times the number of shares) that would have been received by the option holders had all option holders exercised their in the money options on those dates. This amount will change based on the fair market value of the Companys stock.\n(in years)\nWeighted\nWeighted Average (in thousands)\n(in thousands) Average Remaining Aggregate\nNumber of Exercise Contractual Intrinsic\nShares Price Term Value\nOptions outstanding, September 30, 2021 2,374 $ 5.60 5.6 $ 15,899\nGranted (a) 275 16.17 - -\nExercised (257) 3.47 - -\nOptions outstanding, September 30, 2022 2,392 $ 7.05 5.4 $ 13,566\n(a): Utilizing a volatility of 50% along with assumptions of a 10-year term and the aforementioned 10-day stock price threshold results in an indicated range of value of the options granted during the year ended September 30, 2022, as follows using the Monte Carlo method:\nVesting Expected\nStrike Stock Threshold Term Calculated\nGrant Date Price Price Price (Years) Fair Value\nNovember 8, 2021 $ 16.01 $ 16.01 Service 10 $ 9.68\nNovember 8, 2021 $ 16.01 $ 16.01 $ 24.00 10 $ 9.68\nNovember 8, 2021 $ 16.01 $ 16.01 $ 28.00 10 $ 9.64\nNovember 8, 2021 $ 16.01 $ 16.01 $ 32.00 10 $ 9.58\nAugust 1, 2022 $ 17.77 $ 17.77 $ 23.00 10 $ 9.68\nNotes:\nResults based on 100,000 simulations\nStock options shares outstanding, vested and unvested for the years ended September 30, 2022 and 2021 (in thousands):\nNumber of Shares\n2022 2021\nVested and exercisable (a) 2,117 1,662\nUnvested (b) 275 712\nOptions outstanding 2,392 2,374\n(a): Weighted average exercise price of vested and exercisable shares was $5.86 and $3.91 at September 30, 2022 and 2021, respectively. Aggregate intrinsic value was approximately $13.6 million and $13.9 million at September 30, 2022 and 2021, respectively. Weighted average contractual term remaining was 4.9 years and 4.0 years at September 30, 2022 and 2021, respectively.\n(b): Certain awards vest upon satisfaction of certain performance criteria.\n9. Earnings Per Share\nBasic earnings per share is calculated by dividing income available to common shareholders by the weighted average number of common shares outstanding and restricted stock grants that vested or are likely to vest during the period. Diluted earnings per share is calculated by dividing income available to common shareholders by the weighted average number of basic common shares outstanding, adjusted to reflect potentially dilutive securities. Diluted earnings per share is calculated using the treasury stock method.\nEarnings Per Share information is presented in the table below for the years ending September 30, 2022 and 2021 (in thousands except for per share amounts):\n2022 2021\nNumerator:\nNet income $ 23,288 $ 10,145\nDenominator:\nDenominator for basic net income per share - weighted-average outstanding shares 12,830 12,549\nEffect of dilutive securities:\nStock options and restricted stock 1,349 1,048\nDenominator for diluted net income per share - weighted-average outstanding shares 14,179 13,597\nNet income per share - basic $ 1.82 $ 0.81\nNet income per share - diluted $ 1.64 $ 0.75\n10. Commitments and Contingencies\nContractual Obligations as of September 30, 2022 (in thousands):\nPayments Due Per Fiscal Year\nTotal 2023 2024 2025 2026 2027 Thereafter\nDebt obligations $ 22,000 $ - $ - $ 22,000 $ - $ - $ -\nFacility operating leases 23,407 3,216 3,104 2,995 3,092 2,487 8,513\nEquipment operating leases 135 83 52 - - - -\nTotal contractual obligations $ 45,542 $ 3,299 $ 3,156 $ 24,995 $ 3,092 $ 2,487 $ 8,513\nWorkers' Compensation\nWe accrue workers' compensation expense based on claims submitted, applying actuarial loss development factors to estimate the costs incurred but not yet recorded. Our accrued liability for claims development as of September 30, 2022 and September 30, 2021 was approximately $4.9 million and $7.0 million, respectively.\nLegal Proceedings\nAs a commercial enterprise and employer, the Company is subject to various claims and legal actions in the ordinary course of business. These matters can include professional liability, employment-relations issues, workers compensation, tax, payroll and employee-related matters, other commercial disputes arising in the course of its business, and inquiries and investigations by governmental agencies regarding our employment practices or other matters. The Company is not aware of any pending or threatened litigation that it believes is reasonably likely to have a material adverse effect on its results of operations, financial position or cash flows.\n11. Related Party Transactions\nThe Company has determined that for the years ended September 30, 2022 and 2021 and through the filing date of this report, there were no significant related party transactions that have occurred which require disclosure through the date that these consolidated financial statements were issued.\n12. Provision for Income Taxes\nThe significant components of provision for income taxes from continuing operations are summarized as follows for the years ending September 30, 2022 and 2021 (in thousands):\n2022 2021\nCurrent expense $ 7,351 $ 2,081\nDeferred expense 424 1,213\nTotal expense $ 7,775 $ 3,294\nThe following table presents the significant differences between our income taxes at the federal statutory rate and the Company's effective tax rate for continuing operations for the years ending September 30, 2022 and 2021 (in thousands):\n2022 2021\nIncome taxes at the federal statutory rate $ 6,523 $ 2,822\nState taxes, net 1,158 376\nOther permanent items 94 96\nTotal $ 7,775 $ 3,294\nAn analysis of the Company's deferred tax assets and liabilities at September 30, 2022 and 2021 is as follows (in thousands):\n2022 2021\nDeferred tax assets:\nNet operating loss carry forwards, net $ 296 $ 318\nStock based compensation 668 508\nAccrued compensation 2,108 2,614\nTotal deferred tax assets 3,072 3,440\nLess: valuation allowance (262) (288)\nTotal deferred tax assets, net 2,810 3,152\nDeferred tax liabilities:\nEquipment and intangible assets (3,833) (3,507)\nAccrued expenses (407) (671)\nRight of use liability (104) (150)\nTotal deferred tax liabilities (4,344) (4,328)\nNet deferred tax liability $ (1,534) $ (1,176)\n13. Quarterly Financial Data (Unaudited)\nA summary of quarterly information is as follows (in thousands, except per share data)\n2022 Quarters\nFirsta\nSeconda\nThirda\nFourth\nRevenue $ 152,801 $ 108,699 $ 66,440 $ 67,233\nIncome from operations 11,219 10,254 7,114 4,691\nInterest expense (672) (554) (512) (477)\nIncome before provision for income taxes 10,547 9,700 6,602 4,214\nProvision for income taxes 2,743 2,522 1,738 772\nNet income $ 7,804 $ 7,178 $ 4,864 $ 3,442\nEarnings per share:\nBasic $ 0.61 $ 0.56 $ 0.38 $ 0.27\nDiluted $ 0.55 $ 0.50 $ 0.34 $ 0.24\n2021 Quarters\nFirst Second Third Fourth\nRevenue $ 57,852 $ 61,506 $ 61,555 $ 65,182\nIncome from operations 3,635 4,620 4,939 4,030\nInterest expense (1,080) (1,004) (893) (808)\nIncome before provision for income taxes 2,555 3,616 4,046 3,222\nProvision for income taxes 741 1,049 1,166 339\nNet income $ 1,814 $ 2,567 $ 2,880 $ 2,883\nEarnings per share:\nBasic $ 0.15 $ 0.20 $ 0.23 $ 0.23\nDiluted $ 0.13 $ 0.19 $ 0.21 $ 0.21\na Results for the companys sustaining business less the FEMA task orders was presented annually in Item 7 and on a quarterly basis within the quarterly report (10Q) for fiscal year 2022's first, second and third quarters.\n14. Employee Benefit Plans\nAs of September 30, 2022, the Company maintains a 401(k) Plan (the \"401(k) Plan\"), a defined contribution and supplemental pension plan for the benefit of its eligible employees. The Company may provide a discretionary matching contribution of a participant's elective contributions under the 401(k) Plan. The Company recorded related expense of $2.2 million and $1.5 million for the years ending September 30, 2022 and 2021. Participants are always fully vested in their elective contributions and vests in Company matching contributions over a four-year period.\n15. Subsequent Events\nManagement has evaluated subsequent events through the date that the Company's consolidated financial statements were issued. Based on this evaluation, the Company has determined that no further subsequent events have occurred which require disclosure through the date that these consolidated financial statements were issued. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur CEO and President and Chief Financial Officer, after evaluating the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) or 15d-15(e) under the Securities Exchange Act of 1934) as of the end of the period covered by this Annual Report. Based on the evaluation of these controls and procedures, our disclosure controls and procedures were effective at the reasonable assurance level to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act of 1934 is (i) recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms and (ii) that such information is accumulated and communicated to our management, including our CEO and President and Chief Financial Officer, to allow timely decisions regarding required disclosure.\nOur management, including our CEO and President and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected. Our management, however, believes our disclosure controls and procedures are in fact effective to provide reasonable assurance that the objectives of the control system are met.\nManagements Report on Internal Control over Financial Reporting\nOur management, under the supervision of our Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. The Company's internal control over financial reporting includes those policies and procedures that:\n(i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the company; and\n(iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company's assets that could have a material effect on the financial statements.\nManagement, including our Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2022. In making this evaluation, management used the 2013 framework on Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on our evaluation under the COSO framework, our management has concluded that our internal control over financial reporting was effective as of September 30, 2022.\nDue to its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nWithumSmith+Brown, PC, an independent registered public accounting firm, has audited the Company's consolidated financial statements and has reported on the Company's internal control over financial reporting as of September 30, 2022. The audit report can be found in Part II, Item 8 of this Annual Report on Form 10-K.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) identified in connection with the evaluation of our internal control that occurred during the fourth quarter of our fiscal year ended September 30, 2022, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nThe Information required by Items 10, 11, 12, 13 and 14 of Part III of Form 10-K has been omitted in reliance on General Instruction G(3) and is incorporated herein by reference to our proxy statement to be filed with the SEC pursuant to Regulation 14A promulgated under the Securities Exchange Act of 1934, as amended, as set forth below: ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item with respect to our executive officers, directors, board committees, and corporate governance matters will be set forth in our definitive Proxy Statement under the captions \"Executive Officers,\" \"Election of Directors,\" and \"Corporate Governance\" of the Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement.\nWe have adopted a written code of business conduct and ethics, which applies to our principal executive officer, principal financial or accounting officer or person serving similar functions and all of our other employees and members of our board of directors. We did not waive any provisions of the code of business ethics during the year ended September 30, 2022. Our code of business conduct and ethics is posted in the investor relations - corporate governance section of our website at www.dlhcorp.com. If we amend, or grant a waiver under, our code of business ethics that applies to our principal executive officer, principal financial or accounting officer, or persons performing similar functions, we intend to post information about such amendment or waiver on our website. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item will be set forth in our definitive Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item will be set forth in our definitive Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item will be set forth in our definitive Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item will be set forth in our definitive Proxy Statement under the caption \"Independent Registered Public Accounting Firm\", to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements\nThe financial statements and schedules of the Company are included in Part II, Item 8 of this report beginning on page 33.\n(a)(2) Financial Statement Schedule\nAll schedules have been omitted since the required information is not applicable or because the information required is included in the consolidated financial statements or the notes thereto.\n(a)(3) Exhibits\nThe exhibits designated with an asterisk (*) are filed herewith. All other exhibits have been previously filed with the Commission and, pursuant to 17 C.F.R. Secs. 20l.24 and 240.12b-32, are incorporated by reference to the document referenced in brackets following the descriptions of such exhibits. The exhibits designated with a number sign (#) indicate a management contract or compensation plan or arrangement.\nExhibit No. Description\n2.1\nEquity Purchase Agreement among DLH Holdings Corp., Irving Burton Associates, LLC, Project Insight Holdings, Inc., the Owners of the Seller and Anna L. Ryan as the Sellers' Representative (filed as Exhibit 2.1 to Current Report on Form 8-K filed October 6, 2020).\n3.1\nAmended and Restated Certificate of Incorporation (filed as Exhibit A to Definitive Proxy Statement dated May 1, 2000 as filed with the Securities and Exchange Commission).\n3.2\nAmended and Restated By-Laws of Registrant adopted as of August 27, 2020 (filed as Exhibit 3.1 to the Current Report on Form 8-K filed August 31, 2020).\n3.3\nAmendment to Amended and Restated Certificate of Incorporation of the Company (filed as Exhibit B to Definitive Proxy Statement dated March 13, 2008 as filed with the Securities and Exchange Commission).\n3.4\nAmendment to Amended and Restated Certificate of Incorporation of the Company filed June 25, 2012 (filed as Exhibit 3.1 to Current Report on Form 8-K filed on June 26, 2012).\n3.5\nAmendment to Amended and Restated Certificate of Incorporation filed February 12, 2015 (filed as Annex A to the Companys Proxy Statement dated December 31, 2014).\n4.1\nSpecimen of the Common Stock Certificate (filed as Exhibit 4.1 to Annual Report on Form 10-K for the fiscal year ended September 30,2017.)\n4.2\nDescription of Securities (filed as Exhibit 4.3 to Annual Report on Form 10-K filed on December 7, 2020).\n10.1\n# Form of Stock Option Award under 2006 Long Term Incentive Plan (filed as Exhibit 10.6 to Quarterly Report on Form 10-Q filed on February 16, 2010).\n10.2\n# 2006 Long Term Incentive Plan, as amended (filed as Annex A to the Companys Proxy Statement dated January 3, 2014).\n10.3\nLease Agreement dated April 27, 2015 between DLH Holdings Corp. and Piedmont Center, 1-4 LLC (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q filed on August 5, 2015)\n10.4\n# 2016 Omnibus Equity Incentive Plan, as amended (incorporated by reference to Appendix A to the Companys definitive Proxy Statement dated January 28, 2021).\n10.5\n# Form of Stock Option Award Agreement under the 2016 Omnibus Equity Incentive Plan (filed as Exhibit 10.8 to Quarterly Report on Form 10-Q filed May 16, 2016).\n10.6\n# Change in Control, Severance and Covenant Agreement with Helene Fisher, dated June 4, 2018 (filed as Exhibit 10.2 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2018, filed August 6, 2018).\n10.7\nCredit Agreement among DLH Holdings Corp., DLH Solutions, Inc., Danya International, LLC, Social & Scientific Systems, Inc., First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto (filed as Exhibit 10.1 to Current Report on Form 8-K filed on June 13, 2019).\n10.8\nFirst Amendment to Credit Agreement among DLH Holdings Corp., DLH Solutions, Inc., Danya International, LLC, Social & Scientific Systems, Inc., First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto (filed as Exhibit 10.1 to Current Report on Form 8-K filed on September 12, 2019).\n10.9\nAmended and Restated Credit Agreement among DLH Holdings Corp., DLH Solutions, Inc., Danya International, LLC, Social & Scientific Systems, Inc., Irving Burton Associates, LLC, First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto (filed as Exhibit 10.1 to Current Report on Form 8-K filed October 6, 2020).\n10.10\n# Employment Agreement between the Company and Zachary C. Parker dated as of September 30, 2022 (filed as Exhibit 10.1 to Current Report on 8-K filed on October 6, 2022).\n10.11\n# Form of Restricted Stock Unit for non-employee directors under the 2016 Omnibus Equity Incentive Plan.\n10.12\n# Employment Offer Letter between the Company and Jeanine M. Christian (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2020, filed August 5, 2020).\n10.13\n# Employment Offer Letter between the Company and Jacqueline S. Everett (filed as Exhibit 10.2 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2020, filed August 5, 2020).\n10.14\n# Change in Control, Severance and Covenant Agreement between the Company and Jeanine M. Christian (filed as Exhibit 10.3 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2020, filed August 5, 2020).\n10.15\n# Change in Control, Severance and Covenant Agreement between the Company and Jacqueline S. Everett (filed as Exhibit 10.4 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2020, filed August 5, 2020).\n10.16\n# Employment agreement between the Company and Kathryn M JohnBull dated September 14, 2020 (filed as Exhibit 10.1 to Current Report on Form 8-K filed on September 15, 2020)\n10.17\n# Form of Performance Restricted Stock Units granted December 9, 2020 granted under the 2016 Omnibus Equity Incentive Plan (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended December 31, 2020, filed February 2, 2021).\n10.18\n# Employment Offer Letter between the Company and G. Maliek Ferebee (filed as Exhibit 10.20 to Annual Report on Form 10-K for the fiscal year ended September 30, 2021)\n10.19\n# Change in Control, Severance and Covenant Agreement between the Company and G. Maliek Ferebee (filed as Exhibit 10.21 to Annual Report on Form 10-K for the fiscal year ended September 30, 2021)\n10.20\n# Letter Agreement between the Company and Kevin Wilson dated April 12, 2022 (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2022).\n21.00\n* Subsidiaries of Registrants.\n23.10\n* Consent of WithumSmith+Brown, PC\n31.10\n* Certification of Chief Executive Officer pursuant to Section 17 CFR 240.13a-14(a) or 17 CFR 240.15d-14(a).\n31.20\n* Certification of Chief Financial Officer pursuant to Section 17 CFR 240.13a-14(a) or 17 CFR 240.15d-14(a).\n32.10\n* Certification of Chief Executive Officer and Chief Financial Officer pursuant to 17 CFR 240.13a-14(b) or 17 CFR 240.15d-14(b) and Section 1350 of Chapter 63 of Title 18 of the United States Code.\n101.0 The following financial information from the DLH Holdings Corp. Annual Report on Form 10-K for the fiscal year ended September 30, 2022, formatted in iXBRL (Inline eXtensible Business Reporting Language) and filed electronically herewith: (i) the Consolidated Balance Sheets; (ii) the Consolidated Statements of Operations; (iii) the Consolidated Statements of Cash Flows; (iv) the Consolidated Statements of Changes in Shareholders' Equity and, (v) the Notes to the Consolidated Financial Statements. Filed electronically herewith.\n104.0 Cover Page Interactive Data File. (formatted as Inline XBRL tags and contained in Exhibit 101)\nITEM 16. FORM 10-K SUMMARY\nNone.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDLH HOLDINGS CORP.\n/s/ KATHRYN M. JOHNBULL\nBy: Kathryn M. JohnBull\nChief Financial Officer\n(Principal Accounting Officer)\nDated: December 5, 2022\n______________________________________________________________________________________________________\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated:\nSignature Capacity Date\n/s/ Frederick G. Wasserman Chairman of the Board December 5, 2022\nFrederick G. Wasserman\n/s/ James P. Allen Director December 5, 2022\nJames P. Allen\n/s/ Martin J. Delaney Director December 5, 2022\nMartin J. Delaney\n/s/ Elder Granger, M.D. Director December 5, 2022\nElder Granger, M.D.\n/s/ Frances Murphy, M.D. Director December 5, 2022\nFrances Murphy, M.D.\n/s/ Austin J. Yerks III Director December 5, 2022\nAustin J. Yerks III\n/s/ Stephen J. Zelkowicz Director December 5, 2022\nStephen J. Zelkowicz\n/s/ Zachary C. Parker Chief Executive Officer, President and Director December 5, 2022\nZachary C. Parker\n/s/ Kathryn M. JohnBull Chief Financial Officer and Principal Accounting Officer December 5, 2022\nKathryn M. JohnBull"
}