{
    "cik": "785557",
    "company": "DLH Holdings Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-12-06",
    "period_of_report": "2023-09-30",
    "sic": "7363",
    "state_of_inc": "NJ",
    "state_location": "GA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/785557/0000785557-23-000089-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/785557/000078555723000089/dlhc-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/785557/0000785557-23-000089.txt",
    "filename": "785557_10K_2023_0000785557-23-000089.htm",
    "content": "ITEM 1. BUSINESS\nOverview and Background\nDLH Holdings Corp. (\"DLH\") delivers improved health and cyber readiness solutions for federal government customers through digital transformation, science research and development, and systems engineering and integration. We bring a unique combination of government sector experience, proven methodology, and unwavering commitment to solve the complex problems faced by civilian and military customers alike, doing so by leveraging multiple capabilities, including cyber technology, artificial intelligence, advanced analytics, cloud-based applications, and telehealth systems.\nDLH is a holding company operating through a number of operating subsidiaries. In December 2022, we acquired Grove Resource Solutions, LLC, which provides research and development, systems engineering and integration, and digital transformations solutions to federal agencies, notably the National Institutes of Health (\"NIH\"), U.S. Navy and U.S. Marine Corps.\nCompetitive Advantages\nWe believe we are advantageously positioned within our markets through a number of features including, but not limited to:\nhighly credentialed workforce;\npredominantly performing as the prime contractor;\nstrong past performance record across our government contracts; and\nstrong bipartisan support for our key contracts.\nWe have invested in leading credentials and capabilities that we expect will deliver value to our customers. These investments include development of secure Information Technology (\"IT\") platforms; sophisticated data analytic tools and techniques; and implementation process improvement and quality assurance programs and techniques. We are actively pursuing additional credentials that will support our customers' ever evolving missions.\nSolutions and Services\nWe primarily focus on improved deployment of large-scale health and defense initiatives for multiple agencies within the federal government, including the Department of Health and Human Services (\"HHS\"), the Department of Veterans Affairs (\"VA\"), Department of Defense (\"DoD\"), Department of Homeland Security (\"DHS\"), and many of their sub-agencies.\nWe deliver services primarily through prime contracts awarded by the federal government through competitive bidding processes. We have a diverse mix of contract vehicles with various agencies of the federal government, which supports our overall corporate growth strategy. Our revenue is distributed to time and materials contracts (56%), firm fixed price contracts (22%), and cost reimbursable contracts (22%).\nWe provide the following services and solutions, which are aligned with the long-term needs of our customers:\nDigital Transformation and Cyber Security;\nScience Research and Development; and\nSystems Engineering and Integration\nDigital Transformation and Cyber Security\nWe provide critical digital transformation and cyber security solutions across the federal civilian and cyber defense communities, leveraging advanced technology to modernize obsolete systems, protect sensitive information, manage large datasets, and enhance operational efficiency. Our suite of tools includes artificial intelligence and machine learning, cloud enablement, cybersecurity ecosystem, big data analytics, and modeling and simulation.\nIT modernization and cyber security maturity are priority initiatives throughout our customer set. Our customers, including numerous institutes and centers within the NIH, the Defense Health Agency (\"DHA\"), Tele-medicine and Advanced Technology Research Center (\"TATRC\"), and US Navy Naval Information Warfare Center (\"NIWC\"), rely on our information technology support to enable their vital missions. We work with these customers to reduce risk and build resilience to cyber and physical threats to the federal governments infrastructure, providing the full spectrum of cyber capabilities, cryptographic and true cyber engineering, Certified Information Security Officer (\"CISO\") / Information System Security Officer (\"ISSO\") support, risk management frameworks, Continuity of Operations (\"COOP\") / Disaster Recovery, and enterprise infrastructure and cloud governance focused on designing and implementing zero trust architecture.\nScience Research and Development\nWe advance scientific knowledge and understanding through our extensive research portfolio and domain expertise. We primarily provide large-scale data analytics, testing and evaluation, clinical trials research services, and epidemiology studies to support multiple operating divisions within HHS, including NIH and the Center for Disease Control and Prevention (\"CDC\"), as well as the Military Health System.\nOur employees support innovative, cutting-edge research on emerging trends, health informatics analyses, and application of best practices including mobile, social, and interactive media. We leverage evidence-based methods and web technology to drive health equity to our most vulnerable populations through public engagement. Projects often involve highly specialized expertise and transformative R&D support services. Our decades of experience designing, conducting, and analyzing studies for our diverse customer base, and our full-service clinical research solutions are designed for each customers specific research development program. Our employees provide expert knowledge and experience that supports our customers missions.\nSystem Engineering and Integration\nOur employees specialize in delivering engineering solutions that support our customers' evolving needs by rapidly deploying resources, solutions, and services. This includes specialized engineering expertise, encompassing areas of pharmaceutical delivery logistics, fire protection engineering, biomedical equipment, and technology engineering on behalf of the VA, NIWC, HHS and other federal customers.\nWe utilize automation to accelerate infrastructure innovation and help customers define a lifecycle for automation assets, as well as set standards for version control, testing, and release processes that proved a robust foundation for their customers. DLH delivers IT operational resilience and efficiency in parallel with technology innovation integration, via hybrid and multi-cloud solutions, leveraging integrated services, process automation, advanced tool stacks, and mature quality processes. Our employees engineer, implement, and operate solutions that demonstrate measurable results to satisfy our customers management requirements, thus helping customers to confidently deploy secure platforms and technologies that reduce operational costs. We have invested in agile software development credentials for our technical staff, and have achieved Capability Maturity Model Integration (\"CMMI\") level 3. Our enterprise lifecycle logistics support services encompass military systems deployed worldwide, as well as scientific and IT systems and peripherals for Federal civilian agencies.\nMajor Customers\nOur revenues are from agencies of the U.S. Federal government. A major customer is defined as a customer from whom we derive at least 10% of our revenues. The following table summarizes the revenues by customer for the years ended September 30, 2023 and 2022, respectively (in thousands):\n2023 2022\nRevenue Percent of total revenue Revenue Percent of total revenue\nDepartment of Health and Human Services $ 161,311 42.9 % $ 102,201 25.9 %\nDepartment of Veterans Affairs 138,862 37.0 % 126,106 31.9 %\nDepartment of Defense 70,325 18.7 % 33,612 8.5 %\nDepartment of Homeland Security 919 0.2 % 126,576 32.0 %\nCustomers with less than 10% share of total revenue 4,455 1.2 % 6,678 1.7 %\nRevenue\n$ 375,872 100.0 % $ 395,173 100.0 %\nMajor Contracts\nWe operate primarily through prime contracts awarded by the government through competitive bidding processes. We have a diverse mix of contract vehicles with various agencies of the U.S. government, which supports our overall corporate growth strategy. A major contract is defined as a contract or set of contracts from which we derive at least 10% of our revenues.\nThe revenue attributable to the VA was derived from 16 separate contracts covering the Company's performance of pharmacy and logistics services in support of the VA's Consolidated Mail Outpatient Pharmacy (\"CMOP\") program.\nNine contracts for pharmacy services, which represent approximately $79.6 million and $70.4 million of revenues for the years ended September 30, 2023 and 2022, respectively, are currently operating under a bridge contract through December 31, 2023.\nSeven contracts for logistics services represent approximately $59.2 million and $55.7 million of revenues for the years ended September 30, 2023 and 2022, respectively, are currently operating under a bridge contract through December 31, 2023.\nThe VA has issued a request for proposal for healthcare logistics and pharmacy services for each CMOP location. The procurements were set-aside for a service-disabled veteran owned small business (\"SDVOSB\") as the prime contractor. DLH maintains relationships with SDVOSB partners. Should the new contracts for performance of these services be awarded to a partner of DLH, the Company expects to continue to perform a significant amount of the contracts volume of business as a subcontractor. Should the VA conclude that an award to an SDVOSB prime contractor is not in the best interest of the government, they may reissue a solicitation in an unrestricted competition. DLH believes that its service excellence over many years on the program would provide an advantage in any competition.\nBacklog\nAt September 30, 2023, our backlog was approximately $704.8 million, of which $169.9 million was funded backlog. At September 30, 2022 our backlog was $482.5 million, of which $98.9 million was funded backlog.\nWe define backlog as our estimate of remaining future revenue from existing signed contracts, assuming the exercise of all options relating to such contracts and including executed task orders issued under Indefinite Quantity/Indefinite Delivery (\"IDIQ\") contracts or if the contract is a single award IDIQ contract.\nWe define funded backlog as the portion of backlog for which funding is appropriated and allocated to the contract by the customer and authorized for payment by the customer, once specified work is completed. Funded backlog does not include the full contract value as funding for contracts occurs on a periodic basis.\nCircumstances and events may cause changes in the amount of our backlog and funded backlog, including the execution of new contracts, extension of existing contracts, non-renewal or completion of current contracts, early termination, and adjustments to estimates. Changes in funded backlog may be affected by the funding cycles of the government. While no assurances can be given that existing contracts will result in earned revenue in any future period, or at all, our major customers have historically exercised their contractual renewal options.\nBacklog value is quantified from management's judgment and assumptions about the volume of services based on past volume trends and current planning developed with customers.\nCompetitive Landscape\nCompetitive solicitations and long business development cycles are characteristics of the government and defense industry in which we operate. For major program competition, the business acquisition cycle typically ranges from 18 to 36 months. Companies may pursue work either as prime contractor or partner with other companies in a subcontractor role. Those competing as prime contractors normally expend substantially more resources than those in subcontractor roles. We predominantly are the prime contractor on our contracts with federal government customers and compete with several large and small-business companies in pursuit of acquiring new business. In some cases, we seek to partner with other companies on new business pursuits to improve our competitive positioning with the customer.\nOur competitors include operating units within: Deloitte, Booz Allen Hamilton Holding Corp., CACI International, Inc., BAE Systems, ICF International, Inc., Leidos Holdings, Inc., Mantech International Corp., Aglient Technologies Inc., MAXIMUS, Inc., UnitedHealth Group, Inc. operating under Optum, and Westat, Inc.\nWe compete with these companies by leveraging our differentiating suite of tools and uniquely integrating people and processes and a solid track record of past performance, resulting in highly competitive proposals. We believe that our proprietary tools and processes, including e-PRAT® and SPOT-m®, along with our Infinibyte® cloud-based management system differentiate us from our competitors. We compete for awards through a full and open competition on a best-value basis. We draw heavily from our consistently high-quality past performance ratings, proven and evolving technical differentiators, key personnel credentials and growing market recognition to compete. We believe that our track record, knowledge and processes with respect to government contract bidding represent significant competitive advantages. Further, we believe that the range and depth of educational experience and professional credentials and certifications held by our employees allows us to deploy highly qualified teams to implement solutions to address the needs of our customers. Our recent and future success in this competitive landscape hinges on our ability to continue to uniquely integrate people, processes and technology tools to deliver best value solutions for our targeted customers (both government and industry partners).\nAdditionally, the Federal government may elect to restrict certain procurement activity, including renewals of our current contracts, to bidders that qualify for certain special statuses such as veteran owned, small, or small disadvantaged businesses. For those efforts, we would be limited to a subcontractor role.\nSeasonality\nThe U.S. government's fiscal year ends on September 30 each year. It is not uncommon for U.S. government agencies to award extra tasks or complete other contract actions within this timeframe leading up to the fiscal year end in order to avoid losses of unexpended fiscal year funds.\nRegulation\nOur business is affected by numerous laws and regulations relating to the award, administration and performance of U.S. Government contracts. In addition, many federal and state laws materially affect our operations. These laws relate to ethics, labor, tax, and employment matters. As any employer is, we are subject to federal and state statutes and regulations governing their standards of business conduct with the government, including that government contracts typically contain provisions permitting government customers to terminate contracts without cause with limited notice or compensation. The development of additional statutes and regulations and interpretation of existing statutes and regulations with respect to our industry can be expected to evolve over time. Through our corporate membership with the Professional Services Council and other affiliations, we monitor proposed and pending regulations from relevant congressional committees and government agency policies that have potential impact upon our industry and our specific strategically targeted markets. As with any commercial enterprise, we cannot predict with certainty the nature or direction of the development of Federal statutes and regulations that will affect its business operations. See Risk Factors in Part I, ITEM 1A. RISK FACTORS\nAs provided for under the Private Securities Litigation Reform Act of 1995 (\"1995 Reform Act\"), we wish to caution shareholders and investors that the following important factors, among others discussed throughout this Annual Report on Form 10-K for the fiscal year ended September 30, 2023, have affected, and in some cases could affect, our actual results of operations and cause our results to differ materially from those anticipated in forward looking statements made herein. Our business, results of operations, cash flows and financial condition may be materially and adversely affected due to any of the following risks. The risks described below are not the only ones we face. Additional risks we are not presently aware of or that we currently believe are immaterial may also impair our business operations. The trading price of our common stock could decline due to any of these risks. In assessing these risks, you should also refer to the other information contained or incorporated by reference in this Annual Report on Form 10-K, including our consolidated financial statements and related notes.\nRisks Relating to Our Business and the Industry in which we Compete\nWe depend on contracts with the Federal government for virtually all of our revenue and our business could be seriously harmed if the Federal government decreased or ceased doing business with us.\nAt present, we derive 99% of our revenue from agencies of the Federal government, primarily as a prime contractor but also as a subcontractor to other Federal prime contractors. In addition, substantially all accounts receivable, including unbilled accounts receivable, are from agencies of the U.S. Government as of September 30, 2023 and 2022. We expect that Federal government contracts will continue to be our primary source of revenue for the foreseeable future. We believe that the credit risk associated with our receivables is limited due to the creditworthiness of these customers. In general, if we were suspended or debarred from contracting with the federal government or if the government otherwise ceased doing business with us or significantly decreased the amount of business it does with us, our business, financial condition and operating results would be materially and adversely affected.\nA significant portion of our revenue is concentrated in a small number of contracts, and we could be seriously harmed if we were unable to continue providing services under, or unsuccessful in our recompete efforts on, these contracts.\nWe are dependent upon the continuation of our relationships with the VA and HHS as a significant portion of our revenue is concentrated in contracts with these customers. There can be no assurance as to the actual amount of services that we will ultimately provide to VA and HHS under our current contracts, or that we will be successful in recompete efforts. As described in greater detail above in \"Item 1 - Business - Major Contracts\", our contracts with the VA for the provision of services to its CMOP operations are expected to be subject to renewal solicitations. We believe that our strong working relationships and effective service delivery support ongoing performance for the terms of the contracts and recompete efforts as a prime or subcontractor. Our results of operations, cash flows and financial condition would be materially adversely affected if we were unable to continue our relationship with either of these customers, if we were to lose any of our material current contracts, or if the amount of services we provide to them is materially reduced.\nThe U.S. government may prefer veteran-owned, minority-owned, women-owned and small disadvantaged businesses; therefore, we may have fewer opportunities to bid for or could lose a portion of our existing work to small businesses.\nAs a result of the Small Business Administration (\"SBA\") set-aside program, the U.S. government may decide to restrict certain procurement activity only to bidders that qualify as veteran owned, minority-owned, small, or small disadvantaged businesses. In such cases, we would not be eligible to perform as a prime contractor on those programs and would be limited to work as a subcontractor on those programs. As previously reported, various agencies within the federal government have policies that support small business goals, including the adoption of the Rule of Two by the VA, which provides that the agency shall award contracts by restricting competition for the contract to service-disabled or other veteran owned businesses. To restrict competition pursuant to this rule, the contracting officer must reasonably expect that at least two of these businesses, which are capable of delivering the services, will submit offers and that the award can be made at a fair and reasonable price that offers the best value to the U.S. The effect of these set-aside provisions may limit our ability to compete for prime contractor positions on programs that we have targeted for growth and to maintain our prime contractor position as current contracts are subject to renewal.\nLoss of our GSA schedule contracts or other contracting vehicles could impair our ability to win new business and perform under existing contracts.\nWe currently hold multiple GSA schedule contracts, including a Federal supply schedule contract for professional and allied healthcare services and the logistics worldwide services contract. If we were to lose one or more of these contracts or other contracting vehicles, we could lose a significant revenue source and our operating results and financial condition could be materially and adversely affected.\nFuture legislative or government budgetary and spending changes could negatively impact our business.\nU.S. Government programs are subject to annual congressional budget authorization and appropriation processes. For many programs, Congress appropriates funds on a fiscal year basis even though the program performance period may extend over several years. Consequently, programs are often partially funded initially and additional funds are committed only as Congress makes further appropriations. In recent years, we have seen frequent debates regarding the scope of funding of our customers, thereby leading to budgetary uncertainty for our Federal customers. Changes in federal government budgetary priorities or actions taken to address government budget deficits, the national debt, and/or prevailing economic conditions, could directly affect our financial performance. Further, congressional seats may change during election years, and the balance of spending priorities may change along with them.\nA significant decline in government expenditures, a shift of expenditures away from programs that we support or a change in federal government contracting policies could cause federal government agencies to reduce their purchases under contracts, to exercise their right to terminate contracts at any time without penalty or not to exercise options to renew contracts. In the event the budgets or budgetary priorities of the U.S. Government entities with which we do business are delayed, decreased or underfunded, our consolidated revenues and results of operations could be materially and adversely affected.\nVA programs, which accounted for approximately 36.9% and 31.9% of Company revenue for the years ended September 30, 2023 and 2022, respectively, were exempt from the spending caps established under Federal government sequestration targets enacted in 2013.\nBecause we depend on U.S. government contracts, a delay in the completion of the U.S. government's budget and appropriations process could delay procurement of the services we provide and adversely affect our future revenues.\nThe funding of U.S. government programs is subject to an annual congressional budget authorization and appropriations process. In years when the U.S. government does not complete its appropriations before the beginning of the new fiscal year on October 1, government operations are typically funded pursuant to a \"continuing resolution,\" which allows federal government agencies to operate at spending levels approved in the previous appropriations cycle but does not authorize new spending initiatives. Currently, the government is currently operating under a continuing resolution (CR) which expires on January 19, 2024 for certain departments and February 2, 2024 for others. When the U.S. government operates under a CR, delays can occur in the procurement of the services and solutions that we provide and may result in new initiatives being canceled. When a CR expires, unless appropriations bills have been passed by Congress and signed by the President, or a new CR is passed and signed into law, the government must cease operations, or shutdown, except in certain emergency situations or when the law authorizes continued activity. We continuously review our operations in an attempt to identify programs potentially at risk from CRs so that we can consider appropriate contingency plans. A federal government shutdown could, however, result in our incurrence of substantial labor or other costs without reimbursement under customer contracts, the delay or cancellation of programs or the delay of contract payments, which could have a negative effect on our cash flows and adversely affect our future results of operations.\nThe markets in which we operate are highly competitive, and many of the companies we compete against have substantial resources. Further, the U.S. Government contract bid process is highly competitive, complex and sometimes lengthy, and is subject to protest and implementation delays.\nThe markets in which we operate are highly competitive. Further, many of our contracts and task orders with the Federal government are awarded through a competitive bidding process, which is complex and sometimes lengthy. We expect that many of the opportunities we will seek in the foreseeable future will be awarded through competitive bidding. Furthermore, budgetary pressures and developments in the procurement process have caused many government customers to increasingly purchase goods and services through IDIQ contracts, GSA schedule contracts and other government-wide acquisition contracts. These contracts, some of which are awarded to multiple contractors, have increased competition and pricing pressure, requiring that we make sustained post-award efforts to realize revenue under each such contract. Many of our competitors are larger and have greater resources than we do, larger customer bases and greater brand recognition. Our competitors, individually or through relationships with third parties, may be able to provide customers with different or greater capabilities or benefits than we can provide. If we are unsuccessful in competing with these other companies, our revenues and margins may materially decline.\nOverall, the competitive bidding process presents a number of risks, including the following: (i) we expend substantial cost and managerial time and effort to prepare bids and proposals for contracts that we may not win, and to defend those bids through any protest process; (ii) we may be unable to estimate accurately the resources and cost structure that will be required to service any contract we win; and (iii) we may encounter expenses and delays if our competitors protest or challenge awards of contracts to us in competitive bidding, and any such protest or challenge could result in the resubmission of bids on modified specifications, or in the termination, reduction or modification of the awarded contract. If we are unable to win particular contracts, we may be prevented from providing the services that are purchased under those contracts for a number of years. If we are unable to consistently win new contract awards over any extended period, our business and prospects will be adversely affected and that could cause our actual results to differ materially and adversely from those anticipated. In addition, upon the expiration of a contract, if the customer requires further services of the type provided by the contract, there is frequently a competitive rebidding process. There can be no assurance that we will win any particular bid, or that we will be able to replace business lost upon expiration or completion of a contract, and the termination or non-renewal of any of our significant contracts could cause our actual results to differ materially and adversely from those anticipated.\nIf a bid is won and a contract awarded, there still is the possibility of a bid protest or other delays in implementation. Our business could be adversely affected by delays caused by our competitors protesting major contract awards received by us, resulting in the delay of the initiation of work. It can take many months to resolve protests by one or more of our competitors of contract awards we receive. The resulting delay in the startup and funding of the work under these contracts may cause our actual results to differ materially and adversely from those anticipated, and there can be no assurance that such protest process or implementation delays will not have a material adverse effect on our financial condition or results of operations in the future.\nOur business may suffer if we or our employees are unable to obtain and maintain the necessary security clearances or other qualifications required to perform services for our customers.\nMany federal government contracts require us to have security clearances and employ personnel with specified levels of education, work experience and security clearances. Depending on the level of clearance, security clearances can be difficult and time-consuming to obtain. If we or our employees lose or are unable to obtain necessary security clearances, we may not be able to win new business and our existing customers could terminate their contracts with us or decide not to renew them. To the extent we cannot obtain or maintain the required security clearances for our employees working on a particular contract, we may not derive the revenue anticipated from the contract, which could cause our results to differ materially and adversely from those anticipated.\nOur business is regulated by complex federal procurement and contracting laws and regulations, and we are subject to periodic compliance reviews by governmental agencies.\nWe must comply with complex laws and regulations relating to the formation, administration, and performance of federal government contracts, including the Federal Acquisition Regulation, which, among other things, requires us to certify and disclose cost and pricing data and to divest work in the event of certain organizational conflicts of interest. These laws and regulations create compliance risk and affect how we do business with our federal agency customers and may impose added costs on our business. The government may in the future reform its procurement practices or adopt new contracting rules and regulations, including cost accounting standards, that could be costly to satisfy or that could impair our ability to obtain new contracts or change the basis upon which it reimburses our compensation and other expenses or otherwise limit such reimbursements. These changes could impair our ability to obtain new contracts or win re-competed contracts or adversely affect our future profit margin. Additionally, the government may face restrictions from new legislation, regulations or government union pressures, on the nature and amount of services the government may obtain from private contractors. Any reduction in the governments use of private contractors to provide federal services could cause our actual results to differ materially and adversely from those anticipated.\nOur performance on our U.S. Government contracts and our compliance with applicable laws and regulations, including submission of invoices to our customers, are subject to audit by the government. The scope of any such audits could span multiple fiscal years. These agencies review our performance on contracts, pricing practices, cost structure and compliance with applicable laws, regulations and standards. They also evaluate the adequacy of internal controls over our business systems, including our purchasing, accounting, estimating, earned value management, and government property systems. Any costs found to be improperly allocated or assigned to contracts will not be reimbursed, and any such costs already reimbursed must be refunded and certain penalties may be imposed. Moreover, if any of the administrative processes and systems are found not to comply with requirements, we may be subjected to increased government scrutiny and approval that could delay or otherwise adversely affect our ability to compete for or perform contracts or collect our revenues in a timely manner. Therefore, an unfavorable outcome of an audit could cause actual results to differ materially and adversely from those anticipated. If a government review or investigation uncovers illegal activities or activities not in compliance with a particular contract's terms or conditions, we may be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, harm to our reputation, suspension of payments, fines, and suspension or debarment from doing business with Federal government agencies. Any of these events could lead to a material reduction in our revenues, cash flows and operating results. Further, as the reputation and relationships that we have established and currently maintain with government personnel and agencies are important to our ability to maintain existing business and secure new business, damage to our reputation or relationships could have a material adverse effect on our revenue and operating results.\nFederal government contracts may be terminated at will and may contain other provisions that may be unfavorable to us.\nMany of the U.S. Government programs in which we participate as a contractor or subcontractor may extend for several years. The U.S. Government may modify, curtail or terminate its contracts and subcontracts for convenience and to the extent that a contract award contemplates one or more option years, the Government may decline to exercise such option periods. Accordingly, the maximum contract value specified under a government contract or task order awarded to us is not necessarily indicative of the revenue that we will realize under that contract. Due to our dependence on these programs, the modification, curtailment or termination of our major programs or contracts may have a material adverse effect on our results of operations and financial condition. In addition, federal government contracts contain provisions and are subject to laws and regulations that give the government rights and remedies, some of which are not typically found in commercial contracts, including allowing the government to (i) cancel multi-year contracts and related orders if funds for contract performance for an subsequent year become unavailable; (ii) claim rights in systems and software developed by us; (iii) suspend or debar us from doing business with the federal government or with a governmental agency; and (iv) impose fines and penalties and subject us to criminal prosecution. If the government terminates a contract for convenience, we may recover only our incurred or committed costs, settlement expenses and profit on work completed prior to the termination. If the government terminates a contract for default, we may be unable to recover even those amounts and instead may be liable for excess costs incurred by the government in procuring undelivered items and services from another source. Depending on the value of a contract, such termination could cause our actual results to differ materially and adversely from those anticipated.\nCertain contracts also contain organizational conflict of interest (OCI) clauses that limit our ability to compete for or perform certain other contracts. OCIs arise any time we engage in activities that (i) make us unable or potentially unable to render impartial assistance or advice to the government; (ii) impair or might impair our objectivity in performing contract work; or (iii) provide us with an unfair competitive advantage. For example, when we work on the design of a particular system, we may be precluded from competing for the contract to develop and install that system. Depending upon the value of the matters affected, an OCI issue that precludes our participation in or performance of a program or contract could cause our actual results to differ materially and adversely from those anticipated.\nWe may not receive the full amounts authorized under the contracts included in our backlog, which could reduce our revenue in future periods below the levels anticipated.\nOur total backlog consists of funded and unfunded amounts and may include estimates and assumptions about matters that cannot be determined with certainty at the time the backlog is calculated. Funded backlog represents contract value that has been appropriated by a customer and is expected to be recognized into revenue. Unfunded backlog represents the sum of the unappropriated contract value on executed contracts and unexercised option years that is expected to be recognized into revenue. The maximum contract value specified under a government contract or task order awarded to us is not necessarily indicative of the revenue that we will realize under that contract. For example, we generate revenue from IDIQ contracts, which do not require the government to purchase a pre-determined amount of goods or services under the contract. Action by the government to obtain support from other contractors or failure of the government to order the quantity of work anticipated could cause our actual results to differ materially and adversely from those anticipated. Additionally, many of our multi-year contracts may only be partially-funded at any point during their term with the unfunded portion subject to future appropriations by Congress. As a result of a lack of appropriated funds or efforts to reduce federal government spending, our backlog may not result in revenue. Accordingly, our backlog may not result in actual revenue in any particular period, or at all, which could cause our actual results to differ materially and adversely from those anticipated.\nOur business growth and profitable operations require that we develop and maintain strong relationships with other contractors with whom we partner or otherwise depend on.\nWe may enter into future teaming ventures with other companies, which carry risk in regard to maintaining strong, trusted working relationships in order to successfully fulfill contract obligations. Teaming arrangements may include being engaged as a subcontractor to a prime contractor, engaging a subcontractor on a contract for which we are the prime contractor, or entering into a joint venture with another company. We may lack control over fulfillment of such contracts, and poor performance on the contract could impact our customer relationship, even if we perform as required. We expect to depend on relationships with other contractors for a portion of our revenue in the foreseeable future. Our revenue and operating results could differ materially and adversely from those anticipated if any such prime contractor or teammate chooses to offer directly to the customer services of the type that we provide or if they team with other companies to provide those services.\nRestrictions on or other changes to the federal governments use of service contracts may harm our operating results.\nWe derive virtually all of our revenue from service contracts with the federal government. The government may face restrictions from new legislation, regulations or government union pressures on the nature and amount of services the government may obtain from private contractors (i.e., insourcing versus outsourcing). Any reduction in the governments use of private contractors to provide federal services could cause our actual results to differ materially and adversely from those anticipated.\nOur earnings and margins may vary based on the mix of our contracts and programs.\nAt September 30, 2023, our backlog includes cost reimbursable, time-and-materials, and firm-fixed-price contracts. Our earnings and margins may vary depending on the relative mix of contract types, the costs incurred in their performance, the achievement of other performance objectives and the stage of performance at which the right to receive fees, particularly under incentive and award fee contracts, is finally determined.\nOur employees, or those of our teaming partners, may engage in misconduct or other improper activities which could harm our business.\nWe are exposed to risk from misconduct or fraud by our employees, or employees of our teaming partners. Such violations could include intentional disregard for Federal government procurement regulations, engaging in unauthorized activities, seeking reimbursement for improper expenses, or falsifying time records. Employee misconduct could also involve the improper use of our customers' sensitive or classified information and result in a serious harm to our reputation. While we have appropriate policies in effect to deter illegal activities and promote proper conduct, it is not always possible to deter employee misconduct. Precautions to prevent and detect this activity may not be effective in controlling such risks or losses. As a result of employee misconduct, we could face fines and penalties, loss of security clearance and suspension or debarment from contracting with the federal government, which could materially and adversely affect our business, results of operations, financial condition, cash flows, and liquidity.\nIf we are unable to attract qualified personnel, our business may be negatively affected.\nWe rely heavily on our ability to attract and retain qualified employees and other personnel who possess the skills, experience, and licenses necessary in order to provide our solutions for our assignments. Our business is materially dependent upon the continued availability of such qualified personnel. Our inability to secure qualified personnel would have a material adverse effect on our business. Competition for qualified employees is intense and the cost of attracting qualified personnel and providing them with attractive benefits packages may be higher than we anticipate and, as a result, if we are unable to pass these costs on to our customers, our profitability could decline. Moreover, if we are unable to attract and retain qualified personnel, the quality of our services may decline and, as a result, we could lose customers.\nIf our subcontractors do not perform their contractual obligations, our performance as a prime contractor and our ability to obtain future business could be materially and adversely impacted and our actual results could differ materially and adversely from those anticipated.\nOur performance of government contracts may involve the issuance of subcontracts to other companies upon which we rely to perform all or a portion of the work we are obligated to deliver to our customers. Unsatisfactory performance by one or more of our subcontractors to deliver on a timely basis the agreed-upon supplies, perform the agreed-upon services, or appropriately manage their vendors may materially and adversely impact our ability to perform our obligations as a prime contractor. A subcontractors performance deficiency could result in the government terminating our contract for default. A default termination could expose us to liability for excess costs of reprocurement by the government and have a material adverse effect on our ability to compete for future contracts and task orders. Depending upon the level of problem experienced, such problems with subcontractors could cause our actual results to differ materially and adversely from those anticipated.\nThe federal governments appropriation process and other factors may delay the collection of our receivables, and our business may be adversely affected if we cannot collect our receivables in a timely manner.\nWe depend on the collection of our receivables to generate cash flow, provide working capital, pay debt and continue our business operations. If the federal government or any prime contractor for whom we are a subcontractor fails to pay or delays the payment of their outstanding invoices for any reason, our business and financial condition may be materially and adversely affected. The government may fail to pay outstanding invoices for a number of reasons, including lack of appropriated funds or lack of an approved budget. Contracting officers have the authority to impose contractual withholdings, which can also adversely affect our ability to collect timely. If we experience difficulties collecting receivables, it could cause our actual results to differ materially and adversely from those anticipated. In addition, from time to time, when we are awarded a contract, we incur significant expenses before we receive any contract payments. These expenses include leasing and outfitting office space, purchasing office equipment, and hiring personnel. In other situations, contract terms provide for billing upon achievement of specified project milestones. In these situations, we are required to expend significant sums of money before receiving related contract payments. In addition, payments due to us from government agencies may be delayed due to billing cycles or as a result of failures by the government to approve governmental budgets in a timely manner. In addition to these factors, poor execution on project startups could impact us by increasing our use of cash. In certain circumstances, we may defer recognition of costs incurred at the inception of a contract. Such action assumes that we will be able to recover these costs over the life of the contract. To the extent that a project does not perform as anticipated, these deferred costs may not be considered recoverable resulting in an impairment charge.\nRisks Relating to Our Information Technology Systems and Intellectual Property\nWe are highly dependent on the proper functioning of our information systems.\nWe are highly dependent on the proper functioning of our information systems in operating our business. Critical information systems used in daily operations match employee resources and customer assignments and track regulatory credentialing. They also perform payroll, billing and accounts receivable functions. While we have multiple back up plans for these types of contingencies, our information systems are vulnerable to fire, storms, flood, power loss, telecommunication outages, physical break-ins, cyber-attack, ransomware, and similar events. If our information systems become inoperable, or are otherwise unavailable, these functions would have to be accomplished manually, which in turn could impact our financial viability, due to the increased cost associated with performing these functions manually.\nOur systems and networks may be subject to cybersecurity breaches.\nMany of our operations rely heavily upon technology systems and networks to receive, input, maintain and communicate participant and customer data pertaining to the programs we manage. Any systems failures, whether caused by us, a third-party service provider, or unauthorized intruders and hackers, or due to situations such as computer viruses, natural disasters, or power shortages, could cause loss of data or interruptions or delays in our business or that of our customers. If our systems or networks were compromised by a security breach, we could be adversely affected by losing confidential or protected information of program participants and customers, and we could suffer reputational damage and a loss of confidence from prospective and existing customers. Similarly, if our internal networks were compromised, we could be adversely affected by the loss of proprietary, trade secret or confidential technical and financial data. The loss, theft or improper disclosure of that information could subject the Company to sanctions under the relevant laws, lawsuits from affected individuals, negative press articles and a loss of confidence from our government customers, all of which could adversely affect our existing business, future opportunities and financial condition. Further, our property and cyber insurance may be inadequate to compensate us for all losses that may occur as a result of any system or operational failure or disruption and, as a result, our actual results could differ materially and adversely from those anticipated. In addition, in order to provide services to our customers, we often depend upon or use customer systems that are supported by the customer or third parties. Any security breach or system failure in such systems could result in an interruption of our customers operations which could cause us to experience significant delays under a contract, and a material adverse effect on our results of operations.\nAdditionally, a number of projects require us to receive, maintain and transmit protected health information or other types of confidential personal information. That information may be regulated by the Health Insurance Portability and Accountability Act (HIPAA), the Health Information Technology for Economic and Clinical Health Act of 2009, Internal Revenue Service regulations and other laws. The loss, theft or improper disclosure of that information could subject us to sanctions under these laws, breach of contract claims, lawsuits from affected individuals, negative press articles and a loss of confidence from our government customers, all of which could adversely affect our existing business, future opportunities and financial condition.\nFailure to adequately protect, maintain, or enforce our rights in our intellectual property may adversely limit our competitive position.\nWe rely upon a combination of nondisclosure agreements and other contractual arrangements, as well as copyright, trademark, and trade secret laws to protect our proprietary information. We also enter into proprietary information and intellectual property agreements with employees, which require them to disclose any inventions created during employment, to convey such rights to inventions to us, and to restrict any disclosure of proprietary information. Trade secrets are generally difficult to protect. Although our employees are subject to confidentiality obligations, this protection may be inadequate to deter or prevent misappropriation of our confidential information and/or the infringement of our trademarks and copyrights. Further, we may be unable to detect unauthorized use of our intellectual property or otherwise take appropriate steps to enforce our rights. Failure to adequately protect, maintain, or enforce our intellectual property rights may adversely limit our competitive position.\nWe may face from time to time, allegations that we or a supplier or customer have violated the intellectual property rights of third parties. If, with respect to any claim against us for violation of third-party intellectual property rights, we are unable to prevail in the litigation or retain or obtain sufficient rights or develop non-infringing intellectual property or otherwise alter our business practices on a timely or cost-efficient basis, our business and competitive position may be adversely affected.\nAny infringement, misappropriation or related claims, whether or not meritorious, are time consuming, divert technical and management personnel, and are costly to resolve. As a result of any such dispute, we may have to develop non-infringing intellectual property, pay damages, enter into royalty or licensing agreements, cease utilizing certain products or services, or take other actions to resolve the claims. These actions, if required, may be costly or unavailable on terms acceptable to us.\nRisks Relating to Acquisitions\nIn connection with acquisitions, we may be required to take write-downs or write-offs, restructuring and impairment, or other charges that could negatively affect our business, assets, liabilities, prospects, outlook, financial condition, and results of operations.\nAlthough we conduct extensive due diligence in connection with an acquisition, we cannot assure that this diligence revealed all material issues that may be present, that it would be possible to uncover all material issues through customary due diligence, or that factors outside of our control will not later arise. We have also purchased representations and warranties insurance in connection with the acquisition, but there is no assurance that those policies will cover any losses we might experience from breaches of the sellers representations and warranties or otherwise arising from the acquisition. Even if our due diligence successfully identifies certain risks, unexpected risks may arise and previously known risks may materialize in a manner not consistent with our preliminary risk analysis. Further, as a result of the acquisition, purchase accounting, and the operation of the combined company after closing, we may be required to take write-offs or write-downs, restructuring and impairment or other charges that could negatively affect business, assets, liabilities, prospects, outlook, financial condition and results of operations.\nWe may have difficulty identifying and executing other acquisitions on favorable terms and therefore may grow at slower than anticipated rates.\nOne of our potential paths to growth is to selectively pursue acquisitions. Through acquisitions, we may be able to expand our base of customers, increase the range of solutions we offer to our customers and deepen our penetration of existing markets and customers. We may not identify and execute suitable acquisitions. To the extent that management is involved in identifying acquisition opportunities or integrating new acquisitions into our business, our management may be diverted from operating our core business. Without acquisitions, we may not grow as rapidly otherwise, which could cause our actual results to differ materially and adversely from those anticipated.\nWe may encounter other risks in regard to making acquisitions, including:\nincreased competition for acquisitions may increase the costs of our acquisitions;\nnon-discovery or non-disclosure of material liabilities during the due diligence process, including omissions by prior owners of any acquired businesses or their employees in complying with applicable laws or regulations, or their inability to fulfill their contractual obligations to the federal government or other customers; and\nacquisition financing may not be available on reasonable terms or at all.\nAny of these risks could cause our actual results to differ materially and adversely from those anticipated.\nWe may have difficulty integrating the operations of companies we acquire, which could cause actual results to differ materially and adversely from those anticipated.\nThe success of a potential future acquisition strategy depends upon our ability to successfully integrate the businesses. We may have difficulty integrating a business that we may acquire in the future. The integration of a business into our operations may result in unforeseen operating difficulties, absorb significant management attention and require significant financial resources that would otherwise be available for the ongoing development of our business. These integration difficulties include the integration of personnel with disparate business backgrounds, the transition to new information systems, coordination of geographically dispersed organizations, loss of key employees of acquired companies, and reconciliation of different corporate cultures. Further, the integration process could take longer than anticipated and could result in the loss of key employees, the disruption of each companys ongoing businesses, result in tax costs or inefficiencies, or inconsistencies in standards, controls, information technology systems, procedures and policies, any of which could materially adversely affect our ability to maintain relationships with customers, employees or other third parties, or our ability to achieve the anticipated benefits of the transactions, and could harm our financial performance. For these or other reasons, we may be unable to retain key customers of acquired companies. Moreover, any acquired business may not generate the revenue or net income we expected or produce the efficiencies or cost-savings we anticipated. Any of these outcomes could cause our actual results to differ materially and adversely from those anticipated.\nWith respect to our acquisition of Grove Resource Solutions (GRSi) in December 2022, the benefits of the acquisition will depend, in part, on our ability to successfully combine our businesses and realize the anticipated benefits, including business\nopportunities and growth prospects from combining our businesses. We may not achieve these objectives within the anticipated time frame or may never realize these benefits and the value of our common stock may be harmed. The acquisition involves the integration of GRSis business with our existing business, which has been a costly and time-consuming process. If we are unable to successfully or timely integrate our operations with those of GRSi, we may incur unanticipated liabilities and be unable to realize the revenue growth, synergies, and other anticipated benefits resulting from the acquisition, and our business, results of operations, and financial condition could be materially adversely affected.\nWe have a substantial amount of goodwill on our balance sheet. Future write-offs of goodwill may have the effect of decreasing our earnings or increasing our losses.\nWe have obtained growth through acquisitions of other companies and businesses. Under existing accounting standards, we are required to periodically review goodwill for possible impairment. In the event that we are required to write down the value of any assets under these pronouncements, it may materially and adversely affect our earnings. See the more detailed discussion appearing as part of our Management's Discussion and Analysis of Financial Condition and Results of Operations in Item 7 herein.\nRisks Relating to Our Outstanding Indebtedness\nWe have incurred debt in connection with acquisitions and we must make the scheduled principal and interest payments on the facility and maintain compliance with other debt covenants.\nFollowing our acquisition of Grove Resource Solution, LLC (\"GRSi\") in December 2022, we amended and restated our credit agreement with First National Bank of Pennsylvania and certain other lenders (the Credit Agreement) and incurred additional indebtedness. The Credit Agreement requires compliance with a number of financial covenants and contains restrictions on our ability to engage in certain transactions, including limitations on: granting liens; incurring other indebtedness; disposing assets; making investments in other entities; and completing other mergers and consolidations. Also, the Credit Agreement requires us to comply with certain financial covenants including a minimum fixed charge coverage ratio and a maximum total leverage ratio. In addition, the Credit Agreement also requires prepayments of a percentage of excess cash flow. Accordingly, a portion of our cash flow from operations was dedicated to the repayment of our indebtedness and we expect future cash flow to be used to reduce our indebtedness. The loan agreement provides for customary events of default, including, among other things, a payment default, covenant default or defaults on other indebtedness or judgments in excess of a stipulated amount, change of control events, suspension or disbarment from contracting with the federal government and the material inaccuracy of our representations and warranties. If we are unable to make the scheduled principal and interest payments on the Credit Agreement or maintain compliance with other debt covenants, we may be in default under the loan agreement, which if not waived, could cause our debt to become immediately due and payable and enable the lenders to enforce their rights under the Credit Agreement. Such an event would likely have a material adverse effect on our business, financial condition and results of operations.\nOur increased indebtedness could adversely affect us in a number of other ways, including:\ncausing us to be less able to take advantage of business opportunities, such as other acquisition opportunities, and to react to changes in market or industry conditions;\nincreasing our vulnerability to adverse economic, industry, or competitive developments;\naffecting our ability to pay or refinance debts as they become due during adverse economic, financial market, and industry conditions;\nrequiring us to use a larger portion of cash flow for debt service, reducing funds available for other purposes;\ndecreasing our profitability and/or cash flow;\ncausing us to be disadvantaged compared to competitors with less leverage; and\nlimiting our ability to borrow additional funds in the future to fund working capital, capital expenditures, and other general corporate purposes.\nRisks Relating to Our Corporate Structure and Capital Stock\nOur stock price may be volatile and your investment in our common stock may suffer a decline in value.\nThe price of our common stock could be subject to fluctuations and may decline in the future due to risks defined herein, or due to factors beyond our control, including changes in market conditions such as increased interest rates, a recession, or a change in Federal spending priorities. Stock markets in general have experienced volatility that has often been unrelated to the operating performance of a particular company. These broad market fluctuations could adversely affect the trading price of our common stock.\nSince we have not paid dividends on our common stock, you cannot expect dividend income from an investment in our common stock.\nWe have not paid any dividends on our common stock since our inception and do not contemplate or anticipate paying any dividends on our common stock in the foreseeable future. Current lenders do and future potential lenders may prohibit us from paying dividends without prior consent. Therefore, holders of our common stock may not receive any dividends on their investment in us. Earnings, if any, may be retained and used to finance the development and expansion of our business.\nWe may issue preferred stock with rights senior to our common stock, which may adversely impact the voting and other rights of the holders of our common stock.\nOur certificate of incorporation authorizes the issuance of \"blank check\" preferred stock with such designations, rights and preferences as may be determined from time to time by our board of directors up to an aggregate of 5,000,000 shares of preferred stock. Accordingly, our board of directors is empowered, without stockholder approval, to issue preferred stock with dividend, liquidation, conversion, voting or other rights, which would adversely affect the voting power or other rights of the holders of our common stock. In the event of issuance, the preferred stock could be utilized, under certain circumstances, as a method of discouraging, delaying or preventing a change in control of our Company, which could have the effect of discouraging bids for our Company and thereby prevent stockholders from receiving the maximum value for their shares. Although we have no present intention to issue any shares of our preferred stock, in order to discourage or delay a change of control of our Company, we may do so in the future. In addition, we may determine to issue preferred stock in connection with capital raising efforts and the terms of the stock so issued could have special voting rights or rights related to the composition of our Board.\nThe exercise or vesting of our outstanding common stock options and restricted stock units may depress our stock price and dilute your ownership of the Company.\nTo the extent that options are exercised or restricted stock units vest, dilution to our shareholders will occur. We cannot foresee the impact of any potential sales of our common shares on the market, but it is possible that if a significant percentage of such available shares were attempted to be sold within a short period of time, the market for our shares would be adversely affected. It is also unclear whether or not the market for our common stock could absorb a large number of attempted sales in a short period of time. Moreover, the terms upon which we will be able to obtain additional equity capital may be adversely affected, since the holders of these securities can be expected to exercise them at a time when we would, in all likelihood, be able to obtain any needed capital on terms more favorable to us than the exercise terms provided by those securities. To the extent that these securities are exercised, dilution to our shareholders will occur. Moreover, the terms upon which we will be able to obtain additional equity capital may be adversely affected, since the holders of these securities can be expected to exercise them at a time when we would, in all likelihood, be able to obtain any needed capital on terms more favorable to us than the exercise terms provided by those securities.\nAnti-takeover provisions in our Articles of Incorporation make a change in control of our Company more difficult.\nThe provisions of our Articles of Incorporation and the New Jersey Business Corporation Act, together or separately, could discourage potential acquisition proposals, delay or prevent a change in control and limit the price that certain investors might be willing to pay in the future for our common stock. Among other things, these provisions:\nrequire certain supermajority votes; and\nestablish certain advance notice procedures for nomination of candidates for election as directors and for shareholders' proposals to be considered at shareholders' meetings.\nIn addition, the New Jersey Business Corporation Act contains provisions that, under certain conditions, prohibit business combinations with 10% shareholders and any New Jersey corporation for a period of five years from the time of acquisition of shares by the 10% shareholder. The New Jersey Business Corporation Act also contains provisions that restrict certain business combinations and other transactions between a New Jersey corporation and 10% shareholders.\nOur executive officers, directors and significant stockholders will be able to influence matters requiring stockholder approval.\nAs of September 30, 2023, our executive officers, directors and largest shareholder (Wynnefield Capital, Inc. and its affiliates) own approximately 44% of our outstanding common stock. Within this amount, Wynnefield Capital, Inc. and its affiliates own approximately 26% of our outstanding common stock. This concentration of ownership may have the effect of delaying, preventing or deterring a change in control of the Company, could deprive our stockholders of an opportunity to receive a premium for their common stock as part of a sale or merger of our company and may negatively affect the market price of our common stock. These matters might include proxy contests, tender offers, mergers or other purchases of common stock that could give our stockholders the opportunity to realize a premium over the then-prevailing market price for shares of our common stock.\nIn addition, persons associated with Wynnefield Capital, Inc. currently serve on our Board of Directors. As a result of this share ownership and relationships on our Board of Directors, our largest stockholder will be able to influence all affairs and actions of our company, including matters requiring stockholder approval such as the election of directors and approval of significant corporate transactions. The interests of our principal stockholders may differ from the interests of the other stockholders.\nGeneral Business Risks\nWe may experience fluctuations in our revenues and operating results from period to period.\nOur revenue and operating results may fluctuate significantly and unpredictably in the future. We have expended, and will continue to expend, substantial resources to enhance our health services offerings and expansion into the Federal health market. We may incur growth expenses before new business revenue is realized, thus showing lower profitability in a particular period or consecutive periods. Other factors which may cause our cash flows and results of operations to vary from quarter to quarter include: the terms and progress of contracts; expenses related to certain contracts which may be incurred in periods prior to revenue being recognized; the commencement, completion or termination of contracts during any particular quarter; the timing and terms of award contracts; and government budgetary delays or shortfalls. We may be unable to achieve the desired levels of revenue growth due to circumstances that are beyond our control, as already expressed regarding competition, government budgets, and the procurement process in general. In particular, if the federal government does not adopt, or delays adoption of, a budget for each fiscal year beginning on October 1, or fails to pass a continuing resolution, federal agencies may be forced to suspend our contracts and delay the award of new and follow-on contracts and orders due to a lack of funding. Also, some aspects of this work can be seasonal with regard to resources and funding, and it is difficult to predict the timing of when those resources will be expended. Although we continue to manage our operating costs and expenses, there is no guarantee that we will significantly increase future revenue and profit in any particular future period. Revenue levels achieved from our customers, the mix of solutions that we offer and our performance on future contracts will affect our financial results. Further, changes in the volume of activity and the number of contracts commenced, completed or terminated during any quarter may cause significant variations in our cash flows and results of operations. Therefore, period-to-period comparisons of our operating results may not be a good indication of our future performance.\nAn increase in the prices of goods and services could raise the costs associated with providing our services, diminish our ability to compete for new contracts or task orders and/or reduce customer buying power.\nWe may experience an increase in the costs in our supply and labor markets due to global inflationary pressures and other various geopolitical factors. We generate a portion of our revenues through various fixed price and multi-year government contracts which anticipate moderate increases in costs over the term of the contract. With the current pace of inflation our standard approach to moderate annual price escalations in our bids for multi-year work may be insufficient to counter inflationary cost pressures. This could result in reduced profits, or even losses, as inflation increases, particularly for fixed priced contracts and our longer-term multi-year contracts. In the competitive environment in which we operate as a government contractor, the lack of pricing leverage and ability to renegotiate long-term, multi-year contracts, could reduce our profits, disrupt our business, or otherwise materially adversely affect our results of operations.\nOur profits and revenues could suffer if we are involved in legal proceedings, investigations, and disputes.\nWe are exposed to legal proceedings, investigations and disputes. In addition, in the ordinary course of our business we may become involved in legal disputes regarding personal injury or employee disputes. While we provide for these types of incidents through commercial third-party insurance carriers, we often defray these types of cost through higher deductibles. Any unfavorable legal ruling against us could result in substantial monetary damages by losing our deductible portion of carried insurance. We maintain insurance coverage as part of our overall legal and risk management strategy to lower our potential liabilities. If we sustain liabilities that exceed our insurance coverage or for which we are not insured, it could have a material adverse impact on our results of operations, cash flows and financial condition, including our profits, revenues and liquidity.\nWe are dependent upon certain of our management personnel and do not maintain \"key personnel\" life insurance on our executive officers.\nOur success to date has resulted in part from the significant contributions of our executive officers. Our executive officers are expected to continue to make important contributions to our success. As of September 30, 2023, certain of our officers are under employment contracts. However, we do not maintain \"key personnel\" life insurance on any of our executive officers. Loss for any reason of the services of our key personnel could materially affect our operations.\nWe may not be fully covered by the insurance we procure and our business could be adversely impacted if we were not able to renew all of our insurance plans.\nAlthough we carry multiple lines of liability insurance (including coverage for medical malpractice and workers' compensation), they may not be sufficient to cover the total cost of any judgments, settlements or costs relating to any present or future claims, suits or complaints. If we are unable to secure renewal of our insurance contracts or the renewal of such contracts with favorable rates and with competitive benefits, our business could be adversely affected. In addition, sufficient insurance may not be available to us in the future on satisfactory terms or at all. Further, the fact that the majority of our employees are located at customer locations increases our potential liability for negligence and professional malpractice and such liabilities may not become immediately apparent. Any increase in our costs of insurance will impact our profitability to the extent that we cannot offset these increases into our costs of services. If the insurance we carry is not sufficient to cover any judgments, settlements or costs relating to any present or future claims, suits or complaints, our business, financial condition, results of operations and liquidity could be materially adversely affected.\nOur financial condition may be affected by increases in employee healthcare claims and insurance premiums, and workers' compensation claims and insurance rates.\nOur current workers' compensation and medical plans are partially self-funded insurance programs. The Company currently pays base premiums plus actual losses incurred, not to exceed certain individual and aggregate stop-loss limits. In addition, health insurance premiums, and workers' compensation rates for the Company are in large part determined by our claims experience. These categories of expenditure comprise a significant portion of our direct costs. If we experience a large increase in claim activity, our direct expenditures, health insurance premiums, unemployment taxes or workers' compensation rates may increase. Although we employ internal and external risk management procedures in an attempt to manage our claims incidence and estimate claims expenses and structure our benefit contracts to provide as much cost stability as reasonably possible given the self-funded nature of our plans, we may not be able to prevent increases in claim activity, accurately estimate our claims expenses or pass the cost of such increases on to our customers. Since our ability to incorporate such increases into our fees to our customers is constrained by contractual arrangements with our customers, a delay could occur before such increases could be reflected in our fees, which may reduce our profit margin. As a result, such increases could have a material adverse effect on our financial condition, results of operations and liquidity.\nWe may be subject to fines, penalties and other sanctions if we do not comply with laws governing our business.\nOur business lines operate within a variety of complex regulatory schemes, including but not limited to the FAR, Federal Cost Accounting Standards, the Truth in Negotiations Act, as well as the regulations governing accounting standards. If a government audit finds improper or illegal activities by us or we otherwise determine that these activities have occurred, we may be subject to civil and criminal penalties and administrative sanctions, including termination of contracts, forfeiture of profits, suspension of payments, fines and suspension or disqualification from doing business with the government. Any adverse determination could adversely impact our ability to bid in response to RFPs in one or more jurisdictions. Further, as a government contractor subject to the types of regulatory schemes described above, we are subject to an increased risk of investigations, criminal prosecution, civil fraud, whistleblower lawsuits and other legal actions and liabilities to which private\nsector companies are not, the result of which could have a material adverse effect on our operating results, cash flows and financial condition.\nChanges to U.S. tax laws may adversely affect our financial condition or results of operations and create the risk that we may need to adjust our accounting for these changes.\nThe accounting treatment of these tax law changes is complex, and some of the changes may affect both current and future periods. Consistent with guidance from the SEC, our consolidated financial statements reflect our estimates of the tax effects of the current tax laws and regulations.\nWe are exposed to increased costs and risks associated with complying with increasing and new regulation of corporate governance and disclosure standards.\nSince the implementation of the Sarbanes-Oxley Act of 2002, we spend a significant amount of management's time and resources (both internal and external) to comply with changing laws, regulations and standards relating to corporate governance and public disclosures. This compliance requires management's annual review and evaluation of our internal control systems. This process has caused us to engage outside advisory services and has resulted in additional accounting and legal expenses. We may encounter problems or delays in completing these reviews and evaluation and the implementation of improvements. If we are not able to timely comply with the requirements set forth in the Sarbanes-Oxley Act of 2002, we might be subject to sanctions or investigation by regulatory authorities. Any such action could materially adversely affect our business and our stock price.\nOur results of operations could in the future be materially adversely impacted by global, macroeconomic events, such health epidemics, pandemics and other outbreaks, and the response to contain it.\nWe face various risks related to health epidemics, pandemics, and similar outbreaks, including the coronavirus (COVID-19) pandemic. The COVID-19 pandemic and the mitigation efforts to control its spread have created significant volatility, uncertainty and economic disruption and adversely impacted the U.S. and global economies. The extent to which the coronavirus pandemic and recovery activity further impacts our business, operations and financial results will depend on numerous evolving factors that we may not be able to accurately predict, including: the duration and scope of the pandemic; governmental, business and individuals actions that have been and which may continue to be taken in response to the pandemic, including our ability to fully perform on our contracts as a result of government actions; the impact of the pandemic on economic activity and actions taken in response; the effect on our customers and customer demand for our services and solutions; our ability to sell and provide our services and solutions; and any closures of our and our customers offices and facilities, particularly at our pharmacy distribution centers. Furthermore, the significant increase in remote working of our employees may exacerbate certain risks to our business, including an increased demand for information technology resources and the increased risk of malicious technology-related events, such as cyberattacks and phishing attacks. Government agencies are our primary customers and the long-term impact of increased government spending in response to COVID-19 remains uncertain. We continue to monitor the effect of COVID-19 on our business, but for the reasons stated above, we cannot predict the full impact of COVID-19. Any of these events could materially adversely affect our business, financial condition, results of operations and the market price of our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nThere are no unresolved staff comments. ITEM 2. PROPERTIES\nWe do not own any real estate or other properties. As of September 30, 2023, we operate eight locations in the U.S. and one location in Kampala, Uganda: occupying a total of approximately 99.3 thousand square feet. The Company's corporate headquarters is located at 3565 Piedmont Road NE, Building 3 Suite 700, Atlanta, Georgia 30305, and we presently maintain a National Capital Region office in Bethesda, Maryland. All of our offices are in reasonably modern and well-maintained buildings and we believe that our facilities are adequate for present operations and the foreseeable future. For the fiscal year ended September 30, 2023, our total lease expense was approximately $4.0 million. See Note 6. Leases in Part II of this Annual Report on Form 10-K for additional information. ITEM 3. LEGAL PROCEEDINGS\nAs a commercial enterprise and employer, the Company is subject to various claims and legal actions in the ordinary course of business. These matters can include professional liability, employment-relations issues, workers compensation, tax, payroll and employee-related matters, other commercial disputes arising in the course of its business, and inquiries and investigations by governmental agencies regarding our employment practices or other matters. The Company is not aware of any pending or threatened litigation that it believes is reasonably likely to have a material adverse effect on its results of operations, financial position or cash flows. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nPrincipal Market\nOur common stock is currently traded on The Nasdaq Capital Market under the symbol \"DLHC.\"\nEquity Holders\nAs of September 30, 2023, the number of shareholders of our common stock of record was approximately 88 persons. The number of stockholders of record is not representative of the number of beneficial stockholders due to the fact that many shares are held by depositories, brokers, or nominees.\nDividends\nWe have not declared or paid any cash dividends on its common stock since inception. We do not intend to pay any cash dividends at this time or in the foreseeable future.\nRecent Sales of Unregistered Securities\nNone.\nRepurchase of Equity Securities\nNone.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company presently utilizes one shareholder-approved equity compensation plan under which it makes equity compensation awards available to officers, directors, employees and consultants. The table set forth below discloses outstanding and available awards under our equity compensation plans as of September 30, 2023. All grants of equity securities made to executive officers and directors are presently made under the 2016 Omnibus Equity Incentive Plan (the 2016 Plan). Prior to the adoption of the 2016 Plan, awards of equity securities were made under the 2006 Long Term Incentive Plan.\nEquity Compensation Plan Information\nPlan Category (a)\nNumber of Securities\nto be issued\nupon exercise of\noutstanding options,\nwarrants and rights (b)\nWeighted Average\nexercise price of\noutstanding options,\nwarrants and rights\n(or fair value at\ndate of grant) (c)\nNumber of securities\nremaining available for\nfuture issuances under\nequity compensation\nplans (excluding securities\nreflected in column (a))\nEquity Compensation Plans Approved by Security Holders:\nEmployee stock options 2,278,000 $ 8.40 1,008,676 ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward Looking and Cautionary Statements\nYou should read the following discussion in conjunction with the consolidated financial statements and the notes to those statements included elsewhere in this Annual Report on Form 10-K for the year ended September 30, 2023. This discussion contains certain statements that are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. Certain statements contained in this Managements Discussion and Analysis are forward-looking statements that involve risks and uncertainties. In addition, any statements that refer to expectations, projections or other characterizations of future events or circumstances are forward-looking statements. The forward-looking statements are not historical facts, but rather are based on current expectations, estimates, assumptions and projections about our industry and business. Our actual results could differ materially from the results contemplated by these forward-looking statements.\nBusiness Overview:\nDLH is a holding company operating through a number of operating subsidiaries. In December 2022, we acquired Grove Resource Solutions, LLC (\"GRSi\"), which provides research and development, systems engineering and integration, and digital transformations solutions to federal agencies, notably the National Institutes of Health (\"NIH\"), U.S. Navy and U.S. Marine Corps. We deliver improved health and cyber readiness solutions for federal government customers through digital transformation, science research and development, and systems engineering and integration.\nWe derive 99% of our revenue from agencies of the Federal government, providing services to several agencies including the HHS, VA, DoD, and DHS. The following table summarizes the revenues by customer for the years ended September 30, 2023 and 2022, respectively (in thousands):\n2023 2022\nRevenue Percent of total revenue Revenue Percent of total revenue\nDepartment of Health and Human Services $ 161,311 42.9 % $ 102,201 25.9 %\nDepartment of Veterans Affairs 138,862 37.0 % 126,106 31.9 %\nDepartment of Defense 70,325 18.7 % 33,612 8.5 %\nDepartment of Homeland Security 919 0.2 % 126,576 32.0 %\nCustomers with less than 10% share of total revenue 4,455 1.2 % 6,678 1.7 %\nRevenue\n$ 375,872 100.0 % $ 395,173 100.0 %\nThe following table summarizes revenues by our markets for the years ended September 30, 2023 and 2022, respectively (in thousands):\n2023 2022\nRevenue Percent of total revenue Revenue Percent of total revenue\nDefense and Veteran Health Solutions $ 209,187 55.7 % $ 159,719 40.4 %\nHuman Services and Solutions 110,068 29.3 % 165,970 42.0 %\nPublic Health and Life Sciences 56,617 15.0 % 69,484 17.6 %\nRevenue\n$ 375,872 100.0 % $ 395,173 100.0 %\nForward Looking Business Trends:\nOur mission is to expand our position as a trusted provider of technology-enabled healthcare and public health services, medical logistics, and readiness enhancement services to active duty personnel, veterans, and civilian populations and communities. Our primary focus within the defense agency markets includes cyber security, military service members' and veterans' requirements for telehealth services, behavioral healthcare, medication therapy management, process management, clinical systems support, and healthcare delivery. Our primary focus within the civilian agency markets includes digital transformation, IT modernization, healthcare and social programs delivery and readiness. These include compliance monitoring on large scale programs, technology-enabled program management, consulting, and digital communications solutions ensuring that education, health, and social standards are being achieved within underserved and at-risk populations. We believe these business development priorities will position the Company to expand within top national priority programs and funded areas.\nFederal budget outlook for fiscal year 2024:\nThe Presidents budget proposal for fiscal year (\"FY\") 2024 outlines many initiatives that include investments to rebuild our countrys physical infrastructure, strengthen supply chains, combat inflation, expand economic opportunity, respond to the changing climate, sustain and strengthen national defense, and bolster America's public health infrastructure. Specifically, the investment in public health infrastructure involves improving the nations readiness for future pandemics and other biological threats, expanding access to vaccines and healthcare, and defeating diseases and epidemics such as, but not limited to, the opioid and HIV/AIDS epidemics. The budget's initiatives are further reflected in the budget requests for the HHS, VA, and DoD.\nWhile Congress has not completed the final appropriation bills for the governments 2024 fiscal year, the Company continues to believe that its key programs benefit from bipartisan support and does not expect a material impact on its current business base from budget negotiations. If the appropriations bills are not timely enacted, government agencies operate under a continuing resolution (\"CR\"), which may negatively impact our business due to delays in new program starts, delays in contract award decisions, and other factors. On November 16, 2023, the President signed a CR providing funds to the federal government through January 19, 2024 for several agencies and through February 2, 2024 for the remaining. When a CR expires, unless appropriations bills have been passed by Congress and signed by the President, or a new CR is passed and signed into law, the government must cease operations, or shutdown, except in certain emergency situations or when the law authorizes continued activity. We continuously review our operations in an attempt to identify programs potentially at risk from CRs so that we can consider appropriate contingency plans.\nOur customer's missions have received broad support from the legislative and executive branches of the federal government. As such, we do not anticipate or expect any significant changes to our operations.\nDepartment of Veterans Affairs\nThe VA is requesting a total of $325.1 billion for FY 2024, an increase of $16.6 billion above the FY 2023 enacted level. It includes $142.8 billion in discretionary funding, an increase of $3.0 billion, and $182.3 billion in mandatory funding, an increase of $13.6 billion from FY 2023 enacted. The VA research program is expected to allocate increased funding to advance the Departments understanding of the impact of traumatic brain injury and toxic exposure(s) on long-term health outcomes, coronavirus related research and impacts, and precision oncology. The FY 2024 budget request for the VA's research enterprise is $938.0 million, an increase of $22.0 million from the FY 2023 budget, excluding mandatory funding. In addition, the FY 2024 budget estimates $4.9 billion will be spent on telehealth treatment in FY 2024, an increase of $78.0 million from the FY 2023 estimate. The VA is continuing to expand this program because of its ability to leverage VA providers and provide better services to veterans.\nDepartment of Health and Human Services\nThe FY 2024 budget request proposes $144.3 billion in discretionary budget authority for HHS and $1.7 trillion in mandatory funding for the department. The budget proposes $48.6 million in discretionary and mandatory resources for NIH, an increase of $920.0 million above FY 2023 enacted, to address the opioid crisis and ending HIV crises, make new investments in pandemic preparedness and nutrition research, and drive biomedical innovations. The budget also requests $45.0 million for telehealth, which is an increase of $7.0 million above FY 2023 enacted, to promote health services with telehealth technologies. The budget also provides for investment in programs that improve the health and well-being of young children and their families. This includes $13.1 billion for the Office of Head Start, principally to expand eligibility for participation in the program.\nDepartment of Defense\nThe Military Health System (\"MHS\") is one of the largest health care systems, serving over 9.5 million beneficiaries. As a part of the DoD, the Defense Health Agency (\"DHA\") manages a global health care network of military and civilian medical professionals, military hospitals and clinics around the world, and supports the delivery of integrated health services to MHS beneficiaries. The funding and personnel to support MHSs mission is referred to as the Unified Medical Budget (\"UMB\"). The FY 2024 UMB request for the Defense Health Program (\"DHP\") is $58.7 billion, an increase of 0.5% from FY 2023 enacted. It is anticipated that COVID-19 costs will decrease in FY 2024, driving a reduction in the budget request for DHP In Direct Care and Private Sector Care.\nIndustry consolidation among federal government contractors:\nThere has been active consolidation and a strong increase in merger and acquisition activity among federal government contractors over the past few years that we expect to continue, fueled by public companies leveraging strong balance sheets. Companies often look to acquisitions that augment core capabilities, contracts, customers, market differentiators, stability, cost synergies, and higher margin and revenue streams.\nPotential impact of federal contractual set-aside laws and regulations:\nThe Federal government has an overall goal of 23% of prime contracts flowing through small businesses. As previously reported, various agencies within the federal government have policies that support small business goals, including the adoption of the Rule of Two by the VA, which provides that the agency shall award contracts by restricting competition for the contract to service-disabled or other veteran-owned businesses. To restrict competition pursuant to this rule, the contracting officer must reasonably expect that at least two of these businesses, which are capable of delivering the services, will submit offers and that the award can be made at a fair and reasonable price that offers best value to the U.S, When two qualifying small businesses cannot be identified, the VA may proceed to award contracts following a full and open bid process.\nThe Company believes that its past performance in this market and track record of success provide a competitive advantage. However, the effect of set-aside provisions may limit our ability to compete for prime contractor positions on programs that we recompete or that we have targeted for growth. In these cases, the Company may elect to join a team with an eligible contractor as prime for specific pursuits that align with our core markets and corporate growth strategy.\nResults of Operations\nFiscal Year Ended September 30, 2023 as Compared to Fiscal Year Ended September 30, 2022\nThe following table summarizes, for the years indicated, consolidated statements of operations data expressed (in thousands except for per share amounts, and as percentages of revenue):\nYear Ended September 30,\n2023 2022 Change\nRevenue $ 375,872 100.0 % $ 395,173 100.0 % $ (19,301)\nCost of operations\nContract costs 296,016 78.8 % 322,886 81.8 % (26,870)\nGeneral and administrative costs 37,795 10.1 % 30,730 7.8 % 7,065\nImpairment loss of long-lived asset 7,673 2.0 % - - % 7,673\nCorporate development costs 1,735 0.5 % 614 0.1 % 1,121\nDepreciation and amortization 15,562 4.1 % 7,665 1.9 % 7,897\nTotal operating costs 358,781 95.5 % 361,895 91.6 % (3,114)\nIncome from operations 17,091 4.5 % 33,278 8.4 % (16,187)\nInterest expense 16,271 4.3 % 2,215 0.6 % 14,056\nIncome before provision for income tax (benefit) expense 820 0.2 % 31,063 7.8 % (30,243)\nProvision for income tax (benefit) expense (641) (0.2) % 7,775 2.0 % (8,416)\nNet income $ 1,461 0.4 % $ 23,288 5.8 % $ (21,827)\nNet income per share - basic $ 0.11 $ 1.82 $ (1.71)\nNet income per share - diluted $ 0.10 $ 1.64 $ (1.54)\nRevenue\nFor the year ended September 30, 2023 revenue was $375.9 million, a decrease of $19.3 million or 4.9% over the prior year period. The decrease in revenue is due primarily to the completion of two task orders awarded under a FEMA contract to support Alaska with its response to COVID-19. The revenue contribution from those task orders in fiscal year 2022 was $125.8 million. Included in fiscal 2023 revenue is $107.0 million contributed from GRSi subsequent to the acquisition.\nCost of Operations\nContract costs primarily include the costs associated with providing services to our customers. These costs are generally comprised of direct labor and associated fringe benefit costs, subcontract cost, other direct costs, and the related management and infrastructure costs. For the year ended September 30, 2023, the contract costs decreased as compared to the prior fiscal year by $26.9 million to approximately $296.0 million primarily due to completion of the FEMA task orders, offset by the contribution from the acquisition of GRSi.\nGeneral and administrative costs are for employees and third parties not directly providing services to our customers, including but not limited to executive management, bid and proposal, accounting, and human resources. These costs increased as compared to the prior fiscal year by $7.1 million to approximately $37.8 million primarily due to the acquisition of GRSi.\nImpairment loss of long-lived assets is a loss associated with a reduction of the fair value of an asset during the fourth quarter of fiscal 2023, DLH reduced its leased office space requirement by consolidating underutilized premises as part of a facility rationalization effort, to accurately reflect the operational needs of the business. As a result, the Company has determined that its Right of Use Assets experienced a reduction in fair value below its associated carrying value of $7.7 million.\nCorporate development costs are incremental due diligence costs, such as legal and accounting fees. Fiscal year 2023 and 2022 costs were associated with the acquisition of GRSi.\nFor the year ended September 30, 2023, depreciation and amortization costs were approximately $0.8 million and $14.8 million, respectively, as compared to approximately $1.1 million and $6.6 million, respectively for the prior fiscal year, an aggregate increase of $7.9 million which is primary due to the acquisition of GRSi during the fiscal year.\nInterest Expense\nInterest expense includes items such as interest expense and amortization of deferred financing costs on debt obligations. For the year ended September 30, 2023, interest expense was $16.3 million compared to interest expense, net of $2.2 million in the prior year, an increase of approximately $14.1 million over the prior year period. The increase in interest expense was primarily due to the increase in long-term debt associated with the acquisition of GRSi during the fiscal year.\nProvision for Income Taxes\nProvision for Income taxes for the fiscal year ended September 30, 2023 was a reduction of tax by $0.6 million, a decrease of approximately $8.4 million from the prior fiscal year. The effective tax rate was a negative 72.2% for the fiscal year ending September 30, 2023 and 24.8% for the fiscal year ending September 30, 2022.\nNon-GAAP Financial Measures for Fiscal 2023 and 2022\nThe Company is presenting certain non-GAAP measures regarding its financial performance for the fiscal years ended September 30, 2023 and 2022. The measures presented are Adjusted Revenue, Adjusted Operating Income, Adjusted Net Income, Adjusted Diluted Earnings Per Share (\"EPS\"), Earnings Before Interest Taxes Depreciation and Amortization (EBITDA), EBITDA Margin on Revenue, Adjusted EBITDA, and Adjusted EBITDA Margin on Adjusted Revenue. In calculating these measures, we have added the corporate development costs associated with completing the GRSi acquisition to our results for fiscal year 2023 and 2022, removed the impairment loss on certain real estate assets, and removed the contribution from the FEMA task orders from the results for fiscal year 2022. These resulting measures present our financial performance compared to results delivered in the prior year period. Definitions of these additional non-GAAP measures are set forth below.\nWe have prepared these additional non-GAAP measures to eliminate the impact of items that we do not consider indicative of ongoing operating performance due to their inherently unusual or extraordinary nature. These non-GAAP measures of performance are used by management to conduct and evaluate its business during its review of operating results for the periods presented. Management and the Company's Board utilize these non-GAAP measures to make decisions about the use of the Company's resources, analyze performance between periods, develop internal projections and measure management performance. We believe that these non-GAAP measures are useful to investors in evaluating the Company's ongoing operating and financial results and understanding how such results compare with the Company's historical performance.\nThese supplemental performance measurements may vary from and may not be comparable to similarly titled measures by other companies in our industry. Adjusted Revenue, Adjusted Operating Income, Adjusted Net Income, Adjusted Diluted EPS, EBITDA, Adjusted EBITDA, EBITDA Margin on Revenue, and Adjusted EBITDA Margin on Adjusted Revenue are not recognized measurements under accounting principles generally accepted in the United States, or GAAP, and when analyzing our performance investors should (i) evaluate each adjustment in our reconciliation to the nearest GAAP financial measures and (ii) use the aforementioned non-GAAP measures in addition to, and not as an alternative to, revenue, operating income, net income or diluted EPS, as measures of operating results, each as defined under GAAP. We have defined these non-GAAP measures as follows:\nAdjusted Revenue represents revenue less the contribution to revenue from the short-term FEMA task orders.\nAdjusted Operating Income represents operating income plus the corporate development costs associated with completing the GRSi acquisition in fiscal 2023 and 2022 and the impairment loss on the right of use asset incurred only in fiscal 2023, less the contribution from the FEMA task orders, which occurred only in fiscal 2022.\nAdjusted Net Income represents net income including the corporate development costs associated with completing the acquisition, the impairment loss on the right of use asset, as well as the FEMA task orders.\nAdjusted Diluted EPS represents diluted EPS calculated using Adjusted Net Income as opposed to net income.\n\"EBITDA\" represents net income before income taxes, interest, depreciation and amortization.\nAdjusted EBITDA represents net income before income taxes, interest, depreciation and amortization and the corporate costs associated with completing the acquisition, and the impairment loss on the right of use asset less the contribution from FEMA task orders.\nAdjusted EBITDA Margin on Adjusted Revenue is calculated as Adjusted EBITDA divided by Adjusted Revenue.\nBelow is a reconciliation of Adjusted Revenue, Adjusted Operating Income, Adjusted Net Income, Adjusted Diluted EPS, EBITDA, Adjusted EBITDA, EBITDA Margin on Revenue and Adjusted EBITDA Margin on Adjusted Revenue reported for the fiscal years ended September 30, 2023 and 2022 compared to the most directly comparable financial measure calculated and presented in accordance with GAAP as follows (in thousands, except for per share amounts):\n2023 2022 Change\nAdjusted Revenue\nRevenue $ 375,872 $ 395,173 $ (19,301)\nLess: FEMA task orders to support Alaska (a)\n- 125,773 (125,773)\nAdjusted Revenue $ 375,872 $ 269,400 $ 106,472\nAdjusted Operating Income\nOperating Income $ 17,091 $ 33,278 $ (16,187)\nImpairment loss of long-lived asset (c)\n7,673 - 7,673\nCorporate development costs (b) 1,735 614 1,121\nLess: FEMA task orders to support Alaska (d)\n- 12,479 (12,479)\nAdjusted Operating Income $ 26,499 $ 21,413 $ 5,086\nAdjusted Net income (e)\nNet Income\n$ 1,461 23,288 $ (21,827)\nImpairment loss of long-lived asset (c)\n7,673 - 7,673\nCorporate development costs (b) 1,735 614 1,121\nLess: FEMA task orders to support Alaska (d)\n- 12,479 (12,479)\nAdjustment for tax effect (g)\n(2,993) 3,007 (6,000)\nAdjusted Net Income $ 7,876 $ 14,430 $ (6,554)\nAdjusted Diluted Earnings Per Share (f)\nWeighted average diluted shares outstanding\n14,431 14,179 252\nDiluted earnings per share\n$ 0.10 $ 1.64 $ (1.54)\nAdjusted Diluted Earnings Per Share $ 0.55 $ 1.01 $ (0.46)\nEBITDA, Adjusted EBITDA, EBITDA Margin on Revenue & Adjusted EBITDA Margin on Adjusted Revenue\nNet Income $ 1,461 $ 23,288 $ (21,827)\nInterest expense 16,271 2,215 14,056\nDepreciation and amortization 15,562 7,665 7,897\nProvision for income taxes (641) 7,775 (8,416)\nEBITDA $ 32,653 $ 40,943 $ (8,290)\nCorporate development costs (b) 1,735 614 1,121\nImpairment loss of long-lived asset (c)\n7,673 - 7,673\nLess: FEMA task order to support Alaska (d)\n- 12,479 (12,479)\nAdjusted EBITDA $ 42,061 $ 29,078 $ 12,983\nNet income margin on Revenue 0.4% 5.9%\nEBITDA Margin on Revenue 8.7% 10.4%\nAdjusted EBITDA Margin on Adjusted Revenue 11.2% 10.8%\n(a): Represents revenue adjusted to exclude revenue from the short-term FEMA task orders during the fiscal year ended September 30, 2022.\n(b): Represents corporate development costs we incurred to complete the GRSi transaction. These costs primarily include legal counsel, financial due diligence, customer market analysis and representation and warranty insurance premiums.\n(c): Represents impairment loss of certain long-lived real estate assets associated with a reduction of the fair value of an asset prompted by a triggering event. During the fourth quarter of fiscal 2023, DLH reduced its leased office space requirement by consolidating underutilized premises as part of an ongoing facility rationalization effort, to accurately reflect the operational needs of the business. As a result, the Company has determined that its Right of Use Assets experienced a reduction in fair value below its associated carrying value and recorded a $7.7 million loss of fair value.\n(d):Adjusted operating income represents the Companys consolidated operating income, determined in accordance with GAAP, adjusted to add the corporate development costs associated with the GRSi acquisition for fiscal year 2023, adjusted to add back the impairment loss of certain real estate assets and adjusted to exclude the operating income derived from the FEMA task orders. Operating income for the FEMA task orders for the fiscal year ended September 30, 2022, is derived by subtracting from the revenue attributable to the tasks orders of $125.8 million the following amounts associated with such task orders: contract costs $112.1 million and general & administrative costs of $1.2 million.\n(e) Adjusted net income represents the Companys consolidated net income, determined in accordance with GAAP, adding back the impairment loss of long-lived assets and corporate development costs as defined, less the net income derived from the FEMA task orders. There was no net income derived from the FEMA task orders during the fiscal year ended September 30, 2023. For the fiscal year ended September 30, 2022, net income for the FEMA task orders is derived by subtracting from the revenue attributable to the tasks orders of $125.8 million the following amounts associated with such task orders: contract costs of $112.1 million, general & administrative costs of $1.2 million, and provision for income taxes of $3.2 million.\n(f) Adjusted diluted earnings per share (adjusted diluted EPS) is calculated by adding back the effect on the Company's diluted EPS determined in accordance with GAAP, of the impairment loss of long-lived assets and corporate development costs as defined, as well as their tax effect as defined, and subtracting the effect on diluted EPS for the FEMA task orders.\n(g) Tax effect is the impact the tax expense per the tax provision\nLiquidity and Capital Management\nThe Company generated operating income of approximately $17.1 million and $33.3 million for the years ended September 30, 2023 and 2022, respectively and net income of approximately $1.5 million and $23.3 million for the years ended September 30, 2023 and 2022 respectively. Cash flows from operations totaled approximately $31.0 million and $1.2 million for the years ended September 30, 2023 and 2022, respectively. The increase in cash from operations was principally a result of a decrease in accounts receivable.\nWe used $181.2 million and $0.9 million of cash in investing activities during fiscal years 2023 and 2022, respectively. The cash utilized was predominantly due to the acquisition of GRSi and capital expenditures in fiscal years 2023 and 2022, respectively.\nCash used provided by financing activities during the fiscal year ended September 30, 2023 was approximately $150.2 million and cash used in financing activities during the fiscal year ended September 30, 2022 was $24.2 million, respectively. The cash provided by financial activities during the fiscal year ended September 30, 2023, was primarily due to the debt incurred to finance the acquisition of GRSi during the fiscal year. The activity in the fiscal year ended September 30, 2022 was primarily due to the early repayment of principal on our secured term loan. During the years ended September 30, 2023 and 2022, the Company repaid approximately $20.2 million and $24.8 million of secured term loan principal, respectively. We expect to continue to use the operating cash flow to pay outstanding debt.\nA summary of the change in cash is presented below for the years ended September 30, 2023 and 2022 (in thousands):\n2023 2022\nNet cash provided by operating activities $ 31,033 $ 1,243\nNet cash used in investing activities (181,197) (872)\nNet cash provided by (used in) financing activities 150,151 (24,194)\nNet change in cash $ (13) $ (23,823)\nSources of Cash\nAs of September 30, 2023, our immediate sources of liquidity include cash of approximately $0.2 million, accounts receivable, and access to our secured revolving line of credit. This credit facility provides us with access of up to $70.0 million, subject to certain conditions including eligible accounts receivable. As of September 30, 2023, we had unused borrowing capacity of $32.0 million. The Company's present operating liabilities are largely predictable and consist of vendor and payroll related obligations. We believe that our current investment and financing obligations are adequately covered by cash generated from profitable operations and that planned operating cash flow should be sufficient to support our operations for twelve months from the date of issuance of these consolidated financial statements.\nCredit Facilities\nA summary of our credit facilities as of September 30, 2023 is as follows (in millions):\nLender Arrangement Loan Balance Interest * Maturity Date\nFirst National Bank of Pennsylvania Secured term loan (a) $ 169.8 SOFR1 + 4.1%\nDecember 8, 2027\nFirst National Bank of Pennsylvania Secured revolving line of credit (b) $ 9.5 SOFR1 + 4.1%\nDecember 8, 2027\n1Secured Overnight Financing Rate (\"SOFR\") as of September 30, 2023 was 5.3%.\nOn September 30, 2019, we executed a floating-to-fixed interest rate swap with First National Bank (\"FNB\") as counter party. The notional amount in the floating-to-fixed interest rate swap on September 30, 2023 is $16.2 million and matures in 2024 and the fixed rate of 1.61%. On January 31, 2023, we executed an additional floating-to-fixed interest rate swap with FNB; the notional amount as of September 30, 2023 is $96.0 million, it matures in January 2026, and the fixed rate is 4.10%. The total floating-to-fixed swap balance as of September 30, 2023 is $112.2 million. The remaining outstanding balance of our secured term loan is subject to interest rate fluctuations.\n(a) Represents the principal amounts payable on our secured term loan, which is secured by liens on substantially all of the assets of the Company. The principal of the secured term loan is payable in quarterly installments with the remaining balance due on December 8, 2027.\n(b) The secured revolving line of credit has a ceiling of up to $70.0 million and a maturity date of December 8, 2027. The Company accessed funds from the secured revolving line of credit during the year, but had $9.5 million outstanding balance at September 30, 2023.\nThe secured term loan and secured revolving line of credit are secured by liens on substantially all of the assets of the Company. The provisions of the secured term loan and secured revolving line of credit, including financial covenants, are fully described in Note 8 to the consolidated financial statements.\nContractual Obligations as of September 30, 2023\nPayments Due By Period\nNext 12 2-3 4-5 More than 5\n(Amounts in thousands) Total Months Years Years Years\nDebt obligations $ 179,359 $ 8,313 $ 38,000 $ 133,046 $ -\nFacility operating leases 23,489 3,501 7,962 5,668 6,358\nEquipment operating lease 50 50 - - -\nContractual obligations\n$ 202,898 $ 11,864 $ 45,962 $ 138,714 $ 6,358\nCritical Accounting Policies and Estimates\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S.requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include valuation of goodwill and intangible assets, and stock-based compensation. In addition, the Company estimates overhead charges and allocates such charges throughout the year. Actual results could differ from those estimates.\nRevenue Recognition\nWe recognize revenue over time when there is a continuous transfer of control to our customer. For our U.S. government contracts, this continuous transfer of control to the customer is supported by clauses in the contract that allow the U.S. government to unilaterally terminate the contract for convenience, pay us for costs incurred plus a reasonable profit and take control of any work in process. When control is transferred over time, revenue is recognized based on the extent of progress towards completion of the performance obligation. For service contracts, we satisfy our performance obligations as services are rendered. We use cost-based input and time-based output methods to measure progress.\nFor time-and-materials contracts, revenue is recognized to the extent of billable rates times hours delivered plus materials and other reimbursable costs incurred. Revenue for cost-reimbursable contracts is recorded as reimbursable costs are incurred, including an estimated share of the applicable contractual fees earned. For firm-fixed-price contracts, the consideration received for our performance is set at a predetermined price. Revenue for our firm-fixed-price contracts is recognized over time using a straight-line measure of progress. Contract costs are expensed as incurred. Estimated losses are recognized when identified.\nRefer to Note 5 of the accompanying notes to our consolidated financial statements contained elsewhere in this Annual Report on Form 10-K for discussion relative to the Company's revenue recognition in accordance with ASC-606.\nLong-lived Assets\nOur long-lived assets include equipment and improvements, right-of-use assets, intangible assets, and goodwill. The Company continues to review its long-lived assets for possible impairment or loss of value at least annually or more frequently upon the occurrence of an event or when circumstances indicate that a reporting units carrying amount is greater than its fair value.\nEquipment and improvements are stated at cost, less accumulated depreciation and amortization. Depreciation and amortization are provided using the straight-line method over the estimated useful asset lives (P3Y to P7Y) and the shorter of the initial lease term or estimated useful life for leasehold improvements.\nCosts incurred to place the asset in service are capitalized and costs incurred after implementation are expensed. Amortization expense is recorded when the software is placed in service on a straight-line basis over the estimated useful life of the software.\nRight-of-use assets are measured at the present value of future minimum lease payments, including all probable renewals, plus lease payments made to the lessor before or at lease commencement and indirect costs, less incentives received. Our right-of-use assets include long-term leases for facilities and equipment and are amortized over their respective lease terms.\nIntangible assets are originally recorded at fair value and amortized on a straight-line basis over their assessed useful lives. The assessed useful lives of the assets are P10Y.\nGoodwill\nThe Company continues to review its goodwill for possible impairment or loss of value at least annually or more frequently upon the occurrence of an event or when circumstances indicate that a reporting units carrying amount is greater than its fair value. At September 30, 2023, we performed an internal goodwill impairment evaluation with a qualitative assessment of factors to determine whether it was necessary to perform the goodwill impairment test. Based on the results of the work performed, the Company has concluded that no impairment loss was warranted at September 30, 2023, as no change in business conditions occurred which would have a material adverse effect on the valuation of goodwill.\nProvision for Income Taxes\nThe Company accounts for income taxes in accordance with the liability method, whereby deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities, using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reflected on the consolidated balance sheet when it is determined that it is more likely than not that the asset will be realized. This guidance also requires that deferred tax assets be reduced by a valuation allowance if it is more likely than not that some or all of the deferred tax assets will not be realized. The Company has fully utilized its net operating loss carryforwards.\nStock-based Equity Compensation\nThe Company uses the fair value-based method for stock-based equity compensation. Options issued are designated as either an incentive stock or a non-statutory stock option. No option may be granted with a term of more than P10Y from the date of grant. Option awards may depend on the achievement of certain performance measures determined by the Compensation Committee of our Board. Shares issued upon option exercise are newly issued common shares. All awards to employees and non-employees are recorded at fair value on the date of the grant and expensed over the period of vesting. The Company uses a Monte Carlo method to estimate the fair value of each stock option at the date of grant. Any consideration paid by the option holders to purchase shares is credited to capital stock.\nNew Accounting Pronouncements\nA discussion of recently issued accounting pronouncements is described in Note 3 of the accompanying notes to our consolidated financial statements contained elsewhere in this Annual Report, and we incorporate such discussion by reference. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nExcept as described in this Item 7A, the Company has not engaged in trading practices in securities or other financial instruments and therefore does not have any material exposure to interest rate risk, foreign currency exchange rate risk, commodity price risk or other similar risks, which might otherwise result from such practices. The Company has limited foreign operations and therefore is not materially subject to fluctuations in foreign exchange rates, commodity prices or other market rates or prices from market sensitive instruments. On September 30, 2019, we executed a floating-to-fixed interest rate swap with First National Bank (\"FNB\") as counter party. The notional amount in the floating-to-fixed interest rate swap on September 30, 2023 is $16.2 million and matures in 2024 and the fixed rate of 1.61%. On January 31, 2023, we executed an additional floating-to-fixed interest rate swap with FNB; the notional amount as of September 30, 2023 is $96.0 million, it matures in January 2026, and the fixed rate is 4.10%. The total floating-to-fixed swap balance as of September 30, 2023 is $112.2 million. As interest rates rise due to inflation-related pressures in the economy, we expect to continue to use interest rate swaps to mitigate our cash risk of rising rates. The Company has determined that a 1.0% increase to the SOFR rate would incrementally impact our interest expense by approximately $0.7 million per year. As of September 30, 2023, the interest rate was 9.51%. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTAL DATA\nConsolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID Number 100)\nConsolidated Statements of Operations for the years ended September 30, 2023 and 2022\nConsolidated Balance Sheets as of September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended September 30, 2023 and 2022\nConsolidated Statements of Changes in Shareholders' Equity for the years ended September 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of DLH Holdings Corp.\nOpinion on the Consolidated Financial Statements and Internal Control Over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of DLH Holdings Corp. and Subsidiaries (the Company) as of September 30, 2023 and 2022, the related consolidated statements of operations, cash flows, and changes in shareholders equity for each of the years in the two-year period ended September 30, 2023, and the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Companys internal control over financial reporting as of September 30, 2023, based on the criteria established in 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company and its subsidiaries as of September 30, 2023 and 2022, and the results of their operations and their cash flows for each of the years in the two-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in 2013 Internal Control-Integrated Framework issued by COSO.\nBasis for Opinion\nThe Companys management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying managements report on internal control over financial reporting. Our responsibility is to express an opinion on the Companys consolidated financial statements and an opinion on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that responds to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nWorkers' Compensation Claims Liabilities\nCritical Audit Matter Description\nThe Company uses a combination of insured and self-insurance programs to cover workers compensation claims. Workers compensation claims liability represents managements estimate of future amounts necessary to pay claims and related expenses related to workplace injuries that have occurred as of the balance sheet date. The estimated liability of workers compensation claims is based on an evaluation of information provided by the Companys third-party administrators, coupled with an actuarial estimate of reported and incurred but not reported claims (together, IBNR). The process of arriving at an estimate of unpaid claims and estimated future losses involves a high degree of judgment and is affected by both internal and external events, including the Company's claims experience. The Companys estimates are based on informed judgment, derived from individual experience and expertise applied to multiple sets of data and analyses. Given the high degree of judgment required to estimate the value of the workers compensation claims liabilities, performing audit procedures to evaluate the workers compensation claims liabilities recorded as of September 30, 2023 required an increased audit effort. As a result, we identified the Companys workers compensation claims liability as a critical audit matter because of certain significant assumptions management makes when estimating future incurred, but not reported, claims using both internal and external events to drive the accruals. Auditing these assumptions involved a high degree of judgement and subjectivity as changes in these assumptions could have a significant impact on the accruals recorded to estimate unpaid claims and the related expenses.\nResponse:\nThe following are the primary procedures we performed to address this critical audit matter. We obtained an understanding, evaluated the design and tested the operating effectiveness of the controls over the Companys accounting for workers compensation under accounting principles generally accepted in the United States of America. We assessed whether there were any changes to the Companys estimation process during the current year. We assessed whether any changes in the business or environment, including any changes to claims handling practices, were appropriately considered in the reserve setting process as well. We tested the underlying data that served as inputs into the Companys analysis, including historical claims from third parties and claims paid, to evaluate whether inputs and assumptions were reasonable. We compared managements prior-year assumptions of expected claims development and ultimate loss to actuals incurred during the current year to identify and evaluate potential management bias in the determination of the workers compensation claims liability. We compared prior years' estimated losses to the subsequent actual losses by insurance year to evaluate the Company's estimation process. We tested the mathematical accuracy of the accrual as of September 30, 2023. We reviewed supporting vendor documentation related to the current years base premiums. We analyzed the qualifications of the Companys third-party administrators for their expertise in this area.\nBusiness Combination\nCritical Audit Matter Description\nAs disclosed in Note 4 to the consolidated financial statements, effective December 8, 2022, the Company acquired the business operations of Grove Resource Solutions Inc. (GRSi). The Company applied the acquisition method of accounting for the GRSi business combination. This methodology requires the Company to record assets acquired and liabilities assumed at their respective fair values at the date of acquisition. Any amount of the purchase price paid that is in excess of the estimated fair value of the net assets acquired is recorded as goodwill. We identified the Company's business combination as a critical audit matter because of the significant estimates and judgment used in determining the fair values assigned to acquired assets, especially those utilizing managements assumptions in determining estimated future cash flows, and the significant auditor effort to audit these assumptions. The Company determines fair value using widely accepted valuation techniques, primarily discounted cash flow models and market-multiple analyses. These types of analyses require assumptions and estimates regarding industry and economic factors, the profitability of future business strategies, discount rates, weighted average cost of capital, weighted average return analysis, contributory asset charges, as well as future revenue, including revenue growth rates, gross margins, operating expenses, and cash flows.\nResponse:\nThe following are the primary procedures we performed to address this critical audit matter. We obtained an understanding, evaluated the design and tested the operating effectiveness of the controls over the Companys accounting for the business combination under accounting principles generally accepted in the United States of America, and tested the estimates of the fair value of the acquired assets and assumed liabilities. We determined that the business combination was accounted for in accordance with accounting principles generally accepted in the United States of America. We obtained a schedule of, and related documentation for, the allocation of the purchase price to the assets acquired and liabilities assumed, including amounts assigned to goodwill and intangible assets, and performed a test of details on the underlying key data and information related to the business combination and fair value estimates. We evaluated the appropriateness of specific key inputs supporting managements estimates, comprising estimated future revenue, including revenue growth rates, gross margins, operating expenses, and cash flows. Additionally, with the assistance of our internal valuation specialists, we evaluated the appropriateness of unobservable inputs such as weighted average cost of capital, weighted average return analysis, discount rates, and contributory asset charges.\n/s/ WithumSmith+Brown, PC\nWe have served as the Company's auditor since 2007.\nEast Brunswick, New Jersey\nDecember 6, 2023\nPCAOB ID Number 100\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands except per share amounts)\nYear Ended\nSeptember 30,\n2023 2022\nRevenue $ 375,872 $ 395,173\nCost of Operations\nContract costs 296,016 322,886\nGeneral and administrative costs 37,795 30,730\nImpairment loss of long-lived asset 7,673 -\nCorporate development costs 1,735 614\nDepreciation and amortization 15,562 7,665\nTotal operating costs 358,781 361,895\nIncome from operations 17,091 33,278\nInterest expense 16,271 2,215\nIncome before provision for income taxes 820 31,063\nProvision for income tax (benefit) expense (641) 7,775\nNet income $ 1,461 $ 23,288\nNet income per share - basic $ 0.11 $ 1.82\nNet income per share - diluted $ 0.10 $ 1.64\nWeighted average common shares outstanding\nBasic 13,704 12,830\nDiluted 14,431 14,179\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(Amounts in thousands except par value of shares)\nSeptember 30,\n2023 September 30,\nASSETS\nCurrent assets:\nCash $ 215 $ 228\nAccounts receivable 59,119 40,496\nOther current assets 3,067 2,878\nTotal current assets 62,401 43,602\nGoodwill 138,161 65,643\nIntangible assets, net 124,777 40,884\nOperating lease right-of-use assets 9,656 16,851\nDeferred taxes, net 3,070 -\nEquipment and improvements, net 1,590 1,704\nOther long-term assets 186 328\nTotal assets $ 339,841 $ 169,012\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable and accrued liabilities $ 29,704 $ 26,862\nDebt obligations - current, net of deferred financing costs 17,188 -\nAccrued payroll 13,794 9,444\nOperating lease liabilities - current 3,463 2,235\nOther current liabilities 638 -\nTotal current liabilities 64,787 38,541\nLong-term liabilities:\nDebt obligations - long-term, net of deferred financing costs 155,147 20,416\nOperating lease liabilities - long-term 15,908 16,461\nDeferred taxes, net - 1,534\nOther long-term liabilities 1,560 -\nTotal long-term liabilities 172,615 38,411\nTotal liabilities 237,402 76,952\nShareholders' equity:\nCommon stock, $0.001 par value; authorized 40,000 shares; issued and outstanding 13,950 and 13,047 at September 30, 2023 and 2022, respectively\n14 13\nAdditional paid-in capital 99,974 91,057\nRetained earnings 2,451 990\nTotal shareholders equity 102,439 92,060\nTotal liabilities and shareholders' equity $ 339,841 $ 169,012\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Amounts in thousands)\nYear Ended\nSeptember 30,\n2023 2022\nOperating activities\nNet income $ 1,461 $ 23,288\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 15,562 7,665\nAmortization of deferred financing costs charged to interest expense 2,182 664\nStock-based compensation expense 1,922 2,608\nDeferred taxes, net (4,604) 358\nImpairment loss of long-lived asset 7,673 -\nChanges in operating assets and liabilities\nAccounts receivable 6,845 (7,049)\nOther assets 1,757 1,387\nAccrued payroll (3,477) 319\nDeferred revenue - (22,273)\nAccounts payable and accrued liabilities (75) (5,855)\nOther liabilities 1,787 131\nNet cash provided by operating activities 31,033 1,243\nInvesting activities\nBusiness acquisition, net of cash acquired (180,572) -\nPurchase of equipment and improvements (625) (872)\nNet cash used in investing activities (181,197) (872)\nFinancing activities\nProceeds from revolving line of credit 205,268 -\nRepayment of revolving line of credit (195,721) -\nProceeds from debt obligations 168,000 17,000\nRepayments of debt obligations (20,188) (41,750)\nPayments of deferred financing costs (7,666) -\nProceeds from issuance of common stock upon exercise of options and warrants 1,108 837\nPayment of tax obligations resulting from net exercise of stock options (650) (281)\nNet cash provided by (used in) financing activities 150,151 (24,194)\nNet change in cash (13) (23,823)\nCash - beginning of year 228 24,051\nCash - end of year $ 215 $ 228\nSupplemental disclosures of cash flow information\nCash paid during the year for interest $ 14,153 $ 1,528\nCash paid during the year for income taxes $ 5,604 $ 9,282\nSupplemental disclosures of non-cash activity\nCommon stock surrendered for the exercise of stock options $ 238 $ 256\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS' EQUITY\nFor the years ended September 30, 2023 and 2022\n(Amounts in thousands)\nCommon Stock Additional\nPaid-In\nCapital Retained Earnings (Accumulated\nDeficit) Total Shareholders' Equity\nShares Amount\nYear Ended September 30, 2023\nBalance at September 30, 2022\n13,047 $ 13 $ 91,057 $ 990 $ 92,060\nIssuance and fair value adjustment of common stock in business combination 527 1 6,538 - 6,539\nExpense related to director restricted stock units - - 718 - 718\nExpense related to employee stock-based compensation - - 1,204 - 1,204\nStock issued for director restricted stock units 50 - - -\nExercise of stock options 393 - 1,107 - 1,107\nCommon stock surrendered for the exercise of stock options (67) - (650) - (650)\nNet income - - - 1,461 1,461\nBalance at September 30, 2023\n13,950 $ 14 $ 99,974 $ 2,451 $ 102,439\nCommon Stock Additional\nPaid-In\nCapital Accumulated\nDeficit Total Shareholders' Equity\nShares Amount\nYear Ended September 30, 2022\nBalance at September 30, 2021\n12,714 $ 13 $ 87,893 $ (22,298) $ 65,608\nExpense related to director restricted stock units - - 648 - 648\nExpense related to employee stock options - - 1,960 - 1,960\nStock issued for director restricted stock units 53 - - - -\nExercise of stock options 257 - 637 - 637\nCommon stock surrendered for the exercise of stock options (31) - (281) - (281)\nExercise of stock warrants 54 - 200 - 200\nNet income - - - 23,288 23,288\nBalance at September 30, 2022\n13,047 $ 13 $ 91,057 $ 990 $ 92,060\nThe accompanying notes are an integral part of these consolidated financial statements.\nDLH HOLDINGS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSeptember 30, 2023\n1. Basis of Presentation and Principles of Consolidation\nThe accompanying consolidated financial statements include the accounts of DLH Holdings Corp. and its subsidiaries (\"DLH\" or the \"Company\" and also referred to as \"we,\" \"us,\" and \"our\"), all of which are wholly-owned. All significant intercompany balances and transactions have been eliminated in consolidation. The accompanying financial statements have been prepared in accordance with U.S. generally accepted accounting principles (\"GAAP\") and with the instructions to Form 10-K, Regulation S-X, and Regulation S-K.\n2. Significant Accounting Policies\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting periods. The most significant of these estimates and assumptions relate to costs including overhead and its allocation, assessing fair value of acquired assets and liabilities accounted for through business acquisitions, valuing and determining the amortization periods for long-lived intangible assets, interest rate swaps, stock-based compensation, right-of-use assets and leases liabilities, and loss development on workers' compensation claims. We evaluate these estimates and judgments on an ongoing basis and base our estimates on historical experience, current and expected future outcomes, third-party evaluations, and various other assumptions that we believe are reasonable under the circumstances. The results of these estimates form the basis for making judgments about the carrying values of assets and liabilities as well as identifying and assessing the accounting treatment with respect to commitments and contingencies. We revise material accounting estimates if changes occur, such as more experience is acquired, additional information is obtained, or there is new information on which an estimate was or can be based. Actual results could differ from those estimates.\nRevenue\nThe Company's revenues from contracts with customers are derived from offerings that include technology-enabled business process outsourcing, program management solutions, and public health research and analytics, substantially within the U.S. government and its agencies. The Company has various types of contracts including time-and-materials contracts, cost-reimbursable contracts, and firm-fixed-price contracts.\nWe consider a contract with a customer to exist when there is a commitment by both parties (customer and Company), payment terms are determinable, there is commercial substance, and collectability is probably in accordance with Accounting Standards Codification (\"ASC\") No. 606, \"Revenue from Contracts with Customers\" (\"Topic 606\").\nWe recognize revenue over time when there is a continuous transfer of control to our customer as performance obligations are satisfied. For our U.S. government contracts, this continuous transfer of control to the customer is transferred over time and revenue is recognized based on the extent of progress toward completion of the performance obligation. We consider control to transfer when we have a right to payment. In some instances, the Company commences providing services prior to formal approval to begin work from the customer. The Company considers these factors, the risks associated with commencing work, and legal enforceability in determining whether a contract exists under Topic 606.\nContract modification can occur throughout the life of the contract and can affect the transaction price, extend the period of performance, adjust funding, or create new performance obligations. We review each modification to assess the impact of these contract changes to determine if it should be treated as part of the original performance obligation or as a separate contract. Contract modifications impact performance obligations when the modification either creates new or changes the existing enforceable rights and obligations. The effect of a contract modification on the transaction price and our measure of progress for the performance obligation to which it relates is recognized as an adjustment to revenue and profit cumulatively. Furthermore, a significant change in one or more estimates could affect the profitability of our contracts. We recognize adjustments in estimated profit on contracts in the period identified.\nFor service contracts, we satisfy our performance obligations as services are rendered. We use cost-based input and time-based output methods to measure progress based on the contract type.\nTime and material - We bill the customer per labor hour and per material, and revenue is recognized in the amount invoiced as the amount corresponds directly to the value of our performance to date. Revenue is recognized to the extent of billable rates times hours delivered plus materials and other reimbursable costs incurred.\nCost reimbursable - We record reimbursable costs as incurred, including an estimated share of the contractual fee earned.\nFirm fixed price - We recognize revenue over time using a straight-line measure of progress.\nContract costs generally include direct costs such as labor, materials, subcontract costs, and indirect costs identifiable with or allocable to a specific contract. Costs are expensed as incurred and include an estimate of the contractual fees earned. Contract costs incurred for U.S. government contracts, including indirect costs, are subject to audit and adjustment by various government audit agencies. Historically, our adjustments have not been material.\nContract assets - Amounts are invoiced as work progresses in accordance with agreed-upon contractual terms. In part, revenue recognition occurs before we have the right to bill, resulting in contract assets. These contract assets are reported within Accounts receivable, net on our consolidated balance sheets and are invoiced in accordance with payment terms defined in each contract. Period end balances will vary from period to period due to agreed-upon contractual terms.\nContract liabilities - Amounts are a result of billings in excess of costs incurred or prepayment for services to be rendered.\nFair Value of Financial Instruments\nThe carrying amounts of the Company's cash and cash equivalents, accounts receivable, contract assets, contract liabilities, accrued expenses, and accounts payable approximate fair value due to the short-term nature of these instruments. The fair values of the Company's debt instruments approximate fair value because the underlying interest rates approximate market rates that the Company could obtain for similar instruments at the balance sheet dates.\nLong-lived Assets\nOur long-lived assets include equipment and improvements, intangible assets, right-of-use assets, and goodwill. The Company continues to review its long-lived assets for possible impairment or loss of value at least annually or more frequently upon the occurrence of an event or when circumstances indicate that a reporting units carrying amount is greater than its fair value.\nEquipment and improvements are stated at cost. Depreciation and amortization are provided using the straight-line method over the estimated useful asset lives (3 to 7 years) and the shorter of the initial lease term or estimated useful life for leasehold improvements. Intangible assets (other than goodwill) are originally recorded at fair value and are amortized on a straight-line basis over their estimated useful lives of 10 years. Maintenance and repair costs are expensed as incurred.\nRight-of-use assets are measured at the present value of future minimum lease payments, including all probable renewals, plus lease payments made to the lessor before or at lease commencement and indirect costs paid, less incentives received. Our right-of-use assets include long-term leases for facilities and equipment and are amortized over their respective lease terms. Our right-of-use-assets are recognized as the present value of the future minimum lease payments over the lease term less unamortized lease incentives and the balance remaining in deferred rent liability under ASC 840.\nLease Liabilities\nThe Company has leases for facilities and office equipment. Our lease liabilities are recognized as the present value of the future minimum lease payments over the lease term. Our lease payments consist of fixed and in-substance fixed amounts attributable to the use of the underlying asset over the lease term. Variable lease payments that do not depend on an index rate or are not in-substance fixed payments are excluded in the measurement of right-of-use assets and lease liabilities and are expensed in the period incurred. The incremental borrowing rate on our secured term loan is used in determining the present value of future minimum lease payments. Some of our lease agreements include options to extend the lease term or terminate the lease. These options are accounted for in our right-of-use assets and lease liabilities when it is reasonably certain that the Company will extend the lease term or terminate the lease. The Company does not have any finance leases. As of September 30, 2023, operating leases for facilities and equipment have remaining lease terms of less than 1 year to 8 years.\nGoodwill\nAt September 30, 2023, we performed an internal goodwill impairment evaluation on the year-end carrying value of approximately $138.2 million. We performed a qualitative assessment of factors to determine whether it was necessary to perform the goodwill impairment test. Based on the results of the work performed, the Company has concluded that no impairment loss was warranted at September 30, 2023, as no change in business conditions occurred which would have a material adverse effect on the valuation of goodwill. Notwithstanding this evaluation, factors including non-renewal of a major contract or other substantial changes in business conditions could have a material adverse effect on the valuation of goodwill in future periods and the resulting charge could be material to future periods results of operations. Similarly, there were no impairments during the prior year ended September 30, 2022.\nProvision for Income Taxes\nThe Company accounts for income taxes in accordance with the asset and liability method, whereby deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities, using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reflected on the consolidated balance sheet when it is determined that it is more likely than not that the asset will be realized. This guidance also requires that deferred tax assets be reduced by a valuation allowance if it is more likely than not that some or all of the deferred tax assets will not be realized. We account for uncertain tax positions by recognizing the financial statement effects of a tax position only when, based upon the technical merits, it is more-likely-than-not that the position will be sustained upon examination. We had no uncertain tax positions at either September 30, 2023 and 2022. We report interest and penalties as a component of provision for income taxes. For the years ended September 30, 2023 and 2022, we recognized no interest and no penalties related to income taxes.\nStock-based Compensation\nThe Company uses the fair value-based method for stock-based equity compensation. Options issued are designated as either an incentive stock or a non-statutory stock option. No option may be granted with a term of more than 10 years from the date of grant. Option awards may depend on the achievement of certain performance measures determined by the Compensation Committee of our Board. Shares issued upon option exercise are newly issued common shares. All awards to employees and non-employees are recorded at fair value on the date of the grant and expensed over the period of vesting. The Company uses the Monte Carlo method to estimate the fair value of each stock option at the date of grant. Any consideration paid by the option holders to purchase shares is credited to capital stock.\nStock-based Compensation Expense\nStock-based Compensation expense for the portion of equity awards for which the requisite service has not been rendered is recognized as the requisite service is rendered. The stock-based compensation expense for that portion of awards has been based on the grant-date fair value of those awards as calculated for recognition purposes under applicable guidance. For options that vest based on the Companys common stock achieving and maintaining defined market prices, the Company values the awards with a Monte Carlo method that utilizes various probability factors and other criterion in establishing fair value of the grant. The related stock-based compensation expense is recognized over the service period. Stock based compensation is reliant on continued employment with the Company. These arrangements are forfeited upon employee separation and accounted for as they occur.\nCash and Cash Equivalents\nWe consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. We maintain cash balances at financial institutions that are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250,000. Deposits held with financial institutions may exceed the $250,000 limit.\nReceivables\nReceivables include amounts billed and currently due from customers where the right to consideration is unconditional and amounts unbilled. Both billed and unbilled amounts are non-interest bearing, unsecured, and recognized at an estimated realizable value that include costs and fees, and are generally expected to be billed and received within a single year. We evaluate our receivables for expected credit losses and estimate expected credit losses if appropriate based on customers collections. No allowance for doubtful accounts was deemed necessary at either September 30, 2023 or September 30, 2022.\nEarnings Per Share\nBasic earnings per share is calculated by dividing income available to common shareholders by the weighted average number of common stock outstanding and restricted stock grants that vested or are likely to vest during the period. Diluted earnings per share is calculated by dividing income available to common shareholders by the weighted average number of basic common shares outstanding, adjusted to reflect potentially dilutive securities. Diluted earnings per share is calculated using the treasury stock method.\nTreasury Stock\nThe Company periodically purchases its own common stock that is traded on public markets as part of announced stock repurchase programs. The repurchased common stock is classified as treasury stock on the consolidated balance sheets and held at cost. As of September 30, 2023 and 2022, the Company did not hold any treasury stock.\nPreferred Stock\nOur certificate of incorporation authorizes the issuance of \"blank check\" preferred stock with such designations, rights and preferences as may be determined from time to time by our board of directors up to an aggregate of 5,000,000 shares of preferred stock. As of September 30, 2023 and 2022, the Company has not issued any preferred stock.\nInterest Rate Swap\nThe Company uses derivative financial instruments to manage interest rate risk associated with its variable debt. The Company's objective in using these interest rate derivatives is to manage its exposure to interest rate movements and reduce volatility of interest expense. The gains and losses due to changes in the fair value of the interest rate swap agreements completely offset changes in the fair value of the hedged portion of the underlying debt. Offsetting changes in fair value of both the interest rate swaps and the hedged portion of the underlying debt are recognized in interest expense in the consolidated statements of operations. The Company does not hold or issue any derivative instrument for trading or speculative purposes.\nRisks & Uncertainties\nManagement evaluates the impact of global markets and economic factors on our industry and the potential for adverse effects on the Company's consolidated financial position and its operations. As of September 30, 2023, there was no indication of any global or economic impacts to our industry.\n3. New Accounting Pronouncements\nIn March 2020 and January 2021, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2020-04, \"Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting and ASU No. 2021-01, Reference Rate Reform (Topic 848): Scope, respectively (collectively, Topic 848). Topic 848 provides optional expedients and exceptions for applying GAAP to contracts, hedging relationships and other transactions that reference the London Interbank Offered Rate (LIBOR) or another reference rate expected to be discontinued because of reference rate reform. In December 2022, FASB issued ASU 2022-06 \"Reference Rate Reform (Topic 848): Deferral of the Sunset Date of Topic 848\" which defers the end date for electing the relief provided in Topic 848 from December 31, 2022 to December 31, 2024. In the first quarter of fiscal 2023, the Company adopted the optional expedients and exceptions provided in Topic 848. The adoption did not have a material impact on the Companys consolidated financial statements. DLH adopted the standard in fiscal year 2023 by virtue of the loan modification on December 8, 2022 that converted the basis of the interest rate from LIBOR to Secured Overnight Financing Rate (\"SOFR\"). DLH had no other contracts or offerings that used LIBOR as a basis for rates.\n4. Business Combination\nAcquisition of Grove Resource Solutions, LLC\nOn December 8, 2022, the Company acquired 100% of the equity interests of GRSi for a purchase price of $188 million, inclusive of the working capital adjustment completed and paid. The acquisition was financed through a combination of:\nborrowings of $181.5 million under the Companys amended and restated credit facility; and\ncommon stock issued of approximately 0.5 million shares, which were valued at $6.5 million in the aggregate, based on the shares issued to the previous owners as determined by the equity purchase agreement and the stock price on the acquisition date.\nThe acquisition of GRSi was consistent with the Companys growth strategy, as it provided contract diversification, expansion of key capabilities and increased presence in the military health market. The goodwill derived from this transaction is primarily due to these attributes.\nThe Company has used the acquisition method of accounting for this transaction, whereby the assets acquired and liabilities assumed are recognized based upon their estimated fair values at the acquisition date.\nThe purchase price for GRSi was $188 million adjusted to reflect acquired cash, assumed liabilities and net working capital adjustments.\nThe Purchase Agreement contains customary representations, warranties and covenants by the parties. Subject to certain limitations and conditions, the seller and the equity holders of the seller do not have indemnity obligation for damages resulting from breaches or inaccuracies of the representations, warranties, and covenants of the seller, GRSi and the equity holders as set forth in the Purchase Agreement. The Purchase Agreement also provided for the establishment of an escrow account in order to satisfy (i) any downward adjustment of the purchase price base on GRSi's net working capital at the closing and (ii) certain specified indemnification obligations of the seller and equity holders that may arise following the closing. The escrow account is funded by an aggregate amount of approximately $4.3 million and the stock consideration. A representations and warranties insurance policy has been purchased by the Company in connection with the Purchase Agreement, under which the Company may seek recourse for breaches of the representations and warranties of the seller, GRSi and the equity holders. The representations and warranties insurance policy is subject to certain customary exclusions and a deductible.\nIn accordance with ASU 2017-01, the Company evaluated the transaction as an acquisition of a business. The Company has assessed the acquisition price to the fair value of the assets and liabilities of GRSi at the acquisition date. We accounted for the total acquisition consideration and allocation of fair value of the related assets and liabilities at December 8, 2022 as follows (in thousands):\nPurchase price for GRSi $ 187,997\nPurchase price allocation:\nCash 747\nAccounts receivable 25,468\nOther current assets 1,354\nEquipment and improvements, net 463\nIntangible assets 98,688\nAccounts payable and accrued expenses (2,449)\nPayroll liabilities (7,826)\nOther current liabilities (325)\nOther long-term assets and liabilities (781)\nIdentifiable net assets acquired\n115,339\nGoodwill $ 72,658\nAll operating units are aggregated into a single reportable segment. The acquisition of GRSi did not create an additional reportable segment as all operations report to a single Chief Operating Decision Maker (CODM), serve a similar customer base, and provide similar services within a common regulatory environment. The goodwill represents intellectual capital and the acquired workforce, of which both do not qualify as a separate intangible asset.\nDuring the year ended September 30, 2023, following the completion of the acquisition, GRSi contributed approximately $107.0 million of revenue and $4.4 million of income from operations, which includes $8.2 million of non-cash intangible asset amortization expense.\nThe unaudited pro forma information below is presented for informational purposes only and is not necessarily indicative of our results if the acquisition had taken place on that date. The pro forma information was prepared by combining our reported historical results with the historical results of GRSi for the pre-acquisition periods. In addition, the reported historical amounts were adjusted for the following items, net of associated tax effects:\nThe impact of recording GRSi's intangible asset amortization.\nThe impact of interest expense for the new credit facility.\nThe removal of legacy GRSi director's fees.\nThe removal of transaction costs for the acquisition incurred by GRSi.\nThe following table presents certain unaudited results for the year ended September 30, 2023 as though the acquisition of GRSi had occurred on October 1, 2022 (in thousands):\nTwelve Months Ended\nSeptember 30,\nPro forma results 2023 2022\nRevenue $ 402,958 $ 507,251\nNet income 2,054 18,912\nNumber of shares outstanding - basic 13,704 12,830\nNumber of shares outstanding - diluted 14,431 14,179\nBasic earnings per share $0.15 $1.47\nDiluted earnings per share $0.14 $1.33\n5. Revenue Recognition\nThe following table summarizes the contract balances recognized within the Company's consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nContract assets $ 20,542 $ 7,682\nDisaggregation of revenue from contracts with customers\nWe disaggregate our revenue from contracts with customers by customer, contract type, as well as whether the Company acts as prime contractor or subcontractor. We believe these categories best depict how the nature, amount, timing and uncertainty of our revenue and cash flows are affected by economic factors. The following series of tables presents our revenue disaggregated by these categories:\nRevenue by customer for the years ended September 30, 2023 and 2022 (in thousands):\n2023 2022\nDepartment of Health and Human Services $ 161,311 $ 102,201\nDepartment of Veterans Affairs 138,862 126,106\nDepartment of Defense 70,325 33,612\nDepartment of Homeland Security 919 126,576\nOther 4,455 6,678\nRevenue\n$ 375,872 $ 395,173\nRevenue by contract type for the years ended September 30, 2023 and 2022 (in thousands):\n2023 2022\nTime and Materials $ 209,951 $ 308,944\nCost Reimbursable 81,797 46,231\nFirm Fixed Price 84,124 39,998\nRevenue\n$ 375,872 $ 395,173\nRevenue by whether the Company acts as a prime contractor or a subcontractor for the years ended September 30, 2023 and 2022 (in thousands):\n2023 2022\nPrime Contractor $ 356,792 $ 366,571\nSubcontractor 19,080 28,602\nRevenue\n$ 375,872 $ 395,173\n6. Leases\nThe following table summarizes lease balances presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nOperating lease right-of-use assets (a) $ 9,656 $ 16,851\nOperating lease liabilities, current $ 3,463 $ 2,235\nOperating lease liabilities, long-term 15,908 16,461\nOperating lease liabilities\n$ 19,371 $ 18,696\n(a) Impairment loss of long-lived assets is a loss associated with a reduction of the fair value of an asset prompted by a triggering event. During the fourth quarter of fiscal 2023, DLH reduced its leased office space requirement by consolidating underutilized premises as part of an ongoing facility rationalization effort, to accurately reflect the operational needs of the business. As a result, the Company has determined that its Right of Use Assets experienced a reduction in fair value below its associated carrying value and recorded a $7.7 million loss of fair value.\nFor the years ended September 30, 2023 and 2022, total lease costs for our operating leases are as follows (in thousands):\n2023 2022\nOperating $ 3,911 $ 3,548\nShort-term 287 114\nVariable 95 120\nSublease income (a) (282) (258)\nLease costs\n$ 4,011 $ 3,524\n(a): The Company subleases a portion of one of its leased facilities. The sublease is classified as an operating lease with respect to the underlying asset. The sublease term is 5 years and includes two additional 1-year term extension options.\nThe Company's future minimum lease payments as of September 30, 2023 are as follows (in thousands):\nFor the Fiscal Year Ending September 30,\n2024 $ 4,612\n2025 3,928\n2026 3,700\n2027 2,627\n2028 2,377\nThereafter 6,295\nTotal future minimum lease payments $ 23,539\nLess: imputed interest (4,168)\nPresent value of future minimum lease payments $ 19,371\nLess: current portion of operating lease liabilities (3,463)\nLong-term operating lease liabilities $ 15,908\nAt September 30, 2023, the weighted-average remaining lease term and weighted-average discount rate are 6.3 years and 6.3%, respectively. The calculation of the weighted-average discount rate was determined based on borrowing terms from our secured term loan.\nOther information related to our leases is as follows for the years ending September 30, 2023 and 2022 (in thousands):\n2023 2022\nCash paid for amounts included in the measurement of lease liabilities $ 4,468 $ 3,411\nNew lease liabilities, net of new right-of-use-assets 120 -\nOther lease information\n$ 4,588 $ 3,411\n7. Supporting Financial Information\nAccounts receivable\nThe following table summarizes accounts receivable presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nBilled receivables $ 38,577 $ 32,814\nContract assets 20,542 7,682\nAllowance for doubtful accounts - -\nAccounts receivable $ 59,119 $ 40,496\nOther current assets\nThe following table summarizes other current assets presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nPrepaid licenses and other expenses $ 1,330 $ 1,196\nPrepaid insurance and benefits 743 737\nOther receivables 994 945\nOther current assets $ 3,067 $ 2,878\nGoodwill\nThe change in the carrying amount of goodwill as follows presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\nBalance at September 30, 2022 $ 65,643\nIncrease from GRSi acquisition (a) 72,658\nTax Adjustment GRSI acquisition (140)\nGoodwill\n$ 138,161\nRef (a); The Company has completed its valuation assessment of the GRSi acquisition. Please refer to Note 4 for more information.\nIntangible assets, net\nThe following table summarizes intangible assets, net presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nIntangible assets\nCustomer contracts and related customer relationships $ 113,622 $ 47,044\nBacklog 37,249 15,237\nTrade names 13,034 3,051\nCovenants-not-to-compete 637 522\nTotal intangible assets $ 164,542 $ 65,854\nLess accumulated amortization:\nCustomer contracts and related customer relationships (29,929) (19,731)\nBacklog (7,273) (3,875)\nTrade names (2,185) (1,048)\nCovenants-not-to-compete (378) (316)\nTotal accumulated amortization $ (39,765) $ (24,970)\nIntangible assets, net $ 124,777 $ 40,884\nTotal amount of amortization expense for each of the years ended September 30, 2023 and 2022 was $14.8 million and $6.6 million, respectively.\nAs of September 30, 2023, the estimated annual amortization expense is as follows (in thousands):\nFor the Fiscal Year Ending September 30,\n2024 $ 16,456\n2025 16,456\n2026 15,721\n2027 14,694\n2028 14,694\nThereafter 46,756\nAmortization expense $ 124,777\nAt September 30, 2023, the weighted-average remaining amortization period in total was 8.3 years. At September 30, 2023, the weighted-average amortization period for customer contracts and related customer relationships, backlog, trade names and covenants-not-to-compete was 8.2 years, 8.3 years, 8.7 years, 6 years, respectively.\nEquipment and improvements, net\nThe following table summarizes equipment and improvements, net presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nFurniture and equipment $ 1,790 $ 893\nComputer equipment and software\n6,479 6,723\nLeasehold improvements 1,614 1,614\nTotal equipment and improvements $ 9,883 $ 9,230\nLess: accumulated depreciation and amortization (8,293) (7,526)\nEquipment and improvements, net $ 1,590 $ 1,704\nDepreciation and amortization was $0.8 million and $1.1 million for the years ended September 30, 2023 and 2022, respectively.\nAccounts payable and accrued liabilities\nThe following table summarizes accounts payable and accrued liabilities presented on our consolidated balance sheets at September 30, 2023and 2022 (in thousands):\n2023 2022\nAccounts payable $ 12,603 $ 11,886\nAccrued benefits 6,414 3,857\nAccrued bonus and incentive compensation 4,719 3,625\nAccrued workers' compensation insurance 2,369 4,880\nAccrued Interest 1,309 -\nOther accrued expenses 2,290 2,614\nAccounts payable and accrued liabilities $ 29,704 $ 26,862\nAccrued payroll\nThe following table summarizes accrued payroll presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nAccrued Leave\n$ 9,621 $ 6,345\nAccrued payroll 2,487 1,946\nAccrued payroll taxes 1,173 411\nAccrued severance 513 742\nAccrued payroll $ 13,794 $ 9,444\nDebt obligations\nThe following table summarizes debt obligations presented on our consolidated balance sheets at September 30, 2023 and 2022 (in thousands):\n2023 2022\nSecured revolving line of credit $ 9,546 $ -\nSecured term loan 169,813 22,000\nLess: unamortized deferred financing costs (7,024) (1,584)\nNet bank debt obligations $ 172,335 $ 20,416\nLess: current portion of debt obligations, net of deferred financing costs (a) (17,188) -\nLong-term portion of debt obligations, net of deferred financing costs $ 155,147 $ 20,416\nAs of September 30, 2023, we have satisfied mandatory principal payments on our secured term loan.\n(a) Current portion comprises term loan amortization of $8.3 million and the $9.5 million outstanding balance on the secured revolving line of credit, net of $7.0 million of unamortized deferred financing costs.\nInterest expense\nThe following table summarizes interest expense presented on our consolidated statements of operations for the years ended September 30, 2023 and 2022 (in thousands):\n2023 2022\nInterest expense (a) $ 14,153 $ 1,574\nInterest income (b) (64) (23)\nAmortization of deferred financing costs (c) 2,182 664\nInterest expense $ 16,271 $ 2,215\n(a): Interest expense on borrowing\n(b): Interest income\n(c): Amortization of expenses related to secured term loan and secured revolving line of credit.\n8. Credit Facilities\nA summary of our credit facilities as of September 30, 2023 and 2022 is as follows (in millions):\n2023 2022\nArrangement Loan Balance Interest Arrangement Loan Balance Interest\nSecured term loan (a) due December 8, 2027\n$ 169.8 SOFR1 + 4.1%\nSecured term loan (a) due September 30, 2025 $ 22.0 LIBOR2 + 2.5%\nSecured revolving line of credit (b) due December 8, 2027\n$ 9.5 SOFR1 + 4.1%\nSecured revolving line of credit (b) due September 30, 2025 $ - LIBOR2 + 2.5%\n1Secured Overnight Financing Rate (\"SOFR\") as of September 30, 2023 was 5.3%.\n2LIBOR rate as of September 30, 2022 was 2.52%.\n(a) Represents the principal amounts payable on our term loan, which is secured by liens on substantially all of the assets of the Company. The principal of the term loan is payable in quarterly installments with the remaining balance due on December 8, 2027.\nOn September 30, 2019, we executed a floating-to-fixed interest rate swap with First National Bank (\"FNB\") as counter party. The notional amount in the floating-to-fixed interest rate swap on September 30, 2023 is $16.2 million and matures in 2024 and the fixed rate of 1.61%. On January 31, 2023, we executed an additional floating-to-fixed interest rate swap with FNB; the notional amount as of September 30, 2023 is $96.0 million, it matures in January 2026, and the fixed rate is 4.10%. The total floating-to-fixed swap balance as of September 30, 2023 is $112.2 million. As a result of entering these agreements, for the twelve months ended September 30, 2023, interest expense has been decreased by approximately $0.9 million.\nThe Credit Agreement requires compliance with a number of financial covenants and contains restrictions on our ability to engage in certain transactions. Among other matters, we must comply with limitations on: granting liens; incurring other indebtedness; maintenance of assets; investments in other entities and extensions of credit; mergers and consolidations; and changes in nature of business. The loan agreement also requires us to comply with certain quarterly financial covenants including: (i) a minimum fixed charge coverage ratio of at least 1.25 to 1.00, and (ii) a total leverage ratio not exceeding the ratio of 4.50:1.00 to 2.00:1.00 through maturity. The total leverage ratio is calculated by dividing the Company's total interest-bearing debt by net income adjusted to exclude (i) interest and other expenses, (ii) provision for or benefit from income taxes, if any, (iii) depreciation and amortization, and (iv) non-cash charges, losses or expenses, including stock-based compensation, and (v) non-recurring charges, losses or expenses to include transaction and non-cash equity expense. We are in compliance with all loan covenants and restrictions as of September 30, 2023.\nWe are required to pay quarterly amortization payments, which commenced in December 2022. The annual amortization amounts are $14.3 million each for fiscal years 2023 and 2024, $19.0 million each for fiscal years 2025 and 2026, and $23.8 million for fiscal year 2027, with the remaining unpaid loan balance due at maturity in December 2027. The quarterly payments are equal installments. The Company made a mandatory payment of $3.6 million and voluntary prepayments of $5.9 million during the quarter ended September 30, 2023 bringing the outstanding principal balance on the secured term loan to $169.8 million. We have satisfied the mandatory principal payment the quarter ended December 31, 2023 and partially satisfied the mandatory prepayment for the quarter ended March 31, 2024.\nIn addition to quarterly payments of the outstanding indebtedness, the loan agreement also requires annual payments of a percentage of excess cash flow, as defined in the loan agreement. The loan agreement states that an excess cash flow recapture payment must be made equal to (a) 75% of the excess cash flow for the immediately preceding fiscal year in which indebtedness to consolidated EBITDA ratio is greater than or equal to 2.50:1.00; (b) 50% of the excess cash flow for the immediately preceding fiscal year in which the funded indebtedness to consolidated EBITDA Ratio is less than 2.50:1.00 but greater than or equal to 1.50:1.00; or (c) 0% of the excess cash flow for the immediately preceding fiscal year in which the funded indebtedness to consolidated EBITDA Ratio is less than 1.50:1.00. In addition, the Company must make additional mandatory prepayment of amounts outstanding based on proceeds received from asset sales and sales of certain equity securities or other indebtedness. Due to the voluntary prepayment of term debt, there was no excess cash flow payment required. For additional information regarding the schedule of future payment obligations, please refer to Note 11 Commitments and Contingencies.\n(b) The secured revolving line of credit has a ceiling of up to $70.0 million; as of September 30, 2023, we had unused borrowing capacity of $32.0 million, which is net of outstanding letters of credit. Borrowing on the secured revolving line of credit is secured by liens on substantially all of the assets of the Company. The Company accessed funds from the secured revolving line of credit during the year, which had a $9.5 million outstanding balance at September 30, 2023. As part of the secured revolving line of credit, the lenders agreed to a sublimit of $10.0 million for letters of credit for the account of the Company, subject to applicable procedures.\n9. Stock-based Compensation and Equity Grants\nStock-based compensation expense\nOptions issued under equity incentive plans were designated as either an incentive stock or a non-statutory stock option. No option was granted with a term of more than 10 years from the date of grant. Exercisability of option awards may depend on achievement of certain performance measures determined by the Compensation Committee of our Board. Shares issued upon option exercise are newly issued shares. As of September 30, 2023, there were 1.0 million shares available for grant.\nTotal stock-based compensation expense, presented in the table below, is recorded in general and administrative expenses included in our consolidated statements of operations for the years ended September 30, 2023 and 2022 (in thousands):\n2023 2022\nDLH employees (a) $ 1,204 $ 1,960\nNon-employee directors (b) 718 648\nStock option expense\n$ 1,922 $ 2,608\n(a): Included in this amount are equity grants of restricted stock units (\"RSU\") to Executive Officers, which were issued in accordance with the DLH long-term incentive compensation policy in this fiscal year, and stock option grants to employees during prior fiscal years. The RSUs issued and outstanding totaled 211,228 and 140,404 at September 30, 2023 and 2022, respectively. During the fiscal year ended September 30, 2023, 197,174 RSUs were granted to Executive Officers. Of the RSUs granted, 141,892 have performance-based vesting criteria and the remaining 55,282 have service-based vesting criteria. At a 50% volatility and assumptions of a 3-year term and the performance vesting criteria results in an indicated a fair value. The RSUs granted during the fiscal year ended September 30, 2023, as follows using the Monte Carlo Method.\nVolatility\n50%\nGrant Date Performance Vesting Base Performance Vesting Criteria (Years) Calculated Fair Value\nJanuary 27, 2023 Revenue Revenue increase at the end of the performance period as compared to the year ended September 30, 2022 3 $ 3.51\nJanuary 27, 2023 Stock price Stock price is at least $33.21 per share average for the 30 days prior to the end of the performance period\n3 $ 2.92\nNotes: Results based on 100,000 simulations\n(b): Equity grants of RSUs were made in accordance with DLH compensation policy for non-employee directors and a total of 50,367 and 53,510 restricted stock units were issued and outstanding at September 30, 2023 and 2022, respectively. These grants have service-based vesting criteria and vest at the end of this fiscal year.\nUnrecognized stock-based compensation expense\nUnrecognized stock-based compensation expense is presented in the table below for the years ending September 30, 2023 and 2022 (in thousands):\n2023 2022\nUnrecognized expense for DLH employees (a) $ 7,107 $ 5,214\nUnrecognized expense\n$ 7,107 $ 5,214\n(a): On a weighted average basis, this expense is expected to be recognized within the next 4.20 years.\nStock option activity for the year ended September 30, 2023:\nThe aggregate intrinsic value in the table below represents the total pretax intrinsic value (i.e., the difference between the Companys closing stock price on the last trading day of the period and the exercise price, times the number of shares) that would have been received by the option holders had all option holders exercised their in the money options on those dates. This amount will change based on the fair market value of the Companys stock. A summary of the Company's stock option awards is as follows:\nWeighted\nWeighted Average\nAverage Remaining Aggregate\nNumber of Exercise Contractual Intrinsic\nShares Price Term Value\n(in thousands) (in years) (in thousands)\nOutstanding, September 30, 2022 2,392 $ 7.05 5.4 $ 13,566\nGranted (a) 470 11.57 - -\nExercised (393) 3.42 - -\nCancelled (191) 9.54 - -\nOutstanding, September 30, 2023 2,278 $ 8.40 5.8 $ 8,693\nVested and exercisable, September 30, 2023 1,608 $ 6.43 4.3 $ 8,648\n(a): Utilizing a volatility of 50% along with assumptions of a 10-year term and the aforementioned 10-day stock price threshold results in an indicated range of value of the options granted during the year ended September 30, 2023, as follows using the Monte Carlo method:\nVesting Expected\nStrike Stock Threshold Term Calculated\nGrant Date Price Price Price (Years) Fair Value\nJanuary 26, 2023 $ 11.66 $ 11.66 $ 15.00 10 $ 7.41\nAugust 31, 2023 $ 11.08 $ 11.08 $ 14.25 10 $ 7.41\nAugust 31, 2023 $ 11.08 $ 11.08 $ 16.50 10 $ 7.41\nNote: Results based on 100,000 simulations\nStock options shares outstanding, vested and unvested for the years ended September 30, 2023 and 2022 (in thousands):\nNumber of Shares\n2023 2022\nVested and exercisable 1,608 2,117\nUnvested (a) 670 275\nOptions outstanding 2,278 2,392\n(a): Certain awards vest upon satisfaction of certain performance criteria.\n10. Earnings Per Share\nBasic earnings per share is calculated by dividing income available to common shareholders by the weighted average number of common shares outstanding and restricted stock grants that vested or are likely to vest during the period. Diluted earnings per share is calculated by dividing income available to common shareholders by the weighted average number of basic common shares outstanding, adjusted to reflect potentially dilutive securities. Diluted earnings per share is calculated using the treasury stock method.\nEarnings Per Share information is presented in the table below for the years ending September 30, 2023 and 2022 (in thousands except for per share amounts):\n2023 2022\nNumerator:\nNet income $ 1,461 $ 23,288\nDenominator:\nDenominator for basic net income per share - weighted-average outstanding shares 13,704 12,830\nEffect of dilutive securities:\nStock options and restricted stock 727 1,349\nDenominator for diluted net income per share - weighted-average outstanding shares $ 14,431 $ 14,179\nNet income per share - basic $ 0.11 $ 1.82\nNet income per share - diluted $ 0.10 $ 1.64\n11. Commitments and Contingencies\nContractual Obligations as of September 30, 2023 (in thousands):\nPayments Due Per Fiscal Year\nTotal 2024 2025 2026 2027 2028 Thereafter\nDebt obligations $ 179,359 $ 8,313 $ 19,000 $ 19,000 $ 23,750 $ 109,296 $ -\nFacility operating leases 23,489 4,560 3,928 3,700 2,627 2,377 6,297\nEquipment operating leases 50 50 - - - - -\nContractual obligations\n$ 202,898 $ 12,923 $ 22,928 $ 22,700 $ 26,377 $ 111,673 $ 6,297\nLegal Proceedings\nAs a commercial enterprise and employer, the Company is subject to various claims and legal actions in the ordinary course of business. These matters can include professional liability, employment-relations issues, workers compensation, tax, payroll and employee-related matters, other commercial disputes arising in the course of its business, and inquiries and investigations by governmental agencies regarding our employment practices or other matters. The Company is not aware of any pending or threatened litigation that it believes is reasonably likely to have a material adverse effect on its results of operations, financial position or cash flows.\n12. Related Party Transactions\nThe Company has determined that for the years ended September 30, 2023 and 2022 and through the filing date of this report, there were no significant related party transactions that have occurred which require disclosure through the date that these consolidated financial statements were issued.\n13. Provision for Income Taxes\nThe significant components of provision for income taxes from continuing operations are summarized as follows for the years ending September 30, 2023 and 2022 (in thousands):\n2023 2022\nCurrent expense $ 3,823 $ 7,351\nDeferred expense (4,464) 424\nIncome tax (benefit) expense $ (641) $ 7,775\nThe following table presents the significant differences between our income taxes at the federal statutory rate and the Company's effective tax rate for continuing operations for the years ending September 30, 2023 and 2022 (in thousands):\n2023 2022\nIncome taxes at the federal statutory rate $ 187 $ 6,523\nState taxes, net (536) 1,158\nOther permanent items (292) 94\nIncome tax (benefit) expense $ (641) $ 7,775\nAn analysis of the Company's deferred tax assets and liabilities at September 30, 2023 and 2022 is as follows (in thousands):\n2023 2022\nDeferred tax assets:\nNet operating loss carry forwards, net $ 855 $ 296\nStock based compensation 708 668\nAccrued compensation 2,094 2,108\nCapitalized transaction costs 973 -\nRight of use asset/liability 1,669 -\nInterest limitation 2,601 -\nTotal deferred tax assets $ 8,900 $ 3,072\nLess: valuation allowance (847) (262)\nTotal deferred tax assets, net $ 8,053 $ 2,810\nDeferred tax liabilities:\nDepreciation on fixed assets (418) (458)\nAmortization on identified intangibles and goodwill (4,050) (3,375)\nAccrued expenses (515) (407)\nRight of use liability - (104)\nTotal deferred tax liabilities $ (4,983) $ (4,344)\nNet deferred tax assets (liabilities) $ 3,070 $ (1,534)\n14. Employee Benefit Plans\nAs of September 30, 2023, the Company maintains a 401(k) Plan (the \"401(k) Plan\"), a defined contribution and supplemental pension plan for the benefit of its eligible employees. The Company may provide a discretionary matching contribution of a participant's elective contributions under the 401(k) Plan. The Company recorded related expense of $2.6 million and $2.2 million for the years ending September 30, 2023 and 2022, respectively. Participants are always fully vested in their elective contributions and vest in Company matching contributions over a four-year period.\n15. Subsequent Events\nManagement has evaluated subsequent events through the date that the Company's consolidated financial statements were issued. Based on this evaluation, the Company has determined that no further subsequent events have occurred which require disclosure through the date that these consolidated financial statements were issued. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur Chief Executive Officer (\"CEO\") and President and Chief Financial Officer (\"CFO\"), after evaluating the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15(e) or 15d-15(e) under the Securities Exchange Act of 1934) as of the end of the period covered by this Annual Report. Based on the evaluation of these controls and procedures, our disclosure controls and procedures were effective at the reasonable assurance level to ensure that information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act of 1934 is (i) recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms and (ii) that such information is accumulated and communicated to our management, including our CEO and President and CFO, to allow timely decisions regarding required disclosure.\nOur management, including our CEO and President and CFO, does not expect that our disclosure controls and procedures or our internal controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected. Our management, however, believes our disclosure controls and procedures are in fact effective to provide reasonable assurance that the objectives of the control system are met.\nManagements Report on Internal Control over Financial Reporting\nOur management, under the supervision of our CEO and CFO, is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. The Company's internal control over financial reporting includes those policies and procedures that:\n(i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the company; and\n(iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company's assets that could have a material effect on the financial statements.\nManagement, including our CEO and CFO, conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this evaluation, management used the 2013 framework on Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on our evaluation under the COSO framework, our management has concluded that our internal control over financial reporting was effective as of September 30, 2023.\nDue to its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nWithumSmith+Brown, PC, an independent registered public accounting firm, has audited the Company's consolidated financial statements and has reported on the Company's internal control over financial reporting as of September 30, 2023. The audit report can be found in Part II, Item 8 of this Annual Report on Form 10-K.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934) identified in connection with the evaluation of our internal control that occurred during the fourth quarter of our fiscal year ended September 30, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nThe Information required by Items 10, 11, 12, 13 and 14 of Part III of Form 10-K has been omitted in reliance on General Instruction G(3) and is incorporated herein by reference to our proxy statement to be filed with the SEC pursuant to Regulation 14A promulgated under the Securities Exchange Act of 1934, as amended, as set forth below: ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item with respect to our executive officers, directors, board committees, and corporate governance matters will be set forth in our definitive Proxy Statement under the captions \"Executive Officers,\" \"Election of Directors,\" and \"Corporate Governance\" of the Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement.\nWe have adopted a written code of business conduct and ethics, which applies to our principal executive officer, principal financial or accounting officer or person serving similar functions and all of our other employees and members of our board of directors. We did not waive any provisions of the code of business ethics during the year ended September 30, 2023. Our code of business conduct and ethics is posted in the investor relations - corporate governance section of our website at www.dlhcorp.com. If we amend, or grant a waiver under, our code of business ethics that applies to our principal executive officer, principal financial or accounting officer, or persons performing similar functions, we intend to post information about such amendment or waiver on our website. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item will be set forth in our definitive Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item will be set forth in our definitive Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item will be set forth in our definitive Proxy Statement, to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item will be set forth in our definitive Proxy Statement under the caption \"Independent Registered Public Accounting Firm\", to be filed within 120 days after the end of the fiscal year covered by this Annual Report on Form 10-K, and is incorporated herein by reference to our Proxy Statement.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements\nThe financial statements and schedules of the Company are included in Part II, Item 8 of this report beginning on page 33.\n(a)(2) Financial Statement Schedule\nAll schedules have been omitted since the required information is not applicable or because the information required is included in the consolidated financial statements or the notes thereto.\n(a)(3) Exhibits\nThe exhibits listed in the Exhibit Index immediately below are filed as part of this Annual Report on Form 10-K or are incorporated by reference herein to the document referenced in brackets following the descriptions of such exhibits.\nExhibit No. Description\n2.1 Equity Purchase Agreement among DLH Holdings Corp., Grove Resource Solutions, LLC, the Equity holders, Omega D and D Corporation, and the Representative of the Equity holders (filed as Exhibit 2.1 to Current Report on Form 8-K filed on December 14, 2022).\n3.1\nAmended and Restated Certificate of Incorporation (filed as Exhibit A to Definitive Proxy Statement dated May 1, 2000 as filed with the Securities and Exchange Commission).\n3.2\nAmended and Restated By-Laws of Registrant adopted as of August 27, 2020 (filed as Exhibit 3.1 to the Current Report on Form 8-K filed August 31, 2020).\n3.3\nAmendment to Amended and Restated Certificate of Incorporation of the Company (filed as Exhibit B to Definitive Proxy Statement dated March 13, 2008 as filed with the Securities and Exchange Commission).\n3.4\nAmendment to Amended and Restated Certificate of Incorporation of the Company filed June 25, 2012 (filed as Exhibit 3.1 to Current Report on Form 8-K filed on June 26, 2012).\n3.5\nAmendment to Amended and Restated Certificate of Incorporation filed February 12, 2015 (filed as Annex A to the Companys Proxy Statement dated December 31, 2014).\n4.1\nSpecimen of the Common Stock Certificate (filed as Exhibit 4.1 to Annual Report on Form 10-K for the fiscal year ended September 30,2017.)\n4.2\nDescription of Securities (filed as Exhibit 4.3 to Annual Report on Form 10-K filed on December 7, 2020).\n10.1\n# Form of Stock Option Award under 2006 Long Term Incentive Plan (filed as Exhibit 10.6 to Quarterly Report on Form 10-Q filed on February 16, 2010).\n10.2\n# 2006 Long Term Incentive Plan, as amended (filed as Annex A to the Companys Proxy Statement dated January 3, 2014).\n10.3\nLease Agreement dated April 27, 2015 between DLH Holdings Corp. and Piedmont Center, 1-4 LLC (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q filed on August 5, 2015)\n10.4\n# 2016 Omnibus Equity Incentive Plan, as amended (incorporated by reference to Appendix A to the Companys definitive Proxy Statement dated January 28, 2021).\n10.5\n# Form of Stock Option Award Agreement under the 2016 Omnibus Equity Incentive Plan (filed as Exhibit 10.8 to Quarterly Report on Form 10-Q filed May 16, 2016).\n10.6\nCredit Agreement among DLH Holdings Corp., DLH Solutions, Inc., Danya International, LLC, Social & Scientific Systems, Inc., First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto (filed as Exhibit 10.1 to Current Report on Form 8-K filed on June 13, 2019).\n10.7\nFirst Amendment to Credit Agreement among DLH Holdings Corp., DLH Solutions, Inc,, Danya International, LLC, Social & Scientific Systems, Inc., First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto (filed as Exhibit 10.1 to Current Report on Form 8-K filed on September 12, 2019).\n10.8\nAmended and Restated Credit Agreement among DLH Holdings Corp., DLH Solutions, Inc., Danya International, LLC, Social & Scientific Systems, Inc., Irving Burton Associates, LLC, First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto (filed as Exhibit 10.1 to Current Report on Form 8-K filed October 6, 2020).\n10.9\nSecond Amended and Restated Credit Agreement among DLH Holdings Corp., DLH Solutions, Inc., Danya International, LLC, Social & Scientific Systems, Inc., Irving Burton Associates, LLC, Grove Resource Solutions, LLC, First National Bank of Pennsylvania, as Administrative Agent and other lenders party thereto.\n10.10\n# Employment Agreement between the Company and Zachary C. Parker dated as of September 30, 2022 (filed as Exhibit 10.1 to Current Report on 8-K filed on October 6, 2022).\n10.11\n# Form of Restricted Stock Unit for non-employee directors under the 2016 Omnibus Equity Incentive Plan.\n10.12\n# Employment Offer Letter between the Company and Jeanine M. Christian (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2020, filed August 5, 2020).\n10.13\n# Change in Control, Severance and Covenant Agreement between the Company and Jeanine M. Christian (filed as Exhibit 10.3 to Quarterly Report on Form 10-Q for the fiscal quarter ended June 30, 2020, filed August 5, 2020).\n10.14\n# Form of Performance Restricted Stock Units granted December 9, 2020 granted under the 2016 Omnibus Equity Incentive Plan (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended December 31, 2020, filed February 2, 2021).\n10.15\n# Employment Offer Letter between the Company and G. Maliek Ferebee (filed as Exhibit 10.20 to Annual Report on Form 10-K for the fiscal year ended September 30, 2021)\n10.16\n# Change in Control, Severance and Covenant Agreement between the Company and G. Maliek Ferebee (filed as Exhibit 10.21 to Annual Report on Form 10-K for the fiscal year ended September 30, 2021)\n10.17 # Form of performance-based restricted stock unit award granted January 27, 2023 (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended March 31, 2023).\n10.18 # Form of time-based restricted stock unit award granted January 27, 2023 (filed as Exhibit 10.1 to Quarterly Report on Form 10-Q for the fiscal quarter ended March 31, 2023).\n10.19 # Employment agreement between the Company and Kathryn M JohnBull dated September 21, 2023 (filed as Exhibit 10.1 to Current Report on Form 8-K filed on September 25, 2023).\n21.00\n* Subsidiaries of Registrants.\n23.10\n* Consent of WithumSmith+Brown, PC\n31.10\n* Certification of Chief Executive Officer pursuant to Section 17 CFR 240.13a-14(a) or 17 CFR 240.15d-14(a).\n31.20\n* Certification of Chief Financial Officer pursuant to Section 17 CFR 240.13a-14(a) or 17 CFR 240.15d-14(a).\n32.10\n* Certification of Chief Executive Officer and Chief Financial Officer pursuant to 17 CFR 240.13a-14(b) or 17 CFR 240.15d-14(b) and Section 1350 of Chapter 63 of Title 18 of the United States Code.\n*\nPolicy Relating to Recovery of Erroneously Awarded Compensation\n101.0 The following financial information from the DLH Holdings Corp. Annual Report on Form 10-K for the fiscal year ended September 30, 2023, formatted in iXBRL (Inline eXtensible Business Reporting Language) and filed electronically herewith: (i) the Consolidated Balance Sheets; (ii) the Consolidated Statements of Operations; (iii) the Consolidated Statements of Cash Flows; (iv) the Consolidated Statements of Changes in Shareholders' Equity and, (v) the Notes to the Consolidated Financial Statements. Filed electronically herewith.\n104.0 Cover Page Interactive Data File. (formatted as Inline XBRL tags and contained in Exhibit 101)\n* Indicates exhibit is filed electronically herewith.\n# Denotes a management contract or compensation plan or arrangement.\nSchedules and other similar attachments have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The registrant hereby undertakes to furnish supplemental copies of any of the omitted schedules and other similar attachments upon request by the SEC.\nSchedules omitted pursuant to Item 601(a)(5) of Regulation S-K. The Company agrees to furnish a copy of any omitted schedule to the Securities and Exchange Commission upon request.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDLH HOLDINGS CORP.\n/s/ KATHRYN M. JOHNBULL\nBy: Kathryn M. JohnBull\nChief Financial Officer\n(Principal Accounting Officer)\nDated: December 6, 2023\n______________________________________________________________________________________________________\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated:\nSignature Capacity Date\n/s/ Frederick G. Wasserman Chairman of the Board December 6, 2023\nFrederick G. Wasserman\n/s/ Judith L. Bjornaas\nDirector December 6, 2023\nJudith L. Bjornaas\n/s/ Martin J. Delaney Director December 6, 2023\nMartin J. Delaney\n/s/ Elder Granger, M.D. Director December 6, 2023\nElder Granger, M.D.\n/s/ Frances Murphy, M.D. Director December 6, 2023\nFrances Murphy, M.D.\n/s/ Austin J. Yerks III Director December 6, 2023\nAustin J. Yerks III\n/s/ Stephen J. Zelkowicz Director December 6, 2023\nStephen J. Zelkowicz\n/s/ Zachary C. Parker Chief Executive Officer, President and Director December 6, 2023\nZachary C. Parker\n/s/ Kathryn M. JohnBull Chief Financial Officer and Principal Accounting Officer December 6, 2023\nKathryn M. JohnBull"
}