{
    "cik": "785786",
    "company": "PLEXUS CORP",
    "filing_type": "10-K",
    "filing_date": "2022-11-18",
    "period_of_report": "2022-10-01",
    "sic": "3672",
    "state_of_inc": "WI",
    "state_location": "WI",
    "fiscal_year_end": "1001",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/785786/0000785786-22-000085-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/785786/000078578622000085/plxs-20221001.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/785786/0000785786-22-000085.txt",
    "filename": "785786_10K_2022_0000785786-22-000085.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nPlexus Corp. and its subsidiaries (together \"Plexus,\" the \"Company,\" \"our\", or \"we\") participate in the Electronic Manufacturing Services (\"EMS\") industry. Since 1979, we have been partnering with companies to create the products that build a better world. We are a global leader with a team of nearly 25,000 individuals focused on providing Design and Development, Supply Chain Solutions, New Product Introduction, Manufacturing and Sustaining Services. We specialize in serving customers in industries with highly complex products and demanding regulatory environments. We deliver customer service excellence to leading global companies in the Industrial, Healthcare/Life Sciences and Aerospace/Defense market sectors by providing innovative, comprehensive solutions throughout the products lifecycle. We provide these innovative solutions to customers in the Americas (\"AMER\"), Asia-Pacific (\"APAC\") and Europe, Middle East and Africa (\"EMEA\") regions.\nOur Vision, Mission and Strategy\nOur vision is to help create the products that build a better world. Our mission is to be the leader in highly complex products and demanding regulatory environments. Our strategy to fulfill our vision and mission remains consistent and can be summarized in four parts: market focus, superior execution, passion meets purpose and discipline by design.\nMarket Focus - We engineer innovative solutions for customers in growth markets and focus on partnering with leading as well as disruptive global companies in the Industrial, Healthcare/Life Sciences and Aerospace/Defense sectors.\nSuperior Execution - Superior execution is foundational to our differentiation. We are dedicated partners to our customers, committed to achieving zero defects and perfect delivery through operational excellence.\nPassion Meets Purpose - Through our collective passion, we drive purpose to our actions and decisions in pursuit of operational excellence. Guided by our values and leadership behaviors, we do the right thing to support our team members, communities and customers.\nDiscipline by Design - Finally, we are committed to delivering shareholder value over the long term through a consistent and disciplined financial model focused on driving industry-leading revenue growth and superior return on invested capital.\nTo deliver on our strategy, we align our operations, processes, workforce and financial metrics to create a high performance, accountable organization with a talented and engaged workforce deeply passionate about driving growth through customer service excellence. We also promote a collaborative, customer-centric culture that continuously evaluates and optimizes our business processes with a goal of creating shareholder value. Finally, we execute to customer-driven and sector-based go-to-market strategies.\nFinancial Model\nOur financial model aligns with our business strategy. Our primary long-term focus is to achieve a 9-12% compounded annual revenue growth rate while earning a return on invested capital (\"ROIC\") of 15%, which would exceed our weighted average cost of capital (\"WACC\") and represent positive economic return. Economic return is the amount by which our ROIC exceeds our WACC, and we believe it is a fundamental driver of shareholder value. We review our internal calculation of WACC annually; for fiscal 2022, our WACC was 9.3%. For more information regarding ROIC and economic return, which are non-GAAP financial measures, refer to \"Managements Discussion and Analysis of Financial Condition - Results of Operations - Return on Invested Capital (\"ROIC\") and economic return\" in Part II, Item 7. For a reconciliation of ROIC and economic return to our financial statements that were prepared using generally accepted accounting principles in the U.S. (\"U.S. GAAP\" or \"GAAP\"), see Exhibit 99.1 to this annual report on Form 10-K, which exhibit is incorporated herein by reference.\nOperations\nPlexus is a Wisconsin-headquartered corporation with nearly 25,000 employees, including over 4,700 engineers and technologists dedicated to product development and design, test equipment development and design, and manufacturing process development and control, all of whom operate from 28 active facilities, totaling approximately 5.1 million square feet. Plexus' facilities are strategically located to support the global supply chain, engineering, manufacturing and sustaining service needs of customers in our targeted market sectors.\nGo-to-Market Strategy\nWe accomplish our go-to-market strategy through the three market sectors we serve, Industrial, Healthcare/Life Sciences and\nAerospace/Defense. Each sector has a market sector vice president, as well as business development and customer management leaders who together oversee and provide leadership to teams that include business development directors, customer managers and directors, supply chain, engineering and manufacturing subject matter experts, and market sector analysts. These teams maintain expertise related to each market sector and execute sector strategies aligned to that markets unique delivery, quality and regulatory requirements.\nOur market sector teams help define Plexus strategy for growth with a particular emphasis on expanding the value-add solutions we offer customers. Our sales and marketing efforts focus on targeting new customers and expanding our engagements with existing customers. We believe our ability to provide a full range of services that complement the entire product lifecycle across a global footprint provides a business advantage.\nSolutions\nWith integrated design and development, supply chain solutions, new product introduction, manufacturing and sustaining services, we proactively tackle tough challenges throughout the product lifecycle. It is how our teams strive to create innovative and efficient paths to get products to market.\nDesign and Development - Plexus was established with engineering as a core competency and has built a reputation for success. Our customers are able to partner with a collaborative team of over 640 development engineers to create new products. Using the same tools and processes throughout our seven Design Centers worldwide, we leverage the latest technology and state-of-the-art design automation methodologies to provide comprehensive new product development and product commercialization solutions.\nSupply Chain Solutions - Delivering an optimal supply chain solution is more than simply getting a product where it needs to be on time. We take a unique approach. Our supply chain experts engage in all of Plexus integrated solutions, working closely with our engineers to identify opportunities for supply chain optimization early in the design stage. At Plexus, we take pride in managing the full supply chain to minimize cost, mitigate risk and provide a flexible, scalable solution for our customers.\nNew Product Introduction - When introducing a new product, customers need to move quickly. Plexus offers a dedicated team focused on decreasing time to market with a full suite of integrated new product introduction services. Through early integration and collaboration, customers can take advantage of Plexus capabilities, such as design for excellence, specialized design of test solutions and rapid prototyping, while the program is advanced by a dedicated Plexus team that supports a transition to volume manufacturing.\nManufacturing - Our approach to manufacturing focuses on innovation, continuous improvement and superior quality and delivery. With a global footprint and scalable operations, we aim to tailor our manufacturing environment to meet each customers needs worldwide. As we strive for zero defects, we empower all employees with the knowledge that exceptional quality begins with each individual member of our team. We believe our capabilities and our culture position us to support the complex technology and regulatory needs of the industries we serve and to provide customers with innovative and dependable manufacturing services.\nSustaining Services - Plexus Sustaining Services is committed to protecting our customers' brand reputation, supporting the success of each customer's product in the marketplace and extending a product's end of life, while helping to minimize the impact of their products on the environment. From influencing a product design, which creates early access for lifecycle extension services and repair, to spare parts management and distribution, depot repair and refurbishment services, Plexus Sustaining Services offers a full range of capabilities in all regions in which we operate.\nWe provide most of our optimized solutions on a turnkey basis, and we typically procure all materials required for product assembly. We provide select services on a consignment basis, meaning the customer supplies the necessary materials and Plexus provides the labor and other services required for product assembly. In addition to manufacturing, turnkey service requires material procurement and warehousing and involves greater resource investments than consignment services. Other than certain test equipment, manufacturing equipment and software used for internal operations, we do not design or manufacture our own proprietary products.\nRegulatory Requirements\nAll Plexus manufacturing and engineering facilities are certified to a baseline Quality Management System standard per ISO9001:2015. We have capabilities to assemble finished medical devices meeting the U.S. Food and Drug Administration's (\"FDA\") Quality Systems Regulation requirements and similar regulatory requirements in other countries.\nWe have additional certifications and/or registrations held by certain facilities in the following regions:\nAMER APAC EMEA\nMedical Standard ISO 13485:2016 X X X\n21 CFR Part 820 (FDA) (Finished Medical) X X X\nJMGP accreditation X X X\nGMP-Korea certification X X\nANVISA accreditation X X X\nNPMA (National Medical Products Administration) registration X\nISO 14001(environmental management) X X X\nISO 45001 (occupational health and safety) X X\nANSI/ESD (Electrostatic Discharge Control Program) S20.20 X X\nITAR (International Traffic and Arms Regulation) self-declaration X\nAerospace Standard AS9100 X X X\nNADCAP certification X X X\nFAR 145 certification (FAA repair station) X\nEASA repair approval X\nATEX/IECEx certification X\nIRIS certification (Railway) X\nISO 50001:2011 (energy management) X\nCustomers and Market Sectors Served\nOur customers range from large multinational companies to smaller emerging technology companies. During fiscal 2022, we served approximately 140 customers. General Electric Company (\"GE\") accounted for 12.9%, 11.2% and 11.7% of our net sales during fiscal 2022, 2021 and 2020, respectively. No other customer accounted for 10.0% or more of our net sales in any of the last three fiscal years. Net sales to our largest customers may vary from time to time depending on the size and timing of customer program commencements, terminations, delays, modifications and transitions. We generally do not obtain firm, long-term purchase commitments from our customers. Customers' forecasts can and do change as a result of changes in their end-market demand and other factors, including global economic conditions. Any material change in forecasts or orders from these major accounts, or other customers, could materially affect our results of operations. The loss of any major customer could have a significant negative impact on our financial results. In addition, as our percentage of net sales to customers in a specific sector becomes larger relative to other sectors, we will become increasingly dependent upon the economic and business conditions affecting that sector. Many of our large customers, including GE, contract with us through multiple independent divisions, subsidiaries, production facilities or locations. We believe that in most cases our sales to any one such division, subsidiary, facility or location are independent of sales to others.\nThe distribution of our net sales by market sectors for the indicated fiscal years is shown in the following table:\nIndustry 2022 2021 2020\nIndustrial* 46% 46% 45%\nHealthcare/Life Sciences 41% 39% 37%\nAerospace/Defense 13% 15% 18%\nTotal net sales 100% 100% 100%\n*Fiscal 2020 has been revised to reflect the consolidation of the Industrial/Commercial and Communications sectors into the Industrial sector in fiscal 2021.\nAlthough our current business development focus is based on our targeted market sectors of Industrial, Healthcare/Life Sciences and Aerospace/Defense, we evaluate our financial performance and allocate our resources geographically (see Note 11 \"Reportable Segments, Geographic Information and Major Customers\" in Notes to Consolidated Financial Statements regarding our reportable segments). Plexus offers a uniform array of services for customers in each market sector and, aside from the specific go-to-market teams, generally we do not dedicate operational equipment, personnel, facilities or other resources to particular market sectors, nor do we internally track our costs and resources per market sector.\nPlexus serves a diverse customer landscape that includes industry-leading, branded product companies, along with other technology pioneering start-ups and emerging companies that may or may not maintain manufacturing capabilities. In addition to prime technology advancements, key government and policy trends impact our business, including FDA approval of new medical devices, defense procurement practices and other government and regulatory processes. Plexus may benefit from increasing trends by original equipment manufacturers to outsource the design, manufacture and service of their products.\nMaterials and Suppliers\nWe typically purchase raw materials, including printed circuit boards and electronic components, from a wide variety of manufacturers and their authorized distributors. Under certain circumstances, we will purchase components from independent distributors, customers or competitors. Many of these raw materials are unique to the designed assembly. By customer agreement, we purchase materials according to customer forecast and supplier lead-times.\nThe key electronic components we purchase include: advanced semiconductors, diodes, power management modules, microcontrollers, memory modules, interconnects, inductors, resistors, capacitors, power supplies and cable and wire. Component shortages, extended lead-times and subsequent allocations by our suppliers are an inherent risk within the electronics industry and have particularly been an issue for semiconductors during fiscal 2022. We discuss the causes, implications, and potential implications of these shortages more fully in \"Risk Factors\" in Part I, ITEM 1A. RISK FACTORS\nMaterial risk factors to our business and financial performance are those that may impact our strategy, which is centered around four strategic pillars: Market Focus, Superior Execution, Passion Meets Purpose and Discipline by Design. This section lays out a number of material risks that may impact those strategic pillars. Other sections of this report also include risks that may impact our strategic business objectives and affect our financial performance. The risks included herein and elsewhere in this report are not exhaustive. In addition, due to the dynamic nature of our business, new risks may emerge from time to time and it is not possible for management to predict or assess the impact of all such risks on our business.\nRisks impacting our Market Focus\nThe end markets we serve require technologically advanced products and such markets may be impacted by a number of factors that could adversely impact our customers demand.\nFactors affecting the technology-dependent end markets that we serve could adversely affect our customers and, as a result, Plexus. These factors include:\ncustomers ability or inability to adapt to rapidly changing technologies and evolving industry standards that can result in short product life-cycles or product obsolescence\ncustomers ability or inability to develop and market their products, some of which are new and untested\nthe potential failure of our customers products to gain widespread commercial acceptance, and\nthe availability of the components required to manufacture and service our customers' products.\nEven if our customers successfully respond to these market challenges, their responses, including any consequential changes we must make in our business relationships, services offered, or to our operations, can affect our production cycles, working capital levels and results of operations.\nOur customers do not make long-term commitments to us and may cancel or change their production requirements, which may strain resources and negatively impact our revenue, working capital levels and our operating results.\nWe generally do not obtain firm, long-term purchase commitments from our customers, and frequently do not have visibility as to their future demand for our services. Customers also cancel, change or delay design, production or sustaining service quantities and schedules, or fail to meet their forecasts for a number of reasons beyond our control. Customer expectations can change rapidly, requiring us to take on additional commitments or risks. In addition, customers may fail to meet their commitments to us or our expectations. Cancellations, reductions or delays by a significant customer, or by a group of customers, could seriously harm our operating results and negatively affect our working capital levels. Such cancellations, reductions or delays have occurred from time to time and may continue to occur in the future. This risk continues to be heightened by potential volatility in end market demand for our customers' products or our services as a result of COVID-19, the current inflationary environment, supply chain constraints, global conflicts and general economic uncertainty.\nIn addition, we make significant decisions based on our estimates of customers demand, including determining the levels of business that we will seek and accept, production schedules, component procurement commitments, working capital management, facility and capacity requirements, personnel needs and other resource requirements. The short-term nature of our customers commitments and the possibility of rapid changes in demand for their products affect our ability to accurately estimate their future requirements. Because certain of our operating expenses are fixed in the short or long term, a reduction in customer demand can harm our operating results. The need for us to correctly anticipate component needs is amplified in times of shortages. The current environment of tight component supply, which continues to be impacted by COVID-19 interruptions and other factors discussed above, can increase the difficulties and cost of anticipating changing demand. Moreover, because our margins vary across customers and specific programs, a reduction in revenue with higher margin customers or programs will have a more significant adverse effect on our operating results.\nRapid increases in customer demand may stress personnel and other capacity resources. We may not have sufficient resources, including personnel and components, at any given time to meet all of our customers demands or to meet the requirements of a specific program, which could result in a loss of business from such customers.\nIncreased competition may result in reduced demand or reduced prices for our services.\nOur industry is highly competitive. We compete against numerous providers with global operations, as well as those which operate on only a local or regional basis. In addition, current and prospective customers continually evaluate the merits of designing, manufacturing and servicing products internally and may choose to design, manufacture or service products (including products or product types that we currently design, manufacture or service for them) themselves rather than outsource such activities. Consolidations and other changes in our industry may result in a changing competitive landscape.\nOur competitors may:\nrespond more quickly than us to new or emerging technologies\nbe faster to develop new business models in response to evolving customer needs\nhave greater name recognition, critical mass and geographic and market presence\nbe better able to identify and take advantage of acquisition opportunities\nadapt more quickly to changes in customer requirements\nhave lower internal cost structures\nhave greater direct buying power with component suppliers and distributors\ndevote greater resources to the development, promotion and sale of their services and execution of their strategy\nbe better positioned to compete on price for their services\nhave technological expertise, engineering capabilities and/or manufacturing resources that are greater than ours\nhave excess capacity, and be better able to utilize such excess capacity\nbe better positioned to add additional resources, and\nbe willing or able to make sales or provide services at lower margins than we do.\nOur manufacturing processes are generally not subject to significant proprietary protection, and companies with greater resources or a greater market presence may enter our market or otherwise become increasingly competitive. Increased competition could result in significant price reductions, reduced sales and margins, or loss of market share.\nThe majority of our net sales come from a relatively small number of customers and a limited number of market sectors; if we lose a major customer or program or if there are challenges in those market sectors, then our net sales and operating results could decline significantly.\nNet sales to our 10 largest customers have represented a majority of our net sales in recent periods. Our 10 largest customers accounted for 56.2% and 55.2% of our net sales in fiscal 2022 and 2021, respectively. During each of these periods there was one customer that represented 10.0% or more of our net sales.\nOur major customers may vary from period to period, and our major customers may not continue to purchase services from us at current levels, or at all, particularly given the volatile or temporary nature of certain programs. In any given period, a higher portion of our sales may be concentrated with customers or projects with relatively lower margins, which could adversely affect our results. We have experienced from time to time, and in the future may experience, significant disengagements with customers or of programs, adverse changes in customer supply chain strategies and the end of life of significant programs. Especially given our discrete number of customers, the loss of, or significant reductions in net sales to, any of our major customers or our failure to make appropriate choices as to the customers we serve could seriously harm our business and results of operations.\nIn addition, we focus our sales efforts on customers in only a few market sectors, as identified in Part I, Item 1, herein. Each of these sectors is subject to macroeconomic conditions, as well as trends and conditions that are sector specific. Any weakness in our customers end markets could affect our business and results of operations. Economic, business or regulatory conditions that affect the sector, or our failure to choose to do business in appropriate subsectors, can particularly impact us. For instance, sales in the Healthcare/Life Sciences sector are substantially affected by trends in the healthcare industry, such as government reimbursement rates and uncertainties relating to the U.S. healthcare sector, generally. In addition, the Healthcare/Life Sciences sector is affected by health crises, such as COVID-19. The semiconductor industry has historically been subject to significant cyclicality and volatility. Further, changing U.S. government export regulations including recent regulations relating to the export of advanced semiconductors and chip-manufacturing equipment that may limit our ability to ship certain components or customer products to China, or potential reductions in U.S. government agency spending, including those due to budget cuts or other political developments or issues, could affect opportunities in all of our market sectors.\nWe rely on timely and regular payments from our customers, and the inability or failure of our major customers to meet their obligations to us or their bankruptcy, insolvency or liquidation may adversely affect our business, financial condition and results of operations. We also have receivables factoring agreements in place; therefore, deterioration in the payment experience\nwith or credit quality of our major customers we factor, or issues with the banking counterparties to our factoring agreements, could have a material adverse effect on our financial condition and results of operations due to our inability to factor such receivables.\nFrom time to time, our customers have been affected by merger, acquisition, divestiture and spin-off activity. While these transactions may present us with opportunities to capture new business, they also create the risk that these customers will partially reduce their purchases or completely disengage from us as a result of transitioning such business to our competitors or their internal operations.\nWe and our customers are subject to increasingly extensive government regulations, legal requirements and industry standards; a failure to comply with current and future regulations, requirements and standards could have an adverse effect on our business, customer relationships, reputation and profitability.\nWe and our customers are subject to extensive government regulation, legal requirements and industry standards (as well as customer-specific standards) relating to the products we design, manufacture and service as well as how we conduct our business. This includes regulations and standards relating to labor and employment practices, workplace health and safety, the environment, sourcing and import/export practices, the market sectors we support and many other facets of our operations. The regulatory climate in the U.S. and other countries has become increasingly complex and fragmented, and regulatory enforcement activity has increased in recent periods. Regulatory changes and restrictions can be announced with little or no advance notice. A failure to comply with laws, regulations or standards applicable to our business can result in, among other consequences, fines, injunctions, civil penalties, criminal prosecution, recall or seizure of devices, total or partial suspension of production, including debarment, and could have an adverse effect on our reputation, customer relationships, profitability and results of operations.\nOur Healthcare/Life Sciences sector is subject to statutes and regulations covering the design, development, testing, manufacturing, labeling and servicing of medical devices and the reporting of certain information regarding their safety, including FDA regulations and similar regulations in other countries. We also design, manufacture and service products for certain industries, including certain applications where the U.S. government is the end customer, that face significant regulation by the Department of Defense, Department of State, Department of Commerce, Federal Aviation Authority and other governmental agencies in the U.S. as well as in other countries, and also under the Federal Acquisition Regulation. In addition, whenever we pursue business in new sectors and subsectors, or our customers pursue new technologies or markets, we need to navigate the potentially heavy regulatory and legislative burdens of such sectors, as well as standards of quality systems, technologies or markets. Failure to navigate these regulatory obligations and burdens could impact our operating results as well as cause reputational damage.\nThe regulatory climate can itself affect the demand for our services. For example, government reimbursement rates and other regulations, as well as the financial health of healthcare providers, and changes in how healthcare in the U.S. and other countries is structured, and how medical devices are taxed, could affect the willingness and ability of end customers to purchase the products of our customers in the Healthcare/Life Sciences sector as well as impact our margins.\nOur customers are also required to comply with various government regulations, legal requirements and industry standards, including many of the industry-specific regulations discussed above. Our customers failure to comply could affect their businesses or reputation, which in turn would affect our sales to them and pose potential reputational risk to us. In addition, if our customers are required by regulation or other requirements to make changes in their product lines, these changes could significantly disrupt particular programs we have in place for these customers and create inefficiencies in our business. Failure of our customers to identify or flow down any such requirements to Plexus could result in production of non-compliant product, which could restrict their ability to sell such products, thus affecting our sales to them.\nWe may fail to identify acquisition targets, or successfully complete future acquisitions, and may not successfully integrate acquired operations or recognize the anticipated benefits of an acquisition, which could adversely affect our operating results.\nIf we were to pursue future growth through acquisitions, they would involve significant risks that could have a material adverse effect on us. These include operating risks such as the inability to successfully identify acquisition targets or, once a target is identified, to successfully negotiate and close an acquisition; to integrate businesses, systems and personnel; to navigate potential impacts on customer programs and relationships; and to realize anticipated synergies or economies of scale. They also include strategic risks such as the diversion of management time and attention from other business activities and opportunities and financial risks such as the use of cash or incurrence of additional debt and interest expense as consideration for the acquisition and to fund the activities required to pursue acquisitions, the potential volatility or weakness in our stock price as a\nresult of the announcement of such transactions, the incurrence of large write-offs or write-downs if the acquisition is not successful and other potential financial impacts.\nRisks impacting our Superior Execution\nPlexus is a multinational corporation and operating in multiple countries exposes us to increased risks, including adverse local developments and currency risks.\nWe have operations in many countries. Operations outside of the U.S. in the aggregate represent a majority of our net sales and operating income, with a particular concentration in Malaysia. In addition, although we have repatriated a substantial amount of cash since the enactment of the U.S. Tax Cuts and Jobs Act (U.S. Tax Reform) in 2017, a significant amount of our cash balances remain held outside of the U.S., with a particular concentration in Malaysia and China. We purchase a significant number of components manufactured in various countries. These international aspects of our operations, which are likely to increase over time, including with the introduction of a new manufacturing facility in Bangkok, Thailand, subject us to the following risks that could materially impact our operations and operating results:\neconomic, political or civil instability\ncivil or international conflicts and war, including the risk of escalation in the Russia-Ukraine war, escalating tensions between China and Taiwan as well as China and the U.S.\ntransportation delays or interruptions\nexchange rate fluctuations\npotential disruptions or restrictions on our ability to access cash amounts held outside of the U.S.\nchanges in labor markets, such as government-mandated wage increases (which we are experiencing in Malaysia), increases to minimum wage requirements, changes in union-related laws and regulations, limitations on immigration or the free movement of labor or restrictions on the use of migrant workers, and difficulties in appropriately staffing and managing personnel in diverse cultures\ncustomers shifting parts of their manufacturing and supply chains to different countries, often referred to as re-shoring, which may impact footprint needs and create operational disruption due to transition efforts\ncompliance with laws, such as the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act and the European Unions General Data Protection Regulation (the GDPR), applicable to companies with global operations\nchanging U.S. government export regulations, particularly relating to advanced semiconductors and chip-manufacturing equipment, may limit the ability to ship certain components or customer product to China, and source the components necessary to manufacture customer product in China\nchanges in the taxation of earnings both in the U.S. and in other countries\nreputational risks related to, among other factors, varying standards and practices among countries\nchanges in duty rates\nsignificant natural disasters and other events or factors impacting local infrastructure\nthe effects of other international political developments, such as tariffs, embargoes, sanctions, boycotts, trade wars, energy disruptions, trade agreements and changes in trade policies, including those which may be effected by the U.S. and other countries political reactions to those actions, and\nregulatory requirements and potential changes to those requirements.\nAs our international operations continue to expand, our failure to appropriately address foreign currency transactions or the currency exposures associated with assets and liabilities denominated in non-functional currencies could adversely affect our consolidated financial condition, results of operations and cash flows. In addition, developments affecting particular countries can adversely affect our ability to access cash or other assets held in such countries.\nA significant portion of our operations currently occurs in the APAC region, particularly in Malaysia. The concentration of our operations, workforce, assets and profitability in that region exposes us to adverse developments, economic, political or otherwise, in those countries.\nChanges in policies or trade agreements by or changes in elected officials of the U.S. or other governments could negatively affect our operating results due to trade wars, changes in duties, tariffs or taxes, currency exchange rate fluctuations, higher costs of compliance, or limitations on currency or fund transfers, as well as government-imposed restrictions on producing certain products in, or shipping them to, specific countries. Our current facilities in Mexico operate under the Mexican Maquiladora (IMMEX) program. This program provides for reduced tariffs and eased import regulations. We could be adversely affected by changes in the IMMEX program or our failure to comply with its requirements.\nAdditionally, continued uncertainty regarding commercial dealings, tariffs, export regulations and other trade protection measures between the U.S. and China, heightened by escalating geopolitical tensions, may affect our ability to do business in China, may impact the cost of our products originating in China and may impact the demand for our products manufactured in China in the event our customers reduce or eliminate their operations in China. These actions could also affect the cost and/or availability of components that we procure from suppliers in China, as well as create disruptions, delays, shortages or increased costs within our global supply chain. Government-imposed restrictions on where we or our customers can produce certain types of products or source components or with whom we can conduct business, such as named companies or industries identified in the 2021 National Defense Authorization Act and recent export regulations limiting advanced semiconductors and chip-manufacturing equipment, could limit our ability to sell or manufacture products or services in China, or source components from certain companies or geographies. These factors can negatively affect operating results and financial position, including reducing our revenues, costs and profitability as a result of having to minimize engagements in China or requiring us to shift such production or the sourcing of components to the U.S. or other higher-cost locations.\nFurther, the extent to which the conflict between Russia and Ukraine or the escalating tensions between China and Taiwan or China and the U.S. may impact our business or results of operations will depend on future developments, including the severity and duration of any conflicts, their impact on global supply chains and their impact on regional and global economic conditions including the ability of our customers or suppliers to do business in those or surrounding countries and the inflationary effects of such conflicts on our profitability. These tensions have resulted in, and may continue to cause, global disruptions creating significant volatility in financial markets and the global economy.\nWe experience component shortages, delays, price fluctuations and supplier quality concerns.\nWe generally do not have long-term supply agreements. We have experienced from time to time and are currently experiencing significant component shortages and longer lead-times due to supplier capacity constraints. Supply chain constraints and delays can be caused by world events, such as government policies, tariffs, trade wars, trade disputes and trade protection measures, terrorism, armed conflict, natural disasters, economic recession, increased demand due to economic growth, preferential allocations, transportation challenges, and other localized events. For example, escalating tensions between China and Taiwan (and/or any trade restrictions that may be imposed in response) may impact our ability to procure semiconductors and other components. Further, we rely on a limited number of suppliers for many of the components used in the assembly process and, in some cases, may be required to use suppliers that are the sole provider of a particular component. Such suppliers may encounter quality problems, labor disputes or shortages, financial difficulties or business continuity issues that could preclude them from delivering components timely or at all. Supply shortages and delays in deliveries of components may result in delayed production of assemblies, which reduces our revenue and operating profit for the periods affected. Additionally, a delay in obtaining a particular component may result in other components for the related program being held for longer periods of time, increasing working capital, risking inventory obsolescence and negatively impacting our cash flow. We are currently experiencing higher inventory levels as a result of component shortages.\nDue to the highly competitive nature of our industry, an inability to obtain sufficient inventory on a timely basis or successfully execute on our business continuity processes, could also harm relationships with our customers and lead to loss of business to our competitors.\nIn addition, components that are delivered to us may not meet our specifications or other quality criteria. Certain components provided to us may be counterfeit or violate the intellectual property rights of others. The need to obtain replacement materials and parts may negatively affect our manufacturing operations. The inadvertent use of any such parts or products may also give rise to liability claims. Further, the commitments made to us by our suppliers, and the terms applicable to such relationships, may not match all the commitments we make to, and the terms of our arrangements with our customers, and such variations may lead us to incur additional expense or liability and/or cause other disruptions to our business.\nComponent supply shortages and delays in deliveries, along with other factors such as tariffs, trade disputes or embargos, inflation, and rising energy and transportation costs, can also result in increased pricing. While many of our customers permit quarterly or other periodic adjustments to pricing based on changes in component prices and other factors, we may bear the risk of price increases that occur between any such repricing or, if such repricing is not permitted, during the balance of the term of the particular customer contract. In addition, these repricing or pricing recoveries have been and may continue to be dilutive to our operating margin. Conversely, as a result of our pricing strategies and practices, component price reductions have contributed positively to our operating results in the past. Our inability to continue to benefit from such reductions in the future could adversely affect our operating results, cash flows and inventory levels, which could increase as a result of higher component prices or the negative effects of inflation on customer end-market demand.\nOur services involve other inventory risk.\nMost of our services are provided on a turnkey basis, under which we purchase some, or all, of the required materials and components based on customer forecasts or orders. Although, in general, our commercial contracts with our customers obligate our customers to ultimately purchase inventory ordered to support their forecasts or orders, we generally finance these purchases initially. In addition, suppliers may require us to purchase materials and components in minimum order quantities that may exceed customer requirements. A customers cancellation, delay or reduction of forecasts or orders can also result in excess inventory or additional expense to us. Engineering changes by a customer may result in obsolete materials or components. While we attempt to cancel, return or otherwise mitigate excess and obsolete inventory, require customers to reimburse us for these items and/or price our services to address related risks, we may not actually be reimbursed timely or in full, be able to collect on these obligations or adequately reflect such risks in our pricing. In addition to increasing inventory in certain instances to support new program ramps, we may also increase inventory if we experience component shortages or longer lead-times for certain components in order to maintain a high level of customer service. In such situations, we may procure components earlier, which has led to an increase in inventory in the short term and may lead to increased, excess, or obsolete inventory in the future. Excess or obsolete inventory, the need to acquire increasing amounts of inventory due to shortages, customer demand or otherwise, or other failures to manage our working capital, could adversely affect our operating results, including our return on invested capital.\nIn addition, we provide managed inventory programs for some of our customers under which we hold and manage finished goods or work-in-process inventories. These managed inventory programs may result in higher inventory levels, further reduce our inventory turns and increase our financial exposure with such customers. In addition, our inventory may be held at a customers facility or warehouse, or elsewhere in a location outside of our control, which may increase the risk of loss. Even though our customers generally have contractual obligations to purchase such inventories from us, we remain subject to customers credit risks as well as the risk of potential customer default and the need to enforce those obligations.\nWe have a complex business model, and our failure to properly manage or execute on that model could adversely affect our operations, financial results and reputation.\nOur business model focuses on products and services that are highly complex and subject to demanding regulatory requirements. Our customers products typically require significant production and supply-chain flexibility necessitating optimized solutions across an integrated global platform. The products we design, manufacture and service are also typically complex, heavily regulated and require complicated configuration management and direct order fulfillment capabilities to global end customers.\nOur business model requires working capital, management and technical personnel, and the development and maintenance of systems and procedures to manage diverse manufacturing, regulatory and service requirements for multiple programs of varying sizes simultaneously, including in multiple locations and geographies. We also depend on securing and ramping new customers and programs as well as transitioning production for new customers and programs, which creates added complexities related to managing the start-up risks of such projects, especially for companies that did not previously outsource such activities.\nThe complexity of our model, which encompasses a broad range of services including design and development, supply chain solutions, new product introduction, manufacturing and sustaining services, often results in complex and challenging contractual obligations and unique customer requirements. In addition, program complexity and associated customer expectations have increased in recent years with respect to certain capabilities, commitments, allocation of risk and compliance with third party standards, requiring extraordinary measures to ensure operational execution and compliance within unique, non-standard engagements. This is especially relevant to our expanding sustaining services business, where each customer program presents unique logistical, operational and supply chain risks that differ from those found in our manufacturing or engineering engagements. If we fail to meet those obligations, or are otherwise unable to execute on our commitments or unsuccessfully mitigate such risks, then it could result in claims against us, regulatory violations, or adversely affect our reputation and our ability to obtain future business, as well as impair our ability to enforce our rights (including those related to payment) under those contracts. A failure to adequately understand unique customer requirements may also impact our ability to estimate and ultimately recover associated costs, adversely affecting our financial results.\nMany of our customers' markets are characterized by rapidly changing technology and evolving process developments. Our internal processes are also subject to these factors. The sustained success of our business will depend upon our continued ability to:\nattract and retain qualified engineering and technical personnel, especially in times of tight labor markets\nchoose, maintain and enhance appropriate technological and service capabilities\nsuccessfully manage the implementation and execution of information systems\ndevelop and market services that meet changing customer needs\neffectively execute our services and perform to our customers expectations, and\nsuccessfully anticipate, or respond to, technological changes on a cost-effective and timely basis.\nAlthough we believe that our operations utilize the technologies, equipment and processes that are currently required by our customers, we cannot be certain that we will maintain or develop the capabilities required by our customers in the future. The emergence of new technologies, industry standards or customer requirements may render our technical personnel, equipment, inventory or processes obsolete or noncompetitive. In addition, we may have to acquire new skills, technologies and equipment to remain competitive, as well as offer new or additional services, all of which may require significant expense or capital investment that could reduce our liquidity and negatively affect our operating results. Our failure to anticipate and adapt to our customers changing technological needs and requirements, or to perform to their expectations or standards, as well as our need to maintain our personnel and other resources during times of fluctuating demand, could have an adverse effect on our business.\nNatural disasters including weather events caused by global climate change, breaches of security and other events outside our control, and the ineffective management of such events, may harm our business.\nSome of our facilities are located in areas that may be impacted by natural disasters including tornadoes, hurricanes, earthquakes, water shortages, tsunamis and floods. All facilities are subject to other natural or man-made disasters such as those related to weather events or global climate change, fires, acts of terrorism or war, breaches of security, theft or espionage, workplace violence and failures of utilities. If such an event was to occur and we did not have an effective business continuity plan in place, our business could be harmed due to the event itself or due to our inability to effectively manage the effects of the particular event, with the impact of the event potentially magnified in areas where we have multiple facilities in close proximity. For example, we maintain significant production capacity in Penang, Malaysia, and an event in that geography could materially hinder our production capabilities. Potential harms include the loss of business continuity, financial risk, the loss of business data and damage to infrastructure. These natural disasters and physical climate risks could also disrupt our operations by impacting the availability and cost of materials within our supply chain, and could also increase insurance and other operating costs. These factors may impact our decisions to construct new facilities or maintain existing facilities in areas most prone to physical climate risks, such as our facilities in Malaysia that are at or near sea level.\nIn addition, some of our facilities possess certifications or unique equipment necessary to work on specialized products that our other locations lack. If work is disrupted at one of these facilities, it may be impractical or we may be unable to transfer such specialized work to another facility without significant costs and delays. Thus, any disruption in operations at a facility possessing specialized certifications or equipment could adversely affect our ability to provide products and services to our customers, and potentially have a negative affect our relationships and financial results.\nAlthough we have implemented policies and procedures with respect to physical security, we remain at risk of unauthorized access to our facilities and the possible unauthorized use or theft of inventory, information or other physical assets. If unauthorized persons gain physical access to our facilities, or our physical assets or information are stolen, damaged or used in an unauthorized manner (whether through outside theft or industrial espionage), we could be subject to, among other consequences, negative publicity, governmental inquiry and oversight, loss of government contracts, litigation by affected parties or other future financial obligations related to the loss, misuse or theft of our or our customers data, inventory or physical assets, any of which could have a material adverse effect on our reputation and results of operations.\nAn inability to successfully manage the procurement, development, implementation or execution of information systems, or to adequately maintain these systems and their security, as well as to protect data and other confidential information, may adversely affect our business and reputation.\nAs a global company with a complex business model, we are heavily dependent on our information systems to support our customers requirements and to successfully manage our business. Any inability to successfully manage the procurement, development, implementation, execution or maintenance of our information systems, including matters related to system and data security, cybersecurity, privacy, reliability, compliance, performance and access, as well as any inability of these systems to fulfill their intended purpose within our business, could have an adverse effect on our business.\nIn the ordinary course of business, we collect and store sensitive data and information, including our proprietary and regulated business information and that of our customers, suppliers and business partners, as well as personally identifiable information about our employees. Our information systems, like those of other companies, are susceptible to malicious damage, intrusions and outages due to, among other events, viruses, cyber threats, industrial espionage (internal or external), hacking, break-ins and similar events, other breaches of security, natural disasters, power loss or telecommunications failures. Due to the intellectual property we maintain on our systems related to high technology components, sub-components, manufacturing processes and our customers products, we are a likely target from various external cyber threats, such as lone attackers, nation states seeking to gain access to such intellectual property, as well as both unintentional and malicious internal threats. In addition, lone and organized crime elements have been known to extort money by encrypting their victims data (ransomware) and utilize their victims resources for unauthorized mining of cryptocurrency.\nThe increasing sophistication of cyberattacks requires us to continually evaluate the threat landscape and new technologies and processes intended to detect and prevent these attacks. There can be no assurance that the security measures and systems configurations we choose to implement will be sufficient to protect the data we manage. Any theft or misuse of information resulting from a security breach could result in, among other things, loss of significant and/or sensitive information, litigation by affected parties, financial obligations resulting from such theft or misuse, higher insurance premiums, governmental investigations, fines and penalties, negative reactions from current and potential future customers, and reputational damage, any of which could adversely affect our financial results. Also, the time and funds spent on monitoring and mitigating our exposure and responding to breaches, including the training of employees, the purchase of protective technologies and the hiring of additional employees and consultants to assist in these efforts could adversely affect our financial results. This risk is enhanced as a result of an increase in our remote workforce due to evolving flexible workplace practices, for example by reason of utilizing home networks that may lack encryption or secure password protection, virtual meeting/conference security concerns and increase of phishing/cyber-attacks around our remote workforce's digital resources.\nMoreover, we are subject to increasing expectations and data security requirements from our customers, generally, as well as specific data handling requirements due to the nature of their end products, including those related to the Export Administration Regulations/International Traffic in Arms, Federal Acquisition Regulation, Defense Federal Acquisition Regulation Supplement and Cybersecurity Maturity Model Certification. Any operational failure or breach of security from increasingly sophisticated cyber threats could lead to the loss or disclosure of our or our customers financial, product or other confidential information, result in adverse regulatory or other legal actions and have a material adverse effect on our business and reputation. In addition, we must comply with increasingly complex and rigorous regulatory standards enacted to protect business and personal data in the U.S. and elsewhere. For example, GDPR and similar legislation in jurisdictions in which we operate impose additional obligations on companies regarding the handling of personal data and provides certain individual privacy rights to persons whose data is stored. Compliance with existing, proposed and recently enacted laws and regulations can be costly. Failure to comply with these regulatory standards could subject us to legal and reputational risks. Misuse of or failure to secure personal information could also result in violation of data privacy laws and regulations, proceedings against us by governmental entities or others, fines and penalties, damage to our reputation and credibility and could have a negative impact on our business and results of operations.\nThere may be problems with the products we design, manufacture or service that could result in liability claims against us, reduced demand for our services and damage to our reputation.\nWe design, manufacture and service products to our customers specifications, many of which are highly complex, for industries such as healthcare, aerospace and defense that have higher risk profiles. Despite our quality control and quality assurance efforts, problems may occur, or may be alleged, in the design, manufacturing or servicing of these products. Whether or not we are responsible, problems in the products we manufacture, whether real or alleged, whether caused by faulty customer specifications, the design or manufacturing processes, servicing or a component defect, may result in delayed shipments to customers or reduced or canceled customer orders. If these problems were to occur in large quantities or too frequently, our business reputation may also be tarnished. In addition, such problems may result in liability claims against us, whether or not we are responsible. These potential claims may include damages for the recall of a product or injury to person or property.\nEven if customers or third parties, such as component suppliers, are responsible for defects, they may not, or may not be able to, assume responsibility for any such costs or required payments to us. While we seek to secure contractual protection and/or to insure against many of these risks, we may not have practical recourse against certain suppliers, and contractual protections, insurance coverage or supplier warranties, as well as our other risk mitigation efforts, may be inadequate, not cost effective or unavailable, either in general or for particular types of products or issues. We occasionally incur costs defending claims, and any such disputes could adversely affect our business relationships.\nA failure to comply with customer-driven policies and standards, and third-party certification requirements or standards could adversely affect our business and reputation.\nIn addition to government regulations and industry standards, our customers may require us to comply with their own or third-party quality standards, commercial terms, or other business policies or standards, which may be more restrictive than current laws and regulations as well as our pre-existing policies and/or terms with our suppliers, before they commence, or continue, doing business with us. Such policies or standards may be customer-driven, established by the industry sectors in which we operate or imposed by third party organizations.\nOur compliance with these heightened and/or additional policies, standards and third-party certification requirements, and managing a supply chain in accordance therewith, could be costly, and our failure to comply could adversely affect our operations, customer relationships, reputation and profitability. In addition, our adoption of these standards could adversely affect our cost competitiveness, ability to provide customers with required service levels and ability to attract and retain employees in jurisdictions where these standards vary from prevailing local customs and practices. In certain circumstances, to meet the requirements or standards of our customers we may be obligated to select certain suppliers or make other sourcing choices, and we may bear responsibility for adverse outcomes even if these matters are as the result of third-party actions or outside of our control.\nIntellectual property infringement claims against our customers or us could harm our business.\nAlthough our manufacturing processes are generally not subject to significant proprietary protection, our services may and our customers' products do involve the creation and use of intellectual property rights, which subject us and our customers to the risk of claims of intellectual property infringement from third parties. In addition, our customers may require that we indemnify them against the risk of intellectual property infringement. If any claims are brought against us or our customers for infringement, whether or not these have merit, then we could be required to expend significant resources in defense of those claims. In the event of an infringement claim, we may be required to spend a significant amount of money to develop non-infringing alternatives or obtain licenses. We may not be successful in developing alternatives or obtaining licenses on reasonable terms or at all. Infringement by our customers could cause them to discontinue production of some of their products, potentially with little or no notice, which may reduce our net sales to them and disrupt our production.\nAdditionally, if third parties on whom we rely for products or services, such as component suppliers, are responsible for an infringement (including through the supply of counterfeit parts), we may or may not be able to hold them responsible and we may incur costs in defending claims or providing remedies. Such infringements may also cause our customers to abruptly discontinue selling the impacted products, which would adversely affect our net sales of those products and could affect our customer relationships more broadly. Similarly, claims affecting our suppliers could cause those suppliers to discontinue selling materials and components upon which we rely.\nRisks impacting our Passion Meets Purpose\nWe depend on our workforce, and the inability to attract, develop and retain personnel or other personnel disruptions may harm our business.\nIf we fail to attract, develop and retain sufficient qualified personnel, including key leadership positions and highly skilled technical roles, our operations and, consequently, our financial results, could be adversely affected. A number of factors may adversely affect labor availability in one or more of our locations, including local labor laws and practices or union activities, wage pressure and changing wage requirements, increasing healthcare costs, restrictions on immigration or labor mobility, local competition, high employment rates and high turnover rates. These labor-related issues and labor shortages have become more pronounced. We have been subject to inflationary or other general labor cost increases due to current economic conditions, which have increased our costs. If we are unable to offset these labor cost increases through price increases, growth or operational efficiencies, these inflationary or general labor cost increases could have a material adverse effect on our operating results and cash flows. Further, our adoption of certain third-party health, safety and other employment-related regulatory standards could adversely affect our ability to attract and retain employees in jurisdictions where these standards vary from prevailing local customs and practices. Additionally, any of these factors could drive an increase in turnover rates within our existing workforce, which could lead to decreased efficiency and increased costs, such as increased over time to meet demand and increased wage rates to attract and retain employees.\nWe also depend on good relationships with our workforce. Monitoring employee engagement and maintaining a healthy workplace culture based on our values and leadership behaviors is important to developing these good relationships and\nretaining a committed workforce. A failure to foster a strong, healthy culture, or a failure to adopt or maintain competitive policies and practices that enhance our workplace culture, such as those related to diversity and inclusion, workplace flexibility or other employee benefits, could adversely impact our ability to attract, develop and retain personnel and could substantially affect our operations and financial results.\nFrom time to time, there are changes and developments, such as retirements, promotions, transitions, disability, death and other terminations of service that affect our executive officers and other key employees, including those that are unexpected. Transitions or other changes in responsibilities among officers and key employees without having identified and ready successors for these critical roles, particularly when such changes are unanticipated, unplanned or not executed effectively, inherently can cause disruptions to our business and operations, as well as harm our reputation, which could have an effect on our results. Further, as we grow in size and complexity, a failure to continuously focus on the development of personnel and plan for the succession of critical roles may result in shortfalls in the talent required to execute effectively and affect our operations and financial results.\nEvolving expectations on environmental, social and governance (\"ESG\") matters, including global climate change, by various stakeholders could negatively affect our business.\nCustomer, investor and employee expectations relating to ESG have been rapidly evolving and increasing. In addition, government organizations are enhancing or advancing legal and regulatory requirements specific to ESG matters. The heightened stakeholder focus on ESG issues related to our business requires the continuous monitoring of various and evolving laws, regulations, standards and expectations and the associated reporting requirements. Specifically, certain stakeholders are beginning to require that we provide information on our plans relating to certain climate-related matters such as greenhouse gas emissions, and we expect this trend to continue and be amplified by the potential adoption of the proposed U.S. Securities and Exchange Commission (\"SEC\") regulations relating to climate change disclosure. A failure to adequately meet stakeholder expectations and reporting requirements may result in noncompliance with any imposed regulations, the loss of business, reputational impacts, diluted market valuation, an inability to attract and retain customers, and an inability to attract and retain top talent. In addition, our adoption and the reporting of certain standards or mandated compliance to certain requirements could necessitate additional investments that could impact our profitability. There continues to be a lack of consistent climate legislation, which creates economic and regulatory uncertainty. Such uncertainty may have an impact on our business, from the demand for our customers products in various industries to our costs of compliance in the manufacturing and servicing of our customers products, all of which may impact our results of operations.\nFurther, increased public awareness and concern regarding global climate change may result in new or enhanced requirements and/or stakeholder expectations to reduce or mitigate the effects of greenhouse gas emissions and transition to low-carbon alternatives, driven by policy and regulations, low-carbon technology advancement and shifting consumer sentiment and societal preferences. These transition risks could negatively impact our financial condition and results of operations including by means of carbon pricing mechanisms, required investments in lower greenhouse gas emissions technology, increased cost of raw materials and mandates on and regulation of existing products and services.\nIn addition, transition to low-carbon alternatives risks could result in reduced demand or product obsolescence for certain of our customers products and/or price modifications for our customers products and the resources needed to produce them. This could in turn put pressure on our manufacturing costs and result in reduced profit margin associated with certain of our customer programs, or loss of customer programs that we may not be able to replace.\nRisks impacting our Discipline By Design\nChallenges associated with the engagement of new customers or programs, the provision of new services, or start-up costs and inefficiencies related to new, recent or transferred programs could affect our operations and financial results.\nOur engagement with new customers, as well as the addition of new programs or types of services for existing customers, can present challenges in addition to opportunities. We must initially determine whether it would be in our interests from a business perspective to pursue a particular potential new customer, program or service, including evaluating whether the customer, program or service fits with our value proposition as well as its potential end-market success. If we make the decision to proceed, we need to ensure that our terms of engagement, including our pricing and other contractual provisions, appropriately reflect the strategic nature of the customer, anticipated costs, risks and rewards. The failure to make prudent engagement decisions or to establish appropriate terms of engagement could adversely affect our profitability and margins.\nAlso, there are inherent risks associated with the timing and ultimate realization of anticipated revenue from a new program or service; these factors can sometimes extend for a significant period. Some new programs or services require us to devote significant capital and personnel resources to new technologies and competencies. We may not meet customer expectations, which could damage our relationships with the affected customers and impact our ability to deliver conforming product or services on a timely basis. Further, the success of new programs may depend heavily on factors such as product reliability, market acceptance, regulatory approvals or economic conditions. The failure of a new program to meet expectations on these factors, or our inability to effectively execute on a new programs or services requirements, could result in lost financial opportunities and adversely affect our results of operations.\nIn recent years, ramping new programs has been a key contributor to our revenue growth. The management of resources in connection with the establishment of new or recent programs and customer relationships, as well as program transfers between facilities and geographies, and the need to estimate required resources in advance of production can adversely affect our gross and operating margins and level of working capital. These factors are particularly evident in the early stages of the life-cycle of new programs, which typically lack a track record of order volume and timing as well as production efficiencies in the early stages. We typically manage multiple new programs at any given time; therefore, we are exposed to these factors in varying magnitudes.\nThe effects of these start-up costs and inefficiencies can also occur when we transfer programs between locations and geographies. We conduct these transfers on a regular basis to meet customer needs, seek long-term efficiencies or respond to market conditions, as well as due to facility openings and closures. We may also be required to transfer projects between facilities due to tariffs and other trade measures impacting particular countries such as China. Although we try to recover costs from our customers and minimize the potential losses arising from transitioning customer programs between our facilities and geographies, we may not be successful and there are inherent risks that such transitions can result in operational inefficiencies and the disruption of programs and customer relationships.\nWhile these factors tend to affect new, recent or transferred programs, they can also impact more mature or maturing programs and customer relationships, especially programs where end-market demand can be somewhat volatile.\nFailure to manage periods of growth or contraction may seriously harm our business.\nOur industry frequently sees periods of expansion and contraction. We regularly contend with these issues and must carefully manage our business to meet changing customer and market requirements. If we fail to manage these growth and contraction decisions effectively, as well as fail to realize the anticipated benefits of these decisions, we can find ourselves with either excess or insufficient resources and our business, as well as our profitability, may suffer. Expansion and consolidation, including the transfer of operations to new or other facilities or due to acquisitions, can inherently include additional costs and start-up inefficiencies. For example, we expanded our geographic locations by constructing a new manufacturing facility in Bangkok, Thailand, to supplement our footprint in the Asia-Pacific region. In addition, we may expand our operations in new geographical areas where currently we do not operate. If we are unable to effectively manage this or other expansions or consolidations, or related anticipated net sales are not realized, our operating results could be adversely affected. Other risks of current or future expansions, acquisitions and consolidations include:\nthe inability to successfully integrate additional facilities or incremental capacity and to realize anticipated efficiencies, economies of scale or other value\nchallenges faced as a result of transitioning programs\nincurrence of restructuring costs or other charges that may be insufficient or may not have their intended effects\nadditional fixed or other costs, or selling and administrative expenses, which may not be fully absorbed by new business\na reduction of our return on invested capital, including as a result of excess inventory or excess capacity at new facilities, as well as the increased costs associated with opening new facilities\ndifficulties in the timing of expansions, including delays in the implementation of construction and manufacturing plans\ndiversion of management's attention from other business areas during the planning and implementation of expansions\nstrain placed on our operational, financial and other systems and resources, and\ninability to locate sufficient customers, employees or management talent to support the expansion.\nPeriods of contraction or reduced net sales, or other factors affecting particular sites, create other challenges. We must determine whether facilities remain viable, whether staffing levels need to be reduced and how to respond to changing levels of customer demand. While maintaining excess capacity or higher levels of employment entail short-term costs, reductions in capacity or employment could impair our ability to respond to new opportunities and programs, market improvements or to\nmaintain customer relationships. Our decisions to reduce costs and capacity can affect our short-term and long-term results. When we make decisions to reduce capacity or to close facilities, we frequently incur restructuring costs.\nIn addition, to meet our customers' needs, particularly when the production requirements of certain products are site-specific, to achieve increased efficiencies, or to address factors affecting specific locations, such as tariffs and trade disputes, we sometimes require additional capacity in one location while reducing capacity in another. Since customers needs and market conditions can vary and change rapidly, we may find ourselves in a situation where we simultaneously experience the effects of contraction in one location and expansion in another location. We may also encounter situations where our lack of a physical presence in certain locations may limit or foreclose opportunities.\nChanges in tax laws, potential tax disputes, negative or unforeseen tax consequences or further developments affecting our deferred tax assets could adversely affect our results.\nOur effective tax rate is highly dependent upon the geographic mix of earnings across the jurisdictions where we operate. Changes in tax laws or tax rates in those jurisdictions, including, but not limited to, as a result of actions by the U.S. (including additional guidance and interpretations related to U.S. Tax Reform or potential passage of tax regulation changes under the U.S. presidential administration) or other countries, could continue to have a material impact on our operating results. Among other things, we have been, and are expected to continue to be, affected by the global intangible low-taxed income provisions added by U.S. Tax Reform and related new tax legislation, interpretations and guidance. Our effective tax rate may also be impacted by tax holidays and other various tax credits granted by local taxing authorities. In addition, the implementation of U.S. Tax Reform has required the use of estimates, which may be refined in future periods. All incentives, including a tax holiday granted to our Malaysian subsidiary, are subject to certain terms and conditions, which could be unfavorably altered by the local taxing authorities, changes to U.S. tax policy or the establishment of a global minimum tax. While we expect to comply with these conditions, we would experience adverse tax consequences if we are found to not be in compliance.\nOur taxable income in any jurisdiction is dependent upon the local taxing authoritys acceptance of our operational and intercompany transfer pricing practices as being at arms length. Due to inconsistencies among jurisdictions in the application of the arms length standard, our transfer pricing methods may be challenged and, if not upheld, could increase our income tax expense. Risks associated with transfer pricing adjustments are further highlighted by the global initiative from the Organisation for Economic Cooperation and Development called the Base Erosion and Profit Shifting (BEPS) project. The BEPS project is challenging longstanding international tax norms regarding the taxation of profits from cross-border business. Given the scope of our international operations and the fluid and uncertain nature of how the BEPS project might ultimately lead to future legislation, it is difficult to assess how any changes in tax laws would impact our income tax expense.\nWe review the probability of the realization of our net deferred tax assets each period based on forecasts of taxable income by jurisdiction. This review uses historical results, projected future operating results based upon approved business plans, eligible carryforward periods, tax planning opportunities and other relevant considerations. Adverse changes in the profitability and financial outlook in each of our jurisdictions may require the creation of an additional valuation allowance to reduce our net deferred tax assets. Such changes could result in material non-cash expenses in the period in which the changes are made.\nOur financial condition and results of operations may be materially adversely affected by a global health crisis such as coronavirus (COVID-19).\nThe full extent to which a global health crisis, such as COVID-19, will impact our business and operating results will depend on future developments that are highly uncertain and cannot be accurately predicted, including new medical and other information that may emerge as a result and the actions by governmental entities or others to contain it or treat its impact.\nThe impacts of a potential resurgence of COVID-19 or the possible impacts of a future and potentially more severe global health crisis could pose the risk that we or our employees, suppliers, customers and others may be restricted or prevented from conducting business activities for indefinite or intermittent periods of time, including as a result of employee health and safety concerns, shutdowns, shelter in place orders, travel restrictions and other actions and restrictions that may be prudent or required by governmental authorities.\nWe, our suppliers, and our customers had modified our business practices for the continued health and safety of our employees during the outbreak of COVID-19. If a resurgence of COVID-19 or a potentially more severe global health crisis occurs, we may be required to take further actions that are in the best interests of our employees, which could result in disruptions or delays and higher costs. The implementation of health and safety practices by us, our suppliers, or our customers could impact customer demand, supplier deliveries, our productivity and costs, which could have a material adverse impact on our business, financial condition, or results of operations.\nWhile we currently believe we have ample liquidity to manage the financial impact of a global health crisis, we can give no assurance that this will continue to be the case if the impact is prolonged or if there is an extended impact on us or the economy generally. If our future financing needs increase, then we may need to arrange additional debt or equity financing. However, if our liquidity or access to capital becomes significantly constrained, if costs of capital increase significantly due to the impact of a global health crisis as result of volatility in the capital markets, or there is a reduction in our creditworthiness or other factors, then our financial condition, results of operations and cash flows could be materially adversely affected.\nThe foregoing and other disruptions to our business as a result of a global health crisis has had and could continue to have a material adverse effect on our business, results of operations and financial condition.\nWe may fail to secure or maintain necessary additional financing or capital.\nAlthough we have credit facilities, we cannot be certain that our existing credit arrangements will provide all of the financing capacity that we will need in the future or that we will be able to change the credit facilities or revise covenants, if necessary, to accommodate changes or developments in our business and operations and/or increased working capital needs. In addition, if we do not comply with the covenants under our credit facility, our ability to borrow under that facility would be adversely affected. In addition, it is possible that counterparties to our financial agreements, including our credit facility and receivables factoring programs, may not be willing or able to meet their obligations, either due to instability in the global financial markets or otherwise, which could, among other impacts, increase the duration of our cash collection cycle. While we currently believe we have ample liquidity to manage the financial impact of COVID-19 or current economic conditions we can give no assurance that this will continue to be the case if the impact of COVID-19 or current economic conditions are prolonged or if there is an extended impact on us or the economy in general.\nOur future success may depend on our ability to obtain additional financing and capital to support possible future growth and future initiatives. In addition, we also have receivables factoring programs. Many of our borrowings are at variable interest rates and therefore our interest expense is subject to increase if rates increase.\nWe may seek to raise capital by issuing additional common stock, other equity securities or debt securities, modifying our existing credit facilities or obtaining new facilities, or through a combination of these methods. We may not be able to obtain capital when we want or need it, and capital may not be available on satisfactory terms. If we issue additional equity securities or convertible securities to raise capital, it may be dilutive to shareholders ownership interests; we may not be able to offer our securities on attractive or acceptable terms in the event of volatility or weakness in our stock price. Furthermore, any additional financing may have terms and conditions that adversely affect our business, such as restrictive financial or operating covenants, and our ability to meet any current or future financing covenants will largely depend on our financial performance, which in turn will be subject to general economic conditions and financial, business and other factors. ITEM 1B. UNRESOLVED SEC STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nOur facilities are comprised of an integrated network of manufacturing and engineering centers with our corporate headquarters located in Neenah, Wisconsin. We own or lease facilities with approximately 5.1 million square feet of active capacity. This includes approximately 2.1 million square feet in AMER, approximately 2.6 million square feet in APAC and approximately 0.4 million square feet in EMEA. Our active facilities as of October 1, 2022 are described in the following table:\nLocation Type Size (sq. ft.) Owned/Leased\nAMER\nNeenah, Wisconsin Manufacturing 418,000 Owned\nGuadalajara, Mexico (1) Manufacturing/Engineering 741,000 Leased\nNampa, Idaho Manufacturing 216,000 Owned\nAppleton, Wisconsin Manufacturing 205,000 Owned\nBuffalo Grove, Illinois (1) Manufacturing 189,000 Leased\nNeenah, Wisconsin Global Headquarters 104,000 Owned\nNeenah, Wisconsin Engineering 90,000 Leased\nRaleigh, North Carolina Engineering 41,000 Leased\nPortland, Oregon Manufacturing 29,000 Leased\nAPAC\nPenang, Malaysia (1) Manufacturing/Engineering 1,530,000 Owned\nBangkok, Thailand Manufacturing 400,000 Owned\nHangzhou, China (1) Manufacturing 245,000 Leased\nHaining, China Manufacturing 202,000 Leased\nXiamen, China Manufacturing 133,000 Owned\nXiamen, China (1) Manufacturing 122,000 Leased\nEMEA\nOradea, Romania Manufacturing/Engineering 296,000 Owned\nLivingston, Scotland Manufacturing/Engineering 62,000 Leased\nKelso, Scotland Manufacturing 57,000 Owned\nDarmstadt, Germany Engineering 21,000 Leased\n(1)The facilities in Guadalajara, Mexico; Buffalo Grove, Illinois; Penang, Malaysia; Hangzhou, China; and Xiamen, China include more than one building.\nIn the fourth quarter of fiscal 2022, we took possession of a new leased manufacturing facility in Portland, Oregon. It is expected to become an active facility in fiscal 2023. ITEM 3. LEGAL PROCEEDINGS\nWe are party to certain lawsuits and legal proceedings in the ordinary course of business. Management does not believe that these proceedings, individually or in the aggregate, will have a material adverse effect on our consolidated financial position, results of operations or cash flows. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nPerformance Graph\nOur common stock trades on the Nasdaq Stock Market in the Nasdaq Global Select Market tier (symbol: PLXS).\nThe following graph compares the cumulative total return on Plexus common stock with the Standard & Poor's (\"S&P\") MidCap 400 Index and the Nasdaq Stock Market Index for Electronic Components Companies. The values on the graph show the relative performance of an investment of $100 made on September 29, 2017 in Plexus common stock and in each of the indices as of the last business day of the respective fiscal year.\nComparison of Cumulative Total Return\n2017 2018 2019 2020 2021 2022\nPlexus $100 $104 $112 $127 $162 $156\nNasdaq-Electronic Components 100 106 110 117 158 132\nS&P 400 100 112 107 106 149 123\nShareholders of Record\nAs of November 14, 2022, we had 376 shareholders of record.\nDividends\nWe have not paid any cash dividends in the past. We currently anticipate that in the foreseeable future the majority of earnings will be retained to finance the development of our business through capital expenditures and working capital requirements, as well as execution upon our share repurchase authorizations as management deems appropriate and market conditions may allow. However, our Board of Directors evaluates from time to time potential uses of excess cash, which in the future may include additional share repurchases, a special dividend or recurring dividends. See also Part II, Item 7, \"Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources,\" for additional\ndiscussion of our intentions regarding dividends as well as a description of loan covenants that could restrict our ability to make future dividend payments.\nIssuer Purchases of Equity Securities\nThe following table provides the specified information about the repurchases of shares by us during the three months ended October 1, 2022:\nPeriod Total number of shares purchased Average price paid per share Total number of shares purchased as part of publicly announced plans or programs Maximum approximate dollar value of shares that may yet be purchased under the plans or programs (1)\nJuly 3, 2022 to July 30, 2022 - $ - - $ -\nJuly 31, 2022 to August 27, 2022 - - - 50,000,000\nAugust 28, 2022 to October 1, 2022 38,397 90.63 38,397 $ 46,520,133\n38,397 $ 90.63 38,397\n(1) On August 18, 2022, the Board of Directors approved a new share repurchase program that authorizes the Company to repurchase up to $50.0 million of its common stock (the \"2023 Program\"). The 2023 Program became effective immediately and has no expiration. The table above reflects the maximum dollar amount remaining available for purchase under the 2023 Program as of October 1, 2022.  ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nPlexus Corp. and its subsidiaries (together \"Plexus,\" the \"Company\", \"our\", or \"we\") participate in the Electronic Manufacturing Services (\"EMS\") industry. Since 1979, we have been partnering with companies to create the products that build a better world. We are a global leader with a team of nearly 25,000 individuals who are dedicated to providing Design and Development, Supply Chain Solutions, New Product Introduction, Manufacturing and Sustaining Services. We specialize in serving customers in industries with highly complex products and demanding regulatory environments. We deliver customer service excellence to leading global companies in the Industrial, Healthcare/Life Sciences and Aerospace/Defense market sectors by providing innovative, comprehensive solutions throughout the product's lifecycle. We provide these innovative solutions to customers in the Americas (\"AMER\"), Asia-Pacific (\"APAC\") and Europe, Middle East and Africa (\"EMEA\") regions.\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is intended to provide an analysis of both short-term results and future prospects from managements perspective, including an assessment of the financial condition and results of operations, events and uncertainties that are not indicative of future operations and any other financial or statistical data that we believe will enhance the understanding of our companys financial condition, cash flows and other changes in financial condition and results of operations. The information should be read in conjunction with our consolidated financial statements included herein and \"Risk Factors\" included in Part I, Item 1A herein.\nA discussion regarding our financial condition and results of operations for fiscal 2022 compared to fiscal 2021 is presented below. A discussion regarding our financial condition and results of operations for fiscal 2021 compared to fiscal 2020 is incorporated herein by reference from Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" in our Annual Report on the Form 10-K for the fiscal year ended October 2, 2021, which was filed with the SEC on November 19, 2021, and is available on the SECs website at www.sec.gov as well as our Investor Relations website at www.plexus.com.\nMarket Pressures Update\nWe have experienced, and expect to continue to experience, an inability to procure certain components on a timely basis due to global supply chain constraints. These constraints have impacted our ability to meet customer demand and may inhibit our ability to capture the demand from our customers. We remain in close contact with our suppliers to understand the impacts on their businesses and operations and continue to take steps to validate their ability to deliver to us on time. However, the extended lead-times have required us to make additional investments in inventory to satisfy customer demand, which we expect to persist.\nOver the past few quarters, the global supply chain constraints have led to inflation in some of the components we acquire, as well as labor and operating costs. We expect the increase in costs, including labor-related issues which have become more pronounced, to continue in the near future. We have been, and expect to continue to be, subject to such inflationary and general labor cost increases including in our Malaysia operations where the government has imposed a mandatory increase to the minimum wage that went into effect in our third quarter of fiscal 2022. While we have been largely able to mitigate the impacts of inflation through our contractual rights with customers on pricing, the pricing recoveries received may be dilutive to our operating margin. The inability to offset these costs in future periods or the impacts of continued inflation on end markets and our customers may affect our operating results, cash flows and inventory levels, which could increase as a result of higher component prices or the negative effects of inflation on customer end-market demand.\nWe continue to monitor the global impacts of COVID-19 and take steps to mitigate the potential risks to us posed by its spread and related circumstances and impacts. These efforts will continue as requirements change, new risks are identified and infections impact us. The spread and resurgence of COVID-19 from new variants in jurisdictions where we operate may make our ability to mitigate the impacts of the spread of the virus on our productivity more challenging.\nThe recent conflict between Russia and Ukraine has negatively impacted the global economy and led to various economic sanctions being imposed by the U.S., United Kingdom, European Union and other countries against Russia. While the impacts of the conflict have not been material on our operating results, as we do not have operations or material customers or suppliers in either country, it is not possible to predict the broader consequences of this conflict. Changing U.S. government export regulations, particularly relating to advanced semiconductors and chip-manufacturing equipment, may limit the ability to ship certain customer product to China, and source the components necessary to manufacture customer product in China.\nWe believe our balance sheet is positioned to support the potential future challenges presented by the macro-economic pressures we are facing. As of October 1, 2022, cash and cash equivalents and restricted cash were $275 million, while debt, finance lease obligations and other financing were $462 million. To further ensure our ability to meet the needs of working capital investments to support anticipated revenue growth, we refinanced our revolving credit facility, expanding the maximum commitment from $350 million to $500 million during the third quarter of fiscal 2022. Borrowings under our Credit Facility as of October 1, 2022 were $263 million, leaving $237 million of our revolving commitment of $500 million available for use as of October 1, 2022 as well as the ability to expand our revolving commitment to $750 million upon mutual agreement with the bank. Refer to Note 4, \"Debt, Finance Lease Obligations and Other Financing,\" in Notes to Consolidated Financial Statements and \"Managements Discussion and Analysis Liquidity and Capital Resources\" in Part II, Item 7 for further information.\nRESULTS OF OPERATIONS\nConsolidated Performance Summary. The following table presents selected consolidated financial data for the indicated fiscal years (dollars in millions, except per share data):\n2022 2021\nNet sales $ 3,811.4 $ 3,368.9\nCost of sales 3,464.1 3,045.6\nGross profit 347.2 323.3\nGross margin 9.1 % 9.6 %\nOperating income 178.2 176.3\nOperating margin 4.7 % 5.2 %\nOther expense 19.9 15.9\nIncome tax expense 20.1 21.5\nNet income 138.2 138.9\nDiluted earnings per share $ 4.86 $ 4.76\nReturn on invested capital* 13.0 % 15.4 %\nEconomic return* 3.7 % 7.3 %\n*Non-GAAP metric; refer to \"Return on Invested Capital (\"ROIC\") and economic return\" below for more information and Exhibit 99.1 for a reconciliation.\nNet sales. Fiscal 2022 net sales increased $442.5 million, or 13.1%, as compared to fiscal 2021.\nNet sales are analyzed by management by geographic segment, which reflects our reportable segments, and by market sector. Management measures operational performance and allocates resources on a geographic segment basis. Our global business development strategy is based on our targeted market sectors.\nAs a percentage of consolidated net sales, net sales attributable to customers representing 10% or more of consolidated net sales as well as the percentage of net sales attributable to our ten largest customers for the indicated fiscal years were as follows:\n2022 2021\nGeneral Electric Company (\"GE\") 12.9 % 11.2 %\nTop 10 customers 56.2 % 55.2 %\nA discussion of net sales by reportable segment is presented below for the indicated fiscal years (in millions):\n2022 2021\nNet sales:\nAMER $ 1,310.7 $ 1,317.4\nAPAC 2,300.6 1,850.6\nEMEA 316.3 312.7\nElimination of inter-segment sales (116.2) (111.8)\nTotal net sales $ 3,811.4 $ 3,368.9\nAMER. Net sales for fiscal 2022 in the AMER segment decreased $6.7 million, or 0.5%, as compared to fiscal 2021. The decrease in net sales was driven by net decreased customer end-market demand, a $49.4 million decrease for end-of-life products, a $41.1 million decrease due to the discontinuation of programs with existing customers and the impact of supply chain constraints that have created limitations with meeting available customer demand. These decreases were substantially offset by a $118.4 million increase in production ramps of new products for existing customers and a $43.8 million increase in production ramps for new customers, as well as increased pricing associated with inflated component prices.\nAPAC. Net sales for fiscal 2022 in the APAC segment increased $450.0 million, or 24.3%, as compared to fiscal 2021. The increase in net sales was driven by overall net increased customer end-market demand and increased pricing associated with inflated component prices, a $97.8 million increase in production ramps of new products for existing customers, an $8.8 million increase in production ramps for new customers and a partial recovery of supply chain constraints that had previously created limitations with meeting available customer demand. These increases were partially offset by a $33.1 million decrease for end-of-life products and a $6.9 million decrease due to the discontinuation of a program with an existing customer.\nEMEA. Net sales for fiscal 2022 in the EMEA segment increased $3.6 million, or 1.2%, as compared to fiscal 2021. The increase in net sales was driven by a $10.0 million increase in production ramps of new products for existing customers, partially offset by overall net decreased customer end-market demand.\nOur net sales by market sector for the indicated fiscal years were as follows (in millions):\n2022 2021\nNet sales:\nIndustrial $ 1,752.7 $ 1,549.0\nHealthcare/Life Sciences 1,565.8 1,326.9\nAerospace/Defense 492.9 493.0\nTotal net sales $ 3,811.4 $ 3,368.9\nIndustrial. Net sales for fiscal 2022 in the Industrial sector increased $203.7 million, or 13.2%, as compared to fiscal 2021. The increase in net sales was driven by overall net increased customer end-market demand and increased pricing associated with inflated component prices, a $73.8 million increase due to production ramps of new products for existing customers and a $41.1 million increase in production ramps for new customers, partially offset by the impact of supply chain constraints that have created limitations with meeting available customer demand. The increase was further offset by a $41.7 million decrease due to the discontinuation of programs with existing customers and an $18.6 million decrease for end-of-life products.\nHealthcare/Life Sciences. Net sales for fiscal 2022 in the Healthcare/Life Sciences sector increased $238.9 million, or 18.0%, as compared to fiscal 2021. The increase in net sales was driven by overall net increased customer end-market demand and increased pricing associated with inflated component prices, a $115.2 million increase due to production ramps of new products for existing customers and a partial recovery of supply chain constraints that had previously created limitations with meeting available customer demand. These increases were partially offset by a $55.1 million decrease for end-of-life products and a $6.9 million decrease due to the discontinuation of a program with an existing customer.\nAerospace/Defense. Net sales for fiscal 2022 in the Aerospace/Defense sector decreased $0.1 million, or less than 0.1%, as compared to fiscal 2021. The decrease was driven by net decreased customer end-market demand and a $9.1 million decrease due to end-of-life products. These decreases were substantially offset by a $37.2 million increase due to production ramps of new products for existing customers and an $8.2 million increase in production ramps for new customers.\nCost of sales. Cost of sales for fiscal 2022 increased $418.5 million, or 13.7%, as compared to fiscal 2021. Cost of sales is comprised primarily of material and component costs, labor costs and overhead. In fiscal 2022 and 2021, approximately 89% to 90% of the total cost of sales was variable in nature and fluctuated with sales volumes. Approximately 88% of these costs in fiscal 2022 and 2021 were related to material and component costs.\nAs compared to fiscal 2021, the increase in cost of sales in fiscal 2022 was primarily driven by the increase in net sales, inflated component costs, an increase in fixed costs, reduced operational efficiencies and increased labor costs.\nGross profit. Gross profit for fiscal 2022 increased $23.9 million, or 7.4%, as compared to fiscal 2021. Gross margin of 9.1% decreased 50 basis points compared to fiscal 2021. The primary driver of the increase in gross profit as compared to fiscal 2021 was the increase in net sales and reduced employee compensation and supplies costs associated with COVID-19, partially offset by inflated component costs, increased fixed costs, reduced operational efficiencies and increased labor costs. The decrease in gross margin was primarily driven by pass-through effects of recoveries from inflated components and increased labor costs, partially offset by fixed cost leverage.\nOperating income. Operating income for fiscal 2022 increased $1.9 million, or 1.1%, as compared to fiscal 2021. Operating margin of 4.7% decreased 50 basis points compared to fiscal 2021. The primary driver of the increase in operating income as compared to fiscal 2021 was the result of the increase in gross profit along with a $1.2 million decrease in restructuring and impairment charges, partially offset by a $22.0 million increase in selling and administrative expenses (\"S&A\"). The increase in S&A was primarily due to an increase in compensation costs. The decrease in operating margin was primarily driven by the decrease in gross margin, driven by the factors previously discussed.\nA discussion of operating income by reportable segment for the indicated fiscal years is presented below (in millions):\n2022 2021\nOperating income (loss):\nAMER $ 44.7 $ 62.3\nAPAC 267.3 238.8\nEMEA 8.0 (0.9)\nCorporate and other costs (141.8) (123.9)\nTotal operating income $ 178.2 $ 176.3\nAMER. Operating income decreased $17.6 million in fiscal 2022 as compared to fiscal 2021, primarily as a result of a decrease in net sales, inflated component costs, increased fixed costs, reductions in operational efficiencies and increased labor costs. There was also an increase in bad debt expense compared to recovery of a previously reserved customer receivable in fiscal 2021. This was partially offset by a positive shift in customer mix.\nAPAC. Operating income increased $28.5 million in fiscal 2022 as compared to fiscal 2021, primarily as a result of an increase in net sales, partially offset by inflated component costs, increased fixed costs, increased labor costs and an increase in S&A.\nEMEA. Operating income increased $8.9 million in fiscal 2022 as compared to fiscal 2021 primarily as a result of an increase in net sales, positive shift in customer mix, and a reduction in fixed costs. This was partially offset by an increase in S&A.\nOther expense. Other expense for fiscal 2022 increased $4.0 million as compared to fiscal 2021. The increase in other expense for fiscal 2022 was primarily due to the increase in factoring fees of $2.4 million and interest expense of $1.6 million.\nIncome taxes. Income tax expense for fiscal 2022 was $20.1 million compared to $21.5 million for fiscal 2021. The decrease is primarily due to claiming a U.S. Research & Development tax credit and the geographic distribution of worldwide earnings.\nOur annual effective tax rate varies from the U.S. statutory rate of 21.0% primarily due to the geographic distribution of worldwide earnings as well as a tax holiday granted to a subsidiary located in the APAC segment where we derive a significant portion of our earnings. Our effective tax rate may also be impacted by disputes with taxing authorities, tax planning activities, adjustments to uncertain tax positions and changes in valuation allowances.\nWe have been granted a tax holiday for a foreign subsidiary operating in the APAC segment. This tax holiday will expire on December 31, 2034, and is subject to certain conditions with which we expect to continue to comply. In fiscal 2022 and 2021, the holiday resulted in tax reductions, net of the impact of the global intangible low-taxed income provisions of the U.S. Tax Cuts and Jobs Act, of approximately $35.3 million ($1.27 per basic share, $1.24 per diluted share) and $34.4 million ($1.20 per basic share, $1.18 per diluted share), respectively.\nSee also Note 6, \"Income Taxes,\" in Notes to Consolidated Financial Statements for additional information regarding our tax rate.\nThe annual effective tax rate for fiscal 2023 is expected to be approximately 14.0% to 16.0% assuming no changes to tax laws.\nNet Income. Net income for fiscal 2022 decreased $0.7 million, or 0.5%, from fiscal 2021 to $138.2 million. Net income decreased primarily as a result of the increase in other expense, partially offset by the increase in operating income and decrease in tax expense as previously discussed.\nDiluted earnings per share. Diluted earnings per share increased to $4.86 in fiscal 2022 from $4.76 in fiscal 2021, primarily as a result of a reduction in diluted shares outstanding due to repurchase activity under our share repurchase plans, partially offset by decreased net income due to the factors discussed above.\nReturn on Invested Capital (\"ROIC\") and economic return. We use a financial model that is aligned with our business strategy and includes an ROIC goal of 15% which would exceed our weighted average cost of capital (\"WACC\") and represent positive economic return. Economic return is the amount our ROIC exceeds our WACC.\nNon-GAAP financial measures, including ROIC and economic return, are used for internal management goals and decision making because such measures provide management and investors additional insight into financial performance. In particular, we provide ROIC and economic return because we believe they offer insight into the metrics that are driving management decisions. We view ROIC and economic return as important measures in evaluating the efficiency and effectiveness of our long-term capital investments. We also use ROIC as a performance criteria in determining certain elements of compensation as well as economic return performance.\nWe define ROIC as tax-effected operating income before restructuring and other special items divided by average invested capital over a rolling five-quarter period. Invested capital is defined as equity plus debt and operating lease liabilities, less cash and cash equivalents. Other companies may not define or calculate ROIC in the same way. ROIC and other non-GAAP financial measures should be considered in addition to, not as a substitute for, measures of our financial performance prepared in accordance with U.S. generally accepted accounting principles (\"GAAP\").\nWe review our internal calculation of WACC annually. Our WACC was 9.3% for fiscal 2022 and 8.1% for fiscal 2021. By exercising discipline to generate ROIC in excess of our WACC, our goal is to create value for our shareholders. Fiscal 2022 ROIC of 13.0% reflects an economic return of 3.7%, based on our weighted average cost of capital of 9.3%, and fiscal 2021 ROIC of 15.4% reflects an economic return of 7.3%, based on our weighted average cost of capital of 8.1%.\nFor a reconciliation of ROIC, economic return and adjusted operating income (tax effected) to our financial statements that were prepared using GAAP, see Exhibit 99.1 to this annual report on Form 10-K, which exhibit is incorporated herein by reference.\nRefer to the table below, which includes the calculation of ROIC and economic return for the indicated fiscal years (dollars in millions):\n2022 2021\nAdjusted operating income (tax-effected) $ 156.8 $ 156.2\nAverage invested capital 1,207.4 1,014.7\nAfter-tax ROIC 13.0 % 15.4 %\nWACC 9.3 % 8.1 %\nEconomic return 3.7 % 7.3 %\nLIQUIDITY AND CAPITAL RESOURCES\nCash and cash equivalents and restricted cash were $275.5 million as of October 1, 2022, as compared to $270.5 million as of October 2, 2021.\nAs of October 1, 2022, 78% of our cash and cash equivalents balance was held outside of the U.S. by our foreign subsidiaries. Currently, we believe that our cash balance, together with cash available under our Credit Facility, will be sufficient to meet our liquidity needs and potential share repurchases, if any, for the next twelve months and for the foreseeable future.\nOur future cash flows from operating activities will be reduced by $47.7 million due to cash payments for U.S. federal taxes on the deemed repatriation of undistributed foreign earnings that are payable over an eight year period that began in fiscal 2019 with the first payment. The table below provides the expected timing of these future cash outflows, in accordance with the following installment schedule for the remaining four years (in millions):\n2023 $ 5.7\n2024 10.6\n2025 14.1\n2026 17.3\nTotal $ 47.7\nCash Flows. The following table provides a summary of cash flows for fiscal 2022 and 2021 (in millions):\n2022 2021\nCash (used in) provided by operating activities $ (26.2) $ 142.6\nCash used in investing activities (101.6) (57.0)\nCash provided by (used in) financing activities 139.3 (203.9)\nEffect of exchange rate changes on cash and cash equivalents (6.5) 0.9\nNet increase (decrease) in cash and cash equivalents and restricted cash $ 5.0 $ (117.4)\nOperating Activities. Cash flows used in operating activities were $26.2 million for fiscal 2022, as compared to cash flows provided by operating activities of $142.6 million for fiscal 2021. The decrease was primarily due to cash flow (reductions) improvements of:\n$(446.5) million in inventory cash flows primarily attributable to longer lead times for certain components as a result of supply chain constraints, increasing our inventory as we retain components until the entirety of the assembly's materials are received. Supply chain constraints have also led to inflation in some of the components we acquire, increasing inventory. In addition, inventory levels have increased to support the ramp of customer programs.\n$(196.5) million in accounts receivable cash flows driven by increased net sales as well as timing of customer shipments and payments.\n$(22.1) million in contract assets cash flows, driven by increased demand from customers who recognize revenue over time in the current year compared to consistent demand in the prior year.\n$24.8 million in other current and non-current asset cash flows, driven by a greater increase in prepaid expenses and miscellaneous receivables in the prior year.\n$64.3 million in accounts payables cash flows driven by increased purchasing activity to support the ramp of customer programs as well as supply chain constraints leading to inflation in some of the components we acquire.\n$167.8 million in other current and non-current liabilities cash flows driven by an increase in advance payments from customers to cover inflated component prices driven by supply chain constraints.\n$237.7 million in customer deposit cash flows driven by significant deposits received from customers in the current year to cover certain inventory balances associated with longer lead-times and inflation in some of the components we acquire as a result of supply chain constraints.\nThe following table provides a summary of cash cycle days for the periods indicated (in days):\nThree Months Ended\nOctober 1,\n2022 October 2,\nDays in accounts receivable 60 56\nDays in contract assets 11 13\nDays in inventory 144 116\nDays in accounts payable (72) (76)\nDays in cash deposits (43) (24)\nAnnualized cash cycle 100 85\nWe calculate days in accounts receivable and contract assets as each balance sheet item for the respective quarter divided by annualized sales for the respective quarter by day. We calculate days in inventory, accounts payable and cash deposits as each balance sheet line item for the respective quarter divided by annualized cost of sales for the respective quarter by day. We calculate annualized cash cycle as the sum of days in accounts receivable, days in contract assets and days in inventory, less days in accounts payable and days in cash deposits.\nAs of October 1, 2022, annualized cash cycle days increased fifteen days compared to October 2, 2021 due to the following:\nDays in accounts receivable for the three months ended October 1, 2022 increased four days compared to the three months ended October 2, 2021. The increase is primarily attributable to the timing of customer shipments and payments and mix of customer payment terms, partially offset by an increase in factored receivables.\nDays in contract assets for the three months ended October 1, 2022 decreased two days compared to the three months ended October 2, 2021. The decrease is primarily attributable to increased net sales, partially offset by increased demand from customers with arrangements requiring revenue to be recognized over time as products are produced.\nDays in inventory for the three months ended October 1, 2022 increased twenty-eight days compared to the three months ended October 2, 2021. The increase is primarily attributable to longer lead times for certain components as a result of supply chain constraints, increasing our inventory level as we retain components until the entirety of the assembly's materials are received. Supply chain constraints have also led to inflation in some of the components we acquire, increasing inventory. In addition, inventory levels have increased to support the ramp of customer programs.\nDays in accounts payable for the three months ended October 1, 2022 decreased four days compared to the three months ended October 2, 2021. The decrease is primarily attributable to timing of materials procurement and payments to suppliers, as well as increased net sales.\nDays in cash deposits for the three months ended October 1, 2022 increased nineteen days compared to the three months ended October 2, 2021. The increase was primarily attributable to significant deposits received from customers to cover certain increasing inventory balances.\nFree Cash Flow. We define free cash flow (\"FCF\"), a non-GAAP financial measure, as cash flow (used in) provided by operations less capital expenditures. FCF was $(127.9) million for fiscal 2022 compared to $85.5 million for fiscal 2021, a decrease of $213.4 million. The decrease in FCF was primarily due to working capital investments, particularly in inventory, to support our customers.\nNon-GAAP financial measures, including FCF, are used for internal management assessments because such measures provide additional insight to investors into ongoing financial performance. In particular, we provide FCF because we believe it offers insight into the metrics that are driving management decisions. We view FCF as an important financial metric as it demonstrates our ability to generate cash and can allow us to pursue opportunities that enhance shareholder value. FCF is a non-GAAP financial measure that should be considered in addition to, not as a substitute for, measures of our financial performance prepared in accordance with GAAP.\nA reconciliation of FCF to our financial statements that were prepared using GAAP as follows (in millions):\n2022 2021\nCash flows (used in) provided by operating activities $ (26.3) $ 142.6\nPayments for property, plant and equipment (101.6) (57.1)\nFree cash flow $ (127.9) $ 85.5\nInvesting Activities. Cash flows used in investing activities were $101.6 million for fiscal 2022 compared to $57.0 million for fiscal 2021. The increase in cash used in investing activities was due to a $44.5 million increase in capital expenditures, primarily due to our manufacturing footprint expansion in Bangkok, Thailand.\nWe utilized available cash and financing cash flows as the sources for funding our operating requirements during fiscal 2022. We currently estimate capital expenditures for fiscal 2023 will be approximately $110.0 million to $130.0 million to support new program ramps and replace older equipment. This estimate does not contemplate any site expansions.\nFinancing Activities. Cash flows provided by financing activities were $139.3 million for fiscal 2022 compared to cash flows used in financing activities of $203.9 million for fiscal 2021. The increase was primarily attributable to an increase of $291.0 million in net borrowings on the credit facility and a decrease of $58.1 million in cash used to repurchase our common stock.\nOn August 20, 2019, the Board of Directors approved a share repurchase program under which we were authorized to repurchase $50.0 million of our common stock (the \"2019 Program\"). The 2019 Program commenced upon completion of previous share repurchase programs. During fiscal 2021, we repurchased 73,560 shares under this program for $5.3 million at an average price of $72.44 per share.\nOn August 13, 2020, the Board of Directors approved a share repurchase program under which we were authorized to repurchase up to $50.0 million of our common stock (the \"2021 Program\"). On November 18, 2020, the Board of Directors approved an additional $50.0 million in share repurchase authority under the existing 2021 Program such that there then existed a total of $100.0 million in share repurchase authority under the program. The 2021 program commenced upon completion of the 2019 Program. During fiscal 2021, we completed the 2021 Program by repurchasing 1,171,246 shares under this program for $100.0 million at an average price of $85.40 per share.\nOn August 11, 2021, the Board of Directors approved a share repurchase program under which we were authorized to repurchase up to $50.0 million of its common stock (the \"2022 Program\"). The 2022 Program commenced upon completion of the 2021 Program. During fiscal 2022 and 2021, we completed the 2022 Program by repurchasing 564,718 and 34,381 shares under this program for $46.9 million and $3.1 million at an average price of $83.07 and $90.16 per share, respectively.\nOn August 18, 2022, the Board of Directors approved a share repurchase program under which we are authorized to repurchase up to $50.0 million of its common stock (the \"2023 Program\"). The 2023 Program became effective immediately and has no expiration. During fiscal 2022, we purchased 38,397 shares under this program for $3.5 million at an average price of $90.63 per share. As of October 1, 2022, $46.5 million of authority remained under the 2023 Program.\nAll shares repurchased under the aforementioned programs were recorded as treasury stock.\nOn June 15, 2018, we entered into a Note Purchase Agreement (the 2018 NPA) pursuant to which we issued an aggregate of $150.0 million in principal amount of unsecured senior notes, consisting of $100.0 million in principal amount 4.05% Series A Senior Notes, due on June 15, 2025, and $50.0 million in principal amount of 4.22% Series B Senior Notes, due on June 15, 2028 (collectively, the 2018 Notes), in a private placement. The 2018 NPA includes customary operational and financial covenants with which we are required to comply, including, among others, maintenance of certain financial ratios such as a total leverage ratio and a minimum interest coverage ratio. The 2018 Notes may be prepaid in whole or in part at any time, subject to payment of a make-whole amount; interest on the 2018 Notes is payable semiannually. As of October 1, 2022, we were in compliance with the covenants under the 2018 NPA.\nOn June 9, 2022, we refinanced our then-existing senior unsecured revolving credit facility (as amended by that certain Amendment No. 1 to Credit Agreement dated April 29, 2020, the \"Prior Credit Facility\") by entering into a new 5-year revolving credit facility (collectively with the Prior Credit Facility, referred to as the \"Credit Facility\"), which expanded the maximum commitment from $350.0 million to $500.0 million and extended the maturity from May 15, 2024 to June 9, 2027. The maximum commitment under the Credit Facility may be further increased to $750.0 million, generally by mutual agreement of the lenders and us, subject to certain customary conditions. During fiscal 2022, the highest daily borrowing was $385.0 million; the average daily borrowings were $232.1 million. We borrowed $758.0 million and repaid $550.0 million of revolving borrowings (\"revolving commitment\") under the Credit Facility during fiscal 2022. As of October 1, 2022, we were in compliance with all financial covenants relating to the Credit Facility, which are generally consistent with those in the 2018 NPA discussed above. We are required to pay a commitment fee on the daily unused credit facility based on our leverage ratio; the fee was 0.125% as of October 1, 2022.\nThe Credit Facility and the 2018 NPA allow for the future payment of cash dividends or the repurchase of shares provided that no event of default (including any failure to comply with a financial covenant) exists at the time of, or would be caused by, the dividend payment or the share repurchases. We have not paid cash dividends in the past. However, we evaluate from time to time potential uses of excess cash, which in the future may include share repurchases above those already authorized, a special dividend or recurring dividends.\nWe have Master Accounts Receivable Purchase Agreements with MUFG Bank, New York Branch (formerly known as The Bank of Tokyo-Mitsubishi UFJ, Ltd.) (the \"MUFG RPA\"), HSBC Bank (China) Company Limited, Xiamen branch (the \"HSBC RPA\") and other unaffiliated financial institutions, under which we may elect to sell receivables, at a discount. These facilities are uncommitted facilities. The maximum facility amount under the MUFG RPA as of October 1, 2022 is $340.0 million. The maximum facility amount under the HSBC RPA as of October 1, 2022 is $60.0 million. The MUFG RPA will be automatically extended each year unless any party gives no less than 10 days prior notice that the agreement should not be extended. The terms of the HSBC RPA are generally consistent with the terms of the MUFG RPA previously discussed.\nWe sold $787.5 million and $730.5 million of trade accounts receivable under these programs during fiscal 2022 and 2021, respectively, in exchange for cash proceeds of $783.1 million and $728.4 million, respectively. As of October 1, 2022 and October 2, 2021, $222.5 million and $176.0 million, respectively, of accounts receivables sold under trade accounts receivable programs and subject to servicing by us remained outstanding and had not yet been collected.\nIn all cases, the sale discount was recorded within \"Miscellaneous, net\" in the Consolidated Statements of Comprehensive Income in the period of the sale. For further information regarding the receivable sale programs, see Note 14, \"Trade Accounts Receivable Sale Programs,\" in Notes to Consolidated Financial Statements.\nBased on current expectations, we believe that our projected cash flows provided by operations, available cash and cash equivalents, potential borrowings under the Credit Facility and our leasing capabilities should be sufficient to meet our working capital and fixed capital requirements, as well as execution upon our share repurchase authorizations as management deems appropriate, for the next twelve months. We believe our balance sheet is positioned to support the potential future challenges presented by macro-economic factors including increased working capital requirements associated with longer lead-times for components, increased component and labor costs, and operating inefficiencies due to supply chain constraints or workplace safety restrictions. As of the end of the fourth quarter of fiscal 2022, cash and cash equivalents and restricted cash were $275 million, while debt, finance lease obligations and other financing were $462 million. To further ensure our ability to meet the needs of working capital investments to support anticipated revenue growth, we refinanced our credit facility, expanding the maximum commitment from $350.0 million to $500.0 million, as discussed above. If our future financing needs increase, then we may need to arrange additional debt or equity financing. Accordingly, we evaluate and consider from time to time various financing alternatives to supplement our financial resources. However, we cannot be assured that we will be able to make any such arrangements on acceptable terms or at all.\nCONTRACTUAL OBLIGATIONS, COMMITMENTS AND OFF-BALANCE SHEET OBLIGATIONS\nOur disclosures regarding contractual obligations and commercial commitments are located in various parts of our regulatory filings. Information in the following table provides a summary of our contractual obligations and commercial commitments as of October 1, 2022 (dollars in millions):\nPayments Due by Fiscal Year\nContractual Obligations Total 2023 2024-2025 2026-2027 2028 and thereafter\nDebt Obligations (1) $ 437.9 $ 269.2 $ 112.4 $ 4.2 $ 52.1\nFinance Lease Obligations 119.5 10.2 14.5 10.3 84.5\nOperating Lease Obligations 48.1 9.5 14.0 10.1 14.5\nPurchase Obligations (2) 1,992.5 1,609.3 370.3 5.4 7.5\nRepatriation Tax on Undistributed Foreign Earnings (3) 47.7 5.7 24.7 17.3 -\nOther Liabilities on the Balance Sheet (4) 12.9 1.7 1.3 0.1 9.8\nOther Liabilities not on the Balance Sheet (5) 11.1 6.5 - 1.2 3.4\nTotal Contractual Cash Obligations $ 2,669.7 $ 1,912.1 $ 537.2 $ 48.6 $ 171.8\n1)Debt obligations includes $150.0 million in principal amount of 2018 Notes and $263.0 million of borrowings on the revolving commitment of the Credit Facility, as well as interest.\n2)Purchase obligations consist primarily of purchases of inventory and equipment in the ordinary course of business.\n3)Repatriation tax on undistributed foreign earnings consists of U.S. federal income taxes on the deemed repatriation of undistributed foreign earnings due to U.S. Tax Reform. Refer to \"Liquidity and Capital Resources\" above for further detail.\n4)Other obligations on the balance sheet included deferred compensation obligations to certain of our former and current executive officers, as well as other key employees, other financing obligations arising from information technology maintenance agreements and asset retirement obligations related to our buildings. We have excluded from the above table the impact of approximately $9.0 million, as of October 1, 2022, related to unrecognized income tax benefits. We cannot make reliable estimates of the future cash flows by period related to these obligations.\n5)Other obligations not on the balance sheet consist of guarantees and a commitment for salary continuation and certain benefits in the event employment of one executive officer is terminated without cause. Excluded from the amounts disclosed are certain bonus and incentive compensation amounts, which would be paid on a prorated basis in the year of termination.\nDISCLOSURE ABOUT CRITICAL ACCOUNTING ESTIMATES\nOur accounting policies are disclosed in Note 1 \"Description of Business and Significant Accounting Policies\" of Notes to Consolidated Financial Statements. During fiscal 2022 there were no material changes to these policies. Our critical accounting estimates are described below:\nRevenue Recognition: Revenue is recognized over time for arrangements with customers for which: (i) our performance does not create an asset with an alternative use to us, and (ii) we have an enforceable right to payment, including reasonable profit margin, for performance completed to date. If either of the two conditions noted above are not met to recognize revenue over time, revenue is recognized following the transfer of control of such products to the customer, which typically occurs upon shipment or delivery depending on the terms of the underlying arrangement.\nFor contracts requiring over time revenue recognition, we calculate the revenue to recognize using the costs incurred to date plus a reasonable profit margin. We use historical information to estimate the profit margin associated with the performance obligation that is satisfied over time. We reevaluate our estimate of profit margins on a quarterly basis. While experience has shown that trends in profit margins are not volatile, changes in pricing or cost efficiencies could create significant fluctuations for certain performance obligations. As actual experience becomes available, we use the data to update the historical averages and compare the results to estimates. Based on review of profits margins we update our estimate to the model as necessary.\nSee Note 15 \"Revenue from Contracts with Customers\" of Notes to Consolidated Financial Statements for further information on our revenue recognition policies.\nIncome Taxes: Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. We maintain valuation allowances when it is more likely than not that all or a portion of a deferred tax asset will not be realized. In determining whether a valuation allowance is required, we take into account such factors as:\nPrior earnings history. A pattern of recent financial reporting losses in a jurisdiction is heavily weighted as a source of negative evidence. We also consider the strength and trend of earnings, as well as other relevant factors. In certain circumstances, historical earnings may not be as relevant due to changes in our business operations;\nExpected future earnings. Future reversals of existing temporary differences are heavily weighted sources of objectively verifiable positive evidence. Projections of future taxable income exclusive of reversing temporary differences are an additional source of positive evidence;\nTax planning strategies. If necessary and available, tax planning strategies would be implemented to accelerate taxable amounts to utilize expiring carryforwards. These strategies would be a source of additional positive evidence.\nSee Note 6 \"Income Taxes\" of Notes to Consolidated Financial Statements for further information on our income tax policies.\nNEW ACCOUNTING PRONOUNCEMENTS\nSee Note 1, \"Description of Business and Significant Accounting Policies,\" in Notes to Consolidated Financial Statements regarding recent accounting pronouncements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are exposed to market risk from changes in foreign exchange and interest rates. We selectively use financial instruments to reduce such risks. We do not use derivative financial instruments for speculative purposes.\nForeign Currency Risk\nOur international operations create potential foreign exchange risk. Our policy is to selectively hedge our foreign currency denominated transactions in a manner that partially offsets the effects of changes in foreign currency exchange rates. We typically use foreign currency contracts to hedge only those currency exposures associated with certain assets and liabilities denominated in non-functional currencies. Corresponding gains and losses on the underlying transaction generally offset the gains and losses on these foreign currency hedges. We cannot predict changes in currency rates, nor the degree to which we will be able to manage the impacts of currency exchange rate changes. Such changes could have a material effect on our business, results of operations and financial condition.\nOur percentages of transactions denominated in currencies other than the U.S. dollar for the indicated fiscal years were as follows:\n2022 2021\nNet Sales 9% 10%\nTotal Costs 16% 16%\nWe have evaluated the potential foreign currency exchange rate risk on transactions denominated in currencies other than the U.S. dollar for the periods presented above. Based on our overall currency exposure, as of October 1, 2022, a 10.0% change in the value of the U.S. dollar relative to our other transactional currencies would not have a material effect on our financial position, results of operations, or cash flows.\nInterest Rate Risk\nWe have financial instruments, including cash equivalents and debt, which are sensitive to changes in interest rates. The primary objective of our investment activities is to preserve principal, while maximizing yields without significantly increasing market risk. To achieve this, we limit the amount of principal exposure to any one issuer.\nAs of October 1, 2022, our only material interest rate risk was associated with our Credit Facility. Borrowings under the Credit Facility bear interest, at the Company's option, at (a)(1) for borrowings denominated in U.S. dollars, the Term Secured Overnight Financing Rate (\"SOFR\"), (2) for borrowings denominated in pounds sterling, the Daily Simple Risk-Free Rate, plus, in each case of (a)(1) and (2), 10 basis points, (b) for borrowings denominated in euros, the EURIBOR Rate plus a statutory reserve rate, or (c) an Alternate Base Rate equal to the highest of (i) 100 basis points per annum, (ii) the prime rate last quoted by The Wall Street Journal (or, if not quoted, as otherwise provided in the Credit Facility), (iii) the greater of the federal funds effective rate and the overnight bank funding rate in effect on such day plus, in each case, 50 basis points per annum (or, if neither are available, as otherwise provided in the Credit Facility), and (iv) Term SOFR for a one month interest period on such day plus 110 basis points, plus, in each case of (a), (b), and (c), an applicable interest rate margin based on the Company's then current consolidated total indebtedness (minus certain unrestricted cash and cash equivalents in an amount not to exceed $100 million) to consolidated EBITDA. As of October 1, 2022, the borrowing rate under the Credit Facility was SOFR plus 1.10%. Borrowings under the 2018 NPA are based on a fixed interest rate, thus mitigating much of our interest rate risk. Based on our overall interest rate exposure, as of October 1, 2022, a 10.0% change in interest rates would not have a material effect on our financial position, results of operations, or cash flows. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nPLEXUS CORP.\nList of Financial Statements and Financial Statement Schedule\nOctober 1, 2022\nContents Pages\nReport of Independent Registered Public Accounting Firm\nConsolidated Financial Statements:\nConsolidated Statements of Comprehensive Income for the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\nConsolidated Balance Sheets as of October 1, 2022 and October 2, 2021\nConsolidated Statements of Shareholders Equity for the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\nConsolidated Statements of Cash Flows for the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\nNotes to Consolidated Financial Statements\nFinancial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts for the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\nNOTE: All other financial statement schedules are omitted because they are not applicable or the required information is included in the Consolidated Financial Statements or notes thereto.\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Plexus Corp.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Plexus Corp. and its subsidiaries (the Company) as of October 1, 2022 and October 2, 2021, and the related consolidated statements of comprehensive income, of shareholders' equity and of cash flows for each of the three years in the period ended October 1, 2022, including the related notes and financial statement schedule listed in the accompanying index (collectively referred to as the \"consolidated financial statements\"). We also have audited the Company's internal control over financial reporting as of October 1, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of October 1, 2022 and October 2, 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 1, 2022 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 1, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Annual Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition\nAs described in Note 1 to the consolidated financial statements, revenue is recognized over time for arrangements with customers for which: (i) the Company's performance does not create an asset with an alternative use to the Company, and (ii) the Company has an enforceable right to payment, including reasonable profit margin, for performance completed to date. Revenue recognized over time is estimated based on costs incurred to date plus a reasonable profit margin. If either of the two conditions are not met to recognize revenue over time, revenue is recognized following the transfer of controls of such products to the customer, which typically occurs upon shipment or delivery depending on the terms of the underlying arrangement. For the year ended October 1, 2022, the Company's net sales were $3.8 billion.\nThe principal consideration for our determination that performing procedures relating to revenue recognition is a critical audit matter is the significant audit effort in performing procedures related to the Company's revenue recognition.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process. These procedures also included, among others, (i) evaluating revenue transactions by testing the issuance and settlement of invoices and credit memos, (ii) tracing transactions not settled to a detailed listing of accounts receivable, (iii) confirming a sample of outstanding customer invoice balances at year end and obtaining and inspecting source documents, including invoices, sales contracts, and subsequent cash receipts, where applicable, for confirmations not returned, (iv) testing the completeness and accuracy of data provided by management, and (v) testing the appropriateness of the timing and amount of revenue recognized based on whether the contract meets the conditions to recognize revenue over time.\n/s/ PricewaterhouseCoopers LLP\nMilwaukee, Wisconsin\nNovember 18, 2022\nWe have served as the Companys auditor since at least 1985. We have not been able to determine the specific year we began serving as auditor of the Company.\nPLEXUS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nfor the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\n(in thousands, except per share data)\n2022 2021 2020\nNet sales $ 3,811,368 $ 3,368,865 $ 3,390,394\nCost of sales 3,464,139 3,045,569 3,077,688\nGross profit 347,229 323,296 312,706\nSelling and administrative expenses 167,023 143,761 153,331\nRestructuring and impairment charges 2,021 3,267 6,003\nOperating income 178,185 176,268 153,372\nOther income (expense):\nInterest expense (15,858) (14,253) (16,162)\nInterest income 1,305 1,372 1,878\nMiscellaneous, net (5,329) (2,976) (3,691)\nIncome before income taxes 158,303 160,411 135,397\nIncome tax expense 20,060 21,499 17,918\nNet income $ 138,243 $ 138,912 $ 117,479\nEarnings per share:\nBasic $ 4.96 $ 4.86 $ 4.02\nDiluted $ 4.86 $ 4.76 $ 3.93\nWeighted average shares outstanding:\nBasic 27,862 28,575 29,195\nDiluted 28,439 29,167 29,916\nComprehensive income:\nNet income $ 138,243 $ 138,912 $ 117,479\nOther comprehensive (loss) income:\nDerivative instrument and other fair value adjustments (5,201) (1,165) 1,831\nForeign currency translation adjustments (27,843) 3,240 10,894\nOther comprehensive (loss) income (33,044) 2,075 12,725\nTotal comprehensive income $ 105,199 $ 140,987 $ 130,204\nThe accompanying notes are an integral part of these consolidated financial statements.\nPLEXUS CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nas of October 1, 2022 and October 2, 2021\n(in thousands, except per share data)\n2022 2021\nASSETS\nCurrent assets:\nCash and cash equivalents $ 274,805 $ 270,172\nRestricted cash 665 341\nAccounts receivable, net of allowances of $1,961 and $1,188, respectively\n737,696 519,684\nContract assets 138,540 115,283\nInventories, net 1,602,783 972,312\nPrepaid expenses and other 61,633 53,094\nTotal current assets 2,816,122 1,930,886\nProperty, plant and equipment, net 444,705 395,094\nOperating lease right-of-use assets 65,134 72,087\nDeferred income taxes 39,075 27,385\nOther assets 28,189 36,441\nTotal non-current assets 577,103 531,007\nTotal assets $ 3,393,225 $ 2,461,893\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nCurrent portion of long-term debt and finance lease obligations $ 273,971 $ 66,313\nAccounts payable 805,583 634,969\nCustomer deposits 480,486 204,985\nAccrued salaries and wages 88,876 75,394\nOther accrued liabilities 357,273 147,042\nTotal current liabilities 2,006,189 1,128,703\nLong-term debt and finance lease obligations, net of current portion 187,776 187,033\nLong-term accrued income taxes payable 42,019 47,974\nLong-term operating lease liabilities 33,628 37,970\nDeferred income taxes payable 6,327 5,677\nOther liabilities 21,555 26,304\nTotal non-current liabilities 291,305 304,958\nTotal liabilities 2,297,494 1,433,661\nCommitments and contingencies\nShareholders equity:\nPreferred stock, $0.01 par value, 5,000 shares authorized, none issued or outstanding\n- -\nCommon stock, $0.01 par value, 200,000 shares authorized, 54,084 and 53,849 shares issued, respectively, and 27,679 and 28,047 shares outstanding, respectively\n541 538\nAdditional paid-in capital 652,467 639,778\nCommon stock held in treasury, at cost, 26,405 and 25,802 shares, respectively\n(1,093,483) (1,043,091)\nRetained earnings 1,572,234 1,433,991\nAccumulated other comprehensive loss (36,028) (2,984)\nTotal shareholders equity 1,095,731 1,028,232\nTotal liabilities and shareholders equity $ 3,393,225 $ 2,461,893\nThe accompanying notes are an integral part of these consolidated financial statements.\nPLEXUS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nfor the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\n(in thousands)\n2022 2021 2020\nCommon stock - shares outstanding\nBeginning of period 28,047 29,002 29,004\nExercise of stock options and vesting of other share-based awards 235 323 608\nTreasury shares purchased (603) (1,278) (610)\nEnd of period 27,679 28,047 29,002\nTotal stockholders' equity, beginning of period $ 1,028,232 $ 977,480 $ 865,576\nCommon stock - par value\nBeginning of period 538 535 529\nExercise of stock options and vesting of other share-based awards 3 3 6\nEnd of period 541 538 535\nAdditional paid-in capital\nBeginning of period 639,778 621,564 597,401\nShare-based compensation expense 23,377 24,326 24,280\nExercise of stock options and vesting of other share-based awards, including tax withholding (10,688) (6,112) (117)\nEnd of period 652,467 639,778 621,564\nTreasury stock\nBeginning of period (1,043,091) (934,639) (893,247)\nTreasury shares purchased (50,392) (108,452) (41,392)\nEnd of period (1,093,483) (1,043,091) (934,639)\nRetained earnings\nBeginning of period 1,433,991 1,295,079 1,178,677\nNet income 138,243 138,912 117,479\nCumulative effect adjustment for adoption of new accounting pronouncements (1) - - (1,077)\nEnd of period 1,572,234 1,433,991 1,295,079\nAccumulated other comprehensive loss\nBeginning of period (2,984) (5,059) (17,784)\nOther comprehensive (loss) income (33,044) 2,075 12,725\nEnd of period (36,028) (2,984) (5,059)\nTotal stockholders' equity, end of period $ 1,095,731 $ 1,028,232 $ 977,480\n(1) See Note 1, \"Description of Business and Significant Accounting Policies,\" for a discussion of recently adopted accounting pronouncements.\nThe accompanying notes are an integral part of these consolidated financial statements.\nPLEXUS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nfor the fiscal years ended October 1, 2022, October 2, 2021 and October 3, 2020\n(in thousands)\n2022 2021 2020\nCash flows from operating activities\nNet income $ 138,243 $ 138,912 $ 117,479\nAdjustments to reconcile net income to net cash flows from operating activities:\nDepreciation and amortization 62,689 61,014 56,690\nDeferred income taxes (10,800) (3,388) (3,583)\nShare-based compensation expense and related charges 23,336 24,763 24,280\nProvision for allowance for doubtful accounts - (2,405) 2,405\nAsset impairment charges - - 3,052\nOther, net 972 1,855 1,358\nChanges in operating assets and liabilities, excluding impacts of currency:\nAccounts receivable (230,022) (33,477) 8,796\nContract assets (23,445) (1,385) (22,488)\nInventories (652,989) (206,510) (56,420)\nOther current and non-current assets (1,212) (26,028) 3,343\nAccrued income taxes payable (713) (8,746) (9,570)\nAccounts payable 176,037 111,781 65,097\nCustomer deposits 282,034 44,359 18,864\nOther current and non-current liabilities 209,630 41,832 1,065\nCash flows (used in) provided by operating activities (26,240) 142,577 210,368\nCash flows from investing activities\nPayments for property, plant and equipment (101,612) (57,099) (50,088)\nOther, net 51 126 237\nCash flows used in investing activities (101,561) (56,973) (49,851)\nCash flows from financing activities\nBorrowings under debt agreements 758,000 376,739 679,042\nPayments on debt and finance lease obligations (556,726) (466,063) (638,298)\nDebt issuance costs (898) - (699)\nRepurchases of common stock (50,392) (108,452) (41,392)\nProceeds from exercise of stock options 480 3,555 12,827\nPayments related to tax withholding for share-based compensation (11,169) (9,664) (12,938)\nCash flows provided by (used in) financing activities 139,295 (203,885) (1,458)\nEffect of exchange rate changes on cash and cash equivalents (6,537) 900 2,581\nNet increase (decrease) in cash and cash equivalents and restricted cash 4,957 (117,381) 161,640\nCash and cash equivalents and restricted cash:\nBeginning of period 270,513 387,894 226,254\nEnd of period $ 275,470 $ 270,513 $ 387,894\nSupplemental disclosure information:\nInterest paid $ 15,293 $ 14,116 $ 14,885\nIncome taxes paid $ 16,916 $ 39,932 $ 31,458\nThe accompanying notes are an integral part of these consolidated financial statements.\nPlexus Corp.\nNotes to Consolidated Financial Statements\n1. Description of Business and Significant Accounting Policies\nDescription of Business: Plexus Corp. and its subsidiaries (together \"Plexus,\" the \"Company,\" or \"we\") participate in the Electronic Manufacturing Services (\"EMS\") industry. Since 1979, we have been partnering with companies to create the products that build a better world. We are a global leader with a team of nearly 25,000 individuals focused on providing Design and Development, Supply Chain Solutions, New Product Introduction, Manufacturing, and Sustaining Services. We specialize in serving customers in industries with highly complex products and demanding regulatory environments. We deliver customer service excellence to leading global companies in the Industrial, Healthcare/Life Sciences and Aerospace/Defense market sectors by providing innovative, comprehensive solutions throughout the products lifecycle. We provide these innovative solutions to customers in the Americas (\"AMER\"), Asia-Pacific (\"APAC\") and Europe, Middle East and Africa (\"EMEA\") regions.\nSignificant Accounting Policies\nConsolidation Principles and Basis of Presentation: The consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (\"GAAP\") and include the accounts of Plexus Corp. and its subsidiaries. All intercompany transactions have been eliminated. Certain prior period amounts have been reclassified to conform to the current period presentation.\nThe Companys fiscal year ends on the Saturday closest to September 30. The Company also uses a \"4-4-5\" weekly accounting system for the interim periods in each quarter. Each quarter, therefore, ends on a Saturday at the end of the 4-4-5 period. Periodically, an additional week must be added to the fiscal year to re-align with the Saturday closest to September 30. Fiscal 2020 included 53 weeks; therefore, the first quarter of fiscal 2020 included 14 weeks while all other fiscal quarters presented herein included 13 weeks. Fiscal 2022 and fiscal 2021 each included 52 weeks.\nThe preparation of financial statements requires management to make estimates and assumptions that affect the amounts reported in the Consolidated Financial Statements and notes thereto. The full extent to which current global events and economic conditions will impact the Company's business and operating results will depend on future developments that are highly uncertain and cannot be accurately predicted. The Company has considered information available as of the date of issuance of these financial statements and is not aware of any specific events or circumstances that would require an update to its estimates or judgments, or a revision of the carrying value of its assets or liabilities. These estimates may change as new events occur and additional information becomes available. Actual results could differ materially from these estimates.\nCash and Cash Equivalents and Restricted Cash: Cash equivalents include short-term highly liquid investments and are classified as Level 1 in the fair value hierarchy described below. Restricted cash represents cash received from customers to settle invoices sold under accounts receivable purchase agreements that the Company continues servicing and is contractually required to be set aside. The restrictions will lapse when the cash is remitted to the purchaser of the receivables. Restricted cash is also classified as Level 1 in the fair value hierarchy described below.\nAs of October 1, 2022 and October 2, 2021, cash and cash equivalents and restricted cash consisted of the following (in thousands):\n2022 2021\nCash $ 186,068 $ 173,018\nMoney market demand accounts and other 88,737 97,154\nRestricted cash 665 341\nTotal cash and cash equivalents and restricted cash $ 275,470 $ 270,513\nInventories: Inventories are valued at the lower of cost or market. Cost is determined by the first-in, first-out (\"FIFO\") method. Valuing inventories at the lower of cost or market requires the use of estimates and judgment. Customers may cancel their orders, change production quantities or delay production for a number of reasons that are beyond the Companys control. Any of these, or certain additional actions, could impact the valuation of inventory. Any actions taken by the Companys customers that could impact the value of its inventory are considered when determining the lower of cost or market valuations.\nIn certain instances, in accordance with contractual terms, the Company receives customer deposits to offset inventory risks.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nProperty, Plant and Equipment and Depreciation: Property, plant and equipment is stated at cost and depreciated using the straight-line method over the estimated useful lives of the respective assets. Estimated useful lives for major classes of depreciable assets are generally as follows:\nBuildings and improvements 5-39 years\nMachinery and equipment 3-7 years\nComputer hardware and software 3-10 years\nCertain facilities and equipment held under finance leases are classified as property, plant and equipment and amortized using the straight-line method over the term of the lease and the related obligations are recorded as liabilities. Amortization of assets held under finance leases is included in depreciation expense (see Note 3, \"Property, Plant and Equipment\") and the financing component of the lease payments is classified as interest expense. Maintenance and repairs are expensed as incurred.\nThe Company capitalizes significant costs incurred in the acquisition or development of software for internal use. This includes costs of the software, consulting services and compensation costs for employees directly involved in developing internal use computer software.\nImpairment of Long-Lived Assets: Long-lived assets, including property, plant and equipment, operating lease right-of-use assets and intangible assets with finite lives are reviewed for impairment and written down to fair value when facts and circumstances indicate that the carrying value of long-lived assets or asset groups may not be recoverable through estimated future undiscounted cash flows. If an impairment has occurred, a write-down to estimated fair value is made and the impairment loss is recognized as a charge against current operations. The impairment analysis is based on managements assumptions, including future revenue and cash flow projections. Circumstances that may lead to impairment of property, plant and equipment, operating lease right-of-use assets and intangible assets with finite lives include reduced expectations for future performance or industry demand and possible further restructurings, among others.\nRevenue Recognition: Revenue is recognized over time for arrangements with customers for which: (i) the Company's performance does not create an asset with an alternative use to the Company, and (ii) the Company has an enforceable right to payment, including reasonable profit margin, for performance completed to date. Revenue recognized over time is estimated based on costs incurred to date plus a reasonable profit margin. If either of the two conditions noted above are not met to recognize revenue over time, revenue is recognized following the transfer of control of such products to the customer, which typically occurs upon shipment or delivery depending on the terms of the underlying arrangement.\nThe Company recognizes revenue when a contract exists and when, or as, it satisfies a performance obligation by transferring control of a product or service to a customer. Contracts are accounted for when they have approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectability of consideration is probable. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer.\nThe Company generally enters into a master services arrangement that establishes the framework under which business will be conducted. These arrangements represent the master terms and conditions of the Company's services that apply to individual orders, but they do not commit the customer to work with, or to continue to work with, the Company nor do they obligate the customer to any specific volume or pricing of purchases. Moreover, these terms can be amended in appropriate situations. Customer purchase orders are received for specific quantities with predominantly fixed pricing and delivery requirements. Thus, for the majority of our contracts, there is no guarantee of any revenue to the Company until a customer submits a purchase order. As a result, the Company generally considers its arrangement with a customer to be the combination of the master services arrangement and the purchase order. Most of the Company's arrangements with customers create a single performance obligation as the promise to transfer the individual manufactured product or service is capable of being distinct.\nThe Companys performance obligations are satisfied over time as work progresses or at a point in time. A performance obligation is satisfied over time if the Company has an enforceable right to payment, including a reasonable profit margin. Determining if an enforceable right to payment includes a reasonable profit margin requires judgment and is assessed on a contract by contract basis.\nIf an enforceable right to payment for work-in-process does not exist, revenue is recognized following the transfer of control of such products to the customer, which typically occurs upon shipment or delivery depending on the terms of the underlying contract.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nFor contracts requiring over time revenue recognition, the selection of the method to measure progress towards completion requires judgment and is based on the nature of the products or services to be provided. The Company uses a cost-based input measurement of progress because it best depicts the transfer of assets to the customer, which occurs as costs are incurred during the manufacturing process or as services are rendered. Under the cost-based measure of progress, the extent of progress towards completion is measured based on the costs incurred to date.\nGenerally, there are no subjective customer acceptance requirements or further obligations related to goods or services provided; if such requirements or obligations exist, then a sale is recognized at the time when such requirements are completed and such obligations are fulfilled.\nThe Company does not allow for a general right of return. Net sales include amounts billed to customers for shipping and handling and out-of-pocket expenses. The corresponding shipping and handling costs and out-of-pocket expenses are included in cost of sales. Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by the Company from a customer, are excluded from net sales.\nNet sales from engineering design and development services, which are generally performed under contracts with a duration of twelve months or less, are typically recognized as program costs are incurred by utilizing the proportional performance model. The completed performance model is used if certain customer acceptance criteria exist. Any losses are recognized when anticipated. Net sales from engineering design and development services were less than 5.0% of consolidated net sales for each of fiscal 2022, 2021 and 2020.\nIncome Taxes: Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The Company maintains valuation allowances when it is more likely than not that all or a portion of a deferred tax asset will not be realized. In determining whether a valuation allowance is required, the Company takes into account such factors as prior earnings history, expected future earnings, carryback and carryforward periods, and tax strategies that could potentially enhance the likelihood of the realization of a deferred tax asset.\nForeign Currency Translation & Transactions: The Company translates assets and liabilities of subsidiaries operating outside of the U.S. with a functional currency other than the U.S. dollar into U.S. dollars using exchange rates in effect at the relevant balance sheet date and net sales, expenses and cash flows at the average exchange rates during the respective periods. Adjustments resulting from translation of the financial statements are recorded as a component of \"Accumulated other comprehensive loss.\" Exchange gains and losses arising from transactions denominated in a currency other than the functional currency of the entity involved and remeasurement adjustments for foreign operations where the U.S. dollar is the functional currency are included in the Consolidated Statements of Comprehensive Income as a component of \"Miscellaneous, net.\" Exchange losses on foreign currency transactions were $0.7 million, $1.1 million and $0.4 million for fiscal 2022, 2021 and 2020, respectively. These amounts include the amount of gain recognized in income during each fiscal year due to forward currency exchange contracts entered into to hedge recognized assets or liabilities (\"non-designated hedges\") the Company entered into during each respective year. Refer to Note 5, \"Derivatives and Fair Value Measurements,\" for further details on derivatives.\nDerivatives: All derivatives are recognized on the balance sheets at fair value. The Company periodically enters into forward currency exchange contracts and interest rate swaps. On the date a derivative contract is entered into, the Company designates the derivative as a non-designated hedge or a hedge of a forecasted transaction or of the variability of cash flows to be received or paid related to a recognized asset or liability (a \"cash flow\" hedge). The Company does not enter into derivatives for speculative purposes. Changes in the fair value of non-designated derivatives are recorded in earnings as are the gains or losses related to the hedged asset or liability. Changes in the fair value of a derivative that qualifies as a cash flow hedge are recorded in \"Accumulated other comprehensive loss\" within shareholders' equity, until earnings are affected by the variability of cash flows. Certain forward currency exchange contracts are treated as cash flow hedges and, therefore, $(5.0) million, $(2.2) million and $1.8 million was recorded in \"Accumulated other comprehensive loss\" for fiscal 2022, 2021 and 2020, respectively. See Note 5, \"Derivatives and Fair Value Measurements,\" for further information.\nEarnings Per Share: The computation of basic earnings per common share is based upon the weighted average number of common shares outstanding and net income. The computation of diluted earnings per common share reflects additional dilution from share-based awards, excluding any with an antidilutive effect. See Note 7, \"Earnings Per Share,\" for further information.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nShare-based Compensation: The Company measures all grants of share-based payments to employees, including grants of employee stock options, at fair value and expenses them in the Consolidated Statements of Comprehensive Income over the service period (generally the vesting period) of the grant. See Note 9, \"Benefit Plans,\" for further information.\nComprehensive Income (Loss): The Company follows the established standards for reporting comprehensive income (loss), which is defined as the changes in equity of an enterprise except those resulting from shareholder transactions.\nAccumulated other comprehensive loss consists of the following as of October 1, 2022 and October 2, 2021 (in thousands):\n2022 2021\nForeign currency translation adjustments $ (31,104) $ (3,261)\nCumulative derivative instrument fair value adjustments (5,779) (791)\nOther fair value adjustments 855 1,068\nAccumulated other comprehensive loss $ (36,028) $ (2,984)\nRefer to Note 5, \"Derivatives and Fair Value Measurements,\" for further explanation regarding the change in fair value of derivative instruments that is recorded to \"Accumulated other comprehensive loss.\"\nUse of Estimates: The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates.\nFair Value of Financial Instruments: The Company holds financial instruments consisting of cash and cash equivalents, restricted cash, accounts receivable, certain deferred compensation assets held under trust arrangements, accounts payable, debt, derivatives and finance and operating lease obligations. The carrying values of cash and cash equivalents, restricted cash, accounts receivable, accounts payable and finance and operating lease obligations as reported in the consolidated financial statements approximate fair value. Derivatives and certain deferred compensation assets held under trust arrangements are recorded at fair value. Accounts receivable are reflected at net realizable value based on anticipated losses due to potentially uncollectible balances. Anticipated losses are based on managements analysis of historical losses and changes in customers credit status. The fair value of the Companys debt excluding finance lease and other financing obligations was $401.6 million and $217.1 million as of October 1, 2022 and October 2, 2021, respectively. The carrying value of the Company's debt was $413.0 million and $205.0 million as of October 1, 2022 and October 2, 2021, respectively. The Company uses quoted market prices when available or discounted cash flows to calculate fair value. If measured at fair value in the financial statements, long-term debt (including the current portion) would be classified as Level 2 in the fair value hierarchy described below. The fair values of the Companys derivatives are disclosed in Note 5, \"Derivatives and Fair Value Measurements.\" The fair values of the deferred compensation assets held under trust arrangements are discussed in Note 9, \"Benefit Plans.\"\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (or exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. The accounting guidance establishes a fair value hierarchy based on three levels of inputs that may be used to measure fair value. The input levels are:\nLevel 1: Quoted (observable) market prices in active markets for identical assets or liabilities.\nLevel 2: Inputs other than Level 1 that are observable, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the asset or liability.\nLevel 3: Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the asset or liability.\nBusiness and Credit Concentrations: Financial instruments that potentially subject the Company to concentrations of credit risk consist of cash, cash equivalents, trade accounts receivable and derivative instruments, specifically related to counterparties. In accordance with the Companys investment policy, the Companys cash, cash equivalents and derivative instruments were placed with recognized financial institutions. The Companys investment policy limits the amount of credit exposure in any one issue and the maturity date of the investment securities that typically comprise investment grade short-term debt instruments. Concentrations of credit risk in accounts receivable resulting from sales to major customers are discussed in Note 11, \"Reportable Segments, Geographic Information and Major Customers\". The Company, at times, requires cash deposits for services performed. The Company also closely monitors extensions of credit.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nRecently Adopted Accounting Pronouncements:\nIn February 2016, the FASB issued ASU 2016-02 (Topic 842), which is intended to improve financial reporting of lease transactions by requiring lessees to recognize most leases as a right-of-use (ROU) asset and lease liability on their balance sheets for the rights and obligations created by leases, but record expenses on their income statements in a similar manner. Topic 842 also requires disclosures regarding the amount, timing and judgments related to accounting for an entity's leases and related cash flows. On September 29, 2019, the Company adopted Topic 842 using the modified retrospective method of adoption, which allows financial information for comparative periods prior to adoption not to be updated. Upon adoption, the Company recognized a $1.1 million reduction in retained earnings as a result of two existing build-to-suit arrangements for facilities in Guadalajara, Mexico that were reassessed to be finance leases under the new standard.\nRecently Issued Accounting Pronouncements Not Yet Adopted:\nIn September 2022, the FASB issued ASU 2022-04, which requires enhanced disclosures about supplier finance programs. This guidance is effective for the Company beginning in the first quarter of fiscal 2024. Early adoption is permitted. The Company is currently in the process of assessing the impacts of the guidance.\nThe Company believes that no other recently issued accounting standards will have a material impact on its Consolidated Financial Statements, or apply to its operations.\n2. Inventories\nInventories as of October 1, 2022 and October 2, 2021 consisted of the following (in thousands):\n2022 2021\nRaw materials $ 1,433,353 $ 860,538\nWork-in-process 81,207 48,356\nFinished goods 88,223 63,418\nTotal inventories, net $ 1,602,783 $ 972,312\nIn certain circumstances, per contractual terms, customer deposits are received by the Company to offset inventory risks. The total amount of customer deposits related to inventory and included within current liabilities on the accompanying Consolidated Balance Sheets as of October 1, 2022 and October 2, 2021 was $463.2 million and $200.6 million, respectively.\n3. Property, Plant and Equipment\nProperty, plant and equipment as of October 1, 2022 and October 2, 2021 consisted of the following (in thousands):\n2022 2021\nLand, buildings and improvements $ 386,623 $ 336,939\nMachinery and equipment 421,717 420,172\nComputer hardware and software 164,420 167,584\nCapital assets in progress 28,187 28,085\nTotal property, plant and equipment, gross 1,000,947 952,780\nLess: accumulated depreciation (556,242) (557,686)\nTotal property, plant and equipment, net $ 444,705 $ 395,094\nPlexus Corp.\nNotes to Consolidated Financial Statements\nAssets held under finance leases and included in property, plant and equipment as of October 1, 2022 and October 2, 2021 consisted of the following (in thousands):\n2022 2021\nBuildings and improvements $ 36,270 $ 35,360\nMachinery and equipment 25,362 26,657\nTotal property, plant and equipment held under finance leases, gross 61,632 62,017\nLess: accumulated amortization (21,569) (23,360)\nTotal property, plant and equipment held under finance leases, net $ 40,063 $ 38,657\nAs of October 1, 2022, October 2, 2021 and October 3, 2020, accounts payable included approximately $25.4 million, $17.3 million and $6.7 million, respectively, related to the purchase of property, plant and equipment, which have been treated as non-cash transactions for purposes of the Consolidated Statements of Cash Flows.\n4. Debt, Finance Lease Obligations and Other Financing\nDebt and finance lease obligations as of October 1, 2022 and October 2, 2021, consisted of the following (in thousands):\n2022 2021\n4.05% Senior Notes, due June 15, 2025\n$ 100,000 $ 100,000\n4.22% Senior Notes, due June 15, 2028\n50,000 50,000\nBorrowings under the Credit Facility 263,000 55,000\nFinance lease and other financing obligations 50,269 49,279\nUnamortized deferred financing fees (1,522) (933)\nTotal obligations 461,747 253,346\nLess: current portion (273,971) (66,313)\nLong-term debt and finance lease obligations, net of current portion $ 187,776 $ 187,033\nOn June 15, 2018, the Company entered into a Note Purchase Agreement (the 2018 NPA) pursuant to which it issued an aggregate of $150.0 million in principal amount of unsecured senior notes, consisting of $100.0 million in principal amount of 4.05% Series A Senior Notes, due on June 15, 2025, and $50.0 million in principal amount of 4.22% Series B Senior Notes, due on June 15, 2028 (collectively, the 2018 Notes), in a private placement. The 2018 NPA includes customary operational and financial covenants with which the Company is required to comply, including, among others, maintenance of certain financial ratios such as a total leverage ratio and a minimum interest coverage ratio. The 2018 Notes may be prepaid in whole or in part at any time, subject to payment of a make-whole amount; interest on the 2018 Notes is payable semiannually. As of October 1, 2022, the Company was in compliance with the covenants under the 2018 NPA.\nOn June 9, 2022, the Company refinanced its then-existing senior unsecured revolving credit facility (as amended by that certain Amendment No. 1 to Credit Agreement dated April 29, 2020, the \"Prior Credit Facility\") by entering into a new 5-year revolving credit facility (collectively with the Prior Credit Facility, referred to as the \"Credit Facility\"), which expanded the maximum commitment from $350.0 million to $500.0 million and extended the maturity from May 15, 2024 to June 9, 2027. The maximum commitment under the Credit Facility may be further increased to $750.0 million, generally by mutual agreement of the Company and the lenders, subject to certain customary conditions. During fiscal 2022, the highest daily borrowing was $385.0 million; the average daily borrowings were $232.1 million. The Company borrowed $758.0 million and repaid $550.0 million of revolving borrowings (\"revolving commitment\") under the Credit Facility during fiscal 2022. As of October 1, 2022, the Company was in compliance with all financial covenants relating to the Credit Facility, which are generally consistent with those in the 2018 NPA discussed above. The Company is required to pay a commitment fee on the daily unused credit facility based on the Company's leverage ratio; the fee was 0.125% as of October 1, 2022.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe aggregate scheduled maturities of the Companys debt obligations as of October 1, 2022, are as follows (in thousands):\n2023 $ 263,000\n2024 -\n2025 100,000\n2026 -\n2027 -\nThereafter 50,000\nTotal $ 413,000\nThe aggregate scheduled maturities of the Companys finance leases and other financing obligations as of October 1, 2022, are as follows (in thousands):\n2023 $ 10,971\n2024 3,316\n2025 2,362\n2026 676\n2027 609\nThereafter 32,335\nTotal $ 50,269\nThe Company's weighted average interest rate on finance lease obligations was 17.1% and 17.4% as of October 1, 2022 and October 2, 2021, respectively.\n5. Derivatives and Fair Value Measurements\nAll derivatives are recognized in the accompanying Consolidated Balance Sheets at their estimated fair value. The Company uses derivatives to manage the variability of foreign currency obligations. The Company has cash flow hedges related to forecasted foreign currency obligations, in addition to non-designated hedges to manage foreign currency exposures associated with certain foreign currency denominated assets and liabilities. The Company does not enter into derivatives for speculative purposes.\nThe Company designates some foreign currency exchange contracts as cash flow hedges of forecasted foreign currency expenses. Changes in the fair value of the derivatives that qualify as cash flow hedges are recorded in \"Accumulated other comprehensive loss\" in the accompanying Consolidated Balance Sheets until earnings are affected by the variability of the cash flows. In the next twelve months, the Company estimates that $6.0 million of unrealized losses, net of tax, related to cash flow hedges will be reclassified from other comprehensive income (loss) into earnings. Changes in the fair value of the non-designated derivatives related to recognized foreign currency denominated assets and liabilities are recorded in \"Miscellaneous, net\" in the accompanying Consolidated Statements of Comprehensive Income.\nThe Company enters into forward currency exchange contracts for its operations in Malaysia and Mexico on a rolling basis. The Company had cash flow hedges outstanding with a notional value of $143.2 million as of October 1, 2022, and a notional value of $107.4 million as of October 2, 2021. These forward currency contracts fix the exchange rates for the settlement of future foreign currency obligations that have yet to be realized. The total fair value of the forward currency exchange contracts was a $6.0 million liability as of October 1, 2022, and a $1.0 million liability as of October 2, 2021.\nThe Company had additional forward currency exchange contracts outstanding as of October 1, 2022, with a notional value of $60.1 million; there were $38.6 million such contracts outstanding as of October 2, 2021. The Company did not designate these derivative instruments as hedging instruments. The net settlement amount (fair value) related to these contracts is recorded on the Consolidated Balance Sheets as either a current or long-term asset or liability, depending on the term, and as an element of \"Miscellaneous, net\" in the Consolidated Statements of Comprehensive Income. The total fair value of these derivatives was a $0.3 million asset as of October 1, 2022, and a $0.2 million liability as of October 2, 2021.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe tables below present information regarding the fair values of derivative instruments (as defined in Note 1, \"Description of Business and Significant Accounting Policies\") and the effects of derivative instruments on the Companys Consolidated Financial Statements:\nFair Values of Derivative Instruments (in thousands)\nDerivative Assets Derivative Liabilities\nOctober 1,\n2022 October 2,\n2021 October 1,\n2022 October 2,\nDerivatives designated as hedging instruments Balance sheet\nclassification Fair Value Fair Value Balance sheet\nclassification Fair Value Fair Value\nForeign currency forward contracts Prepaid expenses and other $ 715 $ 76 Other accrued liabilities $ 6,747 $ 1,119\nFair Values of Derivative Instruments (in thousands)\nDerivative Assets Derivative Liabilities\nOctober 1,\n2022 October 2,\n2021 October 1,\n2022 October 2,\nDerivatives not designated as hedging instruments Balance sheet\nclassification Fair Value Fair Value Balance sheet\nclassification Fair Value Fair Value\nForeign currency forward contracts Prepaid expenses and other $ 1,555 $ 133 Other accrued liabilities $ 1,249 $ 356\nThe Effect of Cash Flow Hedge Accounting on Accumulated Other Comprehensive Loss (\"OCL\") (in thousands)\nfor the Twelve Months Ended\nDerivatives in cash flow hedging relationships Amount of (Loss) Gain Recognized in OCL on Derivatives\nOctober 1, 2022 October 2, 2021 October 3, 2020\nForeign currency forward contracts $ (7,637) $ 1,238 $ 446\nDerivative Impact on (Loss) Gain Recognized in Consolidated Statements of Comprehensive Income (in thousands)\nfor the Twelve Months Ended\nDerivatives in cash flow hedging relationships Classification of (Loss) Gain Reclassified from Accumulated OCL into Income Amount of (Loss) Gain Reclassified from Accumulated OCL into Income\nOctober 1, 2022 October 2, 2021 October 3, 2020\nForeign currency forward contracts Cost of sales $ (2,459) $ 3,205 $ (1,278)\nForeign currency forward contracts Selling and administrative expenses $ (189) $ 265 $ (107)\nDerivatives not designated as hedging instruments Location of (Loss) Gain Recognized on Derivatives in Income Amount of (Loss) Gain on Derivatives Recognized in Income\nOctober 1, 2022 October 2, 2021 October 3, 2020\nForeign currency forward contracts Miscellaneous, net $ (1,181) $ 98 $ (330)\nFair Value Measurements:\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (or exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. The Company uses quoted market prices when available or discounted cash flows to calculate fair value. The accounting guidance establishes a fair value hierarchy based on three levels of inputs that may be used to measure fair value. The input levels are:\nLevel 1: Quoted (observable) market prices in active markets for identical assets or liabilities.\nLevel 2: Inputs other than Level 1 that are observable, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the asset or liability.\nLevel 3: Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the asset or liability.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe following table lists the fair values of assets of the Companys derivatives as of October 1, 2022 and October 2, 2021, by input level:\nFair Value Measurements Using Input Levels Liability (in thousands)\nFiscal year ended October 1, 2022\nLevel 1 Level 2 Level 3 Total\nDerivatives\nForeign currency forward contracts $ - $ 5,726 $ - $ 5,726\nFiscal year ended October 2, 2021\nDerivatives\nForeign currency forward contracts $ - $ 1,266 $ - $ 1,266\nThe fair value of foreign currency forward contracts is determined using a market approach, which includes obtaining directly or indirectly observable values from third parties active in the relevant markets. Inputs in the fair value of the foreign currency forward contracts include prevailing forward and spot prices for currency.\n6. Income Taxes\nThe domestic and foreign components of income (loss) before income tax expense for fiscal 2022, 2021 and 2020 were as follows (in thousands):\n2022 2021 2020\nU.S. $ (64,267) $ (33,409) $ (69,102)\nForeign 222,570 193,820 204,499\n$ 158,303 $ 160,411 $ 135,397\nIncome tax expense (benefit) for fiscal 2022, 2021 and 2020 were as follows (in thousands):\n2022 2021 2020\nCurrent:\nFederal $ 12,506 $ 9,217 $ 8,779\nState 386 524 23\nForeign 17,968 15,146 12,699\n30,860 24,887 21,501\nDeferred:\nFederal (9,931) (1,153) (6,498)\nState (315) 1 3\nForeign (554) (2,236) 2,912\n(10,800) (3,388) (3,583)\n$ 20,060 $ 21,499 $ 17,918\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe following is a reconciliation of the federal statutory income tax rate to the effective income tax rates reflected in the Consolidated Statements of Comprehensive Income for fiscal 2022, 2021 and 2020:\n2022 2021 2020\nFederal statutory income tax rate 21.0 % 21.0 % 21.0 %\n(Decrease) increase resulting from:\nForeign tax rate differences (23.2) (20.3) (24.0)\nWithholding tax on dividends 2.2 2.9 1.9\nPermanent differences (0.8) (0.6) (2.6)\nExcess tax benefits related to share-based compensation (1.4) (0.9) (3.0)\nGlobal intangible low-taxed income (\"GILTI\") 10.4 6.4 13.8\nAudit settlements 3.7 5.0 -\nNon-deductible compensation 2.5 3.8 2.2\nValuation allowances (1.7) (3.7) 3.6\nTax credits, net (1.9) - -\nOther, net 1.9 (0.2) 0.3\nEffective income tax rate 12.7 % 13.4 % 13.2 %\nThe effective tax rate for fiscal 2022 was lower than the effective tax rate for fiscal 2021 primarily due to claiming a U.S. Research & Development tax credit and the geographic distribution of worldwide earnings. The effective tax rate for fiscal 2021 was relatively consistent compared to the effective tax rate for fiscal 2020.\nDuring fiscal 2022, the Company recorded a $2.8 million decrease to its valuation allowance primarily due to a net decrease of the valuation allowance in the EMEA segment driven by the release of the valuation allowance against the net deferred tax assets of a foreign subsidiary. This is partially offset by continuing losses in certain jurisdictions within the AMER segment.\nDuring fiscal 2021, the Company recorded a $5.9 million decrease to its valuation allowance primarily due to a net decrease of the valuation allowance in the EMEA segment driven by the release of the valuation allowance against the net deferred tax assets of a foreign subsidiary. This is partially offset by continuing losses in certain jurisdictions within the AMER segment.\nDuring fiscal 2020, the Company recorded a $4.8 million increase to its valuation allowance due to continuing losses in certain jurisdictions within the AMER and EMEA segments, partially offset by an expiration of net operating losses that had a valuation allowance recorded.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe components of the net deferred income tax assets as of October 1, 2022 and October 2, 2021, were as follows (in thousands):\n2022 2021\nDeferred income tax assets:\nLoss/credit carryforwards $ 24,575 $ 28,234\nInventories 21,869 15,231\nAccrued employee benefits 17,224 14,488\nAccrued liabilities 7,129 6,410\nLease obligation 17,427 18,977\nOther 6,536 6,719\nTotal gross deferred income tax assets 94,760 90,059\nLess valuation allowances (25,562) (30,321)\nDeferred income tax assets 69,198 59,738\nDeferred income tax liabilities:\nProperty, plant and equipment 19,878 19,055\nRight-of-use asset 10,538 12,279\nTax on unremitted earnings 6,034 4,654\nAcceleration of revenue under Topic 606 - 2,042\nDeferred income tax liabilities 36,450 38,030\nNet deferred income tax assets/(liabilities) $ 32,748 $ 21,708\nDuring fiscal 2022, the Companys valuation allowance decreased by $4.8 million, including the impact of foreign exchange movement. This decrease is the result of decreases to the valuation allowances against the net deferred tax assets in the EMEA region of $6.1 million, partially offset by increases to the valuation allowances in the AMER region of $1.2 million.\nAs of October 1, 2022, the Company had approximately $198.7 million of pre-tax state net operating loss carryforwards that expire between fiscal 2023 and 2043. Certain state net operating losses have a full valuation allowance against them. The Company also had approximately $46.5 million of pre-tax foreign net operating loss carryforwards that expire between fiscal 2025 and 2034 or are indefinitely carried forward. Certain foreign net operating losses have a full valuation allowance against them.\nThe Company has been granted a tax holiday for a foreign subsidiary in the APAC segment. This tax holiday will expire on December 31, 2034, and is subject to certain conditions with which the Company expects to continue to comply. During fiscal 2022, 2021 and 2020, the tax holiday resulted in tax reductions, net of the impact of the GILTI provisions of U.S. Tax Reform, of approximately $35.3 million ($1.27 per basic share, $1.24 per diluted share), $34.4 million ($1.20 per basic share, $1.18 per diluted share) and $28.3 million ($0.97 per basic share, $0.95 per diluted share), respectively.\nThe Company does not provide for taxes that would be payable if certain undistributed earnings of foreign subsidiaries were remitted because the Company considers these earnings to be permanently reinvested. The deferred tax liability that has not been recorded for these earnings was approximately $10.5 million as of October 1, 2022.\nThe Company has approximately $9.0 million of uncertain tax benefits as of October 1, 2022. The Company has classified these amounts in the Consolidated Balance Sheets as \"Other liabilities\" (non-current) in the amount of $8.6 million and an offset to \"Deferred income taxes\" (non-current asset) in the amount of $0.4 million as the payment is not anticipated within one year.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe following is a reconciliation of the beginning and ending amounts of unrecognized income tax benefits for the indicated fiscal years (in thousands):\n2022 2021 2020\nBalance at beginning of fiscal year $ 4,635 $ 2,096 $ 2,270\nGross increases for tax positions of prior years 2,421 623 509\nGross increases for tax positions of the current year 2,531 2,161 465\nGross decreases for tax positions of prior years (589) (245) (1,148)\nBalance at end of fiscal year $ 8,998 $ 4,635 $ 2,096\nThe amount of unrecognized tax benefits that, if recognized, would impact the effective tax rate is $8.6 million and $3.9 million for the fiscal years ended October 1, 2022 and October 2, 2021, respectively.\nThe Company recognizes accrued interest and penalties related to unrecognized tax benefits in income tax expense. The total accrued penalties and net accrued interest with respect to income taxes was approximately $0.5 million for fiscal 2022 and approximately $0.1 million for fiscal 2021 and 2020. The Company recognized $0.3 million of expense for accrued penalties and net accrued interest in the Consolidated Statements of Comprehensive Income for fiscal 2022, and less than $0.1 million in fiscal 2021 and 2020.\nIt is possible that a number of uncertain tax positions may be settled within the next 12 months. Settlement of these matters is not expected to have a material effect on the Companys consolidated results of operations, financial position and cash flows.\nThe Company files income tax returns, including returns for its subsidiaries, with federal, state, local and foreign taxing jurisdictions. The following tax years remain subject to examination by the respective major tax jurisdictions:\nJurisdiction Fiscal Years\nChina 2018-2022\nGermany 2019-2022\nMalaysia 2018-2022\nMexico 2018-2022\nRomania 2020-2022\nUnited Kingdom 2019-2022\nUnited States\nFederal 2015, 2017-2022\nState 2003-2006, 2009-2022\n7. Earnings Per Share\nThe following is a reconciliation of the amounts utilized in the computation of basic and diluted earnings per share for fiscal 2022, 2021 and 2020 (in thousands, except per share amounts):\n2022 2021 2020\nNet income $ 138,243 $ 138,912 $ 117,479\nBasic weighted average common shares outstanding 27,862 28,575 29,195\nDilutive effect of share-based awards and options outstanding 577 592 721\nDiluted weighted average shares outstanding 28,439 29,167 29,916\nEarnings per share:\nBasic $ 4.96 $ 4.86 $ 4.02\nDiluted $ 4.86 $ 4.76 $ 3.93\nIn each year of fiscal 2022, 2021 and 2020, share-based awards for less than 0.1 million shares were not included in the computation of diluted earnings per share as they were antidilutive.\nPlexus Corp.\nNotes to Consolidated Financial Statements\n8. Leases\nThe Companys lease portfolio includes both real estate and non-real estate type leases which are accounted for as either finance or operating leases. Real estate leases generally include office, warehouse and manufacturing facilities and non-real estate leases generally include office equipment and vehicles. The Company determines if a contract is or contains a lease at inception. The Companys leases have remaining lease terms of less than 1 year to 38 years. Renewal options that are deemed reasonably certain are included as part of the lease term for purposes of calculating the right-of-use (ROU) asset and lease liability. Variable lease payments are generally expensed as incurred and include certain index-based changes in rent, certain nonlease components, such as maintenance and other services provided by the lessor, and other charges included in the lease. The Company elected the practical expedient to not separate lease and nonlease components, as such nonlease components are included in the calculation of the ROU asset and lease liability and included in the lease expense over the term of the lease. The Company uses a discount rate to calculate the ROU asset and lease liability. When the implicit rate is known or provided in the lease documents, the Company is required to use this rate. In cases in which the implicit rate is not known, the Company uses an estimated incremental borrowing rate.\nOperating lease ROU assets and lease liabilities are recorded on the date the Company takes possession of the leased assets with expense recognized on a straight-line basis over the lease term. Leases with an estimated total term of 12 months or less are not recorded on the balance sheet and the lease expense is recognized on a straight-line basis over the lease term. Generally, the Company's lease agreements do not contain material residual value guarantees or material restrictive covenants.\nThe components of lease expense for fiscal years indicated were as follows (in thousands):\n2022 2021 2020\nFinance lease expense:\nAmortization of right-of-use assets $ 6,478 $ 6,290 $ 4,380\nInterest on lease liabilities 4,927 4,888 4,956\nOperating lease expense 11,278 11,034 11,707\nOther lease expense 6,185 4,794 3,401\nTotal $ 28,868 $ 27,006 $ 24,444\nBased on the nature of the ROU asset, amortization of finance right-of-use assets, operating lease expense and other lease expense are recorded within either cost of goods sold or selling and administrative expenses and interest on finance lease liabilities is recorded within interest expense on the Consolidated Statements of Comprehensive Income. Other lease expense includes lease expense for leases with an estimated total term of twelve months or less and variable lease expense related to variations in lease payments as a result of a change in factors or circumstances occurring after the lease possession date.\nThe following tables sets forth the amount of lease assets and lease liabilities included in the Companys Consolidated Balance Sheets (in thousands):\nFinancial Statement Line Item 2022 2021\nASSETS\nFinance lease assets Property, plant and equipment, net $ 40,063 $ 38,657\nOperating lease assets Operating lease right-of-use assets 65,134 72,087\nTotal lease assets $ 105,197 $ 110,744\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent\nFinance lease liabilities Current portion of long-term debt and finance lease obligations $ 5,087 $ 4,616\nOperating lease liabilities Other accrued liabilities 7,948 9,877\nNon-current\nFinance lease liabilities Long-term debt and finance lease obligations, net of current portion 39,257 36,919\nOperating lease liabilities Long-term operating lease liabilities 33,628 37,970\nTotal lease liabilities $ 85,920 $ 89,382\nPlexus Corp.\nNotes to Consolidated Financial Statements\nOther information related to the Companys leases was as follows:\n2022 2021\nWeighted-average remaining lease term (in years)\nFinance leases 11.1 11.6\nOperating leases 17.6 17.4\nWeighted-average discount rate\nFinance leases 17.1 % 17.4 %\nOperating leases 2.6 % 2.5 %\n2022 2021 2020\nCash paid for amounts included in the measurement of lease liabilities (in thousands)\nOperating cash flows used in finance leases $ 4,630 $ 4,571 $ 4,539\nOperating cash flows used in operating leases 10,278 10,667 10,907\nFinance cash flows used in finance leases 6,148 5,734 3,321\nROU assets obtained in exchange for lease liabilities (in thousands)\nOperating leases $ 4,710 $ 11,897 $ 7,692\nFinance leases 7,851 4,253 2,835\nFuture minimum lease payments required under finance and operating leases as of October 1, 2022, were as follows (in thousands):\nOperating leases Finance leases\n2023 $ 9,502 $ 10,246\n2024 7,810 7,531\n2025 6,209 6,967\n2026 5,594 5,137\n2027 4,461 5,216\nThereafter 14,526 84,389\nTotal minimum lease payments 48,102 119,486\nLess: imputed interest (6,526) (75,142)\nPresent value of lease liabilities $ 41,576 $ 44,344\nAs of October 1, 2022, the Companys future operating leases that have not yet commenced are immaterial.\n9. Benefit Plans\nShare-based Compensation Plans: The Plexus Corp. 2016 Omnibus Incentive Plan (the \"2016 Plan\"), which was approved by shareholders, is a stock and cash-based incentive plan, and includes provisions by which the Company may grant executive officers, employees and directors stock options, stock appreciation rights (\"SARs\"), restricted stock (including restricted stock units (\"RSUs\"), performance stock awards (including performance stock units (\"PSUs\"), other stock awards and cash incentive awards.\nThe maximum number of shares of Plexus common stock that may be issued pursuant to the 2016 Plan is 3.2 million shares; in addition, cash incentive awards of up to $4.0 million per employee may be granted annually. The exercise price of each stock option and SAR granted must not be less than the fair market value on the date of grant. The Compensation and Leadership Development Committee (the \"Committee\") of the Board of Directors may establish a term and vesting period for awards under the 2016 Plan as well as accelerate the vesting of such awards. Generally, stock options vest in two annual installments and have a term of ten years. SARs vest in two annual installments and have a term of seven years. RSUs granted to executive\nPlexus Corp.\nNotes to Consolidated Financial Statements\nofficers, other officers and key employees generally vest on the 3 year anniversary of the grant date (assuming continued employment), which is also the date as of which the underlying shares will be issued.\nPerformance stock units (\"PSUs\") are payable in shares of the Company's common stock and have a performance period of three years. For PSUs, approximately 50% vest based on the relative total shareholder return (\"TSR\") of the Company's common stock as compared to the companies in the Russell 3000 Index for grants issued in fiscal 2020 and the S&P 400 Index for grants issued in fiscal 2021 and beyond. Both are a market condition. The remaining approximately 50% of PSUs vest based upon a three-point annual average of the Company's absolute economic return, a performance condition, with grants made in fiscal 2021 and beyond being subject to an individual year minimum and maximum absolute economic return. The vesting and payout of awards will range between 0% and 200% of the shares granted based upon metrics during a performance period for PSUs based on economic return and PSUs based on TSR compared to the Russell 3000 Index. For PSUs based on TSR compared to the S&P 400 Index, the vesting and payout of awards will range between 0% and 150% of shares granted. Payout at target, 100% of the shares granted, will occur if the TSR of Plexus stock is at the 50th percentile of companies in the Russell 3000 Index or S&P 400 Index during the performance period and if a 2.5% average economic return is achieved over the performance period of three years. The number of shares that may be issued pursuant to PSUs ranges from zero to 0.5 million and is dependent upon the Company's TSR and economic return performance over the applicable performance periods. The Committee also grants RSUs to non-employee directors, which generally fully vest on the first anniversary of the grant date, which is also the date the underlying shares are issued (unless further deferred).\nThe Company recognized $23.3 million, $24.8 million and $24.3 million of compensation expense associated with share-based awards in fiscal 2022, 2021 and 2020, respectively.\nA summary of the Companys stock option and SAR activity follows:\nNumber of Options/SARs (in thousands) Weighted Average Exercise Price Aggregate Intrinsic Value (in thousands)\nOutstanding as of September 28, 2019\n464 $ 38.28\nGranted - -\nCanceled (16) 31.74\nExercised (325) 39.78\nOutstanding as of October 3, 2020\n123 $ 35.12\nGranted - -\nCanceled - -\nExercised (106) 34.12\nOutstanding as of October 2, 2021\n17 $ 41.40\nGranted - -\nCanceled - -\nExercised (12) 40.32\nOutstanding as of October 1, 2022\n5 $ 44.02 $ 215\nNumber of Options/SARs (in thousands) Weighted Average Exercise Price Weighted Average Remaining Life (years) Aggregate Intrinsic Value (in thousands)\nExercisable as of:\nOctober 3, 2020 123 $ 35.12\nOctober 2, 2021 17 $ 41.40\nOctober 1, 2022 5 $ 44.02 3.46 $ 215\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe following table summarizes outstanding stock option and SAR information as of October 1, 2022 (Options/SARs in thousands):\nRange of Exercise Prices Number of Options/SARs Outstanding (in thousands) Weighted Average Exercise Price Weighted Average Remaining Life\n(years) Number of Options / SARs Exercisable (in thousands) Weighted Average Exercise Price\n$33.06 - $40.64\n1 $ 37.80 1.26 1 $ 37.80\n$40.65 - $41.01\n- $ 41.01 1.80 - $ 41.01\n$41.02 - $44.48\n- $ 44.48 1.56 - $ 44.48\n$44.49 - $45.45\n4 $ 45.45 4.08 4 $ 45.45\n$33.06 - $45.45\n5 $ 44.02 3.46 5 $ 44.02\nThere were no options or SARs granted for fiscal 2022, 2021 or 2020.\nThere were no options or SARs vested for fiscal 2022, 2021 or 2020.\nFor fiscal 2022, 2021 and 2020, the total intrinsic value of options and SARs exercised was $0.6 million, $5.4 million and $10.9 million, respectively.\nAs of October 1, 2022, all previously granted options and SARS have vested.\nA summary of the Companys PSU and RSU activity follows:\nNumber of Shares (in thousands) Weighted Average Fair Value at Date of Grant Aggregate Intrinsic Value (in thousands)\nUnits outstanding as of September 28, 2019\n962 $ 56.97\nGranted 377 75.91\nCanceled (37) 60.95\nVested (451) 54.85\nUnits outstanding as of October 3, 2020\n851 $ 66.33\nGranted 360 81.15\nCanceled (10) 70.12\nVested (340) 64.00\nUnits outstanding as of October 2, 2021\n861 $ 72.38\nGranted 328 75.39\nCanceled (35) 76.68\nVested (356) 58.76\nUnits outstanding as of October 1, 2022\n798 $ 79.57 $ 69,889\nThe Company uses the fair value at the date of grant to value RSUs. As of October 1, 2022, there was $18.0 million of unrecognized compensation expense related to RSUs that is expected to be recognized over a weighted average period of 1.3 years.\nThe Company recognizes share-based compensation expense over the vesting period of PSUs. During the fiscal year ended October 1, 2022, the 0.1 million PSUs granted in fiscal 2019 vested at a 145% payout based upon the TSR performance achieved during the performance period and 200% payout based upon economic return performance achieved during the performance period. There were 0.1 million PSUs granted during each of fiscal years 2022, 2021 and 2020.\nAs of October 1, 2022, at the target achievement level, there was $6.6 million of unrecognized compensation expense related to PSUs that is expected to be recognized over a weighted average period of 1.8 years.\n401(k) Savings Plan: The Companys 401(k) Retirement Plan covers all eligible U.S. employees. The Company matches employee contributions up to 4.0% of eligible earnings. The Companys contributions for fiscal 2022, 2021 and 2020 totaled $9.3 million, $9.3 million and $9.8 million, respectively.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nSupplemental Executive Retirement Plan (Deferred Compensation Arrangement): The Company maintains a supplemental executive retirement plan (the \"SERP\") as a deferred compensation plan for executive officers. Under the SERP, a covered executive may elect to defer some or all of the participants compensation into the plan, and the Company may credit the participants account with a discretionary employer contribution. Participants are entitled to payment of deferred amounts and any related earnings upon termination or retirement from Plexus.\nThe SERP allows investment of deferred compensation into individual accounts and, within these accounts, into one or more designated investments. Investment choices do not include Plexus stock. During fiscal 2022, 2021 and 2020, the Company made contributions to the participants SERP accounts in the amount of $0.8 million, $0.7 million and $0.7 million, respectively.\nAs of October 1, 2022 and October 2, 2021, the SERP assets held in the trust totaled $10.0 million and $14.1 million, respectively, and the related liability to the participants totaled approximately $10.0 million and $14.1 million, respectively. As of October 1, 2022 and October 2, 2021, the SERP assets held in the trust were recorded at fair value on a recurring basis, and were classified as Level 2 in the fair value hierarchy discussed in Note 1, \"Description of Business and Significant Accounting Policies.\"\nThe trust assets are subject to the claims of the Companys creditors. The trust assets and the related liabilities to the participants are included in non-current \"Other assets\" and non-current \"Other liabilities,\" respectively, in the accompanying Consolidated Balance Sheets.\n10. Litigation\nThe Company is party to lawsuits in the ordinary course of business. Management does not believe that these proceedings, individually or in the aggregate, will have a material positive or adverse effect on the Companys consolidated financial position, results of operations or cash flows.\n11. Reportable Segments, Geographic Information and Major Customers\nReportable segments are defined as components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision maker, or group, in assessing performance and allocating resources. The Company uses an internal management reporting system, which provides important financial data to evaluate performance and allocate the Companys resources on a regional basis. Net sales for the segments are attributed to the region in which the product is manufactured or the service is performed. The services provided, manufacturing processes used, class of customers serviced and order fulfillment processes used are similar and generally interchangeable across the segments. A segments performance is evaluated based upon its operating income (loss). A segments operating income (loss) includes its net sales less cost of sales and selling and administrative expenses, but excludes corporate and other expenses. Corporate and other expenses primarily represent corporate selling and administrative expenses, and restructuring costs and other charges, if any, such as the $2.0 million, $3.3 million and $6.0 million of restructuring and impairment costs in fiscal 2022, 2021 and 2020, respectively. These costs are not allocated to the segments, as management excludes such costs when assessing the performance of the segments. Inter-segment transactions are generally recorded at amounts that approximate arms length transactions. The accounting policies for the segments are the same as for the Company taken as a whole.\nPlexus Corp.\nNotes to Consolidated Financial Statements\nInformation about the Companys three reportable segments for fiscal 2022, 2021 and 2020 is as follows (in thousands):\n2022 2021 2020\nNet sales:\nAMER $ 1,310,687 $ 1,317,404 $ 1,327,849\nAPAC 2,300,640 1,850,603 1,824,831\nEMEA 316,315 312,669 349,102\nElimination of inter-segment sales (116,274) (111,811) (111,388)\n$ 3,811,368 $ 3,368,865 $ 3,390,394\nOperating income (loss):\nAMER $ 44,741 $ 62,338 $ 38,126\nAPAC 267,253 238,800 246,636\nEMEA 8,018 (895) 1,492\nCorporate and other costs (141,827) (123,975) (132,882)\n$ 178,185 $ 176,268 $ 153,372\nOther income (expense):\nInterest expense $ (15,858) $ (14,253) $ (16,162)\nInterest income 1,305 1,372 1,878\nMiscellaneous, net (5,329) (2,976) (3,691)\nIncome before income taxes $ 158,303 $ 160,411 $ 135,397\n2022 2021 2020\nDepreciation:\nAMER $ 23,482 $ 24,325 $ 24,217\nAPAC 23,547 19,924 17,912\nEMEA 5,861 7,189 6,938\nCorporate 8,613 8,390 6,437\n$ 61,503 $ 59,828 $ 55,504\nCapital expenditures:\nAMER $ 20,024 $ 16,114 $ 13,361\nAPAC 73,758 31,774 18,902\nEMEA 2,617 2,504 8,577\nCorporate 5,213 6,707 9,248\n$ 101,612 $ 57,099 $ 50,088\nOctober 1,\n2022 October 2,\nTotal assets:\nAMER $ 1,150,605 $ 789,385\nAPAC 1,807,542 1,283,124\nEMEA 302,901 275,122\nCorporate and eliminations 132,177 114,262\n$ 3,393,225 $ 2,461,893\nPlexus Corp.\nNotes to Consolidated Financial Statements\nThe following information is provided in accordance with the required segment disclosures for fiscal 2022, 2021 and 2020. Net sales were based on the Companys location providing the product or service (in thousands):\n2022 2021 2020\nNet sales:\nUnited States $ 869,144 $ 914,360 $ 989,888\nMalaysia 1,846,086 1,495,049 1,432,154\nChina 453,591 355,554 392,677\nMexico 441,543 403,044 337,961\nRomania 217,052 202,649 217,295\nUnited Kingdom 91,137 99,365 118,463\nGermany 8,126 10,655 13,344\nThailand 963 - -\nElimination of inter-country sales (116,274) (111,811) (111,388)\n$ 3,811,368 $ 3,368,865 $ 3,390,394\nOctober 1,\n2022 October 2,\nLong-lived assets:\nUnited States $ 105,272 $ 106,577\nMalaysia 152,317 139,614\nMexico 77,947 75,774\nThailand 56,115 19,394\nChina 37,608 35,969\nRomania 23,894 29,474\nUnited Kingdom 6,842 9,073\nOther Foreign 2,899 3,840\nCorporate 46,945 47,466\n$ 509,839 $ 467,181\nAs the Company operates flexible manufacturing facilities and processes designed to accommodate customers with multiple product lines and configurations, it is impracticable to report net sales for individual products or services or groups of similar products and services.\nLong-lived assets as of October 1, 2022 and October 2, 2021 exclude other long-term assets, deferred income tax assets and intangible assets, which totaled $67.3 million and $63.8 million, respectively.\nAs a percentage of consolidated net sales, net sales attributable to customers representing 10.0% or more of consolidated net sales for fiscal 2022, 2021 and 2020 were as follows:\n2022 2021 2020\nGeneral Electric Company (\"GE\") 12.9% 11.2% 11.7%\nDuring fiscal 2022, 2021 and 2020, net sales attributable to GE were reported in all three reportable segments.\nGE represented 16.2% and 12.1% of total accounts receivable as of October 1, 2022 and October 2, 2021, respectively. Medtronic, Inc. represented 10.2% and 3.9% of total accounts receivable as of October 1, 2022 and October 2, 2021, respectively.\nPlexus Corp.\nNotes to Consolidated Financial Statements\n12. Guarantees\nThe Company offers certain indemnifications under its customer manufacturing agreements. In the normal course of business, the Company may from time to time be obligated to indemnify its customers or its customers customers against damages or liabilities arising out of the Companys negligence, misconduct, breach of contract, or infringement of third-party intellectual property rights. Certain agreements have extended broader indemnification, and while most agreements have contractual limits, some do not. However, the Company generally does not provide for such indemnities and seeks indemnification from its customers for damages or liabilities arising out of the Companys adherence to customers specifications or designs or use of materials furnished, or directed to be used, by its customers. The Company does not believe its obligations under such indemnities are material.\nIn the normal course of business, the Company also provides its customers a limited warranty covering workmanship, and in some cases materials, on products manufactured by the Company. Such warranty generally provides that products will be free from defects in the Companys workmanship and meet mutually agreed-upon specifications for periods generally ranging from 12 months to 24 months. The Companys obligation is generally limited to correcting, at its expense, any defect by repairing or replacing such defective product. The Companys warranty generally excludes defects resulting from faulty customer-supplied components, design defects or damage caused by any party or cause other than the Company.\nThe Company provides for an estimate of costs that may be incurred under its limited warranty at the time product revenue is recognized and establishes additional reserves for specifically identified product issues. These costs primarily include labor and materials, as necessary, associated with repair or replacement and are included in the Company's accompanying Consolidated Balance Sheets in \"other accrued liabilities.\" The primary factors that affect the Companys warranty liability include the value and the number of shipped units and historical and anticipated rates of warranty claims. As these factors are impacted by actual experience and future expectations, the Company assesses the adequacy of its recorded warranty liabilities and adjusts the amounts as necessary.\nBelow is a table summarizing the activity related to the Companys limited warranty liability for fiscal 2022, 2021 and 2020 (in thousands):\nLimited warranty liability, as of September 28, 2019\n$ 6,276\nAccruals for warranties issued during the period 2,852\nSettlements (in cash or in kind) during the period (2,742)\nLimited warranty liability, as of October 3, 2020\n6,386\nAccruals for warranties issued during the period 3,277\nSettlements (in cash or in kind) during the period (3,018)\nLimited warranty liability, as of October 2, 2021\n6,645\nAccruals for warranties issued during the period 2,786\nSettlements (in cash or in kind) during the period (2,506)\nLimited warranty liability, as of October 1, 2022\n$ 6,925\n13. Shareholders' Equity\nOn August 20, 2019, the Board of Directors approved a share repurchase program under which the Company is authorized to repurchase $50.0 million of its common stock (the \"2019 Program\"). The 2019 Program commenced upon completion of the 2018 Program. During fiscal 2021, 2020 and 2019, the Company completed the 2019 Program by repurchasing 73,560, 609,935 and 54,965 shares under this program for $5.3 million, $41.4 million and $3.3 million at an average price of $72.44, $67.86 and $59.66 per share, respectively.\nOn August 13, 2020, the Board of Directors approved a share repurchase program under which the Company is authorized to repurchase up to $50.0 million of its common stock (the \"2021 Program\"). On November 18, 2020, the Board of Directors approved an additional $50.0 million in share repurchase authority under the existing 2021 Program such that there then existed a total of $100.0 million in share repurchase authority under the program. The 2021 Program commenced upon completion of\nPlexus Corp.\nNotes to Consolidated Financial Statements\nthe 2019 Program. During fiscal 2021, the Company completed the 2021 Program by repurchasing 1,171,246 shares under this program for $100.0 million at an average price of $85.40 per share.\nOn August 11, 2021, the Board of Directors approved a share repurchase program under which the Company is authorized to repurchase up to $50.0 million of its common stock (the \"2022 Program\"). The 2022 Program commenced upon completion of the 2021 Program. During fiscal 2022 and 2021, the Company completed the 2022 Program by repurchasing 564,718 and 34,381 shares under this program for $46.9 million and $3.1 million at an average price of $83.07 and $90.16 per share, respectively.\nOn August 18, 2022, the Board of Directors approved a share repurchase program under which the Company is authorized to repurchase up to $50.0 million of its common stock (the \"2023 Program\"). The 2023 Program became effective immediately and has no expiration. During fiscal 2022, the Company repurchased 38,397 shares under this program for $3.5 million at an average price of $90.63 per share. As of October 1, 2022, $46.5 million of authority remained under the 2023 Program.\nAll shares repurchased under the aforementioned programs were recorded as treasury stock.\n14. Trade Accounts Receivable Sale Programs\nThe Company has Master Accounts Receivable Purchase Agreements with MUFG Bank, New York Branch (formerly known as The Bank of Tokyo-Mitsubishi UFJ, Ltd.) (the \"MUFG RPA\"), HSBC Bank (China) Company Limited, Xiamen branch (the \"HSBC RPA\") and other unaffiliated financial institutions, under which the Company may elect to sell receivables; at a discount. All facilities are uncommitted facilities. The maximum facility amount under the MUFG RPA as of October 1, 2022 is $340.0 million. The maximum facility amount under the HSBC RPA as of October 1, 2022 is $60.0 million. The MUFG RPA will be automatically extended each year unless any party gives no less than 10 days prior notice that the agreement should not be extended. The terms of the HSBC RPA are generally consistent with the terms of the MUFG RPA previously discussed.\nTransfers of receivables under the programs are accounted for as sales and, accordingly, receivables sold under the programs are excluded from accounts receivable on the Consolidated Balance Sheets and are reflected as cash provided by operating activities on the Consolidated Statements of Cash Flows. Proceeds from the transfer reflect the face value of the receivables less a discount. The sale discount is recorded within \"Miscellaneous, net\" in the Consolidated Statements of Comprehensive Income in the period of the sale. The Company continues servicing receivables sold and performing all accounts receivable administrative functions, in exchange receives a servicing fee, under both the MUFG RPA and HSBC RPA. Servicing fees related to trade accounts receivable programs recognized during fiscal 2022, 2021 and 2020 were not material.\nThe Company sold $787.5 million, $730.5 million and $834.4 million of trade accounts receivable under these programs, or their predecessors, during fiscal 2022, 2021 and 2020, respectively, in exchange for cash proceeds of $783.1 million, $728.4 million and $831.2 million, respectively. As of October 1, 2022 and October 2, 2021, $222.5 million and $176.0 million, respectively, of accounts receivables sold under trade accounts receivable programs and subject to servicing by the Company remained outstanding and had not yet been collected.\n15. Revenue from Contracts with Customers\nRevenue is recognized over time for arrangements with customers for which: (i) the Company's performance does not create an asset with an alternative use to the Company, and (ii) the Company has an enforceable right to payment, including reasonable profit margin, for performance completed to date. Revenue recognized over time is estimated based on costs incurred to date plus a reasonable profit margin. If either of the two conditions noted above are not met to recognize revenue over time, revenue is recognized following the transfer of control of such products to the customer, which typically occurs upon shipment or delivery depending on the terms of the underlying arrangement.\nThe Company recognizes revenue when a contract exists and when, or as, it satisfies a performance obligation by transferring control of a product or service to a customer. Contracts are accounted for when they have approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectability of consideration is probable. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer.\nThe Company generally enters into a master services arrangement that establishes the framework under which business will be conducted. These arrangements represent the master terms and conditions of the Company's services that apply to individual\nPlexus Corp.\nNotes to Consolidated Financial Statements\norders, but they do not commit the customer to work with, or to continue to work with, the Company nor do they obligate the customer to any specific volume or pricing of purchases. Moreover, these terms can be amended in appropriate situations.\nCustomer purchase orders are received for specific quantities with predominantly fixed pricing and delivery requirements. Thus, for the majority of our contracts, there is no guarantee of any revenue to the Company until a customer submits a purchase order. As a result, the Company generally considers its arrangement with a customer to be the combination of the master services arrangement and the purchase order. Most of the Company's arrangements with customers create a single performance obligation as the promise to transfer the individual manufactured product or service is capable of being distinct.\nThe Companys performance obligations are satisfied over time as work progresses or at a point in time. A performance obligation is satisfied over time if the Company has an enforceable right to payment, including a reasonable profit margin. Determining if an enforceable right to payment includes a reasonable profit margin requires judgment and is assessed on a contract by contract basis.\nGenerally, there are no subjective customer acceptance requirements or further obligations related to goods or services provided; if such requirements or obligations exist, then a sale is recognized at the time when such requirements are completed and such obligations are fulfilled.\nThe Company does not allow for a general right of return. Net sales include amounts billed to customers for shipping and handling and out-of-pocket expenses. The corresponding shipping and handling costs and out-of-pocket expenses are included in cost of sales. Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by the Company from a customer, are excluded from net sales.\nContract Costs\nFor contracts requiring over time revenue recognition, the selection of the method to measure progress towards completion requires judgment and is based on the nature of the products or services to be provided. The Company uses a cost-based input measurement of progress because it best depicts the transfer of assets to the customer, which occurs as costs are incurred during the manufacturing process or as services are rendered. Under the cost-based measure of progress, the extent of progress towards completion is measured based on the costs incurred to date.\nThere were no other costs to obtain or fulfill customer contracts.\nDisaggregated Revenue\nThe table below includes the Companys revenue for the fiscal years indicated disaggregated by geographic reportable segment and market sector (in thousands):\nReportable Segment:\nAMER APAC EMEA Total\nMarket Sector:\nIndustrial $ 398,743 $ 1,288,577 $ 65,398 $ 1,752,718\nHealthcare/Life Sciences 645,881 744,216 175,674 1,565,771\nAerospace/Defense 255,779 165,432 71,668 492,879\nExternal revenue 1,300,403 2,198,225 312,740 3,811,368\nInter-segment sales 10,285 102,415 3,575 116,275\nSegment revenue $ 1,310,688 $ 2,300,640 $ 316,315 $ 3,927,643\nPlexus Corp.\nNotes to Consolidated Financial Statements\nReportable Segment:\nAMER APAC EMEA Total\nMarket Sector:\nIndustrial $ 462,789 $ 1,010,833 $ 75,353 $ 1,548,975\nHealthcare/Life Sciences 566,693 605,249 154,830 1,326,772\nAerospace/Defense 277,870 134,842 80,406 493,118\nExternal revenue 1,307,352 1,750,924 310,589 3,368,865\nInter-segment sales 10,052 99,679 2,080 111,811\nSegment revenue $ 1,317,404 $ 1,850,603 $ 312,669 $ 3,480,676\nReportable Segment:\nAMER APAC EMEA Total\nMarket Sector (1):\nIndustrial $ 481,301 $ 954,925 $ 84,215 $ 1,520,441\nHealthcare/Life Sciences 464,134 618,250 176,001 1,258,385\nAerospace/Defense 371,685 157,301 82,582 611,568\nExternal revenue 1,317,120 1,730,476 342,798 3,390,394\nInter-segment sales 10,729 94,355 6,304 111,388\nSegment revenue $ 1,327,849 $ 1,824,831 $ 349,102 $ 3,501,782\n(1) During fiscal 2021, the Company consolidated the previously reported Industrial/Commercial and Communications market sectors to form the Industrial market sector. Fiscal 2020 amounts have been reclassified to conform to the current period presentation.\nFor fiscal 2022 approximately 84% and for fiscal 2021 and 2020 approximately 91% of the Company's revenue was recognized as products and services were transferred over time.\nContract Balances\nThe timing of revenue recognition, billings and cash collections results in billed accounts receivable, contract assets and deferred revenue on the Companys accompanying Consolidated Balance Sheets.\nContract Assets: For performance obligations satisfied at a point in time, billing occurs subsequent to revenue recognition, at which point the customer has been billed and the resulting asset is recorded within accounts receivable. For performance obligations satisfied over time as work progresses, the Company has an unconditional right to payment, which results in the recognition of contract assets. The following table summarizes the activity in the Company's contract assets during fiscal 2022 and 2021 (in thousands):\n2022 2021\nContract assets, beginning of period $ 115,283 $ 113,946\nRevenue recognized during the period 3,180,108 3,048,875\nAmounts collected or invoiced during the period (3,156,851) (3,047,538)\nContract assets, end of period $ 138,540 $ 115,283\nDeferred Revenue: Deferred revenue is recorded when consideration is received from a customer prior to transferring goods or services to the customer under the terms of the contract, which is included in other accrued liabilities on Consolidated Balance Sheets. As of October 1, 2022 and October 2, 2021 the balance of advance payments from customers that remained in other accrued liabilities was $298.8 million and $101.1 million, respectively. The advance payment is not considered a significant financing component because it is used to meet working capital demands that can be higher in the early stages of a contract and to protect the company from the other party failing to adequately complete some or all of its obligations under the contract. Deferred revenue is recognized into revenue when all revenue recognition criteria are met. For performance obligations satisfied over time, recognition will occur as work progresses; otherwise deferred revenue will be recognized based upon shipping terms.\nPlexus Corp.\nNotes to Consolidated Financial Statements\n16. Restructuring and Impairment Charges\nDuring fiscal 2022, the Company recorded $2.0 million of restructuring and impairment charges primarily due to employee severance costs associated with a facility transition in the Company's APAC segment. During fiscal 2021, the Company recorded $3.3 million of restructuring and impairment charges which consisted of severance from the reduction of the Company's workforce, primarily in the AMER and EMEA segments. During fiscal 2020, the Company recorded $6.0 million of restructuring and impairment charges in the Company's AMER segment primarily related to the closure of our Boulder Design Center. These charges are recorded within restructuring and impairment charges on the Consolidated Statements of Comprehensive Income. Restructuring liabilities are recorded within other accrued liabilities on the Consolidated Balance Sheets.\nThe Company recognized a tax benefit of $0.2 million, $0.3 million and $0.6 million related to restructuring and impairment charges in fiscal 2022, 2021 and 2020, respectively.\nThe Company's restructuring accrual activity for fiscal 2022, 2021 and 2020 is included in the table below (in thousands):\nFixed Asset and Operating Right-of-Use Asset Impairment Employee Termination and Severance Costs Total\nAccrual balance, as of September 28, 2019\n$ - $ 1,297 $ 1,297\nRestructuring and impairment costs 3,054 2,949 6,003\nAmounts utilized (3,054) (4,210) (7,264)\nAccrual balance, as of October 3, 2020\n$ - $ 36 $ 36\nRestructuring and impairment costs - 3,267 3,267\nAmounts utilized - (3,232) (3,232)\nAccrual balance, as of October 2, 2021\n$ - $ 71 $ 71\nRestructuring and impairment costs 255 1,766 2,021\nAmounts utilized (255) (1,725) (1,980)\nAccrual balance, as of October 1, 2022\n$ - $ 112 $ 112 ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nThe Company maintains disclosure controls and procedures designed to ensure that the information the Company must disclose in its filings with the Securities and Exchange Commission (\"SEC\") is recorded, processed, summarized and reported on a timely basis. The Companys Chief Executive Officer (\"CEO\") and Chief Financial Officer (\"CFO\") have reviewed and evaluated, with the participation of the Companys management, the Companys disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the \"Exchange Act\") as of the end of the period covered by this report. Based on such evaluation, the CEO and CFO have concluded that, as of October 1, 2022, the Companys disclosure controls and procedures are effective, at the reasonable assurance level, (a) in recording, processing, summarizing and reporting, on a timely basis, information required to be disclosed by the Company in the reports the Company files or submits under the Exchange Act, and (b) in assuring that information is accumulated and communicated to the Companys management, including the CEO and CFO, as appropriate to allow timely decisions regarding required disclosure.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement of the Company is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Management of the Company, including its CEO and CFO, has assessed the effectiveness of its internal control over financial reporting as of October 1, 2022, based on the criteria established in \"Internal Control - Integrated Framework\" issued by the Committee of Sponsoring Organizations of the Treadway Commission (\"COSO\") (2013). Based on its assessment and those criteria, management has reached the conclusion that the Company's internal control over financial reporting was effective.\nThe independent registered public accounting firm of PricewaterhouseCoopers LLP has audited the Companys internal control over financial reporting as of October 1, 2022, as stated in its report included herein.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in the Companys internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that occurred during the Companys most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nLimitations on the Effectiveness of Controls\nOur management, including our CEO and CFO, does not expect that our disclosure controls and internal controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple errors or mistakes. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions; over time, a control may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected. Notwithstanding the foregoing limitations on the effectiveness of controls, we have nonetheless reached the conclusion that the Company's disclosure controls and procedures and internal control over financial reporting are effective. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURES REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation in response to this item is incorporated herein by reference to \"Election of Directors\" and \"Corporate Governance\" in the Companys Proxy Statement for its 2023 Annual Meeting of Shareholders (\"2023 Proxy Statement\"), which will be filed within 120 days of the end of the Company's fiscal year.\nOur Code of Conduct and Business Ethics is posted on our website at www.plexus.com. You may access the Code of Conduct and Business Ethics by following the links under \"Investors\" and then \"Corporate Governance\" at our website. Plexus Code of Conduct and Business Ethics applies to all members of the board of directors, officers and employees; and includes provisions related to accounting and financial matters that apply to the Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer and Controller.\nInformation about our Executive Officers\nThe following table sets forth our executive officers, their ages as of November 18, 2022, and the positions held by each person:\nName Age Position\nTodd P. Kelsey 57 Chief Executive Officer\nSteven J. Frisch 56 President and Chief Strategy Officer\nPatrick J. Jermain 56 Executive Vice President and Chief Financial Officer\nOliver K. Mihm 50 Executive Vice President and Chief Operating Officer\nAngelo M. Ninivaggi 55 Executive Vice President, Chief Administrative Officer, General Counsel and Secretary\nRonnie Darroch 57 Executive Vice President - Global Operations and Regional President - EMEA\nScott Theune 58 Regional President - AMER\nVictor Tan 58 Regional President - APAC\nTodd P. Kelsey joined Plexus in 1994 and has served as Chief Executive Officer since 2016; prior thereto, he served as President from 2016 to 2022 and Executive Vice President and Chief Operating Officer since 2013. Previously, Mr. Kelsey served as Executive Vice President - Global Customer Services since 2011 and as Senior Vice President prior thereto.\nSteven J. Frisch joined Plexus in 1990 and has served as President and Chief Strategy Officer since 2022. Prior thereto, he served as Executive Vice President and Chief Operating Officer since 2016 and Executive Vice President and Chief Customer Officer since 2014. Previously, Mr. Frisch served as Executive Vice President - Global Customer Services from 2013 to 2014. Mr. Frisch was Regional President - Plexus EMEA from 2010 to 2013. Mr. Frisch also served as Senior Vice President - Global Engineering Solutions from 2007 to 2013.\nPatrick J. Jermain joined Plexus in 2010 and has served as Chief Financial Officer since 2014; he was named a Senior Vice President in 2015 and Executive Vice President in 2019. Previously, Mr. Jermain served as Treasurer and Vice President of Finance since 2013 and as Corporate Controller since 2010.\nOliver Mihm joined Plexus in 2000 and has served as Executive Vice President and Chief Operating Officer since 2022. Prior thereto, he served as Executive Vice President - Global Supply Chain and Operational Solutions, previously serving as Executive Vice President Supply Chain since 2019. From 2015 to 2019, Mr. Mihm served as Regional President - EMEA. Prior to that, Mr. Mihm was Industrial Market Sector Vice President, led our Global Engineering Solutions and held various leadership roles within our Engineering Solutions organization.\nAngelo M. Ninivaggi joined Plexus in 2002 and has served as Chief Administrative Officer since 2013. Mr. Ninivaggi has also served as Vice President, General Counsel and Secretary since 2006, was named a Senior Vice President in 2011 and Executive Vice President in 2019. Mr. Ninivaggi also served as Corporate Compliance Officer from 2007 to 2013.\nRonnie Darroch joined Plexus in 2012 and has served as Executive Vice President and Regional President - EMEA since May 2019 and Executive Vice President - Global Operations since 2022. Previously, Mr. Darroch served as Regional President - AMER from 2016 to 2019, Senior Vice President - Global Manufacturing Solutions from 2014 to 2019, was named an Executive Vice President in 2016, Regional President - EMEA from 2013 to 2014 and Vice President of Operations - EMEA prior thereto.\nScott Theune joined Plexus in 1993 and has served as Regional President - AMER since May 2019. Previously, Mr. Theune served as Senior Vice President of Global Supply Chain from 2016 to 2019, Vice President of Supply Chain from 2005 to 2016, and General Manager and Global Director of Manufacturing Process and Technology prior thereto.\nVictor Tan joined Plexus in 2007 and has served as Regional President - APAC since 2020. Previously, Mr. Tan served as Senior Vice President of Global Operations since 2019. In 2010, he was promoted to Vice President of Customer Management in APAC, later appointed to lead all Penang operations and support functions in the region in 2013 and further expanded to lead APAC operations in 2018. Prior thereto, he served as the General Manager for Plexus' Penang-Hillside site in Malaysia. ITEM 11. EXECUTIVE COMPENSATION\nIncorporated herein by reference to \"Corporate Governance - Board and Committee Responsibilities - Compensation & Leadership Development Committee,\" \"Director Compensation for Fiscal 2022,\" \"Compensation Discussion & Analysis,\" \"Executive Compensation\" and \"Compensation Committee Report\" in the 2023 Proxy Statement. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nIncorporated herein by reference to \"Security Ownership of Certain Beneficial Owners and Management\" in the 2023 Proxy Statement.\nEquity Compensation Plan Information\nThe following table chart gives aggregate information regarding grants under all Plexus equity compensation plans through October 1, 2022:\nPlan category Number of securities to be issued upon exercise of outstanding options, warrants and rights (1) Weighted-average exercise price of outstanding options, warrants and rights (2) Number of securities remaining available for future issuance under equity compensation plans (excluding securities reflected in 1st column)\nEquity compensation plans approved by security holders 803,127 $ 44.02 $ 979,811\nEquity compensation plans not approved by security holders - n/a -\nTotal 803,127 $ 44.02 $ 979,811\n(1) Represents options, stock-settled SARs, PSUs and RSUs granted under the 2016 Omnibus Incentive Plan and the 2008 Long-Term Incentive Plan, both of which were approved by shareholders. No further awards may be made under the 2008 Long-Term Incentive Plan.\n(2) The weighted average exercise prices exclude PSUs and RSUs. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nIncorporated herein by reference to \"Corporate Governance - Director Independence\" and \"Certain Transactions\" in the 2023 Proxy Statement. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nOur independent registered public accounting firm is PricewaterhouseCoopers LLP, Milwaukee, Wisconsin, Auditor Firm ID: 238. Incorporated herein by reference to the subheading \"Ratify Independent Auditors - Fees and Services\" in the 2023 Proxy Statement.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed\nFinancial Statements and Financial Statement Schedule. See the list of Financial Statements and Financial Statement Schedule in Item 8.\n(b) Exhibits. The list of exhibits is included below:\nIncorporate by Reference Herein\nExhibit\nNo. Exhibit Form Exhibit Filing Date\n3(i) Restated Articles of Incorporation of Plexus Corp.\n10-Q 3.1 5/14/2004\n3(ii) Amended and Restated Bylaws of Plexus Corp., as amended through November 18, 2020\n8-K 3.1 11/19/2020\n4.1 Restated Articles of Incorporation of Plexus Corp.\n10-Q 3.1 5/14/2004\n4.2 Amended and Restated Bylaws of Plexus Corp., as amended through November 18, 2020\n8-K 3.1 11/19/2020\n4.3 Description of Common Stock\n10-K 4.3 10/2/2021\n10.1 (a) Credit Agreement, dated as of May 15, 2019, among Plexus Corp., the banks, financial institutions and other institutional lenders listed on the signature pages thereto, JPMorgan Chase Bank, N.A., as administrative agent, U.S. Bank National Association, as syndication agent, PNC Bank, National Association, Bank of America, N.A., MUFG Bank, Ltd., HSBC Bank USA, N.A., Bank of the West and Wells Fargo Bank, National Association, as co-documentation agents, and JPMorgan Chase Bank, N.A. and U.S. Bank National Association, as joint lead arrangers and joint book runners (including the related subsidiary guaranty).\n8-K 10.1 5/15/2019\n10.1 (b) Amendment No. 1 to Credit Agreement, dated as of April 29, 2020, among Plexus Corp., the lenders party thereto and JPMorgan Chase Bank, N.A., as administrative agent.\n8-K 10.1 4/30/2020\n10.1 (c) Amended and Restated Credit Agreement, dated June 9, 2022, by and among Plexus Corp., certain of its subsidiaries from time to time party thereto as borrowers, the lenders from time to time party thereto, and JPMorgan Chase Bank, N.A., as Administrative Agent.\n8-K 10.1 6/13/2022\n10.2 (a) Note Purchase Agreement, dated as of June 15, 2018, between Plexus Corp. and the Purchasers named therein relating to an aggregate of $150,000,000 in principal amount of 4.05% Series A Senior Notes, due June 15, 2025, and 4.22% Series B Senior Notes, due June 15, 2028.\n8-K 10.1 6/18/2018\n10.2 (b) First Amendment, dated as of June 25, 2019, to the Note Purchase Agreement, dated as of June 15, 2018, between Plexus Corp. and the Noteholders named therein relating to an aggregate of $150,000,000 in principal amount of 4.05% Series A Senior Notes, due June 15, 2025, and 4.22% Series B Senior Notes, due June 15, 2028.\n10-Q 10.1 8/2/2019\n10.3 (a) Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the Purchaser, dated as of October 4, 2016.\n8-K 10.1 10/7/2016\n10.3 (b) Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the Purchaser, dated as of December 14, 2016.\n10-Q 10.2 2/3/2017\n10.3 (c) Amendment No. 3 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the Purchaser, dated as of March 28, 2017.\n10-Q 10.1 5/5/2017\n10.3 (d) Amendment No. 4 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the Purchaser, dated as of September 11, 2017.\n10-K 10.3(d) 11/16/2018\n10.3 (e) Amendment No. 5 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch, as the Purchaser, dated as of October 19, 2017.\n10-K 10.3(d) 11/17/2017\n10.3 (f) Amendment No. 6 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and MUFG Bank Ltd. (f/k/a The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch), as the Purchaser, dated as of May 4, 2018.\n10-Q 10.1 8/3/2018\n10.3 (g) Amendment No. 7 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and MUFG Bank Ltd. (f/k/a The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch), as the Purchaser, dated as of September 19, 2018.\n10-K 10.3(g) 11/16/2018\n10.3 (h) Amendment No. 8 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and MUFG Bank Ltd. (f/k/a The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch), as the Purchaser, dated as of March 20, 2019.\n10-Q 10.1 5/3/2019\n10.3 (i) Amendment No.9 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and MUFG Bank Ltd. (f/k/a The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch), as the Purchaser, dated as of June 21, 2019.\n10-Q 10.2 8/2/2019\n10.3 (j) Amendment No.10 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and MUFG Bank Ltd. (f/k/a The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch), as the Purchaser, dated as of December 23, 2019.\n10-Q 10.1 2/7/2020\n10.3 (k) Amendment No.11 to Amended and Restated Master Accounts Receivable Purchase Agreement between Plexus Corp. and Plexus Manufacturing Sdn. Bhd., Plexus Intl. Sales & Logistics, LLC, Plexus Services Ro SRL, Plexus Corp. (UK) Limited and each additional seller party thereto from time to time as the Sellers, Plexus Corp., as Seller Representative, and MUFG Bank Ltd. (f/k/a The Bank of Tokyo-Mitsubishi UFJ, Ltd., New York Branch), as the Purchaser, dated as of September 10, 2020.\n10-K 10.3(k) 11/20/2020\n10.4 Retirement and Transition Agreement, dated August 17, 2016, by and between Plexus Corp. and Dean A. Foate.*.\n8-K 10.1 8/19/2016\n10.5 Employment Agreement, dated August 17, 2016, by and between Plexus Corp. and Todd P. Kelsey.*\n8-K 10.2 8/19/2016\n10.6 Form of Change of Control Agreement with executive officers.*\n8-K 10.2 5/21/2008\n10.7 Summary of Directors' Compensation (1/22).*\n10-Q 10.2 2/4/2022\n10.8 (a) Plexus Corp. Executive Deferred Compensation Plan.*\n10-K 10.17 12/19/2000\n10.8 (b) Plexus Corp Executive Deferred Compensation Plan Trust dated April 1, 2003 between Plexus Corp. and Bankers Trust Company.*\n10-K 10.14 12/15/2003\n10.9 Plexus Corp. Non-employee Directors Deferred Compensation Plan.*\n10-K 10.10 11/19/2012\n10.10 (a) Amended and Restated Plexus Corp. 2016 Omnibus Incentive Plan.*\n10-Q 10.2 5/5/2017\n10.10 (b) Forms of award agreements thereunder*\n(i) Form of Stock Option Agreement.\n10-Q 10.1 8/8/2016\n(ii) Form of Restricted Stock Unit Award.\n10-Q 10.2 8/8/2016\n(iii) Form of Performance Stock Unit Agreement.\n10-Q 10.1 2/5/2021\n(iv) Form of Stock Appreciation Rights Agreement.\n10-Q 10.3 8/8/2016\n(v) Form of Restricted Stock Unit Award Agreement for Directors.\n10-Q 10.1 2/3/2017\n(vi) Form of Plexus Corp. Variable Incentive Compensation Plan - Plexus Leadership Team.\n10-K 10.1(b)(vi) 11/17/2017\n10.11 (a) Amended and Restated Plexus Corp. 2008 Long-Term Incentive Plan* (superseded except as to outstanding awards).\n10-Q 10.3 5/5/2017\n10.11(b) Forms of award agreements thereunder*\n(i) Form of Stock Option Agreement.\n10-Q 10.2 2/4/2010\n(ii) Form of Restricted Stock Unit Award.\n10-Q 10.5(b) 5/8/2008\n(iii) Form of Stock Appreciation Rights Agreement.\n10-Q 10.5(c) 5/8/2008\n21** List of Subsidiaries.\n23** Consent of PricewaterhouseCoopers LLP.\n24** Powers of Attorney (see signature page).\n31.1** Certification of Chief Executive Officer pursuant to Section 302(a) of the Sarbanes-Oxley Act of 2002.\n31.2** Certification of Chief Financial Officer pursuant to Section 302(a) of the Sarbanes-Oxley Act of 2002.\n32.1** Certification of the CEO pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2** Certification of the CFO pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n99.1** Reconciliation of ROIC to GAAP and Economic Return Financial Statements.\n101 The following materials from Plexus Corp.s Annual Report on Form 10-K for the fiscal year ended October 1, 2022, formatted in Inline Extensible Business Reporting Language (\"XBRL\"): (i) the Consolidated Statements of Comprehensive Income, (ii) the Consolidated Balance Sheets, (iii) the Consolidated Statements of Shareholders Equity, (iv) the Consolidated Statements of Cash Flows, and (v) Notes to Consolidated Financial Statements.\n101.INS Inline XBRL Instance Document (the instance document does not appear in the interactive data file because its XBRL tags are embedded within the inline XBRL document).\n101.SCH Inline XBRL Taxonomy Extension Schema Document.\n101.CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.LAB Inline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document.\n101.DEF Inline XBRL Taxonomy Extension Definition Linkbase Document.\n104 The cover page from the Companys Annual Report on Form 10-K for the fiscal year ended October 1, 2022, formatted in Inline XBRL and contained in Exhibit 101.\n* Designates management compensatory plans or agreements.\n** Filed or furnished herewith.\nITEM 16. FORM 10-K SUMMARY\nNone.\nPlexus Corp. and Subsidiaries\nSchedule II - Valuation and Qualifying Accounts\nFor fiscal 2022, 2021 and 2020 (in thousands):\nDescriptions Balance at beginning of period Additions charged to costs and expenses Additions charged to other accounts Deductions Balance at end of period\nFiscal Year 2022:\nAllowance for losses on accounts receivable (deducted from the asset to which it relates) $ 1,188 $ 2,117 $ - $ (1,344) $ 1,961\nValuation allowance on deferred income tax assets (deducted from the asset to which it relates) $ 30,321 $ 1,338 $ - $ (6,097) $ 25,562\nFiscal Year 2021:\nAllowance for losses on accounts receivable (deducted from the asset to which it relates) $ 3,597 $ 1,232 $ - $ (3,641) $ 1,188\nValuation allowance on deferred income tax assets (deducted from the asset to which it relates) $ 34,948 $ 4,499 $ - $ (9,126) $ 30,321\nFiscal Year 2020:\nAllowance for losses on accounts receivable (deducted from the asset to which it relates) $ 1,537 $ 4,051 $ - $ (1,991) $ 3,597\nValuation allowance on deferred income tax assets (deducted from the asset to which it relates) $ 29,170 $ 5,778 $ - $ - $ 34,948\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPlexus Corp.\nRegistrant\nDate: November 18, 2022 /s/ Todd P. Kelsey\nTodd P. Kelsey\nChief Executive Officer\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Todd P. Kelsey, Patrick J. Jermain and Angelo M. Ninivaggi, and each of them, his or her true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign any and all amendments to this report, and to file the same with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, and any other regulatory authority, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents or any of them, or their substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirement of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities and on the date indicated.*\nSIGNATURE AND TITLE\n/s/ Todd P. Kelsey /s/ Randy J. Martinez\nTodd P. Kelsey, Chief Executive Officer (Principal Executive Officer) and Director Randy J. Martinez, Director\n/s/ Patrick J. Jermain /s/ Joel Quadracci\nPatrick J. Jermain, Executive Vice President and Chief\nFinancial Officer (Principal Financial Officer and\nPrincipal Accounting Officer) Joel Quadracci, Director\n/s/ Dean A. Foate /s/ Karen M. Rapp\nDean A. Foate, Chairman Karen M. Rapp, Director\n/s/ Joann M. Eisenhart /s/ Paul A. Rooke\nJoann M. Eisenhart, Director Paul A. Rooke, Director\n/s/ Rainer Jueckstock /s/ Michael V. Schrock\nRainer Jueckstock, Director Michael V. Schrock, Director\n/s/ Peter Kelly\nPeter Kelly, Director\n*Each of the above signatures is affixed as of November 18, 2022."
}