{
    "cik": "785956",
    "company": "J&J SNACK FOODS CORP",
    "filing_type": "10-K",
    "filing_date": "2023-11-28",
    "period_of_report": "2023-09-30",
    "sic": "2052",
    "state_of_inc": "NJ",
    "state_location": "NJ",
    "fiscal_year_end": "0924",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/785956/0001437749-23-033110-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/785956/000143774923033110/jjsf20230923_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/785956/0001437749-23-033110.txt",
    "filename": "785956_10K_2023_0001437749-23-033110.htm",
    "content": "Item 1.\nBusiness\nGeneral\nJ & J Snack Foods Corp. (the Company or J & J) manufactures snack foods and distributes frozen beverages which it markets nationally to the foodservice and retail supermarket industries. The Companys principal snack food products are soft pretzels marketed primarily under the brand names SUPERPRETZEL, BRAUHAUS and BAVARIAN BAKERY, frozen novelties marketed primarily under the DIPPIN DOTS, LUIGIS, WHOLE FRUIT, ICEE, DOGSTERS, PHILLY SWIRL and MINUTE MAID* brand names, churros marketed primarily under the ¡HOLA! and CALIFORNIA CHURROS brand names and bakery products sold primarily under the READI-BAKE, COUNTRY HOME, MARY BS, DADDY RAYS and HILL & VALLEY brand names as well as for private label and contract packing. J & J is the largest manufacturer of soft pretzels in the United States. Other snack food products include funnel cake sold under THE FUNNEL CAKE FACTORY brand and handheld products sold under smaller brands. The Companys principal frozen beverage products are the ICEE brand frozen carbonated beverage and the SLUSH PUPPIE brand frozen non-carbonated beverage.\nThe Companys Food Service and Frozen Beverages sales are made primarily to foodservice customers including snack bar and food stand locations in leading chain, department, discount, warehouse club and convenience stores; malls and shopping centers; fast food and casual dining restaurants; stadiums and sports arenas; leisure and theme parks; movie theatres; independent retailers; and schools, colleges and other institutions. The Companys retail supermarket customers are primarily supermarket chains.\n* Minute Maid is a registered trademark of the Coca-Cola Company\nThe Company was incorporated in 1971 under the laws of the State of New Jersey.\nThe Company operates in three business segments: Food Service, Retail Supermarkets and Frozen Beverages. These segments are described below.\nThe Chief Operating Decision Maker for Food Service, Retail Supermarkets and Frozen Beverages reviews detailed operating income statements and sales reports in order to assess performance and allocate resources to each individual segment. Sales and operating income are key variables monitored by the Chief Operating Decision Maker and management when determining each segments and the Companys financial condition and operating performance. In addition, the Chief Operating Decision Maker reviews and evaluates depreciation, capital spending and assets of each segment on a quarterly basis to monitor cash flow and asset needs of each segment (see Item 7 - Managements Discussion and Analysis of Financial Condition and Results of Operations and Item 8 - Financial Statements and Supplementary Data for financial information about segments).\nFood Service\nThe primary products sold by the Food Service segment are soft pretzels, frozen novelties, churros, handheld products and baked goods. Our customers in the Food Service segment include snack bars and food stands in chain, department and discount stores; malls and shopping centers; fast food and casual dining restaurants; stadiums and sports arenas; leisure and theme parks; convenience stores; movie theatres; warehouse club stores; schools, colleges and other institutions. Within the food service industry, our products are purchased by the consumer primarily for consumption at the point-of-sale or for take-away.\nRetail Supermarkets\nThe primary products sold to the retail supermarket channel are soft pretzel products - including SUPERPRETZEL, frozen novelties including LUIGIS Real Italian Ice, MINUTE MAID Juice Bars and Soft Frozen Lemonade, WHOLE FRUIT frozen fruit bars and sorbet, DOGSTERS ice cream style treats for dogs, PHILLY SWIRL cups and sticks, ICEE Squeeze-Up Tubes and handheld products. Within the retail supermarket channel, our frozen and prepackaged products are purchased by the consumer for consumption at home.\nFrozen Beverages\nWe sell frozen beverages to the foodservice industry primarily under the names ICEE, SLUSH PUPPIE and PARROT ICE in the United States, Mexico and Canada. We also provide repair and maintenance services to customers for customer-owned equipment.\nProducts\nSoft Pretzels\nThe Companys soft pretzels are sold under many brand names; some of which are: SUPERPRETZEL, SUPERPRETZEL BAVARIAN, NEW YORK PRETZEL AND BRAUHAUS; and, to a lesser extent, under private labels.\nSoft pretzels are sold in the Food Service and Retail Supermarket segments. Soft pretzel sales amounted to 19% of the Companys revenue in fiscal year 2023, 19% in fiscal year 2022, and 20% in fiscal year 2021.\nCertain of the Companys soft pretzels qualify under USDA regulations as the nutritional equivalent of bread for purposes of the USDA school lunch program, thereby enabling a participating school to obtain partial reimbursement of the cost of the Companys soft pretzels from the USDA.\nThe Companys soft pretzels are manufactured according to a proprietary formula. Soft pretzels, ranging in size from one to twenty-four ounces in weight, are shaped and formed by the Companys twister machines. These soft pretzel tying machines are automated, high-speed machines for twisting dough into the traditional pretzel shape. Additionally, we make soft pretzels which are extruded or shaped by hand. Soft pretzels, after processing, are primarily quick-frozen in either raw or baked form and packaged for delivery.\nThe Companys principal marketing program in the Food Service segment includes supplying ovens, mobile merchandisers, display cases, warmers and similar merchandising equipment to the retailer to prepare and promote the sale of soft pretzels. Some of this equipment is proprietary, including combination warmer and display cases that rebake frozen soft pretzels while displaying them, thus eliminating the need for an oven. The Company retains ownership of the equipment placed in customer locations, and as a result, customers are not required to make an investment in equipment.\nFrozen Novelties\nThe Companys frozen novelties are marketed primarily under the DIPPINDOTS, LUIGIS, WHOLE FRUIT, DOGSTERS, PHILLY SWIRL, ICEE and MINUTE MAID brand names. Frozen novelties are sold in the Food Service and Retail Supermarkets segments. Frozen novelties sales were 17% of the Companys revenue in fiscal year 2023, 14% in fiscal year 2022, and 13% in fiscal year 2021.\nThe Companys school foodservice LUIGIS and WHOLE FRUIT frozen juice bars and cups are produced in various flavors and contain three to four ounces of 100% juice with no added sugar and 100% of the daily US FDA value of vitamin C.\nThe Companys DIPPIN DOTS frozen novelty products are cryogenically frozen beads of ice cream, created using liquid nitrogen at -320 degrees Fahrenheit. Product variations include ice cream (milk and cream based), flavored ice (water based) and frozen yogurt branded YoDots. The product is served to consumers by the cup, or via individual serving packages.\nThe balance of the Companys frozen novelties products are manufactured from water, sweeteners and fruit juice concentrates in various flavors and packaging including cups, tubes, sticks, M-paks and pints. Several of the products contain ice cream and WHOLE FRUIT bars contains pieces of fruit.\nChurros\nThe Companys churros are sold primarily under the ¡HOLA! and CALIFORNIA CHURROS brand names. Churros are sold to the Food Service and Retail Supermarkets segments. Churro sales were 7% of the Companys sales in fiscal year 2023 and 6% in both fiscal years 2022 and 2021. Churros are pastries in stick form which the Company produces in several sizes according to a proprietary formula. The churros are deep fried, frozen and packaged. At food service point-of-sale they are reheated and topped with a cinnamon sugar mixture. The Company also sells chocolate-filled, fruit-filled and crème-filled churros. The Company supplies churro merchandising equipment similar to that used for its soft pretzels.\nHandheld Products\nThe Company's handheld products are sold primarily under private label names. Handheld products are sold to the Food Service and Retail Supermarket segments. Handheld product sales amounted to 6% of the Companys sales in fiscal year 2023 and 7% in both fiscal years 2022 and 2021.\nBakery Products\nThe Companys bakery products are marketed under the MRS. GOODCOOKIE, READI-BAKE, COUNTRY HOME, MARY BS, DADDY RAYS and HILL & VALLEY brand names, and under private labels. Bakery products include primarily fig and fruit bars, cookies, breads, rolls, crumb, muffins and donuts. Bakery products are sold to the Food Service segment. Bakery products sales amounted to 26% of the Companys sales in fiscal year 2023, 29% in fiscal year 2022 and 32% in fiscal year 2021.\nFrozen Beverages\nThe Company markets frozen beverages primarily under the names ICEE, SLUSH PUPPIE and PARROT ICE which are sold primarily in the United States, Mexico and Canada. Frozen beverages are reported in the Frozen Beverages segment.\nFrozen beverage sales amounted to 14% of the Companys revenue in fiscal year 2023, 13% in fiscal year 2022 and 11% in fiscal year 2021.\nUnder the Companys principal marketing program for frozen carbonated beverages, it installs frozen beverage dispensers for its ICEE brand at customer locations and thereafter services the machines, arranges to supply customers with ingredients required for production of the frozen beverages, and supports customer retail sales efforts with in-store promotions and point-of-sale materials. The Company sells frozen non-carbonated beverages under the SLUSH PUPPIE and PARROT ICE brands through a distributor network and through its own distribution network. The Company also provides repair and maintenance service to customers for customer-owned equipment and sells equipment in its Frozen Beverages segment. Revenue from equipment sales and repair and maintenance services totaled 9% of the Companys sales in each of the fiscal years 2023, 2022 and 2021.\nEach new frozen carbonated customer location requires a frozen beverage dispenser supplied by the Company or by the customer. Company-supplied frozen carbonated dispensers are purchased from outside vendors or rebuilt by the Company.\nThe Company provides managed service and/or products to approximately 132,000 Company-owned and customer-owned dispensers.\nThe Company has the rights to market and distribute frozen beverages under the name ICEE and Slush Puppie to the entire continental United States as well as internationally.\nOther Products\nOther products sold by the Company include funnel cakes sold under the FUNNEL CAKE FACTORY brand name and smaller amounts of various other food products. These products are sold in the Food Service and Frozen Beverages segments.\nCustomers\nThe Company sells its products to two principal channels: foodservice and retail supermarkets. The primary products sold to the foodservice channel are soft pretzels, frozen beverages, frozen novelties, churros, handheld products and baked goods. The primary products sold to the retail supermarket channel are soft pretzels, frozen novelties and handheld products.\nWe have several large customers that account for a significant portion of our sales. Our top ten customers accounted for 43%, 43% and 43% of our sales during fiscal years 2023, 2022 and 2021, respectively, with our largest customer accounting for 9% of our sales in fiscal 2023, 8% of our sales in fiscal 2022 and 11% of our sales in fiscal 2021. Five of the ten customers in 2023 are food distributors who sell our product to many end users. The loss of one or more of our large customers could adversely affect our results of operations. These customers typically do not enter into long-term contracts and make purchase decisions based on a combination of price, product quality, consumer demand and customer service performance. If our sales to one or more of these customers are reduced, this reduction may adversely affect our business. If receivables from one or more of these customers become uncollectible, our operating income would be adversely impacted.\nThe Food Service and the Frozen Beverages segments sell primarily to foodservice channels. The Retail Supermarkets segment sells primarily to the retail supermarket channel.\nThe Companys customers in the Food Service segment include snack bars and food stands in chain, department and mass merchandising stores, malls and shopping centers, fast food and casual dining restaurants, stadiums and sports arenas, leisure and theme parks, convenience stores, movie theatres, warehouse club stores, schools, colleges and other institutions, and independent retailers. Machines and machine parts are sold to other food and beverage companies. Within the food service industry, the Companys products are purchased by the consumer primarily for consumption at the point-of-sale.\nThe Company sells its products to an estimated 85-90% of supermarkets in the United States. Products sold to retail supermarket customers are primarily soft pretzel products, including SUPERPRETZEL and AUNTIE ANNES, frozen novelties including LUIGIS Real Italian Ice, MINUTE MAID Juice Bars and Soft Frozen Lemonade, WHOLE FRUIT frozen fruit bars, WHOLE FRUIT Sorbet, PHILLY SWIRL cups and sticks, MARY BS biscuits and dumplings, DADDY RAYS fig and fruit bars, HILL & VALLEY baked goods, and ICEE Squeeze-Up Tubes. Within the retail supermarket industry, the Companys frozen and prepackaged products are purchased by the consumer for consumption at home.\nMarketing and Distribution\nThe Company supports its portfolio of brands with national and regional marketing programs. For the Food Service and Frozen Beverages segments customers, these marketing programs includes providing ovens, mobile merchandisers, display cases, freezers, kiosks, warmers, frozen beverage dispensers and other merchandising equipment for the individual customers requirements and point-of-sale materials as well as participating in trade shows and in-store demonstrations. The Companys ongoing advertising and promotional campaigns for its Retail Supermarket segments products include consumer advertising campaigns across traditional and digital channels, and print/digital media with value added shopper offers and promotions.\nThe Company develops and introduces new products on a routine basis. The Company evaluates the success of new product introductions on the basis of sales and profit levels.\nThe Companys products are sold through a network of food brokers, independent sales distributors and the Companys own direct sales force. For its snack food products, the Company maintains warehouse and distribution facilities in Pennsauken, Bellmawr and Bridgeport, New Jersey; Vernon (Los Angeles), Colton and Lancaster, California; Brooklyn, New York; Scranton and Hatfield, Pennsylvania; Carrollton (Dallas) and Terrell, Texas; Atlanta, Georgia; Moscow Mills (St. Louis), Missouri; Pensacola and Tampa, Florida; Solon, Ohio; Weston, Oregon; Holly Ridge, North Carolina; Rock Island, Illinois; and Paducah, Kentucky. Frozen beverages and machine parts are distributed from 170 Company managed warehouse and distribution facilities located in 44 states, Mexico and Canada, which allow the Company to directly service its customers in the surrounding areas. The Companys products are shipped in frozen and other vehicles from the Companys manufacturing and warehouse facilities on a fleet of Company operated tractor-trailers, trucks and vans, as well as by independent carriers.\nSeasonality\nThe Companys sales are seasonal because frozen beverage sales and frozen novelties sales are generally higher during the warmer months.\nTrademarks and Patents\nThe Company has a significant trademark portfolio, the most important of which are SUPERPRETZEL, TEXAS TWIST, NEW YORK PRETZEL, BAVARIAN BAKERY, SOFTSTIX and BRAUHAUS for its pretzel products; DIPPIN DOTS, SHAPE-UPS, WHOLE FRUIT, PHILLY SWIRL and LUIGIS for its frozen novelties; ¡HOLA!, and CALIFORNIA CHURROS for its churros; ICEE, ARCTIC BLAST, SLUSH PUPPIE and PARROT ICE for its frozen beverages; FUNNEL CAKE FACTORY for its funnel cake products, and MRS. GOODCOOKIE, READI-BAKE, COUNTRY HOME, CAMDEN CREEK, MARY BS, DADDY RAYS and HILL & VALLEY for its bakery products.\nThe Company markets frozen beverages under the trademark ICEE in all of the United States and in Mexico and Canada. Additionally, the Company has the international rights to the trademark ICEE.\nThe trademarks, when renewed and continuously used, have an indefinite term and are considered important to the Company as a means of identifying its products. The Company considers its trademarks important to the success of its business.\nThe Company has numerous patents related to the manufacturing and marketing of its products.\nSuppliers\nThe Companys manufactured products are produced from raw materials which are readily available from numerous sources. With the exception of the Companys churro production equipment, funnel cake production equipment and soft pretzel twisting equipment, all of which are made for the Company by independent third parties, and certain specialized packaging equipment, the Companys manufacturing equipment is readily available from various sources. Syrup for frozen beverages is purchased primarily from The Coca-Cola Company, Keurig Dr. Pepper, Inc., the Pepsi Cola Company, and Jogue, Inc. Cups. Straws and lids are readily available from various suppliers. Parts for frozen beverage dispensing machines are purchased from several sources.\nCompetition\nSnack food and bakery products markets are highly competitive. The Companys principal products compete against similar and different food products manufactured and sold by numerous other companies, some of which are substantially larger and have greater resources than the Company. As the soft pretzel, frozen novelties, bakery products and related markets evolve, additional competitors and new competing products may enter the markets. Competitive factors in these markets include product quality, customer service, taste, price, identity and brand name awareness, method of distribution and sales promotions.\nThe Company believes it is the only national distributor of soft pretzels. However, there are numerous regional and local manufacturers of food service and retail supermarket soft pretzels as well as several chains of retail pretzel stores.\nIn Frozen Beverages, the Company competes directly with other frozen beverage companies. There are many other regional frozen beverage competitors throughout the country and one large retail chain which uses its own frozen beverage brand.\nThe Company competes with large soft drink manufacturers for counter and floor space for its frozen beverage dispensing machines at retail locations and with products which are more widely known than the ICEE, SLUSH PUPPIE and PARROT ICE frozen beverages.\nThe Company competes with several other companies in the frozen novelties and bakery products markets.\nRisks Associated with Foreign Operations\nForeign operations can involve greater risk than doing business in the United States. Foreign economies differ favorably or unfavorably from the United States economy in such respects as the level of inflation and debt, which may result in fluctuations in the value of the countrys currency and real property. Sales of our foreign operations were $70.2 million, $45.2 million and $20.8 million in fiscal years 2023, 2022 and 2021, respectively. At September 30, 2023, the total assets of our foreign operations were $61.5 million or 4.8% of total assets. At September 24, 2022, the total assets of our foreign operations were $42.7 million or 3.5% of total assets.\nGovernment Regulation and Food Safety\nOur business operations are subject to regulation by various federal, state and local government entities and agencies. As a producer of food products for human consumption, our operations are subject to stringent production, packaging, quality, labeling and distribution standards, including regulations promulgated under the Federal Food, Drug and Cosmetic Act and the Food Safety Modernization Act. We are also subject to various federal, state and local environmental protection laws. Based upon available information, the cost of compliance with these laws and regulations did not have a material effect upon the level of capital expenditures, earnings or competitive position in fiscal 2023 and is not expected to have a material impact in fiscal 2024.\nOur Food Safety & Quality (FSQA) personnel within our Compliance Department have broad, diverse academic and experience credentials and oversee all aspects of product safety & quality control across the Company. Our facilities are Global Food Safety Initiative (GFSI) certified and are audited annually by third-party certification bodies. Our Food Safety & Quality Plans are validated and verified to ensure product safety and quality. We have implemented Corporate Standards which are aligned with GFSI and Regulatory standards and routinely conduct audits to ensure compliance. We provide bi-weekly support calls for FSQA and Plant Leadership and annual Food Safety Summit Meetings to develop and strengthen our facility teams. As part of the onboarding process, and throughout their careers, employees are engaged in food safety discussions and trainings to provide safe, high-quality products to customers and consumers.\nHuman Capital Management\nEmployees and Labor Relations\nThe Company has approximately 5,000 full and part-time employees and approximately 800 workers employed by staffing agencies as of September 30, 2023. About 1,400 production and distribution employees throughout the Company are covered by collective bargaining agreements. The Company considers its culture and employee relations to be positive.\nEmployee Safety\nWe maintain a safety culture grounded on the premise of eliminating workplace incidents, risks and hazards. We have a team of dedicated Employee Health & Safety professionals within our Compliance Department who oversee all aspects of employee safety across the company. We keep our employees safe by ensuring all employees receive ongoing support and training. We have developed and implemented processes to identify and eliminate safety incidents by reducing their frequency and severity. We also closely review and monitor our safety performance. According to data from the U.S Bureau of Labor Statistics, the Companys Total Recordable Incident Rate (TRIR) and Days Away, Restricted or Transferred (DART) incident rates were lower than food manufacturing averages. Our goal is to reduce Occupational Safety and Health Administration (OSHA) recordable incidents year over year.\nProfessional Development\nWe deploy a variety of training programs throughout the organization and go to great lengths to make learning and knowledge available to our employees. Programs such as tuition reimbursement, mentorships, internships and internal trainings are some of the ways in which we invest in our people and their knowledge. We know that these investments are not only beneficial for our employees, but they are also important for the future success of our business. We continue to see increases in internal promotions across all levels of the organization.\nDiversity and Inclusion\nWe believe that having an inclusive and diverse culture strengthens our ability to recruit and develop talent and allows our employees to thrive and succeed. Diversity of input and perspectives is an essential part of our strategic plan to build a winning team and culture. We believe that one key to success is attracting and retaining a diverse workforce that reflects our consumers of today and tomorrow, and we strive to do so. We also strive to foster an inclusive and diverse workplace culture where colleagues feel a sense of belonging, and are included in discussions and valued for their contributions.\nCompensation\nWe believe in equal pay for equal work and that compensation should match talent, experience and skill set of a person.\nAvailable Information\nThe Companys internet address is www.jjsnack.com. On the investor relations section of its website, the Company provides free access to its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to these reports, as soon as reasonably practicable after such materials are electronically filed with, or furnished to, the Securities and Exchange Commission (SEC). The information on the website listed above is not and should not be considered part of this annual report on Form 10-K and is not incorporated by reference in this document. Item 1A.\nRisk Factors\nOur business is subject to numerous risks and uncertainties. You should carefully consider the risks described below, together with all the other information included in this report, in considering our business and prospects. The risks and uncertainties described below are not the only ones facing us. Additional risks and uncertainties not presently known to us or that we currently deem insignificant or immaterial may also materially and adversely affect our business, financial condition, results of operations or prospects. The following is a discussion of known potentially significant risks which could result in harm to our business, financial condition or results of operations.\nRisks of Shortages or Increased Cost of Raw Materials\nWe are exposed to market risks arising from adverse changes in commodity prices, affecting the cost of our raw materials and energy. The raw materials and energy which we use for the production and distribution of our products are largely commodities that are subject to price volatility and fluctuations in availability caused by changes in global supply and demand, weather conditions, agricultural uncertainty or governmental controls. We purchase these materials and energy mainly in the open market. Our procurement practices are intended to reduce the risk of future price increases, but also may potentially limit the ability to benefit from possible price decreases. If commodity price changes result in increases in raw materials and energy costs, we may not be able to increase our prices to offset these increased costs without suffering reduced revenue and operating income.\nGeneral Economic Risk\nThe willingness of our customers and consumers to purchase our products may depend in part on economic conditions. Worsening economic conditions or future challenges to economic growth could have a negative impact on consumer demand, which could adversely affect our business. Deterioration of national and global economic conditions could cause consumers to forego certain purchases during economic downturns that could result in decreased demand for our business. The economic uncertainty may limit our ability to increase or maintain prices and reduce sales of higher margin products. In addition, changes in tax or interest rates, whether due to recession, efforts to combat inflation, financial and credit market disruptions or other reasons, could negatively impact us.\nRisks Relating to Pandemics, Epidemics, or Other Disease Outbreaks\nPandemics, epidemics, or other disease outbreaks could significantly change consumption patterns for our products. These changes could force us to rapidly adapt to those new patterns, and, if we do not, our business could be materially and adversely affected. Additionally, pandemics, epidemics or other disease outbreaks may depress or otherwise impact demand for our products because quarantines may inhibit consumption or as the result of other factors. Restrictions on public gatherings or interactions may also limit the opportunity for our customers and consumers to purchase our products, especially in certain of our sales channels, such as food service. Any economc downturn caused by any pandemic, epidemic, or other disease outbreak may also cause substantial changes in consumer behavior and our supply chain operations, some of which may materially affect our operations and results of operations.\nGeneral Risks of the Food Industry\nWe are subject to the risks of adverse changes in general economic conditions; evolving consumer preferences and nutritional and health-related concerns; changes in food distribution channels; federal, state and local food processing controls or other mandates; changes in federal, state, local and international laws and regulations, or in the application of such laws and regulations; consumer product liability claims; risks of product tampering and contamination; and negative publicity surrounding actual or perceived product safety deficiencies. The increased buying power of large supermarket chains, other retail outlets and wholesale food vendors could result in greater resistance to price increases and could alter customer inventory levels and access to shelf space.\nRisks of Shortages or Increased Costs of Labor\nOur businesses operate in highly competitive markets. The labor market in the United States is very competitive. We depend on the skills, working relationships, and continued services of employees, including our experienced management team. We must hire, train and develop effective employees. We compete with other companies both within and outside of our industry for talented employees, and we may lose key personnel or fail to attract, train, and retain other talented personnel. In addition, our ability to achieve our operating goals depends on our ability to identify, hire, train, and retain qualified individuals. Any such loss or failure could adversely affect our product sales, financial condition, and operating results. Additionally, a shortage in the labor pool and other general inflationary pressures or changes, and applicable laws and regulations could increase labor costs, which could have a material adverse effect on our consolidated operating results or financial condition.\nIn addition, some of our associates are covered by collective bargaining agreements, and other associates may seek to be covered by collective bargaining agreements. Strikes or work stoppages or other business interruptions could occur if we are unable to renew these agreements on satisfactory terms or enter into new agreements on satisfactory terms or if we are unable to otherwise manage changes in, or that affect, our workforce, which could impair manufacturing or distribution of our products or result in a loss of sales, which could adversely impact our business, financial condition, or results of operations. The terms and conditions of existing, renegotiated or new collective bargaining agreements could also increase our costs or otherwise affect our ability to fully implement future operational changes to enhance our efficiency or adapt to changing business needs or strategy.\nEnvironmental Risks\nThe disposal of solid and liquid waste material and the discharge of airborne pollutants resulting from the preparation and processing of foods is subject to various federal, state and local laws and regulations relating to the protection of the environment. Such laws and regulations have an important effect on the food processing industry as a whole, requiring substantially all firms in the industry to incur material expenditures for modification of existing processing facilities and for construction of upgraded or new waste treatment facilities.\nWe cannot predict what environmental legislation or regulations will be enacted in the future, how existing or future laws or regulations will be administered or interpreted or what environmental conditions may be found to exist. Enactment of more stringent laws or regulations or more strict interpretation of existing laws and regulations may require additional expenditure by us, some of which could have a negative impact on our operations and financial condition. Additionally, the failure by any one or more of our suppliers to comply with applicable federal, state and local laws and regulations relating to the protection of the environment, or allegations of non-compliance, may disrupt their operations and could result in accompanying disruptions to our operations.\nRisks Resulting from Customer Concentration\nWe have several large customers that account for a significant portion of our sales. Our top ten customers accounted for 43% of our sales during fiscal years 2023, 2022 and 2021, respectively, with our largest customer accounting for 9% of our sales in 2023, 8% of our sales in 2022 and 11% of our sales in 2021.\nFive of the ten customers are food distributors who sell our product to many end users. The loss of one or more of our large customers could adversely affect our results of operations. These customers typically do not enter into long-term contracts and make purchase decisions based on a combination of price, product quality, consumer demand and customer service performance. If our sales to one or more of these customers are reduced, this reduction may adversely affect our business. If receivables from one or more of these customers become uncollectible, our operating income would be adversely impacted.\nRisks Relating to Competition\nOur businesses operate in highly competitive markets. We compete against national and regional manufacturers and distributors on the basis of price, quality, product variety, brand recognition and loyalty, and effective distribution. Many of our major competitors in the market are larger and have greater financial and marketing resources than we do. Increased competition from our competitors could lead to downward pressure on prices and/or a decline in our market share, either of which could adversely affect our results. See Competition in Item 1 for more information about our competitors.\nRisks Relating to Manufacturing and Distribution\nOur ability to purchase, manufacture and distribute products is critical to our success. Because we source certain products from single manufacturing sites, it is possible that we could experience a production disruption that results in a reduction or elimination of the availability of some of our products. If we are not able to obtain alternate production capability in a timely manner, or on favorable terms, it could have a negative impact on our business, results of operations, financial condition and cash flows, including the potential for long-term loss of product placement with various customers. We are also subject to risks of other business disruptions associated with our dependence on production facilities and distribution systems. Natural disasters, terrorist activity, cyberattacks or other unforeseen events could interrupt production or distribution and have a material adverse effect on our business, results of operations, financial condition and cash flows, including the potential for long-term loss of product placement with our customers.\nRisks Relating to the Availability and Costs of Transportation\nOur ability to obtain adequate and reasonably priced methods of transportation to distribute our products, including refrigerated trailers for many of our products, is a key factor to our success. Delays in transportation, including weather-related delays, and carrier capacity limitations, could have a material adverse effect on our business and results of operations. Further, higher fuel costs and increased line haul costs due to industry capacity constraints, customer delivery requirements and a more restrictive regulatory environment could also negatively impact our financial results. We pay fuel surcharges that fluctuate with the price of diesel fuel to third-party transporters of our products, and such surcharges can be substantial. Any sudden or dramatic increases in the price of diesel fuel would serve to increase our fuel surcharges and our cost of goods sold. These higher costs could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nRisks Relating to Manufacturing Capacity Constraints\nOur current manufacturing resources may be inadequate to meet significantly increased demand for some of our products. Our ability to increase our manufacturing capacity depends on many factors, including the costs and availability of equipment, the equipment delivery and construction lead-times, installation, qualification, regulatory permitting and regulatory requirements. A lack of sufficient manufacturing capacity to meet demand could cause our customer service levels to decrease, which may negatively affect customer demand for our products and customer relations generally, which in turn could have a material adverse effect on our business, results of operations, financial condition and cash flows. In addition, operating facilities at or near capacity may also increase production and distribution costs and negatively affect relations with our employees or contractors, which could result in disruptions in our operations.\nRisks Relating to Acquisition Integration\nFrom time to time, the Company undertakes acquisitions or divestitures. The success of any acquisition or divestiture depends on the Companys ability to identify opportunities that help the Company meet its strategic objectives, consummate a transaction on favorable contractual terms, and achieve expected returns and other financial benefits.\nAcquisitions, including future acquisitions, require us to efficiently integrate the acquired business or businesses, which involves a significant degree of difficulty, including the following:\n--\nintegrating the operations and business cultures of the acquired businesses;\n--\nthe possibility of faulty assumptions underlying our expectations regarding the prospects of the acquired businesses;\n--\nattracting and retaining the necessary personnel associated with the acquisitions;\n--\ncreating uniform standards, controls, procedures, policies and information systems and controlling the costs associated with such matters; and\n--\nexpectations about the performance of acquired trademarks and brands and the fair value of such trademarks and brands.\nDivestitures have operational risks that may include impairment charges. Divestitures also present unique financial and operational risks, including diverting management attention from the existing core business, separating personnel and financial data and other systems, and adversely affecting existing business relationships with suppliers and customers.\nIn situations where acquisitions and divestitures are not successfully implemented or completed, or the expected benefits of such acquisitions or divestitures are not otherwise realized, the Companys business or financial results could be negatively impacted.\nNew Jersey Law and Provisions of Our Amended and Restated Certificate of Incorporation and Bylaws May Inhibit a Change In Control\nThe New Jersey Shareholders' Protection Act, N.J.S.A. 14A:10A-1, et seq., may delay, deter or prevent a change in control by prohibiting the Company from engaging in a business combination transaction with an interested shareholder for a period of five years after the person becomes an interested stockholder, even if a majority of our shareholders believe a change in control would be in the best interests of the Company and its shareholders. In addition, our Amended and Restated Certificate of Incorporation and Bylaws contain provisions that may delay, deter or prevent a future acquisition of J & J Snack Foods Corp. not approved by our Board of Directors. This could occur even if our shareholders are offered an attractive value for their shares or if a substantial number or even a majority of our shareholders believe the takeover is in their best interest. These provisions are intended to encourage any person interested in acquiring us to negotiate with and obtain the approval of our Board of Directors in connection with the transaction. Provisions of our Amended and Restated Certificate of Incorporation and Bylaws that could delay, deter or prevent a future acquisition include the following:\n--\na classified Board of Directors;\n--\nthe requirement that our shareholders may only remove Directors for cause;\n--\nlimitations on share holdings and voting of certain persons who exceed the Voting Threshold specified in the Amended and Restated Certificate of Incorporation;\n--\nspecial Director voting rights are granted to certain Experienced Directors only in the event of a hostile change of Board control, as such terms are defined in the Amended and Restated Certificate of Incorporation;\n--\nthe ability of the Board of Directors to consider the interests of various constituencies, including our employees, customers, suppliers, creditors and the local communities in which we operate;\n--\nshareholders do not generally have the right to call special meetings or to act by written consent;\n--\nour Bylaws contain advance notice procedures for nominations of Directors or submission of shareholder proposals at an annual meeting; and\n--\nour Bylaws contain a forum selection clause providing that certain litigation against the Company can only be brought in New Jersey state or federal courts.\nRisks Relating to Gerald B. Shreiber\nGerald B. Shreiber is the founder and a Director of the Company. He is currently beneficial owner of approximately 20% of its outstanding common stock, held in a trust for his benefit. Our Amended and Restated Certificate of Incorporation provides Mr. Shreiber with certain special voting rights with respect to any matters to be voted on by the Board of Directors. As a result, as of the date of this Report, Mr. Shreiber is entitled to cast six (6) votes on all matters upon which the Board of Directors is entitled to vote.\nRisk Related to Increases in our Health Insurance Costs\nThe costs of employee health care insurance have been increasing in recent years due to rising health care costs, legislative changes, and general economic conditions. Because of the breadth and complexity of health care regulations as well as other health care reform legislation considered by Congress and state legislatures, we cannot predict with certainty the future effect of these laws on us. A continued increase in health care costs or additional costs incurred as a result of new or existing health care reform laws or changes in enforcement policies could have a negative impact on our financial position and results of operations.\nRisk Related to Product Changes\nThere are risks in the marketplace related to trade and consumer acceptance of product improvements, packing initiatives and new product introductions. We cannot be sure if our new products, product improvements, or packaging initiatives will be accepted by customers.\nRisks Associated with Foreign Operations\nForeign economies may differ favorably or unfavorably from the United States economy in such respects as the level of inflation and debt, which may result in fluctuations in the value of the countrys currency. Further, there may be less government regulation in various countries, and we may face difficulty in enforcing our legal rights outside the United States. Additionally, in some foreign countries, there is the possibility of expropriation or confiscatory taxation limitations on the removal of property or other assets, political or social instability or diplomatic developments which could affect the operations and assets of U.S. companies doing business in that country. Any such difficulties noted above could affect our business. Sales of our foreign operations were $70.2 million, $45.2 million and $20.8 million in fiscal years 2023, 2022 and 2021, respectively. At September 30, 2023, the total assets of our foreign operations were approximately $61.5 million or 4.8% of total assets. At September 24, 2022, the total assets of our foreign operations were $42.7 million or 3.5% of total assets.\nRisks Associated with our Information Technology Systems\nThe efficient operation of our business depends on our information technology systems. We rely on our information technology systems to effectively manage our business data, communications, supply chain, manufacturing, order entry and fulfillment, and other business processes. The failure of our information technology systems (including those provided to us by third parties) to perform as we anticipate could disrupt our business and could result in production, billing, collecting, and ordering errors, processing inefficiencies, and the loss of sales and customers, causing our business and results of operations to suffer.\nOur information technology systems may be vulnerable to damage or interruption from circumstances beyond our control, including fire, natural disasters, systems failures, security breaches or intrusions (including those against our third-party providers and theft of customer, consumer or other confidential data), and viruses. Although we continue to monitor our information technology networks, if we are unable to prevent physical and electronic break-ins, cyber-attacks and other information security breaches, we may suffer material financial and reputational damage, be subject to litigation or incur significant remediation costs or penalties.\nRisks Associated with Real or Perceived Safety Issues Regarding our Food Products\nWe sell food products for human consumption, which involves risks such as product contamination or spoilage, product tampering, other adulteration of food products, mislabeling, and misbranding. We can be impacted by both real and unfounded claims regarding the safety of our operations, or concerns regarding mislabeled, adulterated, contaminated or spoiled food products. Any of these circumstances could necessitate a voluntary or mandatory recall due to a substantial product hazard, a need to change a products labeling or other consumer safety concerns. A pervasive product recall may result in significant loss due to the costs of a recall, related legal claims, including claims arising from bodily injury or illness caused by our products, the destruction of product inventory, or lost sales due to product unavailability or negative publicity. A highly publicized product recall, whether involving us or any related products made by third parties, also could result in a loss of customers or an unfavorable change in consumer sentiment regarding our products or any category in which we operate. In addition, an allegation of noncompliance with federal or state food laws and regulations could force us to cease production, stop selling our products or create significant adverse publicity that could harm our credibility and decrease market acceptance of our products. Any of these events could have a material adverse effect on our business, results of operations, financial condition and cash flows.\nRisks Associated with our Intellectual Property Rights\nWe consider our intellectual property rights, particularly our trademarks, to be a significant and valuable aspect of our business. We protect our intellectual property rights through a combination of trademark, patent, copyright and trade secret protection, contractual agreements and policing of third-party misuses of our intellectual property in traditional retail and digital environments. Our failure to obtain or adequately protect our intellectual property or any change in law that lessens or removes the current legal protections of our intellectual property may diminish our competitiveness and adversely affect our business and financial results.\nCompeting intellectual property claims that impact our brands or products may arise unexpectedly. Any litigation or disputes regarding intellectual property may be costly and time consuming and may divert the attention of our management and key personnel from our business operations. We may also be subject to significant damages or injunctions against development, launch and sale of certain products. Any of these occurrences may harm our business and financial results.\nRisks Associated with the Favorable Perception of our Brands\nWe have a number of iconic brands with significant value. Maintaining and continually enhancing the value of these brands is critical to the success of our business. Brand value is primarily based on consumer perceptions. Success in promoting and enhancing brand value depends in large part on our ability to provide high-quality products. Brand value could diminish significantly due to a number of factors, including consumer perception that we have acted in an irresponsible manner, adverse publicity about our products, packaging, ingredients, our environmental, social, human capital or governance practices, our failure to maintain the quality of our products, the failure of our products to deliver consistently positive consumer experiences, or the products becoming unavailable to consumers. The growing use of social and digital media by consumers increases the speed and extent that information and opinions can be shared. Negative posts or comments about us, our brands, products or packaging on social or digital media could seriously damage our brands and reputation. In addition, we might fail to appropriately target our marketing efforts, anticipate consumer preferences, or invest sufficiently in maintaining our brand image. If we do not maintain the favorable perception of our brands, our results could be adversely impacted.\nRisk Associated with Generating Anticipated Cost Savings and/or Operating Efficiencies Associated with our Strategic Initiatives\nOur future success and earnings growth depend in part on our ability to achieve the appropriate cost structure and operate efficiently in the highly competitive food industry, particularly in an environment of volatile cost inputs. We continuously pursue initiatives to reduce costs and increase effectiveness. We also regularly pursue cost productivity initiatives in procurement, manufacturing and logistics. Any failure or delay in implementing our initiatives in accordance with our plans could adversely affect our ability to meet our long-term growth and profitability expectations and could adversely affect our business. If we do not continue to effectively manage costs and achieve additional efficiencies, our competitiveness and profitability could decrease.\nSeasonality and Quarterly Fluctuations\nOur sales are affected by the seasonal demand for our products. Demand is greater during the summer months primarily as a result of the warm weather demand for our ICEE and frozen novelties products. Because of seasonal fluctuations, there can be no assurance that the results of any particular quarter will be indicative of results for the full year or for future years. Item 1B.\nUnresolved Staff Comments\nWe have no unresolved SEC staff comments to report. Item 2.\nProperties\nThe Companys primary east coast manufacturing facility is located in Pennsauken, New Jersey in a 70,000 square foot building on a two-acre lot. Soft pretzels, churros, and funnel cake are manufactured at this Company-owned facility. The Company owns a 128,000 square foot building adjacent to this manufacturing facility which contains a large freezer for warehousing and distribution purposes. The Company also owns a 43,000 square foot office and warehouse building in the same complex. Additionally, the Company leases, through July 2025, 30,000 square feet of office space in Mt. Laurel, New Jersey which serves as the Companys headquarters.\nThe Company owns a 150,000 square foot building on eight acres in Bellmawr, New Jersey. The facility is used by the Company to manufacture soft pretzels and various lines of baked goods.\nThe Companys primary west coast manufacturing facility is located in Vernon (Los Angeles), California. It consists of a 137,000 square foot facility in which soft pretzels, churros and various lines of baked goods are produced and warehoused. Included in the 137,000 square foot facility is a 30,000 square foot freezer used for warehousing and distribution purposes. The facility is leased through November 2030. The Company leases an additional 80,000 square feet of office and warehouse space, adjacent to its manufacturing facility, through November 2030.\nThe Company leases a 22,000 square foot soft pretzel manufacturing facility located in Brooklyn, New York. The lease runs through September 2027.\nThe Company leases through June 2030 a 45,000 square foot churros and funnel cake manufacturing facility located in Colton, California.\nThe Company leases an 85,000 square foot bakery manufacturing facility located in Atlanta, Georgia. The lease runs through December 2024 with an option to extend to December 2026.\nThe Company leases a 129,000 square foot bakery manufacturing facility located in Rock Island, Illinois. The lease runs through February 2025.\nThe Company owns a 46,000 square foot frozen novelties manufacturing facility and a 42,000 square foot dry storage warehouse located on six acres in Scranton, Pennsylvania.\nThe Company leases a 29,600 square foot soft pretzel manufacturing facility located in Hatfield, Pennsylvania. The lease runs through June 2032.\nThe Company leases a 48,000 square foot soft pretzel manufacturing facility located in Carrollton, Texas. The lease runs through April 2026. The Company leases an additional property containing a 6,500 square foot storage freezer across the street from the manufacturing facility, which expires March 2030.\nThe Companys fresh bakery products manufacturing facility and offices are located in Bridgeport, New Jersey in three buildings totaling 133,000 square feet. The buildings are leased through December 2025.\nThe Company owns a 165,000 square foot fig and fruit bar manufacturing facility located on 9-1/2 acres in Moscow Mills (St. Louis), Missouri.\nThe Company owns an 84,000 square foot handheld products manufacturing facility in Holly Ridge, North Carolina.\nThe Company leases a 70,000 square foot handheld products manufacturing facility in Weston, Oregon which is leased through June 30, 2031. The Company leases an additional 11,300 square foot freezer storage facility in Weston, Oregon which expires May 2024.\nThe Company leases 84,000 square feet of office space in LaVergne (Nashville), Tennessee through February 2035 for its ICEE headquarters.\nThe Company leases a 44,000 square foot frozen novelties manufacturing facility in Tampa, Florida which is leased through November 2030.\nThe Company owns two industrial buildings totaling 107,000 square feet, as well as a 76,000 square foot parcel of land in Paducah, Kentucky. Additionally, the Company leases three buildings totaling 34,000 square feet in Paducah, Kentucky, with lease end dates ranging from December 2022 through February 2027.\nThe Company leases two frozen novelties warehouse facilities in Lancaster, California, totaling 23,000 square feet. These properties are leased through March 2026.\nThe Company also leases approximately 170 smaller warehouse and distribution facilities in 44 states, Mexico, Canada, Australia and China.\nThe Company leases a 117,000 square foot cold storage facility in Terrell, Texas which is leased through November 2043. Item 3.\nLegal Proceedings\nThe Company has no material pending legal proceedings, other than ordinary routine litigation incidental to the business, to which the Company or any of its subsidiaries is a party or of which any of their property is subject. Item 4.\nMine Safety Disclosures\nNot Applicable\nPART II Item 5.\nMarket For Registrants Common Equity, Related Stockholder Matters And Issuer Purchases Of Equity Securities\nThe Companys common stock is traded on the NASDAQ Global Select Market under the symbol JJSF.\nAs of September 30, 2023, we had approximately 75 stockholders of record of our common stock.\nWe did not purchase any shares of our common stock in our fiscal fourth quarter, and no shares were withheld in our fiscal fourth quarter to cover taxes associated with the vesting of certain restricted stock units held by officers and employees.\nA plan to purchase 500,000 shares was announced on August 4, 2017 with no expiration date. 318,858 shares remain to be purchased under this plan.\nFor information on the Companys Equity Compensation Plans, please see Item 12 herein.\nThe following graph shows a five-year comparison of cumulative total returns for our stock, the Nasdaq Composite Index and our peer group, the Standard & Poors (S&P) Packaged Foods & Meats Index. Item 6.\n[ RESERVED ] Item 7.\nManagements Discussion And Analysis Of Financial Condition And Results Of Operations\nObjective\nThis Managements Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to provide a reader of our financial statements with a narrative from the perspective of our management regarding our financial condition and results of operations, liquidity and certain other factors that may affect our future results. The following discussion should be read in conjunction with the consolidated financial statements and accompanying notes included in Item 8 of this Form 10-K. Refer to the Companys Annual Report on Form 10-K for the fiscal year ended September 24, 2022 for additional information related to the discussion and analysis of our financial condition and results of operations for the fiscal year ended September 24, 2022 compared to the fiscal year ended September 25, 2021.\nBusiness Overview\nThe Company manufactures snack foods and distributes frozen beverages which it markets nationally to the foodservice and retail supermarket industries. The Companys principal snack food products are soft pretzels, frozen novelties, churros and bakery products. We are the largest manufacturer of soft pretzels in the United States. Other snack food products include funnel cake and handheld products. The Companys principal frozen beverage products are the ICEE brand frozen carbonated beverage and the SLUSH PUPPIE brand frozen non-carbonated beverage.\nThe Companys Food Service and Frozen Beverages sales are made primarily to foodservice customers including snack bar and food stand locations in leading chain, department, discount, warehouse club and convenience stores; malls and shopping centers; fast food and casual dining restaurants; stadiums and sports arenas; leisure and theme parks; movie theatres; independent retailers; and schools, colleges and other institutions. The Companys retail supermarket customers are primarily supermarket chains.\nBusiness Trends\nCOVID-19\nDating back to the onset of the COVID-19 pandemic in fiscal 2020, the effects of COVID-19 on consumer behavior have impacted the relevant demand for our Food Service, Retail, and Frozen Beverage segments. In fiscal 2020, we saw a shift in demand towards increased at-home food consumption, which benefited our Retail segment, and away from in-restaurant dining, and experience driven activities, which negatively impacted our Food Service and Frozen Beverage segments. This shift in demand proved inconsistent and volatile over the course of the pandemic. In fiscal 2021 and fiscal 2022, as part of the pandemic economy that impacted our operations opened, sales in our Food Service and Frozen Beverages segments improved.\nThe aforementioned shift, and overall volatility in demand, has had a significant impact on the operating results of each of our three segments over the past three fiscal years. Additional impacts from the pandemic have caused us to experience higher hourly wage rates paid to our front-line employees, increased costs for personal protective equipment, increased complexity and uncertainty around production planning and forecasting, and overall lower levels of efficiency in our production and distribution network, all of which has unfavorably impacted our operating results. In fiscal 2023, our operating environment became more predictable and stable, and the majority of the volatility and shifts in demand that had been more present in fiscal 2021 and 2022, somewhat subsided.\nInflation\nWe continued to experience cost inflation through fiscal 2023, although the impact was significantly less than it had been in fiscal 2022, primarily tied to a smaller group of raw materials and packaging, and materially offset by the benefit of the pricing actions that had been taken in fiscal 2022. The inflationary cost environment we experienced during fiscal 2022 resulted in significantly higher input costs for our business. During fiscal 2022, we experienced unprecedented inflationary pressures on commodities such as flour, oils, eggs, meats and dairy, in addition to notably higher costs for packaging, freight and warehousing, and labor. To help offset these cost headwinds, we implemented a series of pricing actions throughout fiscal 2022.\nFiscal Period\nThe Companys fiscal year is the 52- or 53- week period that ends on the last Saturday of September. An additional week is included in the last fiscal quarter every five or six years to realign the Companys fiscal quarters with calendar quarters, which occurred in the Companys fourth quarter of fiscal 2023. The Companys fiscal year 2023 spanned 53 weeks, whereas fiscal years 2022 and 2021 spanned 52 weeks each.\nRESULTS OF OPERATIONS:\nFiscal Year 2023 (53 weeks) Compared to Fiscal Year 2022 (52 weeks)\nResults of Consolidated Operations\nThe following discussion provides a review of results for the fiscal year ended September 30, 2023 as compared with the fiscal year ended September 24, 2022.\nSummary of Results\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(53 weeks)\n(52 weeks)\n% Change\n(in thousands)\nNet Sales\n$ 1,558,829\n$ 1,380,656\n12.9 %\nCost of goods sold\n1,088,964\n1,011,014\n7.7 %\nGross Profit\n469,865\n369,642\n27.1 %\nOperating expenses\nMarketing\n110,258\n91,636\n20.3 %\nDistribution\n172,804\n159,637\n8.2 %\nAdministrative\n75,425\n55,189\n36.7 %\nIntangible asset impairment charges\n1,678\n1,010\nOther general expense\n(50.9 )%\nTotal Operating Expenses\n360,347\n307,843\n17.1 %\nOperating Income\n109,518\n61,799\n77.2 %\nOther income (expense)\nInvestment income\n2,743\n179.9 %\nInterest expense\n(4,747 )\n(1,025 )\n363.1 %\nEarnings before income taxes\n107,514\n61,754\n74.1 %\nIncome tax expense\n28,608\n14,519\n97.0 %\nNET EARNINGS\n$ 78,906\n$ 47,235\n67.0 %\nComparisons as a Percentage of Net Sales\nFiscal year ended\nSeptember 30,\nSeptember 24,\nBasis Pt Chg\nGross profit\n30.1 %\n26.8 %\nMarketing\n7.1 %\n6.6 %\nDistribution\n11.1 %\n11.6 %\n(50 )\nAdministrative\n4.8 %\n4.0 %\nOperating income\n7.0 %\n4.5 %\nEarnings before income taxes\n6.9 %\n4.5 %\nNet earnings\n5.1 %\n3.4 %\nNET SALES\nNet sales increased by $178.2 million, or 13%, to $1,558.8 million in fiscal 2023. Fiscal 2023 net sales include $96.0 million of net sales from Dippin Dots, an increase of $62.2 million from prior fiscal year with the increase primarily attributable to the timing of the acquisition in prior year results. Organic sales growth was driven by growth across all three of the Companys business segments, led by our core products including soft pretzels, churros, frozen novelties and frozen beverages. The organic sales growth was largely driven by improved marketing, new customers, additional product placement, as well as the benefit of our pricing actions that had been taken throughout fiscal 2022. To a lesser extent, fiscal 2023 net sales were benefited by the extra week in the fiscal year.\nGROSS PROFIT\nGross profit increased by $100.2 million, or 27%, to $469.9 million in fiscal 2023. Gross profit as a percentage of sales increased to 30.1% in fiscal 2023 from 26.8% in fiscal 2022. The increase in gross profit as a percentage of sales was driven by enhanced production efficiencies and the benefit of our fiscal 2022 pricing actions and a better product mix, along with the stabilization of inflationary pressures on the back of historic highs in fiscal 2022. The cost of key ingredients including flour, oils, dairy and meats either declined, or remained materially flat, though double-digit increases were seen in sugar/sweeteners and mixes, which continued to negatively impact margins on certain products including frozen novelties and churros.\nOPERATING EXPENSES\nTotal operating expenses increased by $52.5 million, or 17%, to $360.3 million in fiscal 2023 and increased as a percentage of sales to 23.1% in fiscal 2023 compared with 22.3% in fiscal 2022. The increase reflects the impact of inflationary pressures across the majority of our cost line items including industry-wide freight and distribution cost increases and wage increases that more heavily impacted the Companys comparative results in the first and second fiscal quarters, offset somewhat by the benefits seen from our strategic initiatives to improve logistics management and increase efficiency across our distribution network and supply chain. The increase also reflects the full year impact of a higher expense Dippin Dots business in fiscal 2023 results.\nOperating expenses included intangible asset impairment charges of $1.7 million in fiscal 2023 and $1.0 million in fiscal 2022. As a percentage of sales, marketing and selling expenses as a percentage of sales increased from 6.6% in fiscal 2022 to 7.1% in fiscal 2023, with the increase driven by the additional investment in marketing spend associated with new product launches and the promotion of our core brands. Distribution expenses as a percentage of sales decreased to 11.1% in fiscal 2023 from 11.6% in fiscal 2022, with the decrease driven by the benefits of our strategic initiatives to improve logistics management and increase efficiency across our distribution network and supply chain. Administrative expenses as a percentage of sales increased from 4.0% in fiscal 2022 to 4.8% in fiscal 2023, with the increase largely attributable to higher performance-based bonus payments and continued investments in capability.\nOTHER INCOME AND EXPENSE\nInvestment income increased by $1.8 million, or 180%, to $2.7 million in fiscal 2023 due to the improving interest rate environment in fiscal 2023.\nInterest expense increased by $3.7 million, or 363%, to $4.7 million in fiscal 2023 due to the Companys outstanding borrowings under the Amended Credit Agreement.\nINCOME TAX EXPENSE\nOur effective tax rate in fiscal 2023 was 26.6%. Our effective tax rate in fiscal 2022 year was 23.5%.\nNET EARNINGS\nNet earnings increased $31.7 million, or 67%, in fiscal 2023 to $78.9 million, or $4.08 per diluted share, from $47.2 million or $2.46 per diluted share, in fiscal 2022 as a result of the aforementioned items.\nThere are many factors which can impact our net earnings from year to year, among which are the supply and cost of raw materials and labor, insurance costs, factors impacting sales as noted above, the continuing consolidation of our customers, our ability to manage our manufacturing, marketing and distribution activities, our ability to make and integrate acquisitions and changes in tax laws and interest rates.\nResults of Operations - Segments\nWe have three reportable segments, as disclosed in the accompanying notes to the consolidated financial statements: Food Service, Retail Supermarkets and Frozen Beverages.\nThe Chief Operating Decision Maker for Food Service, Retail Supermarkets and Frozen Beverages reviews monthly detailed operating income statements and sales reports in order to assess performance and allocate resources to each individual segment. Sales and operating income are the key variables monitored by the Chief Operating Decision Maker and management when determining each segments and the Companys financial condition and operating performance. In addition, the Chief Operating Decision Maker reviews and evaluates depreciation, capital spending and assets of each segment on a quarterly basis to monitor cash flow and asset needs of each segment.\nThe following table is a summary of sales and operating income, which is how we measure segment profit.\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(53 weeks)\n(52 weeks)\n% Change\n(in thousands)\nNet Sales\nFood Service\n$ 981,840\n$ 872,687\n12.5 %\nRetail Supermarket\n215,428\n197,943\n8.8 %\nFrozen Beverages\n361,561\n310,026\n16.6 %\nTotal Sales\n$ 1,558,829\n$ 1,380,656\n12.9 %\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(53 weeks)\n(52 weeks)\n% Change\n(in thousands)\nOperating Income\nFood Service\n$ 49,778\n$ 18,512\n168.9 %\nRetail Supermarket\n9,375\n9,487\n(1.2 )%\nFrozen Beverages\n50,365\n33,800\n49.0 %\nTotal Operating Income\n$ 109,518\n$ 61,799\n77.2 %\nFOOD SERVICE SEGMENT RESULTS\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(53 weeks)\n(52 weeks)\n% Change\n(in thousands)\nFood Service Sales to External Customers\nSoft pretzels\n$ 235,572\n$ 205,752\n14.5 %\nFrozen novelties\n145,425\n78,183\n86.0 %\nChurros\n108,927\n88,242\n23.4 %\nHandhelds\n82,292\n92,130\n(10.7 )%\nBakery\n378,149\n381,526\n(0.9 )%\nOther\n31,475\n26,854\n17.2 %\nTotal Food Service\n$ 981,840\n$ 872,687\n12.5 %\nFood Service Operating Income\n$ 49,778\n$ 18,512\n168.9 %\nSales to food service customers increased $109.2 million, or 13%, to $981.8 million in fiscal 2023, which included an increase of $62.2 million in sales from Dippin Dots. Soft pretzel sales to the food service market increased 14% to $235.6 million for the year, led by the continued increase in sales of our core pretzel products. Frozen novelties sales increased $67.2 million, or 86%, to $145.4 million for the year, with the increase largely driven by incremental Dippin Dots sales during fiscal 2023. Churro sales to food service customers were up 23% to $108.9 million for the year led by customer expansion and growing menu penetration. Sales of bakery products decreased $3.4 million, or 1%, to $378.1 million for the year, with the decrease attributable to the rationalization of certain lower margin Stock Keeping Units (SKU)s. Handheld sales to food service customers decreased 11% to $82.3 million in fiscal 2023, with the decrease largely attributable to pricing declines related to the contractual pricing true-up of costing on certain raw material ingredients, as well as some volume declines amongst certain customers in the product category. Sales of funnel cake increased $4.6 million, or 17%, to $31.5 million.\nSales of new products in the first twelve months since their introduction were approximately $0.3 million for the fiscal year. The benefit of the wrap of prior year price increases favorably impacted sales in the fiscal year, and more than offset some volume declines seen in certain product categories.\nOperating income in our Food Service segment increased from $18.5 million in fiscal 2022 to $49.8 million in fiscal 2023, largely driven by the benefit seen from the incremental Dippin Dots sales, as well as by improved gross margin performance and improving distribution expenses.\nRETAIL SUPERMARKETS SEGMENT RESULTS\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(53 weeks)\n(52 weeks)\n% Change\n(in thousands)\nRetail Supermarket Sales to External Customers\nSoft pretzels\n$ 60,272\n$ 61,925\n(2.7 )%\nFrozen novelties\n115,807\n108,911\n6.3 %\nBiscuits\n25,074\n24,695\n1.5 %\nHandhelds\n16,655\n5,640\n195.3 %\nCoupon redemption\n(2,561 )\n(3,713 )\n(31.0 )%\nOther\n(62.7 )%\nTotal Retail Supermarket\n$ 215,428\n$ 197,943\n8.8 %\nRetail Supermarket Operating Income\n$ 9,375\n$ 9,487\n(1.2 )%\nSales of products to retail supermarkets increased $17.5 million, or 9%, to $215.4 million in fiscal year 2023. Soft pretzel sales to retail supermarkets were $60.3 million, a decrease of $1.7 million, or 3%, from sales in fiscal 2022. Soft pretzel sales to retail supermarkets were impacted by a softer consumer environment as retailers and grocery chains reported lower traffic in stores and smaller baskets at certain points during fiscal 2023. Sales of frozen novelties increased $6.9 million, or 6%, to $115.8 million in fiscal 2023. Sales of biscuits and dumplings increased 2% to $25.1 million in fiscal 2023. Handheld sales to retail supermarket customers increased 195% to $16.7 million in fiscal 2023, with the increase largely driven by expansion with a major retailer.\nSales of new products in the first twelve months since their introduction in retail supermarkets were approximately $0.6 million in fiscal 2023. Operating income in our Retail Supermarkets segment remained relatively flat in fiscal 2023 as compared with fiscal 2022, with a decrease of $0.1 million, or 1%. The relatively comparative flat operating income was the result of gross margin challenges earlier in fiscal 2023 due to higher promotions and allowances, as well as inflationary pressures on raw material costs, offset by stronger comparative performance in the fiscal third and fourth quarters of 2023, largely driven by improved gross margin and lower distribution expenses.\nFROZEN BEVERAGES SEGMENT RESULTS\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(53 weeks)\n(52 weeks)\n% Change\n(in thousands)\nFrozen Beverages\nBeverages\n$ 224,655\n$ 184,063\n22.1 %\nRepair and maintenance service\n95,941\n89,840\n6.8 %\nMachines revenue\n37,933\n33,601\n12.9 %\nOther\n3,032\n2,522\n20.2 %\nTotal Frozen Beverages\n$ 361,561\n$ 310,026\n16.6 %\nFrozen Beverages Operating Income\n$ 50,365\n$ 33,800\n49.0 %\nTotal frozen beverage segment sales increased $51.5 million or 17% to $361.6 million in fiscal 2023. Beverage sales increased 22%, or $40.6 million, in fiscal 2023. Gallon sales increased 10% from the prior fiscal year. The increase in gallon sales reflects the strong momentum in theaters, along with continued growth in amusement parks, convenience, restaurants, and retail venues. Service revenue increased 7% to $95.9 million in fiscal 2023 and machines revenue, primarily sales of frozen beverage machines, increased from $33.6 million in fiscal 2022 to $37.9 million in fiscal 2023 due to growing installations with new customers.\nThe estimated number of Company-owned frozen beverage dispensers was 23,000 and 22,000 at September 30, 2023 and September 24, 2022, respectively. Operating income in our Frozen Beverage segment increased 49%, or $16.6 million, in fiscal 2023, with the increase primarily a result of higher beverage sales volume which drove leverage across the business.\nRESULTS OF OPERATIONS:\nFiscal Year 2022 (52 weeks) Compared to Fiscal Year 2021 (52 weeks)\nResults of Consolidated Operations\nThe following discussion provides a review of results for the fiscal year ended September 24, 2022 as compared with the fiscal year ended September 25, 2021.\nSummary of Results\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(52 weeks)\n(52 weeks)\n% Change\n(in thousands)\nNet Sales\n$ 1,380,656\n$ 1,144,579\n20.6 %\nCost of goods sold\n1,011,014\n845,651\n19.6 %\nGross Profit\n369,642\n298,928\n23.7 %\nOperating expenses\nMarketing\n91,636\n77,922\n17.6 %\nDistribution\n159,637\n108,297\n47.4 %\nAdministrative\n55,189\n40,538\n36.1 %\nIntangible asset impairment charges\n1,010\n1,273\nOther general expense (income)\n(320 )\n(215.9 )%\nTotal Operating Expenses\n307,843\n227,710\n35.2 %\nOperating Income\n61,799\n71,218\n(13.2 )%\nOther income (expense)\nInvestment income\n2,815\n(65.2 )%\nInterest expense\n(1,025 )\n(7 )\nn.m. %\nEarnings before income taxes\n61,754\n74,026\n(16.6 )%\nIncome tax expense\n14,519\n18,419\n(21.2 )%\nNET EARNINGS\n$ 47,235\n$ 55,607\n(15.1 )%\nComparisons as a Percentage of Net Sales\nFiscal year ended\nSeptember 24,\nSeptember 25,\nBasis Pt Chg\nGross profit\n26.8 %\n26.1 %\nMarketing\n6.6 %\n6.8 %\n(20 )\nDistribution\n11.6 %\n9.5 %\nAdministrative\n4.0 %\n3.5 %\nOperating income\n4.5 %\n6.2 %\n(170 )\nEarnings before income taxes\n4.5 %\n6.5 %\n(200 )\nNet earnings\n3.4 %\n4.9 %\n(150 )\nNET SALES\nNet sales increased $236.1 million, or 21%, to $1,380.7 million in fiscal 2022 from $1,144.6 million in fiscal 2021. The sales growth was largely driven by improved marketing, new customers, additional product placement, as well as a positive pricing environment. Additional benefits were seen from our recent acquisition, and to a lessor extent, from the comparative impact of the COVID-19 pandemic on fiscal 2022 sales compared with fiscal 2021 sales, with most of the latter comparative benefit reflected in our first quarter of fiscal 2022.\nGROSS PROFIT\nGross profit as a percentage of sales increased to 26.8% in fiscal 2022 from 26.1% in fiscal 2021. Inflation continued to build over the year which significantly pressured margins. The impact was especially pronounced in key raw material purchases like flour, eggs, dairy, chocolates and meats, as well as packaging and fuel. Pricing actions that were implemented during fiscal 2022 helped to offset some of these significant cost pressures. Comparatively, the increase in gross profit percentage was largely attributable to the benefit of increased sales, as well as favorable product mix.\nOPERATING EXPENSES\nTotal operating expenses increased $80.1 million to $307.8 million in fiscal 2022 and increased as a percentage of sales to 22.3% of sales from 19.9% in fiscal 2021. The increase reflects the significant impact of inflationary pressures across the majority of our cost line items including industry-wide freight and distribution cost increases, wage increases, and overall administrative expense increases.\nOperating expenses included intangible asset impairment charges of $1.0 million in fiscal 2022 and $1.3 million in fiscal 2021. Marketing and selling expenses decreased to 6.6% this year from 6.8% of sales in fiscal 2021 driven by effective investment of marketing dollars aligned with sales recovery. Distribution expenses as a percentage of sales increased to 11.6% from 9.5% in fiscal 2021 due to rising freight and fuel costs. Administrative expenses were 4.0% and 3.5% of sales in fiscal 2022 and fiscal 2021, respectively.\nOTHER INCOME AND EXPENSE\nOur investments generated before tax income of $1.0 million in fiscal 2022, down from $2.8 million in fiscal 2021 due to decreases in the amount of investments.\nInterest expense increased by $1.0 million in fiscal 2023 due to the Companys outstanding borrowings on the Amended Credit Agreement.\nINCOME TAX EXPENSE\nOur effective tax rate in fiscal 2022 was 23.5%. Our effective tax rate in fiscal 2021 year was 24.9%.\nNET EARNINGS\nNet earnings decreased $8.4 million, or 15%, in fiscal 2022 to $47.2 million, or $2.46 per diluted share, from $55.6 million or $2.91 per diluted share, in fiscal 2021 as a result of the aforementioned items.\nResults of Operations - Segments\nThe following table is a summary of sales and operating income, which is how we measure segment profit.\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(52 weeks)\n(52 weeks)\n% Change\n(in thousands)\nNet Sales\nFood Service\n$ 872,687\n$ 724,983\n20.4 %\nRetail Supermarket\n197,943\n184,897\n7.1 %\nFrozen Beverages\n310,026\n234,699\n32.1 %\nTotal Sales\n$ 1,380,656\n$ 1,144,579\n20.6 %\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(52 weeks)\n(52 weeks)\n% Change\n(in thousands)\nOperating Income\nFood Service\n$ 18,512\n$ 39,172\n(52.7 )%\nRetail Supermarket\n9,487\n25,914\n(63.4 )%\nFrozen Beverages\n33,800\n6,132\n451.2 %\nTotal Operating Income\n$ 61,799\n$ 71,218\n(13.2 )%\nFOOD SERVICE SEGMENT RESULTS\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(52 weeks)\n(52 weeks)\n% Change\n(in thousands)\nFood Service Sales to External Customers\nSoft pretzels\n$ 205,752\n$ 174,977\n17.6 %\nFrozen novelties\n78,183\n44,605\n75.3 %\nChurros\n88,242\n64,916\n35.9 %\nHandhelds\n92,130\n75,627\n21.8 %\nBakery\n381,526\n342,609\n11.4 %\nOther\n26,854\n22,249\n20.7 %\nTotal Food Service\n$ 872,687\n$ 724,983\n20.4 %\nFood Service Operating Income\n$ 18,512\n$ 39,172\n(52.7 )%\nSales to food service customers increased $147.7 million, or 20%, to $872.7 million in fiscal 2022. Soft pretzel sales to the food service market increased 18% to $205.8 million for the year. Frozen novelties sales increased $33.6 million, or 75%, to $78.2 million for the year, which included the benefit of the Companys recent acquisition. Churro sales to food service customers were up 36% to $88.2 million for the year. Sales of bakery products increased $38.9 million, or 11%, to $381.5 million for the year. Handheld sales to food service customers were up 22% to $92.1 million in fiscal 2022. Sales of funnel cake increased $4.6 million, or 21%, to $26.9 million.\nSales were up across most product lines as many of the venues and locations where our products are sold that were previously shut down or operating at reduced capacity in fiscal 2021 had mostly or fully re-opened in fiscal 2022. Theaters and outdoor venues, including stadiums and amusement parks, as well as schools, restaurants and strategic accounts continued to experience an increase in visitation that drove strong sales in our core products. Additionally, sales across all of our product lines were favorably impacted by the positive pricing environment, and frozen novelties sales were also favorably impacted by our recent acquisition.\nSales of new products in the first twelve months since their introduction were approximately $4.6 million for the year. Operating income in our Food Service segment decreased from $39.2 million in fiscal 2021 to $18.5 million in fiscal 2022. The decrease in operating income was primarily due to the significant increase in ingredients, production and distribution costs year over year, as well as our ERP implementation which previously impacted our results in the fiscal second quarter of 2022.\nRETAIL SUPERMARKETS SEGMENT RESULTS\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(52 weeks)\n(52 weeks)\n% Change\n(in thousands)\nRetail Supermarket Sales to External Customers\nSoft pretzels\n$ 61,925\n$ 54,990\n12.6 %\nFrozen novelties\n108,911\n100,059\n8.8 %\nBiscuits\n24,695\n24,197\n2.1 %\nHandhelds\n5,640\n7,574\n(25.5 )%\nCoupon redemption\n(3,713 )\n(3,689 )\n0.7 %\nOther\n1,766\n(72.5 )%\nTotal Retail Supermarket\n$ 197,943\n$ 184,897\n7.1 %\nRetail Supermarket Operating Income\n$ 9,487\n$ 25,914\n(63.4 )%\nSales of products to retail supermarkets increased $13.0 million, or 7%, to $197.9 million in fiscal year 2022. Soft pretzel sales to retail supermarkets were $61.9 million, an increase of $6.9 million, or 13%, from sales in fiscal 2021. Sales of frozen novelties increased $8.9 million, or 9%, to $108.9 million. Sales of biscuits and dumplings increased 2% to $24.7 million for the year. Handheld sales to retail supermarket customers decreased 26% to $5.6 million for the year.\nSales of new products in the first twelve months since their introduction were approximately $0.9 million in fiscal year 2022. Operating income in our Retail Supermarkets segment decreased from $25.9 million to $9.5 million for the year. The decreases in operating income were primarily attributable to higher cost of goods sold as well as higher shipping and distribution related costs.\nFROZEN BEVERAGES SEGMENT RESULTS\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(52 weeks)\n(52 weeks)\n% Change\n(in thousands)\nFrozen Beverages\nBeverages\n$ 184,063\n$ 124,498\n47.8 %\nRepair and maintenance service\n89,840\n81,305\n10.5 %\nMachines revenue\n33,601\n26,953\n24.7 %\nOther\n2,522\n1,943\n29.8 %\nTotal Frozen Beverages\n$ 310,026\n$ 234,699\n32.1 %\nFrozen Beverages Operating Income\n$ 33,800\n$ 6,132\n451.2 %\nTotal frozen beverage segment sales increased 32% to $310.0 million in fiscal 2022 and beverage sales increased 48%, or $59.6 million, for the year. Gallon sales increased 39% from last year. The increase in gallon sales reflects the strong demand across theaters, amusement parks, convenience and restaurants. In the amusement parks channel, we continued to see strong growth as both domestic and international visitation numbers continued to recover, and exceeded, pre-COVID-19 levels. Theater sales continued on an upward trajectory as movie goers indulged in their favorite snacks and view highly anticipated movie releases. Service revenue increased 10% to $89.8 million in fiscal 2022 led by an acceleration in maintenance calls and additional growth in one of our larger customers, earlier in fiscal 2022. Machines revenue, primarily sales of machines, increased from $27.0 million in fiscal 2021 to $33.6 million in fiscal 2022 driven mainly by growth from large quick service restaurant (QSR) and convenience customers.\nThe estimated number of Company-owned frozen beverage dispensers was 22,000 and 19,000 at September 24, 2022 and September 25, 2021, respectively. Our Frozen Beverage segment had operating income of $33.8 million in fiscal 2022 compared to $6.1 million in fiscal 2021 primarily a result of higher beverage sales volume which drove leverage across the business.\nACQUISITIONS\nOn June 21, 2022, J & J Snack Foods Corp. and its wholly-owned subsidiary, DD Acquisition Holdings, LLC, completed the acquisition of one hundred percent (100%) of the equity interests of Dippin Dots Holding, L.L.C. (Dippin Dots) which, through its wholly-owned subsidiaries, owns and operates the Dippin Dots and Doc Popcorn businesses. The purchase price was approximately $223.6 million, consisting entirely of cash.\nDippin Dots is a leading producer of flash-frozen beaded ice cream treats, and the acquisition will leverage synergies in entertainment and amusement locations, theaters, and convenience to continue to expand our business. The acquisition also includes the Doc Popcorn business operated by Dippin Dots.\nThe acquisition was accounted for under the purchase method of accounting, and its operations are included in the accompanying consolidated financial statements from their respective acquisition dates.\nLIQUIDITY AND CAPITAL RESOURCES\nAlthough there are many factors that could impact our operating cash flow, most notably net earnings, we believe that our future operating cash flow, along with our borrowing capacity, our current cash and cash equivalent balances and our investment securities is sufficient to satisfy our cash requirements over the next twelve months and beyond, as well as fund future growth and expansion.\nFiscal 2023 Compared to Fiscal 2022\nSeptember 30,\nSeptember 24,\n(in thousands)\nCash flows from operating activities\nNet earnings\n$ 78,906\n$ 47,235\nNon-cash items in net income:\nDepreciation of fixed assets\n56,616\n49,669\nAmortization of intangibles and deferred costs\n6,525\n3,454\nIntangible asset impairment charges\n1,678\n1,010\n(Gains) Losses from disposals of property & equipment\n(409 )\nShare-based compensation\n5,318\n4,269\nDeferred income taxes\n10,935\n8,829\n(Gain) Loss on marketable securities\n(8 )\nOther\n(95 )\nChanges in assets and liabilities, net of effects from purchase of companies\n12,395\n(88,844 )\nNet cash by operating activities\n$ 172,279\n$ 26,062\n●\nThe increase in depreciation of fixed assets was largely due to prior year purchases of property, plant and equipment, as well as depreciation expense related to assets acquired in the fiscal 2022 Dippin Dots acquisition.\n●\nThe increase in amortization of intangibles and deferred costs was related to intangible assets acquired in the fiscal 2022 Dippin Dots acquisition.\n●\nThe increase in deferred income taxes was primarily related to increased deferred tax liabilities which arose in connection with overall depreciation related temporary differences in fiscal year 2023.\n●\nCash flows associated with changes in assets and liabilities, net effects from purchase of companies, generated approximately $12.4 million of cash in fiscal 2023 compared with a usage of $88.8 million of cash in fiscal 2022. The generation of cash in fiscal 2023 was largely the result of an improved collections environment, as well as a strategic push to lower our investment in inventory related working capital balances. In fiscal 2022, the usage of cash was primarily due to the increase in accounts receivable, inventory, and prepaid balances. The fiscal 2022 accounts receivable balance increased primarily due to the overall increase in sales in our fourth quarter of fiscal 2022 compared with fiscal 2021. The fiscal 2022 inventory balance increased primarily due to inflationary pressures seen during fiscal 2022, as well as strategic decisions to store more finished goods. The fiscal 2022 prepaid balance increased primarily due to an increase in prepaid income taxes.\nSeptember 30,\nSeptember 24,\n(in thousands)\nCash flows from investing activities\nPayments for purchases of companies, net of cash acquired\n-\n(221,301 )\nPurchases of property, plant and equipment\n(104,737 )\n(87,291 )\nProceeds from redemption and sales of marketable securities\n9,716\n12,026\nProceeds from disposal of property and equipment\n1,781\nNet cash (used in) by investing activities\n$ (93,240 )\n$ (296,167 )\n●\nIn fiscal 2022, the payments for purchases of companies, net of cash acquired, related to the Dippin Dots acquisition.\n●\nPurchases of property, plant and equipment include spending for production growth, in addition to acquiring new equipment, infrastructure replacements, and upgrades to maintain competitive standing and position us for future opportunities. The increase in fiscal 2023 was primarily due to increased spend for new lines at various plants aimed at increasing capacity.\n●\nProceeds from redemption and sales of marketable securities decreased in fiscal 2023 as in prior years, we strategically chose to no longer re-invest redeemed proceeds into marketable securities given the low interest rate environment.\nSeptember 30,\nSeptember 24,\n(in thousands)\nCash flows from financing activities\nProceeds from issuance of stock\n15,212\n16,160\nBorrowings under credit facility\n114,000\n125,000\nRepayment of borrowings under credit facility\n(142,000 )\n(70,000 )\nPayments for debt issuance costs\n-\n(225 )\nPayments on finance lease obligations\n(180 )\n(279 )\nPayment of cash dividends\n(53,877 )\n(48,437 )\nNet cash (used in) provided by financing activities\n$ (66,845 )\n$ 22,219\n●\nBorrowings under credit facility and repayment of borrowings under credit facility relate to the Companys cash draws and repayments made to primarily fund working capital needs, as well as the initial draw made in fiscal 2022 to fund the Dippin Dots acquisition.\n●\nDividends paid during fiscal 2023 increased as our quarterly dividend was raised during fiscal 2023.\nLiquidity\nAs of September 30, 2023, we had $49.6 million of cash and cash equivalents.\nIn December 2021, the Company entered into an amended and restated loan agreement (the Credit Agreement) with our existing banks which provided for up to a $50 million revolving credit facility repayable in December 2026.\nOn June 21, 2022, the Company entered into an amendment to the Credit Agreement, the Amended Credit Agreement which provided for an incremental increase of $175 million in available borrowings. The Amended Credit Agreement also includes an option to increase the size of the revolving credit facility by up to an amount not to exceed in the aggregate the greater of $225 million or, $50 million plus the Consolidated EBITDA of the Borrowers, subject to the satisfaction of certain terms and conditions.\nInterest accrues, at the Companys election at (i) the BSBY Rate (as defined in the Credit Agreement), plus an applicable margin, based upon the Consolidated Net Leverage Ratio, as defined in the Credit Agreement, or (ii) the Alternate Base Rate (a rate based on the higher of (a) the prime rate announced from time-to-time by the Administrative Agent, (b) the Federal Reserve Systems federal funds rate, plus 0.50% or (c) the Daily BSBY Rate, plus an applicable margin). The Alternate Base Rate is defined in the Credit Agreement.\nThe Credit Agreement requires the Company to comply with various affirmative and negative covenants, including without limitation (i) covenants to maintain a minimum specified interest coverage ratio and maximum specified net leverage ratio, and (ii) subject to certain exceptions, covenants that prevent or restrict the Companys ability to pay dividends, engage in certain mergers or acquisitions, make certain investments or loans, incur future indebtedness, alter its capital structure or line of business, prepay subordinated indebtedness, engage in certain transactions with affiliates, or amend its organizational documents. As of September 30, 2023, the Company is in compliance with all financial covenants of the Credit Agreement.\nAs of September 30, 2023, we had $27.0 million of outstanding borrowings drawn on the Amended Credit Agreement. As of September 24, 2022, we had $188.2 million of additional borrowing capacity, after giving effect to the $9.8 million of letters of credit outstanding.\nThe Companys material cash requirements include the following contractual and other obligations:\nPurchase Commitments\nOur most significant raw material requirements include flour, packaging, shortening, corn syrup, sugar, juice, cheese, chocolate, and a variety of nuts. We attempt to minimize the effect of future price fluctuations related to the purchase of raw materials primarily through forward purchasing to cover future manufacturing requirements, generally for periods from 1 to 12 months. As of September 30, 2023, we have approximately $125 million of such commitments. The purchase commitments do not exceed our projected requirements over the related terms and are in the normal course of business.\nLeases\nWe have operating leases with initial noncancelable lease terms in excess of one year covering the rental of various facilities and equipment. Our operating leases include leases for real estate from some of our office, distribution and manufacturing facilities as well as manufacturing and non-manufacturing equipment used in our business. As of September 30, 2023, we have operating lease payment obligations of $94.1 million, with $16.5 million payable within 12 months.\nOff -Balance Sheet Arrangements\nThe Company has off-balance sheet arrangements for purchase commitments as of September 30, 2023.\nCritical Accounting Policies, Judgments and Estimates\nWe prepare our financial statements in conformity with accounting principles generally accepted in the United States of America. The preparation of such financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of those financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nThe Company discloses its significant accounting policies in the accompanying notes to its audited consolidated financial statements.\nJudgments and estimates of uncertainties are required in applying the Companys accounting policies in certain areas. Following are some of the areas requiring significant judgments and estimates: revenue recognition, allowance for estimated credit losses, valuation of goodwill and long-lived and intangible assets, insurance reserves, and income taxes and business combinations.\nRevenue Recognition\nThe singular performance obligation of our customer contracts for product and machine sales is determined by each individual purchase order and the respective products ordered, with revenue being recognized at a point-in-time when the obligation under the terms of the agreement is satisfied and product control is transferred to our customer. Specifically, control transfers to our customers when the product is delivered to, installed, or picked up by our customers based upon applicable shipping terms, as our customers can direct the use and obtain substantially all of the remaining benefits from the product at this point in time. The performance obligations in our customer contracts for product are generally satisfied within 30 days.\nThe singular performance obligation of our customer contracts for time and material repair and maintenance equipment service is the performance of the repair and maintenance with revenue being recognized at a point-in-time when the repair and maintenance is completed.\nThe singular performance obligation of our customer repair and maintenance equipment service contracts is the performance of the repair and maintenance with revenue being recognized over the time the service is expected to be performed. Our customers are billed for service contracts in advance of performance and therefore we have contract liability on our balance sheet.\nRevenue is measured by the transaction price, which is defined as the amount of consideration we expect to receive in exchange for satisfying the performance obligations noted above. The transaction price is adjusted for estimates of known or expected variable consideration which includes sales discounts, trade promotions and certain other sales and customer incentives, including rebates and coupon redemptions. Variable consideration related to these programs is recorded as a reduction to revenue when the related revenue is recognized, and is recorded using the most likely amount method, with updates to estimates and related accruals of variable consideration occurring each period based on historical experience, changes in circumstances and other factors, including review of contractual pricing and rebate arrangements with customers.\nWe do not believe that there is a reasonable likelihood that there will be material change in the estimates or assumptions used to recognize revenue. As noted above, estimates are made based on historical experience and other factors. However, if the level of redemption rates or performance was to vary significantly from estimates, we may be exposed to gains or losses that could be material. We have not made any material changes in the accounting methodology used to recognize revenue during the past three fiscal years.\nAllowance for Estimated Credit Losses\nWe provide an allowance for estimated credit losses after taking into consideration historical experience and other factors. On September 27, 2020, the Company adopted guidance issued by the FASB in ASU 2016-13 Measurement of Credit Losses on Financial Instruments, which requires companies to recognize an allowance that reflects a current estimate of credit losses expected to be incurred over the life of the asset. The Company continuously monitors collections and payments from its customers and maintains a provision for estimated credit losses. The allowance for estimated credit losses considers a number of factors including the age of receivable balances, the history of losses, expectations of future credit losses and the customers ability to pay off obligations.\nWe do not believe that there is a reasonable likelihood that there will be a material change in the estimates or assumptions used to value our accounts receivable. Since adoption of the new guidance on September 27, 2020, we have not made any material changes in the accounting methodology used to value accounts receivable.\nValuation of Goodwill\nWe have three reporting units with goodwill. Goodwill is evaluated annually by the Company for impairment. We perform impairment tests at year end for our reporting units, which are also the operating segment levels with recorded goodwill utilizing primarily the discounted cash flow method. This methodology used to estimate the fair value of the total Company and its reporting units requires inputs and assumptions (i.e. revenue growth, operating profit margins, capital spending requirements and discount rates) that reflect current market conditions. The estimated fair value of each reporting unit is compared to the carrying value of the reporting unit. If the carrying value of the reporting unit exceeds its fair value, the goodwill of the reporting unit is potentially impaired, and the Company then determines the implied fair value of goodwill, which is compared to the carrying value of goodwill to determine if impairment exists. Our tests at September 30, 2023 show that the fair value of each of our reporting units with goodwill exceeded its carrying value by at least 50%. Therefore, no further analysis was required.\nThe inputs and assumptions used involve considerable management judgment and are based upon assumptions about expected future operating performance. Assumptions used in these forecasts are consistent with internal planning. The actual performance of the reporting units could differ from managements estimates due to changes in business conditions, operating performance, economic conditions, competition, and consumer preferences. We have not made any material changes in the accounting methodology used to value goodwill during the past three fiscal years.\nValuation of Long-Lived Assets and Other Intangible Assets\nWe record an impairment charge to property, plant and equipment and amortizing intangible assets in accordance with the applicable accounting standards, when, based on certain indicators of impairment, we believe such assets have experienced a decline in value that is other than temporary. Future adverse changes in market conditions or poor operating results of these underlying assets could result in losses or an inability to recover the carrying value of the asset that may not be reflected in the assets current carrying value, thereby possibly requiring impairment charges in the future.\nIndefinite lived intangibles are reviewed annually for impairment. The fair value of our indefinite lived intangible assets is calculated using either a relief from royalty valuation approach, or the excess earnings method. We are required to make estimates and assumptions about sales growth, royalty rates, and discount rates based on budgets, business plans, economic projections, and marketplace data. Our impairment analysis contains uncertainties due to uncontrollable events that could positively or negatively impact the future economic and operating conditions.\nWe have not made any material changes in the accounting methodology used to evaluate impairment of long-lived assets and other intangibles during the last three fiscal years. While we believe we have made reasonable estimates and assumptions to calculate fair value of these assets, it is possible a material change could occur. If our actual results are not consistent with our estimates and assumptions used to calculate fair value, it could result in a material impairment of our long-lived assets and other intangibles.\nInsurance Reserves\nWe have a self-insured medical plan which covers approximately 1,800 of our employees. We record a liability for incurred but not yet reported or paid claims based on our historical experience of claims payments and a calculated lag time period. Considering that we have stop loss coverage of $225,000 for each individual plan subscriber, the general consistency of claims payments and the short time lag, we believe that there is not a material exposure for this liability.\nWe self-insure, up to loss limits, workers compensation, automobile and general liability claims. Insurance reserves are calculated on a combination of an undiscounted basis based on actual claims data and estimates of incurred but not reported claims developed utilizing historical claims trends. Projected settlements of incurred but not reported claims are estimated based on pending claims, historical trends, industry trends related to expected losses and actual reported losses, and key assumptions, including loss development factors and expected loss rates.\nWe have not made any material changes in the accounting methodology used to establish our self-insurance liability during the past three fiscal years. We do not believe that there is a reasonable likelihood that there will be a material change in the estimate or assumptions used to calculate our self-insurance liability. However, if actual results are not consistent with our estimates or assumptions, we may be exposed to gains or losses that could be material.\nIncome Taxes\nThe annual tax rate is based on our income and statutory tax rates. Changes in statutory rates and tax laws in jurisdictions in which we operate may have a material effect on our annual tax rate. The effect of these changes, if any, would be recognized as a discrete item upon enactment.\nDeferred income taxes arise from temporary differences between the tax and financial statement recognition of revenues and expenses. Deferred tax assets and liabilities are measured based on the enacted tax rates that will apply in the years in which the temporary differences are expected to be recovered or paid.\nWe have not made any material changes in the accounting methodology used to account for income taxes during the past three fiscal years. Changes in tax laws and rates could affect recorded deferred tax assets and liabilities in the future. Other than those potential impacts, we do not believe there is a reasonable likelihood that there will be a material change in tax related balances.\nBusiness Combinations\nWe use assumptions and estimates in determining the fair value of assets acquired and liabilities assumed in a business combination. We use various models to value assets acquired and liabilities assumed, such as the net realizable value method to value inventory, and the cost method and market approach to value property, plant and equipment. The determination of the fair value of intangible assets, which can represent a significant portion of the purchase price of our acquisitions, requires the use of significant judgement with regard to the fair value, and whether such intangibles are amortizable or non-amortizable and, if the former, the period and method by which the intangible will be amortized. We estimate the fair value of acquisition-related intangibles either through the relief of royalty method or multi-period excess earnings method, or based on projections of cash flows that will arise from identifiable intangible assets of acquired businesses, which includes estimate of customer attrition. The projected cash flows are discounted to determine the present value of the assets at the date of acquisition. For significant acquisitions, we may use independent third-party valuation specialists to assist us in determining the fair value of assets acquired and liabilities assumed.\nWe have not made any material changes in the accounting methodology used to account for business combinations during the past three fiscal years. We do not believe that there is a reasonable likelihood that there will be a material change in the estimate or assumptions used to determine the fair value of assets acquired or liabilities assumed in a business combination. However, if actual results are not consistent with our estimates or assumptions, we may be exposed to impairment charges that could be material. Item 7A.\nQuantitative And Qualitative Disclosures About Market Risk\nThe following is the Companys quantitative and qualitative analysis of its financial market risk:\nInterest Rate Sensitivity\nThe Company has in the past entered into interest rate swaps to limit its exposure to interest rate risk and may do so in the future if the Board of Directors feels that such non-trading hedging is in the best interest of the Company and its shareholders. As of September 30, 2023, the Company had no interest rate swap contracts.\nInterest Rate Risk\nAt September 30, 2023, the Company had variable rate debt of $27.0 million with a weighted average interest rate of 6.48%. If borrowing rates were to increase 1% above the current rates, it would increase interest expense by $0.3 million on an annual basis.\nPurchasing Risk\nThe Companys most significant raw material requirements include flour, shortening, corn syrup, sugar, juice, cheese, chocolate, and a variety of nuts. The Company attempts to minimize the effect of future price fluctuations related to the purchase of raw materials primarily through forward purchasing to cover future manufacturing requirements, generally for periods from 1 to 12 months. Future contracts are not used in combination with forward purchasing of these raw materials. The Companys procurement practices are intended to reduce the risk of future price increases, but also may potentially limit the ability to benefit from possible price decreases.\nForeign Exchange Rate Risk\nThe Company has not entered into any forward exchange contracts to hedge its foreign currency rate risk as of September 30, 2023, because it does not believe its foreign exchange exposure is significant. Item 8.\nFinancial Statements And Supplementary Data\nThe financial statements of the Company are filed under this Item 8, beginning on page of this report. Item 9.\nChanges In And Disagreements With Accountants On Accounting And Financial Disclosure\nNone. Item 9A.\nControls And Procedures\nDisclosure Controls and Procedures\nWe carried out an evaluation under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) promulgated under the Exchange Act for financial reporting, as of September 30, 2023. Based on that evaluation, our chief executive officer and chief financial officer concluded that these controls and procedures are effective at a reasonable assurance level.\nOur disclosure controls and procedures are designed to provide reasonable assurance that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the rules and forms of the SEC. These disclosure controls and procedures include, among other things, controls and procedures designed to provide reasonable assurance that information required to be disclosed by us in the reports that we file under the Exchange Act is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act as a process designed by, or under the supervision of, the chief executive officer and chief financial officer and effected by the board of directors and management to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n●\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n●\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of our management and board of directors;\n●\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risks that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in the 2013 Internal Control-Integrated Framework.\nBased on our assessment, our management believes that, as of September 30, 2023, our internal control over financial reporting is effective. There have been no changes that occurred during our fourth quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nOur independent registered public accounting firm, Grant Thornton LLP, audited our internal control over financial reporting as of September 30, 2023. Their report, dated November 28, 2023, expressed an unqualified opinion on our internal control over financial reporting. That report appears in Item 15 of Part IV of this Annual Report on Form 10-K and is incorporated by reference to this Item 9A. Item 9B.\nOther Information\nNone of our directors or executive officers adopted, modified or terminated any contract, instruction or written plan for the purchase or sale of our securities that was intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) or any non-Rule 10b5-1 trading arrangement as defined in Item 408(c) of Regulation S-K\nThere was no information required on Form 8-K during the quarter that was not reported.\nItem 9C.\nDisclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10.\nDirectors, Executive Officers and Corporate Governance\nThe information required relating to directors, director nominees and executive officers of the registrant is incorporated by reference from the information under the captions Election of Directors, Biographical Information about the Nominees and Directors, Board Committees and Executive Officers contained in our Proxy Statement for our Annual Meeting of Shareholders to be held on February 13, 2024 (the Proxy Statement).\nThe information relating to the identification of the audit committee, audit committee financial expert and director nomination procedures of the registrant is incorporated by reference from the information under the captions The Audit Committee and The Nominating Committee contained in the Proxy Statement.\nThe information concerning Section 16(a) Compliance appearing under the caption Delinquent Section 16(a) Reports in the Proxy Statement is incorporated herein by reference.\nThe Company has adopted a Code of Ethics pursuant to Section 406 of the Sarbanes-Oxley Act of 2002, which applies to the Companys principal executive officer and senior financial officers. The Company has also adopted a Code of Business Conduct and Ethics which applies to all employees. The Company will furnish any person, without charge, a copy of the Code of Ethics upon written request to J & J Snack Foods Corp., 350 Fellowship Rd., Mt. Laurel, New Jersey 08054, Attn: Secretary. A copy of the Code of Ethics can also be found on our website at www.jjsnack.com. Any waiver of any provision of the Code of Ethics granted to the principal executive officer or senior financial officer may only be granted by a majority of the Companys disinterested directors. If a waiver is granted, information concerning the waiver will be posted on our website www.jjsnack.com for a period of 12 months. Item 11.\nExecutive Compensation\nInformation concerning executive compensation appearing in the Proxy Statement under the caption Executive Compensation is incorporated herein by reference. Item 12.\nSecurity Ownership Of Certain Beneficial Owners And Management And Related Stockholder Matters\nInformation concerning the security ownership of certain beneficial owners and management and the information concerning equity compensation plans appearing in the Proxy Statement under the captions Security Ownership of Certain Beneficial Owners and Management and Equity Compensation Plan Information is incorporated herein by reference. Item 13.\nCertain Relationships And Related Transactions, and Director Independence\nThe information set forth in the Proxy Statement under the captions Certain Relationships and Director Independence is incorporated herein by reference. Item 14.\nPrincipal Accountant Fees And Services\nThe information set forth in the Proxy Statement under the captions Ratification of Independent Registered Public Accounting Firm and Fees of Independent Registered Public Accounting Firm is incorporated herein by reference.\nPART IV Item 15.\nExhibits, Financial Statement Schedules\na)\nThe following documents are filed as part of this Report:\n(1)\nFinancial Statements\nThe financial statements filed as part of this report are listed on the Index to Consolidated Financial Statements and Financial Statements Schedule on page.\n(2)\nFinancial Statement Schedule - Page S-1\nSchedule II - Valuation and Qualifying Accounts\nAll other schedules are omitted either because they are not applicable or because the information required is contained in the financial statements or notes thereto.\nb)\nExhibits\n2.1\nSecurities Purchase Agreement, by and among the Company, DD Acquisition Holdings, LLC, Dippin Dots Holding, L.L.C., Fischer Industries, L.L.C, Stephen Scott Fischer Revocable Trust, Stephen Scott Fischer Exempt Trust, Mark A. Fischer 1994 Trust, Susan L. Fischer 1994 Trust, Christy Fischer Speakes Exempt Trust, Mark A. Fischer, as the Seller Representative, and Cryogenics Processors, LLC (Incorporated by reference from the Companys Form 8-K filed May 20, 2022).\n3.1\nAmended and Restated Certificate of Incorporation of J & J Snack Foods Corp (Incorporated by reference from the Companys Form 10-K filed November 22, 2022).\n3.2\nCertificate of Amendment to the Amended and Restated Certificate of Incorporation (Incorporated by reference from the Companys Form 8-K filed June 24, 2022).\n3.3\nRevised Bylaws adopted November 15, 2023 (Incorporated by reference from the Companys Form 8-K filed November 21, 2023).\n4.6\nSecond Amended and Restated Credit Agreement (Incorporated by reference from the Companys Form 10-Q dated February 2, 2022).\n4.7\nAmendment No. 1 to the Second Amended and Restated Credit Agreement (Incorporated by reference to the Companys Form 8-K filed on June 24, 2022).\n4.8\nDescription of Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (Incorporated by reference from the Companys Form 10-K filed November 22, 2022).\n10.1*\nJ & J Snack Foods Corp. Amended and Restated Long-Term Incentive Plan (Incorporated by referenced from the Companys Form 8-K filed on February 12, 2021).\n10.3*\nInducement Restricted Stock Award Agreement (Incorporated by reference from the Companys Form 8-K filed on October 26, 2020).\n10.4*\nForm of Performance Share Unit Agreement (Incorporated by reference from the Companys Form 8-K filed on January 26, 2022).\n10.5*\nForm of Service Share Unit Agreement (Incorporated by reference from the Companys Form 8-K filed on January 26, 2022).\n10.6*\nJ & J Snack Foods Corp. 2022 Long-Term Incentive Plan (Incorporated by reference from the Companys Form 8-K filed on February 14, 2023).\n10.7*\nExecutive Employment Agreement dated February 14, 2023 between J & J Snack Foods Corp. and Daniel Fachner (Incorporated by reference from the Companys Form 8-K filed on February 17, 2023).\n10.8* **\nForm of Performance-Based Restricted Stock Unit Award Agreement\n10.9* **\nForm of Restricted Stock Unit Award Agreement\n21.1**\nSubsidiaries of J & J Snack Foods Corp.\n23.1**\nConsent of Independent Registered Public Accounting Firm.\n31.1**\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2**\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1**\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant To Section 906 Of The Sarbanes-Oxley Act of 2002.\n32.2**\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant To Section 906 Of The Sarbanes-Oxley Act of 2002.\n101**\nThe following financial information from J&J Snack Foods Corp.'s Form 10-K for the year ended September 30, 2023, formatted in iXBRL (Inline extensible Business Reporting Language):\n(i)\nConsolidated Balance Sheets,\n(ii)\nConsolidated Statements of Earnings,\n(iii)\nConsolidated Statements of Comprehensive Income,\n(iv)\nConsolidated Statements of Cash Flows,\n(v)\nConsolidated Statement of Changes in Stockholders' Equity and\n(vi)\nThe Notes to the Consolidated Financial Statements\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n*Compensatory Plan\n**Filed Herewith\nItem 16. Form 10-K Summary\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13(a) or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJ & J SNACK FOODS CORP.\nNovember 28, 2023 By: /s/ Dan Fachner\nDan Fachner,\nChief Executive Officer,\nPresident and Director\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nNovember 28, 2023\n/s/ Dan Fachner\nDan Fachner,\nChief Executive Officer\nand President and Director\n(Principal Executive Officer)\nNovember 28, 2023\n/s/ Ken A. Plunk\nKen A. Plunk, Senior Vice\nPresident and Chief Financial\nOfficer\n(Principal Financial Officer)\n(Principal Accounting Officer)\nNovember 28, 2023\n/s/ Gerald B. Shreiber\nGerald B. Shreiber, Director\nNovember 28, 2023\n/s/ Sidney R. Brown\nSidney R. Brown, Director\nNovember 28, 2023\n/s/ Peter G. Stanley\nPeter G. Stanley, Director\nNovember 28, 2023\n/s/ Vincent A. Melchiorre\nVincent A. Melchiorre, Director\nNovember 28, 2023\n/s/ Marjorie S. Roshkoff\nMarjorie S. Roshkoff, Director\nNovember 28, 2023\n/s/ Roy C. Jackson\nRoy C. Jackson, Director\nNovember 28, 2023\n/s/ Mary M. Meder\nMary M. Meder, Director\nJ & J SNACK FOODS CORP.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nAND FINANCIAL STATEMENT SCHEDULE\nFinancial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID 248)\nOpinion of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting\nConsolidated Balance Sheets as of September 30, 2023 and September 24, 2022\nConsolidated Statements of Earnings for the fiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021\nConsolidated Statements of Comprehensive Income for the fiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021\nConsolidated Statement of Changes in Stockholders Equity for the fiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021\nConsolidated Statements of Cash Flows for the fiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021\nNotes to Consolidated Financial Statements\nFinancial Statement Schedule:\nSchedule II - Valuation and Qualifying Accounts S-1\nF - 1\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nJ&J Snack Foods Corp. and Subsidiaries\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of J&J Snack Foods Corp. (a New Jersey corporation) and subsidiaries (the Company) as of September 30, 2023 and September 24, 2022, the related consolidated statements of earnings, comprehensive income, changes in stockholders equity, and cash flows for each of the three years in the period ended September 30, 2023, and the related notes and financial statement schedule included under Item 15(a) (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and September 24, 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of December 31, 20X2, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated November 28, 2023 expressed an unqualified opinion.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nNet Revenue Adjustments\nAs described in Note A to the consolidated financial statements, contracts with customers include some form of variable consideration, including sales discounts, trade promotions and certain other sales and consumer incentives, including rebates. Variable consideration is treated as a reduction in revenue when the related revenue is recognized, and is recorded using the most likely amount method, with updates to estimates and related accruals of variable consideration occurring each period based on historical experience and changes in circumstances.\nWe identified the estimation of certain subsidiaries reserves for these net revenue adjustments by management as a critical audit matter because the inputs and assumptions utilized by management in estimating these reserves, including consistency of historical data and estimates of future customer credits, require significant judgment and create a high degree of estimation uncertainty. Consequently, auditing these assumptions require subjective auditor judgment.\nF - 2\nOur audit procedures related to the estimation of the reserves included the following, among others:\n●\nWe obtained an understanding, evaluated the design, and tested the operating effectiveness of key controls relating to managements calculation of the reserves for net revenue adjustments, including understanding relevant inputs and assumptions of key management review controls over the period-end accrual of allowances and end-user pricing adjustments.\n●\nWe re-performed managements process for calculating the reserves for net revenue adjustments.\n●\nWe evaluated key inputs relevant to the net revenue adjustments, including contractual pricing and rebate arrangements with customers and historical allowance data, which were compared to source documents. We evaluated key assumptions relevant to net revenue adjustments, including the consistency of historical data and estimates of future customer credits.\n●\nWe evaluated transactions subsequent to year end, which involved inspecting customer credits and relevant source documents submitted by customers in conjunction with the allowance, including end-user pricing adjustments.\n/s/GRANT THORNTON LLP\nWe have served as the Companys auditor since 1984.\nPhiladelphia, Pennsylvania\nNovember 28, 2023\nF - 3\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nJ&J Snack Foods Corp. and Subsidiaries\nOpinion on internal control over financial reporting\nWe have audited the internal control over financial reporting of J&J Snack Foods Corp. (a New Jersey corporation) and subsidiaries (the Company) as of September 30, 2023, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements of the Company as of and for the year ended September 30, 2023, and our report dated November 28, 2023 expressed an unqualified opinion on those financial statements.\nBasis for opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and limitations of internal control over financial reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ GRANT THORNTON LLP\nPhiladelphia, Pennsylvania\nNovember 28, 2023\nF - 4\nItem 8.\nFinancial Statements And Supplementary Data\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share amounts)\nSeptember 30,\nSeptember 24,\nAssets\nCurrent assets\nCash and cash equivalents\n$ 49,581\n$ 35,181\nMarketable securities held to maturity\n-\n4,011\nAccounts receivable, net\n198,129\n208,178\nInventories\n171,539\n180,473\nPrepaid expenses and other\n10,963\n16,794\nTotal current assets\n430,212\n444,637\nProperty, plant and equipment, at cost\n960,198\n860,050\nLess accumulated depreciation and amortization\n574,295\n524,683\nProperty, plant and equipment, net\n385,903\n335,367\nOther assets\nGoodwill\n185,070\n184,420\nOther intangible assets, net\n183,529\n191,732\nMarketable securities available for sale\n-\n5,708\nOperating lease right-of-use assets\n88,868\n51,137\nOther\n3,654\n3,965\nTotal other assets\n461,121\n436,962\nTotal Assets\n$ 1,277,236\n$ 1,216,966\nLiabilities and Stockholders' Equity\nCurrent Liabilities\nCurrent finance lease liabilities\n$\n$\nAccounts payable\n90,758\n108,146\nAccrued insurance liability\n15,743\n15,678\nAccrued liabilities\n14,214\n9,214\nCurrent operating lease liabilities\n16,478\n13,524\nAccrued compensation expense\n23,341\n21,700\nDividends payable\n14,209\n13,453\nTotal current liabilities\n174,944\n181,839\nLong-term debt\n27,000\n55,000\nNoncurrent finance lease liabilities\nNoncurrent operating lease liabilities\n77,631\n42,660\nDeferred income taxes\n81,310\n70,407\nOther long-term liabilities\n4,233\n3,637\nCommitments and Contingencies (Note I)\nStockholders' Equity\nPreferred stock, $1 par value; authorized 10,000,000 shares; none issued\n-\n-\nCommon stock, no par value; authorized, 50,000,000 shares; issued and outstanding 19,332,000 and 19,219,000 respectively\n114,556\n94,026\nAccumulated other comprehensive loss\n(10,166 )\n(13,713 )\nRetained Earnings\n807,128\n782,856\nTotal stockholders' equity\n911,518\n863,169\nTotal Liabilities and Stockholders' Equity\n$ 1,277,236\n$ 1,216,966\nThe accompanying notes are an integral part of these statements.\nF - 5\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS\n(in thousands, except per share information)\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(53 weeks)\n(52 weeks)\n(52 weeks)\nNet Sales\n$ 1,558,829\n$ 1,380,656\n$ 1,144,579\nCost of goods sold\n1,088,964\n1,011,014\n845,651\nGross Profit\n469,865\n369,642\n298,928\nOperating expenses\nMarketing and selling\n110,258\n91,636\n77,922\nDistribution\n172,804\n159,637\n108,297\nAdministrative\n75,425\n55,189\n40,538\nIntangible asset impairment charges\n1,678\n1,010\n1,273\nOther expense (income)\n(320 )\nTotal operating expenses\n360,347\n307,843\n227,710\nOperating Income\n109,518\n61,799\n71,218\nOther income (expenses)\nInvestment income\n2,743\n2,815\nInterest expense\n(4,747 )\n(1,025 )\n(7 )\nEarnings before income taxes\n107,514\n61,754\n74,026\nIncome taxes\n28,608\n14,519\n18,419\nNET EARNINGS\n$ 78,906\n$ 47,235\n$ 55,607\nEarnings per diluted share\n$ 4.08\n$ 2.46\n$ 2.91\nWeighted average number of diluted shares\n19,324\n19,213\n19,133\nEarnings per basic share\n$ 4.10\n$ 2.47\n$ 2.92\nWeighted average number of basic shares\n19,257\n19,148\n19,013\nThe accompanying notes are an integral part of these statements.\nF - 6\nJ&J SNACK FOODS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in thousands)\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(53 weeks)\n(52 weeks)\n(52 weeks)\nNet Earnings\n$ 78,906\n$ 47,235\n$ 55,607\nForeign currency translation adjustments\n3,547\n(330 )\n2,204\nTotal other comprehensive income (loss), net of tax\n3,547\n(330 )\n2,204\nComprehensive Income\n$ 82,453\n$ 46,905\n$ 57,811\nThe accompanying notes are an integral part of these statements.\nF - 7\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS' EQUITY\n(in thousands)\nAccumulated\nCommon\nOther\nStock\nComprehensive\nRetained\nShares\nAmount\nLoss\nEarnings\nTotal\nBalance as September 26, 2020\n18,915\n$ 49,268\n$ (15,587 )\n$ 775,817\n$ 809,498\nIssuance of common stock upon exercise of stock options\n18,739\n-\n-\n18,739\nIssuance of common stock for employee stock purchase plan\n1,391\n-\n-\n1,391\nForeign currency translation adjustment\n-\n-\n2,204\n-\n2,204\nDividends declared\n-\n-\n-\n(45,984 )\n(45,984 )\nShare-based compensation\n-\n4,199\n-\n-\n4,199\nNet earnings\n-\n-\n-\n55,607\n55,607\nBalance as September 25, 2021\n19,084\n$ 73,597\n$ (13,383 )\n$ 785,440\n$ 845,654\nIssuance of common stock upon exercise of stock options\n14,124\n-\n-\n14,124\nIssuance of common stock for employee stock purchase plan\n2,036\n-\n-\n2,036\nForeign currency translation adjustment\n-\n-\n(330 )\n-\n(330 )\nDividends declared\n-\n-\n-\n(49,819 )\n(49,819 )\nShare-based compensation\n-\n4,269\n-\n-\n4,269\nNet earnings\n-\n-\n-\n47,235\n47,235\nBalance as September 24, 2022\n19,219\n$ 94,026\n$ (13,713 )\n$ 782,856\n$ 863,169\nIssuance of common stock upon exercise of stock options\n13,111\n-\n-\n13,111\nIssuance of common stock for employee stock purchase plan\n2,101\n-\n-\n2,101\nForeign currency translation adjustment\n-\n-\n3,547\n-\n3,547\nDividends declared\n-\n-\n-\n(54,634\n)\n(54,634\n)\nShare-based compensation\n-\n5,318\n-\n-\n5,318\nNet earnings\n-\n-\n-\n78,906\n78,906\nBalance as September 30, 2023\n19,332\n$ 114,556\n$ (10,166\n)\n$ 807,128\n$ 911,518\nThe accompanying notes are an integral part of these statements.\nF - 8\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(53 weeks)\n(52 weeks)\n(52 weeks)\nOperating activities:\nNet earnings\n$ 78,906\n$ 47,235\n$ 55,607\nAdjustments to reconcile net earnings to net cash provided by operating activities\nDepreciation of fixed assets\n56,616\n49,669\n46,781\nAmortization of intangibles and deferred costs\n6,525\n3,454\n2,610\nIntangible asset impairment charges\n1,678\n1,010\n1,273\n(Gains) Losses from disposals of property & equipment\n(409 )\n(231 )\nShare-based compensation\n5,318\n4,269\n4,199\nDeferred income taxes\n10,935\n8,829\n(2,896 )\n(Gain) Loss on marketable securities\n(8 )\n(1,026 )\nOther\n(95 )\nChanges in assets and liabilities, net of effects from purchase of companies\nDecrease (Increase) in accounts receivable\n11,399\n(32,778 )\n(35,755 )\nDecrease (Increase) in inventories\n9,475\n(49,431 )\n(14,155 )\nDecrease (Increase) in prepaid expenses\n5,924\n(9,343 )\n9,629\n(Decrease) Increase in accounts payable and accrued liabilities\n(14,403 )\n2,708\n35,386\nNet cash provided by operating activities\n172,279\n26,062\n101,499\nInvesting activities:\nPayments for purchases of companies, net of cash acquired\n-\n(221,301 )\n-\nPurchases of property, plant and equipment\n(104,737 )\n(87,291 )\n(53,578 )\nProceeds from redemption and sales of marketable securities\n9,716\n12,026\n60,891\nProceeds from disposal of property and equipment\n1,781\n2,435\nOther\n-\n-\nNet cash (used in) provided by investing activities\n(93,240 )\n(296,167 )\n9,939\nFinancing activities:\nProceeds from issuance of stock\n15,212\n16,160\n20,256\nBorrowings under credit facility\n114,000\n125,000\n-\nRepayment of borrowings under credit facility\n(142,000 )\n(70,000 )\n-\nPayments for debt issuance costs\n-\n(225 )\n-\nPayments on finance lease obligations\n(180 )\n(279 )\n(144 )\nPayment of cash dividend\n(53,877 )\n(48,437 )\n(44,785 )\nNet cash (used in) provided by financing activities\n(66,845 )\n22,219\n(24,673 )\nEffect of exchange rates on cash and cash equivalents\n2,206\n(125 )\nNet increase (decrease) in cash and cash equivalents\n14,400\n(248,011 )\n87,383\nCash and cash equivalents at beginning of period\n35,181\n283,192\n195,809\nCash and cash equivalents at end of period\n$ 49,581\n$ 35,181\n$ 283,192\nThe accompanying notes are an integral part of these statements.\nF - 9\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE A - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nJ & J Snack Foods Corp. and Subsidiaries (the Company) manufactures, markets and distributes a variety of nutritional snack foods and beverages to the foodservice and retail supermarket industries. A summary of the significant accounting policies consistently applied in the preparation of the accompanying consolidated financial statements follows. Our 2023 fiscal year comprises 53 weeks. All references to 2023 fiscal year refer to that 53-week period. Fiscal years 2022 and 2021 comprised 52 weeks.\n1.\nPrinciples of Consolidation\nThe consolidated financial statements were prepared in accordance with U.S. GAAP. These financial statements include the accounts of J & J Snack Foods Corp. and its wholly-owned subsidiaries. Intercompany balances and transactions have been eliminated in the consolidated financial statements.\n2.\nRevenue Recognition\nWe recognize revenue in accordance with ASC 606, Revenue from Contracts with Customers.\nWhen Performance Obligations Are Satisfied\nA performance obligation is a promise in a contract to transfer a distinct good or service to the customer and is the unit of account for revenue recognition. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied.\nThe singular performance obligation of our customer contracts for product and machine sales is determined by each individual purchase order and the respective products ordered, with revenue being recognized at a point-in-time when the obligation under the terms of the agreement is satisfied and product control is transferred to our customer. Specifically, control transfers to our customers when the product is delivered to, installed or picked up by our customers based upon applicable shipping terms, as our customers can direct the use and obtain substantially all of the remaining benefits from the product at this point in time. The performance obligations in our customer contracts for product are generally satisfied within 30 days.\nThe singular performance obligation of our customer contracts for time and material repair and maintenance equipment service is the performance of the repair and maintenance with revenue being recognized at a point-in-time when the repair and maintenance is completed.\nThe singular performance obligation of our customer repair and maintenance equipment service contracts is the performance of the repair and maintenance with revenue being recognized over the time the service is expected to be performed. Our customers are billed for service contracts in advance of performance and therefore we have a contract liability on our balance sheet.\nSignificant Payment Terms\nIn general, within our customer contracts, the purchase order identifies the product, quantity, price, pick-up allowances, payment terms and final delivery terms. Although some payment terms may be more extended, presently the majority of our payment terms are 30 days. As a result, we have used the available practical expedient and, consequently, do not adjust our revenues for the effects of a significant financing component.\nF - 10\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nShipping\nAll amounts billed to customers related to shipping and handling are classified as revenues; therefore, we recognize revenue for shipping and handling fees at the time the products are shipped or when services are performed. The cost of shipping products to the customer is recognized at the time the products are shipped to the customer and our policy is to classify them as Distribution expenses.\nVariable Consideration\nIn addition to fixed contract consideration, our contracts include some form of variable consideration, including sales discounts, trade promotions and certain other sales and consumer incentives, including rebates and coupon redemptions. In general, variable consideration is treated as a reduction in revenue when the related revenue is recognized. Depending on the specific type of variable consideration, we use the most likely amount method to determine the variable consideration. We believe there will be no significant changes to our estimates of variable consideration when any related uncertainties are resolved with our customers. We review and update our estimates and related accruals of variable consideration each period based on historical experience. Our recorded liability for allowances, end-user pricing adjustments and trade spending was approximately $18.9 million at September 30, 2023 and $14.7 million at September 24, 2022.\nWarranties & Returns\nWe provide all customers with a standard or assurance type warranty. Either stated or implied, we provide assurance the related products will comply with all agreed-upon specifications and other warranties provided under the law. No services beyond an assurance warranty are provided to our customers.\nWe do not grant a general right of return. However, customers may return defective or non-conforming products. Customer remedies may include either a cash refund or an exchange of the product. We do not estimate a right of return and related refund liability as returns of our products are rare.\nContract Balances\nOur customers are billed for service contracts in advance of performance and therefore we have a contract liability on our balance sheet as follows:\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(in thousands)\nBeginning Balance\n$ 4,926\n$ 1,097\nAdditions to contract liability\n6,802\n9,163\nAmounts recognized as revenue\n(6,422 )\n(5,334 )\nEnding Balance\n$ 5,306\n$ 4,926\nDisaggregation of Revenue\nSee Note N for disaggregation of our net sales by class of similar product and type of customer.\nF - 11\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAllowance for Estimated Credit Losses\nThe Company continuously monitors collections and payments from its customers and maintains a provision for estimated credit losses. The allowance for estimated credit losses considers a number of factors including the age of receivable balances, the history of losses, expectations of future credit losses and the customers ability to pay off obligations. The allowance for estimated credit losses was $3.2 million and $2.2 million on September 30, 2023 and September 24, 2022, respectively.\n3.\nForeign Currency\nAssets and liabilities in foreign currencies are translated into U.S. dollars at the rate of exchange prevailing at the balance sheet date. Revenues and expenses are translated at the average rate of exchange for the period. The cumulative translation adjustment is recorded as a separate component of stockholders equity and changes to such are included in comprehensive income.\n4.\nUse of Estimates\nIn preparing financial statements in conformity with accounting principles generally accepted in the United States of America, management is required to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\n5.\nCash Equivalents\nCash equivalents are short-term, highly liquid investments with original maturities of three months or less.\n6.\nConcentrations and related risks\nWe maintain cash balances at financial institutions located in various states. We have cash balances at six banks totaling approximately $14 million that is in excess of federally insured limits.\nFinancial instruments that could potentially subject us to concentrations of credit risk are trade accounts receivable; however, such risks are limited due to the large number of customers comprising our customer base and their dispersion across geographic regions. We have approximately 31 customers with accounts receivable balances of between $1 million and $10 million and five customers with a balance greater than $10 million, with the largest being approximately $24 million.\nWe have several large customers that account for a significant portion of our sales. Our top ten customers accounted for 43%, 43% and 43% of our sales during fiscal years 2023, 2022 and 2021, respectively, with our largest customer accounting for 9% of our sales in 2023, 8% of our sales in 2022 and 11% of our sales in 2021. Five of the ten customers are food distributors who sell our product to many end users.\nAbout 28% of our employees are covered by collective bargaining agreements.\nNone of our vendors supplied more than 10% of our ingredients and packaging in 2023, 2022 or 2021.\nF - 12\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nVirtually all of our accounts receivable are due from trade customers. Credit is extended based on evaluation of our customers financial condition and collateral is not required. Accounts receivable payment terms vary and are stated in the financial statements at amounts due from customers net of an allowance for estimated credit losses. At September 30, 2023 and September 24, 2022, our accounts receivables were $198.1 million and $208.2 million, net of an allowance for estimated credit losses of $3.2 million and $2.2 million. Accounts receivable outstanding longer than the payment terms are considered past due. We determine our allowance by considering a number of factors, including the length of time trade accounts receivable are past due, our previous loss history, customers current ability to pay their obligations to us, and the condition of the general economy and the industry as a whole. We write off accounts receivable when they become uncollectible, and payments subsequently received on such receivables are credited to the allowance for estimated credit losses.\n7.\nInventories\nInventories are valued at the lower of cost (determined by the first-in, first-out method) or net realizable value. We recognize abnormal amounts of idle facilities, freight, handling costs, and spoilage as charges of the current period. Additionally, we allocate fixed production overhead to inventories based on the normal capacity of our production facilities. We calculate normal capacity as the production expected to be achieved over a number of periods or seasons under normal circumstances, taking into account the loss of capacity resulting from planned maintenance. This requires us to use judgment to determine when production is outside the range of expected variation in production (either abnormally low or abnormally high). In periods of abnormally low production (for example, periods in which there is significantly lower demand, labor and material shortages exist, or there is unplanned equipment downtime) the amount of fixed overhead allocated to each unit of production is not increased. However, in periods of abnormally high production the amount of fixed overhead allocated to each unit of production is decreased to assure inventories are not measured above cost.\n8.\nInvestment Securities\nWe classify our investment securities in one of three categories: held to maturity, trading, or available for sale. We held no investment securities at September 30, 2023. Our investment portfolio at September 24, 2022 consisted of investments classified as held to maturity and available for sale. The securities that we have the positive intent and ability to hold to maturity are classified as held to maturity and are stated at amortized cost. Investments classified as available for sale are reported at fair market value with unrealized gains and losses related to the changes in fair value of the securities recognized in investment income. The mutual funds and preferred stock in our available for sale portfolio do not have contractual maturities; however, we classify them as long-term assets as it is our intent to hold them for a period of over one year, although we may sell some or all of them depending on presently unanticipated needs for liquidity or market conditions. See Note C for further information on our holdings of investment securities.\n9.\nDepreciation and Amortization\nDepreciation of equipment and buildings is provided for by the straight-line method over the assets estimated useful lives. We review our equipment and buildings to ensure that they provide economic benefit and are not impaired.\nAmortization of leasehold improvements is provided for by the straight-line method over the term of the lease or the assets estimated useful lives, whichever is shorter. Licenses and rights, customer relationships, technology, non-compete agreements, and franchise agreements and certain tradenames are being amortized by the straight-line method over periods ranging from 2 to 20 years and amortization expense is reflected throughout operating expenses.\nF - 13\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLong-lived assets, including fixed assets and amortizing intangibles, are reviewed for impairment as events or changes in circumstances occur indicating that the carrying amount of the asset may not be recoverable. Indefinite lived intangibles are reviewed annually for impairment. Cash flow and sales analyses are used to assess impairment. The estimates of future cash flows and sales involve considerable management judgment and are based upon assumptions about expected future operating performance. Assumptions used in these forecasts are consistent with internal planning. The actual cash flows and sales could differ from managements estimates due to changes in business conditions, operating performance, economic conditions, competition, and consumer preferences.\n10.\nFair Value of Financial Instruments\nThe carrying value of our short-term financial instruments, such as accounts receivables and accounts payable, approximate their fair values, based on the short-term maturities of these instruments.\n11.\nIncome Taxes\nWe account for our income taxes under the liability method. Under the liability method, deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities as measured by the enacted tax rates that will be in effect when these differences reverse. Deferred tax expense is the result of changes in deferred tax assets and liabilities.\nAdditionally, we recognize a liability for income taxes and associated penalties and interest for tax positions taken or expected to be taken in a tax return which are more likely than not to be overturned by taxing authorities (uncertain tax positions). We have not recognized a tax benefit in our financial statements for these uncertain tax positions.\nAs of September 30, 2023 and September 24, 2022, the total amount of gross unrecognized tax benefits was $0.3 million and $0.3 million, respectively, all of which would impact our effective tax rate over time, if recognized. We recognize interest and penalties related to income tax matters as a part of the provision for income taxes. As of September 30, 2023 and September 24, 2022, we had $0.3 million of accrued interest and penalties. A reconciliation of the beginning and ending amount of unrecognized tax benefits is as follows:\n(in thousands)\nBalance at September 24, 2022\n$\nAdditions based on tax positions related to the current year\n-\nReductions for tax positions of prior years\n-\nSettlements\n-\nBalance at September 30, 2023\n$\nIn addition to our federal tax return and tax returns for Mexico and Canada, we file tax returns in all states that have a corporate income tax. Virtually all the returns noted above are open for examination for three to four years.\nOur effective tax rate in fiscal 2023 was 26.6%. Our effective tax rate in our fiscal 2022 year was 23.5% and in fiscal 2021 was 24.9%.\nF - 14\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n12.\nEarnings Per Common Share\nBasic earnings per common share (EPS) excludes dilution and is computed by dividing income available to common shareholders by the weighted average common shares outstanding during the period. Diluted EPS takes into consideration the potential dilution that could occur if securities (stock options) or other contracts to issue common stock were exercised and converted into common stock.\nOur calculation of EPS is as follows:\nFiscal year ended September 30, 2023\nIncome\nShares\nPer Share\n(Numerator)\n(Denominator)\nAmount\n(in thousands, except per share amounts)\nBasic EPS\nNet earnings available to common stockholders\n$ 78,906\n19,257\n$ 4.10\nEffect of dilutive securities\nRSU's and options\n$ -\n(0.02 )\nDiluted EPS\nNet earnings available to common stockholders plus assumed conversions\n$ 78,906\n19,324\n$ 4.08\n252,044 anti-dilutive shares have been excluded in the computation of fiscal year 2023 diluted EPS.\nFiscal year ended September 24, 2022\nIncome\nShares\nPer Share\n(Numerator)\n(Denominator)\nAmount\n(in thousands, except per share amounts)\nBasic EPS\nNet earnings available to common stockholders\n$ 47,235\n19,148\n$ 2.47\nEffect of dilutive securities\nRSU's and options\n$ -\n(0.01 )\nDiluted EPS\nNet earnings available to common stockholders plus assumed conversions\n$ 47,235\n19,213\n$ 2.46\n287,558 anti-dilutive shares have been excluded in the computation of fiscal year 2022 diluted EPS.\nFiscal year ended September 25, 2021\nIncome\nShares\nPer Share\n(Numerator)\n(Denominator)\nAmount\n(in thousands, except per share amounts)\nBasic EPS\nNet earnings available to common stockholders\n$ 55,607\n19,013\n$ 2.92\nEffect of dilutive securities\nRSU's and options\n$ -\n(0.01 )\nDiluted EPS\nNet earnings available to common stockholders plus assumed conversions\n$ 55,607\n19,133\n$ 2.91\n284,480 anti-dilutive shares have been excluded in the computation of fiscal year 2021 diluted EPS.\nF - 15\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n13.\nAccounting for Stock-Based Compensation\nAt September 30, 2023, the Company has two stock-based employee compensation plans. Share-based compensation was recognized as follows:\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(in thousands)\nStock options\n$ 1,882\n$ 2,407\n$ 2,265\nStock purchase plan\nStock issued to outside directors\n-\nService share units issued to employees\n1,043\nPerformance share units issued to employees\n-\n-\nTotal share-based compensation\n$ 4,219\n$ 3,334\n$ 2,975\nThe above compensation is net of tax benefits\n$ 1,099\n$\n$ 1,224\nThe fair value of each option grant is estimated on the date of grant using the Black-Scholes options-pricing model. No grants of options were made in fiscal 2023. The following weighted average assumptions were used for grants in fiscal 2022 and 2021: expected volatility of 25.8% for both fiscal years; weighted average risk-free interest rates of 0.8% for both fiscal years; dividend rate of 1.6% for fiscal 2022 and 1.4% for fiscal 2021; and expected lives ranging between 4 and 10 years for both fiscal years.\nExpected volatility is based on the historical volatility of the price of our common shares over the past 51 months for 5-year options and 10 years for 10-year options. We use historical information to estimate expected life and forfeitures within the valuation model. The expected term of awards represents the period of time that options granted are expected to be outstanding. The risk-free rate for periods within the expected life of the option is based on the U.S. Treasury yield curve in effect at the time of grant. Compensation cost is recognized using a straight-line method over the vesting or service period and is net of estimated forfeitures.\nThe Company issued 21,864 service share units (RSU)s in fiscal 2023 and 9,200 RSUs in fiscal 2022. Each RSU entitles the awardee to one share of common stock upon vesting. The fair value of the RSUs was determined based upon the closing price of the Companys common stock on the date of grant. No such RSUs were issued in fiscal 2021.\nThe Company also issued 21,260 performance share units (PSU)s in fiscal 2023 and 8,868 PSUs in fiscal 2022. Each PSU may result in the issuance of up to two shares of common stock upon vesting, dependent upon the level of achievement of the applicable performance goal. The fair value of the PSUs was determined based upon the closing price of the Companys common stock on the date of grant. Additionally, the Company applies a quarterly probability assessment in computing this non-cash compensation expense, and any change in estimate is reflected as a cumulative adjustment to expense in the quarter of the change. No such PSUs were issued in fiscal 2021.\n14.\nAdvertising Costs\nAdvertising costs are expensed as incurred. Total advertising expense was $9.7 million, $7.0 million, and $4.9 million for the fiscal years 2023, 2022 and 2021, respectively.\n15.\nCommodity Price Risk Management\nOur most significant raw material requirements include flour, packaging, shortening, corn syrup, sugar, juice, cheese, chocolate, and a variety of nuts. We attempt to minimize the effect of future price fluctuations related to the purchase of raw materials primarily through forward purchasing to cover future manufacturing requirements, generally for periods from 1 to 12 months. As of September 30, 2023, we have approximately $125 million of such commitments. Futures contracts are not used in combination with forward purchasing of these raw materials. Our procurement practices are intended to reduce the risk of future price increases, but also may potentially limit the ability to benefit from possible price decreases. At each of the last three fiscal year ends, we did not have any material losses on our purchase commitments.\nF - 16\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n16.\nResearch and Development Costs\nResearch and development costs are expensed as incurred. Total research and development expense was $1.2 million, $0.7 million and $0.6 million for the fiscal years 2023, 2022 and 2021, respectively.\n17.\nRecent Accounting Pronouncements\nIn December 2022, the FASB issued ASU No. 2022-06, \"Reference Rate Reform (Topic 848): Deferral of the Sunset Date of Topic 848\", to provide optional guidance to temporarily ease the potential burden in accounting for (or recognizing the effects of) reference rate reform on financial reporting. Preceding the issuance of ASU 2020-04, which established ASC 848, the United Kingdom's Financial Conduct Authority (\"FCA\") announced that it would no longer need to persuade or compel banks to submit to LIBOR after December 31, 2021. In response, the FASB established December 31, 2022 as the expiration date for ASC 848. In March 2021, the FCA announced the intended cessation date of the overnight 1-, 3-, 6-, and 12-month USD LIBOR would be June 30, 2023. Because the current relief in Topic 848 may not cover a period of time during which a significant number of modifications may take place, this update deferred the sunset date in Topic 848 from December 31, 2022, to December 31, 2024, after which entities will no longer be permitted to apply the relief in Topic 848. This guidance is not expected to have a material impact on our consolidated financial statements and disclosures.\nIn September 2022, the FASB issued ASU No. 2022-04 Liabilities - Supplier Finance Programs (Subtopic 405-50): Disclosure of Supplier Finance Program Obligations. This guidance requires annual and interim disclosures for entities that use supplier finance programs in connection with the purchase of goods and services. These amendments are effective for fiscal years beginning after December 15, 2022, except for the amendment on rollforward information, which is effective for fiscal years beginning after December 15, 2023. We are currently assessing the impact of the guidance on our consolidated financial statements and disclosures.\n18.\nReclassifications\nCertain prior year financial statement amounts have been reclassified to be consistent with the presentation for the current year.\nNOTE B - ACQUISITIONS\nOn June 21, 2022, J & J Snack Foods Corp. and its wholly-owned subsidiary, DD Acquisition Holdings, LLC, completed the acquisition of one hundred percent (100%) of the equity interests of Dippin Dots Holding, L.L.C. (Dippin Dots) which, through its wholly-owned subsidiaries, owns and operates the Dippin Dots and Doc Popcorn businesses. The purchase price was approximately $223.6 million, consisting entirely of cash, and may be modified for certain customary post-closing purchase price adjustments.\nDippin Dots is a leading producer of flash-frozen beaded ice cream treats, and the acquisition will leverage synergies in entertainment and amusement locations, theaters, and convenience to continue to expand our business. The acquisition also includes the Doc Popcorn business operated by Dippin Dots.\nThe financial results of Dippin Dots have been included in our consolidated financial statements since the date of the acquisition. Sales and net earnings of Dippin Dots $96.0 million and $13.0 million for the year ended September 30, 2023, and $33.7 million and $4.9 million for the year ended September 24, 2022. Dippin Dots is reported as part of our Food Service segment. Acquisition costs of $3.1 million were included within Administrative expenses for the year ended September 24, 2022.\nDippin' Dots Results Included in the Company's Consolidated Results\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(in thousands)\nNet sales\n$ 95,963\n$ 33,734\nNet earnings\n$ 13,005\n$ 4,859\nUpon acquisition, the assets and liabilities of Dippin Dots were adjusted to their respective fair values as of the closing date of the transaction, including the identifiable intangible assets acquired. In addition, the excess of the purchase price over the fair value of the net assets acquired has been recorded as goodwill. The fair value estimates used in valuing certain acquired assets and liabilities are based, in part, on inputs that are unobservable. For intangible assets, these include, but are not limited to, forecasted future cash flows, revenue growth rates, attrition rates and discount rates.\nThe purchase price allocation as of the date of acquisition was based on a preliminary valuation and is subject to revision as more detailed analyses are completed and additional information about the fair value of assets acquired and liabilities assumed becomes available.\nIn fiscal year 2023, we recorded a measurement period adjustment to the estimated fair values initially recorded on June 21, 2022, which resulted in an increase in Other Current Liabilities of $0.7 million and an increase in Goodwill of $0.7 million. In fiscal year 2022, we previously recorded measurement period adjustments to the estimated fair values initially recorded on June 21, 2022, which resulted in an increase to Property, plant, and equipment, net of $6.5 million, and reductions in Goodwill, Identifiable intangible assets, and Inventories of $4.0 million, $2.2 million, and $0.3 million, respectively. The measurement period adjustments were recorded to better reflect market participant assumptions about facts and circumstances existing as of the acquisition date and did not have a material impact on our consolidated statement of income for the year ended September 30, 2023.\nF - 17\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table reflects: (i) the Companys preliminary allocation of the purchase price to the assets acquired and liabilities assumed as of the acquisition date; (ii) measurement period adjustments made to the preliminary allocation during the measurement period; and (iii) the final allocation of the purchase price to the assets acquired and liabilities assumed:\nFinal Dippin' Dots Purchase Price Allocation\nPreliminary Value\nas of acquisition\ndate (as previously\nMeasurement\nreported as of\nPeriod\nJune 25, 2022)\nAdjustment\nAs Adjusted\n(in thousands)\nCash and cash equivalents\n$ 2,259\n$ 2,259\nAccounts receivable, net\n12,257\n12,257\nInventories\n8,812\n(301 )\n8,511\nPrepaid expenses and other\n1,215\n1,215\nProperty, plant and equipment, net\n24,622\n6,548\n31,170\nIntangible assets\n120,400\n(2,200 )\n118,200\nGoodwill (1)\n66,634\n(3,397 )\n63,237\nOperating lease right-of-use assets\n3,514\n3,514\nOther noncurrent assets\nTotal assets acquired\n239,956\n240,606\nLiabilities assumed:\nCurrent lease liabilities\nAccounts payable\n6,005\n6,005\nOther current liabilities\n3,532\n4,182\nNoncurrent lease liabilities\n2,954\n2,954\nOther noncurrent liabilities\n3,285\n3,285\nTotal liabilities acquired\n16,395\n17,045\nPurchase price\n$ 223,561\n$ -\n$ 223,561\n(1) Goodwill was assigned to our Food Services segment and was primarily attributed to the assembled workforce of the acquired business and to our expectations of favorable growth opportunities in entertainment and amusement locations, theaters, and convenience based on increased synergies that are expected to be achieved from the integration of Dippin Dots.\nAcquired Intangible Assets\nWeighted average\nJune 21,\nlife (years)\n(in thousands)\nAmortizable\nTrade name\nindefinite\n$ 76,900\nDeveloped technology\n22,900\nCustomer relationships\n9,900\nFranchise agreements\n8,500\nTotal acquired intangible assets\n$ 118,200\nThe following unaudited pro forma information presents the consolidated results of operations as if the business combination in 2022 had occurred as of September 27, 2020, after giving effect to acquisition-related adjustments, including: (1) depreciation and amortization of assets; (2) amortization of unfavorable contracts related to the fair value adjustments of the assets acquired; (3) change in the effective tax rate; (4) interest expense on any debt incurred to fund the acquisitions which would have been incurred had such acquisitions occurred as of September 27, 2020; and (5) merger and acquisition costs.\nJ & J Snack Foods Corp and Dippin' Dots Unaudited Pro Forma Combined Financial Information\nFiscal year ended\nSeptember 24,\nSeptember 25,\n(in thousands)\nNet sales\n$ 1,428,505\n$ 1,209,055\nNet earnings\n$ 49,191\n$ 61,001\nEarnings per diluted share\n$ 2.56\n$ 3.19\nWeighted average number of diluted shares\n19,213\n19,133\nF - 18\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE C - INVESTMENT SECURITIES\nWe have classified our investment securities as marketable securities held to maturity and available for sale. The FASB defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in pricing an asset or liability. As a basis for considering such assumptions, the FASB has established three levels of inputs that may be used to measure fair value:\nLevel 1 Observable inputs such as quoted prices in active markets for identical assets or liabilities;\nLevel 2 Observable inputs, other than Level 1 inputs in active markets, that are observable either directly or indirectly; and\nLevel 3 Unobservable inputs for which there is little or no market data, which require the reporting entity to develop its own assumptions.\nMarketable securities held to maturity and available for sale consist primarily of investments in mutual funds, preferred stock and corporate bonds. The fair values of mutual funds are based on quoted market prices in active markets and are classified within Level 1 of the fair value hierarchy. The fair values of preferred stock and corporate bonds are based on quoted prices for identical or similar instruments in markets that are not active. As a result, preferred stock and corporate bonds are classified within Level 2 of the fair value hierarchy.\nAs of September 30, 2023, the Company held no held to maturity investment securities or marketable securities available for sale.\nAs of the end of fiscal 2023, the Company did not hold any mutual fund investments. However, during the fiscal year, the mutual funds held sought current income with an emphasis on maintaining low volatility and overall moderate duration. The mutual funds generated income of about 6.8% in the fiscal year. As of the end of fiscal 2023, the Company was not invested in Fixed-to-Floating Perpetual Preferred Stock. However, during the fiscal year, the Company held investments in Fixed-to-Floating Perpetual Preferred Stock which generated fixed income to call dates in 2025 and then income was based on a spread above LIBOR if the securities were not called. The annual yield from these investments was 6.1% in the fiscal year, of which 50% is not subject to income tax. As of the end of fiscal 2023, the Company held no held to maturity investment securities. However, during the fiscal year, the Company was invested in corporate bonds which generated fixed income to maturity dates in 2023. The bonds generated income of about 1.7% in the fiscal year based on purchase price.\nAs of September 30, 2023, the Company had no held to maturity marketable securities. The amortized cost, unrealized gains and losses, and fair market values of our marketable securities held to maturity at September 24, 2022 are summarized as follows:\nGross\nGross\nFair\nAmortized\nUnrealized\nUnrealized\nMarket\nCost\nGains\nLosses\nValue\n(in thousands)\nCorporate Bonds\n$ 4,011\n$ -\n$\n$ 3,990\nTotal marketable securities held to maturity\n$ 4,011\n$ -\n$\n$ 3,990\nF - 19\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of September 30, 2023, the Company had no available for sale marketable securities. The amortized cost, unrealized gains and losses, and fair market values of our marketable securities available for sale at September 24, 2022 are summarized as follows:\nGross\nGross\nFair\nAmortized\nUnrealized\nUnrealized\nMarket\nCost\nGains\nLosses\nValue\n(in thousands)\nMutual Funds\n$ 3,588\n$ -\n$\n$ 2,846\nPreferred Stock\n2,816\n-\n2,862\nTotal marketable securities available for sale\n$ 6,404\n$\n$\n$ 5,708\nAs of September 30, 2023, the Company had no held to maturity securities. The amortized cost and fair value of the Companys held to maturity securities by contractual maturity at September 24, 2022 are summarized as follows:\nFair\nAmortized\nMarket\nCost\nValue\nDue in one year or less\n$ 4,011\n$ 3,990\nDue after one year through five years\n-\n-\nDue after five years through ten years\n-\n-\nTotal held to maturity securities\n$ 4,011\n$ 3,990\nLess current portion\n4,011\n3,990\nLong term held to maturity securities\n$ -\n$ -\nProceeds from the sale and redemption of marketable securities were $9.7 million, $12.0 million, and $60.9 million in the years ended September 30, 2023, September 24, 2022, and September 25, 2021, respectively; with a loss of $0.7 million in 2023, a gain of $0.3 million in 2022 and a gain of $0.2 million in 2021. We use the specific identification method to determine the cost of securities sold. Unrealized gains of $0.7 million and $0.3 million were recorded in 2023 and 2022, respectively.\nNOTE D - INVENTORIES\nInventories consist of the following:\nSeptember 30,\nSeptember 24,\n(in thousands)\nFinished goods\n$ 86,472\n$ 86,464\nRaw materials\n30,537\n41,505\nPackaging materials\n12,484\n16,637\nEquipment parts and other\n42,046\n35,867\nTotal inventories\n$ 171,539\n$ 180,473\nF - 20\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE E - PROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment consist of the following:\nSeptember 30,\nSeptember 24,\nEstimated Useful\nLives (years)\n(in thousands)\nLand\n$ 3,684\n$ 3,714\n-\nBuildings\n45,538\n34,232\n15-39.5\nPlant machinery and equipment\n445,299\n374,566\n5-20\nMarketing equipment\n296,482\n274,904\n5-7\nTransportation equipment\n14,367\n11,685\nOffice equipment\n47,393\n45,865\n3-5\nImprovements\n51,319\n49,331\n5-20\nConstruction in Progress\n56,116\n65,753\n-\n960,198\n860,050\nLess accumulated depreciation\n574,295\n524,683\nProperty, plant and equipment, net\n$ 385,903\n$ 335,367\nDepreciation expense was $56.6 million, $49.7 million, and $46.8 million for fiscal years 2023, 2022 and 2021, respectively.\nF - 21\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE F - GOODWILL AND INTANGIBLE ASSETS\nOur reportable segments are Food Service, Retail Supermarket and Frozen Beverages.\nIntangible Assets\nThe carrying amount of acquired intangible assets for the reportable segments are as follows:\nSeptember 30, 2023\nSeptember 24, 2022\nGross\nGross\nCarrying\nAccumulated\nCarrying\nAccumulated\nAmount\nAmortization\nAmount\nAmortization\nFOOD SERVICE\nIndefinite lived intangible assets\nTrade names\n$ 84,194\n$ -\n$ 85,872\n$ -\nAmortized intangible assets\nNon-compete agreements\n-\n-\nFranchise agreements\n8,500\n1,063\n8,500\nCustomer relationships\n22,900\n10,080\n22,900\n7,790\nTechnology\n23,110\n2,879\n23,110\nLicense and rights\n1,690\n1,565\n1,690\n1,481\nTOTAL FOOD SERVICE\n$ 140,394\n$ 15,587\n$ 142,742\n$ 10,729\nRETAIL SUPERMARKETS\nIndefinite lived intangible assets\nTrade names\n$ 11,938\n$ -\n$ 11,938\n$ -\nAmortized intangible Assets\nTrade names\n-\n-\nCustomer relationships\n7,687\n7,256\n7,907\n6,693\nTOTAL RETAIL SUPERMARKETS\n$ 19,625\n$ 7,256\n$ 20,494\n$ 7,342\nFROZEN BEVERAGES\nIndefinite lived intangible assets\nTrade names\n$ 9,315\n$ -\n$ 9,315\n$ -\nDistribution rights\n36,100\n-\n36,100\n-\nAmortized intangible assets\nCustomer relationships\n1,439\n1,439\nLicenses and rights\n1,400\n1,212\n1,400\n1,142\nTOTAL FROZEN BEVERAGES\n$ 48,254\n$ 1,901\n$ 48,254\n$ 1,687\nCONSOLIDATED\n$ 208,273\n$ 24,744\n$ 211,490\n$ 19,758\nThe gross carrying amount of intangible assets is determined by applying a discounted cash flow model to the future sales and earnings associated with each intangible asset or is set by contract cost. The amortization period used for definite lived intangible assets is set by contract period or by the period over which the bulk of the discounted cash flow is expected to be generated. We currently believe that we will receive the benefit from the use of the trade names and distribution rights classified as indefinite lived intangible assets indefinitely and they are therefore not amortized.\nLicenses and rights, customer relationships, franchise agreements, technology and non-compete agreements are being amortized by the straight-line method over periods ranging from 2 to 20 years and amortization expense is reflected throughout operating expenses.\nF - 22\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAmortizing and indefinite lived intangibles are reviewed for impairment as events or changes in circumstances occur indicating that the carrying amount of the asset may not be recoverable. Indefinite lived intangibles are also reviewed annually at year end for impairment. Cash flow and sales analyses are used to assess impairment. The estimates of future cash flows and sales involve considerable management judgment and are based upon assumptions about expected future operating performance which include Level 3 inputs such as annual growth rates and discount rates. Assumptions used in these forecasts are consistent with internal planning. The actual cash flows and sales could differ from managements estimates due to changes in business conditions, operating performance, economic conditions, competition, and consumer preferences.\nIn connection with our annual impairment assessment conducted during the fourth quarter of 2023, we determined that the carrying amounts of three trade names exceeded their fair value as of September 30, 2023. As a result, the Company recorded an indefinite lived intangible asset impairment charge of $1.7 million in the fourth quarter of 2023. The intangible asset impairment charge is reflected in Intangible asset impairment charges in the Consolidated Statements of Earnings. The $1.7 million intangible asset impairment charge related to trade names in the Food Service segment.\nThere were no intangible assets acquired in the fiscal year 2023. In fiscal year 2022, intangible assets of $118.2 million were added in the food service segment from the acquisition of Dippin Dots in the quarter ended June 25, 2022. There were no intangible assets acquired in the fiscal year 2021.\nAggregate amortization expense of intangible assets for the fiscal years 2023, 2022 and 2021 was $6.5 million, $3.5 million, and $2.6 million, respectively.\nEstimated amortization expense for the next five fiscal years is approximately $6.2 million in 2024, $5.6 million in 2025 and 2026, $4.6 million in 2027, and $4.2 million in 2028.\nThe weighted amortization period of the intangible assets, in total, is 10.4 years. The weighted amortization period by intangible asset class is 10 years for Technology, 10 years for Customer relationships, 20 years for Licenses & rights, and 10 years for Franchise agreements.\nGoodwill\nThe carrying amounts of goodwill for the reportable segments are as follows:\nFood\nRetail\nFrozen\nService\nSupermarket\nBeverages\nTotal\n(in thousands)\nSeptember 30, 2023\n$ 124,426\n$ 4,146\n$ 56,498\n$ 185,070\nSeptember 24, 2022\n$ 123,776\n$ 4,146\n$ 56,498\n$ 184,420\nThe carrying value of goodwill is determined based on the excess of the purchase price of acquisitions over the estimated fair value of tangible and intangible assets. Goodwill is not amortized but is evaluated annually at year end by management for impairment. Our impairment analysis for fiscal years 2023, 2022 and 2021 was based on a combination of the income approach, which estimates the fair value of reporting units based on discounted cash flows, and the market approach, which estimates the fair value of reporting units based on comparable market prices and multiples. Under the income approach the Company used a discounted cash flow which requires Level 3 inputs such as: annual growth rates, discount rates based upon the weighted average cost of capital and terminal values based upon current stock market multiples. There were no impairment charges to goodwill in fiscal years 2023, 2022 or 2021.\nIn fiscal year 2023, goodwill of $0.7 million was added in the food service segment from measurement period adjustments related to the prior year acquisition of Dippin Dots. In fiscal year 2022, goodwill of $62.6 million was added in the food service segment from the acquisition of Dippin Dots in the quarter ended June 25, 2022. No goodwill was acquired in fiscal years 2021.\nF - 23\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE G - LONG-TERM DEBT\nIn December 2021, the Company entered into an amended and restated loan agreement (the Credit Agreement) with our existing banks which provided for up to a $50 million revolving credit facility repayable in December 2026.\nInterest accrues, at the Companys election at (i) the BSBY Rate (as defined in the Credit Agreement), plus an applicable margin, based upon the Consolidated Net Leverage Ratio, as defined in the Credit Agreement, or (ii) the Alternate Base Rate (a rate based on the higher of (a) the prime rate announced from time-to-time by the Administrative Agent, (b) the Federal Reserve Systems federal funds rate, plus 0.50% or (c) the Daily BSBY Rate, plus an applicable margin). The Alternate Base Rate is defined in the Credit Agreement.\nThe Credit Agreement requires the Company to comply with various affirmative and negative covenants, including without limitation (i) covenants to maintain a minimum specified interest coverage ratio and maximum specified net leverage ratio, and (ii) subject to certain exceptions, covenants that prevent or restrict the Companys ability to pay dividends, engage in certain mergers or acquisitions, make certain investments or loans, incur future indebtedness, alter its capital structure or line of business, prepay subordinated indebtedness, engage in certain transactions with affiliates, or amend its organizational documents. As of September 30, 2023, the Company is in compliance with all financial covenants of the Credit Agreement.\nOn June 21, 2022, the Company entered into an amendment to the Credit Agreement, the Amended Credit Agreement which provided for an incremental increase of $175 million in available borrowings. The Amended Credit Agreement also includes an option to increase the size of the revolving credit facility by up to an amount not to exceed in the aggregate the greater of $225 million or, $50 million plus the Consolidated EBITDA of the Borrowers, subject to the satisfaction of certain terms and conditions.\nAs of September 30, 2023, $27.0 million was outstanding under the Amended Credit Agreement with a weighted average interest rate of 6.48%. These borrowings have been classified as Long-Term Debt on the Companys Balance Sheet. As of September 30, 2023, the amount available under the Amended Credit Agreement was $188.2 million, after giving effect to the outstanding letters of credit. As of September 24, 2022, $55.0 million was outstanding under the Credit Agreement. As of September 24, 2022, the amount available under the Amended Agreement was $160.2 million, after giving effect to the outstanding letters of credit.\nF - 24\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE H - INCOME TAXES\nIncome tax expense (benefit) is as follows:\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(in thousands)\nCurrent\nU.S. Federal\n$ 6,447\n$ (374 )\n$ 13,964\nForeign\n6,149\n2,854\nState\n4,349\n3,210\n6,431\nTotal current expense\n16,945\n5,690\n21,255\nDeferred\nU.S. Federal\n$ 12,134\n$ 10,834\n$ (145 )\nForeign\n(394 )\n(353 )\nState\n(703 )\n(1,611 )\n(2,338 )\nTotal deferred expense (benefit)\n11,663\n8,829\n(2,836 )\nTotal expense\n$ 28,608\n$ 14,519\n$ 18,419\nThe provisions for income taxes differ from the amounts computed by applying the statutory federal income tax rate of 21% for the fiscal years ended 2023, 2022 and 2021 to earnings before income taxes for the following reasons:\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(in thousands)\nIncome taxes at federal statutory rates\n$ 22,578\n$ 12,968\n$ 15,545\nIncrease (decrease) in taxes resulting from:\nState income taxes, net of federal income tax benefit\n2,732\n1,261\n3,233\nShare-based compensation\n(124 )\nTax effect in jurisdictions where rates differ from federal statutory rate\n1,837\nOther, net\n1,399\n(296 )\n(391 )\nIncome tax expense\n$ 28,608\n$ 14,519\n$ 18,419\nOur effective tax rate in fiscal 2023 was 26.6%. Our effective tax rate in our fiscal 2022 year was 23.5% and our effective tax rate in fiscal 2021 was 24.9%.\nF - 25\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDeferred tax assets and liabilities consist of the following:\nFiscal year ended\nSeptember 30,\nSeptember 24,\n(in thousands)\nDeferred tax assets:\nVacation accrual\n$ 1,215\n$ 1,321\nCapital loss carry forwards\nUnrealized gains/losses\nAccrued insurance liability\n3,511\n3,614\nOperating lease liabilities\n23,996\n14,521\nDeferred income\nAllowances\n2,879\n2,598\nInventory capitalization\n1,702\n1,620\nShare-based compensation\n1,960\n1,680\nNet operating loss\nPayroll tax accrual\n-\n1,142\nBonus accrual\n2,282\n-\nForeign tax credit\nTotal deferred tax assets\n39,454\n27,969\nValuation allowance\n(675 )\n(521 )\nTotal deferred tax assets, net\n38,779\n27,448\nDeferred tax liabilities:\nAmortization of goodwill and other intangible assets\n35,363\n32,680\nDepreciation of property, plant and equipment\n61,185\n51,972\nRight-of-use assets\n22,688\n13,058\nAccounting method change 481(a)\nTotal deferred tax liabilities\n120,089\n97,855\nTotal deferred tax liabilities, net\n$ 81,310\n$ 70,407\nAs of September 30, 2023, we have federal and state capital loss carry forwards of approximately $0.8 million primarily from the sale of marketable securities in fiscal year 2017 and unrealized losses incurred in fiscal years 2019 and 2020. These carry forwards began to expire in fiscal 2021. Except for current year usage, we have no foreseeable capital gains that would allow us to use this asset. Accordingly, we have recorded a valuation allowance for the full amount of this deferred tax asset.\nAs of September 30, 2023, we have a federal net operating loss carry forward of approximately $2.2 million from the PHILLY SWIRL acquisition. These carry forwards are subject to an annual limitation under Code Section 382 of approximately $0.4 million and will expire in 2033. Additionally, as of September 30, 2023, we have state net operating loss carry forwards of approximately $0.5 million. These state operating losses begin to expire in 2034. We have determined there are no limitations to the total use of these tax assets and, accordingly, have not recorded a valuation allowance for these deferred tax assets.\nWe have undistributed earnings of our Mexican and Canadian subsidiaries. We are no longer permanently reinvested in earnings of our foreign subsidiaries for any year. No additional U.S. federal income taxes are anticipated if our undistributed earnings in our Mexican and Canadian subsidiaries were repatriated to the U.S. However, if such funds were repatriated, a portion of the funds remitted may be subject to applicable state income taxes and non-U.S. income and withholding taxes. The amount of unrecognized deferred income tax liabilities related to potential state income tax and foreign withholding taxes is immaterial.\nThe Coronavirus, Aid, Relief and Economic Security (CARES) Act was signed into law on March 27, 2020, which introduced and revised numerous provisions including a technical correction to qualified improvement property for assets placed in service after 2017 through 2022 to allow for immediate depreciation to be claimed on these assets and the deferral of employers share of certain payroll taxes. As a result of the CARES Act, we deferred $4.3 million of payroll taxes as of September 24, 2022. No payroll taxes were deferred as of September 30, 2023.\nF - 26\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOn August 16, 2022, the Inflation Reduction Act of 2022 (IRA) was signed into law. The IRA made several changes to the U.S. tax code effective after December 31, 2022, including, but not limited to, a 15% minimum tax on large corporations with average annual financial statement income of more than $1 billion for a three tax-year period and a 1% excise tax on public company stock buybacks, which will be accounted for in treasury stock. We do not expect these changes to have a material impact on our provision for income taxes or financial statements.\nNOTE I - COMMITMENTS\nWe are a party to litigation which has arisen in the normal course of business which management currently believes will not have a material adverse effect on our financial condition or results of operations.\nWe self-insure, up to loss limits, certain insurable risks such as workers compensation, automobile, and general liability claims. Accruals for claims under our self-insurance program are recorded on a claims incurred basis. Our total recorded liability for all years claims incurred but not yet paid was $13.4 million and $13.7 million at September 30, 2023 and September 24, 2022, respectively. In connection with certain self-insurance agreements, we customarily enter into letters of credit arrangements with our insurers. At both September 30, 2023, and September 24, 2022, we had outstanding letters of credit totaling $9.8 million, respectively.\nWe have a self-insured medical plan which covers approximately 1,800 of our employees. We record a liability for incurred but not yet reported or paid claims based on our historical experience of claims payments and a calculated lag time period. Our recorded liability at September 30, 2023 and September 24, 2022 was $2.0 million and $1.8 million, respectively.\nNOTE J - CAPITAL STOCK\nWith the exception of shares withheld to cover taxes associated with the vesting of certain restricted stock units held by officers and employees, we did not purchase any shares of our common stock in our fiscal years ended September 30, 2023, September 24, 2022, and September 25, 2021.\nNOTE K - STOCK-BASED COMPENSATION\nWe have a Long-Term Incentive Plan (the Plan). Pursuant to the Plan, stock options, which qualify as incentive stock options as well as stock options which are nonqualified, restricted stock units, and performance awards may be granted to officers and our key employees.\nThe exercise price of incentive stock options is at least the fair market value of the common stock on the date of grant. The exercise price for nonqualified options is determined by a committee of the Board of Directors. The options are generally exercisable after three years and expire no later than ten years from date of grant. The fair value of each option grant is estimated on the date of grant using the Black-Scholes options-pricing model. Forfeitures are recognized as they occur.\nPerformance awards may include (i) specific dollar-value target awards, (ii) performance units, or (iii) performance shares. The vesting of performance based awards, if any, is dependent upon the achievement of certain performance targets. If the performance standards are not achieved, all unvested units will expire, and any accrued expense will be reversed. The fair value of the grant is determined based upon the closing price of the Companys stock on the date of grant.\nF - 27\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThere are approximately 462,000 shares reserved under the Plan for which options, restricted stock units, and performance awards have not yet been issued. There are options that were issued under prior option plans that have since been replaced that are still outstanding.\nWe have an Employee Stock Purchase Plan (ESPP) whereby employees purchase stock by making contributions through payroll deductions for six-month periods. The purchase price of the stock is 85% of the lower of the market price of the stock at the beginning of the six-month period or the end of the six-month period. In fiscal years 2023, 2022 and 2021 employees purchased 17,231, 16,274 and 11,988 shares at average purchase prices of $121.53, $124.94, and $116.03, respectively. ESPP expense of $0.6 million, $0.3 million, and $0.6 million was recognized for fiscal years 2023, 2022 and 2021, respectively.\nStock Options\nA summary of the status of our stock option plans as of fiscal years 2023, 2022 and 2021 and the changes during the years ended on those dates is represented below:\nIncentive Stock Options\nNonqualified Stock Options\nWeighted-\nWeighted-\nStock\nAverage\nStock\nAverage\nOptions\nExercise\nOptions\nExercise\nOutstanding\nPrice\nOutstanding\nPrice\nBalance, September 26, 2020\n470,420\n136.62\n346,442\n122.04\nGranted\n111,862\n165.53\n43,970\n160.14\nExercised\n(102,976 )\n120.83\n(55,453 )\n120.92\nCanceled\n(31,684 )\n143.74\n(41,222 )\n95.95\nBalance, September 25, 2021\n447,622\n146.98\n293,737\n132.29\nGranted\n103,405\n132.38\n11,545\n132.38\nExercised\n(67,782 )\n131.35\n(60,581 )\n107.17\nCanceled\n(49,886 )\n150.85\n(16,383 )\n151.50\nBalance, September 24, 2022\n433,359\n146.98\n228,318\n132.29\nGranted\n-\n-\n-\n-\nExercised\n(83,401 )\n140.30\n(11,294 )\n137.81\nCanceled\n(78,137 )\n143.96\n(5,646 )\n153.04\nBalance, September 30, 2023\n271,821\n147.45\n211,378\n140.79\nExercisable Options September 30, 2023\n102,158\n145.91\n161,128\n136.55\nThere were no incentive stock option grants in fiscal year 2023. The weighted-average fair value of incentive stock options granted during fiscal years ended September 24, 2022 and September 25, 2021 was $23.36 and $31.20, respectively. There were no non-qualified stock options grants in fiscal year 2023. The weighted-average fair value of non-qualified stock options granted during the fiscal years ended September 24, 2022 and September 25, 2021 was $23.36 and $29.76, respectively. The total intrinsic value of stock options exercised was $2.1 million, $4.1 million and $6.0 million in fiscal years 2023, 2022 and 2021, respectively.\nThe total cash received from these option exercises was $13.1 million, $14.1 million and $18.7 million in fiscal years 2023, 2022 and 2021, respectively; and the actual tax benefit realized from the tax deductions from these option exercises was $0.1 million, $0.7 million and $1.2 million in fiscal years 2023, 2022 and 2021, respectively.\nAt September 30, 2023, the Company has unrecognized compensation expense of approximately $2.1 million related to stock options to be recognized over the next three fiscal years.\nF - 28\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table summarizes information about incentive stock options outstanding as of September 30, 2023:\nOptions Outstanding\nOptions Exercisable\nNumber\nWeighted-\nNumber\nOutstanding\nAverage\nWeighted-\nOutstanding\nWeighted-\nat\nRemaining\nAverage\nat\nAverage\nRange of\nSeptember 30,\nContractual\nExercise\nSeptember 30,\nExercise\nExercise Prices\nLife\nPrice\nPrice\n$125.83\n- $158.97\n136,548\n3.0\n$ 130.26\n48,508\n$ 126.27\n$163.29\n- $192.13\n135,273\n1.8\n$ 164.81\n53,650\n$ 163.67\nTotal options\n271,821\n102,158\n145.91\nThe following table summarizes information about nonqualified stock options outstanding as of September 30, 2023:\nOptions Outstanding\nOptions Exercisable\nNumber\nWeighted-\nNumber\nOutstanding\nAverage\nWeighted-\nOutstanding\nWeighted-\nat\nRemaining\nAverage\nat\nAverage\nRange of\nSeptember 30,\nContractual\nExercise\nSeptember 30,\nExercise\nExercise Prices\nLife\nPrice\nPrice\n$94.24 - $119.44\n60,000\n2.0\n$ 110.51\n60,000\n$ 110.51\n$125.83 - $153.65\n91,544\n4.5\n$ 139.28\n61,784\n$ 135.71\n$163.29\n- $191.40\n59,834\n3.1\n$ 173.46\n39,344\n$ 177.58\nTotal options\n211,378\n161,128\n136.55\nRestricted Stock Units\nA summary of our service share units (RSU)s as of fiscal years 2023 and 2022 and the changes during the years ended on those dates is represented below. No RSUs were granted, vested, or cancelled in fiscal 2021.\nWeighted-\nWeighted-\nAverage\nAverage\nNumber of\nGrant-Date\nRemaining\nAggregate\nPerformance\nFair Value\nContractual\nIntrinsic\nShare Unites\nPer Share\nLife\nValue\nBalance, September 25, 2021\n-\n-\n-\nGranted\n9,200\n154.85\nVested\n-\n-\nCanceled\n-\n-\nBalance, September 24, 2022\n9,200\n154.85\n2.1\nGranted\n21,864\n154.32\nVested\n(3,165\n)\n154.94\nCanceled\n-\n-\nBalance, September 30, 2023\n27,899\n154.46\n2.2\n4,566\nF - 29\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of September 30, 2023, the Company has unrecognized compensation expense of approximately $2.5 million related to the RSUs.\nPerformance Share Units\nA summary of our performance share units (PSU)s as of fiscal years 2023 and 2022 and the changes during the years ended on those dates is represented below. The shares are represented at the target award amounts based upon the respective performance share agreements. Actual shares that will vest depend on the level of attainment of the performance-based criteria. No PSUs were granted, vested, or canceled in fiscal 2021.\nWeighted-\nWeighted-\nAverage\nAverage\nNumber of\nGrant-Date\nRemaining\nAggregate\nPerformance\nFair Value\nContractual\nIntrinsic\nShare Unites\nPer Share\nLife\nValue\nBalance, September 25, 2021\n-\n-\n-\nGranted\n8,868\n155.01\nVested\n-\n-\nCanceled\n-\n-\nBalance, September 24, 2022\n8,868\n155.01\n2.1\nGranted\n21,260\n155.29\nVested\n-\n-\nCanceled (1)\n(8,868\n)\n155.01\nBalance, September 30, 2023\n21,260\n155.29\n2.2\n3,479\n(1) Includes adjustments for performance achievement.\nAs of September 30, 2023, the Company has unrecognized compensation expense of approximately $2.4 million related to the PSUs.\nNOTE L - 401(k) PROFIT-SHARING PLAN\nWe maintain a 401(k) profit-sharing plan for our employees. Under this plan, we may make discretionary profit-sharing and matching 401(k) contributions. Contributions of $2.8 million, $2.5 million, and $2.3 million were made in fiscal years 2023, 2022 and 2021, respectively.\nF - 30\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE M - CASH FLOW INFORMATION\nThe following is supplemental cash flow information:\nFiscal year ended\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(in thousands)\nCash paid for:\nInterest\n$ 4,745\n$\n$\nIncome taxes\n8,617\n16,814\n11,556\nNon cash items:\nObtaining a right-of-use asset in exchange for a lease liability\n$ 54,050\n$ 11,783\n$\nNOTE N - SEGMENT REPORTING\nWe principally sell our products to the food service and retail supermarket industries. Sales and results of our frozen beverages business are monitored separately from the balance of our food service business because of different distribution and capital requirements. We maintain separate and discrete financial information for the three operating segments mentioned above which is available to our Chief Operating Decision Maker. We have applied no aggregation criteria to any of these operating segments in order to determine reportable segments. Our three reportable segments are Food Service, Retail Supermarkets and Frozen Beverages. All inter-segment net sales and expenses have been eliminated in computing net sales and operating income. These segments are described below.\nFood Service\nThe primary products sold by the Food Service segment are soft pretzels, frozen novelties, churros, handheld products and baked goods. Our customers in the Food Service segment include snack bars and food stands in chain, department and discount stores; malls and shopping centers; casual dining restaurants; fast food and casual dining restaurants; stadiums and sports arenas; leisure and theme parks; convenience stores; movie theatres; warehouse club stores; schools, colleges and other institutions. Within the food service industry, our products are purchased by the consumer primarily for consumption at the point-of-sale or for take-away.\nRetail Supermarkets\nThe primary products sold to the retail supermarket channel are soft pretzel products - including SUPERPRETZEL and AUNTIE ANNES, frozen novelties including LUIGIS Real Italian Ice, MINUTE MAID Juice Bars and Soft Frozen Lemonade, WHOLE FRUIT frozen fruit bars and sorbet, DOGSTERS ice cream style treats for dogs, PHILLY SWIRL cups and sticks, ICEE Squeeze-Up Tubes and handheld products. Within the retail supermarket channel, our frozen and prepackaged products are purchased by the consumer for consumption at home.\nFrozen Beverages\nWe sell frozen beverages to the foodservice industry primarily under the names ICEE, SLUSH PUPPIE and PARROT ICE in the United States, Mexico and Canada. We also provide repair and maintenance services to customers for customer-owned equipment.\nF - 31\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Chief Operating Decision Maker for Food Service, Retail Supermarkets and Frozen Beverages reviews monthly detailed operating income statements and sales reports in order to assess performance and allocate resources to each individual segment. Sales and operating income are key variables monitored by the Chief Operating Decision Maker and management when determining each segments and the companys financial condition and operating performance. In addition, the Chief Operating Decision Maker reviews and evaluates depreciation, capital spending and assets of each segment on a quarterly basis to monitor cash flow and asset needs of each segment. Information regarding the operations in these three reportable segments is as follows:\nSeptember 30,\nSeptember 24,\nSeptember 25,\n(53 weeks)\n(52 weeks)\n(52 weeks)\n(in thousands)\nSales to external customers:\nFood Service\nSoft pretzels\n$ 235,572\n$ 205,752\n$ 174,977\nFrozen novelties\n145,425\n78,183\n44,605\nChurros\n108,927\n88,242\n64,916\nHandhelds\n82,292\n92,130\n75,627\nBakery\n378,149\n381,526\n342,609\nOther\n31,475\n26,854\n22,249\nTotal Food Service\n$ 981,840\n$ 872,687\n$ 724,983\nRetail Supermarket\nSoft pretzels\n$ 60,272\n$ 61,925\n$ 54,990\nFrozen novelties\n115,807\n108,911\n100,059\nBiscuits\n25,074\n24,695\n24,197\nHandhelds\n16,655\n5,640\n7,574\nCoupon redemption\n(2,561 )\n(3,713 )\n(3,689 )\nOther\n1,766\nTotal Retail Supermarket\n$ 215,428\n$ 197,943\n$ 184,897\nFrozen Beverages\nBeverages\n$ 224,655\n$ 184,063\n$ 124,498\nRepair and maintenance service\n95,941\n89,840\n81,305\nMachines revenue\n37,933\n33,601\n26,953\nOther\n3,032\n2,522\n1,943\nTotal Frozen Beverages\n$ 361,561\n$ 310,026\n$ 234,699\nConsolidated sales\n$ 1,558,829\n$ 1,380,656\n$ 1,144,579\nDepreciation and amortization:\nFood Service\n39,758\n$ 29,807\n$ 26,738\nRetail Supermarket\n1,966\n1,536\n1,671\nFrozen Beverages\n21,417\n21,780\n20,982\nTotal depreciation and amortization\n$ 63,141\n$ 53,123\n$ 49,391\nOperating Income:\nFood Service\n$ 49,778\n$ 18,512\n$ 39,172\nRetail Supermarket\n9,375\n9,487\n25,914\nFrozen Beverages\n50,365\n33,800\n6,132\nTotal operating income\n$ 109,518\n$ 61,799\n$ 71,218\nCapital expenditures:\nFood Service\n$ 79,388\n$ 61,738\n$ 38,558\nRetail Supermarket\n1,824\n8,885\nFrozen Beverages\n23,525\n16,668\n14,732\nTotal capital expenditures\n$ 104,737\n$ 87,291\n$ 53,578\nAssets:\nFood Service\n$ 903,518\n$ 893,045\n$ 799,149\nRetail Supermarket\n34,232\n20,302\n31,486\nFrozen Beverages\n339,486\n303,619\n291,584\nTotal assets\n$ 1,277,236\n$ 1,216,966\n$ 1,122,219\nF - 32\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE O - ACCUMULATED OTHER COMPREHENSIVE LOSS\nChanges to the components of accumulated other comprehensive loss are as follows:\nFiscal Year Ended September 30, 2023\n(in thousands)\nForeign Currency\nTranslation Adjustments\nBeginning Balance\n$ (13,713 )\nOther comprehensive income\n3,547\nEnding Balance\n$ (10,166 )\nFiscal Year Ended September 24, 2022\n(in thousands)\nForeign Currency\nTranslation Adjustments\nBeginning Balance\n$ (13,383 )\nOther comprehensive (loss)\n(330 )\nEnding Balance\n$ (13,713 )\nNOTE P - LEASES\nGeneral Lease Description\nWe have operating leases with initial noncancelable lease terms in excess of one year covering the rental of various facilities and equipment. Certain of these leases contain renewal options and some provide options to purchase during the lease term. Our operating leases include leases for real estate from some of our office, warehouse, and manufacturing facilities as well as manufacturing and non-manufacturing equipment used in our business. The remaining lease terms for these operating leases range from 1 month to 20 years.\nWe have finance leases with initial noncancelable lease terms in excess of one year covering the rental of various equipment. These leases are generally for manufacturing and non-manufacturing equipment used in our business. The remaining lease terms for these finance leases range from 1 year to 5 years.\nF - 33\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSignificant Assumptions and Judgments\nContract Contains a Lease\nIn evaluating our contracts to determine whether a contract is or contains a lease, we considered the following:\n●\nWhether explicitly or implicitly identified assets have been deployed in the contract; and\n●\nWhether we obtain substantially all of the economic benefits from the use of that underlying asset, and we can direct how and for what purpose the asset is used during the term of the contract.\nAllocation of Consideration\nIn determining how to allocate consideration between lease and non-lease components in a contract that was deemed to contain a lease, we used judgment and consistent application of assumptions to reasonably allocate the consideration.\nOptions to Extend or Terminate Leases\nWe have leases which contain options to extend or terminate the leases. On a lease-by-lease basis, we have determined if the extension should be considered reasonably certain to be exercised and thus a right-of-use asset and a lease liability should be recorded.\nDiscount Rate\nThe discount rate for leases, if not explicitly stated in the lease, is the incremental borrowing rate, which is the rate of interest that a lessee would have to pay to borrow on a collateralized basis over a similar term an amount equal to the lease payments in a similar economic environment.\nWe used a discount rate to calculate the present value of the lease liability at the date of adoption. In the development of the discount rate, we considered our internal borrowing rate, treasury security rates, collateral, and credit risk specific to us, and our lease portfolio characteristics.\nAs of September 30, 2023, the weighted-average discount rate of our operating and finance leases was 4.4% and 3.9%, respectively. As of September 24, 2022, the weighted-average discount rate of our operating and finance leases was 3.3% and 3.2%, respectively.\nF - 34\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAmounts Recognized in the Financial Statements\nThe components of lease expense were as follows:\nFiscal year ended\nFiscal year ended\nSeptember 30, 2023\nSeptember 24, 2022\nOperating lease cost in Cost of goods sold and Operating expenses\n$ 17,352\n$ 15,611\nFinance lease cost:\nAmortization of assets in Cost of goods sold and Operating expenses\n$\n$\nInterest on lease liabilities in Interest expense & other\nTotal finance lease cost\n$\n$\nShort-term lease cost in Cost of goods sold and Operating expenses\n-\n-\nTotal net lease cost\n$ 17,644\n$ 15,784\nSupplemental balance sheet information related to leases is as follows:\nSeptember 30, 2023\nSeptember 24, 2022\nOperating Leases\nOperating lease right-of-use assets\n$ 88,868\n$ 51,137\nCurrent operating lease liabilities\n$ 16,478\n$ 13,524\nNoncurrent operating lease liabilities\n77,631\n42,660\nTotal operating lease liabilities\n$ 94,109\n$ 56,184\nFinance Leases\nFinance lease right-of-use assets in Property, plant and equipment, net\n$\n$\nCurrent finance lease liabilities\n$\n$\nNoncurrent finance lease liabilities\nTotal finance lease liabilities\n$\n$\nSupplemental cash flow information related to leases is as follows:\nFiscal year ended\nFiscal year ended\nSeptember 30, 2023\nSeptember 24, 2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$ 17,536\n$ 16,505\nOperating cash flows from finance leases\n$\n$\nFinancing cash flows from finance leases\n$\n$\nSupplemental noncash information on lease liabilities arising from obtaining right-of-use assets\n$ 54,050\n$ 11,783\nSupplemental noncash information on lease liabilities removed due to purchase of leased asset\n$ -\n$ -\nAs of September 30, 2023, the maturities of lease liabilities were as follows:\nOperating Leases\nFinance Leases\n$ 20,073\n$\n16,312\n13,069\n11,983\n8,806\nThereafter\n49,504\nTotal minimum payments\n119,747\nLess amount representing interest\n(25,638 )\n(77 )\nPresent value of lease obligations\n$ 94,109\n$\nAs of September 30, 2023, the weighted-average remaining term of our operating and finance leases was 10.3 years and 4.2 years, respectively. As of September 24, 2022, the weighted average remaining term of our operating and finance leases was 5.8 years and 3.3 years, respectively.\nF - 35\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE Q - Related Parties\nWe have related party expenses for distribution and shipping related costs with NFI Industries, Inc. (NFI). Our director, Sidney R. Brown, is CEO and an owner of NFI Industries, Inc. In the fiscal years ended 2023, 2022, and 2021, the Company paid NFI $55.9 million, $29.5 million and $0.2 million, respectively. Of the amounts paid to NFI, the amount related to management services performed by NFI was $0.8 million in fiscal year 2023, $0.6 million in fiscal year 2022, and $0.2 million in fiscal year 2021. The remainder of the costs related to amounts that were passed through to the third-party distribution and shipping vendors that are being managed on the Companys behalf by NFI. As of September 30, 2023, and September 24, 2022, our consolidated balance sheet included related party trade payables of approximately $3.4 million and $2.9 million, respectively.\nIn June 2023, the Company began leasing a regional distribution center in Terrell, Texas that was constructed by, and is owned by, a subsidiary of NFI. The distribution center will be operated by NFI for the Company, pursuant to a Distribution Services Agreement. Under the Distribution Services Agreement, NFI will provide logistics and warehouse management services. NFI will continue to perform distribution-related management services for the Company as well. At the lease commencement date, $28.7 million was recorded as an operating right-of-use asset, $0.2 million was recorded as a current operating lease liability, and $28.5 million was recorded as a non-current operating lease liability. As of the year ended September 30, 2023, $28.4 million was recorded as an operating right-of-use asset, $0.5 million was recorded as a current operating lease liability, and $28.5 million was recorded as a non-current operating lease liability. Lease payments totaling $0.2 million were made to NFI during the fiscal year ended September 30, 2023.\nAll agreements with NFI include terms that are consistent with those that we believe would have been negotiated at an arms length with an independent party.\nNOTE R - SUBSEQUENT EVENTS\nEvents occurring after September 30, 2023, and through the date that these consolidated financial statements were issued, were evaluated to ensure that any subsequent events that met the criteria for recognition have been included, and are as follows:\nIn October 2023, the Company began leasing a regional distribution center in Woolwich Township, New Jersey. At the lease commencement date, $37.1 million was recorded as an operating right-of-use asset and $37.1 million was recorded as a non-current operating lease liability. The distribution center will be operated by NFI for the Company, pursuant to the Distribution Services Agreement noted in Note Q.\nF - 36\nJ & J SNACK FOODS CORP. AND SUBSIDIARIES\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS\n(in thousands)\nOpening\nCharged to\nClosing\nYear\nDescription\nBalance\nExpense\nDeductions\nBalance\nAllowance for estimated credit losses\n$ 2,158\n$ 1,428\n$ (1)\n$ 3,182\nAllowance for estimated credit losses\n$ 1,405\n$ 1,781\n$ 1,028 (1)\n$ 2,158\nAllowance for estimated credit losses\n$ 1,388\n$\n$ (1)\n$ 1,405\n(1) Write-offs of uncollectible accounts receivable."
}