{
    "cik": "788329",
    "company": "JOHNSON OUTDOORS INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-08",
    "period_of_report": "2023-09-29",
    "sic": "3949",
    "state_of_inc": "WI",
    "state_location": "WI",
    "fiscal_year_end": "0929",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/788329/0001140361-23-056923-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/788329/000114036123056923/jout-20230929.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/788329/0001140361-23-056923.txt",
    "filename": "788329_10K_2023_0001140361-23-056923.htm",
    "content": "ITEM 1. BUSINESS\nJohnson Outdoors is a leading global manufacturer and marketer of branded seasonal, outdoor recreation products used primarily for fishing from a boat, diving, paddling, hiking and camping. The Companys portfolio of well-known consumer brands has attained leading market positions due to innovation, marketing excellence, product performance and quality. Company values and culture support innovation in all areas, promoting and leveraging best practices and synergies within and across its subsidiaries to advance the Companys strategic vision set by executive management and approved by the Board of Directors. The Company is controlled by Helen P. Johnson-Leipold (Chairman and Chief Executive Officer), members of her family and related entities.\nThe Company was incorporated in Wisconsin in 1987 as successor to various businesses.\nFishing\nThe Companys Fishing segment key brands are: Minn Kota electric motors for quiet trolling or primary propulsion, marine battery chargers and shallow water anchors; Humminbird sonar and GPS equipment for fish finding, navigation and marine cartography; and Cannon downriggers for controlled-depth fishing.\nMinn Kota trolling motors and shallow water anchors and Cannon downriggers are designed and manufactured primarily at the Company's Mankato, Minnesota facility. Humminbird sonar and GPS equipment are designed and manufactured primarily in Eufaula, Alabama and Alpharetta, Georgia.\nFishing brands and related accessories are sold across the globe, with the majority of sales coming from North America through large outdoor specialty retailers, such as Bass Pro Shops and Cabelas; large retail store chains; distributors that service independent marine, sporting goods and internet dealers; and original equipment manufacturers (OEM) of boat brands such as Tracker, Skeeter and Ranger. The Company also sells direct to consumers via its Minn Kota, Humminbird and Cannon websites. Markets outside of North America are accessed through a network of independent international distributors. The Company markets its Fishing brands through several media channels, and is focused on innovation leadership, reliable technology, and quality products.\nCamping\nThe Companys Camping segment key brands are: Jetboil portable outdoor cooking systems and Eureka! consumer recreational camping products and commercial and military tents and accessories.\nDuring fiscal 2023, the Company sold the Military and Commercial Tent product lines of Eureka!, and developed plans to fully exit the Eureka! brand, which include liquidating inventory and winding down operations. Going forward, the Company expects to focus its resources in the Camping segment on marketing and further developing the Jetboil product line.\nJetboil portable outdoor cooking systems, single burner and two burner stoves, and accessories are sold in the U.S. and Canada, primarily to camping and backpacking specialty stores, sporting goods stores, internet retailers, and direct to consumer via the Jetboil brand website. Markets outside of North America are accessed through a network of independent international distributors. Marketing of Jetboil systems is focused on building brand awareness and leadership in product features and\ninnovation, primarily through digital marketing and social media. Jetboil products are designed at the Companys operating locations in Old Town, Maine, and manufactured by third party sources in Asia.\nEureka! consumer tents, camping stoves, and other recreational camping products are mid to high-price range products sold in the U.S. and Canada, primarily to camping and backpacking specialty stores, sporting goods stores, internet retailers and direct to consumer via the Eureka! brand website. The Companys consumer camping products are produced by third party manufacturing sources in Asia. Marketing of the brand is focused on building brand awareness and leadership in product features and innovation, primarily through digital marketing and social media. As noted above, the Company will exit this line of products and begin winding down operations in fiscal 2024.\nWatercraft Recreation\nThe Companys Watercraft Recreation segment designs and markets canoes and kayaks under the Old Town brand name for family recreation, touring and angling. Old Town products are manufactured at the Companys facility in Old Town, Maine.\nWatercraft Recreation accessory brands, including Carlisle branded paddles, are produced primarily by third party sources located in North America and Asia. The company's personal flotation devices are manufactured by third party sources located in Asia and are sold under the Old Town brand.\nThe Companys kayaks, canoes and accessories are sold through multiple channels primarily in the U.S. and Canada with an emphasis on independent specialty dealers and outdoor specialty chain retailers. The Company also sells products direct to consumers via the Old Town website, and internet retailer sites.\nThe Companys Watercraft Recreation business competes in the mid to high-end of the product category by introducing product innovations, creating quality products and by focusing on the product-specific needs of each marketing channel. Marketing of brands is focused on building brand awareness and leadership in product features and innovation, primarily through digital marketing and social media.\nDiving\nThe Company manufactures and markets underwater diving products for recreational divers, which it sells and distributes under the SCUBAPRO brand name.\nThe Company markets a complete line of underwater diving and snorkeling equipment, including regulators, buoyancy compensators, dive computers and gauges, wetsuits, masks, fins, snorkels and accessories. SCUBAPRO diving equipment is marketed to the premium recreational segment and high-performance technical diving market. Products are sold via select distribution to independent specialty dive stores worldwide. These specialty dive stores generally provide a wide range of services to divers, including regular maintenance, product repair, diving education and travel programs. The Company also sells diving gear direct to consumers via the SCUBAPRO website and to dive training centers, resorts and public safety units.\nThe Company manufactures regulators, dive computers, gauges, and instruments at its Italian and Indonesian facilities. The Company designs and develops buoyancy compensators, neoprene goods, diving and snorkeling soft goods, proprietary materials, and other components from third party contract manufacturers.\nThe Companys consumer communication focuses on building brand awareness and highlighting exclusive product features and consumer benefits of its product lines. The Companys communication and distribution strategies reinforce the SCUBAPRO brands position as the industrys quality and innovation leader. The Company markets its equipment via websites, through social media, through information and displays in dive specialty stores, and in diving magazines.\nFinancial Information for Business Segments\nAs noted above, the Company has four reportable business segments. See Note 13 to the consolidated financial statements included elsewhere in this report for financial information concerning each business segment.\nInternational Operations\nSee Note 13 to the consolidated financial statements included elsewhere in this report for financial information regarding the Companys domestic and international operations. See Note 1, subheading Foreign Operations and Related Derivative Financial Instruments, to the consolidated financial statements included elsewhere in this report, along with the information under Risk Factors below, for information regarding risks related to the Companys foreign operations.\nResearch and Development\nThe Company commits significant resources to new product research and development in each of its business segments. Fishing conducts its product research, design, engineering and software development activities at its locations in Mankato and Little Falls, Minnesota; Alpharetta, Georgia; Toronto, Canada; and Eufaula, Alabama. Diving maintains research and development facilities in Zurich, Switzerland and Casarza Ligure, Italy. Research and development activities for Watercraft Recreation are performed in Old Town, Maine and Racine, Wisconsin. Product research, design and innovation for Camping products are conducted at the Company's Racine, Wisconsin, and Old Town, Maine locations.\nThe Company expenses research and development costs as incurred, except for software development for new electronics products and bathymetry data collection and processing. These software development and bathymetry data collection and processing costs are capitalized once technological feasibility is established and then amortized over the expected useful life of the software or database. The amounts expensed by the Company in connection with research and development activities for each of the last three fiscal years are set forth in the Companys Consolidated Statements of Operations included elsewhere in this report.\nIndustry and Competitive Environment\nThe Company believes its products compete favorably on the basis of product innovation, product performance and marketing support and, to a lesser extent, price.\nFishing: Minn Kotas primary competitors in the electric trolling motors business are Motor Guide® and Lowrance™, both owned by Brunswick Corporation, Garmin™ and Power-Pole. In addition, Power-Pole is Minn Kota's main competitor in the shallow water anchor business. Competition in both businesses is focused on technological innovation, product quality and durability as well as product features and benefits for fishing.\nHumminbirds main competitors in the market for on-boat electronics are Garmin™, Lowrance™, and Raymarine®. Competition in this business is primarily focused on the quality of sonar imaging and display, easy to use graphical interfaces as well as the integration of mapping and GPS technology. Humminbird's competitors in marine cartography include Navionics®, owned by Garmin, and C-Map®, owned by Brunswick Corporation. Competition in this business focuses primarily on quality of data and quantity of available charts for inland lakes and ocean shoreline.\nCannons main competitors in the downrigger market are Big Jon Sports®, Walker and Scotty®. Competition in this business primarily focuses on ease of operation, speed and durability.\nCamping: The Companys portable outdoor cooking systems compete in the specialty and higher end performance backpacking and camping markets. The primary competitor in portable outdoor cooking systems is MSR®. Competition in this market is based on product size and weight, ease of use, reliability and performance.\nThe Companys Camping brands and products compete in the sporting goods and specialty segments of the Camping market. Competitive brands with a strong position in the sporting goods channel include Coleman® and private label brands. The Company also competes with specialty companies such as Kelty®, The North Face®, Marmot® and Big Agnes® on the basis of materials and innovative designs for consumers who want performance products priced at a value.\nWatercraft Recreation: The Company primarily competes in this segment in the kayak and canoe product categories of the paddlesports market. The Companys main competitors in this market are Hobie Cat®, Pelican International Inc., Wenonah Canoe, Jackson Kayak and Legacy Paddlesports™, each of which competes on the basis of their products design, performance, quality and price.\nDiving: The main competitors in the Diving segment include Aqua Lung®, Suunto®, Atomic Aquatics, Oceanic, Cressi and Mares®. Competitive advantage in the life support product category of this segment, which consists of regulators, dive computers, and buoyancy compensators, is a function of product innovation, performance, quality and safety. Competition in the general diving product category of fins, masks, snorkels and wetsuits is characterized by low barriers to entry and numerous competitors who compete on the basis of product innovation, performance, quality and price.\nBacklog\nUnfilled orders for future delivery of products varies as a result of numerous factors impacting the Company (including those described in the section titled Risk Factors below) and because of the non-binding nature of such orders, the Company does not believe that backlog information is material to the understanding of its business.\nEmployees and Human Capital Resources\nAt September 29, 2023, the Company had approximately 1,400 regular, full-time employees, of which approximately 1,100 were employed in the United States and approximately 300 were employed outside of the United States. Approximately 50 or 4% were represented by a collective bargaining agreement, all of whom are located at our facilities in Batam, Indonesia. In recent years, we have not experienced any significant work slowdowns, stoppages, or other labor disruptions. The Company considers its employee relations to be excellent. Temporary employees are utilized primarily to manage peaks in the seasonal manufacturing of products.\nThe Company remains committed to areas of work place safety, product quality and customer satisfaction. Successful execution of our mission is dependent on attracting, developing and retaining key employees and members of our management team, as well as providing competitive pay and benefits.\nPatents, Trademarks and Proprietary Rights\nThe Company holds patents for various of the products it sells and regularly files applications for patents. The Company has numerous trademarks and trade names which it considers important to its business, many of which are noted in this report. Historically, the Company has vigorously defended its intellectual property rights and expects to continue to do so.\nSupply Chain and Sourcing of Materials\nThe Company manufactures some products that use parts or materials that, due to geographical distance, limited supplier capacity or availability or competing demands for such parts or materials, are only available in a cost effective manner from a single vendor or require the Company to place orders several months in advance of required delivery.\nThe Company attempts to mitigate product availability and these supply chain risks when possible through the purchase of safety stock, use of forecast-based supply contracts, and, to a lesser extent, with just in time inventory deliveries or supplier-owned inventory located close to the Companys manufacturing locations. In doing so, the Company strives to balance the businesses need to maintain adequate inventory levels with the cost of holding such inventory by manufacturing to forecast for high volume products, utilizing build-to-order strategies wherever possible, and by having contract-manufactured products delivered to customers directly from the supplier. The Company also seeks to manage its inventory through on-going product design and logistical initiatives with its suppliers to reduce lead times.\nSeasonality\nThe Companys products in each of its business segments are primarily warm-weather, outdoor recreation-related, which has historically resulted in seasonal variations in sales and profitability for the Company. This seasonal variability was traditionally due to customers increasing their inventories in the quarters ending March and June, which is the typical primary selling season for the Companys outdoor recreation products, with lower inventory volumes during the quarters ending September and December. The Company mitigates the seasonality of its businesses somewhat by encouraging customers to purchase and take delivery of products more evenly through the year. The following table shows, for the past three fiscal years, the total consolidated net sales and operating profit or loss of the Company for each quarter, as a percentage of the total year. As reflected in the table below and as described in greater detail below in the Management's Discussion and Analysis of Financial Condition and Results of Operations, for fiscal 2023 the impact of seasonality on the Company's business returned to more traditional levels experienced by the Company prior to the COVID-19 pandemic. As a result of the pandemic, the Company's typical seasonality fluctuations among fiscal quarters became disrupted by increased demand for Company products that impacted each of the Company's fiscal quarters during 2022 and 2021. This demand was also impacted by the lingering effects that the pandemic had on the Company's supply chain and the pricing and availability of raw materials and components during fiscal 2022.\nFiscal Year\n2023 2022 2021\nQuarter Ended Net\nSales Operating\nProfit Net\nSales Operating\nProfit Net\nSales Operating\nProfit\nDecember 27 % 47 % 21 % 21 % 22 % 22 %\nMarch 30 % 97 % 26 % 23 % 27 % 32 %\nJune 28 % 149 % 27 % 36 % 29 % 34 %\nSeptember 15 % (193) % 26 % 20 % 22 % 12 %\n100 % 100 % 100 % 100 % 100 % 100 %\nEnvironment and Climate Change\nThe Company is subject to various supranational, federal, state and local environmental laws, ordinances, regulations, and other requirements of governmental authorities. We believe we comply with such laws and regulations. Expenditures on environmental compliance have not had, and we believe in the future, are not expected to have, a material adverse effect on the Companys capital expenditures, earnings or competitive position. We do not believe that any direct or indirect consequences of legislation related to climate change will have a material adverse effect on our operating costs, facilities or products. However, risk of environmental liability and charges associated with maintaining compliance with environmental laws is inherent in the nature of the Companys business and there is no assurance that material liabilities or charges could not arise.\nAvailable Information\nThe Company maintains a website at www.johnsonoutdoors.com. On its website, the Company makes available, free of charge, its Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports, as soon as reasonably practical after the reports have been electronically filed or furnished to the Securities and Exchange Commission. In addition, the Company makes available on its website, free of charge, its (a) proxy statement for its annual meeting of shareholders; (b) Code of Business Conduct; (c) Code of Ethics for its Chief Executive Officer and Senior Financial and Accounting Officers; (d) the charters for the following committees of the Board of Directors: Audit; Compensation; Executive; and Nominating and Corporate Governance; and (e) Corporate Governance Guidelines, Insider Trading Policy and Incentive Compensation Recovery Policy. Except as specifically provided herein, the Company is not including the information contained on or available through its website as a part of, or incorporating such information by reference into, this Annual Report on Form 10-K. This report includes all material information about the Company that is included on the Companys website and is otherwise required to be included in this report. Copies of any materials the Company files with the Securities and Exchange Commission (SEC) can also be obtained free of charge through the SECs website at www.sec.gov. The SECs Public Reference Room can be contacted at 100 F Street, N.E., Washington, D.C. 20549, or by calling 1 (800) 732-0330. ITEM 1A. RISK FACTORS\nThe risks described below are not the only risks we face. Additional risks that we do not yet know of or that we currently think are immaterial may also impair our future business operations. If any of the events or circumstances described in the following risks actually occur, our business, financial condition or results of operations could be materially adversely affected. In such cases, the trading price of our common stock could decline.\nOperational Risk Factors\nOur net sales and profitability depend on our ability to continue to conceive, design and market products that appeal to our consumers.\nOur business depends on our ability to continue to conceive, design, manufacture and market new products and upon continued market acceptance of our product offering. As described elsewhere in this Report, product research and development is an important component of our success and our market strategy. Rapidly changing consumer preferences and trends make it difficult to predict how long consumer demand for our existing products will continue or what new products will be successful. A decline in consumer demand for our products, our failure to develop new products on a timely basis in anticipation of changing consumer preferences or the failure of our new products to achieve and sustain consumer acceptance could reduce our net sales and profitability.\nIntellectual property disputes relating to our products could increase our costs.\nOur industry is susceptible to litigation regarding patent infringement and infringement of other intellectual property rights. We could be either a plaintiff or a defendant in trademark, patent and/or other intellectual property infringement or misappropriation claims and claims of breach of license from time to time. The prosecution or defense of any intellectual property litigation is both costly and disruptive of the time and resources of our management and product development teams, even if the claim or defense against us is without merit. The scope of any patent or other intellectual property to which we have or may obtain rights also may not prevent others from developing and selling competing products. The validity and breadth of claims covered in patents and other intellectual property involve complex legal and factual questions, and the resolution of such claims may be highly uncertain, lengthy and expensive. In addition, our patents or other intellectual property may be held invalid upon challenge, or others may claim that we have improperly or invalidly sought patent or other intellectual property protection for our technology, thus exposing us to direct or counter claims in any patent or intellectual property proceeding. We could also be required to pay substantial damages or settlement costs to resolve intellectual property litigation. Furthermore, we may rely on trade secret law to protect technologies and proprietary information that we cannot or have chosen not to patent. Trade secrets, however, are difficult to protect. Although we attempt to maintain protection through confidentiality agreements with necessary personnel, contractors and consultants, we cannot guarantee that such contracts will not be breached. In the event of a breach of a confidentiality agreement or the divulgence of proprietary information, we may not have adequate legal remedies to maintain our trade secret protection. Litigation to determine the scope of intellectual property rights, even if ultimately successful, could be costly and could divert managements attention away from the Companys business. Any of these negative events could adversely affect our profitability or operating results.\nProduct recalls and other claims could affect our financial position and results of operations.\nAs a manufacturer and distributor of consumer products, we could be required to repurchase or recall one or more of our products if they are found to not meet quality or safety standards or be defective. A repurchase or recall of our products could be costly to us and could damage the reputation of our brands. If we were required to remove, or voluntarily remove our products from the market, our reputation could be tarnished and we might have large quantities of finished products that we could not sell. As a result, product recalls could have a material adverse effect on our business, results of operations and financial condition.\nWe may experience difficulties in integrating strategic acquisitions.\nWe have, as part of our strategy, historically pursued strategic acquisitions. The pursuit of future growth through acquisitions involves significant risks that could have a material adverse effect on our business. Risks associated with integrating strategic acquisitions include, but are not limited to:\nunanticipated costs relating to the integration of acquired businesses may increase our expenses and reduce our profitability;\ndifficulties in achieving planned cost savings and synergies may increase our expenses;\nunanticipated management or operational problems or liabilities may adversely affect our profitability and financial condition; and/or\nbreaches of the representations or warranties or other violations of the contractual obligations required by the acquisition agreement of other parties to the acquisition transaction and any contractual remedies related thereto may not adequately protect or compensate us.\nWe are dependent upon certain key members of management.\nOur success will depend to a significant degree on the abilities and efforts of our senior management. Moreover, our success depends on our ability to attract, retain and motivate qualified management, marketing, technical and sales personnel. These people are in high demand and often have competing employment opportunities. The labor market for skilled employees is highly competitive and we may lose key employees or be forced to increase their compensation to retain these people. Employee turnover could significantly increase our recruitment, training and other related employee costs. The loss of key personnel, or the failure to attract qualified personnel, could have a material adverse effect on our business, financial condition or results of operations.\nWe rely on our credit facilities to provide us with sufficient working capital to operate our business.\nBecause of the historic seasonal nature of our business, we have from time to time relied upon our credit facilities to provide us with adequate working capital to operate our business. To the extent we again become more dependent upon our credit facilities to fund our operations, if our lenders reduce or terminate our access to amounts under our credit facilities, we may not have sufficient capital to fund our working capital needs and/or we may need to secure additional capital or financing to fund our working capital requirements or to repay outstanding debt under our credit facilities. We can make no assurance that we\nwill be successful in ensuring our availability of amounts under our credit facilities when they are needed or in connection with raising additional capital and that any amount, if raised, will be sufficient to meet our cash flow requirements. In the event we do not have available cash balances on hand for funding future operations, and if we are not able to maintain our borrowing availability under our credit facilities at that time and/or raise additional capital when needed, we may be forced to sharply curtail our efforts to manufacture and promote the sale of our products or to curtail our operations.\nOur debt covenants may limit our ability to complete acquisitions, incur debt, make investments, sell assets, merge or complete other significant transactions.\nOur credit facilities and certain other of our debt instruments include limitations on a number of our activities in the event of a default, and in some cases regardless of whether a default has occurred, including our ability to:\nincur additional debt;\ncreate liens on our assets or make guarantees;\nmake certain investments or loans; or\ndispose of or sell assets, make acquisitions above certain amounts or enter into a merger or similar transaction.\nAlthough in recent periods we have not had to borrow funds under our credit facilities, we still are required to comply with certain restrictive covenants in our credit facilities, any of which may limit our ability to engage in acts that may be in our best long term interests. Additionally, a breach of any of the restrictive covenants in our credit facilities could result in a default under these facilities. If a default occurs while we have borrowing amounts outstanding, the lenders under our credit facilities may elect to declare all outstanding borrowings, together with accrued interest, to be immediately due and payable, to terminate any commitments they have to provide further borrowings and to exercise any other rights they have under the facilities or applicable law.\nWe may be subject to disruptions or failures in our information technology systems and network infrastructures that could have a material adverse effect on our business.\nWe rely on the efficient and uninterrupted operation of complex information technology systems and network infrastructures to operate our business. We also hold data in various company-owned and third party data center facilities upon which our business depends. A disruption, infiltration, breach or failure of these information technology systems or any of these data centers as a result of software or hardware malfunctions, system implementations or upgrades, computer viruses, third-party security breaches, employee error, theft or misuse, malfeasance, power disruptions, natural disasters or accidents could cause breaches of data security, loss of intellectual property and critical data and the release and misappropriation of sensitive competitive information. Any of these events could result in the loss of key information, impair our production and supply chain processes, harm our competitive position, damage our reputation with customers, cause us to incur significant costs to remedy any damages and ultimately materially and adversely affect our business, results of operations and financial condition. While we have implemented a number of protective measures, such measures may not be adequate or implemented properly to prevent or fully address the adverse effect of such events.\nOur inability to manage our inventory levels could have a material adverse effect on our business.\nTo ensure we are able to meet customer demand in a highly seasonal business, and to account for long lead times or disruptions in supply chain, we may at times purchase components or materials in advance of normal timing for issuing purchase orders or at greater levels than existing purchase orders on hand. If we or our customers overestimate demand, or if demand is impacted by factors outside of our customers' control, and anticipated sales ultimately do not materialize or are lower than expected, we may experience higher inventory carrying and operating costs and/or increased excess or obsolete inventory or reserve charges, which would negatively impact our results of operations and profitability. Moreover, inventory levels in excess of customer demand may result in lower than planned financial performance. Alternatively, if we underestimate demand for our products, we may experience inventory shortages resulting in delays in fulfilling customer demands while we work to replenish inventory levels, missed sales and/or lost revenues.\nRegulatory Risk Factors\nUncertainty over global tariffs, or the financial impact of tariffs, may negatively affect our results.\nChanges in U.S. domestic and global tariff frameworks over the last three years have increased our costs of producing goods and resulted in additional risks to our supply chain. More tariff changes are also possible. We have developed strategies to mitigate, in part, previously implemented and, in some cases, proposed tariff increases, but there is no assurance we will be able to continue to mitigate the impact of tariff increases in substantial part on our financial and operating results. Further,\nuncertainties about future tariff changes could result in mitigation actions undertaken by us that could prove to be detrimental to our business and our relationships with our customers and suppliers. The scope of the tariffs and the rates at which they are implemented may continue to fluctuate and change in an unpredictable manner that further complicates our ability to implement mitigation actions.\nThe effective tax rate of the Company may be negatively impacted by future changes to tax laws in global jurisdictions in which we operate.\nChanges in tax laws or tax rulings could have a material impact on our effective tax rate. Many countries in the European Union, as well as a number of other countries and organizations such as the Organization for Economic Cooperation and Development, are actively considering changes to existing tax laws. Certain proposals could include recommendations that could increase our tax obligations in many countries where we do business. Any changes in the taxation of our activities in such jurisdictions may result in a material increase in our effective tax rate.\nWe are subject to environmental, climate change, safety and human rights regulations and legislation.\nWe are subject to supranational, federal, state, local and foreign laws and other legal requirements related to the generation, storage, transport, treatment and disposal of materials as a result of our manufacturing and assembly operations. These laws include the Resource Conservation and Recovery Act (as amended), the Clean Air Act (as amended) and the Comprehensive Environmental Response, Compensation and Liability Act (as amended), as well as similar laws in foreign jurisdictions. Risk of environmental liability and changes associated with maintaining compliance with environmental laws is inherent in the nature of our business and there is no assurance that material liabilities or changes would not arise.\nWe are also subject to various supranational, federal, state and local environmental, laws, ordinances, regulations and other legislation or requirements of governmental authorities as it relates to climate change. We believe we comply with such laws and regulations. We do not believe that any direct or indirect consequences of legislation related to climate change will have a material adverse effect on our operating costs, facilities, or products. However, evolving regulatory and legislative measures related to protecting against climate change could ultimately pose a risk to our business by influencing the buying patterns of our customers or increasing internal compliance costs.\nThe Company is also subject to the requirement of Section 1502 of the Dodd-Frank Wall Street Reform and Consumer Protection Act and SEC rules related thereto to conduct due diligence and disclose and report on whether certain minerals and metals, known as conflict minerals, are contained in the Companys products and whether they originate from the Democratic Republic of Congo (DRC) and adjoining countries. We may face reputational challenges if we determine that certain of our products contain minerals not determined to be conflict free or if we are unable to sufficiently verify the origins of all conflict minerals used in our products through the procedures we implement.\nOur failure to adequately protect personal information could have a material adverse effect on our business.\nA wide variety of local, state, national, and international laws, directives and regulations apply to the collection, use, retention, protection, disclosure, transfer, and other processing of personal data (including with respect to the European Union's General Data Protection Regulation and U.S. state laws such as the California Consumer Privacy Act). These data protection and privacy-related laws and regulations continue to evolve and may result in ever-increasing regulatory and public scrutiny and escalating levels of enforcement and sanctions and increased costs of compliance. Our failure to comply with applicable laws and regulations, or to protect such data, could result in enforcement actions against us, including fines, imprisonment of company officials and public censure, claims for damages by end-customers and other affected individuals, damage to our reputation and loss of goodwill (both in relation to existing end-customers and prospective end-customers), any of which could have a material adverse effect on our operations, financial performance, and business. Changing definitions of personal data and personal information, within the European Union, the United States, and elsewhere may limit or inhibit our ability to operate or expand our business, including limiting strategic partnerships that may involve the sharing of data. The evolving data protection regulatory environment may require significant management attention and financial resources to analyze and modify our information technology infrastructure to meet these changing requirements all of which could reduce our operating margins and impact our operating results and financial condition.\nMarket and Economic Risk Factors\nCompetition, consolidation and financial distress in our markets could reduce our net sales, profitability and cash flows.\nWe operate in highly competitive markets. We compete with several large domestic and foreign companies such as Brunswick, Garmin, and Aqua Lung, with private label products sold by many of our retail customers and with other producers of outdoor\nrecreation products. Some of our competitors have longer operating histories, stronger brand recognition and greater financial, technical, marketing and other resources than us. In addition, due to limited barriers to entry in some of the product industries we engage in, we may face competition from new participants in our markets or from existing participants developing and introducing new products into our market segments. Further, we experience price competition for our products, and competition for shelf space at retailers, all of which may increase in the future. Consolidation of our retail markets could result in fewer but larger retail customers, which may further result in lower selling prices or reduced sales volumes of our products or greater competition for shelf space in these retail markets. Further, financial distress or bankruptcies in our retail markets could negatively impact our operating results and cash flows. If we cannot compete in our product markets successfully in the future, our net sales, profitability and cash flows will likely decline.\nGeneral economic conditions affect the Companys results.\nOur revenues are affected by economic conditions and consumer confidence worldwide, but especially in the United States and Europe. In times of economic uncertainty, consumers tend to defer expenditures for discretionary items, which affects demand for our products. Moreover, our businesses are cyclical and seasonal in nature, and their success is impacted by general economic conditions and specific economic conditions affecting the regions and markets we serve, the overall level of consumer confidence in the economy and discretionary income levels. Any substantial deterioration in general economic conditions that diminishes consumer confidence or discretionary income can reduce our sales and adversely affect our financial results. Moreover, declining economic conditions create the potential for future impairments of goodwill and other intangible and long-lived assets that may negatively impact our financial condition and results of operations. Various uncertainties tied to economic conditions, including significant adverse changes in business climate, adverse actions by regulators, unanticipated competition, loss of key customers, a downturn in the economy or in discretionary income levels or changes in consumer preferences could impact the expected cash flows to be generated by an asset or group of assets, and may result in an impairment of those assets. The impact of weak consumer credit markets, corporate restructurings, layoffs, prolonged high unemployment rates, declines in the value of investments and residential real estate, higher fuel prices and increases in federal and state taxation all can negatively affect our operating results.\nAs noted above, because a substantial majority of our net revenue is generated through discretionary spending by consumers for our outdoor recreation products, a downturn in the economy resulting from prolonged supply chain disruptions or labor shortages, a significant increase in inflation rates (including in connection with rising interest rates through government action to fight inflationary trends), or a reduction in consumer confidence in the U.S. economy may have a material adverse impact on our business, financial condition and results of operations, as consumers generally reduce their discretionary spending during such periods. Inflation rates have increased and may continue to rise or stay elevated for some time, all of which negatively impact consumer confidence and discretionary spending patterns. Additionally, inflationary trends and uncertainties in the economic climate in the United States and elsewhere could have a similar negative impact on the rate and amounts of purchases by our current and potential customers, create price inflation for our products, or otherwise have a negative impact on our expenses, gross margins and revenues, all of which could hinder our growth.\nA limited number of our shareholders can exert significant influence over the Company.\nAs of September 29, 2023, Helen P. Johnson-Leipold, members of her family and related entities (hereinafter the Johnson Family), held approximately 75% of the voting power of both classes of our common stock taken as a whole. This voting power would permit these shareholders, if they chose to act together, to exert significant influence over the outcome of shareholder votes, including votes concerning the election of directors, by-law amendments, possible mergers, corporate control contests and other significant corporate transactions. Moreover, certain members of the Johnson Family have entered into a voting trust agreement covering approximately 99% of our outstanding class B common shares. This voting trust agreement permits these shareholders, if they continue to choose to act together, to exert significant influence over the outcome of shareholder votes, including votes concerning the election of directors, by-law amendments, possible mergers, corporate control contests and other significant corporate transactions.\nOur shares of common stock are thinly traded and our stock price may be volatile.\nBecause our common stock is thinly traded, its market price may fluctuate significantly more than the stock market in general or the stock prices of similar companies, which are exchanged, listed or quoted on NASDAQ or another stock exchange. We believe there are approximately 5,387,000 shares of our Class A common stock held by non-affiliates as of September 29, 2023. Thus, our common stock will be less liquid than the stock of companies with broader public ownership, and as a result, the trading price for our shares of common stock may be more volatile. Among other things, trading of a relatively small volume of our common stock may have a greater impact on the trading price for our stock than would be the case if our public float were larger.\nOur stock price is volatile and our shareholders may not be able to resell shares of Class A Common Stock at or above the price they paid.\nThe trading price of our Class A Common Stock is highly volatile and could be subject to wide fluctuations in response to various factors, some of which are beyond our control. These factors include:\nannouncements relating to our earnings trends or with respect to any cost-cutting actions or other strategic transactions involving Johnson Outdoors;\nannouncements relating to, and disruptions in, the sourcing, timing, availability and cost of raw materials and components necessary for the production of our products;\nannouncements relating to product development efforts of Johnson Outdoors or competitors;\nannouncements relating to the receipt, modification or termination of customer or supplier contracts, including with respect to any government contracts or grants;\nprevailing economic conditions;\nbusiness disruptions caused by weather events, pandemics, or other natural disasters;\ndisputes concerning Johnson Outdoors' or its competitors' intellectual property or other proprietary rights;\nsales of our Class A Common Stock by our executive officers and directors or our significant shareholders in the future;\nthe lack of an active, liquid, and orderly market in our Class A Common Stock;\nfluctuations in our quarterly operating results; and\nthe issuance of new or changed securities analysts' reports or recommendations regarding the shares of our Class A Common Stock\nIn addition, the stock markets in general, and the markets for equity securities in companies principally operating in the outdoor leisure or recreational product markets, have experienced periods of high volatility that have been often unrelated to the operating performance of the issuer. These broad market fluctuations may adversely affect the trading price or liquidity of our Class A Common Stock.\nSources of and fluctuations in market prices of raw materials can affect our operating results.\nThe primary raw materials we use in manufacturing our products are metals, resins, electronic components, and packaging materials. These materials are generally available from a number of suppliers, but traditionally we have chosen to concentrate our sourcing with a limited number of vendors for each commodity or purchased component. Although we believe our sources of raw materials are reliable and adequate for our current needs, adverse events in our supply chain may impact the pricing or availability of required raw materials and components to manufacture our products.\nOur profitability is also affected by significant fluctuations in the prices of the raw materials and components we use in our products, including the effect of fluctuations in foreign currency exchange rates on raw materials and purchased components. We may not be able to pass along any price increases in our raw materials or other component costs to our customers. As a result, an increase in the cost of raw materials, labor or other costs associated with the manufacturing of our products could increase our costs of sales and reduce our gross margins.\nFinancial distress in supply chain and shortage of raw materials or components of supply.\nDeteriorating industry conditions can adversely affect our supply base. Lower production levels at our major suppliers and volatility in certain raw material and energy costs may result in severe financial distress among many companies within our supply base, which may result in issues impacting the sourcing, timing, availability and cost of raw materials and components necessary to manufacture our products. Financial distress within our supply base and/or our suppliers inability to obtain credit from lending institutions could lead to commercial disputes and possible supply chain interruptions to our business. In addition, potential adverse industry conditions may require us to provide financial assistance or other measures to ensure uninterrupted production of key components or materials used in the production of our products which could have a material adverse effect on our existing and future revenues and net income.\nAdditionally, in the event of catastrophic acts of nature such as fires, tsunamis, hurricanes and earthquakes or a rapid increase in production demands, either we, or our suppliers may experience supply shortages of raw materials or components. This could be caused by a number of factors, including a lack of production line capacity or manpower or working capital constraints. As our industry consolidates its supply base in order to manage the costs of purchased goods and services, there is greater dependence on fewer sources of supply for certain components and materials used in our products, which could increase the possibility of a supply shortage of any particular component. If we or one of our own suppliers experience a supply shortage, we may become unable to produce the affected products if we cannot procure the necessary components from another source. Such production interruptions could impede a ramp-up in production and could have a material adverse effect on our business, results of operations and financial condition.\nWe consider the production capacities and financial condition of suppliers in our selection process, and expect that they will meet our delivery requirements. However, there can be no assurance that strong demand, capacity limitations, shortages of raw materials, labor disputes, freight capacity or other problems impacting our suppliers will not result in any shortages or delays in the supply of components to us.\nCurrency exchange rate fluctuations could adversely affect the Companys results.\nWe have significant foreign operations, for which the functional currencies are denominated primarily in euros, Swiss francs, Hong Kong dollars and Canadian dollars. As the values of the currencies of the foreign countries in which we have operations increase or decrease relative to the U.S. dollar, the sales, expenses, profits, losses, assets and liabilities of our foreign operations, as reported in our consolidated financial statements, increase or decrease, accordingly. Approximately 14% of our revenues for the year ended September 29, 2023 were denominated in currencies other than the U.S. dollar. Approximately 6% were denominated in euros and approximately 6% were denominated in Canadian dollars with the remaining 2% denominated in various other foreign currencies. We may mitigate a portion of the impact of fluctuations in certain foreign currencies on our operations through the purchase of foreign currency swaps, forward contracts and options to hedge known commitments denominated in foreign currencies or to reduce the risk of changes in foreign currency exchange rates on foreign currency borrowings.\nBecause we rely on foreign suppliers and we sell products in foreign markets, we are susceptible to numerous international business risks that could increase our costs or disrupt the supply of our products.\nOur international operations subject us to risks, including:\neconomic and political instability;\nrestrictive actions by foreign governments, including with respect to tariffs or trade policies;\nopportunity costs and reputational damage related to the presence of counterfeit versions of the Companys products in such foreign markets;\ngreater difficulty enforcing intellectual property rights and weaker laws protecting intellectual property rights;\nchanges in tariffs, import duties or import or export restrictions;\ntimely shipping of product and unloading of product, including the timely rail/truck delivery to our warehouses and/or a customers warehouse of our products;\ncomplications in complying with the laws and policies of the United States affecting the importation of goods, including tariffs, duties, quotas and taxes;\nrequired compliance with U.S. laws that impact the Companys operations in foreign jurisdictions that do not impact local operating companies; and\ncomplications in complying with trade and foreign tax laws.\nGeneral Risk Factors\nCyber security vulnerabilities, threats and more sophisticated and targeted computer crime could pose a risk to our systems, networks, products, solutions, services and data.\nIncreased global cyber security vulnerabilities, threats, computer viruses and more sophisticated and targeted cyber-related attacks, as well as cyber security failures resulting from human error and technological errors, pose a risk to our systems, products and data as well as potentially to our employees, customers and suppliers data and systems that may ultimately impact us. We attempt to mitigate these risks by employing a number of measures, including employee training, monitoring and testing, and maintenance of protective systems and contingency plans, but we remain potentially vulnerable to additional known or unknown threats. There is no assurance the impact from such threats will not be material to our financial results or reputation and it could result in security breaches, theft, lost or corrupted data, misappropriation of sensitive, confidential or personal data or information, loss of trade secrets and commercially valuable information, production downtimes and operational disruptions, any of which may adversely affect our profitability or operating results.\nFuture terror attacks, war, natural disasters or other catastrophic events beyond our control could negatively impact our business.\nTerror attacks, war or other civil disturbances, natural disasters and other catastrophic events could lead to economic instability and decreased demand for our products, which could negatively impact our business, financial condition, results of operations and cash flows. In the past, terrorist attacks have caused instability in global financial markets and the industries in which we compete and have negatively affected spending on consumer discretionary products. In addition, our facilities are located\nthroughout the world and could be subject to damage from terrorism incidents or from fires, floods, earthquakes or other natural or man-made disasters. Terrorist incidents could also lead to increased border security which could in turn negatively impact our global supply chain by causing shipping delays or shortages in key materials or components, increasing the cost of such goods or requiring us to keep greater inventories, any of which may adversely impact our business, results of operations, financial condition or cash flows.\nOur business is susceptible to adverse weather conditions or events.\nOur success is in part affected by adverse weather conditions, including fires, floods, tornadoes, severe cold and other natural disasters. Such events have the tendency to create fluctuations in demand for our products which may increase our expenses and reduce our profitability. Moreover, our profitability is affected by our ability to successfully manage our inventory levels and demand for our products, which, in part depends upon the efficient operation of our production and delivery systems. These systems are vulnerable to damage or interruption from the aforementioned natural disasters. Such natural disasters could adversely impact our ability to meet delivery requirements of our customers, which may result in our need to incur extra costs to expedite production and delivery of product to meet customer demand. Any of these events could negatively impact our profitability. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot Applicable ITEM 2. PROPERTIES\nThe Company maintains leased and owned manufacturing, warehousing, distribution and office facilities throughout the world. The Company believes that its facilities are well maintained and have capacity adequate to meet its current needs.\nSee Note 5 to the consolidated financial statements included elsewhere in this report for a discussion of the Companys lease obligations.\nAs of September 29, 2023, the Companys principal manufacturing (identified with an asterisk) and other locations are:\nAlpharetta, Georgia (Fishing)\nAntibes, France (Diving)\nBatam, Indonesia* (Diving)\nBinghamton, New York (Camping)\nBurlington, Ontario, Canada (Fishing, Camping, Watercraft Recreation)\nCasarza Ligure, Italy* (Diving)\nChai Wan, Hong Kong (Diving)\nChatswood, Australia (Diving)\nEl Cajon, California (Diving)\nEufaula, Alabama* (Fishing)\nLittle Falls, Minnesota (Fishing)\nMankato, Minnesota* (Fishing)\nMexicali, Mexico* (Fishing)\nOld Town, Maine* (Watercraft Recreation)\nToronto, Ontario, Canada (Fishing)\nNuremberg, Germany (Diving)\nZurich, Switzerland (Diving)\nThe Companys corporate headquarters is located in a facility in Racine, Wisconsin. ITEM 3. LEGAL PROCEEDINGS\nIn the normal course of business, we may be involved in various legal proceedings from time to time. As of the date of the filing of this Report, we are not involved in any litigation involving amounts deemed to be material to the business or financial condition of the Company. ITEM 4. MINE SAFETY DISCLOSURES\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nCertain information with respect to this item is included in Notes 9 and 10 to the Companys consolidated financial statements included elsewhere in this report. The Companys Class A common stock is traded on the NASDAQ Global Select MarketSM under the symbol: JOUT. There is no public market for the Companys Class B common stock. However, the Class B common stock is convertible at all times at the option of the holder into shares of Class A common stock on a share for share basis. As of September 29, 2023, the Company had 402 holders of record of its Class A common stock and 19 holders of record of its Class B common stock. We believe the number of beneficial owners of our Class A common stock on that date was substantially greater.\nA summary of the high and low closing prices for the Companys Class A common stock during each quarter of the years ended September 29, 2023, September 30, 2022 and October 1, 2021 is as follows:\nFirst Quarter Second Quarter Third Quarter Fourth Quarter\n2023 2022 2021 2023 2022 2021 2023 2022 2021 2023 2022 2021\nStock prices:\nHigh $ 68.18 $ 115.87 $ 113.21 $ 71.49 $ 95.60 $ 148.50 $ 64.24 $ 82.48 $ 154.09 $ 60.13 $ 73.32 $ 122.23\nLow 46.93 92.82 83.60 58.93 77.44 109.00 56.53 59.04 117.92 52.01 50.54 105.51\nDividends\nThe Companys Articles of Incorporation provide that no dividend, other than a dividend payable in shares of the Companys common stock, may be declared or paid upon the Class B common stock unless such dividend is declared or paid upon both classes of common stock. Whenever a dividend (other than a dividend payable in shares of Company common stock) is declared or paid upon any shares of Class B common stock, at the same time there must be declared and paid a dividend on the shares of Class A common stock equal in value to 110% of the amount per share of the dividend declared and paid on the shares of Class B common stock. Whenever a dividend is payable in shares of Company common stock, such dividend must be declared or paid at the same rate on the Class A common stock and the Class B common stock.\nQuarterly dividends declared in the first three quarters of fiscal 2023 were $0.31 per share of Class A common stock, and $0.33 per share for the fourth fiscal quarter of 2023. Quarterly dividends declared per share of Class B common stock were $0.28 for the first three quarters of fiscal 2023, and $0.30 per share for the fourth fiscal quarter of 2023. Total dividends declared in fiscal 2023 were $12,781. Cash dividends paid in fiscal 2023 totaled $12,554 and dividends payable of $3,347 were included in current liabilities at September 29, 2023.\nWhile the Board of Directors of the Company presently intends to continue the payment of regular quarterly cash dividends on the Companys common stock, they review the Companys dividend quarterly and may elect to increase, decrease or not pay a dividend at any time. The Companys ability to pay dividends could be affected by future business performance (including as a result of adverse developments in profitability, including reductions in margins, inflation and macroeconomic dynamics on our operations and cash flows), liquidity, capital needs, alternative investment opportunities and compliance with debt covenants in its loan agreements.\nTotal Shareholder Return\nThe graph below compares on a market cap weighted cumulative basis the yearly percentage change since September 28, 2018 in the total return (assuming reinvestment of dividends) to shareholders on the Class A common stock with (a) the total return (assuming reinvestment of dividends) on The NASDAQ Stock Market-U.S. Index; (b) the total return (assuming reinvestment of dividends) on the Russell 2000 Index; (c) the total return (assuming reinvestment of dividends) on the S&P Small Cap 600 Consumer Discretionary Index; and (d) the total return (assuming reinvestment of dividends) on a self-constructed peer group index. The Companys peer group consists of Clarus Corporation, Brunswick Corporation, Callaway Golf Company, Escalade Inc., Garmin Ltd., Marine Products Corporation, Malibu Boats Inc. and Nautilus, Inc. The graph assumes $100 was invested on September 28, 2018 in the Companys Class A common stock, The NASDAQ Stock Market-U.S. Index, the Russell 2000 Index, the S&P Small Cap 600 Index, and the peer group index.\nFor the year ended September 29, 2023, the Company replaced the Russell 2000 Index with the S&P Small Cap 600 Consumer Discretionary Index, as the Company determined that the companies included in the S&P Small Cap 600 Consumer Discretionary Index were more representative of the Company's market and industry profile and that use of the S&P Small Cap 600 Consumer Discretionary Index would provide the Company with a more reasonable comparison in the Pay versus Performance disclosures in our 2024 Proxy Statement for the 2024 Annual Shareholder Meeting than the Russell 2000 Index. During the year of transition, both indexes are shown in the graph and table below.\n* $100 invested on September 28, 2018 in stock or index, including reinvestment of dividends.\nIndices calculated on a mid-month basis.\n9/28/2018 9/27/2019 10/2/2020 10/1/2021 9/30/2022 9/29/2023\nJohnson Outdoors Inc. $ 100.0 $ 63.5 $ 94.3 $ 120.9 $ 57.4 $ 62.5\nNASDAQ Composite 100.0 99.8 140.5 186.1 136.1 171.7\nRussell 2000 Index 100.0 90.9 93.4 137.4 103.3 112.6\nS&P Small Cap 600 Consumer Discretionary Index 100.0 87.4 99.0 165.2 109.3 131.2\nPeer Group 100.0 102.0 122.1 193.1 111.3 135.3\nThe information in this section titled Total Shareholder Return shall not be deemed to be soliciting material or filed with the Securities and Exchange Commission or subject to Regulation 14A or 14C promulgated by the Securities and Exchange Commission or subject to the liabilities of section 18 of the Securities Exchange Act of 1934, as amended, and this information shall not be deemed to be incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended. ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nUnless otherwise stated, all monetary amounts in this Managements Discussion and Analysis of Financial Condition and Results of Operations, other than per share amounts, are stated in thousands.\nExecutive Overview\nThe Company designs, manufactures and markets innovative, high quality recreational products for the outdoor enthusiast. Through a combination of innovative products, strong marketing, a talented and passionate workforce and efficient distribution, the Company seeks to set itself apart from the competition in its markets. Its subsidiaries operate as a network that promotes innovation and leverages best practices and synergies in the design, production and marketing of their recreational products, following the strategic vision set by executive management and approved by the Companys Board of Directors.\nHighlights\nFiscal 2023 saw a significant change in pacing of sales compared to fiscal 2022 and 2021 as seasonality fluctuations in the Company's business returned to more traditional pre-pandemic levels. During the last quarter of fiscal 2022, as supply chain restrictions eased, the Company filled a significant number of backlogged customer orders. As a result, the fiscal 2023 fourth quarter comparisons show a significant reduction in sales versus the prior year fourth quarter. The Companys fiscal 2023 full-year revenues decreased by 11% from the prior year as outdoor recreation markets continued to moderate after elevated pandemic-driven demand. The decrease in sales volumes and a 13% increase in operating expenses between years resulted in a $54,570 decrease in operating profit in fiscal 2023 from fiscal 2022.\nResults of Operations\nSummary consolidated financial results from continuing operations for the fiscal years presented were as follows:\n(thousands, except per share data) 2023 2022 2021\nNet sales $ 663,844 $ 743,355 $ 751,651\nGross profit 244,087 271,332 334,125\nOperating expenses 232,347 205,022 222,842\nOperating profit 11,740 66,310 111,283\nInterest income, net (4,391) (654) (221)\nOther (income) expense, net (9,693) 8,076 (1,418)\nIncome tax expense 6,290 14,397 29,541\nNet income 19,534 44,491 83,381\nThe Companys internal and external sales and operating profit (loss) by business segment for each of the three most recent completed fiscal years were as follows:\n2023 2022 2021\nNet sales:\nFishing $ 492,927 $ 526,582 $ 553,000\nCamping 45,322 70,355 62,921\nWatercraft Recreation 40,768 67,940 66,603\nDiving 85,069 78,874 69,447\nOther / Eliminations (242) (396) (320)\n$ 663,844 $ 743,355 $ 751,651\n2023 2022 2021\nOperating profit (loss):\nFishing $ 41,325 $ 65,433 $ 122,490\nCamping 457 13,415 14,025\nWatercraft Recreation (1,777) 6,173 9,173\nDiving 6,092 4,705 1,530\nOther / Eliminations (34,357) (23,416) (35,935)\n$ 11,740 $ 66,310 $ 111,283\nSee Note 13 to the Consolidated Financial Statements included elsewhere in this report for the definition of segment net sales and operating profit.\nFiscal 2023 vs. Fiscal 2022\nNet Sales\nNet sales in fiscal 2023 decreased by 11% to $663,844 compared to $743,355 in fiscal 2022. Foreign currency exchange had an unfavorable impact of less than 1% on the current years sales versus the prior year.\nNet sales for the Fishing business decreased by $33,655, or 6% during fiscal 2023 from fiscal 2022. The decrease from prior year is primarily due to the following key factors: moderating demand during fiscal 2023 from record highs in the prior two fiscal years fueled by the impact of the pandemic; and the effect of customers more tightly managing their inventory levels as the Company transitioned its bow-mount trolling motor product lines.\nCamping net sales decreased $25,033, or 36%, in 2023 from 2022, as demand significantly declined from the increased levels seen during the pandemic. Additionally, approximately $6,600 of the decrease in net sales from the prior year period was related to the sale of the Military and Commercial Tents product lines during the second fiscal quarter of 2023. The Company sold these product lines to a third party in an asset sale for a purchase price of $14,990 which closed on March 17, 2023. The net book value of the assets and liabilities sold was approximately $8,350, resulting in a gain on sale of approximately $6,640, which is recorded in Other (income) expense, net in the Companys accompanying Condensed Consolidated Statements of Operations. The purchase price and the net proceeds received by the Company related to this sale were subject to customary purchase price adjustment provisions and Company indemnity obligations set forth in the definitive purchase agreement. Accordingly, during the third and fourth fiscal quarter, working capital true-up and purchase price adjustments reduced the purchase price and the final net gain to approximately $6,560.\nNet sales in the Watercraft Recreation business decreased $27,172, or 40% as the overall market significantly declined from the elevated levels seen during the pandemic.\nDiving net sales increased $6,195, or 8%, year over year. The sales increase was due to increased demand for our products as the global tourism industry continued to recover from the pandemic, as well as the impact of price increases, which were partially offset by an unfavorable foreign currency translation impact on sales in this segment of approximately 1% in 2023 versus the prior year period.\nCost of Sales\nCost of sales was $419,757, or 63.2% of net sales, on a consolidated basis for fiscal 2023 compared to $472,023, or 63.5% of net sales, in the prior year. The decrease in cost of sales was relatively consistent with the decrease in sales year over year and improved slightly as a percentage of net sales as supply chain conditions improved and costs of materials and freight both came down.\nGross Profit\nGross profit of $244,087 was 36.8% of net sales on a consolidated basis for the year ended September 29, 2023 compared to $271,332, or 36.5% of net sales in the prior year.\nGross profit in the Fishing business decreased by $7,685 from the prior year due primarily to the 6% decrease in net sales year over year. Although we experienced improved freight and materials costs over the prior year, those cost savings were nearly offset by unfavorable overhead absorption on reduced sales volumes between periods.\nCamping gross profit decreased by $12,120 from 2022, which was mainly attributable to decreased sales volumes as compared to the prior year. Additionally, approximately $2,300 of increases in reserves for excess Eureka! tent inventory further brought down gross profit.\nGross profit in the Watercraft Recreation segment decreased by $11,388 from 2022, due primarily to lower sales volumes than the prior year.\nThe $3,846 increase in gross profit in the Diving segment was due primarily to sales volume increases and pricing actions during fiscal 2023 as compared to the prior year.\nOperating Expenses\nOperating expenses increased from the prior year by $27,325 despite the decrease in sales volumes due to investments in marketing and research & development and higher headcount and deferred compensation costs.\nOperating expenses for the Fishing segment increased by $16,423 from fiscal 2022 levels. The increase was due primarily to higher warranty expense and marketing spend between years, as well as strategic investments in additional research and development headcount in fiscal 2023, offset in part by lower sales volume-driven expenses.\nCamping operating expenses increased by $838 from the prior year where increased expenses related to the Eureka! exit more than offset the decline in operating expenses resulting from decreased sales volume-driven expenses between years. During the fourth quarter of 2023, the Company decided to fully exit the Eureka! consumer product lines of the Camping business segment and focus solely on the Jetboil product line. As part of this exit, the Company committed to donating approximately $2,000 in excess Eureka! inventory to a non-profit organization and recognized the contribution expense in the fourth quarter of fiscal 2023. Additionally, the Company incurred costs related to the wind down of this Eureka! branded business which included accruing approximately $500 of exit costs. Other costs will be expensed as incurred and are not expected to be material.\nIn the Watercraft Recreation segment, operating expenses decreased $3,438 from their levels in fiscal 2022 due primarily to decreased sales volume related expenses in 2023.\nOperating expenses for the Diving business increased by $2,460 year over year due primarily to increased sales volume related expenses and increased headcount and personnel-related costs between periods.\nThe Company's fiscal 2023 general corporate expenses of $34,765 increased $11,043 from $23,722 in fiscal 2022. More favorable market conditions on the Company's deferred compensation plan assets resulted in approximately $9,100 of higher deferred compensation expense during fiscal 2023 over the prior year. The deferred compensation expenses are entirely offset by a gain in \"Other (income) expense, net\" related to marking the plan assets to market. Additionally, professional services costs increased approximately $2,800 over the prior year.\nOperating Results\nThe Companys operating profit was $11,740 in fiscal 2023 compared to an operating profit of $66,310 in fiscal 2022. Fishing operating profit decreased by $24,108 to $41,325 from $65,433 in the prior year due primarily to lower sales volumes between years, as well as increased operating expenses, as discussed above. The operating profit for Camping was $457 compared to $13,415 in 2022 which decrease was primarily a result of the lower sales volumes between periods. The operating loss for the Watercraft Recreation business was $1,777 in fiscal 2023 compared to operating profit of $6,173 in fiscal 2022 due to the changes in sales volumes noted above. Operating profit for the Diving business increased by $1,387 in fiscal 2023 from fiscal 2022, due primarily to increased sales volumes and improved margins.\nOther Income and Expenses\nInterest expense of $152 was flat as compared to the prior year expense of $153. Interest income of $4,543 increased from prior year interest income of $807 due to the increase in deposit interest rates year over year, as well as increased cash and investment balances over the prior year. Net other income of $9,693 in fiscal 2023 increased from net other expense of $8,076 in fiscal 2022. The current year net other income included the gain on the sale of the Military and Commercial Tents product lines of approximately $6,560, and market earnings and dividend income of $3,200 on deferred compensation plan assets, partially offset by currency losses of $114. In the prior year, net other expense included $5,878 of market losses net of dividends on the deferred compensation plan assets, as well as $1,741 of currency losses. The dividends and market gains and\nlosses on deferred compensation plan assets recognized in the Consolidated Statement of Operations in Other (income) expense, net are offset as compensation expense in Operating expenses.\nPretax Income and Income Taxes\nThe Company realized pretax income of $25,824 in fiscal 2023 compared to $58,888 in fiscal 2022. The Company recorded income tax expense of $6,290 in 2023, which equated to an effective tax rate of 24.4%, compared to $14,397 in 2022, which equated to an effective tax rate of 24.4%.\nNet Income\nThe Company recognized net income of $19,534, or $1.90 per diluted common share, in fiscal 2023 compared to $44,491, or $4.37 per diluted common share, in fiscal 2022 based on the factors discussed above.\nFiscal 2022 vs. Fiscal 2021\nNet Sales\nNet sales in fiscal 2022 decreased by 1% to $743,355 compared to $751,651 in fiscal 2021. Foreign currency exchange had an unfavorable impact of less than 1% on fiscal 2022 sales versus the prior year.\nNet sales for the Fishing business decreased by $26,418, or 5% during fiscal 2022 from fiscal 2021. While customer and consumer demand was strong, the decrease over fiscal 2021 was driven by significant supply chain disruptions and the resulting unavailability of certain necessary components (especially as it related to electronic components) experienced in fiscal 2022, which impacted the ability to complete product build and fill customer orders. Specifically, due to the technical and electronic nature of the product categories, the Fishing segment was most susceptible to the supply chain disruption issues, (including with respect to cost and availability of necessary materials and components) caused by the Coronavirus (COVID-19) pandemic.\nCamping net sales increased $7,434, or 12%, in 2022 from 2021. Increased sales of Eureka! and Jetboil products as a result of continued participation in outdoor recreation activities were the primary driver of the increase year over year.\nNet sales in the Watercraft Recreation business increased $1,337, or 2%. Continued new product success drove the overall increase over fiscal 2021.\nDiving net sales increased $9,427, or 14%, year over year. Fiscal 2021 sales were negatively impacted due to the negative effects of COVID-19 on demand due to restrictions in destination travel and tourism. As several regions around the world re-opened, sales volumes increased during fiscal 2022 along with the increase in tourism, partially offset by an unfavorable foreign currency translation impact on sales in these segment of approximately 4.5% in 2022 versus the fiscal 2021 period.\nCost of Sales\nCost of sales was $472,023, or 63.5% of net sales, on a consolidated basis for fiscal 2022 compared to $417,526, or 55.5% of net sales, in fiscal 2021. Despite the decrease in sales over fiscal 2021, the increase in cost of sales was primarily driven by significant increases in materials costs between years. During fiscal 2022, the Company devoted significant effort to managing disruptions in its supply chain to ensure the availability of necessary components, parts and other raw materials, in some cases at significantly higher price points than what was historically paid, to try to meet sales demand for our products across segments.\nGross Profit\nGross profit of $271,332 was 36.5% of net sales on a consolidated basis for the year ended September 30, 2022 compared to $334,125, or 44.5% of net sales in fiscal 2021.\nGross profit in the Fishing business decreased by $66,217 from fiscal 2021 due primarily to the 5% decrease in net sales year over year, as well as significant increases in materials costs, as discussed above.\nCamping gross profit increased by $1,857 from 2021 due primarily to increased sales volumes, pricing actions and a favorable mix of products sold in fiscal 2022 as compared to fiscal 2021.\nGross profit in the Watercraft Recreation segment decreased by $2,525 from 2021, despite increased sales in 2022 versus fiscal 2021, primarily due to increased materials and freight costs.\nThe $4,169 increase in gross profit in the Diving segment was due primarily to increased sales volumes and pricing actions during fiscal 2022 as compared to fiscal 2021.\nOperating Expenses\nOperating expenses decreased from fiscal 2021 by $17,820. The decrease was primarily due to the impact of overall lower sales volume-driven expenses, as well as lower variable and deferred compensation expense incurred in fiscal 2022 as compared to fiscal 2021.\nOperating expenses for the Fishing segment decreased by $9,160 from fiscal 2021 levels. The decrease was due primarily to lower sales volume related expenses between years.\nCamping operating expenses increased by $2,467 from fiscal 2021 due primarily to increased sales volume related expenses and increased people costs.\nIn the Watercraft Recreation segment, operating expenses increased $475 from their levels in fiscal 2021 due primarily to increased sales volume related expenses in 2022.\nOperating expenses for the Diving business increased by $993 year over year due primarily to increased sales volume related expenses between periods.\nThe Company's fiscal 2022 general corporate expenses of $23,722 decreased $12,595 from $36,317 in fiscal 2021. The year over year decrease reflected lower people costs, including $11,200 of lower deferred compensation expenses, as well as lower incentive compensation and lower health insurance costs from fiscal 2021.\nOperating Results\nThe Companys operating profit was $66,310 in fiscal 2022 compared to an operating profit of $111,283 in fiscal 2021. Fishing operating profit decreased by $57,057 to $65,433 from $122,490 in fiscal 2021 due primarily to higher costs of goods and also lower sales volumes between years, stemming from supply chain disruptions, which were particularly acute in electronics. The operating profit for Camping was $13,415 compared to $14,025 in 2021 which decrease was primarily a result of the higher operating expenses between periods. The operating profit for the Watercraft Recreation business was $6,173 in fiscal 2022 compared to $9,173 in fiscal 2021 due to the factors noted above on changes in sales volumes and operating expenses. Operating profit for the Diving business increased by $3,175 in fiscal 2022 from fiscal 2021, due primarily to increased sales volumes and pricing actions.\nOther Income and Expenses\nInterest expense of $153 was relatively flat as compared to fiscal 2021 expense of $145. Interest income of $807 increased from fiscal 2021 interest income of $366 due to the increase in deposit interest rates year over year. Net other expense of $8,076 in fiscal 2022 decreased from net other income of $1,418 in fiscal 2021. The fiscal 2022 net other expense included currency losses of $1,741 and market losses net of dividend income of $5,878 on deferred compensation plan assets. In fiscal 2021, net other income included $5,329 of market gains and dividends on the deferred compensation plan assets, partially offset by $215 of currency losses and pension termination expense of $2,526. The dividends and market gains and losses on deferred compensation plan assets recognized in the Consolidated Statement of Operations in Other expense (income), net are offset as compensation expense in Operating expenses.\nPretax Income and Income Taxes\nThe Company realized pretax income of $58,888 in fiscal 2022 compared to $112,922 in fiscal 2021. The Company recorded income tax expense of $14,397 in 2022, which equated to an effective tax rate of 24.4%, compared to $29,541 in 2021, which equated to an effective tax rate of 26.2%.\nNet Income\nThe Company recognized net income of $44,491, or $4.37 per diluted common share, in fiscal 2022 compared to $83,381, or $8.21 per diluted common share, in fiscal 2021 based on the factors discussed above.\nFinancial Condition, Liquidity and Capital Resources\nThe Company believes its existing balances of cash and cash equivalents will be sufficient to satisfy its working capital needs, capital asset purchase requirements, outstanding commitments and other liquidity requirements associated with its existing operations over the next twelve months. The Company currently anticipates the cash used for future dividends will come from its current cash and cash generated from ongoing operating activities.\nThe Company considers all short-term investments in interest-bearing bank accounts, and all securities and other instruments with an original maturity of three months or less, to be equivalent to cash. Short-term investments consist of marketable securities, with original maturities greater than three months but less than one year, and long-term investments consist of marketable securities with original maturities greater than one year, with the primary objective of minimizing the potential risk of principal loss. The Companys investment policy generally requires securities to be investment grade.\nThe Companys cash flows from operating, investing and financing activities, as reflected in the accompanying Consolidated Statements of Cash Flows, are summarized in the following table:\nYear Ended\n(thousands) September 29\n2023 September 30\n2022 October 1\nCash (used for) provided by :\nOperating activities $ 41,713 $ (62,144) $ 58,318\nInvesting activities (48,374) (31,678) (21,381)\nFinancing activities (12,732) (12,233) (9,033)\nEffect of foreign currency rate changes on cash 1,444 (4,590) 107\n(Decrease) increase in cash and cash equivalents $ (17,949) $ (110,645) $ 28,011\nOperating Activities\nThe following table sets forth the Companys working capital position at the end of each of the years shown:\n(thousands, except share data) September 29\n2023 September 30\nCurrent assets $ 458,656 $ 480,316\nCurrent liabilities 104,006 114,713\nWorking capital $ 354,650 $ 365,603\nCurrent ratio 4.4:1 4.2:1\nCash flows provided by operations in fiscal 2023 totaled $41,713, cash flows used for operations totaled $62,144 in fiscal 2022, respectively, and cash provided by operations totaled $58,318 in fiscal 2021. During fiscal 2022, the Company was able to fill backlogged customer orders, which generated customer payments during fiscal 2023 that substantially improved cash flows from operating activities during the year. Notwithstanding such improvement in operating cash flows, the Company continues to focus on managing inventory levels.\nDepreciation and amortization charges were $16,295, $14,234 and $13,401 in fiscal 2023, 2022 and 2021, respectively.\nInvesting Activities\nCash flows used for investing activities were $48,374, $31,678, and $21,381 in fiscal 2023, 2022, and 2021, respectively. During fiscal 2023, the Company purchased investments of $40,700. There were no sales or purchases of investments in fiscal 2022 or 2021. In fiscal 2023, there was $14,990 of proceeds from selling the Military and Commercial Tent product lines. Expenditures for property, plant and equipment were $22,668, $31,690 and $21,409 in fiscal 2023, 2022 and 2021, respectively. The decrease in these expenditures from the prior year was due primarily to additional capacity investments made in the prior year that did not recur in fiscal 2023. In general, the Companys ongoing capital expenditures are primarily related to tooling for new products, facilities investments and information systems improvements.\nFinancing Activities\nCash flows used for financing activities totaled $12,732 in fiscal 2023 compared to $12,233 and $9,033 in 2022 and 2021, respectively, and were primarily for the payment of dividends of $12,554 and $12,056 in 2023 and 2022, respectively. In 2021, dividend payments totaled $8,400.\nContractual Obligations and Off Balance Sheet Arrangements\nThe Company has contractual obligations and commitments to make future payments under its operating leases and open purchase orders. There have been no changes outside of the ordinary course of business in the specified contractual obligations during the year ended September 29, 2023.\nThe Company utilizes letters of credit primarily as security for the payment of future claims under its workers compensation insurance. Letters of credit outstanding at September 29, 2023 and September 30, 2022 were $67 and $173, respectively, and were included in the Companys total loan availability. The Company had no unsecured revolving credit facilities at its foreign subsidiaries as of September 29, 2023 or September 30, 2022.\nThe Company has no other off-balance sheet arrangements.\nMarket Risk Management\nForeign Exchange Risk\nThe Company has significant foreign operations, for which the functional currencies are denominated primarily in euros, Swiss francs, Hong Kong dollars and Canadian dollars. As the values of the currencies of the foreign countries in which the Company has operations increase or decrease relative to the U.S. dollar, the sales, expenses, profits, losses, assets and liabilities of the Companys foreign operations, as reported in the Companys consolidated financial statements, increase or decrease, accordingly. Approximately 14% of the Companys revenues for the fiscal year ended September 29, 2023 were denominated in currencies other than the U.S. dollar. Approximately 6% were denominated in euros and approximately 6% were denominated in Canadian dollars, with the remaining 2% denominated in various other foreign currencies. Changes in foreign currency exchange rates can cause unexpected financial losses or cash flow needs.\nInterest Rate Risk\nThe Company operates in a seasonal business and experiences significant fluctuations in operating cash flow as working capital needs increase in advance of the Companys primary selling and cash generation season, and decline as accounts receivable are collected and cash is accumulated.\nCommodities\nCertain components used in the Companys products are exposed to commodity price changes. The Company manages this risk through instruments such as purchase orders and non-cancellable supply contracts. Primary commodity price exposures include costs associated with metals, resins and packaging materials.\nImpact of Inflation\nThe Company anticipates that changing costs of basic raw materials (including due to inflationary conditions in the economy) may impact future operating costs and, accordingly, the prices of its products. The Company is involved in continuing programs to mitigate the impact of cost increases through changes in product design and identification of sourcing and manufacturing efficiencies. Price increases and, in certain situations, price decreases are implemented for individual products, when appropriate.\nThe Companys results of operations and financial condition are presented based on historical cost.\nCritical Accounting Estimates\nThe Companys management discussion and analysis of its financial condition and results of operations are based upon the Companys consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the U.S. The preparation of these financial statements requires the Company to make estimates and judgments that affect the reported amounts of its assets, liabilities, sales and expenses, and related footnote disclosures. On an on-going basis, the Company evaluates its estimates for product returns, bad debts, inventories, long lived assets and goodwill, income taxes, warranty obligations, pensions and other post-retirement benefits, litigation and other subjective matters impacting the financial statements. The Company bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nThe Company believes the following critical accounting policies affect its more significant judgments and estimates used in the preparation of its consolidated financial statements. Management has discussed these policies with the Audit Committee of the Companys Board of Directors.\nAllowance for Doubtful Accounts\nAllowances for doubtful accounts are estimated by the individual operating companies based on estimates of losses related to customer accounts receivable balances. Estimates are developed by using standard quantitative measures based on historical losses, adjusting for current economic conditions and, in some cases, evaluating specific customer accounts for risk of loss. The establishment of reserves requires the use of judgment and assumptions regarding the potential for losses on receivable balances. Though the Company considers these balances adequate and proper, changes in economic conditions in specific markets in which the Company operates and any specific customer collection issues the Company identifies could have a favorable or unfavorable effect on required reserve balances.\nInventories\nThe Company values inventory at the lower of cost (determined using the first-in first-out method) or net realizable value. Managements judgment is required to determine the reserve for obsolete or excess inventory. Inventory on hand may exceed future demand either because the product is outdated or because the amount on hand is more than will be used to meet future needs. Inventory reserves are estimated by the individual operating companies using standard quantitative measures based on criteria established by the Company. The Company also considers current forecast plans, as well as market and industry conditions in establishing reserve levels. Though the Company considers these reserve balances to be adequate, changes in economic conditions, customer inventory levels or competitive conditions could have a favorable or unfavorable effect on required reserve balances.\nDeferred Taxes\nThe Company records a valuation allowance to reduce its deferred tax assets to the amount that is more likely than not to be realized. While the Company has considered future taxable income and ongoing prudent and feasible tax planning strategies in assessing the need for the valuation allowance, in the event the Company were to determine that it would not be able to realize all or part of its net deferred tax assets in the future, an adjustment to the deferred tax assets would be charged to income in the period such determination was made. Likewise, should the Company determine that it would be able to realize its deferred tax assets in the future in excess of its net recorded amount, an adjustment to the deferred tax assets would increase income in the period such determination was made.\nGoodwill and Other Intangible Assets Impairment\nGoodwill and indefinite-lived intangible assets are tested for impairment annually or more frequently if events or changes in circumstances indicate that the assets might be impaired. Generally, annual impairment tests are performed by the Company in the fourth quarter of each fiscal year.\nIn assessing the recoverability of the Companys goodwill, the Company estimates the fair value of the businesses to which the goodwill relates. Fair value is estimated using a discounted cash flow analysis. If the fair value of a reporting unit exceeds its net book value, no impairment exists. When fair value is less than the carrying value of the net assets and related goodwill, an impairment charge is recognized based on the excess of carrying amount over its fair value. The Company did not recognize any goodwill impairment charges in 2023, 2022 or 2021.\nThe discounted cash flow analysis used to estimate fair value requires a number of key estimates and assumptions. The Company estimates the future cash flows of the reporting units based on historical and forecasted revenues and operating costs and applies a discount rate to the estimated future cash flows for purposes of the valuation. This discount rate is based on the estimated weighted average cost of capital, which includes certain assumptions made by management such as market capital structure, market betas, the risk-free rate of return and the estimated costs of borrowing. Changes in these key estimates and assumptions, or in other assumptions used in this process, could materially affect our impairment analysis in a given year.\nIn assessing the recoverability of the Companys other indefinite lived intangible assets, the Company estimates the fair value of the various intangible assets. The fair value of trademarks and patents is estimated using the relief from royalty method. If the fair value of an intangible asset exceeds its net book value, no impairment exists. When fair value is less than the carrying value of the intangible asset, an impairment loss is recognized for the amount of the difference.\nA number of factors, many of which the Company has no ability to control, could affect its financial condition, operating results and business prospects and could cause actual results to differ from the estimates and assumptions that the Company uses in preparing its financial statements. These factors include: a prolonged global economic crisis, a significant decrease in demand for the Companys products, a significant adverse change in legal factors or in the business climate, an adverse action or assessment by a regulator and successful efforts by the Companys competitors to gain market share.\nImpairment of Long-Lived Assets and Long-Lived Assets to be Disposed of\nThe Company evaluates long-lived assets for impairment whenever events or changes in circumstances, such as unplanned negative cash flow indicate that the carrying amount of an asset group may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset group to future undiscounted cash flows expected to be generated by the asset group. If such assets are determined to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of are reported at the lower of the carrying amount or fair value less costs to sell. Application of alternative assumptions, such as changes in the estimate of future cash flows, could produce significantly different results. Because of the significance of the judgments and estimation processes, it is likely that materially different amounts could be recorded if we used different assumptions or if the underlying circumstances were to change.\nWarranties\nThe Company accrues a warranty reserve for estimated costs to provide warranty services. Warranty reserves are estimated using standard quantitative measures based on criteria established by the Company. Estimates of costs to service its warranty obligations are based on historical experience, expectation of future conditions and known product issues. To the extent the Company experiences increased warranty claim activity or increased costs associated with servicing those claims, revisions to the estimated warranty reserve would be required. The Company engages in product quality programs and processes, including monitoring and evaluating the quality of its suppliers, to help minimize warranty obligations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nInformation with respect to this item is included in Managements Discussion and Analysis of Financial Condition and Results of Operations under the heading Market Risk Management. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nInformation with respect to this item is included in the Companys consolidated financial statements attached to this report on pages to. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\n(a)Evaluation of Disclosure Controls and Procedures\nThe Company maintains disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934) designed to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and that the information required to be disclosed by the Company in reports that it files or submits under the Securities Exchange Act of 1934 is accumulated and communicated to its management, including its Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure. The Company carried out an evaluation as of September 29, 2023, under the supervision and with the participation of the Companys management, including its Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures. Based on such evaluation, the Companys Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures were effective as of September 29, 2023 at reaching a level of reasonable assurance. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. The Company has designed its disclosure controls and procedures to reach a level of reasonable assurance of achieving the desired control objectives.\nThe report of management required under this Item 9A is included on page of the Companys Consolidated Financial Statements attached to this Report under the heading Managements Report on Internal Control over Financial Reporting and is incorporated herein by reference.\n(b)Changes in Internal Control over Financial Reporting\nThere was no change in the Companys internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended) that occurred during the Companys most recently completed fiscal quarter that has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting.\n(c)Attestation Report of Independent Registered Public Accounting Firm\nRSM US LLP, the independent registered public accounting firm who audited the Companys consolidated financial statements, has issued an attestation report on the Companys internal control over financial reporting, which is contained in the Companys consolidated financial statements under the heading Report of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting. ITEM 9B. OTHER INFORMATION\n(b)Trading Plans\nDuring the three month period ended September 29, 2023, no director or officer of the Company adopted or terminated a \"Rule 10b5-1 trading arrangement\" or \"non-Rule 10b5-1 trading arrangement,\" as each term is defined in Item 408(a) of Regulation S-K, nor did the Company during such fiscal quarter adopt or terminate any \"Rule 10b5-1 trading arrangement.\"\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTION\nNot Applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation with respect to this item is incorporated herein by reference to the discussion under the headings Proposal 1: Election of Directors, Executive Officers, Section 16(a) Reports, \"Directors Meetings and Committees - Nominating and Corporate Governance Committee and Audit Committee Matters - Audit Committee Financial Expert in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024. Information regarding the Companys Code of Business Ethics is incorporated herein by reference to the discussion under Corporate Governance Matters - Employee Code of Conduct and Code of Ethics; Corporate Governance Guidelines; and Procedures for Reporting of Accounting Concerns in the Company's Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024.\nThe Audit Committee of the Companys Board of Directors is an audit committee for purposes of Section 3(a)(58)(A) of the Securities Exchange Act of 1934. The members of the Audit Committee are Edward F. Lang (Chairman), Jeffrey M. Stutz, Richard (\"Casey\") Sheahan, and Edward Stevens.\nThe Company has adopted the Johnson Outdoors Insider Trading Policy which governs the purchase, sale and/or other disposition of the Company's securities, including its Class A Common Stock, by its directors, officers and employees that is reasonably designed to promote compliance with applicable insider trading laws, rules and regulations. A copy of the Johnson Outdoors Insider Trading Policy is filed as Exhibit 19 to this Report. ITEM 11. EXECUTIVE COMPENSATION\nInformation with respect to this item is incorporated herein by reference to the discussion under the headings Directors Compensation and Executive Compensation and CEO Pay Relative to Median Pay of our Employees in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024.\nThe information incorporated by reference from Report of the Compensation Committee in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024, shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934 nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933 or the Securities Exchange Act of 1934, except as shall be expressly set forth by specific reference in such filing. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation with respect to this item is incorporated herein by reference to the discussion under the heading Stock Ownership of Management and Others in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024.\nEquity Compensation Plan Information\nThe following table summarizes share information, as of September 29, 2023, for the Companys equity compensation plans, including the Johnson Outdoors Inc. 2012 Non-Employee Director Stock Ownership Plan, the Johnson Outdoors Inc. 2010 Long-Term Stock Incentive Plan, the Johnson Outdoors Inc. 2020 Long-Term Stock Incentive Plan and the Johnson Outdoors Inc. 2009 Employee Stock Purchase Plan. All of these plans have been approved by the Companys shareholders.\nPlan Category Number of Common\nShares to Be Issued\nUpon Exercise of\nOutstanding Options,\nWarrants and Rights Weighted-average\nExercise Price of\nOutstanding Options,\nWarrants and Rights Number of Common\nShares Available for\nFuture Issuance Under\nEquity Compensation\nPlans\n2020 Long-Term Stock Incentive Plan 68,244 (1) $ - 390,451 (2)\n2010 Long-Term Stock Incentive Plan 3,357 (3) - 3,357 (3)\n2012 Non-Employee Director Stock Ownership Plan 10,273 - 77,615\n2009 Employee Stock Purchase Plan - - 73,327\nTotal All Plans 81,874 - 544,750\n(1) Includes 68,244 performance stock unit awards at their target values. The ultimate amount of performance stock units that could vest can range from 0% to 150% of the target amount, or from 0 units to 102,366 units for all awards.\n(2) Includes 288,085 of future shares to be issued, as well as up to 102,366 shares of performance stock units that may be issued in shares of Class A Common Stock at the maximum earned level.\n(3) Includes 3,357 of previously issued shares for which vesting was deferred. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nInformation with respect to this item is incorporated herein by reference to the discussion under the heading Certain Relationships and Related Transactions in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024. Information regarding director independence is incorporated by reference to the discussions under Corporate Governance Matters-Director Independence in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation with respect to this item is incorporated herein by reference to the discussion under the heading Audit Committee Matters - Fees of Independent Registered Public Accounting Firm in the Companys Proxy Statement for the 2024 Annual Meeting of Shareholders, which will be filed with the Securities and Exchange Commission on or before January 27, 2024.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nThe following documents are filed as a part of this report:\nFinancial Statements\nIncluded in Item 8 of Part II of this report are the following:\nReports of Independent Registered Public Accounting Firm\nConsolidated Statements of Operations - Years ended September 29, 2023, September 30, 2022 and October 1, 2021\nConsolidated Statements of Comprehensive Income - Years ended September 29, 2023, September 30, 2022 and October 1, 2021\nConsolidated Balance Sheets - September 29, 2023 and September 30, 2022\nConsolidated Statements of Shareholders Equity - Years ended September 29, 2023, September 30, 2022 and October 1, 2021\nConsolidated Statements of Cash Flows - Years ended September 29, 2023, September 30, 2022 and October 1, 2021\nNotes to Consolidated Financial Statements\nExhibits\nSee Exhibit Index.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Racine and State of Wisconsin, on the 8th day of December 2023.\nJOHNSON OUTDOORS INC.\n(Registrant)\nBy /s/ Helen P. Johnson-Leipold\nHelen P. Johnson-Leipold\nChairman and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the registrant and in the capacities indicated on the 8th day of December 2023.\n/s/ Helen P. Johnson-Leipold Chairman and Chief Executive Officer and Director\n(Helen P. Johnson-Leipold) (Principal Executive Officer)\n/s/ John M. Fahey, Jr. Vice Chairman of the Board and Lead Outside Director\n(John M. Fahey, Jr.)\n/s/ Edward Stevens Director\n(Edward Stevens)\n/s/ Edward F. Lang Director\n(Edward F. Lang)\n/s/ Katherine Button Bell Director\n(Katherine Button Bell)\n/s/ Richard Sheahan Director\n(Richard (Casey) Sheahan)\n/s/ Jeffrey M. Stutz\nDirector\n(Jeffrey M. Stutz)\n/s/ Annie Zipfel Director\n(Annie Zipfel)\n/s/ Paul G. Alexander Director\n(Paul G. Alexander)\n/s/ David W. Johnson Vice President and Chief Financial Officer\n(David W. Johnson) (Principal Financial and Accounting Officer)\nEXHIBIT INDEX\nExhibit Title\n3.1\nArticles of Incorporation of the Company as amended through February 17, 2000. (Filed as Exhibit 3.1(a) to the Companys Form 10-Q for the quarter ended March 31, 2000 and incorporated herein by reference.)\n3.2\nBylaws of the Company as amended and restated through December 6, 2010. (Filed as Exhibit 3.2 to the Companys Form 10-K for the year ended October 1, 2010 and incorporated herein by reference.)\n4.1\nDescription of Registrant's Securities (Filed as Exhibit 4.1 to the Company's Form 10-K for the year ended September 27, 2019 and incorporated herein by reference.)\n9.1\nJohnson Outdoors Inc. Class B common stock Amended and Restated Voting Trust Agreement, dated as of February 16, 2010 (Filed as Exhibit 2 to Amendment No. 14 to the Schedule 13D filed by Helen P. Johnson-Leipold on February 24, 2017 and incorporated herein by reference.)\n10.1\nRegistration Rights Agreement regarding Johnson Outdoors Inc. common stock issued to the Johnson family prior to the acquisition of Johnson Diversified, Inc. (Filed as Exhibit 10.1 to the Companys Form 10-K dated and filed with the Securities and Exchange Commission on December 8, 2017 and incorporated herein by reference.)\n10.2\nRegistration Rights Agreement regarding Johnson Outdoors Inc. Class A common stock held by Mr. Samuel C. Johnson. (Filed as Exhibit 10.2 to the Companys Form 10-K dated and filed with the Securities and Exchange Commission on December 8, 2017 and incorporated herein by reference.)\n10.3 +\nJohnson Outdoors Inc. 2000 Long-Term Stock Incentive Plan. (Filed as Exhibit 99.1 to the Companys Current Report on Form 8-K dated July 29, 2005 and incorporated herein by reference.)\n10.4 +\nJohnson Outdoors Inc. Worldwide Key Executives Discretionary Bonus Plan. (Filed as Appendix A to the Companys Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission on January 13, 2014 and incorporated herein by reference.)\n10.5 +\nJohnson Outdoors Inc. 2003 Non-Employee Director Stock Ownership Plan. (Filed as Exhibit 10.2 to the Companys Form 10-Q dated April 2, 2004 and incorporated herein by reference.)\n10.6 +\nForm of Restricted Stock Agreement under Johnson Outdoors Inc. 2003 Non-Employee Director Stock Ownership Plan. (Filed as Exhibit 4.2 to the Companys Form S-8 Registration Statement No. 333-115298 and incorporated herein by reference.)\n10.7 +\nForm of Stock Option Agreement under Johnson Outdoors Inc. 2003 Non-Employee Director Stock Ownership Plan. (Filed as Exhibit 4.3 to the Companys Form S-8 Registration Statement No. 333-115298 and incorporated herein by reference.)\n10.8\nAmended and Restated Credit Agreement dated as of November 15, 2017 among Johnson Outdoors Inc., certain subsidiaries of Johnson Outdoors Inc., PNC Bank, National Association, as lender and administrative agent, PNC Capital markets LLC, as sole lead arranger and bookrunner, and the other lender named therein (filed as Exhibit 99.1 to the current report on Form 8-K dated and filed with the Securities and Exchange Commission on November 20, 2017).\n10.9 +\nJohnson Outdoors Inc. 2009 Employees Stock Purchase Plan. (Filed as Exhibit 99.2 to the current report on Form 8-K dated and filed with the Securities and Exchange Commission on March 8, 2010.)\n10.10 +\nJohnson Outdoors Inc. 2010 Long Term Stock Incentive Plan. (Filed as Appendix A to the Companys Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission on January 15, 2015 and incorporated herein by reference.)\n10.11 +\nJohnson Outdoors Inc. 2012 Non-Employee Director Stock Ownership Plan. (Filed as Appendix A to the Companys Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission on January 13, 2017 and incorporated herein by reference.)\n10.12 +\nForm of Restricted Stock Unit Agreement under Johnson Outdoors Inc. 2012 Non-Employee Director Stock Ownership Plan. (Filed as Exhibit 10.31 to the annual report on Form 10-K dated and filed with the Securities and Exchange Commission on December 5, 2014.)\n10.13 +\nForm of Restricted Stock Unit Agreement (Performance Based) under Johnson Outdoors Inc. 2010 Long Term Stock Incentive Plan. (Filed as Exhibit 10.32 to the annual report on Form 10-K dated and filed with the Securities and Exchange Commission on December 7, 2015.)\n10.14 +\nForm of Restricted Stock Agreement under Johnson Outdoors Inc. 2012 Non-Employee Director Stock Ownership Plan. (Filed as Exhibit 10.14 to the annual report on Form 10-K dated and filed with the Securities and Exchange Commission on December 7, 2018.)\n10.15 +\nJohnson Outdoors Inc. 2020 Long Term Stock Incentive Plan. (Filed as Appendix A to the Companys Proxy Statement on Schedule 14A filed with the Securities and Exchange Commission on January 10, 2020 and incorporated herein by reference.)\n10.16 +\nForm of Restricted Stock Unit Agreement (Performance Based) under Johnson Outdoors Inc. 2020 Long Term Stock Incentive Plan. (Filed as Exhibit 99.2 to the registration statement on Form S-8 dated and filed with the Securities and Exchange Commission on May 5, 2020 and incorporated herein by reference.)\n10.17 +\nForm of Restricted Stock Agreement under Johnson Outdoors Inc. 2020 Long Term Stock Incentive Plan. (Filed as Exhibit 99.3 to the registration statement on Form S-8 dated and filed with the Securities and Exchange Commission on May 5, 2020 and incorporated herein by reference.)\n10.18\nFirst Amendment dated July 15, 2021 to Amended and Restated Credit Agreement dated as of November 15, 2017 among Johnson Outdoors Inc., certain subsidiaries of Johnson Outdoors Inc., PNC Bank, National Association, as lender and administrative agent, PNC Capital markets LLC, as sole lead arranger and bookrunner, and the other lender named therein (filed as Exhibit 10.1 to the Company's Form 8-K dated and filed with the Securities and Exchange Commission on July 16, 2021 and incorporated herein by reference).\nJohnson Outdoors Inc. Insider Trading Policy.\nSubsidiaries of the Company as of September 29, 2023\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a) or 15d-14(a).\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) or 15d-14(a).\n32.1\nCertifications of Chief Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350. (1)\n97+\nJohnson Outdoors Inc. Incentive Compensation Recovery Policy, as amended and restated effective as of June 1, 2023.\n101 The following materials from Johnson Outdoors Inc.s Annual Report on Form 10-K for the fiscal year ended September 29, 2023 formatted in XBRL (eXtensible Business Reporting Language) and furnished electronically herewith: (i) Consolidated Statements of Operations; (ii) Consolidated Statements of Comprehensive Income, (iii) Consolidated Balance Sheets; (iv) Consolidated Statements of Shareholders Equity; (v) Consolidated Statements of Cash Flows; and (vi) Notes to Consolidated Financial Statements. XBRL Instance Document - the XBRL Instance Document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n104 The cover page from the Company's Annual Report on Form 10-K for the year ended September 29, 2023 has been formatted in Inline XBRL (included in Exhibit 101).\n+ A management contract or compensatory plan or arrangement.\n(1)This certification is not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended.\nCONSOLIDATED FINANCIAL STATEMENTS\nTable of Contents Page\nManagements Report on Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm on Internal Control over Financial Reporting\nReport of Independent Registered Public Accounting Firm (PCAOB ID:49)\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Income\nConsolidated Balance Sheets\nConsolidated Statements of Shareholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nThe management of Johnson Outdoors Inc. is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) of the Securities Exchange Act of 1934. The Companys internal control over financial reporting is designed to provide reasonable assurance to the Companys management and board of directors regarding the preparation and fair presentation of published financial statements. The Companys internal control over financial reporting includes those policies and procedures that:\n(a)pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n(b)provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n(c)provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of September 29, 2023. In making this assessment, management used the criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in 2013. Based on our assessment, management believes that, as of September 29, 2023, the Companys internal control over financial reporting was effective based on those criteria.\n/s/ Helen P. Johnson-Leipold /s/ David W. Johnson\nChairman and Chief Executive Officer Vice President and Chief Financial Officer\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nShareholders and the Board of Directors\nJohnson Outdoors Inc.\nOpinion on the Internal Control Over Financial Reporting\nWe have audited Johnson Outdoors Inc.'s (the Company) internal control over financial reporting as of September 29, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 29, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements of the Company and our report dated December 8, 2023 expressed an unqualified opinion.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ RSM US LLP\nMilwaukee, Wisconsin\nDecember 8, 2023\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nShareholders and the Board of Directors\nJohnson Outdoors Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Johnson Outdoors Inc. and its subsidiaries (the Company) as of September 29, 2023 and September 30, 2022, the related consolidated statements of operations, comprehensive income, shareholders' equity and cash flows for each of the three years in the period ended September 29, 2023, and the related notes to the consolidated financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 29, 2023 and September 30, 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 29, 2023, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 29, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013, and our report dated December 8, 2023 expressed an unqualified opinion on the effectiveness of the Companys internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of Obsolete and Excess Inventory Reserve\nAs described within Notes 1 and 15 to the consolidated financial statements, the consolidated inventory balance as of September 29, 2023 was $261,474,000, net of $18,471,000 in reserves, of which a significant portion relates to the Fishing segment. The Company values inventory at the lower of cost (determined using the first-in, first-out method) or net realizable value. Management develops assumptions when estimating the inventory reserves based on expected future demand, market conditions, and industry conditions.\nWe identified the value of the obsolete and excess inventory related to the Fishing segment as a critical audit matter as there was a high degree of auditor judgment and increased audit effort when performing audit procedures given the subjective nature of the significant assumptions utilized by management.\nOur audit procedures related to the Companys evaluation of the obsolete and excess inventory reserve for the Fishing segment include the following primary procedures, among others:\na.We obtained an understanding of the relevant controls related to the obsolete and excess inventory and tested such controls for design and operating effectiveness.\nb.We tested the completeness of the inventory population subject to the obsolete and excess reserve, and in addition,we recalculated the reserve and confirmed that calculation conformed to the Company policy for inventory reserves.\nc.We performed a comparison of current year results compared to prior year estimates to evaluate management's reserve for obsolete and excess inventory by testing write-offs of inventory.\nd.We evaluated the reasonableness of management's significant assumptions related to predicted or forecasted demand, market conditions, and other industry conditions.\nWe have served as the Companys auditor since 2010.\n/s/ RSM US LLP\nMilwaukee, Wisconsin\nDecember 8, 2023\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended\n(thousands, except per share data)\nSeptember 29\n2023 September 30\n2022 October 1\nNet sales $ 663,844 $ 743,355 $ 751,651\nCost of sales 419,757 472,023 417,526\nGross profit 244,087 271,332 334,125\nOperating expenses:\nMarketing and selling 144,446 133,891 141,059\nAdministrative management, finance and information systems 56,497 43,419 56,083\nResearch and development 31,404 27,712 25,700\nTotal operating expenses 232,347 205,022 222,842\nOperating profit 11,740 66,310 111,283\nInterest income (4,543) (807) (366)\nInterest expense 152 153 145\nOther (income) expense, net (9,693) 8,076 (1,418)\nProfit before income taxes 25,824 58,888 112,922\nIncome tax expense 6,290 14,397 29,541\nNet income $ 19,534 $ 44,491 $ 83,381\nWeighted average common shares - Basic:\nClass A 8,968 8,913 8,864\nClass B 1,208 1,208 1,212\nDilutive stock options and restricted stock units 19 30 44\nWeighted average common shares - Dilutive 10,195 10,151 10,120\nNet income per common share - Basic:\nClass A $ 1.93 $ 4.42 $ 8.34\nClass B $ 1.75 $ 4.02 $ 7.57\nNet income per common share - Diluted:\nClass A $ 1.90 $ 4.37 $ 8.21\nClass B $ 1.90 $ 4.37 $ 8.21\nDividends declared per common share:\nClass A $ 1.26 $ 1.21 $ 0.93\nClass B $ 1.15 $ 1.10 $ 0.85\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYear Ended\n(thousands, except per share data)\nSeptember 29\n2023 September 30\n2022 October 1\nNet income $ 19,534 $ 44,491 $ 83,381\nOther comprehensive income (loss):\nForeign currency translation 2,790 (6,815) 283\nUnrealized loss on available-for-sale securities, net of tax (121) - -\nChange in pension plans, net of tax 34 49 2,386\nTotal other comprehensive income (loss) 2,703 (6,766) 2,669\nTotal comprehensive income $ 22,237 $ 37,725 $ 86,050\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED BALANCE SHEETS\n(thousands, except share data)\nSeptember 29\n2023 September 30\nASSETS\nCurrent assets:\nCash and cash equivalents $ 111,854 $ 129,803\nShort-term investments 26,764 -\nAccounts receivable, net 43,159 91,919\nInventories 261,474 248,649\nOther current assets 15,405 9,945\nTotal current assets 458,656 480,316\nInvestments 13,943 -\nProperty, plant and equipment, net of accumulated depreciation of $177,426 and $171,843, respectively\n94,353 89,125\nRight of use assets 50,746 56,625\nDeferred income taxes 18,352 11,411\nGoodwill 11,172 11,160\nOther intangible assets, net 8,472 8,372\nOther assets 25,912 22,922\nTotal assets $ 681,606 $ 679,931\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable 42,744 53,796\nCurrent lease liability 7,009 7,223\nAccrued liabilities:\nSalaries, wages and benefits 16,741 20,806\nAccrued warranty 11,741 9,639\nIncome taxes payable 4,252 3,186\nAccrued discounts and returns 8,176 5,214\nAccrued customer programs 3,774 4,726\nOther 9,569 10,123\nTotal current liabilities 104,006 114,713\nNon-current lease liability 45,335 50,680\nDeferred income taxes 1,838 1,752\nRetirement benefits 1,588 1,563\nDeferred compensation liability 24,607 21,466\nOther liabilities 4,495 1,743\nTotal liabilities 181,869 191,917\nShareholders' equity:\nPreferred stock: none issued\n- -\nCommon stock:\nClass A shares issued and outstanding: 9,043,189 and 8,984,253, respectively\n453 451\nClass B shares issued and outstanding: 1,207,760 and 1,207,798, respectively\n61 61\nCapital in excess of par value 88,234 87,351\nRetained earnings 409,574 402,821\nAccumulated other comprehensive income 3,323 620\nTreasury stock at cost, shares of Class A common stock: 25,342 and 45,961, respectively\n(1,908) (3,290)\nTotal shareholders' equity 499,737 488,014\nTotal liabilities and shareholders' equity $ 681,606 $ 679,931\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(thousands except for shares) Shares Common Stock Capital in\nExcess of Par\nValue Retained\nEarnings Accumulated\nOther\nComprehensive\nIncome (Loss) Treasury\nStock\nBALANCE AT OCTOBER 2, 2020 10,084,799 $ 504 $ 78,668 $ 296,431 $ 4,717 $ (2,220)\nNet income - - - 83,381 - -\nDividends declared - - - (9,311) - -\nIssuance of stock under employee stock purchase plan - - - - - -\nAward of non-vested shares 48,683 5 (4) - - -\nStock-based compensation - - 4,160 - - -\nCurrency translation adjustment - - - - 283 -\nChange in pension plans, net of tax - - - - 2,386 -\nNon-vested stock forfeitures (621) - 75 - - (75)\nPurchase of treasury stock at cost (5,661) - - - - (495)\nBALANCE AT OCTOBER 1, 2021 10,127,200 509 82,899 370,501 7,386 (2,790)\nNet income - - - 44,491 - -\nDividends declared - - - (12,171) - -\nIssuance of stock under employee stock purchase plan 5,112 - 332 - - -\nAward of non-vested shares 66,868 3 (3) - - -\nStock-based compensation - - 4,129 - - -\nB to A conversion - - (156) - - 156\nCurrency translation adjustment - - - - (6,815) -\nChange in pension plans, net of tax - - - - 49 -\nNon-vested stock forfeitures (2,040) - 150 - - (150)\nPurchase of treasury stock at cost (5,089) - - - - (506)\nBALANCE AT SEPTEMBER 30, 2022 10,192,051 512 87,351 402,821 620 (3,290)\nNet income - - - 19,534 - -\nDividends declared - - - (12,781) - -\nIssuance of stock under employee stock purchase plan 5,401 - 266 - - 460\nAward of non-vested shares 71,742 2 (2,586) - - 2,123\nStock-based compensation - - 2,446 - - -\nB to A conversion - - (2) - - 2\nCurrency translation adjustment - - - - 2,790 -\nUnrealized gain (loss) on available-for-sale securities, net of tax - - - - (121) -\nChange in pension plans, net of tax - - - - 34 -\nNon-vested stock forfeitures (10,632) - 759 - - (759)\nPurchase of treasury stock at cost (7,613) - - - - (444)\nBALANCE AT SEPTEMBER 29, 2023 10,250,949 $ 514 $ 88,234 $ 409,574 $ 3,323 $ (1,908)\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended\n(thousands) September 29\n2023 September 30\n2022 October 1\nCASH PROVIDED BY (USED FOR) OPERATING ACTIVITIES\nNet income $ 19,534 $ 44,491 $ 83,381\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation 16,005 13,973 12,980\nAmortization of intangible assets 290 261 421\nAmortization of deferred financing costs 35 35 29\n(Gain) loss on sale of productive assets (6,410) 90 161\nStock based compensation 2,446 4,129 4,160\nProvision for doubtful accounts receivable 177 30 308\nProvision for inventory reserves 10,225 4,409 518\nDeferred income taxes (6,925) 1,848 (2,277)\nChange in operating assets and liabilities:\nAccounts receivable, net 48,292 (22,028) (3,948)\nInventories, net (28,381) (89,259) (69,637)\nAccounts payable and accrued liabilities (10,800) (21,722) 31,702\nOther current assets (5,444) 2,831 (1,499)\nOther non-current assets 130 67 (226)\nOther long-term liabilities 2,634 (2,393) 2,614\nOther, net (95) 1,094 (369)\n41,713 (62,144) 58,318\nCASH USED FOR INVESTING ACTIVITIES\nPurchase of short-term investments (40,696) - -\nCapital expenditures (22,668) (31,690) (21,409)\nProceeds from sale of productive assets 14,990 12 28\n(48,374) (31,678) (21,381)\nCASH USED FOR FINANCING ACTIVITIES\nDebt issuance costs paid - - (138)\nCommon stock transactions 266 332 -\nDividends paid (12,554) (12,056) (8,400)\nPurchases of treasury stock (444) (509) (495)\n(12,732) (12,233) (9,033)\nEffect of foreign currency rate changes on cash 1,444 (4,590) 107\n(Decrease) increase in cash and cash equivalents (17,949) (110,645) 28,011\nCASH AND CASH EQUIVALENTS\nBeginning of period 129,803 240,448 212,437\nEnd of period $ 111,854 $ 129,803 $ 240,448\nSupplemental Disclosure:\nAccrued dividends $ 227 $ 115 $ 911\nNon-cash treasury activity 938 9 -\nCash paid for taxes 17,129 19,086 26,544\nCash paid for interest 114 113 114\nThe accompanying notes are an integral part of the Consolidated Financial Statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSEPTEMBER 29, 2023\n(IN THOUSANDS EXCEPT SHARE AND PER SHARE AMOUNTS)\n1 SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBusiness\nJohnson Outdoors Inc. (the Company) is an integrated, global outdoor recreation products company engaged in the innovative design, manufacture and marketing of brand name camping, diving, watercraft and marine electronics products.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Johnson Outdoors Inc. and all majority owned subsidiaries and are stated in conformity with U.S. generally accepted accounting principles. Intercompany accounts and transactions have been eliminated upon consolidation.\nUse of Estimates\nThe preparation of financial statements requires management to make estimates and assumptions that impact the reported amounts of assets, liabilities and operating results and the disclosure of commitments and contingent liabilities. Actual results could differ significantly from those estimates.\nFiscal Year\nThe Companys fiscal year ends on the Friday nearest September 30. The fiscal years ended September 29, 2023 (hereinafter 2023), September 30, 2022 (hereinafter 2022) and October 1, 2021 (hereinafter 2021) comprised 52 weeks.\nCash, Cash Equivalents and Marketable Securities\nThe Company considers all short-term investments in interest bearing accounts and all securities and other instruments with an original maturity of three months or less to be cash equivalents. Cash equivalents are stated at cost which approximates market value.\nThe Company maintains cash in bank accounts in excess of insured limits. The Company has not experienced any losses and does not believe that significant credit risk exists as a result of this practice.\nAs of September 29, 2023, the Company held approximately $49,838 of cash and cash equivalents in bank accounts in foreign jurisdictions.\nDuring the third quarter of fiscal 2023, the Company invested in marketable securities. The Company has classified all marketable securities as available-for-sale which requires the securities to be reported at estimated fair value, with unrealized gains and losses, net of tax, reported as a separate component of accumulated other comprehensive income in the Consolidated Statements of Shareholders' Equity.\nAt September 29, 2023, cost for marketable securities was determined using the specific identification method. A summary of the amortized costs and fair values of the Companys marketable securities at the end of the period presented is shown in the following table. All of the Companys marketable securities are classified as Level 2, as defined by FASB ASC 820, with fair values determined using significant other observable inputs, which include quoted prices in markets that are not active, quoted prices of similar securities, recently executed transactions, broker quotations, and other inputs that are observable.\nThe following table summarizes the Company's marketable securities measured at fair value as of September 29, 2023:\nAmortized Cost Fair Value Gross unrealized gains Gross unrealized losses\nFixed rate US Government Bonds $ 29,749 $ 29,686 $ - $ 63\nFixed rate Canadian Government Bonds $ 11,121 $ 11,021 $ - $ 100\nTotal $ 40,870 $ 40,707 $ - $ 163\nThere were no maturities or sales of available-for-sale securities during the years ended September 29, 2023, September 30, 2022 and October 1, 2021. No unrealized gains or losses were reclassified out of accumulated other comprehensive income during the same periods.\nThe contractual maturities of the marketable securities held at September 29, 2023 are as follows: $26,764 within one year, classified as Short-Term Investments on the Consolidated Balance Sheets, and $13,943 greater than one year, but less than five years, classified as Investments under non-current assets on the Consolidated Balance Sheets.\nAccounts Receivable\nAccounts receivable are recorded at face value less an allowance for doubtful accounts. The allowance for doubtful accounts is based on a combination of factors. In circumstances where specific collection concerns exist, a reserve is established to reduce the amount recorded to an amount the Company believes will be collected. For all other customers, the Company recognizes allowances for doubtful accounts based on historical experience of bad debts as a percent of outstanding accounts receivable for each business unit. Uncollectible accounts are written off against the allowance for doubtful accounts after collection efforts have been exhausted. The Company typically does not require collateral on its accounts receivable.\nInventories\nThe Company values inventory at the lower of cost (determined using the first-in first-out method) or net realizable value. Managements judgment is required to determine the reserve for obsolete or excess inventory. Inventory on hand may exceed future demand either because the product is outdated or because the amount on hand is more than will be used to meet future needs. Inventory reserves are estimated by the individual operating companies using standard quantitative measures based on criteria established by the Company. The Company also considers current forecast plans, as well as market and industry conditions in establishing reserve levels. Though the Company considers these reserve balances to be adequate, changes in economic conditions, customer inventory levels or competitive conditions could have a favorable or unfavorable effect on required reserve balances.\nInventories at the end of the respective fiscal years consisted of the following:\nSeptember 29\n2023 September 30\nRaw materials $ 114,467 $ 166,443\nWork in process - 230\nFinished goods 147,007 81,976\n$ 261,474 $ 248,649\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost less accumulated depreciation. Depreciation of property, plant and equipment is determined by straight-line methods over the following estimated useful lives:\nProperty improvements 5-20 years\nBuildings and improvements 20-40 years\nFurniture and fixtures, equipment and computer software 3-10 years\nUpon retirement or disposition of any of the foregoing types of assets, cost and the related accumulated depreciation are removed from the applicable account and any resulting gain or loss is recognized in the statements of operations.\nProperty, plant and equipment at the end of the respective years consisted of the following:\n2023 2022\nProperty improvements $ 380 $ 586\nBuildings and improvements 35,877 33,930\nFurniture and fixtures, equipment and computer software 235,522 226,452\n271,779 260,968\nLess accumulated depreciation 177,426 171,843\n$ 94,353 $ 89,125\nGoodwill\nThe Company applies a fair value-based impairment test to the carrying value of goodwill on an annual basis as of the last day of the eleventh month of the Companys fiscal year and, if certain events or circumstances indicate that an impairment loss may have been incurred, on an interim basis. The results of the impairment tests performed in 2023, 2022, and 2021 indicated no impairment to the Companys goodwill.\nIn conducting its analysis, the Company uses the income approach to compare the reporting units carrying value to its indicated fair value. Fair value is determined primarily by using a discounted cash flow methodology that requires considerable management judgment and long-term assumptions and is considered a Level 3 (unobservable) fair value determination in the fair value hierarchy (see Note 4 below).\nThe Companys impairment analysis is based on managements estimates. Due to the uncertainty of future events, the Company cannot assure that growth rates will not be lower than expected, that discount rates will not increase or that projected cash flows will not decline, all of which factors could impact the carrying value of any remaining goodwill (or portion thereof) in future periods, and accordingly, whether any impairment losses need to be recorded in future periods.\nThe changes in the carrying amount and the composition of the Company's goodwill for fiscal 2023 and 2022 were as follows:\nFishing Camping Watercraft Diving Total\nBalance at October 1, 2021\nGoodwill $ 17,450 $ 7,038 $ 6,242 $ 33,078 $ 63,808\nAccumulated impairment losses (6,229) (7,038) (6,242) (33,078) (52,587)\n11,221 - - - 11,221\nCurrency translation (61) - - - (61)\nBalance at September 30, 2022\nGoodwill 17,389 7,038 6,242 33,078 63,747\nAccumulated impairment losses (6,229) (7,038) (6,242) (33,078) (52,587)\n11,160 - - - 11,160\nCurrency translation 12 - - - 12\nBalance at September 29, 2023\nGoodwill 17,401 7,038 6,242 33,078 63,759\nAccumulated impairment losses (6,229) (7,038) (6,242) (33,078) (52,587)\n$ 11,172 $ - $ - $ - $ 11,172\nOther Intangible Assets\nIndefinite-lived intangible assets are also tested for impairment annually and, if certain events or circumstances indicate that an impairment loss may have been incurred, on an interim basis. There were no impairment losses recognized in fiscal 2023, 2022 or 2021.\nIntangible assets with definite lives are stated at cost less accumulated amortization. Amortization is computed using the straight-line method over periods ranging from 4 to 15 years. Amortization of patents and other intangible assets with definite lives was $290, $261 and $421 for 2023, 2022 and 2021, respectively. Amortization of these definite-lived intangible assets is expected to be approximately $324 for each of the next 3 fiscal years, $307 for fiscal 2027 and $102 for fiscal 2028.\nIntangible assets at the end of the last two years consisted of the following:\n2023 2022\nGross\nIntangible Accumulated\nAmortization Net Gross\nIntangible Accumulated\nAmortization Net\nAmortized other intangible assets:\nPatents and trademarks $ 4,045 $ (4,041) $ 4 $ 3,959 $ (3,956) $ 3\nOther amortizable intangibles 12,769 (11,326) 1,443 12,137 (10,793) 1,344\nNon-amortized trademarks 7,025 - 7,025 7,025 - 7,025\n$ 23,839 $ (15,367) $ 8,472 $ 23,121 $ (14,749) $ 8,372\nImpairment of Long-Lived Assets\nThe Company reviews long-lived assets for impairment whenever events or changes in business circumstances, such as unplanned negative cash flow, indicate that the carrying amount of these assets may not be fully recoverable. In such an event, the carrying amount of the asset group is compared to the future undiscounted cash flows expected to be generated by the asset group to determine if impairment exists on these assets. If impairment is determined to exist, any related impairment loss is calculated based on the difference between the fair value and the carrying value on these assets. During the fourth quarters of fiscal 2023 and 2022, the Company determined it was not necessary to perform an impairment analysis, as there were no events or changes in business circumstances that indicated that the carrying amount of the assets may not be fully recoverable. Accordingly, there was no impairment.\nWarranties\nThe Company provides for warranties of certain products as they are sold. Warranty reserves are estimated using standard quantitative measures based on criteria established by the Company. Estimates of costs to service its warranty obligations are based on historical experience, expectation of future conditions and known product issues. The following table summarizes the warranty activity for the three years in the period ended September 29, 2023.\nBalance at October 2, 2020 $ 10,849\nExpense accruals for warranties issued during the period 13,112\nLess current period warranty claims paid 9,888\nBalance at October 1, 2021 $ 14,073\nExpense accruals for warranties issued during the period 4,563\nLess current period warranty claims paid 8,997\nBalance at September 30, 2022 $ 9,639\nExpense accruals for warranties issued during the period 11,330\nLess current period warranty claims paid 9,228\nBalance at September 29, 2023 $ 11,741\nAccumulated Other Comprehensive Income\nThe components of Accumulated other comprehensive income (\"AOCI\") on the accompanying Consolidated Balance Sheets as of the end of fiscal year 2023, 2022 and 2021 were as follows:\n2023 2022 2021\nPre-Tax\nAmount Tax Effect Net of Tax\nEffect Pre-Tax\nAmount Tax Effect Net of Tax\nEffect Pre-Tax\nAmount Tax Effect Net of Tax\nEffect\nForeign currency translation adjustment $ 3,581 $ - $ 3,581 $ 791 $ - $ 791 $ 7,606 $ - $ 7,606\nUnrealized loss on available-for-sale securities (163) 42 (121) - - - - - -\nUnamortized loss on pension plans (276) 139 (137) (321) 150 (171) (386) 166 (220)\nAccumulated other comprehensive income $ 3,142 $ 181 $ 3,323 $ 470 $ 150 $ 620 $ 7,220 $ 166 $ 7,386\nThe reclassifications out of AOCI for the years ended September 29, 2023, September 30, 2022, and October 1, 2021 were as follows:\n2023 2022 2021 Statement of Operations\nPresentation\nUnamortized loss on defined benefit pension plans\nAmortization of loss $ 45 $ 45 $ 576 Cost of sales / Operating expense\nTax effects (11) (11) (144) Income tax expense\nTotal reclassifications for the period $ 34 $ 34 $ 432\nThe changes in AOCI by component, net of tax, for the year ended September 29, 2023 were as follows:\nForeign\nCurrency\nTranslation\nAdjustment Unrealized gain (loss) on available-for-sale securities Unamortized\nLoss on Defined\nBenefit Pension\nPlans Accumulated\nOther\nComprehensive\nIncome (Loss)\nBalance at September 30, 2022 $ 791 $ - $ (171) $ 620\nOther comprehensive income before reclassifications 2,790 (163) - 2,627\nAmounts reclassified from accumulated other comprehensive income - - 45 45\nTax effects - 42 (11) 31\nBalance at September 29, 2023 $ 3,581 $ (121) $ (137) $ 3,323\nThe changes in AOCI by component, net of tax, for the year ended September 30, 2022 were as follows:\nForeign\nCurrency\nTranslation\nAdjustment Unamortized\nLoss on Defined\nBenefit Pension\nPlans Accumulated\nOther\nComprehensive\nIncome (Loss)\nBalance at October 1, 2021 $ 7,606 $ (220) $ 7,386\nOther comprehensive income before reclassifications (6,815) 20 (6,795)\nAmounts reclassified from accumulated other comprehensive income - 45 45\nTax effects - (16) (16)\nBalance at September 30, 2022 $ 791 $ (171) $ 620\nEarnings per Share (EPS)\nNet income or loss per share of Class A common stock and Class B common stock is computed using the two-class method. Grants of restricted stock (whether vested or unvested) which receive non-forfeitable dividends are required to be included as part of the basic weighted average share calculation under the two-class method.\nHolders of Class A common stock are entitled to cash dividends equal to 110% of all dividends declared and paid on each share of Class B common stock. The Company grants shares of unvested restricted stock in the form of Class A shares, which carry the same distribution rights as the Class A common stock described above. As such, the undistributed earnings for each period are allocated to each class of common stock based on the proportionate share of the amount of cash dividends that each such class is entitled to receive.\nBasic EPS\nBasic net income or loss per share is computed by dividing net income or loss allocated to Class A common stock and Class B common stock by the weighted-average number of shares of Class A common stock and Class B common stock outstanding, respectively. In periods with cumulative year to date net income and undistributed income, the undistributed income for each period is allocated to each class of common stock based on the proportionate share of the amount of cash dividends that each such class is entitled to receive. In periods where there is a cumulative year to date net loss or no undistributed income because distributions through dividends exceed net income, Class B shares are treated as anti-dilutive and, therefore, net losses are allocated equally on a per share basis among all participating securities.\nFor the years ended September 29, 2023, September 30, 2022 and October 1, 2021, basic income per share for Class A and Class B shares has been presented using the two class method as described above.\nDiluted EPS\nDiluted net income per share is computed by dividing allocated net income by the weighted-average number of common shares outstanding, adjusted for the effect of dilutive stock options, restricted stock units and non-vested restricted stock. Anti-dilutive stock options, restricted stock units and non-vested stock are excluded from the calculation of diluted EPS. The computation of diluted net income per share of Class A common stock assumes that Class B common stock is converted into Class A common stock. Therefore, diluted net income per share is the same for both Class A and Class B common shares. In periods where the Company reports a net loss, the effect of anti-dilutive stock options, restricted stock units and non-vested stock is excluded and diluted loss per share is equal to basic loss per share.\nFor the years ended September 29, 2023, September 30, 2022 and October 1, 2021, diluted net income per share reflects the effect of dilutive stock options and restricted stock units and assumes the conversion of Class B common stock into Class A common stock.\nShares of non-vested stock that could potentially dilute earnings per share in the future which were not included in the fully diluted computation because they would have been anti-dilutive totaled 63,506, 39,956 and 38,914 shares for the years ended September 29, 2023, September 30, 2022 and October 1, 2021, respectively. Stock units that could potentially dilute earnings per share in the future and which were not included in the fully diluted computation because they would have been anti-dilutive totaled 49,531, 35,816 and 25,768 shares for the years ended September 29, 2023, September 30, 2022 and October 1, 2021, respectively.\nThe following table sets forth a reconciliation of net income to dilutive earnings used in the diluted earnings per common share calculations and the computation of basic and diluted earnings per common share:\n2023 2022 2021\nNet income $ 19,534 $ 44,491 $ 83,381\nLess: Undistributed earnings reallocated to non-vested shareholders (122) (174) (320)\nDilutive earnings $ 19,412 $ 44,317 $ 83,061\nWeighted average common shares - Basic:\nClass A 8,968 8,913 8,864\nClass B 1,208 1,208 1,212\nDilutive stock options and restricted stock units 19 30 44\nWeighted average common shares - Dilutive 10,195 10,151 10,120\nNet income per common share - Basic:\nClass A $ 1.93 $ 4.42 $ 8.34\nClass B $ 1.75 $ 4.02 $ 7.57\nNet income per common share - Diluted:\nClass A $ 1.90 $ 4.37 $ 8.21\nClass B $ 1.90 $ 4.37 $ 8.21\nStock-Based Compensation\nStock-based compensation cost is recorded for all awards of non-vested stock and restricted stock units based on their grant-date fair value. Stock-based compensation expense is recognized on a straight-line basis over the vesting period of each award. See Note 10 of these Notes to Consolidated Financial Statements for information regarding the Companys stock-based incentive plans, including non-vested stock, restricted stock units and employee stock purchase plans.\nIncome Taxes\nThe Company provides for income taxes currently payable and deferred income taxes resulting from temporary differences between financial statement income/loss and taxable income/loss. Accrued interest and penalties related to unrecognized tax benefits are recognized as a component of income tax expense. Deferred income tax assets and liabilities are determined based on the difference between the amounts reported in the financial statements and the tax basis of assets and liabilities, using enacted tax rates in effect in the years in which the differences are expected to reverse. Deferred income tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. A valuation allowance is established if it is more likely than not that some portion or all of a deferred income tax asset will not be realized. See Note 6 of these Notes to Consolidated Financial Statements for further discussion.\nEmployee Benefits\nThe Company and certain of its subsidiaries have various retirement and profit sharing plans. The Company does not have any significant foreign retirement plans. Retirement costs are funded at least annually. See Note 7 of these Notes to Consolidated Financial Statements for additional discussion.\nForeign Operations and Related Derivative Financial Instruments\nThe functional currencies of the Companys foreign operations are the local currencies. Accordingly, assets and liabilities of foreign operations are translated into U.S. dollars at the rate of exchange existing at the end of the year. Results of operations are translated at monthly average exchange rates. Adjustments resulting from the translation of foreign currency financial statements are classified as Accumulated other comprehensive income (loss), a separate component of Shareholders equity.\nCurrency gains and losses are recognized when assets and liabilities of foreign operations, denominated in other than their local currency, are converted into the local currency of the entity. Additionally, currency gains and losses are recognized through the settlement of transactions denominated in other than the local currency. The Company recognized currency losses from transactions of $114, $1,741 and $215 in 2023, 2022, and 2021, respectively, which were included in Other income, net in the accompanying Consolidated Statements of Operations.\nBecause the Company operates internationally, it has exposure to market risk from movements in foreign currency exchange rates. Approximately 14% of the Companys revenues for the year ended September 29, 2023 were denominated in currencies other than the U.S. dollar. Approximately 6% were denominated in euros and approximately 6% were denominated in Canadian\ndollars, with the remaining 2% denominated in various other foreign currencies. The Company may mitigate the impact on its operating results of a portion of the fluctuations in certain foreign currencies through the purchase of foreign currency swaps, forward contracts and options to hedge known commitments denominated in foreign currencies or borrowings in foreign currencies. The Company did not use foreign currency forward contracts in 2023, 2022 or 2021. The Company does not enter into foreign exchange contracts for trading or speculative purposes.\nAdvertising & Promotions\nThe Company expenses substantially all costs related to the production of advertising the first time the advertising takes place. Cooperative promotional arrangements are accrued as related revenue is earned.\nAdvertising and promotions expense in 2023, 2022 and 2021 totaled $35,503, $30,574 and $30,882, respectively. These charges are included in Marketing and selling expenses. Capitalized advertising costs, included in Other current assets, totaled $780 and $470 at September 29, 2023 and September 30, 2022, respectively, and primarily included catalogs and costs of advertising which have not yet run for the first time.\nShipping and Handling Costs\nShipping and handling fees billed to customers are included in Net sales. Shipping and handling costs are included in Marketing and selling expenses and totaled $15,519, $17,923 and $16,093 for 2023, 2022 and 2021, respectively.\nResearch and Development\nThe Company expenses research and development costs as incurred except for costs of software development for new electronic products and bathymetry data collection and processing, which are capitalized once technological feasibility is established and are included in Furniture, Fixtures and Equipment. The gross amount capitalized related to software development was $64,390, less accumulated amortization of $37,934, at September 29, 2023 and $58,857, less accumulated amortization of $33,872, at September 30, 2022. These costs are amortized over the expected life of the software of three to seven years. Amortization expense related to capitalized software in 2023, 2022 and 2021 was $4,062, $3,444 and $3,637, respectively, and is included in depreciation expense on plant, property and equipment.\nFair Values\nThe carrying amounts of cash, cash equivalents, short-term investments, accounts receivable, and accounts payable approximated fair value at September 29, 2023 and September 30, 2022 due to the short maturities of these instruments. During 2023, 2022 and 2021, the Company held investments in equity and debt securities that were carried at fair value related to its deferred compensation liability which was also carried at the same fair value. When indicators of impairment are present, the Company may be required to value certain long-lived assets such as property, plant, and equipment, and other intangibles at fair value.\nValuation Techniques\nRabbi Trust Assets\nRabbi trust assets, used to fund amounts the Company owes to certain officers and other employees under the Companys non-qualified deferred compensation plan, are included in Other assets, and are classified as trading securities. These assets are comprised of marketable debt and equity securities that are marked to fair value based on unadjusted quoted prices in active markets.\nMarketable Securities\nMarketable securities, which are included in \"Short-term Investments\" and \"Investments\", based on maturity date, are classified as available-for-sale securities. These assets are comprised of marketable debt securities, with fair values determined using significant other observable inputs, which include quoted prices in markets that are not active, quoted prices of similar securities, recently executed transactions, broker quotations, and other inputs that are observable.\nGoodwill and Other Intangible Assets\nIn assessing the recoverability of the Companys goodwill and other intangible assets, the Company estimates the future discounted cash flows of the business segments to which the goodwill relates. When estimated future discounted cash flows are less than the carrying value of the net assets and related goodwill, an impairment charge is recognized based on the excess of the carrying amount over the fair value. In determining estimated future cash flows, the Company makes assumptions regarding anticipated financial position, future earnings and other factors to determine the fair value of the respective assets.\nSee Note 4 of these Notes to Consolidated Financial Statements for disclosures regarding fair value measurements.\nNew Accounting Pronouncements\nRecently adopted accounting pronouncements\nIn June 2016, the FASB issued ASU 2016-13 Financial Instruments - Credit Losses (Topic 326) and also issued subsequent amendments to the initial guidance under ASU 2018-19, ASU 2019-04 and ASU 2019-05 (collectively Topic 326). Topic 326 requires the measurement and recognition of expected credit losses for financial assets held at amortized cost. This replaces the existing incurred loss model with an expected loss model and requires the use of forward-looking information to calculate credit loss estimates. This guidance was effective for the Company in the first quarter of fiscal year 2021, and must be adopted by applying a cumulative effect adjustment to retained earnings. The Company adopted the provisions of this ASU at the beginning of the first quarter of fiscal 2021, however the ASU did not have a significant impact on its financial statements, and therefore no adjustment to retained earnings was necessary.\nIn August 2018, the FASB issued ASU 2018-14, Changes to the Disclosure Requirements for Defined Benefit Plans (Topic 715). This ASU will modify the disclosure requirements for employers that sponsor defined pension or postretirement plans. The amendments in this guidance are effective for fiscal years ending after December 15, 2020, with early adoption permitted. The Company adopted the provisions of this ASU in fiscal 2021, however, the ASU did not have a significant impact on its disclosures.\nIn December 2019, the FASB issued ASU No. 2019-12, Income Taxes (Topic 740)-Simplifying the Accounting for Income Taxes. ASU 2019-12 is intended to simplify accounting for income taxes. It removes certain exceptions to the general principles in Topic 740 and amends existing guidance to improve consistent application. ASU 2019-12 is effective for fiscal years beginning after December 15, 2020 and interim periods within those fiscal years, with early adoption permitted. The Company adopted the provisions of this ASU in fiscal 2022, however, the ASU did not have a significant impact on its financial statements or disclosures.\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848). ASU 2020-04 is intended to provide optional expedients and exceptions for applying generally accepted accounting principles to contracts, hedging relationships, and other transactions affected by the discontinuation of the London Interbank Offered Rate (LIBOR) or by another reference rate expected to be discontinued. Subsequently in December 2022, the FASB issued ASU 2022-06, Reference Rate Reform (Topic 848)-Deferral of the Sunset Date of Topic 848, which delayed the effective date to December 31, 2024. The Company adopted Topic 848 in the fourth fiscal quarter of 2023, and does not expect this guidance to have a significant impact on its financial statements and disclosures.\n2 INDEBTEDNESS\nThe Company had no outstanding debt at September 29, 2023 or September 30, 2022.\nRevolvers\nThe Company and certain of its subsidiaries have entered into an unsecured revolving credit facility with PNC Bank, National Association and Associated Bank, N.A. (\"the Lending Group\"). This credit facility consists of a $75 million Revolving Credit Facility among the Company, certain of the Company's subsidiaries, PNC Bank National Association, as lender and as administrative agent, and the other lender named therein (the \"Credit Agreement\" or \"Revolver\"). The Revolver provides for borrowing of up to an aggregate principal amount not to exceed $75,000 with a $50,000 accordion feature that gives the Company the option to increase the maximum financing availability (i.e., an aggregate borrowing amount of $125,000) subject to the conditions of the Credit Agreement and subject to the approval of the lenders. On July 15, 2021, the Company entered into a First Amendment to this credit facility that extended its expiration date from November 15, 2022, to July 15, 2026. Other key provisions of the credit facility remained as outlined above and the description herein is qualified in its entirety by the terms and conditions of the original Debt Agreement (a copy of which was filed as Exhibit 99.1 to the current report on Form 8-K dated and filed with the Securities and Exchange Commission on November 20, 2017) and the Amendment (a copy of which was filed as Exhibit 10.1 to the current report on Form 8-K dated and filed with the Securities and Exchange Commission on July 16, 2021).\nThe interest rate on the Revolver is based on the Secured Overnight Financing Rate (\"SOFR\") plus an applicable margin, which margin resets each quarter. The applicable margin ranges from 1.00% to 1.75% and is dependent on the Company's leverage\nratio for the trailing twelve month period. The interest rates on the Revolver were approximately 6.4% at September 29, 2023 and 4.1% at September 30, 2022.\nThe Credit Agreement restricts the Company's ability to incur additional debt, includes maximum leverage ratio and minimum interest coverage ratio covenants and is unsecured.\nOther Borrowings\nThe Company utilizes letters of credit primarily as security for the payment of future claims under its workers compensation insurance which totaled $67 and $173 at September 29, 2023 and September 30, 2022, respectively. The Company had no other unsecured lines of credit as of September 29, 2023 or September 30, 2022.\nUnder the Companys Credit Agreement, a change in control of the Company would constitute an event of default. A change in control would be deemed to have occurred if, among other events described in the terms of the Credit Agreement, a person or group other than the Companys Chief Executive Officer, Helen P. Johnson-Leipold, members of her family and related entities (hereinafter the Johnson Family) became or obtained rights as a beneficial owner (as interpreted under the Securities Exchange Act of 1934) of a certain minimum percentage of the outstanding capital stock of the Company.\n3 DERIVATIVE INSTRUMENTS AND HEDGING ACTIVITIES\nThe following disclosures describe the Companys objectives in using derivative instruments, the business purpose or context for using derivative instruments, and how the Company believes the use of derivative instruments helps achieve the stated objectives. In addition, the following disclosures describe the effects of the Companys use of derivative instruments and hedging activities on its financial statements. See Note 4 of these Notes to Consolidated Financial Statements for disclosures regarding the fair value and effects of changes in the fair value of derivative instruments.\nForeign Exchange Risk\nThe Company has significant foreign operations, for which the functional currencies are denominated primarily in euros, Swiss francs, Hong Kong dollars and Canadian dollars. As the values of the currencies of the foreign countries in which the Company has operations increase or decrease relative to the U.S. dollar, the sales, expenses, profits, losses, assets and liabilities of the Companys foreign operations, as reported in the Companys consolidated financial statements, increase or decrease, accordingly. Approximately 14% of the Companys revenues for the fiscal year ended September 29, 2023 were denominated in currencies other than the U.S. dollar. Approximately 6% were denominated in euros and approximately 6% were denominated in Canadian dollars, with the remaining 2% denominated in various other foreign currencies. Changes in foreign currency exchange rates can cause unexpected financial losses or cash flow needs.\nThe Company may mitigate the impact on its operating results of a portion of the fluctuations in certain foreign currencies through the use of foreign currency forward contracts. Foreign currency forward contracts enable the Company to lock in the foreign currency exchange rate for a fixed amount of currency to be paid or received on a specified date in the future. The Company may use such foreign currency forward contracts to mitigate the risk associated with changes in foreign currency exchange rates on financial instruments and known commitments denominated in foreign currencies. As of September 29, 2023 and September 30, 2022, the Company held no foreign currency forward contracts.\nInterest Rate Risk\nAs of September 29, 2023 and September 30, 2022, the Company held no interest rate swap contracts.\n4 FAIR VALUE MEASUREMENTS\nFair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. A fair value hierarchy has been established based on three levels of inputs, of which the first two are considered observable and the last unobservable.\nLevel 1 - Quoted prices in active markets for identical assets or liabilities. These are typically obtained from real-time quotes for transactions in active exchange markets involving identical assets.\nLevel 2 - Inputs, other than quoted prices included within Level 1, which are observable for the asset or liability, either directly or indirectly. These are typically obtained from readily-available pricing sources for comparable instruments.\nLevel 3 - Unobservable inputs, where there is little or no market activity for the asset or liability. These inputs reflect the reporting entitys own assumptions of the data that market participants would use in pricing the asset or liability, based on the best information available in the circumstances.\nThe following table summarizes the Companys financial assets measured at fair value as of September 29, 2023:\nLevel 1 Level 2 Level 3 Total\nAssets:\nRabbi trust assets $ 24,562 $ - $ - $ 24,562\nThe following table summarizes the Companys financial assets measured at fair value as of September 30, 2022:\nLevel 1 Level 2 Level 3 Total\nAssets:\nRabbi trust assets $ 21,436 $ - $ - $ 21,436\nRabbi trust assets are classified as trading securities and are comprised of marketable debt and equity securities that are marked to fair value based on unadjusted quoted prices in active markets. The rabbi trust assets are owed by the Company to certain officers and other employees under the Companys non-qualified deferred compensation plan. These assets are included in \"Other assets\" in the Company's Consolidated Balance Sheets, and the mark-to-market adjustments on the assets are recorded in Other income, net in the accompanying Consolidated Statements of Operations. The offsetting deferred compensation liability is also reported at fair value and is included in Deferred compensation liability in the Companys Consolidated Balance Sheets. Changes in the liability are recorded in \"Administrative management, finance and information systems\" expense in the accompanying Consolidated Statements of Operations.\nThe effect of changes in the fair value of financial instruments on the Consolidated Statements of Operations for the years ended September 29, 2023, September 30, 2022 and October 1, 2021 was:\nLocation of income recognized in Statement of\nOperations 2023 2022 2021\nRabbi trust assets Other (income) expense, net $ (2,862) $ 6,424 $ (4,878)\nCertain assets and liabilities are measured at fair value on a non-recurring basis in periods subsequent to their initial recognition. No assets or liabilities were measured at fair value on a non-recurring basis in 2023, 2022, or 2021.\n5 LEASES\nThe Company determines if an arrangement is a lease at inception. The Company leases certain facilities and machinery and equipment under long-term, non-cancelable operating leases. As an ongoing accounting policy election under Topic 842, the Company excludes short-term leases (terms of 12 months or less) from the balance sheet presentation and accounts for non-lease and lease components in a contract as a single lease component for most asset classes. All leases in which the Company is the lessee are classified as operating leases, and the Company does not have any finance leases or sublease agreements. Additionally, the Company does not have any leases in which it is the lessor.\nAs of September 29, 2023, the Company had approximately 200 leases, with remaining terms ranging from less than one year to 16 years. Some of the leases contain variable payment terms, such as payments based on fluctuations in the Consumer Price Index (CPI). Some leases also contain options to extend or terminate the lease. To the extent the Company is reasonably certain to exercise these options, they have been considered in the calculation of the right-of-use (\"ROU\") assets and lease liabilities. Under current lease agreements, there are no residual value guarantees or restrictive lease covenants. In calculating the ROU assets and lease liabilities, several assumptions and judgments were made by the Company, including whether a contract is or contains a lease under the new definition, and the determination of the discount rate, which is assumed to be the\nincremental borrowing rate. The incremental borrowing rate is derived from information available to the Company at the lease commencement date based on lease length and location.\nAs of September 29, 2023, the components of lease expense recognized in the accompanying Condensed Consolidated Statements of Operations were as follows:\nYear ended Year ended Year ended\nSeptember 29, 2023 September 30, 2022 October 1, 2021\nLease Cost\nOperating lease costs $ 9,819 $ 9,129 $ 8,323\nShort-term lease costs 2,493 1,739 1,549\nVariable leases costs 171 172 184\nTotal lease cost $ 12,483 $ 11,040 $ 10,056\nIncluded in the amounts in the table above was rent expense to related parties of $1,255, $1,209 and $1,043, for the years ended September 29, 2023 September 30, 2022, and October 1, 2021, respectively.\nAs of September 29, 2023 and September 30, 2022, the Company did not have any finance leases. While the Company extended or renewed various existing leases during the year, there were no significant new leases entered into during the year ended September 29, 2023. As of September 29, 2023, the Company did not have any significant operating lease commitments that have not yet commenced.\nSupplemental balance sheet, cash flow, and other information related to operating leases was as follows:\nYear ended Year ended\nSeptember 29, 2023 September 30, 2022\nOperating leases:\nOperating lease ROU assets $ 50,746 $ 56,625\nCurrent operating leases liabilities 7,009 7,223\nNon-current operating lease liabilities 45,335 50,680\nTotal operating lease liabilities $ 52,344 $ 57,903\nWeighted average remaining lease term (in years) 11.96 12.59\nWeighted average discount rate 3.21 % 3.15 %\nCash paid for amounts included in the measurement of lease liabilities $ 8,858 $ 8,066\nROU assets obtained in exchange for lease liabilities $ 3,686 $ 13,296\nFuture minimum rental commitments under non-cancelable operating leases with an initial lease term in excess of one year at September 29, 2023 were as follows:\nYear Related parties included\nin total Total\n2024 $ 1,270 $ 8,506\n2025 1,308 7,846\n2026 1,348 6,142\n2027 226 4,914\n2028 - 3,728\nThereafter - 32,551\nTotal undiscounted lease payments 4,152 63,687\nLess: Imputed interest (103) (11,343)\nTotal net lease liability $ 4,049 $ 52,344\n6 INCOME TAXES\nThe U.S. and foreign income before income taxes for the respective years consisted of the following:\n2023 2022 2021\nUnited States $ 16,070 $ 51,229 $ 99,774\nForeign 9,754 7,659 13,148\n$ 25,824 $ 58,888 $ 112,922\nIncome tax expense for the respective years consisted of the following:\n2023 2022 2021\nCurrent:\nFederal $ 7,631 $ 8,798 $ 22,860\nState 2,267 834 6,392\nForeign 3,286 2,922 3,236\nDeferred (6,894) 1,843 (2,947)\n$ 6,290 $ 14,397 $ 29,541\nThe tax effects of temporary differences that give rise to deferred tax assets and deferred tax liabilities at the end of the respective years are presented below:\n2023 2022\nDeferred tax assets:\nInventories $ 4,628 $ 2,366\nCompensation 6,954 8,099\nLease liabilities\n12,956 14,168\nTax credit carryforwards 2,116 2,356\nNet operating loss carryforwards 5,488 4,805\nResearch and Experimental Expenditures 4,536 -\nOther 7,310 6,430\nTotal gross deferred tax assets 43,988 38,224\nLess valuation allowance 7,101 6,700\nDeferred tax assets 36,887 31,524\nDeferred tax liabilities:\nGoodwill and other intangibles 2,476 1,848\nRight of Use assets\n12,571 13,864\nDepreciation and amortization 4,578 5,528\nForeign statutory reserves 748 625\nNet deferred tax assets $ 16,514 $ 9,659\nThe net deferred tax assets recorded in the accompanying Consolidated Balance Sheets as of the years ended September 29, 2023 and September 30, 2022 were as follows:\n2023 2022\nNon-current assets $ 18,352 $ 11,411\nNon-current liabilities 1,838 1,752\nNet deferred tax assets $ 16,514 $ 9,659\nThe significant differences between the statutory federal tax rate and the effective income tax rates for the Company for the respective years shown below were as follows:\n2023 2022 2021\nStatutory U.S. federal income tax rate 21.0 % 21.0 % 21.0 %\nState income tax, net of federal benefit 3.4 % 3.4 % 4.4 %\nUncertain tax positions, net of settlements (0.3) % (0.5) % 0.1 %\nForeign-derived intangible income (\"FDII\") deduction (2.3) % (0.9) % (1.1) %\nForeign tax rate differences 2.2 % 1.5 % 0.6 %\nCompensation 2.4 % 0.1 % 0.8 %\nChanges in estimates related to prior years tax return filing (1.3) % (1.6) % (0.5) %\nDeferred tax asset - valuation allowance 1.7 % 1.6 % 0.6 %\nTax Credits (2.5) % (0.7) % (0.4) %\nOther 0.1 % 0.5 % 0.7 %\n24.4 % 24.4 % 26.2 %\nThe Companys net operating loss carryforwards and their expirations as of September 29, 2023 were as follows:\nState Foreign Total\nYear of expiration\n2024-2028 $ 2,118 $ 8,346 $ 10,464\n2029-2033 2,326 6,365 8,691\n2034-2038 4,447 - 4,447\n2039-2043 774 - 774\nIndefinite 2 6,800 6,802\nTotal $ 9,667 $ 21,511 $ 31,178\nThe Company has tax credit carryforwards as follows:\nState Federal Total\nYear of expiration\n2024-2028 $ 1,365 $ 1,365\n2029-2033 598 598\n2034-2038 119 119\nTotal $ 2,082 $ - $ 2,082\nA reconciliation of the beginning and ending amount of unrecognized tax benefits follows:\n2023 2022\nBeginning balance $ 6,201 $ 6,757\nGross increases - tax positions in prior period - -\nGross decreases - tax positions in prior period - -\nGross increases - tax positions in current period 493 476\nSettlements - -\nLapse of statute of limitations\n(598) (1,032)\nEnding balance $ 6,096 $ 6,201\nThe total accrued interest and penalties with respect to income taxes was approximately $1,913 and $1,866 for the years ended September 29, 2023 and September 30, 2022, respectively. The Companys liability for unrecognized tax benefits as of September 29, 2023 was $6,096, and if recognized, $5,107 of such amount would have an effective tax rate impact.\nIn accordance with its accounting policy, the Company recognizes accrued interest and penalties related to unrecognized tax benefits as a component of income tax expense. Interest and penalties of $47, $(15) and $(63) were recorded as a component of income tax expense in the accompanying Consolidated Statements of Operations during fiscal years 2023, 2022 and 2021, respectively.\nThe Companys policy is to remit earnings from foreign subsidiaries only to the extent the remittance does not result in an incremental U.S. tax liability. The Company does not currently provide for the additional U.S. and foreign income taxes which would become payable upon remission of undistributed earnings of foreign subsidiaries. If all undistributed earnings were remitted, an additional income tax provision of approximately $15.4 million would have been necessary as of September 29, 2023.\nThe Company files income tax returns, including returns for its subsidiaries, with federal, state, local and foreign taxing jurisdictions. The amount of unrecognized tax benefits recognized within the next twelve months may decrease due to expiration of the statute of limitations for certain years in various jurisdictions. However, it is possible that a jurisdiction may open an audit prior to the statute expiring that may result in adjustments to the Companys tax filings. At this time, an estimate of the range of the reasonably possible change cannot be made.\nThe following tax years remain subject to examination by the Company's respective major tax jurisdictions:\nJurisdiction Fiscal Years\nUnited States 2020-2023\nCanada 2019-2023\nFrance 2020-2023\nGermany 2018-2023\nItaly 2021-2023\nSwitzerland 2013-2023\n7 EMPLOYEE BENEFITS\nA majority of the Companys full-time employees are covered by defined contribution programs. Expenses attributable to the defined contribution programs were approximately $2,190, $2,044 and $1,680 for 2023, 2022 and 2021, respectively.\nThe Company also has a non-qualified deferred compensation plan that provides certain officers and employees the ability to defer a portion of their compensation until a later date. The deferred amounts and earnings thereon are payable to participants, or designated beneficiaries, at specified future dates upon retirement, death or termination of employment from the Company. The deferred compensation liability, which is reported at fair value equal to the related rabbi trust assets, and is classified as Deferred compensation liability on our accompanying Consolidated Balance Sheets, was approximately $24,607 and $21,466 as of September 29, 2023 and September 30, 2022, respectively. See Note 4 Fair Value for additional information.\nDuring fiscal 2021, the Company terminated its Johnson Outdoors Inc. Mankato Operations Pension Plan and Old Town Canoe Company Pension Plan (collectively, \"the Terminated Plans\"), both of which were frozen defined benefit pension plans at the time of termination. In connection with the plan terminations, the Company settled all future obligations under the Terminated Plans through a combination of lump-sum payments to eligible participants who elected to receive them, and the transfer of any remaining benefit obligations under the Terminated Plans to a third-party insurance company under a group annuity contract. As a result of these actions, the Company recognized a non-cash pre-tax pension termination charge of $2,526 in our fiscal 2021 Consolidated Statements of Operations as Other Expense (Income), Net. The remaining over-funded plan assets have been or will be utilized by the Company to fund remaining expenses related to the Terminated Plans, as well as obligations associated with other qualified retirement programs. The Company still maintains the Johnson Outdoors Inc. Supplemental Executive Retirement Plan (\"SERP\"), and all future benefit payments to participants under this plan are made from the Company's general assets.\n8 PREFERRED STOCK\nThe Company is authorized to issue 1,000,000 shares of preferred stock in various classes and series, of which there are none currently issued and none outstanding.\n9 COMMON STOCK\nThe number of authorized and outstanding shares of each class of the Companys common stock at the end of the respective years was as follows:\n2023 2022\nClass A, $0.05 par value:\nAuthorized 20,000,000 20,000,000\nOutstanding 9,043,189 8,984,253\nClass B, $0.05 par value:\nAuthorized 3,000,000 3,000,000\nOutstanding 1,207,760 1,207,798\nHolders of Class A common stock are entitled to elect 25%, or the next highest whole number, of the members of the Companys Board of Directors and holders of Class B common stock are entitled to elect the remaining directors. With respect to matters other than the election of directors or any matters for which class voting is required by law, holders of Class A common stock are entitled to one vote per share while holders of Class B common stock are entitled to ten votes per share. If any dividends (other than dividends paid in shares of the Companys stock) are paid by the Company on its common stock, a dividend would be paid on each share of Class A common stock equal to 110% of the amount paid on each share of Class B common stock. Each share of Class B common stock is convertible at any time into one share of Class A common stock. During 2023 and 2022 there were 38 and 3,766 shares of Class B common stock converted into Class A common stock, respectively.\n10 STOCK-BASED COMPENSATION AND STOCK OWNERSHIP PLANS\nThe Companys current stock ownership plans provide for issuance of options to acquire shares of Class A common stock by key executives and non-employee directors. Current plans also allow for issuance of shares of restricted stock, restricted stock units or stock appreciation rights in lieu of options.\nUnder the Companys 2023 Non-Employee Director Stock Ownership Plan and the 2020 Long-Term Incentive Plan (the only plans where shares currently remain available for future equity incentive awards) there were a total of 468,066 shares of the Companys Class A common stock available for grant to key executives and non-employee directors at September 29, 2023. Share awards previously made under the Company's 2010 Long-Term Stock Incentive Plan and 2012 Non-Employee Director Stock Ownership Plan, which no longer allow for additional share grants, also remain outstanding.\nThe Company recognized additional tax expense of $95 for 2023 from the vesting of restricted stock and restricted stock units, and additional tax benefits of $98 and $581 for 2022 and 2021, respectively. These amounts were recorded as a component of income tax expense. The Company recognizes forfeitures of equity awards as incurred.\nNon-Vested Stock\nAll shares of non-vested stock awarded by the Company have been granted at their fair market value on the date of grant and vest within five years after the grant date. The fair value at date of grant is based on the number of shares granted and the average of the Companys high and low Class A common stock price on the date of grant or, if the Companys shares did not trade on the date of grant, the average of the Companys high and low Class A common stock price on the last preceding date on which the Companys shares traded.\nA summary of non-vested stock activity for the two year period ended September 29, 2023 related to the Companys stock ownership plans is as follows:\nShares Weighted Average\nGrant Price\nNon-vested stock at October 1, 2021 37,591 $ 80.86\nNon-vested stock grants 33,911 72.40\nNon-vested stock forfeited (2,040) 73.53\nRestricted stock vested (11,326) 95.34\nNon-vested stock at September 30, 2022 58,136 73.37\nNon-vested stock grants 28,528 59.25\nNon-vested stock forfeited (10,632) 71.41\nRestricted stock vested (14,790) 76.07\nNon-vested stock September 29, 2023 61,242 66.48\nNon-vested stock grantees may elect to reimburse the Company for withholding taxes due as a result of the vesting of shares by tendering a portion of the vested shares back to the Company. Shares tendered back to the Company were 2,289 and 1,778 during 2023 and 2022, respectively. The fair value of restricted stock vested during 2023, 2022 and 2021 was approximately $909, $1,002 and $1,950, respectively.\nStock compensation expense, net of forfeitures, related to non-vested stock was $1,612, $1,252 and $1,179 during 2023, 2022 and 2021, respectively. The tax benefit recognized during 2023, 2022 and 2021 related to stock based compensation was $390, $295 and $287, respectively. Unrecognized compensation cost related to non-vested stock as of September 29, 2023 was $1,900, which amount will be amortized to expense through November 2025 or adjusted for changes in future estimated or actual forfeitures.\nRestricted Stock Units\nAll restricted stock units awarded by the Company during fiscal 2023 and in prior years have been granted at their fair market value on the date of grant. The fair value at date of grant is based on the number of units granted and the average of the Companys high and low Class A common stock trading price on the date of grant or, if the Companys shares did not trade on the date of grant, the average of the Companys high and low Class A common stock trading price on the last preceding date on which the Companys shares traded. The vesting period for RSUs is generally one year from the date of grant for RSUs granted to directors and three years from the date of the grant for RSUs granted to employees.\nA summary of RSU activity follows:\nNumber of RSUs Weighted Average\nGrant Price\nRSUs at October 1, 2021 69,768 $ 73.60\nRSUs granted 19,758 101.22\nRSUs forfeited (1,340) 71.42\nRSUs vested (22,192) 74.62\nRSUs at September 30, 2022 65,994 82.58\nRSUs granted 36,484 56.54\nRSUs forfeited (7,492) 76.75\nRSUs vested (26,742) 64.51\nRSUs at September 29, 2023 68,244 76.38\nRSU grantees may elect to reimburse the Company for withholding taxes due as a result of the vesting of units and issuance of unrestricted shares of Class A common stock by tendering a portion of such unrestricted shares back to the Company. Shares tendered back to the Company were 5,324 and 3,331 during 2023 and 2022, respectively. The fair value of restricted stock units vested during 2023, 2022 and 2021 was approximately $2,247, $3,240 and $3,353, respectively.\nStock compensation expense, net of forfeitures, related to restricted stock units was $732, $2,522 and $2,895 for the years ended September 29, 2023, September 30, 2022 and October 1, 2021, respectively. The tax benefit recognized during 2023, 2022 and 2021 related to restricted stock unit based compensation was $462, $242 and $290, respectively. Unrecognized\ncompensation cost related to non-vested restricted stock units as of September 29, 2023 was $131, which amount will be amortized to expense through September 2024 or adjusted for changes in future estimated or actual forfeitures.\nCompensation expense related to units earned by certain employees is based upon the attainment of certain financial goals related to cumulative net sales and cumulative operating profit over a three-year performance period. Awards are only paid if at least 80% of the target levels are met and maximum payouts are made if 120% of more of target levels are achieved. The payouts for achievement at the minimum threshold levels of performance are equal to 50% of the target award amount. The payouts for achievement at maximum levels of performance are equal to 150% of the target award amount. To the extent earned, awards are issued in shares of Company common stock after the end of the three year performance period.\nEmployee Stock Purchase Plan\nThe 2009 Employees Stock Purchase Plan (the Purchase Plan) provides for the issuance of shares of Class A common stock at a purchase price of not less than 85% of the fair market value of such shares on the date of grant or at the end of the offering period, whichever is lower.\nThe Company issued 5,401, 5,112 and 0 shares of Class A common stock under the Purchase Plan during the years 2023, 2022 and 2021, respectively, and recognized expense of $102, $355 and $86 in 2023, 2022 and 2021, respectively.\n11 RELATED PARTY TRANSACTIONS\nThe Company conducts transactions with certain related parties including organizations controlled by the Johnson Family. These transactions include product purchases, aviation services, office rental, and facility fees. Total costs of these transactions were $1,473, $1,425 and $1,243 for 2023, 2022 and 2021, respectively. Amounts due to/from related parties were immaterial at September 29, 2023 and September 30, 2022.\n12 REVENUES\nRevenue recognition\nRevenue is recognized when obligations under the terms of a contract with our customer are satisfied; generally this occurs with the transfer of control of our goods at a point in time based on shipping terms and transfer of title. Revenue is measured as the amount of consideration we expect to receive in exchange for transferring goods. The amount of consideration received can vary, primarily because of customer incentive or rebate arrangements. The Company estimates variable consideration based on the expected value of total consideration to which customers are likely to be entitled based on historical experience and projected market expectations. Included in the estimate is an assessment as to whether any variable consideration is constrained. Revenue estimates are adjusted at the earlier of a change in the expected value of consideration or when the consideration becomes fixed. For all contracts with customers, the Company has not adjusted the promised amount of consideration for the effects of a significant financing component as the period between the transfer of the promised goods and the customer's payment is expected to be one year or less. Sales are made on normal and customary short-term credit terms, generally ranging from 30 to 90 days, or upon delivery of point of sale transactions. Sales, value add, and other taxes we collect concurrent with revenue-producing activities are excluded from revenue.\nThe Company enters into contractual arrangements with customers in the form of individual customer orders which specify the goods, quantity, pricing, and associated order terms. The Company does not have contracts which are satisfied over time. Due to the nature of these contracts, no significant judgment exists in relation to the identification of the customer contract, satisfaction of the performance obligation, or transaction price. The Company expenses incremental costs of obtaining a contract due to the short-term nature of the contracts.\nEstimated costs of returns, allowances and discounts, based on historic experience, are accrued as a reduction to sales when revenue is recognized. The Company provides customers the right to return eligible products under certain circumstances. At September 29, 2023, the right to returns asset was $702 and the accrued returns liability was $1,758. At September 30, 2022, the right to returns asset was $768 and the accrued returns liability was $2,173. The Company also offers assurance-type warranties relating to its products sold to end customers that continue to be accounted for under ASC 460 Guarantees.\nThe Company generally accounts for shipping and handling activities as a fulfillment activity, consistent with the timing of revenue recognition; that is, when a customer takes control of the transferred goods. In the event that a customer were to take control of a product upon or after shipment, the Company has made an accounting policy election to treat such shipping and\nhandling activities as a fulfillment cost. Shipping and handling fees billed to customers are included in \"Net Sales,\" and shipping and handling costs are recognized within \"Marketing and selling expenses\" in the same period the related revenue is recognized.\nThe Company has a wide variety of seasonal, outdoor recreation products used primarily for fishing from a boat, diving, paddling, hiking and camping, that are sold to a variety of customers in multiple end markets. While there are multiple products sold, the nature of products are similar in terms of the nature of the revenue recognition policies.\nSee Note 13 of these Notes to Consolidated Financial Statements for required disclosures of disaggregated revenue.\n13 SEGMENTS OF BUSINESS\nThe Company conducts its worldwide operations through separate business segments, each of which represent major product lines. Operations are conducted in the U.S. and various foreign countries, primarily in Europe, Canada and the Pacific Basin. During the years ended September 29, 2023, September 30, 2022, and October 1, 2021, combined sales to one customer of the Company's Fishing, Camping and Watercraft Recreation segments represented approximately $101,392, $97,174, and $114,008 respectively, of the Company's consolidated revenues.\nThe Company sold the Military and Commercial Tent product lines of its Camping business segment to a third party in an asset sale for a purchase price of $14,990 during the second quarter of fiscal 2023. The net book value of the assets and liabilities sold was approximately $8,350, resulting in a gain on sale of approximately $6,640, which is recorded in Other (income) expense, net in the Companys accompanying Condensed Consolidated Statements of Operations. The purchase price and the net proceeds received by the Company related to this sale were subject to customary purchase price adjustment provisions and Company indemnity obligations set forth in the definitive purchase agreement. Accordingly, during the third and fourth fiscal quarter of 2023, a working capital true-up was recorded, which reduced the purchase price and the final net gain to approximately $6,560. The sale did not include the Eureka! brand name or the Eureka! consumer/recreational Camping business line.\nDuring fiscal 2023, the Company also developed plans to fully exit the Eureka! brand of the Camping segment, which includes liquidating all remaining consumer inventory of Eureka! branded products and winding down operations. This will allow the Company to focus solely on the Jetboil product line, which we believe has a strong position in the cooking market. The Company incurred expenses of approximately $4,800 in fiscal 2023 related to the wind down of the Eureka! branded business, which included accruing exit costs and increasing inventory reserves, as well as incurring a contribution expense for a $2,000 donation of Eureka! inventory to a nonprofit organization. These costs are recorded in Costs of Sales and Operating Expenses in the Consolidated Statements of Operations. Other costs will be expensed as incurred and are not expected to be material.\nNet sales and operating profit include both sales to customers, as reported in the Companys accompanying Consolidated Statements of Operations, and inter-unit transfers, which are priced to recover costs plus an appropriate profit margin. Total assets represent assets that are used in the Companys operations in each business segment at the end of the years presented.\nA summary of the Companys operations by business segment is presented below:\n2023 2022 2021\nNet sales:\nFishing:\nUnaffiliated customers $ 491,890 $ 525,563 $ 552,073\nInterunit transfers 1,037 1,019 927\nCamping:\nUnaffiliated customers 45,258 70,308 62,879\nInterunit transfers 64 47 42\nWatercraft Recreation:\nUnaffiliated customers 40,590 67,884 66,396\nInterunit transfers 178 56 207\nDiving\nUnaffiliated customers 85,031 78,862 69,433\nInterunit transfers 38 12 14\nOther / Corporate 1,075 738 870\nEliminations (1,317) (1,134) (1,190)\nTotal $ 663,844 $ 743,355 $ 751,651\nOperating profit (loss):\nFishing $ 41,325 $ 65,433 $ 122,490\nCamping 457 13,415 14,025\nWatercraft Recreation (1,777) 6,173 9,173\nDiving 6,092 4,705 1,530\nOther / Corporate (34,357) (23,416) (35,935)\n$ 11,740 $ 66,310 $ 111,283\nDepreciation and amortization expense:\nFishing $ 11,653 $ 9,690 $ 8,770\nCamping 469 727 644\nWatercraft Recreation 688 620 707\nDiving 711 635 765\nOther / Corporate 2,774 2,562 2,515\n$ 16,295 $ 14,234 $ 13,401\nCapital expenditures:\nFishing $ 17,427 $ 26,114 $ 18,570\nCamping 372 87 399\nWatercraft Recreation 2,181 1,079 681\nDiving 828 834 742\nOther / Corporate 1,860 3,576 1,017\n$ 22,668 $ 31,690 $ 21,409\nGoodwill, net:\nFishing $ 11,172 $ 11,160\nCamping - -\nWatercraft Recreation - -\nDiving - -\n$ 11,172 $ 11,160\nTotal assets (end of period):\nFishing $ 363,463 $ 382,850\nCamping 53,003 59,247\nWatercraft Recreation 26,953 33,496\nDiving 83,555 76,475\nOther / Corporate 154,632 127,863\n$ 681,606 $ 679,931\nA summary of the Companys operations by geographic area is presented below:\n2023 2022 2021\nNet sales:\nUnited States:\nUnaffiliated customers $ 569,383 $ 649,867 $ 659,330\nInterunit transfers 33,873 34,212 30,593\nEurope:\nUnaffiliated customers 39,155 34,427 30,509\nInterunit transfers 9,866 12,109 9,974\nCanada:\nUnaffiliated customers 39,465 44,635 48,867\nInterunit transfers - - 12\nOther:\nUnaffiliated customers 15,841 14,425 12,945\nInterunit transfers 18 17 106\nEliminations (43,757) (46,337) (40,685)\n$ 663,844 $ 743,355 $ 751,651\nTotal assets:\nUnited States $ 565,402 $ 581,004\nEurope 44,360 40,040\nCanada and other 71,844 58,887\n$ 681,606 $ 679,931\nLong-term assets (1):\nUnited States $ 188,073 $ 177,191\nEurope 6,578 6,363\nCanada and other 9,948 4,650\n$ 204,599 $ 188,204\n(1)Long term assets consist of net property, plant and equipment, right of use assets, net intangible assets, goodwill and other assets excluding deferred income taxes.\n14 CONTINGENCIES\nThe Company is subject to various legal actions and proceedings in the normal course of business, including those related to commercial disputes, product liability, intellectual property and environmental matters. The Company is insured against loss for certain of these matters. Although litigation is subject to many uncertainties and the ultimate exposure with respect to these matters cannot be ascertained, management does not believe the final outcome of any pending litigation will have a material adverse effect on the financial condition, results of operations, liquidity or cash flows of the Company.\n15 VALUATION AND QUALIFYING ACCOUNTS\nThe following summarizes changes to valuation and qualifying accounts for 2023, 2022 and 2021:\nBalance at\nBeginning of Year Additions Charged\nto Costs and\nExpenses Less Deductions Balance at End of\nYear\nYear Ended September 29, 2023\nAllowance for doubtful accounts $ 1,037 $ 177 $ 307 $ 907\nReserves for inventory valuation 9,089 10,225 843 18,471\nValuation of deferred tax assets 6,700 1,067 666 7,101\nReserves for sales returns 2,200 2,448 2,875 1,773\nYear ended September 30, 2022\nAllowance for doubtful accounts $ 2,494 $ 30 $ 1,487 $ 1,037\nReserves for inventory valuation 5,548 4,409 868 9,089\nValuation of deferred tax assets 6,372 1,072 744 6,700\nReserves for sales returns 2,095 2,429 2,324 2,200\nYear ended October 1, 2021\nAllowance for doubtful accounts $ 2,697 $ 308 $ 511 $ 2,494\nReserves for inventory valuation 5,385 518 355 5,548\nValuation of deferred tax assets 6,524 1,352 1,504 6,372\nReserves for sales returns 3,043 1,705 2,653 2,095\n16 QUARTERLY FINANCIAL SUMMARY (UNAUDITED)\nThe following summarizes quarterly operating results for the years presented below:\nFirst Quarter Second Quarter Third Quarter Fourth Quarter\n(thousands, except per share data) 2023 2022 2023 2022 2023 2022 2023 2022\nNet sales $ 178,337 $ 153,524 $ 202,115 $ 189,623 $ 187,047 $ 203,819 $ 96,345 $ 196,389\nGross profit 62,779 60,631 75,335 68,585 77,587 73,509 28,386 68,607\nOperating profit (loss) 5,472 13,760 11,390 15,429 17,443 23,799 (22,565) 13,322\nIncome (loss) before income taxes 8,166 14,589 19,948 13,210 19,822 19,244 (22,112) 11,845\nIncome tax expense (benefit) 2,287 3,733 5,087 3,310 5,021 5,162 (6,105) 2,192\nNet income (loss) $ 5,879 $ 10,856 $ 14,861 $ 9,900 $ 14,801 $ 14,082 $ (16,007) $ 9,653\nNet income (loss) per common share - Basic:\nClass A $ 0.58 $ 1.08 $ 1.47 $ 0.99 $ 1.46 $ 1.40 $ (1.56) $ 0.96\nClass B $ 0.53 $ 0.98 $ 1.33 $ 0.90 $ 1.33 $ 1.27 $ (1.56) $ 0.87\nNet income (loss) per common share - Diluted:\nClass A $ 0.57 $ 1.07 $ 1.45 $ 0.97 $ 1.44 $ 1.38 $ (1.56) $ 0.95\nClass B $ 0.57 $ 1.07 $ 1.45 $ 0.97 $ 1.44 $ 1.38 $ (1.56) $ 0.95\nDue to changes in stock prices during the year and the timing of issuance of shares, the cumulative total of quarterly net income per share amounts may not equal the net income per share for the entire year."
}