{
    "cik": "790273",
    "company": "CONECTISYS CORP",
    "filing_type": "10-K",
    "filing_date": "2022-12-27",
    "period_of_report": "2022-09-30",
    "sic": "3663",
    "state_of_inc": "CO",
    "state_location": "WA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/790273/0001683168-22-008637-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/790273/000168316822008637/conectisys_10k-093022.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/790273/0001683168-22-008637.txt",
    "filename": "790273_10K_2022_0001683168-22-008637.htm",
    "content": "ITEM 1. BUSINESS\nOur Company\nConectisys Corporation, a Colorado corporation (Conectisys, the Company, we, us or our) is a shell company seeking to create value for its shareholders by merging with another entity with experienced management and opportunities for growth in return for shares of our Common Stock.\nNo potential merger candidate has been identified at this time.\nWe do not propose to restrict our search for a business opportunity to any particular industry or geographical area and may, therefore, engage in essentially any business in any industry. We have unrestricted discretion in seeking and participating in a business opportunity, subject to the availability of such opportunities, economic conditions, and other factors.\nThe selection of a business opportunity in which to participate is complex and risky. Additionally, we have only limited resources and may find it difficult to locate good opportunities. There can be no assurance that we will be able to identify and acquire any business opportunity which will ultimately prove to be beneficial to us and our shareholders. We will select any potential business opportunity based on our management's best business judgment.\nOur activities are subject to several significant risks, which arise primarily as a result of the fact that we have no specific business, and may acquire or participate in a business opportunity based on the decision of management, which potentially could act without the consent, vote, or approval of our shareholders. The risks faced by us are further increased as a result of a lack of resources and our inability to provide a prospective business opportunity with significant capital.\nOur History\nThe Company was incorporated in Colorado on February 2, 1986 under the name Coastal Financial Corp. On December 5, 1994, Coastal Financial Corp. changed its name to BDR Industries, Inc., which changed its name on October 16, 1995, to ConectiSys Corporation.\nThe Company was engaged in the development of a low-cost automatic meter reading, or AMR Solution, until it ceased all business activity in 2008.\nRevenue\nWe have had no revenues from fiscal year 2008 through the date of this filing.\nGeneral Business Plan\nOur business plan to seek a merger has many uncertainties which pose risks to investors.\nWe intend to seek, investigate and, if such investigation warrants, acquire an interest in business opportunities presented to us by persons or firms which desire to seek the advantages of an issuer who has complied with the Securities Act of 1934 (the 1934 Act). We will not restrict our search to any specific business, industry or geographical location, and we may participate in business ventures of virtually any nature. This discussion of our proposed business is purposefully general and is not meant to be restrictive of our unlimited discretion to search for and enter into potential business opportunities. We anticipate that we may be able to participate in only one potential business venture because of our lack of financial resources. We may seek a business opportunity with entities which have recently commenced operations, or that desire to utilize the public marketplace in order to raise additional capital in order to expand into new products or markets, to develop a new product or service, or for other corporate purposes. All of these activities have risk to investors including dilution and management.\nWe expect that the selection of a business opportunity will be complex. Due to general economic conditions, rapid technological advances being made in some industries and shortages of available capital, we believe that there are numerous firms seeking the benefits of an issuer who has complied with the 1934 Act. Such benefits may include facilitating or improving the terms on which additional equity financing may be sought, providing liquidity for incentive stock options or similar benefits to key employees, providing liquidity (subject to restrictions of applicable statutes) for all stockholders and other factors. Potentially, available business opportunities may occur in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. We have, and will continue to have, essentially no assets to provide the owners of business opportunities. However, we will be able to offer owners of acquisition candidates the opportunity to acquire a controlling ownership interest in an issuer who has complied with the 1934 Act without incurring the cost and time required to conduct an initial public offering.\nThe analysis of new business opportunities will be undertaken by, or under the supervision of, our Board of Directors. We intend to concentrate on identifying preliminary prospective business opportunities which may be brought to our attention through present associations of our director, professional advisors or by our stockholders. In analyzing prospective business opportunities, we will consider such matters as (i) available technical, financial and managerial resources; (ii) working capital and other financial requirements; (iii) history of operations, if any, and prospects for the future; (iv) nature of present and expected competition; (v) quality, experience and depth of management services; (vi) potential for further research, development or exploration; (vii) specific risk factors not now foreseeable but that may be anticipated to impact the proposed activities of the company; (viii) potential for growth or expansion; (ix) potential for profit; (x) public recognition and acceptance of products, services or trades; (xi) name identification; and (xii) other factors that we consider relevant. As part of our investigation of the business opportunity, we expect to meet personally with management and key personnel. To the extent possible, we intend to utilize written reports and personal investigation to evaluate the above factors.\nWe will not acquire or merge with any company for which audited financial statements cannot be obtained within a reasonable period of time after closing of the proposed transaction.\nAcquisition Interest\nIn implementing a structure for a particular business acquisition, we may become a party to a merger, consolidation, reorganization, joint venture, or licensing agreement with another company or entity. We may also acquire stock or assets of an existing business. Upon consummation of a transaction, it is probable that our present management and stockholders will no longer be in control of us. In addition, our sole director may, as part of the terms of the acquisition transaction, resign and be replaced by new directors without a vote of our stockholders, or sell his stock in us. Any such sale will only be made in compliance with the securities laws of the United States and any applicable state.\nIt is anticipated that any securities issued in any such reorganization would be issued in reliance upon exemption from registration under application federal and state securities laws. In some circumstances, as a negotiated element of the transaction, we may agree to register all or a part of such securities immediately after the transaction is consummated or at specified times thereafter. If such registration occurs, it will be undertaken by the surviving entity after it has successfully consummated a merger or acquisition and is no longer considered an inactive company.\nThe issuance of substantial additional securities and their potential sale into any trading market which may develop in our securities may have a depressive effect on the value of our securities in the future. There is no assurance that such a trading market will develop.\nWhile the actual terms of a transaction cannot be predicted, it is expected that the parties to any business transaction on will find it desirable to avoid the creation of a taxable event and thereby structure the business transaction in a so-called tax-free reorganization under Sections 368(a)(1) or 351 of the Internal Revenue Code (the Code). In order to obtain tax-free treatment under the Code, it may be necessary for the owner of the acquired business to own 80% or more of the voting stock of the surviving entity. In such event, our stockholders would retain less than 20% of the issued and outstanding shares of the surviving entity. This would result in significant dilution in the equity of our stockholders.\nAs part of our investigation, we expect to meet personally with management and key personnel, visit and inspect material facilities, obtain independent analysis of verification of certain information provided, check references of management and key personnel, and take other reasonable investigative measures, to the extent of our limited financial resources and management expertise. The manner in which we participate in an opportunity will depend on the nature of the opportunity, the respective needs and desires of both parties, and the management of the opportunity.\nWith respect to any merger or acquisition, and depending upon, among other things, the target companys assets and liabilities, our stockholders will in all likelihood hold a substantially lesser percentage ownership interest in us following any merger or acquisition. The percentage ownership may be subject to significant reduction in the event we acquire a target company with assets and expectations of growth. Any merger or acquisition can be expected to have a significant dilutive effect on the percentage of shares held by our stockholders.\nWe will participate in a business opportunity only after the negotiation and execution of appropriate written business agreements. Although the terms of such agreements cannot be predicted, generally we anticipate that such agreements will (i) require specific representations and warranties by all of the parties; (ii) specify certain events of default; (iii) detail the terms of closing and the conditions which must be satisfied by each of the parties prior to and after such closing; (iv) outline the manner of bearing costs, including costs associated with the Companys attorneys and accountants; (v) set forth remedies on defaults; and (vi) include miscellaneous other terms.\nAs stated above, we will not acquire or merge with any entity which cannot provide independent audited financial statements within a reasonable period of time after closing of the proposed transaction. If such audited financial statements are not available at closing, or within time parameters necessary to insure our compliance within the requirements of the 1934 Act, or if the audited financial statements provided do not conform to the representations made by that business to be acquired, the definitive closing documents will provide that the proposed transaction will be voidable, at the discretion of our present management. If such transaction is voided, the definitive closing documents will also contain a provision providing for reimbursement for our costs associated with the proposed transaction.\nCompetition\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nIntellectual Property\nWe own no intellectual property.\nEmployees\nWe presently have no full time executive, operational, or clerical staff. Mr. Cacciamatta has been the sole director and sole officer of the Company since August 1, 2020.\nFactors Affecting Future Performance\nRather than an operating business, our goal is to obtain debt and/or equity financing to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our Common Stock to create value for our shareholders.\nAlthough there is no assurance that this series of events will be successfully completed, we believe we can successfully complete an acquisition or merger which will enable us to continue as a going concern. Any acquisition or merger will most likely be dilutive to our existing stockholders.\nThe factors affecting our future performance are listed and explained below under the section Risk Factors. ITEM 1A. RISK FACTORS\nThere are various risks associated with our business, including the risks discussed below. You should carefully consider these risk factors, as well as the other information contained in this Registration Statement, in evaluating our business and us.\nRather than our previous operating business, our business is now to seek to raise the debt and/or equity to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our Common Stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed or that any stockholder will realize any return on their shares after the new business plan has been implemented.\nRISKS RELATED TO OUR COMPANY\nWE HAVE INCURRED SIGNIFICANT LOSSES AND ANTICIPATE FUTURE LOSSES\nAs of September 30, 2022, we had an accumulated deficit of $32,287,380 and a stockholders deficit of $40,939.\nFuture losses are likely to occur until we are able to merge with another entity with experienced management and opportunities for growth in return for shares of our Common Stock to create value for our shareholder, as we have no sources of income to meet our operating expenses.\nOUR EXISTING FINANCIAL RESOURCES ARE INSUFFICIENT TO MEET OUR ONGOING OPERATING EXPENSES\nWe have no sources of income at this time and no existing cash balances to meet our ongoing operating expenses. In the short term, unless we are able to raise additional debt and/or equity we shall be unable to meet our ongoing operating expenses. On a longer-term basis, we intend to raise the debt and/or equity to meet our ongoing operating expenses and merge with another entity with experienced management and opportunities for growth in return for shares of our Common Stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed.\nWE BELIEVE THAT OUR FORMER LIABILITIES HAVE BECOME BARRED BY APPLICABLE STATUTES OF LIMITATIONS DUE TO THEIR AGE.\nEffective April 1, 2017, we believe all of our liabilities outstanding as of that date became barred by the applicable statute of limitations under New York State law.\nCertain of our former creditors may disagree that our liabilities owed to them are no longer outstanding because they have become statute barred. If these former creditors were to successfully challenge the fact that our liabilities to them are no longer outstanding because they have become statute barred, we do not have the funds available to settle these liabilities. If these former liabilities were held to be currently valid it is unlikely that we would be able to merge with another entity with experienced management and opportunities for growth in return for shares of our Common Stock to create value for our shareholders.\nWE INTEND TO PURSUE THE ACQUISITION OF AN OPERATING BUSINESS\nOur sole strategy is to acquire an operating business. Successful implementation of this strategy depends on our ability to identify a suitable acquisition candidate, acquire such company on acceptable terms and integrate its operations. In pursuing acquisition opportunities, we compete with other companies with similar strategies. Competition for acquisition targets may result in increased prices of acquisition targets and a diminished pool of companies available for acquisition. Acquisitions involve a number of other risks, including risks of acquiring undisclosed or undesired liabilities, acquired in-process technology, stock compensation expense, diversion of management attention, potential disputes with the seller of one or more acquired entities and possible failure to retain key acquired personnel. Any acquired entity or assets may not perform relative to our expectations. Our ability to meet these challenges has not been established.\nSCARCITY OF, AND COMPETITION FOR, BUSINESS OPPORTUNITIES AND COMBINATIONS\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. Nearly all such entities have significantly greater financial resources, technical expertise and managerial capabilities than us and, consequently, we will be at a competitive disadvantage in identifying possible business opportunities and successfully completing a business combination. Moreover, we will also compete in seeking merger or acquisition candidates with numerous other small public companies. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nWE HAVE NOT EXECUTED ANY FORMAL AGREEMENT FOR A BUSINESS COMBINATION OR OTHER TRANSACTION AND HAVE ESTABLISHED NO STANDARDS FOR BUSINESS COMBINATIONS\nWe have not executed any formal arrangement, agreement or understanding with respect to engaging in a merger with, joint venture with or acquisition of a private or public entity. There can be no assurance that we will be successful in identifying and evaluating suitable business opportunities or in concluding a business combination. We have not identified any particular industry or specific business within an industry for evaluation. There is no assurance we will be able to negotiate a business combination on terms favorable, if at all. We have not established a specific length of operating history or specified level of earnings, assets, net worth or other criteria which we will require a target business opportunity to have achieved, and without which we would not consider a business combination. Accordingly, we may enter into a business combination with a business opportunity having no significant operating history, losses, limited or no potential for earnings, limited assets, negative net worth or other negative characteristics.\nWE MAY BE NEGATIVELY AFFECTED BY ADVERSE GENERAL ECONOMIC CONDITIONS\nCurrent conditions in domestic and global economies are extremely uncertain. Adverse changes may occur as a result of softening global economies, wavering consumer confidence caused by the threat of terrorism and war, and other factors capable of affecting economic conditions. Such changes could have a material adverse effect on our business, financial condition, and results of operations.\nBECAUSE OUR PRINCIPAL SHAREHOLDER CONTROLS OUR ACTIVITIES, HE MAY CAUSE US TO ACT IN A MANNER THAT IS MOST BENEFICIAL TO HIMSELF AND NOT TO OTHER SHAREHOLDERS WHICH COULD CAUSE US NOT TO TAKE ACTIONS THAT OUTSIDE INVESTORS MIGHT VIEW FAVORABLY\nOur principal shareholder owns approximately 95% of our outstanding Common Stock. As a result, he effectively controls all matters requiring stockholder approval, including the election of directors, the approval of significant corporate transactions, such as mergers and related party transaction. He may also have the ability to delay or perhaps even block, by his ownership of our stock, an unsolicited tender offer. This concentration of ownership could have the effect of delaying, deterring or preventing a change in control of our company that other shareholders might view favorably.\nOUR SOLE DIRECTOR MAY HAVE CONFLICTS OF INTEREST, WHICH MAY NOT BE RESOLVED FAVORABLY TO US.\nCertain conflicts of interest may exist between our sole director and us. Our sole director has other business interests to which he devotes his attention, and may be expected to continue to do so, although management time should be devoted to our business. As a result, conflicts of interest may arise that can be resolved only through exercise of such judgment as is consistent with fiduciary duties to us. See \"Directors and Executive Officers\" and \"Conflicts of Interest,\" below.\nWE MAY DEPEND UPON OUTSIDE ADVISORS, WHO MAY NOT BE AVAILABLE ON REASONABLE TERMS AND AS NEEDED.\nTo supplement the business experience of our officer and director, we may be required to employ accountants, technical experts, appraisers, attorneys, or other consultants or advisors. Our Board, without any input from stockholders, will make the selection of any such advisors. Furthermore, it is anticipated that such persons may be engaged on an \"as needed\" basis without a continuing fiduciary or other obligation to us. In the event we consider it necessary to hire outside advisors, we may elect to hire persons who are affiliates, if they are able to provide the required services.\nRISKS RELATED TO OUR SECURITIES\nREDUCTION OF PERCENTAGE SHARE OWNERSHIP FOLLOWING BUSINESS COMBINATION AND DILUTION TO STOCKHOLDERS\nOur primary plan of operation is based upon a business combination with a private concern which, in all likelihood, would result in us issuing securities to stockholders of such private company. The issuance of previously authorized and unissued shares of our Common Stock would result in reduction in the percentage of shares owned by present and prospective stockholders and may result in a change in control or management. In addition, any merger or acquisition can be expected to have a significant dilutive effect on the percentage of the shares held our stockholders.\nTHE REGULATION OF PENNY STOCKS BY SEC AND FINRA MAY HAVE AN EFFECT ON THE TRADABILITY OF OUR SECURITIES.\nOur securities are currently listed on the OTC Pink Sheets and we plan to have them listed on the OCTQB. Our shares are subject to a Securities and Exchange Commission rule that imposes special sales practice requirements upon broker-dealers who sell such securities to persons other than established customers or accredited investors. For purposes of the rule, the phrase \"accredited investors\" means, in general terms, institutions with assets in excess of $5,000,000, or individuals having a net worth in excess of $1,000,000 or having an annual income that exceeds $200,000 (or that, when combined with a spouse's income, exceeds $300,000).\nFor transactions covered by the rule, the broker-dealer must make a special suitability determination for the purchaser and receive the purchaser's written agreement to the transaction prior to the sale. Consequently, the rule may affect the ability of broker-dealers to sell our securities and also may affect the ability of purchasers in this offering to sell their securities in any market that might develop therefore.\nIn addition, the Securities and Exchange Commission has adopted a number of rules to regulate \"penny stocks.\" Such rules include Rules 3a51-1, 15g-1, 15g-2, 15g-3, 15g-4, 15g-5, 15g-6, 15g-7, and 15g-9 under the Securities and Exchange Act of 1934, as amended. Because our securities constitute \"penny stocks\" within the meaning of the rules, the rules would apply to us and to our securities. The rules may further affect the ability of our shareholders to sell our securities in any market that might develop for them.\nShareholders should be aware that, according to Securities and Exchange Commission, the market for penny stocks has suffered in recent years from patterns of fraud and abuse. Such patterns include (i) control of the market for the security by one or a few broker-dealers that are often related to the promoter or issuer; (ii) manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases; (iii) \"boiler room\" practices involving high-pressure sales tactics and unrealistic price projections by inexperienced sales persons; (iv) excessive and undisclosed bid-ask differentials and markups by selling broker-dealers; and (v) the wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired amount of consequent investor losses. Our management is aware of the abuses that have occurred historically in the penny stock market. Although we do not expect to be in a position to dictate the behavior of the market or of broker-dealers who participate in the market, management will strive within the confines of practical limitations to prevent the described patterns from being established with respect to our securities.\nThe shares of our Common Stock may be thinly-traded on the OTC Pink Sheets, meaning that the number of persons interested in purchasing our shares of Common Stock at or near ask prices at any given time may be relatively small or non-existent. This situation is attributable to a number of factors, including the fact that we are a small company which is relatively unknown to stock analysts, stock brokers, institutional investors and others in the investment community that generate or influence sales volume. Even if we came to the attention of such persons, they tend to be risk-averse and would be reluctant to follow an unproven, early stage company such as ours or purchase or recommend the purchase of our shares of Common Stock until such time as we became more seasoned and viable. As a consequence, there may be periods of several days or more when trading activity in our shares of Common Stock is minimal or non-existent, as compared to a seasoned issuer which has a large and steady volume of trading activity that will generally support continuous sales without an adverse effect on securities price.\nOUR COMMON STOCK WILL IN ALL LIKELIHOOD BE THINLY TRADED AND, AS A RESULT, YOU MAY BE UNABLE TO SELL AT OR NEAR ASK PRICES OR AT ALL IF YOU NEED TO LIQUIDATE YOUR SHARES.\nWe cannot give you any assurance that a broader or more active public trading market for our shares of Common Stock will develop or be sustained, or that any trading levels will be sustained. Due to these conditions, we can give investors no assurance that they will be able to sell their shares of Common Stock at or near ask prices or at all if you need money or otherwise desire to liquidate your shares of Common Stock of our Company.\nTHE COMPANY IS A SHELL COMPANY AND AS SUCH SHAREHOLDERS CANNOT RELY ON THE PROVISIONS OF RULE 144 FOR RESALE OF THEIR SHARES UNTIL CERTAIN CONDITIONS ARE MET.\nThe Company is a shell company as defined under Rule 405 of the Securities Act of 1933 as a registrant that has no or nominal operations and either no or nominal assets, or assets consisting only of cash or cash equivalents and/or other nominal assets. As securities issued by a shell company, the securities issued by the Company can only be resold by filing a registration statement for those shares or utilizing the provisions of Rule 144 once certain conditions are met, as follows: (i) the Company has ceased to be a shell company, (ii) the Company is subject to the reporting requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, (iii) the Company has filed all required reports under the Exchange Act for the preceding 12 months and (iv) one year has elapsed since the Company filed \"Form 10\" information.\nThus, a shareholder of the Company will not be able to sell its shares until such time as a registration statement for those shares is filed or the Company has ceased to be a shell company either by effecting a business combination or by developmental growth, the Company has remained current on its Exchange Act filings for 12 months and the Company has filed the information as would be required by a \"Form 10\" filing (e.g. audited financial statements, management information and compensation, shareholder information, etc.)\nTHE PRICE OF OUR COMMON STOCK COULD BE HIGHLY VOLATILE\nOur intention is for our shares of Common Stock to continue to be listed on the OTC Markets. There is a limited market for our stock. It may be subject to volatility, low volumes of trades and large spreads in bid and ask prices quoted by market makers. Due to the low volume of shares traded on any trading day, persons buying or selling in relatively small quantities may easily influence prices of our Common Stock. This low volume of trades could also cause the price of our stock to fluctuate greatly, with large percentage changes in price occurring in any trading day session. Holders of our Common Stock may also not be able to readily liquidate their investment or may be forced to sell at depressed prices due to low volume trading. If high spreads between the bid and ask prices of our Common Stock exist at the time of a purchase, the stock would have to appreciate substantially on a relative percentage basis for an investor to recoup their investment. Broad market fluctuations and general economic and political conditions may also adversely affect the market price of our Common Stock. No assurance can be given that an active market in our Common Stock will develop or be sustained. If an active market does not develop, holders of our Common Stock may be unable to readily sell the shares they hold or may not be able to sell their shares at all.\nLOSS OF CONTROL BY OUR PRESENT MANAGEMENT AND STOCKHOLDERS MAY OCCUR UPON ISSUANCE OF ADDITIONAL SHARES.\nWe may issue further Shares as consideration for the cash or assets or services out of our authorized but unissued Common Stock that would, upon issuance, represent a majority of our voting power and equity. The result of such an issuance would be those new stockholders and management would control us, and persons unknown could replace our current management. . Such an occurrence would result in a greatly reduced percentage of ownership of us by our current Shareholders.\nWE DO NOT ANTICIPATE PAYING CASH DIVIDENDS ON OUR COMMON STOCK\nWe do not anticipate paying any cash dividends on our Common Stock in the foreseeable future.\nWE MAY BE UNSUCCESSFUL IN FINDING A MERGER THAT CAN BE ACCOMPLISHED WITH POSITIVE LONG-TERM RESULTS\nThe business of selecting and entering into a merger is fraught with all kinds of issues. For instance, the business may need capital that is never raised, the management is not capable of carrying the business forward successfully, the business plan is ill conceived, and not executed, or competitive factors cause business failure. There are many other factors in addition to these, as may have been discussed above in Risk Factors which could cause our company to fail and the investors capital will be at risk. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe do not own or lease any properties.\nThe Company has no properties and at this time has no agreements to acquire any properties. The Company currently uses an office provided by Mr. Cacciamatta, the Companys President and CEO, at no cost to the Company. Mr. Cacciamatta has agreed to continue this arrangement until the Company completes an acquisition or merger. We presently do not own any equipment, and do not intend to purchase or lease any equipment prior to or upon completion of a business combination. ITEM 3. LEGAL PROCEEDINGS\nNeither we nor any of our officers, directors, or holders of five percent or more of our Common Stock is a party to any pending legal proceedings and to the best of our knowledge, no such proceedings by or against us or our officers, or directors or holders of five percent or more of our Common Stock have been threatened or is pending against us. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nShares of our Common Stock trade in the pink sheets market and quotations for the Common Stock are listed in the \"Pink Sheets\" produced by the OTC Markets under the symbol CONC. The trading volume is very limited, averaging approximately one share daily. The last reported trade was on August 1, 2022, at $0.07/share.\nRecord Holders.\nThere were 325 holders of record as of December 22, 2022; however, we believe the number of beneficial holders of our shares of Common Stock to be approximately 350. In many instances, a registered stockholder is a broker or other entity holding shares in street name for one or more customers who beneficially own the shares.\nTransfer Agent\nOur transfer agent is Signature Stock Transfer, Inc. 14673 Midway Road, Suite 220, Addison, Texas 75001. Their telephone number is (972) 612-4120.\nDividend Policy\nWe have never paid cash dividends and have no plans to do so in the foreseeable future. Our future dividend policy will be determined by our board of directors and will depend upon a number of factors, including our financial condition and performance, our cash needs and expansion plans, income tax consequences, and the restrictions that applicable laws, any future preferred stock instruments, and any future credit arrangements may then impose.\nShares of Common Stock\nStock Reverse Split\nThe Companys common shares were reverse split 10,000 to 1 effective March 10, 2021.\nStock Issuances\nOn August 1, 2020, our sole director and officer purchased 800,000 post-split common shares for $100 cash payable upon the effectiveness of such split, which occurred on March 10, 2021.\nDescription of Common Stock\nWe are authorized to issue 250,000,000 shares of our Common Stock, no par value (the \"Common Stock\"). Each share of the Common Stock is entitled to share equally with each other share of Common Stock in dividends from sources legally available therefore, when, and if, declared by our board of directors and, upon our liquidation or dissolution, whether voluntary or involuntary, to share equally in the assets of the Company that are available for distribution to the holders of the Common Stock. Each holder of Common Stock is entitled to one vote per share for all purposes, except that in the election of directors, each holder shall have the right to vote such number of shares for as many persons as there are directors to be elected. Cumulative voting shall not be allowed in the election of directors or for any other purpose, and the holders of Common Stock have no preemptive rights, redemption rights or rights of conversion with respect to the Common Stock. Our board of directors is authorized to issue additional shares of our Common Stock within the limits authorized by our Articles of Incorporation and without stockholder action. All shares of Common Stock have equal voting rights, and voting rights are not cumulative.\nA total of 888,579 shares of common stock are issued and outstanding.\nDescription of Preferred Stock\nOf the 50,000,000 authorized shares of preferred stock, 1,000,000 shares have been designated as Class A, 1,000,000 shares as Class B, and the remaining 48,000,000 shares are undesignated.\nEach share of Class A preferred is entitled to 100 votes on all matters presented to the Companys shareholders for action. The Class A does not have any liquidation preference, additional voting rights, anti-dilution rights, or any other preferential rights.\nEach share of Class B preferred is convertible into 10 shares of the Companys common stock. The Class B preferred does not have any liquidation preference, voting rights, other conversion rights, anti-dilution rights, or any other preferential rights.\nThere are no preferred shares issued and outstanding. ITEM 6. (Reserved) ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nWe have zero assets, minor liabilities and minor administrative expenses. We seek to create value for our shareholders by merging with another entity with experienced management and opportunities for growth in return for our common stock. We have not identified a merger candidate. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by this item are located in Item 15 beginning on page of this Annual Report on Form 10-K and are incorporated herein by reference. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable. The financial statements included herein are prepared by management and are unaudited. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management conducted an evaluation, with the participation of our Chief Executive Officer, who is our principal executive officer and our principal financial and accounting officer, of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act) as of the end of the period covered by this annual report on Form 10-K. Based on that evaluation, we concluded that because of the material weakness and significant deficiencies in our internal control over financial reporting described below, our disclosure controls and procedures were not sufficient as of September 30, 2022. Such weaknesses and deficiencies are principally caused by our lack of employees and financial resources. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth the name, age, and position with us for our sole director and officer as of September 30, 2022:\nName Age Position Since\nDanilo Cacciamatta Director, Chief Executive Officer and Chief Financial Officer August, 2020\nDanilo Cacciamatta has served as our sole director and officer since August 1, 2020. He was elected to the Board of Directors of California First National Bancorp in June 2001. In June 2020, he was elected to the Board of Directors of West Texas Resources. Inc. Mr. Cacciamatta was the CEO of Cacciamatta Accountancy Corporation, a PCAOB registered independent public accounting firm specializing in audits of SEC reporting companies, from 1989 to 2010. From 1972 to 1988, Mr. Cacciamatta was with KPMG Peat Marwick, first as a management consultant in Milan, Italy, and later in the audit group of the Orange County office in California. He was elected to partnership in 1980. His CPA license from the state of California is currently inactive. Mr. Cacciamatta graduated from Pomona College with a B.A in economics and the University of California at Riverside with an M.B.A.\nCONFLICTS OF INTEREST - GENERAL\nOur sole director and officer is, or may become, in his individual capacity, an officer, director, controlling shareholder and/or partner of other entities engaged in a variety of businesses. Thus, there exist potential conflicts of interest including, among other things, time, efforts, and corporation opportunity, involved in participation with such other business entities. While our sole officer and director of our business is engaged in business activities outside of our business, he devotes to our business such time as he believes to be necessary.\nCONFLICTS OF INTEREST - CORPORATE OPPORTUNITIES\nThere are no requirements in our Articles of Incorporation or Bylaws which requires officers and directors of the Company to disclose to us business opportunities which come to their attention. Our officers and directors do, however, have a fiduciary duty of loyalty to us to disclose to us any business opportunities which come to their attention, in their capacity as an officer and/or director or otherwise. Excluded from this duty would be opportunities which the person learns about through his involvement as an officer and director of another company. We have no intention of merging with or acquiring an affiliate, associate person or business opportunity from any affiliate or any client of any such person.\nCOMMITTEES OF THE BOARD OF DIRECTORS\nThe members of our Board are elected for one-year terms, to hold office until the next general meeting of stockholders, or until removed from office in accordance with our bylaws.\nOur Board does not maintain a separate audit, nominating or compensation committee. Functions customarily performed by such committees are performed by the Board as a whole.\nCode of Ethics\nTo date, we have not adopted a Code of Ethics applicable to our principal executive officer and principal financial officer because the Company has no meaningful operations. The Company does not believe that a formal written code of ethics is necessary at this time. We expect that the Company will adopt a code of ethics if and when the Company successfully completes a business combination that results in the acquisition of an on-going business and thereby commences operations. ITEM 11. EXECUTIVE COMPENSATION\nMr. Danilo Cacciamatta was our sole director and officer for fiscal years 2021 and 2022. He served on an interim basis until August 1, 2020, on which date he was formally elected to these positions.\nExecutive compensation during the two fiscal years ended September 30, 2022, was as follows:\nNAME AND PRINCIPAL POSITION\nSALARY\nBONUS\nSTOCK AWARDS\nOPTIONS\nAWARDS\n($)\nNONQUALIFIED DEFERRED COMPENSATION\n($)\nALL OTHER\nCOMPENSATION\nTOTAL\nDanilo Cacciamatta,\nDirector, President,\nChief Executive Officer,\nChief Financial Officer\n-\n-\n-\n-\n-\n-\n- ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nThe following table sets forth, as of December 22, 2022, the number and percentage of the outstanding shares of Common Stock, which, according to the information available to us, were beneficially owned by:\n(i) each person who is currently a director,\n(ii) each executive officer,\n(iii) all current directors and executive officers as a group, and\n(iv) each person who is known by us to own beneficially more than 5% of our outstanding Common Stock.\nExcept as otherwise indicated, the persons named in the table have sole voting and dispositive power with respect to all shares beneficially owned, subject to community property laws where applicable.\nName and Address of Beneficial Owner Number of Common Shares Percent of Class\nDanilo Cacciamatta, sole officer, and director (1) 838,310 94.34%\nAll executive officers, beneficial owners, and directors as a group 838,310 94.34%\n(1) c/o 14308 S. Goss Rd, Cheney, WA 9904 ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nMr. Cacciamatta, our sole director and officer, provides office space at no cost to the Company. There are no other related party transactions. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nNot applicable. We are an inactive registrant.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial statements\nOur unaudited financial statements are included herein commencing on page following.\n(b) Financial statement schedules\nSchedules are not required.\n(c) Exhibits\nThe exhibits to this annual report are listed below.\nExhibit\nNumber\nDescription\n31.1\nCertification of the Chief Executive Officer Required by Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as Adopted Pursuant to Section 302 of the Sarbanes- Oxley Act of 2002\n31.2\nCertification of the Chief Financial Officer Required by Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as Adopted Pursuant to Section 302 of the Sarbanes- Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)**\n101.SCH\nInline XBRL Taxonomy Extension Schema Document**\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document**\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document**\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document**\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document**\nCover Page Interactive Data File (formatted in IXBRL, and included in exhibit 101).**\nITEM 16. FORM 10-K SUMMARY\nNone.\nCONECTISYS CORPORATION\nINDEX TO UNAUDITED FINANCIAL STATEMENTS\nPage\nBalance Sheets as of September 30, 2022 and 2021\nStatements of Operations for the years ended September 30, 2022 and 2021\nStatements of Changes in Shareholders' (Deficit) for the years ended September 30, 2022 and 2021\nStatements of Cash Flows for the years ended September 30, 2022 and 2021\nNotes to Unaudited Financial Statements\nCONECTISYS CORPORATION\nUNAUDITED BALANCE SHEETS\nSeptember 30,\nSeptember 30,\nASSETS\nCurrent assets\nCash and cash equivalents $ - $ -\nTotal current assets - -\nProperty and equipment, net - -\nTotal assets $ - $ -\nLIABILITIES AND DEFICIT\nCurrent liabilities\nAccrued expenses $ 12,806 $ 10,656\nAdvances from former officer 28,133 20,884\nTotal current liabilities 40,939 31,540\nTotal liabilities 40,939 31,540\nCommitments and contingencies - -\nStockholders deficit\nPreferred stock - Class A, $1.00 par value; 1,000,000 shares authorized, none issued and outstanding - -\nConvertible preferred stock - Class B, $1.00 par value; 1,000,000 shares authorized, none issued and outstanding - -\nPreferred stock - undesignated; 48,000,000 shares authorized, none issued and outstanding - -\nCommon stock - no par value; 250,000,000 shares authorized, 888,579 shares issued and outstanding* 32,246,441 32,246,441\n(Accumulated deficit) (32,287,380 ) (32,277,981 )\nAccumulated other comprehensive income (loss) - -\nTotal deficit (40,939 ) (31,540 )\nTotal liabilities and deficit $ - $ -\n*On March 10, 2021, the Company implemented a 10,000 for 1 reverse split of its issued and outstanding shares of common stock. Except for shares authorized, all references to number of shares and per share information have been retroactively adjusted to reflect such split.\nSee notes to unaudited financial statements.\nCONECTISYS CORPORATION\nUNAUDITED STATEMENTS OF OPERATIONS AND COMPREHENSIVE (LOSS)\nFor the Years Ended September 30,\nREVENUE $ - $ -\nCOST OF REVENUE - -\nGROSS PROFIT - -\nOPERATING EXPENSES\nGeneral and administrative 9,399 4,274\nTotal operating expenses 9,399 4,274\n(LOSS) FROM OPERATIONS (9,399 ) (4,274 )\n(LOSS) BEFORE INCOME TAXES (9,399 ) (4,274 )\nPROVISION FOR INCOME TAXES - -\nNET (LOSS) (9,399 ) (4,274 )\nOTHER COMPREHENSIVE INCOME (LOSS) - -\nCOMPREHENSIVE INCOME (LOSS) $ (9,399 ) $ (4,274 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES*\nBasic and diluted $ 888,579 $ 888,579\n(LOSS) PER SHARE*\nBasic and diluted $ (0.01 ) $ (0.00 )\n*On March 10, 2021, the Company implemented a 10,000 for 1 reverse split of its issued and outstanding shares of common stock. Except for shares authorized, all references to number of shares and per share information have been retroactively adjusted to reflect such split.\nSee notes to unaudited financial statements.\nCONECTISYS CORPORATION\nUNAUDITED STATEMENTS OF CHANGES IN DEFICIT\nCommon Stock* Subscription Accumulated\nShares Amount Receivable Deficit Total\nBalance, September 30, 2020 888,579 $ 32,246,441 $ (100 ) $ (32,273,707 ) $ (27,366 )\nShares subscribed - - -\nNet loss - - - (4,274 ) (4,274 )\nBalance, September 30, 2021 888,579 $ 32,246,441 $ - $ (32,277,981 ) $ (31,540 )\nNet loss - - - (9,399 ) (9,399 )\nBalance, September 30, 2022 888,579 $ 32,246,441 $ - $ (32,287,380 ) $ (40,939 )\n*On March 10, 2021, the Company implemented a 10,000 for 1 reverse split of its issued and outstanding shares of common stock. Except for shares authorized, all references to number of shares and per share information have been retroactively adjusted to reflect such split.\nSee notes to unaudited financial statements.\nCONECTISYS CORPORATION\nUNAUDITED STATEMENTS OF CASH FLOWS\nFor the Years Ended September 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet (loss) $ (9,399 ) $ (4,274 )\nAdjustments to reconcile net (loss) to cash (used in) operating activities:\nChange in operating assets and liabilities\nAccrued expenses 2,150\nAdvances from former officer 7,249 3,439\nNet cash used in operating activities - (100 )\nCASH FLOWS FROM INVESTING ACTIVITIES -\nCASH FLOWS FROM FINANCING ACTIVITIES - -\nCHANGES IN CASH - -\nCASH AND CASH EQUIVALENT, beginning of year - -\nCASH AND CASH EQUIVALENT, end of year $ - $ -\nSUPPLEMENTAL CASH FLOW INFORMATION:\nCash paid for income tax $ - $ -\nCash paid for interest $ - $ -\nSee notes to unaudited financial statements.\nConectisys Corporation\nNotes to Unaudited Financial Statements\nSeptember 30, 2022\nNote 1 - Nature of business and organization\nConectiSys Corporation (the Company) was incorporated in Colorado on February 2, 1986 under the name Coastal Financial Corp. On December 5, 1994, Coastal Financial Corp. changed its name to BDR Industries, Inc. which changed its name on October 16, 1995, to ConectiSys Corporation.\nThe Company was engaged in the development of a low-cost automatic meter reading, or AMR, solution until it ceased all business activity in 2008.\nConectisys was an SEC reporting company until 2008. Its last Form 10-K, for the fiscal year 2007, was filed on Jan 4, 2008; its last Form 10-Q, for the three and nine months ended June 30, 2008, was filed on Sep. 15, 2008.\nAs of June 30, 2008, Conectisys had notes payable aggregating $6,633,312.\nOf this total, several five-year notes aggregating $3,082,655 were payable to NIR & Affiliates. NIR was a mutual fund run by Corey Ribotsky. NIR provided Conectisys with significant funding from 2002 through 2008 in the form of convertible notes with stock conversion at a significant discount to the market (up to 80% at times) commonly known as a pipe. In March 2008 NIR provided the last of its funding to Conectisys. In the 3rd quarter of 2008 Conectisys was in default on its obligations to NIR by (1) failure to pay interest and (2) failure to maintain an active SB-2 filing for issuance of the convertible shares. In 2009, Conectisys failed to timely file its 2008 10-K Report. Conectisys was removed from trading on the OTC and began trading on the Pink Sheets.\nThe balance of the convertible notes, aggregating $ 3.550,657, were payable to AJW, New Millennium Capital Partners and Laurus Master Fund.\nAll the notes were due at various times from 2002 to 2008. There were no repayments and, after the six-year statute of limitations, all the notes and the related accrued interest, $498,132 as of June 30, 2008, became null and void at various times through April 2017.\nConectisys was a victim of predatory lending by Corey Ribotsky and his NIR Group, as evidenced by a civil complaint filed by the U.S, Securities & Exchange Commission (SEC) against Mr. Ribotsky, NIR and others on September 28, 2011 in Federal Court in the Eastern District of New York.\nTo settle the SEC's related administrative proceedings, Ribotsky consented to be barred from any future association with any broker, dealer, investment adviser, municipal securities dealer, municipal advisor, transfer agent, or nationally recognized statistical rating organization.\nThe statute of limitations to sue in contract matters or debt collection is 6 years in the State of New York which was the agreed upon jurisdiction by both Conectisys and NIR. Further, NIR and all its affiliates ceased to operate as a result of the SEC enforcement actions.\nAs of April 2017, all obligations, notes, debt, warrants, and options are past their due dates and barred from any collection efforts since the time frame allowed by the statute of limitations for a legal action has expired.\nFrom November 2002 to March 2008, Conectisys issued an aggregate of 67,620,000 five-year and seven-year Common Stock warrants to accredited investors in connection with several convertible debenture financing arrangements.\nAll such warrants and all stock options expired unexercised.\nAll assets as of June 30, 2008, $172,581, were fully amortized or realized by the end of fiscal 2008.\nAs of June 30, 2008, the Company had $2,418,148 in accrued compensation and $40,174 due to officers. None of these obligations were paid and became null and void after the six-year statute of limitations.\nAccounts payable and other current liabilities were either partially paid or became null and void after the six-year statute of limitations.\nFrom its inception in 1990 through June 30, 2008, Conectisys had aggregate revenues of approximately $524,000 from the sale of its H-NET AMR systems.\nOperations: None\nCustomers: None\nEmployees: None\nNote 2 - Basis of Presentation and Summary of significant accounting policies\nBasis of presentation\nThe accompanying financial statements have been prepared in accordance with the generally accepted accounting principles in the United States of America (U.S. GAAP) and pursuant to the rules and regulations of the Securities Exchange Commission (SEC).\nCash and cash equivalents\nCash and cash equivalents consist of amounts of cash on hand and bank deposits.\nUse of estimates and assumptions\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the amounts of assets and liabilities reported and disclosures of contingent assets and liabilities as of the date of the financial statements and the reported amounts of revenues and expenses during the periods presented. Actual results could differ from these estimates.\nIncome taxes\nThe Company accounts for income taxes under the asset and liability method. Deferred tax assets and liabilities are recognized for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their perspective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which the temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Valuation allowances are recorded, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nThe Company has adopted the provisions of ASC 740, Income Taxes.\nCommitments and Contingencies\nIn the ordinary course of business, the Company is subject to certain contingencies, including legal proceedings and claims arising out of the business that relate to a wide range of matters, such as government investigations and tax matters. The Company recognizes a liability for such contingency if it determines it is probable that a loss occurred and a reasonable estimate of the loss can be made. The Company may consider many factors in making these assessments including historical and specific facts and circumstances of each matter.\nEarnings per share\nBasic earnings per share are computed by dividing net income attributable to holders of Common Stock by the weighted average number of Common Stock outstanding during the year. Diluted earnings per share reflect the potential dilution that could occur if securities to issue Common Stock were exercised.\nRecently issued accounting pronouncements\nThe Company does not believe that recently issued accounting standards will have a material effect on its financial statements.\nSubsequent events\nThe Company evaluated subsequent events and transactions that occurred after the balance sheet date through the date that the financial statements are available to be issued. There are no material subsequent events that required recognition or additional disclosure.\nGoing concern\nThe accompanying financial statements have been prepared in conformity with generally accepted accounting principles, which contemplate continuation of the Company as a going concern. Additional capital infusion is necessary in order to fund current expenditures, acquire business opportunities and achieve profitable operations. This factor raises substantial doubt about the Companys ability to continue as a going concern.\nThe Companys management intends to continue funding current expenditures and to raise additional funds. However, there can be no assurance that management will be successful in this endeavor.\nNote 3 - Loss Per Share\nThe following table sets forth the computation of basic and diluted loss per share for the years presented:\nComputation of basic and diluted loss per share\nYears ended September 30,\nNumerator: Net loss $ (9,399 ) $ (4,274 )\nDenominator: Weighted average shares outstanding* 888,579 888,579\nNet loss per share $ (0.01 ) $ (0.00 )\n*Effective March 10, 2021, the Company implemented a 10,000 to 1 reverse split of its issued and outstanding shares of common stock. The number of post-split shares held by each shareholder will be rounded up to the nearest digit, with a minimum of 1 share. Accordingly, our transfer agent will determine the exact number of shares outstanding post-split. The computation of basic and diluted Loss per Share was retroactively adjusted for all periods presented.\nNote 4 - Equity\nThe total number of authorized shares of capital stock, as amended, is currently 300,000,000, consisting of 250,000,000 common shares, no par value, and 50,000,000 shares of preferred stock. The number of post-split common shares outstanding is 888,579, of which 838,100 are owned by our sole director and officer. Of the 50,000,000 shares of preferred stock, 1,000,000 shares are designated Class A, $1.00 par value per share, with each share having voting rights equal to 100 common shares. In addition, 1,000,000 shares are designated Class B, $1.00 par value per share, with each share convertible into 10 common shares. The remaining 48,000,000 preferred shares authorized are undesignated. None of the preferred shares are issued and outstanding.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCONECTISYS CORPORATION\nBy: /s/ Danilo Cacciamatta\nDanilo Cacciamatta\nChief Executive Officer\nPrincipal Accounting Officer\nDate: December 27, 2022"
}