{
    "cik": "790652",
    "company": "IMAGING DIAGNOSTIC SYSTEMS INC /FL/",
    "filing_type": "10-K",
    "filing_date": "2022-10-04",
    "period_of_report": "2022-06-30",
    "sic": "3845",
    "state_of_inc": "FL",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/790652/0001213900-22-061798-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/790652/000121390022061798/f10k2022_imaging.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/790652/0001213900-22-061798.txt",
    "filename": "790652_10K_2022_0001213900-22-061798.htm",
    "content": "Item 1. Business\nGENERAL BUSINESS OVERVIEW\nOur business address is 618 E South St, Suite 500, Orlando, FL 32801. Our Internet website address is www.imds.com. The information contained in, or that can be accessed through, our website is not part of this Form 10-K annual report.\nImaging Diagnostic Systems, Inc. (IDSI or the Company) is a late development stage medical technology company that has developed a new, non-invasive CT scanner (CTLM®) that uses a laser beam in place of ionizing X-ray for breast imaging. This technology is called Diffuse Optical Tomography. The CTLM® will provide an adjunctive imaging modality to other methods of imaging the breast such as X-ray mammography, MRI and ultrasound.\nSince inception in December 1993 as a Florida corporation and subsequently its reverse merger with Alkan Corp., a New Jersey Corporation on April 14, 1994, we continued operations and changed our state of incorporation from New Jersey to Florida, effective July 1, 1995. On July 14, 1995, we filed with the United States Securities and Exchange Commission (SEC) a Form 10 SB for registration of our securities as a small business issuer. The Form 10 SB was declared effective in September 1995 and our stock began trading on the OTC Bulletin Board (OTC:BB) on September 20, 1995 under the symbol IMDS. We became a fully reporting company under Commission File Number 0-26028 and traded on the OTC:BB and then on the OTC:QB and ultimately on the OTC PINK until September 25, 2014, at which time our registration was revoked by the SEC for failure to timely file our required periodic reports. Our latest quarterly report on Form 10-Q that was filed prior to our filing of our Form 10 registration statement on August 28, 2018, was filed on May 15, 2013, for the quarter ended March 31, 2013. Our latest annual report on Form 10-K that was filed prior to the filing of our Form 10 registration statement on August 28, 2018, was filed on October 15, 2012, for the year ended June 30, 2012. Copies of our SEC reports through the date of revocation (the Prior Reports) are available at www.sec.gov.\nOn August 28, 2018, we filed a Form 10 registration statement to register issued and outstanding shares held by our shareholders and to become a fully reporting company under the Securities Exchange Act of 1934 (the Exchange Act). The Form 10 was amended in response to SEC comments on October 5, 2018 and November 14, 2018. On February 7, 2019, the SEC confirmed that it had no further comments on the Form 10. Under the Exchange Act, our registration became effective on October 29, 2018, i.e. 60 days after filing the Form 10. The Form 10 was further amended on September 26, 2019 to correct the classification of the Series L Convertible Preferred Stock from a current liability to temporary equity.\nAs of the date of this annual report on Form 10-K for the year ended June 30, 2022, we have had no substantial revenues from our operations and have incurred net losses applicable to common shareholders since inception through June 30, 2022 of $135,482,996 after discounts and dividends on preferred stock. We incurred net losses applicable to common shareholders of $665,329 for the year ended June 30, 2022 and $707,918 for the year ended June 30, 2021.\nThe Company received marking clearance for the CTLM® from the Chinese FDA (CFDA) effective November 16, 2018 to November 15, 2023 as disclosed in the Companys 8-K report filed December 11, 2018; however, we anticipate that substantial losses from operations will continue until we begin to generate revenues through the sales of CTLM® systems in China. We believe that we face substantial delays before receiving marketing clearance through the U.S. Food and Drug Administration (FDA). These losses will be primarily due to an anticipated increase in marketing, manufacturing and operational expenses associated with the international commercialization of the CTLM®, expenses associated with international commercialization of the CTLM®, expenses associated with FDA approval processes, and the costs associated with advanced product development activities. We have implemented a new business strategy which includes a licensing agreement on June 20, 2017 with Xian IDI Laser Imaging Co. Ltd (Xian IDI), a related party, to shift manufacturing of the CTLM® for the China and Asian markets to China.\nThe Companys next regulatory focus, after having obtained CFDA approval in China, is on obtaining marketing clearance of its CTLM® Breast Imaging System through the FDA. The premarket approval (PMA) process for U.S. marketing clearance is expected to take longer than the Chinese process, and we intend to resume this effort after successful marketing and sales of CTLM® systems in China. Our sales and marketing efforts in China have been significantly hindered by the ongoing COVID-19 pandemic, and therefore we do not expect revenue from China in the foreseeable future. No sales in other countries are expected in the near future, as we do not intend to pursue sales in other countries until after obtaining FDA marketing clearance.\nIn analyzing the regulatory path forward, timeline, and costs associated with the level of effort required to upgrade the Companys Quality Management System (QMS), we have decided not to renew our CE mark (required for sales in the European Union) for this year and to consider reapplying in 2 to 3 years to avoid these regulatory fees. Similarly, we will maintain our Quality Management System to be compliant to ISO 13485:2016 but not certify to ISO 13485:2016 by Underwriters Laboratories (UL) which will allow us to avoid fees associated with certification, travel, and hosting audits. Maintaining our QMS to be ISO 13485:2016 compliant will allow us to quickly schedule an audit with UL and become ISO 13485 certified when necessary.\nOn October 23, 2019, we entered into a consulting agreement effective as of November 1, 2019, with Dr. Huabei Jiang to serve as IDSIs Chief Scientific Consultant (the Consulting Agreement). Pursuant to the Consulting Agreement, Dr. Jiang is focused on improving the technical performance and image quality of IDSIs Computed Tomography Laser Mammography (CTLM®) breast imaging device. The details of this Agreement were disclosed on our Form 8-K report filed with the SEC on October 29, 2019. As of the date of this report, Dr. Jiang has completed the first phase of image quality improvement and is currently collecting image data for evaluation and further technical improvement.\nXian IDI has been working with Yiling Hospital Management Group based in Beijing, China (Yiling) to evaluate CTLMs potential use and application. As of the date of this report, Xian IDI has loaned three CTLM® systems to Yiling and Yiling is at the stage of testing and data validation.\nIt is important that the effectiveness of the image quality improvements be established before Xian IDI can resume their sales and marketing efforts in China. Once IDSI has substantial revenues and cash flow, we believe we will be able to raise from operations and/or private investors the necessary funding to allow us to move forward with our CTLM® 3.0 project, as discussed in detail in the CTLM® section below. The CTLM® 3.0 project and some regulatory initiatives have been put on hold due to the COVID-19 pandemic and its consequences.\nSALE OF UNREGISTERED SECURITIES RESULTING IN A CHANGE OF CONTROL\nIDSIs financial condition steadily deteriorated following the 2008 financial crisis and during the subsequent recession and weak economic recovery and by 2013 we found it impossible to raise the capital needed to continue operations, so our focus turned to finding an acquirer with the substantial financial resources and technical understanding required to complete the regulatory approval processes and bring the CTLM® to market domestically and internationally. Given our dire financial condition, we were fortunate to be introduced in February 2014 to Viable International Investments LLC (Viable), a subsidiary of Sanya Wanbo (Viable) Investments, Ltd. Co (Viable China), registered in Sanya, Hainan, China. Viable China had been approved by the Ministry of Commerce of the Peoples Republic of China (Certificate # 4600201400025) to invest in senior housing projects, medical equipment projects, etc. in the U.S.\nOn August 4, 2014, pursuant to a Securities Purchase Agreement (the SPA) dated as of June 27, 2014, among IDSI, Viable and certain affiliates of IDSI, Viable agreed to purchase 600 shares of the Companys Series M convertible preferred stock (the Preferred Stock) for an aggregate purchase price of $6,000,000 ($10,000 per share) of which $100,000 was paid pursuant to a non-refundable deposit on June 27, 2014. The first closing as to 250 shares of Preferred Stock ($2,500,000) occurred on August 4, 2014.\nPursuant to the SPA, Viable agreed to purchase an additional 350 shares of Preferred Stock in tranches of 200 shares ($2,000,000) on July 31, 2015, and 150 shares ($1,500,000) within 14 days after IDSIs receipt of FDA marketing clearance. Based on the conversion price of the Preferred Stock, purchase of all of the Preferred Stock would provide Viable with beneficial ownership of 90% of our common stock based on the number of shares outstanding as of the date of the SPA. IDSI and Viable agreed to modify the timing of the second and third tranches of Viables investments so that the purchase of 200 shares of Preferred Stock ($2,000,000) closed on August 31, 2015, and the purchase of 150 shares of Preferred Stock ($1,500,000) closed on April 22, 2016, as Viable waived the condition of FDA marketing clearance.\nSince 2016, we have financed our operations through loans by Viable and its affiliates and the private placement of common stock to Viable affiliates and independent Chinese investors. We do not have any formal financing arrangements with Viable and its affiliates; however, Viable has stated its intention to continue to provide financing of our operations consistent with past practice. While we believe that Viable and its affiliates will provide on commercially reasonable terms the funding we need until we achieve a positive cash flow from operations. There can be no assurance that we will receive such funding or that we will ever achieve profitability. If Viable fails to provide the anticipated funding, we would be materially adversely affected and may have to cease operations due to a lack of funding.\nHISTORICAL OVERVIEW\nSince inception, we have been engaged in the development and testing of a laser breast imaging system that uses computed tomography and laser techniques designed to detect breast abnormalities. Our CTLM® has been initially commercialized on a limited basis in certain international markets where regulatory approvals have been obtained; however, it is not yet approved for sale in the U.S. market. The CTLM® system must obtain marketing clearance through the FDA before commercialization can begin in the U.S. market.\nWe have sold 26 CTLM® systems since inception. Since the Viable Acquisition in August 2014, we have ceased our international marketing effort and have focused on upgrading the CTLM® with the latest technology and obtaining marketing clearance in the U.S. and China. CTLM® version 2.0 was completed in 2016, and we are developing a CTLM® 3.0 prototype. The CTLM® 3.0 project has been currently put on hold due to the COVID-19 pandemic and its consequences.\nThe Company received CTLM® CFDA approval effective November 16, 2018 to November 15, 2023 as disclosed in the Companys 8-K report filed on December 11, 2018. However, there can be no assurance that we will obtain FDA marketing or other new international marketing clearances, that the CTLM® will achieve market acceptance or that sufficient revenues will be generated from sales of the CTLM® to allow us to operate profitably.\nSales in China or in other countries are expected in the foreseeable future. The Companys next regulatory focus, after having obtained CFDA approval in China, is on obtaining U.S. marketing clearance of its CTLM® Breast Imaging System through the FDA. The PMA process for U.S. marketing clearance is expected to take considerably longer than the Chinese process.\nOur financial statements have been prepared assuming that we will continue as a going concern. Our auditors, in their report for the fiscal year ended June 30, 2022 stated that we have incurred recurring operating losses and will have to obtain additional capital to sustain operations. These conditions raise substantial doubt about our ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2 Going Concern and Managements Plans, in the Notes to the Financial Statements. The accompanying financial statements for the Fiscal Year ended June 30, 2022 do not include any adjustments to reflect the possible effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\nBREAST CANCER\nBreast cancer is the most common cancer in women worldwide. According to the International Agency for Research on Cancer (IARC) and World Health Organization (WHO). It is estimated that more than 2 million new cases of breast cancer occurred among women worldwide in 2018, (using the most recent data available at time of submission). Breast cancer incidence rates around the world vary a great deal. In general, developed countries (such as the U.S., England and Australia) have higher rates than developing countries (such as Cambodia, Nepal and Rwanda).\nAccording to information provided by www.breastcancer.org, about one in eight U.S. women will develop invasive breast cancer over the course of her lifetime. In 2021, an estimated 281,550 new cases of invasive breast cancer are expected to be diagnosed in women in the U.S., along with 49,290 new cases of non-invasive (in situ) breast cancer. About 43,600 women in the U.S. are expected to die in 2021 from breast cancer. Death rates have been decreasing in women over 50, but have been steady for women under 50 since 2007. These decreases are thought to be the result of treatment advances, earlier detection through screening, and increased awareness.\nThere is widespread agreement that screening for breast cancer, when combined with appropriate follow-up, will reduce mortality from the disease. How we measure response to treatment is called the 5-year survival rate, or the percentage of people who live 5 years after being diagnosed with cancer. According to information provided by National Cancer Institute, Cancer stage at diagnosis, which refers to extent of a cancer in the body, determines treatment options and has a strong influence on the length of survival. In general, if the cancer is found only in the part of the body where it started it is localized (sometimes referred to as stage 1). If it has spread to a different part of the body, the stage is regional or distant. The earlier female breast cancer is caught, the better chance a person has of surviving five years after being diagnosed. For female breast cancer, 62.5% are diagnosed at the local stage. The 5-year survival for localized female breast cancer is 98.8%. It decreases from 98.8% to 85.5% after the cancer has spread to the lymph nodes (stage 2), and to 27.4% (stage 4) after it has spread to other organs such as the lung, liver or brain. A major problem with current detection methods is that studies have shown that mammography does not detect 10%-20% of breast cancers that are detected by physical exam alone, which may be attributed to a falsely negative mammogram.\nBreast cancer screening is generally recommended as a routine part of preventive healthcare for women over the age of 20 (approximately 90 million in the United States). Besides skin cancer, breast cancer is the most commonly diagnosed cancer among U.S. women. For these women, the American Cancer Society (ACS) has published guidelines for breast cancer screening including: (i) monthly breast self-examinations for all women over the age of 20; (ii) a clinical breast exam (CBE) every three years for women in their 20s and 30s; (iii) a baseline mammogram for women by the age of 40; and (iv) an annual mammogram for women age 40 or older (according to the American College of Radiology). Unfortunately, the U.S. Preventive Task Force Guidelines have stirred confusion by recommending biennial screening mammography for women ages 50-74.\nEach year, approximately eight million women in the United States require diagnostic testing for breast cancer due to a physical symptom, such as a palpable lesion, pain or nipple discharge, discovered through self or physical examination (approximately seven million) or a non-palpable lesion detected by screening x-ray mammography (approximately one million). Once a physician has identified a suspicious lesion in a womans breast, the physician may recommend further diagnostic procedures, including a diagnostic x-ray mammography, an ultrasound study, a magnetic resonance imaging procedure, or a minimally invasive procedure such as fine needle aspiration or large core needle biopsy. In each case, the potential benefits of additional diagnostic testing must be balanced against the costs, risks and discomfort to the patient associated with undergoing the additional procedures.\nBreast cancer can be lumped into Non-invasive (or in-situ) or Invasive: In-situ tissue types include ductal carcinoma in-situ (DCIS) or lobular carcinoma in-situ (LCIS). 20% of breast cancers are in-situ. 80% of breast cancers are invasive or infiltrating beyond their glandular or ductal origins. Breast cancers are subdivided by molecular surface markers or hormonal receptor types that determines aggressiveness, and selection for therapeutic options. To be brief, these subtypes are: 1. Luminal A (HR+/HER2-); 2. Triple Negative (HR-/HER2-); 3. Luminal B (HR+/HER2+); and 4. HER 2 Enriched (HR-/HER2+).\nThe strongest risk factor for breast cancer is a womens age. A womans breast cancer risk increases with age. The risk of breast cancer, however, is not the same for all women in a given age group. Research has shown that women with mammographically dense breasts have a higher risk of developing breast cancer. Connective and glandular tissue of the breast are mammographically dense and appear white on a mammogram, compared to fatty tissue of the breasts which appears dark or black because it is not mammographically dense. Women who have a high percentage of breast tissue that appears dense on a mammogram have a higher risk of breast cancer compared to women of similar age who have a smaller percentage or no dense breast tissue by as much as 1.5 X higher risk than the average woman. In general, younger women have dense breasts more often than older women. As a woman ages, the amount of glandular tissue naturally decreases and the amount of fatty tissue increases. Abnormalities - such as tumors in dense breasts - can be more difficult to detect on a mammogram because tumors often also appear white, which blends with dense breast stroma. According to the National Cancer Institute and American College of Radiology, approximately 50% of women in the U.S. are classified as having dense breasts (or BI-RADS type 3 or type 4 - defined as heterogeneously dense or extremely dense).\nDue in part to the limitations in the ability of the currently available modalities to identify malignant lesions, a large number of patients with suspicious lesions proceed to surgical biopsy, an invasive and expensive procedure. Approximately 1.6 million surgical biopsies are performed each year in the United States, and about 20% of the tests find cancer. The average cost of a surgical biopsy ranges from approximately $1,000 - 5,000 per procedure. Thus, biopsies of benign breast tissue may cost the U.S. healthcare system approximately $5.28 billion annually, using $3,303 per biopsy which is what a patients insurance company would pay according to HealthCareBlueBook.com. Fair Prices for a breast biopsy depend on ones zip code in the U.S. and are rated based upon being a bedside, open, MRI-guided, Stereotactic-guided, or Ultrasound-guided biopsy. In addition, biopsies result in pain, scarring, potential for infection and sometimes undue anxiety to patients. Patients who are referred to biopsy usually are required to schedule the procedure in advance and generally must wait up to 72 hours for their biopsy results.\nRace and ethnicity play into the incidence and the mortality from breast cancer. According to the American Cancer Society, incidence and death rates for breast cancer are higher among non-Hispanic Whites and non-Hispanic Blacks rather than other racial/ethnic groups. Asians and Pacific Islander women have the lowest incidence and death rates from breast cancer.\nSince the CTLM® has received CFDA marketing clearance in China, we believe the CLTM® will achieve significant market penetration in China. Consequently, it is important to discuss the demographics of breast cancer in China. Breast cancer is the most common cancer among women in China, according to the latest data from Chinas national cancer registry. An analysis of the data reveals that the incidence of breast cancer in China has increased at a rate of around 3.5% a year from 2000 to 2013, compared with a drop of 0.4% a year over the same period in the US. The analysis also reveals that breast cancer rates are higher in urban areas of China than in rural areas. And the higher the population density, the higher the rate. For small cities (population below 500,000), the incidence of breast cancer is 30 per 100,000. For medium-sized cities (population between 500,000 to 1,000,000), it is 40 in 100,000. And for large cities (population above 1m), the incidence rate is 60 per 100,000 women.\nThere are many theories as to why China is seeing a marked rise in breast cancer rates. These include:\na. With the rapid development of Chinas economy, more and more people have moved from rural areas and towns to large cities. As a result, many megacities have sprung up. By 2014, China had six megacities with populations above 10m. It is very likely that urbanization is having a big impact on breast cancer incidence in China.\nb. Having more than one child lowers breast-cancer risk. With the one-child policy in place since 1979, most women - especially if they worked in the city - had to strictly follow the policy in order to avoid being fined. Although the one-child policy rule was replaced in 2015 with a two-child policy rule, the possible benefit on breast cancer incidence will probably take 15 to 20 years to show\nc. Women are also less likely to breastfeed than previous generations, which may be another contributing factor. Research has shown that both pregnancy and breastfeeding reduce a womans risk of developing cancer, because they reduce the lifetime number of menstrual cycles. As a result, women are exposed to less estrogen. (estrogen can stimulate breast cancer cells to grow.) It has also been hypothesized that breast cells need to mature in order to produce milk and mature cells are more resistant to becoming cancer cells.\nd. In modern China, women are generally less physically active than they were in previous generations. A study published in the International Journal of Behavioral Nutrition and Physical Activity, shows that levels of physical activity for adults in China fell by nearly half between 1991 and 2011, and they declined more rapidly for women than for men.\ne. Aging is the biggest risk factor for breast cancer. Women are living longer in China, which is a key factor related to the increased incidence of breast cancer in the country. As people get older, there is more genetic damage and less ability to repair the damage.\nWith increasing incidence and mortality, cancer is the leading cause of death in China and is a major public health problem. Because of Chinas massive population (1.37 billion), previous national incidence and mortality estimates have been limited to small samples of the population using data from the 1990s or based on a specific year. With high-quality data from an additional number of population-based registries now available through the National Central Cancer Registry of China, the authors analyzed data from 72 local, population-based cancer registries (2009-2011), representing 6.5% of the population, to estimate the number of new cases and cancer deaths for 2015. Data from 22 registries were used for trend analyses (2000-2011). The results indicated that an estimated 4,292,000 new cancer cases and 2,814,000 cancer deaths would occur in China in 2015, with lung cancer being the most common incident cancer and the leading cause of cancer death. Exact details on breast cancer incidence and rates can be found in the journals Thoracic Cancer 8; 2017, pages 214-218 and the Journal of Gynecological Oncology 2018, Jan; 29 (1).\nBecause of Chinas large population, even with a small percentage improvement on cancer prevention, a sizeable number of womens lives could be saved. There are many risk factors that can be reduced by raising cancer awareness and having better education on diet, exercise, stress reduction as well as improving breast cancer screening. Public health authorities in China can play a crucial role in developing well-defined strategies to tackle the issue and reduce the breast cancer burden in China.\nSCREENING AND DIAGNOSTIC MODALITIES\nMammography is an x-ray imaging modality commonly used for both routine breast cancer screening and as a diagnostic tool. A mammogram produces either film-screen (analog) or electronic digital images of the internal structure of the breast, nipple, axilla and surrounding tissues. In a screening mammogram, physicians seek to detect unknown or asymptomatic lesions, while a diagnostic mammogram seeks to characterize suspicious or palpable lesions.\nIn the United States, a certified technologist performs the x-ray procedure under the Congressional Mammography Quality Standards Act (MQSA). MQSA was enacted to improve x-ray breast cancer detection studies by regulating machine specifications, quality control procedures, technologist training and certification, and Radiologist training, certification, and triennial continuing medical education. Still, mammography is viewed as an ‘imperfect breast cancer detection tool and is often supplemented with follow-up studies including additional mammographic views at later dates, closer physical examination of the patient, adjunctive ultrasound exams, and, when available, breast MRI, scintimammography, and/or biopsy.\nBecause x-ray mammography exposes the patient to radiation, the American Cancer Society recommends that mammograms be limited to once per year. X-ray mammography is documented to be less effective for women with dense breasts. X-ray mammography machines use mechanical means to squeeze, flatten, or compress the breast and reduce the volume so that x-rays may penetrate more uniform tissue. These techniques are technically necessary but are sometimes painful and often uncomfortable to patients. Most mammography exams include 2 views of each breast which equates to 4 compressions per session or up to 8 compressions in women with bilateral breasts prostheses. For diagnostic purposes, some centers are using contrast-enhanced mammography as a way to assess for tumors that take up iodinated contrast, increasing sensitivity.\nFor an uninsured patient, the average U.S. cost for a mammogram is $102. The Medicare billing of a diagnostic mammogram is approximately $118 to $138 per procedure and requires the use of x-ray equipment ranging in cost from $75,000 to $225,000 for film screen. Aggregate cost of mammography screening in the U.S. is recently estimated at $7.8 billion per year.\nDigital Mammography\nDigital mammography, also referred to as full-field digital mammography, is the latest form of breast x-ray examination. These systems eliminate the use of x-ray film and record images directly on electronic panels. The digital images can then be manipulated, examined on an electronic viewing station, and subjected to computed added detection or CAD. However, the limitations of conventional mammography still exist in digital mammography. Digital mammograms can be acquired as 2D or 3D, using breast tomosynthesis. Although 3D mammograms are better at detecting more abnormalities (especially in denser breasted women), they do results in higher recall rates, twice the breast radiation dose, take longer for the Radiologist to read, and cost the patient and system more money. The miss rate from using 3D mammograms has yet to be established. Many U.S. insurance companies still will not cover a 3D digital mammogram. Digital mammography units sell at around $300,000 for 2D digital units and up to $500,000 for 3D digital units and Medicare billing for these tests range from $170 to $200.\nMagnetic Resonance Imaging\nMagnetic resonance imaging (MRI) produces images using a magnetic field and radiofrequency (RF) gradients under computer control to produce multiplanar and multi-sequenced images that are sensitive to detecting a variety of pathologic processes. MRI has proven effective in imaging breasts with prosthetic implants, characterizing benign breast processes, detecting primary or recurrent cancer, evaluating the response to chemotherapy and serving as an additional imaging option when mammography or ultrasound fails to provide sufficient diagnostic conclusions.\nMRI offers the advantage over x-ray that not only visualizes fine details in breast tissue but also detects patterns of enhancement, altered blood flow and angiogenesis associated with malignancies, by using a paramagnetic agent called gadolinium (which must be injected into the patients veins and sometimes requires screening for renal insufficiency). The disadvantages are that MRI systems are not widely available in the global market and the costs of using conventional MRI scanners for breast exams are sometimes prohibitive. Dedicated breast MRI systems sell for approximately $1,200,000 and total billing is approximately $1,500, depending on whether the service is provided in a free-standing imaging center, hospital, and is billed either self-pay, private insurance or Medicare.\nUltrasound\nUltrasound imaging is routinely used in breast imaging practices. Ultrasound (U/S) systems can image breast tissue by ‘sonar techniques. Sound transducers are placed directly on breast tissue coupled with an acoustic gel substance. Trained sonographers locate suspicious or targeted areas by moving the transducer over the whole breast or over the region of interest. Breast ultrasound can be performed by a trained medical professional or it can also be done in an automated fashion. Sonographers generally acquire images in the United States. In some countries mostly outside the U.S., physicians directly perform the study and interpret the results. Ultrasound images are localized to areas of suspicion generally but not always detected by a previous mammogram. If mammographic results suggest the presence of a lesion, ultrasound may help differentiate a solid from a cystic mass, determine vascularity, concurrent adenopathy, and locate a safe biopsy access site. The global Medicare reimbursement rate for diagnostic bilateral breast ultrasound is approximately $164 per procedure and requires the use of capital equipment ranging in cost from approximately $60,000 to $400,000 depending upon unit hardware configuration, software platforms, and transducer selections.\nOptoacoustic Imaging\nThis patented technology uses a combination of anatomic and functional imaging via the use of laser optics and conventional ultrasound. Optoacoustic imaging looks for tumor angiogenesis. The main company in this field - Seno Medical Instruments (Seno) - uses proprietary laser techniques to locate oxyhemoglobin and deoxyhemoglobin signatures in breast tumors and these patterns can help clinicians decide which tumors to target for biopsy. This device, which is undergoing Pre-Market Approval and clinical pivotal studies, appears to be close to FDA approval.\nSingle-Breath Photoacoustic Computed Tomography\nThis new modality called BH-PACT, similar to CTLM® discussed below, features a deep penetration depth (4 cm in vivo) with high spatial and temporal resolutions (255 µm in-plane resolution and a 10 Hz 2D frame rate). By scanning the entire breast within a single breath hold (~15 s), a volumetric image can be acquired and subsequently reconstructed utilizing 3D back-projection with negligible breathing-induced motion artifacts. SBH-PACT clearly reveals tumors by observing higher blood vessel densities associated with tumors at high spatial resolution, showing early promise for high sensitivity in radiographically dense breasts. In addition to blood vessel imaging, the high imaging speed enables dynamic studies, such as photoacoustic elastography, which identifies tumors by showing less compliance. The research group imaged breast cancer patients with breast sizes ranging from B cup to DD cup, and skin pigmentations ranging from light to dark. SBH-PACT identified all the tumors without resorting to ionizing radiation or exogenous contrast, posing no health risks. Diffuse optical tomography has been investigated to provide functional optical contrast. However, the spatial resolution of the current prototypes limits their clinical use. Overall, each modality has notable advantages and limitations. Photoacoustic computed tomography (PACT) is a promising complementary modality that overcomes many of these limitations.\nBy developing this advanced breast imaging modality, they provided a promising tool for future clinical use including not only screening, but also diagnostic studies to determine extent of disease, to assist in surgical treatment planning, and to assess responses to neoadjuvant chemotherapy. Compared to mammography, SBH-PACT utilizes non-ionizing radiation, shows early promise for sensitivity in radiographically dense breasts, and imposes less or no pain by only slightly compressing the breast against the chest wall. Because the average hemoglobin concentration in malignant tumors is generally twice that in benign tumors and using hemoglobin as the contrast, SBH-PACT can potentially monitor breast cancers response to neoadjuvant chemotherapy by acquiring information similar to that of contrast-enhanced MRI, yet with finer spatial resolution, higher imaging speed, and only endogenous contrast. This new modality is under development at Caltech Optical Imaging Laboratory at the California Institute of Technology.\nBreast Elastography\nThis sonographic technology is increasingly being used to better characterize breast lesions, by improving specificity of B-mode ultrasound. Two elastography modes are available: free-hand and sheer-wave. Tissues have different elastic moduli and deform relative to its intrinsic stiffness. Breast Ultrasound Elastography (BUE) has an 87% sensitivity, 90% specificity, and 88% diagnostic accuracy in defining breast lesions as either malignant or benign. BUE is intended to have a high negative predictive value by reducing false positives. There are many quantitative and qualitative scoring systems to characterize lesions by using BUE. Such schemata have been incorporated into the newest ACR Ultrasound BIRADS Lexicon manual. By using these methods to characterize breast lesions, BUE is reported to increase diagnostic confidence, reduce unnecessary short-term follow up and unneeded biopsy of benign breast tumors.\nMolecular Breast Imaging\nThis technique of MBI uses a nuclear medicine agent called 99mTc Sestamibi, which is injected into the bloodstream and tends to accumulate in cancer cells within the breast, based on differences in metabolism. Then the breast is imaged on 1 or 2 detectors for up to 40 minutes total or 10 minutes per breast x 2 views. MBI is a functional study and the injected agent emits gamma rays which are identified on a scintillation crystal. By using MBI, there is added radiation dose to the patient equal to 2/3 of the background dose but at the added benefit of detecting 8 more cancers per 1000 women when compared to mammography alone. This is an alternative study in women who have dense breasts and cannot undergo MRI but should not be used in pregnant women.\nPositron Emission Mammography\nPositron emission mammography is a combination anatomic functional study of the breast utilizing a radiation emitting agent called FDG or 18-fluorodeoxyglucose or FDG-18 that is taken up in cancer cells that are utilizing glucose as an energy source. This procedure requires the patient to fast for up to 6 hours, requires 40 minutes total of scan time and is used to determine recurrence of cancer from scar tissue, when women cannot undergo MRI, or response to treatment. Because of the moderately high radiation dose, it is not used for screening but more for problem solving.\nCTLM®\nThe CTLM® system is a Diffuse Optical Tomography (DOT) CT-like scanner. Its energy source is a laser beam portion of the electromagnetic spectrum not ionizing radiation such as is used in conventional x-ray mammography or CT scanners. We believe that the advantages of imaging without ionizing radiation are very significant. CTLM® is an emerging imaging modality offering the potential of functional imaging equivalent, which can visualize the process of angiogenesis - that may be used by the radiologist or responsible physician to distinguish between benign and malignant tissue. X-ray mammography is a well-established method of imaging the breast but has limitations especially in dense breast cases. While x-ray mammography and ultrasound generally produce two dimensional images (2D) of the breast, the CTLM® produces 3D images. Ultrasound is often used as an adjunct to mammography to help differentiate tumors from cysts or help to localize a biopsy site. We believe the CTLM® will be used to provide the radiologist with additional information to manage the clinical case via angiogenesis detection; help diagnose breast cancer earlier; reduce diagnostic uncertainty especially in mammographically dense breast cases; and may help decrease the number of biopsies performed for benign lesions. Because breast cancers nearly always develop in the dense glandular tissue of the breast (and very rarely in the fatty tissue), women who have mostly dense tissue on a mammogram are at an increased risk of breast cancer, via failed mammographic detection. Abnormalities in dense breasts can be more difficult to detect on a mammogram.\nThe CTLM® technology is unique and protected by a combination of trade secrets and patents. A CTLM® breast exam is non-invasive and can be performed by a medical technologist. A patient lies face down or prone on a scanning table with one breast suspended naturally into a specially designed scanning chamber. The scanner images the breast in contiguous slices from chest wall to nipple in minutes. One breast is scanned at a time. The CTLM® is a sophisticated electro-mechanical scanner under microprocessor and computer control. Results are available immediately in digital format for comparison to mammography results, consultation, transmission to multimodality reading stations, or archiving.\nImages and study results present as multiple-slice data sets which can be viewed slice-by-slice or as a 3D volume with image manipulation tools. Images are usually viewed in gray and green color shades, since color displays are common with other molecular imaging modalities such as nuclear medicine, PET, fMRI, and in radiation therapy imaging.\nSince the Viable Acquisition we have focused on revitalizing the CTLM® technology. We completed the upgrade of the CTLM® to the CTLM® 2.0 in late 2016. We took the following principal steps in this upgrade:\n● Collecting and archiving all the documents to build the gantry and the cover of the scanner.\n● Collecting and archiving all the documents to build the controllers of the scanner.\n● Collecting and archiving all the software codes that are necessary to maintain the scanner.\n● Simulating industry standard architecture (ISA) bus using a digital input/output (IO) card on a peripheral component interconnect (PCI) bus in order to be able to use modern computers without modifying any controller of the scanner.\n● Replacing two racks of obsolete and bulky power supplies with a simple and small medical grade power supply.\n● Replacing the operator console computer.\n● Replacing the obsolete Windows 2000 operating system with Windows 8.\nWe continue to work to further advance the CTLM® technology and the quality and efficiency of our systems.\nWe believe it is critical to provide physicians with a visualization tool that allows them to find angiogenesis from the CTLM® images with minimal false positives as well as minimal false negatives. Currently, IDSI includes as a CTLM® operating component a software package known as Physician Console to enable physicians to read CTLM® images. Limited signal to noise image ratios and a lack of quantitative data are among the drawbacks of this visualization software package.\nWe are developing and plan to release a new software package known as CTLM® Physician Workstation to replace the Physician Console and provide with each CTLM® the capability to identify, locate and measure an angiogenesis area. No date has been set for its release.\nThe CTLM® Physician Workstation possesses the key features of the Physician Console and has many additional features not contained in the console, including:\n● A volumetric approach to find angiogenesis using vascular regions, MIP, ESSD and TSSD views.\n● Image measurements to find the CTLM® numbers of a pixel in a CTLM® image and the distance between two points of the breast using a CTLM® image.\n● Volume measurement of a high absorption area that could be an angiogenesis area.\n● Image correlation between CTLM® images or between a CTLM® image and another image from a different modality such as mammography.\n● Commands to manipulate images which are context sensitive, with most having shortcut keys.\n● Reading DICOM images.\n● Online help.\n● New tools including image segmentation, object collection and volume measurement to monitor neoadjuvant chemotherapy treatment. Physicians will be able to quantify the volume of angiogenesis area as a measure of potential tumor regression or non-response from chemotherapy.\nSince 2017, we began working on development of our CTLM® 3.0 scanner. This newly designed scanner will offer a very high throughput, with the scan time potentially being reduced from 20 to 2 minutes for a 100-slice breast scan. We believe that this increased efficiency will be achieved with image quality at least as good as that of the CTLM® 2.0, with diminished stair-step artifact and improved signal to noise ratio.\nFurther, we believe that the CTLM® 3.0 will be substantially easier and less expensive to manufacture, install and service, compared to the 2.0 version.\nThe principal features of the CTLM® 3.0 under development are:\n● New helical scanning mode.\n● New small footprint of the scanner.\n● New gantry.\n● Capability to move the scan chamber (in the X and Y axis) to center the breast.\n● Capability to collect data about 2mm closer to the chest wall compared to the 2.0 version.\n● New data acquisition system for faster scanning and improved signal to noise ratio.\n● New scan controls.\n● Use of wireless technology in scanning operations and visualization.\n● New database.\n● New graphical user interface (GUI).\n● New software package to scan, reconstruct and visualize.\n● Compatibility with DICOM 3.0.\nDue to the COVID-19 pandemic, this project has been delayed. Until there is adequate working capital from sales revenue or additional capital funding, this project has been put on hold.\nFLUORESCENCE IMAGING\nFluorescence and molecular imaging techniques are of growing importance to the drug development industry and for disease detection. Certain molecules exhibit the phenomenon of emitting light after being illuminated by light of an appropriate wavelength, e.g., from a laser. The light that is emitted is referred to as fluorescent light. The compounds that produce fluorescence are commonly referred to as fluorescent dyes. At least one company to our knowledge is developing a fluorescent compound for possible use in breast cancer detection.\nThe CTLM® system laser diodes can stimulate fluorescent light emissions when used in conjunction with such compounds. When an appropriate fluorescent compound has been introduced into the blood, areas with an abundance of blood vessels, i.e., the angiogenesis associated with a tumor, may retain a higher concentration of the fluorescent compound. As the CTLM® scanner illuminates these areas, fluorescent light is emitted and detected. Reconstructed CTLM® images then locate and quantify the fluorescent area within the area of interest.\nSeveral CTLM® systems were retrofitted with laser diodes tuned to specific wavelengths of light which matched the compounds. Optical filters limited the spectral responses to selected wavelengths. Experiments were conducted by placing fluorescent compounds inside a breast equivalent phantom and scanning it with CTLM®. To our knowledge we were the first with the ability to excite a fluorescent compound, detect its location within the simulated breast, and create an image. On September 14, 1999, a patent was issued to IDSI titled Laser Imaging Apparatus Using Biomedical Markers that Bind to Cancer Cells as Patent No 5,952,664. This patent expired on January 16, 2018.\nIn March 2002, we signed an agreement with Schering AG to evaluate the advantages of new fluorescence compounds for the potential use of detecting breast cancer. We installed three CTLM® systems for Schering AGs clinical trials: one at Charités Robert-Rössle Clinic in Berlin, one at the University of Muenster, and the third at Charité Hospital in Berlin, Germany as part of their Phase 1 clinical studies of fluorescent imaging compounds. In November 2005, we announced that Schering AG had completed the evaluation of fluorescent imaging compound SF64 with three modified CT Laser Mammography systems.\nIn July 2009, we announced the commencement of a breast cancer imaging study at the Charité, Medical University in Berlin, Germany. The study examined the potential role of the CTLM® as an enhanced breast cancer screening tool when used in combination with the fluorescent dye, Indocyanine Green (ICG). The study was conducted at the Campus Virchow-Klinikum and the principal investigator was radiologist Dr. Alexander Poellinger. Pending further investigation, technical refinement and funding, IDSI has postponed its efforts to research and develop fluorescence imaging techniques.\nGOVERNMENT REGULATION AND APPROVALS\nUnited States Regulation\nThe CTLM® is a medical device and it is subject to the relevant provisions of the United States Food, Drug and Cosmetic Act (FD&C Act) and its implementing regulations. Pursuant to the FD&C Act, the FDA regulates, among other things, the manufacturing, labeling, distribution, and promotion of the CTLM® in the United States. The Act requires that a medical device must (unless exempted by regulation) be cleared or approved by the FDA before being commercially distributed in the United States. The FD&C Act also requires that manufacturers of medical devices, among other things, comply with specific labeling requirements and manufacture devices in accordance with Current Good Manufacturing Practices, which require that companies manufacture their products and maintain related documentation in a conformed manner with respect to manufacturing, testing, and quality control activities. The FDA inspects medical device manufacturers and distributors, and has broad authority to order recalls of medical devices, to seize non-complying medical devices, to enjoin and/or impose civil penalties, and to criminally prosecute violators.\nThe FDA classifies medical devices intended for human use into three classes: Class I; Class II; and Class III. The CTLM® is a Class III device. A PMA is the FDA process of scientific and regulatory review to evaluate the safety and effectiveness of Class III medical devices. Class III devices are those that support or sustain human life, are of substantial importance in preventing impairment of human health, or which present a potentially unreasonable risk of illness or injury. Due to the level of risk associated with Class III devices, the FDA has determined that general and special controls alone are insufficient to assure the safety and effectiveness of Class III devices. Therefore, these devices require a PMA application in order to obtain marketing clearance.\nThe FDA automatically classifies new technologies in Class III when limited safety information is available and no predicate device is available. It allows for multiple clinical studies to be pursued to gather the necessary data to obtain safety and clinical information to be used for future FDA submissions. At the time that we were developing the CTLM® system and considering our options for obtaining marketing clearance there was not enough data on laser-based technologies nor were there approved other new medical devices dedicated to breast imaging other than the traditional x-ray technology. As a result, the FDA in an August 2011 letter recommended that we seek a PMA application, and we decided to proceed accordingly. After receipt of the PMA, IDSI can apply to have the risk reduced to the Class II risk classification where other diagnostic devices are classified.\nProgress toward submitting a PMA application during 2012-13 was significantly delayed and then eventually halted due to lack of funding, which required us to lay off key employees and terminate our clinical activities and prevented us from hiring the necessary FDA consultants required to assist in the process.\nFollowing the Viable Acquisition, our new management conducted a detailed analysis of our pre-acquisition FDA approval process and formulated a new plan for obtaining the approval, backed by Viables commitment to provide the necessary funding. We hired a new specialized regulatory consulting firm and legal counsel with expertise in the FDA Approval process. We determined that, unfortunately, our pre-acquisition clinical data could not be used due to non-conformance with FDA requirements. Consequently, we decided to conduct new clinical studies in order to collect the patient data required for our new PMA application. In December 2015, we and our consultants met with the FDA examiners responsible for our approval process, and we presented our proposed approach for data collection, patient selection and data analysis. After receiving the FDA examiners input (critiques and suggestions), we began working on a revised PMA protocol and also re-evaluating our PMA strategy.\nAfter our December 2015 informational meeting with the FDA, we drafted a revised clinical investigation plan (CIP) for purposes of the PMA process; however, we have not yet submitted the CIP to the FDA as we have been focusing since 2016 on our initial goal of obtaining CFDA marketing clearance and launching operations in China. We are awaiting more clinical data from China in order to formulate our PMA pathway and strategy. All of the data and trials we have assembled and conducted to date are for internal evaluation purposes and not for submission to the FDA. Once we have developed a clear PMA strategy in conjunction with our FDA consultants, all of our clinical trials going forward will be designed to meet the FDAs requirements for the PMA process.\nBased on our current CIP, the intended use of the CTLM® is an adjunct to mammography for breast cancer screening in asymptomatic women who have dense (heterogeneously or extremely) breasts per ACR categories. We may also pursue application of our technology in the neoadjuvant therapy areas. We will rely on our FDA consultants to determine estimated costs and milestones for the PMA process which will resume when we have adequate funding from operations and/or from Viable and its affiliates; however, there can be no assurance that we will secure this funding. There can be no assurance that we will be able to timely submit our PMA application or that, if submitted, we will ultimately receive approval of the application by the FDA. If we are unable to timely obtain marketing clearance for the CTLM® in the United States, our business and financial condition could be materially adversely affected.\nWe will be able to submit our PMA application only after successful completion and analysis of the relevant clinical trials, the plans for which have yet to be determined.\nSubmission of a PMA application is followed by a four-step review process consisting of:\n● Administrative and limited scientific review by FDA staff to determine completeness (acceptance and filing reviews);\n● In-depth scientific, regulatory, and quality system review by appropriate FDA personnel (substantive review);\n● Review and recommendation by the appropriate advisory committee (panel review); and\n● Final deliberations, documentation and notification of the FDA decision.\nFDA regulations provide 180 days to review a PMA application and make a determination. In reality, the review time is normally longer. Before approving or denying a PMA application, the appropriate FDA advisory committee may review the application at a public meeting and provide the FDA with the committees recommendation on whether the FDA should approve the submission. After the FDA notifies the applicant that the application has been approved or denied, a notice is published on the Internet (1) announcing the data on which the decision is based, and (2) providing interested persons an opportunity to petition the FDA within 30 days for reconsideration of the decision.\nThe third-party manufacturers upon which we will depend to manufacture our products are required to adhere to applicable FDA regulations regarding quality systems regulations commonly referred to as QSRs, which include testing, control and documentation requirements. Failure to comply with applicable regulatory requirements, including marketing and promoting products for unapproved use, could result in warning letters, fines, injunctions, civil penalties, recall or seizure of products, total or partial suspension of production, refusal of the government to grant pre-market clearance or approval for devices, withdrawal of approvals and criminal prosecution. Changes in existing regulations or adoption of new government regulations or policies could prevent or delay regulatory approval of our products. Material changes to medical devices also are subject to FDA review and clearance or approval.\nAny products manufactured or distributed by us pursuant to FDA marketing clearance will be subject to pervasive and continuing regulation by the FDA. Labeling, advertising and promotional activities are subject to scrutiny by the FDA and, in certain instances, by the Federal Trade Commission. In addition, the marketing and use of our products may be regulated by various state agencies. The export of medical devices is also subject to regulation in certain instances. Both the FDA and the individual states may inspect the manufacturers of our products on a routine basis for compliance with current QSR regulations and other requirements.\nIn addition to the foregoing, we are subject to numerous federal, state, and local laws relating to such matters as safe working conditions, manufacturing practices, environmental protection, and fire hazard control. There can be no assurance that we will not be required to incur significant costs to comply with such laws and regulations and that such compliance will not have a material adverse effect upon our ability to conduct business. See Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations-Cautionary Statements - Extensive Government Regulation, No Assurance of Regulatory Approvals.\nInternational Regulatory Overview\nIDSI has upgraded its quality system for manufacturing from ISO 13485:2003 to ISO 13485:2016 in June 2018 by successfully passing our certification audit conducted by Underwriters Laboratory (UL). We have not renewed our ISO 13485:2016 certificate to avoid the fees associated with this registration until we are ready to manufacture.\nEurope\nBased on our initial UL certification, in 2001 we obtained the CE Mark, which is required for us to sell the CTLM® in the European Union (EU). The CE Mark expired in July 2021, and we have not renewed it to avoid substantial regulatory fees. We will maintain our Quality Management System in accordance with ISO 13485:2016 which will allow us to achieve ISO registration quickly to aid in our pursuit of FDA marketing clearance and the CE Mark in the future.\nChina\nWe received CTLM® CFDA approval effective November 16, 2018 to November 15, 2023 as disclosed in our Form 8-K report filed on December 11, 2018.\nAustralia, Brazil, Canada, Japan and the United States\nIDSI is currently upgrading its QMS to meet the requirements of the Medical Device Single Audit Program (MDSAP) in 2019 which will satisfy the audit and QMS requirements for these countries. This sets the stage for IDSI to register the CTLM® in each of these countries so that it can eventually be marketed, subject to satisfaction of other relevant regulations in each country.\nDOMESTIC SALES AND MARKETING\nThe CTLM® will be positioned as an adjunct to x-ray mammography and may be especially useful in studies of dense breasts. Consequently, CTLM® will be marketed to centers performing x-ray mammography. There are approximately 8,600 Mammography Quality Standards Act (MQSA) centers certified in the United States. Marketing and sales in the U.S. cannot occur unless and until we receive pre-market approval from the FDA. IDSI will begin marketing to the centers following FDA approval.\nSince Diffuse Optical Tomography for laser breast imaging is a new imaging modality the rate at which the CTLM® achieves market acceptance and penetration will depend on many variables. These include, but are not limited to, the establishment and demonstration in the medical community of the clinical safety, efficacy, and cost-effectiveness of the CTLM®, and the advantage of the CTLM® when used as an adjunct to existing technology and cancer detection methods.\nThe medical community and U.S. government have recognized the need to address health concerns for women with dense breasts. As per https://densebreast-info.org/ 38 states and the District of Columbia have enacted mandatory breast density legislation. These laws require physicians to inform women who have undergone mammography regarding and about their breast density or about dense breast in general. Why the worry? Because\n1. BREAST DENSITY CAN OBSCURE CANCERS. Breast density increases the likelihood that cancer will be missed by mammography; as breast density increases, mammographic sensitivity decreases.\n2. BREAST DENSITY IS AN INDEPENDENT RISK FACTOR FOR THE DEVELOPMENT OF BREAST CANCER. Women with the densest breasts are 4 to 6-fold more likely to develop breast cancer than women with the least dense breasts.\n3. IDENTIFY THE HIGH-RISK PATIENT WHO NEEDS INCREASED SURVEILLANCE. Annual supplemental MRI screening is recommended in high-risk women beginning at age 25.\n4. UNDERSTAND SCREENING OPTIONS FOR WOMEN WITH DENSE BREASTS. If a woman has dense breasts, should she consider supplemental screening beyond mammography alone?\n5. THERE ARE RISKS OF FALSE POSITIVES WITH ANY SCREENING STRATEGY. Tomosynthesis (3D mammography) can reduce false positives and improve cancer detection, but is it available for your patients, and is it warranted?\nIf the classification of dense breasts is made for a patient, then she may want to discuss other screening options shown by guiding flow charts. These laws were put in place to help women get the necessary information to decide on further action if they were notified that they have dense breast tissue. In conjunction with these laws, the 114th U.S. Congress has introduced a National Standard for Density Reporting. According to the American College of Radiology approximately 50% of women are considered to have dense breasts. Failure of our products to gain market acceptance would have a material adverse effect on our business, financial condition, and results of operations. There can be no assurance that physicians or the medical community in general will accept and/or utilize the CTLM®.\nIn order to effectively market any products, we may develop, we will have to develop a marketing and distribution channel with technical expertise and distribution capability. There can be no assurance that we will be able to establish sales and distribution capabilities or that we will be successful in gaining market acceptance for the CTLM® or any other products we may develop.\nINTERNATIONAL SALES AND MARKETING\nThe only regulatory clearance we have now is CFDA marketing clearance in China, and we rely on our affiliate Xian IDI for all sales and marketing efforts in China. If and when we renew our CE Mark and obtain regulatory marketing clearances in other foreign countries, we plan to rely on strategic relationships with key international distributors for sales and service of the CTLM®. Financial and logistical considerations make a direct sales model unfeasible. Costs associated with maintaining direct relationships with specific contacts and customers, hiring appropriately trained sales, marketing and service personnel or ensuring compliance with local product registration requirements all lead us to utilize a distributor sales model.\nSales of CTLM® systems outside of the United States are subject to foreign regulatory requirements that vary widely from country to country. The time required to obtain approval for sale in foreign countries may be longer or shorter than that required for FDA clearance or approval, and the requirements may differ. The laws of certain European and Asian countries permit us to market the CTLM® in those countries before marketing would be permitted in the United States. As a result, we sold 26 CTLM® systems before the Viable Acquisition. In order to export the CTLM® to other countries we must obtain and maintain the FDA Certificate of Exportability for the CTLM®. This certificate is required for the export of Class III medical devices which have not received U.S. marketing clearance. The Certificate of Exportability must be renewed every two years. IDSIs current certificate expired on August 20, 2020, and has not been renewed.\nPrior to the Viable Acquisition, IDSI had obtained China marketing clearance through SFDA approval no. 20043241646 in August 2004. This approval expired in August 2008. We obtained a second SFDA approval no. 20093242463 in October 2009. These approvals allowed limited government reimbursement for the CTLM®. Four CTLM® systems were sold to China Far East International Trading Corp. in 2004, and in 2007 a CTLM® was placed at Tianjin Cancer Hospital where a clinical study was conducted by Jin Qi, MD, who wrote a clinical paper at the conclusion of her study. The paper was published in the March-April 2013 issue of Clinical Imaging which can be found at www.clinicalimaging.org. We were forced to terminate our marketing efforts in China due to the loss of SFDA certification when SFDA changed from SFDA to CFDA in March 2013. Due to our lack of financial resources, IDSI was not able to pursue CFDA approval until after the Viable Acquisition.\nSince the Viable Acquisition, we have decided to refocus on the Chinese market as it is by far the largest international market for the CTLM® , our management and Viable are very familiar with that market, and Chinas more efficient regulatory procedures provide the opportunity to obtain marketing clearance well before U.S. marketing clearance is likely to be obtained.\nIn June 2017, we entered into a Technology Licensing Agreement (the Xian Agreement) with Xian IDI Laser Image Co. Ltd. (Xian IDI), of Xian, Shaanxi Province, China. Xian IDI is an affiliate of Viable. Pursuant to the Xian Agreement, Xian IDI has the exclusive right to manufacture the CTLM® in China and sell the CTLM® in China, Hong Kong, Macau and Taiwan. Xian IDI must pay to IDSI on a quarterly basis a royalty of 25% of the gross revenues from the sale of the CTLM® and related parts and accessories. We expect to sell the CTLM® in China for a price of approximately $250,000.\nThe Company received CTLM® CFDA approval effective November 16, 2018 to November 15, 2023 as disclosed in the Companys 8-K filing on December 11, 2018. However, there can be no assurance that we will obtain FDA marketing or other new international marketing clearances, that the CTLM® will achieve market acceptance or that sufficient revenues will be generated from sales of the CTLM® to allow us to operate profitably.\nWe have previously obtained the CE Mark and were permitted to sell the CTLM® in the 28 countries that are members of the European Union (EU); however, our lack of FDA marketing clearance is a practical impediment to our marketing the CTLM® in the EU and certain other countries as un-approved U.S. medical devices are perceived as inferior in those countries. In analyzing the regulatory path forward, timeline, and costs associated with the level of effort required to upgrade the Companys Quality Management System, we have decided not to renew our CE mark (required for sales in the European Union) for this year and to consider reapplying in 2 to 3 years to avoid substantial regulatory fees. We will maintain our ISO 13485:2016 certification which will allow us to pursue U.S. marketing clearance and the CE Mark in the future. We intend to defer marketing efforts in the EU until we believe we are close to receiving U.S. marketing clearance.\nWe will be subject to the substantial risks associated with international sales, including economic and political instability, shipping delays, fluctuation of foreign currency exchange rates, foreign regulatory requirements and various tariffs and trade restrictions, all of which could have a significant impact on our ability to deliver products on a timely basis. Future imposition of, or significant increases in the level of tariffs, export quotas or other trade restrictions could have a material adverse effect on our business, financial condition and results of operations. The regulation of medical devices continues to develop and there can be no assurance that new laws or regulations will not have an adverse effect on us.\nTHIRD-PARTY REIMBURSEMENT; HEALTH CARE REFORM\nIn the United States, suppliers of health care products and services are greatly affected by Medicare, Medicaid, and the Affordable Care Act (ACA or the Act), as well as by private insurance reimbursement programs. Third-party payers (Medicare, Medicaid, private health insurance companies and other organizations) may affect the pricing or relative attractiveness of our products by regulating the level of reimbursement provided by such payers to the physicians and clinics utilizing the CTLM® or by refusing reimbursement. There can be no assurance that third-party payers will provide reimbursement for use of our products. In international markets, reimbursement by private third-party medical insurance providers, including governmental insurers and independent providers, varies from country to country. In certain countries, our ability to achieve significant market penetration may depend upon the availability of third-party governmental reimbursement.\nThe U.S. President and Congress have enacted a comprehensive reform of the U.S. healthcare system through the passage of the ACA, most of whose provisions took effect in 2013-14. The ultimate effect of this new Act to reform health care is uncertain, and there can be no assurance that the changes made to the U.S. healthcare system will not materially adversely affect us. Some of the provisions in the Act may limit and further reduce and control spending on healthcare products and services, limit coverage for new technology and limit or control the price health care providers and drug and device manufacturers may charge for their services and products, respectively. These reforms could cause U.S. healthcare providers to limit use of or not use the CTLM® systems, in which case we would be materially adversely affected.\nPRODUCT LIABILITY\nOur business exposes us to potential product liability risks, which are inherent in the testing, manufacturing and marketing of cancer detection products. While the CTLM® is being developed as an adjunct to other diagnostic techniques, there can be no assurance that we will not be subjected to substantial claims and potential liability. Before the Viable Acquisition we carried $3,000,000 in product liability insurance to cover both clinical sites and sales. As part of our cost savings initiatives, we cancelled the policy as we had not had any adverse experiences after conducting more than 25,000 patient scans worldwide; however, if an end user such as a hospital or imaging center requires us to provide specific product liability insurance, we intend to ensure that our insurance meets any reasonable requirements.\nCOMPETITION\nThe medical device industry generally, and the diagnostic imaging segments in particular, are characterized by rapidly evolving technology and intense competition. The IDSI approach of employing continuous wave laser optical technology in a CT-like device to produce 3D images for breast cancer detection is unique, and the concept of imaging angiogenesis in the breast to differentiate between benign and malignant tissue is well accepted.\nAlthough the CTLM® system is a CT-like scanner, its energy source for imaging is a laser beam and not ionizing radiation such as is found in conventional x-ray mammography or CT scanners. The advantage of imaging without ionizing radiation may be significant in our markets. X-ray mammography is a well-established method of imaging the structures within the breast. Ultrasound is often used as an adjunct to help differentiate tumors and cysts. The CTLM® is being marketed as an adjunct to mammography and will not compete directly with X-ray mammography. CTLM® is, however, a method of molecular functional imaging, which can visualize the process of angiogenesis which may be used to distinguish between benign and malignant tissue. Unlike X-ray or ultrasound, optical molecular imaging is a revolutionary functional imaging modality. In this respect, CTLM® may compete with magnetic resonance imaging (MRI) in breast imaging because both CTLM® and MRI have the capacity to visualize function at the molecular level.\nTo our knowledge, several companies have targeted the breast optical imaging market. Advanced Research Technologies, Inc. (ART) (TSX:ARA) developed a non-3D imager which does not utilize our proprietary continuous wave technology and in which the breast must be immersed in a gel to be scanned. As far as we know, ART has not received a PMA and no information on the company or its product, SoftScan, is available since 2008. On February 18, 2013, ART Advanced Research Technologies Inc. filed an assignment and KPMG Inc. was appointed as trustee of the estate of the bankrupt by the official receiver, subject to affirmation by the creditors of the trustees appointment or substitution of another trustee by the creditors.\nWe expect, as patents on devices using lasers as an energy source for optical imaging expire, to see medical device companies take an interest in laser imaging. IDSI has been a pioneer in Diffuse Optical Tomography and has sold CTLM® systems for commercial purposes.\nSeveral medical imaging companies such as Seno Medical Instruments are developing devices that are multi-modality combining ultrasound with laser and could be viewed as competitive, however, we are unaware of the launch of any such devices.\nWe believe that we will face strong competition in the coming years. Nonetheless, since new technologies and devices generally require substantial time for development and market acceptance, we believe that we have a significant advantage due to our CFDA approval and launch of sales of our CTLM® in the Chinese market. In order to maintain our competitive advantages, we plan to increase our research and development efforts in order to enhance our existing device and potentially develop new devices. We believe that ongoing innovation is a key to our success.\nPATENTS AND INTELLECTUAL PROPERTY\nThe rapid technological advancements that characterize the medical device industry have led us to rely on a combination of patents, trade secrets, copyrights, trademarks, and confidentiality procedures and processes to protect our CTLM® and other technologies that we have developed. Due to the rising maintenance costs and limited usefulness of patents, we have shifted our policy for protection of our intellectual property to focus principally on trade secrets and confidential procedures and processes; however, we intend to file for new patents in circumstances where we believe the additional protection is cost-effective. We believe that this approach will adequately protect our intellectual property and competitive position in China and our other main potential markets; however, there can be no assurance that we will be successful in our efforts to protect our intellectual property.\nPatent Licensing Agreement\nIDSI was formed in December 1993 for the sole purpose of developing and commercializing Mr. Richard Grables invention, a CT laser breast-imaging device (the Mammoscan™). In June 1998, IDSI signed an exclusive patent license agreement with Richard Grable, which covered his patent for some of the CTLM® technology. The term of the license was for the life of the patent (17 years) and any renewals of the patent, subject to termination under specific conditions. The patent license agreement expired in June 2015, when the underlying patent expired. No royalties were paid under the agreement because royalties were payable only following FDA marketing clearance, which did not occur before expiration and still has not occurred.\nIntellectual Property\nWe hold the following U.S. patents:\nPatent # For Case # Patent # Patent Date Exp. Date\nOptical Computed Tomography Scanner for Small Laboratory Animals. 7,155,274 12/26/2006 11/21/2023\nOptical Computed Tomography Scanner for Small Laboratory Animals. 7325-1 7,212,848 5/1/2007 11/21/2023\nLaser Imaging Apparatus With Variable Patient Positioning. 8,027,711 9/27/2011 1/7/2027\nWe intend to file for patents where we believe the cost of obtaining a patent is economically reasonable in relation to the expected protection obtained. In particular, we intend to seek patents covering the key technology underlying the CTLM® 3.0. There can be no assurances that any patent that we apply for will be issued, or that any patents issued will protect our technology. If the patents we license or obtain are infringed upon, or if we are required to defend any patent infringement cases brought against us that will require substantial capital, the expenditure of which we might not be able to afford, we could be materially adversely affected.\nExcept as to the CTLM® 3.0, we do not believe that we need additional patents in order to adequately protect our existing intellectual property in China, the United States and other key potential markets for the CTLM®; however, we will continually evaluate this position in light of changing circumstances.\nMANUFACTURING\nWe intend to have the CTLM® manufactured by medical device contract manufacturers; however, we may develop the capability for limited manufacturing at our headquarters facility if the circumstances so warrant. Strategically, IDSI has developed certain in-house capabilities to protect trade secrets. Our ability to utilize contract manufacturers to manufacture our products on a timely and cost-competitive basis may be compromised due to high medical standards and FDA manufacturing requirements applicable to our product. We may be hindered by the lack of options for additional or replacement parts for product specific components or materials. In the event that we are unable to obtain sufficient raw materials or components on financially reasonable terms or in a timely manner, we may be faced with material adverse effects on our business, financial condition and results of operations.\nIn June 2017, we entered into a licensing agreement with Xian IDI to manufacture and sell the CTLM® and related parts and accessories in China, Hong Kong, Macau, and Taiwan. While manufacturing capacity has been shifted to Xian IDI, we have identified Sparton Corp., Strongsville, Ohio (NYSE:SPA) as a potential contract manufacturer to manufacture the CTLM® and certain components in the U.S.\nEMPLOYEES\nPrior to the COVID-19 pandemic, we had 4 full-time employees, not including our CFO, who has been retained as a consultant. Two of our employees are employed in the areas of scientific, clinical and product research and development. Our ability to develop our products and provide our services is dependent upon our recruiting, hiring and retaining qualified technical personnel. None of our employees are represented by a labor union. On May 1, 2020, we furloughed all employees due to the COVID-19 pandemic. On September 15, 2020, the Company entered into a consulting agreement with the furloughed employees, converting them to independent contractors who will provide services on an as needed basis for the duration of the COVID-19 pandemic. Despite having work stoppages, we still consider our relations with our personnel to be good.\nDue to the specialized scientific nature of our business, we are highly dependent upon our ability to attract and retain qualified scientific, technical and managerial personnel. The loss of the services of existing personnel as well as the failure to recruit key scientific, technical and managerial personnel in a timely manner would be detrimental to our research and development programs and to our business. Our anticipated growth and expansion into areas and activities requiring additional expertise, such as marketing, will require the addition of new management personnel. Competition for qualified personnel is intense and there can be no assurance that we will be able to continue to attract and retain qualified personnel necessary for the development of our business. Our ability to attract and retain qualified personnel has been made more challenging with the COVID-19 pandemic. Item 1A. Risk Factors\nCERTAIN FACTORS THAT MAY AFFECT FUTURE RESULTS\nOur business and results of operations are subject to numerous risks, uncertainties and other factors, some of which are described below. The risks, uncertainties and other factors described below are not the only ones facing our company. Additional risks, uncertainties and other factors not presently known to us or that we currently deem immaterial may also impair our business operations.\nAny of the risks, uncertainties and other factors could have a materially adverse effect on our business, financial condition or results of operations and could cause the trading price of our common stock to decline substantially.\nThe ongoing COVID-19 global pandemic and measures taken in response thereto have materially adversely affected IDSIs research and development and commercialization activities and its financial condition, and the full impact of the pandemic will depend on future developments, which are highly uncertain and cannot be predicted.\nThe COVID-19 pandemic has materially and adversely impacted the worldwide economy and financial markets, which could lead to a prolonged economic recession. In response, governments in China, the U.S., and around the world, have taken unprecedented monetary and fiscal policy actions, and there is significant uncertainty as to the timing of stabilization and recovery. The Companys business and financial condition have been adversely affected by the COVID-19 pandemic and its economic, political, and social consequences since March 2020, and this negative impact has continued through the fiscal year 2022. The negative impact of the COVID-19 pandemic and the measures taken to contain it may continue and even worsen for many more months or even years. The following are some of the issues that the Company continues to face as a result of the ongoing crisis:\n● Prolonged recessionary concerns. The COVID-19 pandemic has resulted in a significant reduction of economic activity in the U.S. and China, as well as a significant increase in unemployment, which could lead to a prolonged economic recession;\n● Inability to generate revenue from sales. Sales and marketing efforts in China have been substantially delayed due to the COVID-19 pandemic.\n● Inability to raise capital. The continuation of IDSIs operations and commercialization of the CTLM® are highly dependent upon our ability to raise capital. The COVID-19 pandemic has made it more difficult to find investors who would be willing to invest during this time of uncertainty.\n● Inability to make progress on our key R&D project. The CTLM® 3.0 project has been delayed due to our furloughing employees in response to the COVID-19 pandemic and the resulting lack of funding.\nRisks related to our financial condition\nWe have a history of losses and we expect to incur additional losses.\nWe are a late-stage development stage company with a limited history of operations, and we do not expect sufficient revenues to support our operations for at least the next 12 months. Since our inception in December 1993, we have been engaged principally in the development of the CTLM®, which has not received marketing clearance for sale in the United States. While we have obtained FDA export approval for foreign sales, we have made only 26 foreign sales. Consequently, we have limited experience in manufacturing, marketing, and selling our products. Since we have decided not to renew our CE Mark for now and are not pursuing FDA marketing clearance at this time, we do not expect to receive revenues from sales of the CTLM® systems in the EU or in the US for the foreseeable future. We currently have no source of material operating revenues and have incurred substantial net operating losses since our inception. We do not expect to receive any sales revenues from China in the foreseeable future.\nTo date, we have not been profitable, and our accumulated deficit was $135,482,996 at June 30, 2022 after discounts and dividends on preferred stock. These losses have resulted principally from costs associated with research and development, clinical trials and from general and administrative costs associated with our operations. While we seek to attain profitability, we cannot be sure that we will ever achieve sufficient revenue to attain this objective.\nWe expect operating losses will continue for at least the next 12 months due to lack of substantial revenues and potential additional expenses associated with:\n● demonstration sites,\n● clinical collaboration sites,\n● FDA Pre-Market Approval (PMA) needed for marketing clearance,\n● anticipated commercialization of the CTLM®, and\n● other research and development programs.\nOur auditors have raised substantial doubts as to our ability to continue as a going concern as we have not been and may not be able to be profitable.\nWe have received an opinion from our auditors stating that the fact that we have suffered substantial losses and have yet to generate an internal cash flow raises substantial doubt about our ability to continue as a going concern. Our ability to achieve profitability will depend on our ability to obtain regulatory approvals for the CTLM®, develop the capacity to manufacture and market the CTLM® and achieve market acceptance of the CTLM®. There can be no assurance we will achieve profitability if and when we receive regulatory approvals for the development, commercial manufacturing and marketing of the CTLM®.\nWe will require additional financing to continue our operations.\nOur current cash position is not sufficient to meet our working capital needs for the next 12 months based on the pace of our planned activities. To continue operations, we will require additional funds to support our working capital requirements and any expansion or other activities. In the absence of such funding, we will need to significantly reduce our clinical trials and other planned activities or suspend operations.\nThrough June 30, 2022, we had a cumulative deficit of $135,482,996. Our currently estimated annual expenses are approximately $1.5 million. In the year following receipt of the PMA for our CTLM® from the FDA, we anticipate that we will need approximately $5 million of additional funding to fully complete all necessary stages in order to manufacture and market the CTLM® in the United States and foreign countries, including funds for:\n● research, engineering and development programs,\n● pre-clinical and clinical testing of the family of products,\n● regulatory processes,\n● inventory,\n● marketing programs, and\n● operating expenses (including general and administrative expenses).\nOur future capital requirements depend on many factors, including the following:\n● the progress of our research and development projects,\n● the progress of pre-clinical and clinical testing on other proposed products,\n● the time and cost involved in obtaining regulatory approvals,\n● the cost of filing, prosecuting, defending and enforcing any patent claims and other intellectual property rights; competing technological and market developments; changes and developments in our existing collaborative, licensing and other relationships and the terms of any new collaborative, licensing and other arrangements that we may establish, and\n● the development of commercialization activities and arrangements.\nIn addition, our fixed commitments are substantial and would increase if additional agreements were entered into and additional personnel were retained. We do not expect to generate a positive internal cash flow for at least 12 months due to an anticipated increase in marketing and manufacturing expenses associated with the international commercialization of the CTLM®, expenses associated with our FDA process, and the costs associated with advanced product development activities.\nAlthough we have from time-to-time reviewed opportunities provided to us by investment bankers or potential investors in regard to additional equity financings, there can be no assurance that additional financing will be available when needed, or if available, will be available on acceptable terms. Insufficient funds may prevent us from implementing our business strategy and will require us to further delay, scale back or eliminate our research, product development and marketing programs; and may require us to license to third parties rights to commercialize products or technologies that we would otherwise seek to develop ourselves, or to scale back or eliminate our other operations.\nRisks related to our technologies\nWe depend on third-party licensing agreements for patents and software without which our operations may be curtailed.\nWe own three United States patents related to optical tomography. We also have several non-exclusive licensing agreements for software providing image reconstruction, backup, encryption and DICOM from third-parties. If any of these agreements were terminated, our operations may be curtailed until alternative solutions were found.\nOur business would lose its primary competitive advantage if we are unable to protect our proprietary technology, or if substantially the same technology is developed by others.\nWe rely primarily on a combination of trade secrets, patents, copyright and trademark laws, and confidentiality procedures to protect our technology. Our ability to compete effectively in the medical imaging products industry will depend on our success in protecting our proprietary technology in the United States, China and other major countries. There can be no assurances that any patent that we apply for in the future will be issued, or that any patents issued will not be challenged, invalidated, or circumvented, that we will have the financial resources to enforce them, or that the rights granted will provide any competitive advantage. We could incur substantial costs in defending any patent infringement suits or in asserting any patent rights, including those granted by third parties, the expenditure of which we might not be able to afford. Although we have entered into confidentiality and invention agreements with our employees and consultants, there can be no assurance that these agreements will be honored or that we will be able to protect our rights to our non-patented trade secrets and know-how effectively. There can be no assurance that others will not independently develop substantially equivalent proprietary information and techniques or otherwise gain access to our trade secrets and know-how. In addition, we may be required to obtain licenses to patents or other proprietary rights from third parties. If we do not obtain required licenses, we could encounter delays in product development or find that the development, manufacture, or sale of products requiring these licenses could be foreclosed. Additionally, we may, from time to time, support and collaborate in research conducted by universities and governmental research organizations. There can be no assurance that we will have or be able to acquire exclusive rights to the inventions or technical information derived from such collaborations or that disputes will not arise with respect to rights in derivative or related research programs that we conducted in conjunction with these organizations.\nEven though we have received CFDA approval to sell the CTLM® systems in China, no sales in China have occurred yet. Until sales of the CTLM® begin in China, our ability to generate revenues from operations will be very limited and those revenues will be insufficient to sustain operations. Many factors impact our ability to obtain FDA marketing clearance, and we may not obtain US regulatory approval at all.\nThe only current approval for commercial sale of the CTLM® by a medical device regulatory authority is the CFDA approval, which allows us to market and sell the CTLM® systems in China. We believe that receiving FDA marketing clearance is crucial for marketing of the CTLM® systems in the US, the EU and other countries. After the Viable Acquisition, we restarted the PMA process for the CTLM® in the United States and had an informational meeting with the FDA on December 7, 2015. However, the PMA process was put on hold until more data is obtained from pilot studies being conducted in China. If and when we restart the PMA process, pre-clinical and clinical trials of our products, and the manufacturing and marketing of our technologies, will be subject to extensive, costly and rigorous regulation by governmental authorities in the United States. The process of obtaining required regulatory approvals from the FDA and other regulatory authorities often takes many years, is expensive, and can vary significantly based on the type, complexity and novelty of the product candidates. Delays in obtaining United States, or other foreign approvals for CTLM® systems could result in substantial additional costs to us, and, therefore, could adversely affect our ability to continue operations. Even if regulatory approval is ultimately granted in any country, the approval may place limitations on the intended use of the CTLM®, and may restrict the way in which we are permitted to market the CTLM®.\nIt may be necessary to enter into unfavorable agreements or defend lawsuits which would be costly if we infringe upon the intellectual property rights of others.\nThere has been substantial litigation regarding patent and other intellectual property rights in the medical device and related industries. We have been, and may be in the future, notified that we may be infringing on intellectual property rights possessed by other third parties. If any claims are asserted against our intellectual property rights, we may seek to enter into royalty or licensing arrangements. There is a risk in situations that no license will be available or that a license will not be available on reasonable terms. Alternatively, we may decide to litigate these claims or design around the patented technology. These actions could be costly and would divert the efforts and attention of our management and technical personnel. Consequently, any infringement claims by third parties or other claims for indemnification by customers resulting from infringement claims, whether or not proven to be true, may be costly to defend and may further limit the use of our technology.\nWe may not be able to keep up with the rapid technological change in the medical imaging industry which could make the CTLM® obsolete.\nMethods for the detection of cancer are subject to rapid technological innovation and there can be no assurance that technical changes will not render our proposed products obsolete. Although we believe that the CTLM® can be upgraded to maintain its state-of-the-art character, the development of new technologies or refinements of existing ones might make our existing system technologically or economically obsolete, or cause a reduction in the value of, or reduce the need for, our CTLM®. There can be no assurance that the development and commercial availability of new types of diagnostic medical equipment or technology will not have a material adverse effect on our business, financial condition, and results of operations. Although we are aware of no substantial technological changes pending in diffuse optical tomography, should a change occur, there can be no assurance that we will be able to acquire the new or improved technology which may be required to update the CTLM®.\nDue to legal and factual uncertainties regarding the scope and protection afforded by patents and other proprietary rights, we may not have meaningful protection from competition.\nOur long-term success will substantially depend upon our ability to protect our proprietary technologies from infringement, misappropriation, discovery, and duplication and upon our ability to avoid infringing the proprietary rights of others. As time moves forward, many patents on optical tomography will be expiring and be in the public domain. Our patent rights and the patent rights of biotechnology and medical device companies in general are highly uncertain and include complex legal and factual issues. These uncertainties also mean that any patents that we own or will obtain in the future could be subject to challenge, and, even if not challenged, they may not provide us with meaningful protection from competition. Due to our financial uncertainties, we may not possess the financial resources necessary to enforce our patents. Patents already issued to us or our pending applications may become subject to dispute, and any dispute could be resolved against us.\nAlso because of these legal and factual uncertainties, and because pending patent applications are held in secrecy for varying periods in the United States and other countries, even after reasonable investigation we may not know with certainty whether any products that we (or a licensee) may develop will infringe upon any patent or other intellectual property right of a third party. For example, we are aware of certain patents owned by third parties that such parties could attempt to use in the future in efforts to affect our freedom to practice some of the patents that we own or have applied for. Based upon the science and scope of these third-party patents, we believe that the patents that we own or have applied for do not infringe any such third-party patents; however, we cannot know for certain whether we could successfully defend our position, if challenged. We may incur substantial costs if we are required to defend our intellectual property in patent suits brought by third parties. These legal actions could seek damages and seek to enjoin testing, manufacturing and marketing of the accused product or process. In addition to potential liability for significant damages, we could be required to obtain a license to continue to manufacture or market the accused product or process.\nSeveral of our patents are due to expire over the next few years.\nWe have two US patents that are due to expire in November 2023. There is no guarantee that we will be able to extend the life of these patents or to obtain additional patents, licenses, or other instruments that can provide us with a comparable level of exclusivity to the intellectual property underlying the expiring patents. If we cannot extend the life of these patents or obtain suitable replacements, we may lose competitive advantage.\nRisks related to marketing of our products and potential products\nWe depend on market acceptance to sell our products, which have not been proven, and a lack of acceptance would depress our sales.\nThere can be no assurance that physicians or the medical community in general will accept and utilize the CTLM® or any other products that we develop. The extent and rate the CTLM® achieves market acceptance and penetration will depend on many variables, including, but not limited to, the establishment and demonstration in the medical community of the clinical safety, efficacy and cost-effectiveness of the CTLM® and the advantages of the CTLM® over existing technology and cancer detection methods.\nThere can be no assurance that the medical community and third-party payers will accept our unique technology. Similar risks will confront any other products we develop in the future. Failure of our products to gain market acceptance would hinder our sales efforts resulting in a loss of revenues and potential profit and, ultimately, could cause our business to fail.\nRisks associated with our industry\nLack of third-party reimbursement may have a negative impact on the sales of our products, which would negatively impact our revenues.\nIn the United States, suppliers of health care products and services are greatly affected by Medicare, Medicaid and other government insurance programs, such as the Affordable Care Act, as well as by private insurance reimbursement programs. Third-party payers (Medicare, Medicaid, private health insurance companies, and other organizations) may affect the pricing or relative attractiveness of our products by regulating the level of reimbursement provided by these payers to the physicians, clinics and imaging centers utilizing the CTLM® or any other products that we may develop, by refusing reimbursement. The level of reimbursement, if any, may impact the market acceptance and pricing of our products, including the CTLM®. Failure to obtain favorable rates of third-party reimbursement could discourage the purchase and use of the CTLM® as a diagnostic device.\nIn international markets, reimbursement by private third-party medical insurance providers, including governmental insurers and independent providers varies from country to country. In addition, such third-party medical insurance providers may require additional information or clinical data prior to providing reimbursement for a product or service. In some countries, our ability to achieve significant market penetration may depend upon the availability of third-party governmental reimbursement. Revenues and profitability of medical device companies may be affected by the continuing efforts of governmental and third-party payers to contain or reduce the cost of health care through various means.\nCompetition in the medical imaging industry may result in competing products, superior marketing and lower revenues and profits for us.\nThe market in which we intend to participate is highly competitive. Many of the companies in the cancer diagnostic and screening markets have substantially greater technological, financial, research and development, manufacturing, human and marketing resources and experience than we do. These companies may succeed in developing, manufacturing and marketing products that are more effective or less costly than our products. The competition for developing a commercial device utilizing computed tomography techniques and laser technology is difficult to ascertain given the proprietary nature of the technology.\nTo IDSIs knowledge, no other company has a functioning diffuse optical tomographic imaging device in commercial service designed for use as an adjunct to mammography. CTLM® systems were used in clinical settings in Italy, Germany, Poland, the Peoples Republic of China, Hungary, Malaysia, and United Arab Emirates. Although not verified, end users have reported that approximately 25,000 breast exams have been performed on CTLM® systems. Methods for the detection of cancer are subject to rapid technological innovation and there can be no assurance that future technical changes will not render our CTLM® obsolete. There can be no assurance that the development of new types of diagnostic medical equipment or technology will not have a material adverse effect on our business, financial condition, and results of operations.\nRisks related to our business and operations\nWe must comply with extensive governmental regulations and have no assurance of receiving critical regulatory approvals or clearances, the lack of which could cause us to cut back or cease operations.\nA delay or inability to obtain any necessary regulatory clearances or approvals, especially in the US, for our products would prevent or hinder us from selling the CTLM® system in China and other countries.\nIn the United States the CTLM® is regulated as a medical device and is subject to the FDAs requirements for marketing clearance.\nA PMA is the FDA process of scientific and regulatory review to evaluate the safety and effectiveness of Class III medical devices. Class III devices are those that support or sustain human life, are of substantial importance in preventing impairment of human health, or which present a potentially unreasonable risk of illness or injury. Due to the level of risk associated with Class III devices, the FDA has determined that general and special controls alone are insufficient to assure the safety and effectiveness of Class III devices. Therefore, these devices require a PMA application in order to obtain marketing clearance.\nThe FDA automatically classifies new technologies in Class III when limited safety information is available and no predicate device is available. It allows for multiple clinical studies to be pursued to gather the necessary data to obtain safety and clinical information to be used for future FDA submissions. At the time that we were developing the CTLM® system and considering marketing clearance, there was not enough data on laser-based technologies nor were there approved other new medical devices dedicated to breast imaging other than the traditional x-ray technology. As a result, the FDA recommended that we seek PMA approval.\nWe depend upon suppliers with whom we have no contracts, which suppliers could cause production disruption if they terminated or changed their relationships with us.\nWe believe that there are a number of suppliers for most of the components and subassemblies required for the CTLM®; however, at this time components for our laser system are provided by one supplier. Although these components are provided by a limited number of other suppliers, we believe our laser supplier and their products are the most reliable. We have no agreement with our laser supplier and purchase the laser components on an as-needed basis. For certain services and components, we currently rely on single suppliers. If we encounter delays or difficulties with our third-party suppliers in producing, packaging, or distributing components of the CTLM® device, market introduction and subsequent sales would be adversely affected.\nWe have limited experience in sales, marketing and distribution, which could negatively impact our ability to enter into collaborative arrangements or other third-party relationships which are important to the successful development and commercialization of our products and potential profitability.\nWe have limited internal marketing and sales resources and personnel. In China, we must rely exclusively on Xian IDIs ability to market and distribute the CTLM®. There can be no assurance that we will be able to establish sales and distribution capabilities or that we will be successful in gaining market acceptance for any products we may develop. There can be no assurance that we or Xian IDI will be able to recruit and retain skilled sales, marketing, service or support personnel, that agreements with distributors will be available on terms commercially reasonable to us, or at all, or that our marketing and sales efforts in the United States, China and/or elsewhere will be successful.\nThere can be no assurance that we or Xian IDI will be able to further develop our distribution network on acceptable terms, if at all, or that any of our proposed marketing schedules or plans can or will be met.\nWe depend on qualified personnel to run and develop our specialized business who we may be unable to retain or hire.\nDue to the specialized scientific nature of our business, we are highly dependent upon our ability to attract and retain qualified scientific, technical and managerial personnel. The loss of the services of existing personnel, as well as the failure to recruit key scientific, technical and managerial personnel in a timely manner would be detrimental to our research and development programs and could have an adverse impact upon our business affairs and finances. Our anticipated growth and expansion into areas and activities requiring additional expertise, such as marketing, will require the addition of new management personnel. Competition for qualified personnel is intense and there can be no assurance that we will be able to continue to attract and retain qualified personnel necessary for the development of our business.\nThere may exist conflicts of interest on the part of our officers and directors.\nOur directors and officers are or may become, in their individual capacities, officers, directors, controlling shareholders and/or partners of other entities engaged in a variety of businesses. Our officers and directors are engaged in business activities outside of the Company. There exist potential conflicts of interest including, among other things, time, and effort as well as business combinations with other such entities.\nWe have a limited manufacturing history and must rely on contract manufacturers.\nIn the United States we will have to contract for the manufacture of the CTLM® and its components in volumes that will be necessary for us to achieve significant commercial sales in the event we begin substantial foreign sales outside of China and/or obtain regulatory approval to market our products in the United States. We have limited experience in the manufacture of the CTLM®. Should we elect to manufacture our products at our United States facility, our manufacturing facility would be subject to the full range of the FDAs current quality system regulations. In China, we will rely exclusively on Xian IDIs ability to manufacture the CTLM® efficiently and with the required quality. There can be no assurance that the manufacturing efforts by our contractors in China and/or the United State, or by us if we choose to manufacture directly, will be successful or cost-effective.\nWe do not know if we will be able to produce our products in commercial quantities.\nWe have little experience manufacturing products for large scale clinical testing or commercial purposes. We have only manufactured CTLM® systems on the small scale needed for testing, clinical trials, and a very limited number of approved foreign sales. We may encounter manufacturing and control problems as we attempt to scale up. We may not be able to achieve such scale-up in a timely manner or at a commercially reasonable cost, if at all. Our failure to solve any of these problems could delay or prevent commercialization of our products and could seriously impact the amount of our revenues and our results of operations.\nWe depend on third parties who may not be in compliance with the FDAs quality system regulations which may delay the approval or decrease the sales of the CTLM®.\nWe have used and do use third parties to manufacture and deliver the components of the CTLM® and intend to continue to use third parties to manufacture and deliver these components and other products we may develop. There can be no assurance that the third-party manufacturers we depend on for the manufacturing of CTLM® components will be in compliance with the quality system regulations (QSR) at the time of the pre-approval inspection or will maintain compliance afterwards. This failure could significantly delay FDA marketing clearance approval for the CTLM® device.\nWe will rely on international sales and may be subject to risks associated with international commerce.\nIn June 2017, we entered into a Technology Licensing Agreement (the Xian Agreement) with Xian IDI Laser Image Co. Ltd. (Xian IDI), of Xian, Shaanxi Province, China. Xian IDI is an affiliate of Viable. Pursuant to the Xian Agreement, Xian IDI has the exclusive right to manufacture the CTLM® in China and sell the CTLM® in China, Hong Kong, Macau and Taiwan. Xian IDI must pay to IDSI on a quarterly basis a royalty of 25% of the gross revenues from the sale of the CTLM® and related parts and accessories. We recognize the potential market for the CTLM® in the European Union (EU), South America and the Middle East. However, we are initially focusing on those countries that can be serviced by Xian IDI. Marketing in the Middle East can be problematic as some of the countries in the Middle East are subject to economic sanctions and political instability. In this regard, IDSI is not marketing and will not market the CTLM® in countries that are subject to such sanctions, and IDSI has and will have no agreements, commercial arrangements, or other contacts with the government or entities controlled by the government in any such country for so long as the sanctions remain in place. Until we receive marketing clearance from the FDA to market the CTLM® in the United States, our revenues, if any, will be derived from sales by Xian IDI in China, Taiwan, Hong Kong and Macau and sales to international distributors. A significant portion of our revenues may be subject to the risks associated with international sales, including:\n● economic and political instability,\n● shipping delays,\n● fluctuation of foreign currency exchange rates,\n● restrictions on our ability to repatriate funds from foreign jurisdictions,\n● foreign regulatory requirements,\n● various tariffs and other trade restrictions, all of which could have a significant impact on our ability to deliver products on a timely and cost-effective basis, and\n● inability to collect outstanding receivables to the extent that irrevocable letters of credit are not used.\nSignificant increases in the level of customs duties, export quotas or other trade restrictions could have a material adverse effect on our business, financial condition and results of operations. The regulation of medical devices in foreign countries continues to develop, and there can be no assurance that new laws or regulations will not have a material adverse effect on us. In order to minimize the risk of doing business with distributors in countries which are having difficult financial times, our international distribution agreements may require payment via an irrevocable letter of credit drawn on a United States bank prior to shipment of the CTLM®.\nRisks related to potential liabilities\nWe face significant product liability risks, which may have a negative effect on our financial condition.\nThe use of medical devices, whether in clinical trials or commercially, can result in product liability claims whether or not the devices and treatments are actually at fault for causing an injury. Product liability claims can be expensive to defend and may result in large judgments or settlements against us, which could have a severe negative effect on our financial condition. Due to factors in the insurance market generally and our own experience, we may not be able to purchase sufficient product liability insurance at an affordable price. Even if a product liability claim is not successful, the adverse publicity and time and expense of defending such a claim may interfere with our business.\nImproper disclosure of clinical data, personal data, and other confidential data could result in liability and harm our reputation.\nAs we continue to perform clinical studies, expand our sales, and improve our capabilities with initiatives like IDSI Cloud, we store and process increasingly large amounts of confidential data, including medical information and personally identifiable information. At the same time, the continued occurrence of high-profile data breaches provides evidence of an external environment increasingly hostile to information security. This environment demands that we continuously improve our design and coordination of security controls across our business and geographies. Despite these efforts, it is possible our security controls over medical, personal, and other confidential data, our training of employees and vendors on data security, and other practices we follow may not prevent the improper disclosure of confidential information that we or our vendors store and manage. Improper disclosure of this information could harm our reputation, lead to legal exposure to customers, or subject us to liability under laws that protect personal data, resulting in increased costs or loss of revenue.\nRisks related to the market for our common stock\nOur common stock is considered a penny stock and may be difficult to sell.\nThe SEC adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share or an exercise price of less than $5.00 per share, subject to specific exemptions. We expect the market price of our common stock to remain substantially less than $5.00 per share in the foreseeable future, and our stock therefore may be designated as a penny stock according to SEC rules. This designation requires any broker or dealer selling these securities to disclose certain information concerning the transaction, obtain a written agreement from the purchaser and determine that the purchaser is reasonably suitable to purchase the securities. These rules may restrict the ability of brokers or dealers to sell our common stock and may affect the ability of investors to sell their shares. In addition, since we expect our common stock to be quoted on the OTC Markets, investors may find it difficult to obtain accurate quotations of our common stock.\nThe price of our common stock may be affected by a limited trading volume, may fluctuate significantly and may not reflect the actual value of our business.\nThere may arise a limited public market for our common stock on the OTC Markets; however, there can be no assurance that an active trading market will materialize. An absence of an active trading market could adversely affect our stockholders ability to sell our common stock in short time periods, if at all. Our common stock has experienced, and is likely to experience in the future, significant price and volume fluctuations that could adversely affect the market price of our common stock without regard to our operating performance. In addition, we believe that factors, such as our sale of securities in connection with capital raising activities, could cause the price of our common stock to fluctuate substantially. Thus, the price at which shares of our common stock may trade from time to time may not reflect the actual value of our business or the actual value of our common stock.\nFrom time to time, we may hire companies to assist us in pursuing investor relations strategies to generate increased volumes of investment in our common stock. Such activities may result, among other things, in causing the price of our common stock to increase on a short-term basis.\nRisks related to ownership of our common stock\nThere is currently no trading for our common stock\nOutstanding shares of our Common Stock cannot be offered, sold, pledged or otherwise transferred in the U.S. unless subsequently registered pursuant to, or exempt from registration under, the Securities Act and any other applicable federal or state securities laws or regulations. These restrictions will limit the ability of our stockholders to liquidate their investment.\nThe volatility of our stock price could adversely affect your investment in our common stock.\nThe price of our common stock fluctuated substantially after it began trading on the OTC Bulletin Board in September 1994. Furthermore, in September 2014 the registration of our common stock was revoked for failure to file annual and quarterly reports by the SEC under the Securities Exchange Act of 1934, and there has been no trading market for the common stock since then.\nEven if a trading market for our stock is re-established, the market price of our shares, like that of the common stock of many other medical device companies, is likely to be highly volatile. Factors that may have an impact on the price of our common stock include:\n● the timing and results of our clinical trials or those of our competitors,\n● governmental regulation,\n● healthcare legislation,\n● geopolitical events,\n● equity or debt financing, and\n● developments in patent or other proprietary rights pertaining to our competitors or us, including litigation, fluctuations in our operating results, and market conditions for medical device company stocks and life science stocks in general.\nWe have not paid and do not currently intend to pay dividends, which may limit the current return you may receive on your investment in our common stock.\nSince inception, we have not paid a dividend on our common stock and do not intend to pay dividends on our common stock in the foreseeable future. Item 1B. Unresolved Staff Comments\nNone Item 2. Properties\nWe currently maintain a virtual corporate office at 618 E. South St. Suite 500, Orlando, FL 32801 as we evaluate our future facility requirements. We envision the space requirements for future operations will be minimal as we continue to transition to working remotely and to outsourcing manufacturing, R&D, and regulatory compliance. Item 3. Legal Proceedings\nAt this time, there are no material pending legal proceedings to which the Company is a party or as to which any of its property is subject, and no such proceedings are known to the Company to be threatened or contemplated against it. Item 4. Mine Safety Disclosures\nNot applicable\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThere is no established public trading market for IDSIs common equity.\nHolders Common Equity\nIDSI has a single class of common equity: our common stock. The approximate number of holders of our common stock is 3,469 as of October 4, 2022.\nDividends in the Two Most Recent Fiscal Years\nIDSI did not pay any dividend on its common equity in the two most recent fiscal years, nor did the Company have the financial ability to pay any dividend.\nSecurities Authorized for Issuance under Equity Compensation Plans\nEffective June 30, 2020, IDSIs shareholders by majority written consent approved an increase in the shares covered by our 2016 Equity Incentive Plan from 15,000,000 to 18,500,000.\nThe table below summarizes the securities authorized for issuance under equity compensation plans as of October 4, 2022\nPlan Category Number of\nsecurities\nto be\nissued upon\nexercise of\noutstanding\noptions,\nwarrants,\nand rights Weighted-\naverage\nexercise\nprice of\noutstanding\noptions,\nwarrants\nand rights Number of\nsecurities\nremaining\navailable\nfor future\nissuance\nunder equity\ncompensation\nplans\n(excluding\nsecurities\nreflected in\ncolumn (a))\nEquity compensation plans approved by security holders 11,205,302 $ 0.30 7,294,698\nEquity compensation plans not approved by security holders N/A N/A N/A Item 6. [RESERVED] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nMANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with the condensed financial statements and other financial data included elsewhere in this report.\nCRITICAL ACCOUNTING POLICIES\nThe financial statements are prepared in accordance with Generally Accepted Accounting Principles in the United States of America (U.S. GAAP). The preparation of financial statements in conformity with U.S. GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Such estimates and assumptions also include the valuations of certain financial instruments, stock-based compensation, deferred tax assets, the outcome of litigation and tax matters, and other matters that affect the statements of financial condition and related disclosures. Actual results could differ materially from these estimates.\nWe believe the following critical accounting policies affect our more significant judgments and estimates used in the preparation of our financial statements.\nStock-Based Compensation\nWe rely on the guidance provided by ASC 718, (Share Based Payments). ASC 718 requires companies to expense the value of employee stock options and similar awards and applies to all outstanding and vested stock-based awards.\nIn computing the impact, the fair value of each option is estimated on the date of grant based on the Black-Scholes options-pricing model utilizing certain assumptions for a risk-free interest rate; volatility; and expected remaining lives of the awards. The assumptions used in calculating the fair value of share-based payment awards represent managements best estimates, but these estimates involve inherent uncertainties and the application of management judgment. As a result, if factors change and we use different assumptions, the Companys stock-based compensation expense could be materially different in the future. In addition, we are required to estimate the expected forfeiture rate and only recognize expense for those shares expected to vest. In estimating the Companys forfeiture rate, we analyzed its historical forfeiture rate, the remaining lives of unvested options, and the amount of vested options as a percentage of total options outstanding. If our actual forfeiture rate is materially different from its estimate, or if the Company reevaluates the forfeiture rate in the future, the stock-based compensation expense could be significantly different from what we have recorded in the current period. No stock options were granted during the year ended June 30, 2022. During the year ended June 30, 2021 the Board granted options to purchase 157,102 shares with an exercise price of $.51 per share to an employee and 1,500,000 shares with an exercise price of $.51 per share to a consultant. These options are being expensed pursuant to ASC 718.\nThe fair value concepts were not changed significantly in ASC 718; however, in adopting this Standard, companies were given the option to choose among alternative valuation models and amortization assumptions. We elected to continue to use the Black-Scholes option pricing model and expense the options as compensation over the requisite service period of the grant. We will reconsider use of the Black-Scholes model if additional information becomes available in the future that indicates another model would be more appropriate, or if grants issued in future periods have characteristics that cannot be reasonably estimated using this model.\nResults of Operations\nIn the continuing process of commercializing our operations and as part of our transition plan to exit from reporting as a development stage enterprise, we will use the current format of our managements discussion and analysis of financial condition and results of operation (MD&A) to better disclose and discuss four main categories of expenses (general and administrative, salaries and wages, research and development, sales and marketing, consulting, and bad debt).\nYears Ended June 30, 2022 and June 30, 2021\nSALES AND COST OF SALES\nRevenues during the years ended June 30, 2022 and 2021, were $0.\nOur cost of sales during both years ended June 30, 2021 and 2020 was $0.\nOur sales and marketing efforts been significantly hindered by the ongoing COVID-19 pandemic, and therefore we do not expect revenue in the foreseeable future.\nGENERAL AND ADMINISTRATIVE\nOur general and administrative expenses include travel/subsistence related to general and administrative activities, property and casualty insurance, professional fees associated with our corporate and securities attorneys and independent auditors, corporate governance expenses, stockholder expenses, utilities, maintenance, telephones, office supplies and sales and property taxes.\nGeneral and administrative expenses during the year ended June 30, 2022 were $92,032, representing a decrease of $51,819 or 36% from $143,851, during the year ended June 30, 2021.\nThe general and administrative decrease of $51,819 is due primarily to a decrease in rent and auto payments as lease agreements were terminated during fiscal 2021. There were also reductions in other expenses due to the reduction in business activity during fiscal 2022 because of the ongoing COVID-19 crisis.\nWe do not expect a material change in our general and administrative expenses until we realize a significant increase in revenue from the sale of our product.\nSALARIES AND WAGES\nOur salaries and wages expenses include compensation, related benefits, payroll taxes and other payroll fees for all employees.\nSalaries and wages expense during the years ended June 30, 2022 and 2021, was $0.\nThe lack of salaries and wages is due to the Companys decision to furlough all employees on May 1, 2020 in response to the COVID-19 crisis. Some of these individuals have worked as independent contractors on an as-needed basis.\nRESEARCH AND DEVELOPMENT\nWe incur research and development expenses to develop significant enhancements to our sole product, the CTLM®. These expenses consist primarily of clinical costs, costs of materials and components to make product enhancements, new product research costs, and costs associated with servicing clinical collaboration sites.\nResearch and development expenses during the year ended June 30, 2022 were $1,730, representing a decrease of $6,669 or 79% from $8,399, during the year ended June 30, 2021.\nThe decrease of $6,669 is due primarily to the Company not renewing the UL Certification during fiscal 2022.\nSALES AND MARKETING\nOur sales and marketing expenses consist primarily of expenses associated with advertising and promotion, representative office expense, trade shows, conferences, promotional and training costs related to marketing the CTLM®, commissions, travel/subsistence, patent maintenance fees, consulting, certification expenses, and product liability insurance.\nSales and marketing expenses during the year ended June 30, 2022 were $824, representing an increase of $2 or less than 1% from $822, during the year ended June 30, 2021.\nAll sales and marketing expenses during fiscal 2022 and 2021 were related to fees for maintaining our website. The minor difference relates to variations in website related fees between the two periods.\nCONSULTING EXPENSES\nOur consulting expenses consist of all consulting fees paid as well as share-based compensation issued to our consultants. Our share-based compensation expense consists of vested stock options expensed under the Black-Scholes options pricing model.\nConsulting expenses for the year ended June 30, 2022 were $470,971, representing a decrease of $13,868 or 3% from $484,839, during the year ended June 30, 2021.\nThe decrease in consulting expenses is due to the slight reduction in services from our consultants during fiscal 2022.\nBAD DEBT EXPENSE\nBad debt expenses represent accounts receivable and amounts due from related parties that have been reserved.\nBad debt expenses for the year ended June 30, 2022, were $0 representing an increase of $18,815 from $(18,815) during the year ended June 30, 2021.\nThe increase is due to the Company recovering $7,700 of accounts receivable and $11,115 of amounts due from related parties in fiscal 2021 that had been previously written off as bad debt.\nAGGREGATE OPERATING EXPENSES\nTotal operating expenses (general and administrative, salaries and wages, research and development, sales and marketing, depreciation and amortization, consulting, and bad debt) and cost of sales during the year ended June 30, 2022 were $565,557, representing a decrease of $54,161 or 9% from $619,718 when compared to the operating expenses and cost of sales during the year ended June 30, 2021. The overall decrease in expenses is due primarily to the ongoing COVID-19 pandemic which required us to further streamline operations and reduce costs.\nDepreciation and amortization expenses during the year ended June 30, 2022 were $0 representing a decrease of $622 or 100% from $622 during the year ended June 30, 2021. There was no depreciation expense during fiscal 2022 since there were no asset purchases and all existing assets have been fully depreciated as of the end of fiscal 2021.\nInterest expense during the fiscal year ended June 30, 2022 was $81,772, representing an increase of $888 or 1% from $80,884, during the year ended June 30, 2021. The average balance of interest bearing outstanding debt during fiscal 2022 and 2021 were approximately the same.\nBALANCE SHEET DATA\nOur combined cash and cash equivalents totaled $613 at June 30, 2022 and $2,473 at June 30, 2021. We do not expect to generate a positive internal cash flow for at least the next 12 months due to our efforts to generate sales in China and obtain FDA marketing clearance, the expected costs of commercializing our initial product, the CTLM®, and the time required for homologations from certain countries.\nOur inventory, which consists of raw materials, work in process (including completed units under testing), and finished goods totaled $100,087 at June 30, 2022 and 2021. Raw materials used for research and development or other purposes are expensed and not included in inventory. The net inventory is $0 for fiscal 2022 and 2021 because the Company has booked a reserve for the entire value of the inventory due to lack of demand for parts and lack of sales.\nOur property and equipment, net, totaled $0 at June 30, 2022 and June 30, 2021. All property and equipment had been fully depreciated as of the end of fiscal 2021, and no new property and equipment were purchased during fiscal 2022.\nOur current liabilities, which consist of accounts payable, accrued payroll taxes and penalties, short term debt, and convertible debt, totaled $1,825,542 at June 30, 2022 and $1,378,461 at June 30, 2021. Accounts payable and accrued expenses totaled $767,317 at June 30, 2022 and $472,571 at June 30, 2021. Accrued payroll taxes and penalties totaled $314,019 at June 30, 2022 and $314,019 at June 30, 2021. Related party promissory notes totaled $671,276 at June 30, 2022 and $581,276 at June 30, 2021. The current portion of long-term debt was $72,930 at June 30, 2022 and $10,595 at June 30, 2021. Current liabilities increased primarily due to accounts payable and accrued expenses increasing by $294,746, increase in related party promissory notes of $90,000, and the entire balance of PPP loan payable becoming a current liability due to loan default during fiscal 2022.\nOur long-term liabilities, which consist of long term loans payable totaled $0 at June 30, 2022 and $69,005 at June 30, 2021. The decrease in long-term liabilities was due to the entire balance of the PPP loan payable becoming a current liability due to loan default during fiscal 2022.\nOur temporary equity, which consists of Convertible Preferred Series L (including accrued dividends), totaled $433,939 at June 30, 2022 and $415,939 at June 30, 2021. The increase of $18,000 is due to accrued dividends for fiscal 2021 that are being included in the total redemption value.\nLIQUIDITY AND CAPITAL RESOURCES\nWe are currently a development stage company and our continued existence is dependent upon our ability to resolve our liquidity problems, principally by obtaining additional debt and/or equity financing. We have yet to generate a positive internal cash flow, and until significant sales of our product occur, we are mostly dependent upon debt and equity funding from Viable and its affiliates and/or outside investors. While Viable has stated its intention to provide, directly or through private investors it procures, the working capital that we need for the next 12 months, in the event that we are unable to obtain adequate debt or equity financing or are unable to obtain such financing on terms and conditions acceptable to us, we may have to cease or severely curtail our operations. This would materially impact our ability to continue as a going concern.\nWe have financed our operating and research and development activities through multiple private placements of common stock as well as short term loans from related parties. During fiscal 2022, we received $90,000 through short-term related party loans. During fiscal 2021 we received proceeds of $61,276 through short-term related party loans.\nNet cash used for operating and product development expenses, which include our purchase of additional materials to continue the manufacture of CTLM® Systems in anticipation of receiving orders from our distributors in certain countries, where permitted by law, was $85,190 during fiscal 2022, compared to net cash used by operating activities and product development of the CTLM® and related software development of $104,763 during fiscal 2021. At June 30, 2022, we had negative working capital of $1,812,940 compared to negative working capital of $1,358,037 at June 30, 2021. We do not expect to generate a positive internal cash flow for at least the next 12 months due to the time needed to ramp up our sales and marketing plan in China.\nIf and when we receive marketing clearance from the FDA, which cannot be assured, we believe that we will need funding in excess of $5 million above and beyond normal operating expenses over the following year to fully complete all necessary stages in order for us to market the CTLM® in the United States and foreign countries other than China. In China Xian IDI will be responsible for all expenses relating to the manufacture, marketing and sale of the CTLM®. The $5 million will be used to purchase inventory, sub-contracted components, tooling and manufacturing templates and pay non-recurring engineering costs associated with preparation for full capacity manufacturing and assembly and marketing, advertising and promotion, training, ongoing regulatory expenses, and other costs associated with product launch. We expect to use the proceeds of the sale of restricted common stock through private placements as our preferred choice to raise the additional funds required to continue operations. In the event that we are unable to raise funds through private placements, of common or preferred stock, or debt securities, or combinations thereof; we will be materially adversely affected and may have to cease operations. If additional funds are raised by issuing equity securities, dilution to existing stockholders will result, and future investors may be granted rights superior to those of existing stockholders.\nThrough the date of this report, IDSI has been taking drastic measures as a response to the global COVID-19 crisis to preserve working capital. These measures include the conversion of our full-time employees to contractors working on an as-needed basis, deferral of payments to vendors, and transition of our facilities to a smaller, more cost-efficient space. Item 7A. Quantitative and Qualitative disclosures about Market Risk\nAs a smaller reporting company, as defined in Rule 10(f)(1) of Regulation S-K under the Exchange Act, the Company is not required to provide the information required by this item. Item 8. Financial Statements and Supplementary Data\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nFINANCIAL STATEMENTS\nPage\nNumber\nReport of Independent Registered Public Accounting Firm PCAOB ID # 5036\nBalance Sheets at June 30, 2022 and June 30, 2021\nStatements of Operations for the years ended June 30, 2022 and 2021\nStatements of Changes in Stockholders Deficit for the years ended June 30, 2022 and 2021\nStatements of Cash Flows for the years ended June 30, 2022 and 2021\nNotes to Financial Statements to\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nImaging Diagnostic Systems, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Imaging Diagnostic Systems, Inc. (the Company) as of June 30, 2022 and 2021, and the related statements of operations, stockholders deficit, and cash flows for each of the years in the two-year period ended June 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note 2 to the financial statements, as of June 30, 2022 the Company had an accumulated deficit of $135,482,996 and a stockholders deficit of $2,246,879. For the year ended June 30, 2022, net loss totaled $647,329 and a net cash used in operating activities of $85,190. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plans regarding these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nWe did not identify any critical audit matters that need to be communicated.\n/s/ Assurance Dimensions\nWe have served as the Companys auditor since 2017.\nMargate, Florida\nOctober 4, 2022\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nBalance Sheets\nJune 30,\nJune 30,\nAssets\nCurrent assets:\nCash $ 613 $ 2,473\nConsultant advances -\n5,000\nPrepaid expenses and deposits 11,989 12,951\nTotal current assets 12,602 20,424\nProperty and equipment, net -\n-\nTotal assets $ 12,602 $ 20,424\nLiabilities and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 767,317 $ 472,571\nAccrued payroll taxes and penalties 314,019 314,019\nPromissory notes, related party 671,276 581,276\nCurrent portion of PPP loan payable 72,930 10,595\nTotal current liabilities 1,825,542 1,378,461\nLong-term liabilities\nPPP Loan Payable, less current portion -\n69,005\nTotal long-term liabilities -\n69,005\nTotal liabilities 1,825,542 1,447,466\nCommitment and Contingencies (Note 18)\nTemporary equity\nConvertible Preferred Series L 433,939 415,939\nTotal temporary equity 433,939 415,939\nStockholders Deficit:\nPreferred stock, no par , 2,000,000 authorized Convertible preferred stock, Series M, 600 designated 0 shares issued and outstanding at June 30, 2022 and June 30, 2021 -\n-\nCommon stock, no par value, 500,000,000 authorized , 123,156,941 and 123,156,941 shares issued and outstanding June 30, 2022 and June 30, 2021, respectively 133,236,117 132,974,686\nAccumulated Deficit (135,482,996 ) (134,817,667 )\nTotal stockholders deficit (2,246,879 ) (1,842,981 )\nTotal liabilities and stockholders deficit $ 12,602 $ 20,424\nSee accompanying notes to the financial statements\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nStatements of Operations\nYear Ended Year Ended\nJune 30,\nJune 30,\nTotal Revenue $ -\n$ -\nCost of Sales -\n-\nGross Profit -\n-\nOperating Expenses:\nGeneral and administrative 92,032 143,851\nResearch and development 1,730 8,399\nSales and marketing\nDepreciation and amortization -\nConsulting expenses (including share-based compensation) 470,971 484,839\nBad debt expense (recovery) - (18,815 )\nTotal Operating Expenses 565,557 619,718\nOperating Loss (565,557 ) (619,718 )\nOther Income (expense)\nInterest income -\nGain on termination of lease -\n10,863\nLoss on disposal of fixed assets -\n(1,180 )\nOther Income -\n1,000\nInterest expense (81,772 ) (80,884 )\nTotal Other Expense (81,772 ) (70,200 )\nNet Loss (647,329 ) (689,918 )\nPreferred Stock Dividends (18,000 ) (18,000 )\nNet Loss Available to Common Stockholders $ (665,329 ) $ (707,918 )\nNet Loss per common share:\nBasic and diluted\n$ (0.01 ) $ (0.01 )\nWeighted average number of common shares outstanding:\nBasic and diluted\n123,156,941 122,963,645\nSee accompanying notes to the financial statements\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nStatements of Changes in Stockholders Deficit\nFor the years ended June 30, 2022 and 2021\nCommon Stock\nTotal\nNumber of\nShares Amount Accumulated\nDeficit Stockholders\nDeficit\nBalance at June 30, 2021 123,156,941 $ 132,974,686 $ (134,817,667 ) $ (1,842,981 )\nCummulative Dividend on Series L CV Preferred - -\n(18,000 ) (18,000 )\nStock options expense - 261,431 -\n261,431\nNet loss - -\n(647,329 ) (647,329 )\nBalance at June 30, 2022 123,156,941 $ 133,236,117 $ (135,482,996 ) $ (2,246,879 )\nBalance at June 30, 2020 122,876,549 $ 132,570,255 $ (134,109,749 ) $ (1,539,494 )\nCummulative Dividend on Series L CV Preferred - -\n(18,000 ) (18,000 )\nCommon stock issued on conversion of accounts payable 280,392 143,000 -\n143,000\nStock options expense - 261,431 -\n261,431\nNet loss - -\n(689,918 ) (689,918 )\nBalance at June 30, 2021 123,156,941 $ 132,974,686 $ (134,817,667 ) $ (1,842,981 )\nSee accompanying notes to the financial statements\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nStatements of Cash Flows\nYear Ended Year Ended\nJune 30,\nJune 30,\nNet loss $ (647,329 ) $ (689,918 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization -\nLoss on abandonment of fixed assets -\n1,180\nGain on termination of lease -\n(10,863 )\nStock option expense 261,431 261,431\nLoss on write-off of consultant advance 5,000 -\nChanges in assets and liabilities:\n(Increase) decrease in royalty receivable -\n10,875\n(Increase) decrease in prepaid expenses (9,472 )\nIncrease (decrease) in accounts payable and accrued expenses 294,746 331,490\nChange in right of use asset/lease obligation, net -\n(108 )\nTotal adjustments 562,139 585,155\nNet cash used in operating activities (85,190 ) (104,763 )\nCash flows from financing activities:\nProceeds from promissory notes, related party 90,000 61,276\n(Repayment) of Paycheck Protection Program Loan (6,670 ) -\nNet cash provided by financing activities 83,330 61,276\nNet increase (decrease) in cash and cash equivalents (1,860 ) (43,487 )\nCash at the beginning of year 2,473 45,960\nCash at end of the period $ 613 $ 2,473\nSupplemental Disclosure of cash flow information:\nCash paid for interest $ 1,497 $ -\nCash paid for taxes $ -\n$ -\nNon-cash investing and financing activities:\nCommon Stock issued per settlement of accounts payable $ -\n$ 143,000\nSee accompanying notes to the financial statements\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(1) ORGANIZATION AND NATURE OF BUSINESS\nImaging Diagnostic Systems, Inc. (the Company or IDSI) is a medical technology company that has developed a new, non-invasive CT scanner called CTLM® that uses a laser beam in place of ionizing X-ray for breast imaging. This technology is called Diffuse Optical Tomography. The CTLM® will provide an adjunctive imaging modality to other methods of imaging the breast such as X-ray mammography, MRI and ultrasound.\nSince inception in December 1993 as a Florida corporation and subsequently its reverse merger with Alkan Corp., a New Jersey Corporation on April 14, 1994, we continued operations and changed our state of incorporation from New Jersey to Florida, effective July 1, 1995.\n(2) GOING CONCERN AND MANAGEMENTS PLANS\nThe accompanying financial statements are prepared assuming the Company will continue as a going concern. As of June 30, 2022, the Company had an accumulated deficit of $135,482,996 a stockholders deficit of $2,246,879, and a working capital deficiency of $1,812,940. For the year ended June 30, 2022, net loss totaled $647,329. The net cash used in operating activities for the year ended June 30, 2022 totaled $85,190. These matters raise substantial doubt about the Companys ability to continue as a going concern for a period of twelve months from the date these financial statements are issued. The ability of the Company to continue as a going concern is dependent upon generating sales and obtaining additional capital and financing. While the Company believes in the viability of its strategy to generate material sales volume and in its ability to raise additional funds, there can be no assurances to that effect. The Company received from the Chinese FDA (CFDA) marketing clearance for the CTLM® effective November 16, 2018 to November 15, 2023. However, there can be no assurance that we will obtain U.S. Food and Drug Administration (FDA) marketing or other new international marketing clearances, that the CTLM® will achieve market acceptance or that sufficient revenues will be generated from sales of the CTLM® in China or elsewhere to allow us to operate profitably. Since 2016, we have financed our operations through loans by Viable International Investments, LLC (Viable), our majority shareholder, and its affiliates and the private placement of common stock to Viable affiliates and independent Chinese investors. We do not have any formal financing arrangements with Viable and its affiliates; however, Viable has stated its intention to continue to provide financing of our operations consistent with past practice. While we believe that Viable and its affiliates will provide on commercially reasonable terms the funding we need until we achieve a positive cash flow from operations. There can be no assurance that we will receive such funding or that we will ever achieve profitability. If Viable fails to continue funding, the Company would be materially adversely affected and may have to cease operations due to a lack of funding. These matters affect the Companys liquidity profile, and managements plans in those regards are discussed in the paragraphs that follow.\nDuring fiscal year 2022, we anticipate that losses from operations will continue until we begin to generate revenues through the sales of CTLM® systems in China. These losses will be primarily due to an anticipated increase in marketing, manufacturing and operational expenses associated with the international commercialization of the CTLM®, expenses associated with FDA approval processes, and the costs associated with advanced product development activities.\nThe Companys next focus, after having obtained CFDA approval in China, is on obtaining marketing clearance of its CTLM® Breast Imaging System through the FDA. The premarket approval (PMA) process for U.S. marketing clearance is expected to take longer than the Chinese process, and we intend to resume this effort after achieving successful marketing and sales of CTLM® systems in China. Our sales and marketing efforts in China have been significantly hindered by the ongoing COVID-19 pandemic, and therefore we do not expect revenue from China in the foreseeable future. No sales in other countries are expected in foreseeable future, as we do not intend to pursue sales in other countries until after obtaining FDA marketing clearance, as to which there can be no assurance.\nIn analyzing the regulatory path forward, timeline, and costs associated with the level of effort required to upgrade the Companys Quality Management System (QMS), we have decided not to renew our CE mark (required for sales in the European Union) for this year and to consider reapplying in 2 to 3 years to avoid these regulatory fees. Similarly, we will maintain our Quality Management System to be compliant to ISO 13485:2016 but not certify to ISO 13485:2016 by Underwriters Laboratories (UL) which will allow us to avoid fees associated with certification, travel, and hosting audits. Maintaining our QMS to be ISO 13485:2016 compliant will allow us to quickly schedule an audit with UL and become ISO 13485 certified when necessary.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(2) GOING CONCERN AND MANAGEMENTS PLANS (Continued)\nOn October 23, 2019, the Company entered into a consulting agreement (the Agreement) effective as of November 1, 2019, with Dr. Huabei Jiang to serve as IDSIs Chief Scientific Consultant. Pursuant to the Agreement, Dr. Jiang is focused on improving the technical performance and image quality of IDSIs Computed Tomography Laser Mammography (CTLM®) breast imaging device. Dr. Jiang has completed the first phase of image quality improvement and is currently collecting image data for evaluation and further technical improvement.\nXian IDI has been working with Yiling Hospital Management Group based in Beijing, China (Yiling) to evaluate CTLM®s potential use and application. As of the date of this report, Xian IDI has loaned three CTLM® systems to Yiling and Yiling is at the stage of testing and data validation.\nIt is important that the effectiveness of the image quality improvements be established before Xian IDI can resume their sales and marketing efforts in China. Once the Company has substantial revenues and cash flow, it believes it will be able to raise the necessary funding to allow the Company to move forward with its various R&D and regulatory initiatives that have been put on hold due to the COVID-19 pandemic.\nThe Companys ability to continue as a going concern and its future success are dependent upon its ability to raise additional capital in the near term to: (1) satisfy its current obligations, (2) continue its research and development efforts, and (3) successfully develop, market, and sell its products. Due to the difficulty of raising additional capital during the current COVID-19 crisis, the Company has been taking aggressive measures to reduce its operating costs in order to preserve cash. The Companys ability to meet its cash flow requirements through fiscal 2023 and continue its development and commercialization efforts will be dependent on the length and severity of the COVID-19 crisis and the Companys ability to secure additional funding. There can be no assurance that IDSI will generate sufficient revenue to provide positive cash flows from operations or that sufficient capital will be available, when required, to permit the Company to execute its plan of operations. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\n(3) SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n(a) Basis of presentation and use of estimates\nThe financial statements are prepared in accordance with Generally Accepted Accounting Principles in the United States of America (U.S. GAAP). The preparation of financial statements in conformity with Generally Accepted Accounting Principles in the United States requires the Company to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Such estimates and assumptions also include the valuations of certain financial instruments, stock-based compensation, deferred tax assets, the outcome of litigation and tax matters, and other matters that affect the statements of financial condition and related disclosures. Actual results could differ materially from these estimates.\n(b) Revenue recognition\nAs of July 1, 2018, the Company adopted Revenue from Contracts with Customers (Topic 606) (ASC 606). The Company sells medical imaging products, parts, and services where permitted to independent distributors and in certain unrepresented territories directly to end-users. The Company recognizes revenue when obligations under the terms of a contract with the customer are satisfied. Product sales occur once control is transferred upon delivery to the customer. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring goods. The amount of consideration the Company receives and revenue the Company recognizes varies with changes in customer incentives the Company offers to its customers and their customers. Any discounts, sales incentives or similar arrangements with the customer are estimated at time of sale and deducted from revenue. Sales taxes and other similar taxes are excluded from revenue.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(3) SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nThe Company also receives royalties pursuant to a licensing relationship with Trifoil Imaging. Revenue is recognized in the reporting periods in which royalties are due to the Company. During the years ended June 30, 2022 and 2021, there was no income from royalties.\n(c) Allowance for doubtful accounts\nIn the event that management determines that a receivable becomes uncollectible, or events or circumstances change, which result in a temporary cessation of payments from the distributor, we will make our best estimate of probable or potential losses in our accounts receivable balance using the allowance method for each quarterly period. Management will review the receivables at the end of each fiscal year and the appropriate allowance will be made based on current available evidence and historical experience.\nOur allowance for doubtful accounts was $850 as of June 30, 2022 and June 30, 2021. These amounts consist of other receivables that have been fully reserved.\n(d) Cash and cash equivalents\nHoldings of highly liquid investments with original maturities of three months or less and investment in money market funds are considered to be cash equivalents by the Company. There were no cash equivalents at June 30, 2022 and June 30, 2021.\n(e) Concentration of Risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk consist primarily of cash and cash equivalents and accounts receivable.\nThe Company places its cash and cash equivalents with high-quality financial institutions. At times, balances in the Companys cash accounts may exceed the Federal Deposit Insurance Corporation limit of $250,000. At June 30, 2022 and June 30, 2021, the Company had $0 in excess of the federally insured limit.\nThe Company did not have any revenue for the year ended June 30, 2022 and June 30, 2021.\n(f) Inventory\nInventories, consisting principally of raw materials, work-in-process (including completed units under testing), finished goods and units placed on consignment, are carried at the lower of cost and net realizable value. Cost is determined using the first-in, first-out (FIFO) method. Raw materials consist of purchased parts, components and supplies. Work-in-process includes completed units undergoing final inspection and testing. The Company periodically reviews the value of items in inventory and records write-downs or write-offs based on its assessment of slow moving or obsolete inventory. The Company maintains a reserve for obsolete inventory and generally makes inventory value adjustments against the reserve.\n(g) Property and equipment\nProperty and equipment are stated at cost, less accumulated depreciation and amortization. Depreciation and amortization are computed using straight-line methods over the estimated useful lives of the related assets.\nExpenditures for renewals and betterments which increase the estimated useful life or capacity of the asset are capitalized; expenditures for repairs and maintenance are expensed when incurred.\n(h) Research and development\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(3) SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\nResearch and development expenses consist principally of expenditures for equipment and outside third-party consultants, raw materials which are used in testing and the development of the Companys CTLM® device or other products and product software. The non-payroll related expenses include testing at outside laboratories, parts associated with the design of initial components and tooling costs, and other costs which do not remain with the developed CTLM® device.\n(i) Net loss per share\nThe Company relies on the guidance provided by ASC 260, (Earnings per Share), which requires the reporting of both basic and diluted earnings per share. Basic net loss per share is determined by dividing loss available to common shareholders by the weighted average number of common shares outstanding for the period. Diluted loss per share reflects the potential dilution that could occur if options or other contracts to issue common stock were exercised or converted into common stock, as long as the effect of their inclusion is not anti-dilutive.\nThe Company had 9,610,012 and 13,922,657 options vested and as of June 30, 2022 and June 30, 2021, respectively and 1,595,290 and 2,830,290 options not yet vested as of June 30, 2022 and June 30, 2021, respectively.\n(j) Stock-based compensation\nIn July 2018, the FASB issued ASU 2018-07, Compensation-Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting, an accounting standard update to improve non-employee share-based payment accounting. The accounting standard update more closely aligns the accounting for employee and non-employee share-based payments. The accounting standards update is effective as of the beginning of 2019 with early adoption permitted. We have elected to adopt this standard.\nThe Company has elected to use the Black-Scholes-Merton, or BSM, option-pricing model to estimate the fair value of its options and similar awards, which incorporates various subjective assumptions including volatility, risk-free interest rate, expected life, and dividend yield to calculate the fair value of outstanding and vested stock option awards. Compensation expense recognized in the statements of operations is based on awards ultimately expected to vest and reflects estimated forfeitures. ASC 718 requires forfeitures to be estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates.\nThe assumptions used in calculating the fair value of share-based payment awards represent managements best estimates, but these estimates involve inherent uncertainties and the application of management judgment. As a result, if factors change and the Company uses different assumptions, the Companys stock-based compensation expense could be materially different in the future. In addition, the Company is required to estimate the expected forfeiture rate and only recognize expense for those shares expected to vest. In estimating the Companys forfeiture rate, the Company analyzed its historical forfeiture rate, the remaining lives of unvested options, and the amount of vested options as a percentage of total options outstanding. If the Companys actual forfeiture rate is materially different from its estimate, or if the Company reevaluates the forfeiture rate in the future, the stock-based compensation expense could be significantly different from what we have recorded in the current period. No stock options were granted during the year ended June 30, 2022. During the year ended June 30, 2021 the Board granted options to purchase 157,102 shares with an exercise price of $.51 per share to an employee and 1,500,000 shares with an exercise price of $.51 per share to a consultant. Stock options are being expensed pursuant to ASC 718.\nThe fair value concepts were not changed significantly in ASC 718; however, in adopting this Standard, companies were given the option to choose among alternative valuation models and amortization assumptions. We elected to continue to use the Black-Scholes option pricing model and expense the options as compensation over the requisite vesting period of the grant. We will reconsider use of the Black-Scholes model if additional information becomes available in the future that indicates another model would be more appropriate, or if grants issued in future periods have characteristics that cannot be reasonably estimated using this model. See Note (17) Stock Options.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(3) SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\n(k) Long-lived assets\nThe Company relies on the guidance provided by ASC 360 (Property, Plant & Equipment). ASC 360 requires companies to write down to estimated fair value long-lived assets that are impaired. The Company reviews its long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. In performing the review of recoverability, the Company estimates the future cash flows expected to result from the use of the asset and its eventual disposition. If the sum of the expected future cash flows is less than the carrying amount of the assets, an impairment loss is recognized.\nThe Company has determined that no impairment losses need to be recognized through the years ended June 30, 2022 and 2021.\n(l) Income taxes\nThe Company accounts for income taxes pursuant to the provisions of ASC 740-10, Accounting for Income Taxes, which requires, among other things, an asset and liability approach to calculating deferred income taxes. The asset and liability approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. A valuation allowance is provided to offset any net deferred tax assets for which management believes it is more likely than not that the net deferred asset will not be realized.\nThe Company follows the provisions of the ASC 740 -10 related to, Accounting for Uncertain Income Tax Positions. When tax returns are filed, it is highly certain that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. In accordance with the guidance of ASC 740-10, the benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any.\nTax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above should be reflected as a liability for uncertain tax benefits in the accompanying balance sheet along with any associated interest and penalties that would be payable to the taxing authorities upon examination. The Company believes its tax positions are all highly certain of being upheld upon examination. As such, the Company has not recorded a liability for uncertain tax positions.\nThe Company has adopted ASC 740-10-25 Definition of Settlement, which provides guidance on how an entity should determine whether a tax position is effectively settled for the purpose of recognizing previously unrecognized tax benefits and provides that a tax position can be effectively settled upon the completion of an examination by a taxing authority without being legally extinguished. For tax positions considered effectively settled, an entity would recognize the full amount of tax benefit, even if the tax position is not considered more likely than not to be sustained based solely on the basis of its technical merits and the statute of limitations remains open. As of the date these financials were available to be issued, tax years ended June 30, 2019 to 2021 are still potentially subject to audit by the taxing authorities.\n(m) Warranty reserve\nThe Company warrants all products and parts supplied for a period of 12 months from the date of installation or 15 months from the date the products was/were shipped from IDSI, whichever occurs first. Although the Company tests its product in accordance with its quality programs and processes, its warranty obligation is affected by product failure rates and service delivery costs incurred in correcting a product failure. Based on the Companys experience, the warranty reserve was estimated based on the replacement cost of the laser and certain electronic parts. Should actual product failure rates or service costs differ from the Companys estimates, which are based on limited historical data, where applicable, revisions to the estimated warranty liability would be required. The Company had no warranty reserve balance as of June 30, 2022 and 2021.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(3) SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued)\n(n) Impact of recently issued accounting pronouncements\nOther accounting standards that have been issued or proposed by the FASB or other standards-setting bodies that do not require adoption until a future date are not expected to have a material impact on our financial statements upon adoption.\n(o) Fair Value of Financial Instruments\nThe carrying values of cash and cash equivalents, receivables, accounts payable, short-term debt and accrued liabilities approximated their fair values due to the short maturity of these instruments. After a review of our accounts receivable, the Company has not recorded an allowance for doubtful accounts. The fair value of the Companys debt obligations is estimated based on the quoted market prices for the same or similar issues or on current rates offered to the Company for debt of the same remaining maturities. At June 30, 2022 and 2021, the aggregate fair value of the Companys debt obligations approximated its carrying value. The Company relies upon the guidance of ASC 820 (Fair Value Measurements and Disclosures). ASC 820 defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly, transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities required or permitted to be recorded at fair value, the Company considers the principal or most advantageous market in which it would transact and considers assumptions that market participants would use when pricing the asset or liability, such as inherent risk, transfer restrictions and risk of nonperformance. ASC 820 establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. ASC 820 establishes three levels of inputs that may be used to measure fair value:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities\nLevel 2 - Observable inputs other than Level 1 prices such as quoted prices for similar assets or liabilities; quoted prices in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which all significant inputs are observable or can be derived principally from or corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Unobservable inputs to the valuation methodology that are significant to the measurement of fair value of assets or liabilities.\nTo the extent that valuation is based on models or inputs that are less observable or unobservable in the market, the determination of fair value requires more judgment. In certain cases, the inputs used to measure fair value may fall into different levels of the fair value hierarchy. In such cases, for disclosure purposes, the level in the fair value hierarchy within which the fair value measurement is disclosed and is determined based on the lowest level input that is significant to the fair value measurement.\n(4) REVENUE\nThe Company recognizes revenue when obligations under the terms of a contract with the customer are satisfied. Product sales occur once control is transferred upon delivery to the customer. Revenue is measured as the amount of consideration the Company expects to receive in exchange for transferring goods. The amount of consideration the Company receives and revenue the Company recognizes varies with changes in customer incentives the Company offers to its customers and their customers. Sales taxes and other similar taxes are excluded from revenue.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(4) REVENUE (Continued)\nAs of July 1, 2018, the Company adopted Revenue from Contracts with Customers (Topic 606) (ASC 606). The new guidance sets forth a new five-step revenue recognition model which replaces the prior revenue recognition guidance in its entirety and is intended to eliminate numerous industry-specific pieces of revenue recognition guidance that have historically existed in U.S. GAAP. The underlying principle of the new standard is that a business or other organization will recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects what it expects to receive in exchange for the goods or services. The standard also requires more detailed disclosures and provides additional guidance for transactions that were not addressed completely in the prior accounting guidance. The Company adopted the standard using the modified retrospective method and the adoption did not have a material impact on its financial statements. The Company expects that the impact to net income of the new standard will be immaterial on an ongoing quarterly and annual basis. The comparative information has not been restated and continues to be reported under the accounting standards in effect for those periods.\nThe Company had no revenues during the year ended June 30, 2022 and 2021.\n(5) RELATED PARTY TRANSACTIONS\nRelated party revenues\nOn March 22, 2018, the Board of Directors approved the execution of two agreements with Xian of China, an affiliated Company of IDSI. The agreements are a Know How Transfer Contract and a CTLM® Know How Confidentiality Agreement. The contract, having a term of 20 years, stipulates that Xian will pay IDSI a know how transfer fee of 25% of revenue for CTLM® product sales in their territory. There were no such sales during the years ended June 30, 2022 and 2021.\nRelated party fees\nErhfort, LLC earned a consulting fee of $102,000 for each of the years ended June 30, 2022 and 2021. Erhfort, LLC regularly reviews the Companys operations and reports to IDSIs CEO, Chunming Zhang, who lives in China. Erhfort, LLC is a related party because it owns Company common stock directly and indirectly.\nDavid Fong served as the Companys CFO through August 10, 2022 (See Note 19) and earned consulting fees of $102,000 for each of years ended June 30, 2022 and 2021. These fees were assigned to his affiliated business, Fong & Associates, LLC.\nRelated party payables and accrued expenses\nAs of June 30, 2022 and June 30, 2021, the amount of interest on related party notes due to Erhfort, LLC, which is included in accounts payable, is $161,260 and $83,260, respectively.\nAs of June 30, 2022 and June 30, 2021, the amount of consulting fees due to Ehrfort, LLC, which is included in accounts payable, is $153,000 and $51,000, respectively.\nAs of June 30, 2022 and June 30, 2021, the amount of consulting fees due to Fong & Associates, LLC, which is included in accounts payable, is $286,000 and $184,000, respectively.\nAs of June 30, 2022 and June 30, 2021, the amount of reimbursable expenses due to Fong & Associates, LLC, which is included in accounts payable, is $839 and $0, respectively.\nAs of June 30, 2022 and June 30, 2021, the amount of interest on related party notes due to JM One Holdings, LLC, which is included in accrued expenses, is $8,860 and $5,860, respectively. JM One Holdings, LLC is an entity affiliated with the Companys former CFO, David Fong.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(5) RELATED PARTY TRANSACTIONS (Continued)\nRelated party debt\nAs of June 30, 2022 and June 30, 2021, the amount in promissory notes due to related parties are $671,276 and $581,276, respectively (See Note 12).\n(6) ROYALTY RECEIVABLE\nOn June 16, 2006, the Company entered into a Royalty Agreement with Bioscan Inc. whereby the Company established a licensing relationship with Bioscan which granted Bioscan an exclusive sublicensable, royalty-bearing license to make, use, offer for sale, import and otherwise develop and commercialize products in its territory. Bioscan Inc. was subsequently purchased by TriFoil Imaging. During the years ended June 30, 2022 and 2021, there was no income from royalties. As of June 30, 2022 and 2021, the Company had royalty receivable balances of $0.\n(7) INVENTORIES\nInventories consisted of the following:\nJune 30,\nJune 30,\nRaw materials consisting of purchased parts, components and supplies $ 92,587 $ 92,587\nFinished goods 7,500 7,500\nTotal Inventory $ 100,087 $ 100,087\nAllowance for Obsolete Inventory (100,087 ) (100,087 )\nNet Inventory $ -\n$ -\nDue to the age of the inventory, lack of demand for parts and lack of sales the Company reserved for all inventory during the year ended June 30, 2017. The Company is not carrying any inventory purchased after June 30, 2017 and has booked an allowance for the entire value of its inventory.\n(8) PREPAID EXPENSES AND DEPOSITS\nThe following is a summary of prepaid expenses:\nJune 30,\nJune 30,\nPrepaid Software $ 206 $ 206\nPrepaid Rent -\nRent Deposits 1,783 1,783\nConsulting Retainers 10,000 10,000\nTotal Prepaid expenses $ 11,989 $ 12,951\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(9) PROPERTY AND EQUIPMENT\nThe following is a summary of property and equipment, less accumulated depreciation:\nJune 30,\nJune 30,\nUseful life\nComputers and Equipment $ 12,612 $ 12,612 5 years\nThird Party Software 10,291 10,291 5 years\nClinical Equipment 15,000 15,000 5 years\nTotal Property & Equipment $ 37,903 $ 37,903\nLess: accumulated depreciation (37,903 ) (37,903 )\nTotal Property & Equipment - Net $ -\n$ -\nDepreciation expense for the years ended June 30, 2022 and 2021 was $0 and $622 respectively.\n(10) ACCOUNTS PAYABLE AND ACCRUED EXPENSES\nAs of June 30, 2022 and 2021, accounts payable and accrued expenses totaled $767,317 and $472,571, respectively, which consists of accounts payable of $758,171 and $465,799, and other accrued expenses of $9,146 and $6,772, respectively.\n(11) ACCRUED PAYROLL TAXES AND PENALTIES\nAs of June 30, 2022 and June 30, 2021, the Company owed the IRS $314,019 and $314,019, respectively. Accrued payroll taxes represent outstanding interest and penalties based on prior managements failure to pay payroll taxes commencing with the quarter ending March 31, 2010. As part of new managements restructuring plan, the Company received funds from an accredited investor to be able to make a payment to pay off the payroll tax portion of the amount owed to the IRS. The Company engaged tax counsel to manage the settlement and payment. On June 27, 2018, the IRS provided counsel with a payoff calculation table indicating that the balance of taxes due was $381,224. On June 29, 2018, Viable International Investments LLC provided a bank check in that amount to counsel and they sent the check to the IRS with a letter requesting penalty and interest abatement. The amount due at June 30, 2022 of $314,019 represents the interest and penalties. The Company has formally asked the IRS to abate all remaining interest and penalties of $314,019. The Company had a telephone conference on April 18, 2019 with the office of appeals and is waiting for further communications from the appeals officer. As of June 30, 2022, the Companys tax counsel is in the process of reviewing recent IRS correspondence to determine appeals status and will work towards final resolutions with the IRS on all outstanding liabilities. The Company has decided to wait until all resolutions are final before making any adjustments to the balance of $314,019 owed to the IRS.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(12) PROMISSORY NOTES - RELATED PARTY\nThe following table is a summary of the outstanding related party note balances as of June 30, 2022 and 2021.\nNoteholder Interest Rate Maturity Date June 30, 2022 June 30,\nRelated Party Notes:\nErhfort, LLC 15% 9/30/22 $ 100,000 $ 100,000\nErhfort, LLC 15% 9/30/22 100,000 100,000\nJM One Holdings, LLC 15% 9/30/22 20,000 20,000\nErhfort, LLC 15% 9/30/22 100,000 100,000\nErhfort, LLC 15% 9/30/22 100,000 100,000\nErhfort, LLC 15% 9/30/22 100,000 100,000\nErhfort, LLC 15% 9/30/22 10,000 10,000\nErhfort, LLC 15% 9/30/22 10,000 10,000\nViable International Investments, LLC 0% On Demand 7,865 7,865\nViable International Investments, LLC 0% On Demand 5,000 5,000\nViable International Investments, LLC 0% On Demand 5,000 5,000\nViable International Investments, LLC 0% On Demand 5,000 5,000\nViable International Investments, LLC 0% On Demand 5,000 5,000\nViable International Investments, LLC 0% On Demand 3,000 3,000\nViable International Investments, LLC 0% On Demand 15,000 -\nViable International Investments, LLC 0% On Demand 30,000 -\nViable International Investments, LLC 0% On Demand 10,000 -\nViable International Investments, LLC 0% On Demand 10,000 -\nViable International Investments, LLC 0% On Demand 10,000 -\nViable International Investments, LLC 0% On Demand 5,000 -\nViable International Investments, LLC 0% On Demand 10,000 -\nXian IDI 0% On Demand 10,411 10,411\nTotal Related Party Notes\n$ 671,276 $ 581,276\nErhfort, LLC owns Company common stock directly and indirectly. JM One Holdings, LLC is an entity affiliated with the Companys former CFO, David Fong. Viable International Investments, LLC is the Companys majority shareholder. Lixin Yang, who serves on the Board of Directors as of August 10, 2022 is a beneficial owner of Viable. For the reasons stated above, these debts are considered related party debt.\nDuring the year ended June 30, 2022, the Company received loan proceeds of $90,000 from Viable International Investments, LLC. The loans from Viable International Investments, LLC have zero interest.\nDuring the year ended June 30, 2021, the Company received loan proceeds of $20,000 from Erhfort, LLC, $30,865 from Viable International Investments, LLC, and $10,411 from Xian IDI. The loans from Erhfort, LLC have annual interest rates of 15% while the loans from Viable International Investments, LLC and Xian IDI have zero interest.\nThe maturity dates for all related party loans originally due on June 30, 2022, except those payable on demand, were extended to September 30, 2022 on June 30, 2022.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(13) LONG-TERM DEBT\nThe following table is a summary of the outstanding loan balances as of June 30, 2022 and 2021.\nNoteholder\nInterest Rate Maturity Date June 30,\nJune 30,\nTruist Bank 1% In Default $ 72,930 $ 79,600\nTotal Debt\n72,930 79,600\nCurrent Portion of Debt\n(72,930 ) (10,595 )\nTotal Long-term Debt\n$ -\n$ 69,005\nOn May 9, 2020, the Company entered into a loan with Truist Bank, a lender pursuant to the Paycheck Protection Program of the CARES Act as administered by the SBA in the amount of $79,600. The loan, in the form of a promissory note, matures on May 11, 2025. No additional collateral or guarantees were provided by the Company for the loan. The PPP loan provides for customary events of default. Under the CARES Act, loan forgiveness is available for the sum of documented payroll costs, rent payments, mortgage interest and covered utilities during the 24-week period beginning on the date of loan disbursement. The Company is required to repay the entire amount of outstanding principal, along with accrued interest, as the Company is not eligible for forgiveness. The Company began to make payments, beginning October 2021, including interest accruing at an annual interest rate of 1.0% beginning on the date of disbursement. On May 17, 2022, the Company received a default and demand letter from Truist Bank in regards to the PPP loan due to non-payment. As such the remaining balance of the PPP loan became due immediately. As of June 30, 2022 and June 30, 2021, the Company reported an accrued interest balance related to the PPP Loan of $186 and $912, respectively. The accrued interest is included in accounts payable and accrued expenses on our balance sheets.\n(14) INCOME TAXES\nThe Company has net operating loss carryforwards for federal income taxes of approximately $57,000,000 at June 30, 2022, the unused portions of which expire in years 2023 through 2037. The Company accounts for income taxes under Accounting Standards Codification 740, Income Taxes ASC 740. ASC 740 requires the recognition of deferred tax assets and liabilities for both the expected impact of differences between the financial losses and the tax basis of assets and liabilities for both the expected future tax benefit to be derived from tax losses and tax credit carry forwards. ASC 740 additionally requires the establishment of a valuation allowance to reflect the likelihood of realization of deferred tax assets. Internal Revenue Code Section 382 IRC 382 places a limitation on the amount of taxable income that can be offset by carry forwards after a change in control (generally greater than a 50% change in ownership). The issuance of the Companys Series M Preferred Stock on August 4, 2014 resulted in a change of control as defined under IRC 382. As of the change of control date, the taxpayers net operating loss carryforwards from prior years was $72,478,914 and the pro rata share of pre-change losses in the tax year ended June 30, 2015 was $109,691. This resulted in total pre-change losses of $72,588,605 subject to limitation under IRC Section 382. On the change date the values of the old loss corporation was $3,168,568 and the AFR was 3.05% resulting in an annual limitation amount of $96,641. The pro rata share of post-change net operating loss incurred in the tax year ended June 30, 2015 and the net operating loss incurred in tax years ended June 30, 2016 through 2022 are not subject to limitation. Post change losses not subject to limitation through June 30, 2021 are $9,800,000. Approximately $6,000,000 of losses expire between 2023 and 2037. Approximately $5,000,000 have no expiration, but are subject to certain annual restrictions.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(14) INCOME TAXES (Continued)\nThe table below summarizes the differences between the Companys effective tax rate and the statutory federal rate as follows for the periods ended June 30, 2022 and 2021:\nStatutory federal rate (21.00 )% (21.00 )%\nState tax rate, net of federal effect (3.522 )% (3.522 )%\nChange in valuation allowance 24.522 % 24.522 %\nEffective Tax Rate - % - %\nDeferred tax assets and liabilities are provided for significant income and expense items recognized in different years for tax and financial reporting purposes. The components of the net deferred tax assets for the years ended June 30, 2022 and 2021 were as follows:\nDeferred tax assets:\nInventory Reserve $ 25,367 $ 25,367\nFederal and state net operating loss carry forward 2,799,957 2,728,062\nTotal deferred tax asset 2,825,324 2,753,429\nLess Valuation Allowance (2,825,324 ) (2,753,429 )\nNet deferred Tax Asset $ -\n$ -\nThe Company has fully reserved the deferred tax asset due to managements determination that it is highly unlikely that the Company will generate taxable income in the future and realize the tax benefits of the net operating loss carryforwards and due to the limitation of income that can be offset by net operating loss carry forwards in future periods under IRC section 382 because of change in control that occurred on August 4, 2014. The valuation allowance increased $71,895 and $84,009 for the years June 30, 2022 and 2021, respectively. The increase in the valuation allowances for fiscal 2022 and 2021 is a result of the net operating losses incurred in those years exceeding the amount of net operating loss carryforward that expired in the same years.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(15) CONVERTIBLE PREFERRED STOCK\nThe following schedule reflects the number of shares of preferred stock that have been issued, converted and are outstanding as of June 30, 2022:\nSecurity Date\nIssued No. of\nShares Amount Date of\nConversion No. of\nShares\nConverted Amount\nConverted Balance\n6/30/2022\nSeries L Cv Pfd 2/10/2010 $ 350,000 1/6/2011 $ 150,000 $ 200,000\nDividends\n233,939\nTotal redemption value\n$ 433,939\nTotal Series M Cv Pfd Various $ 6,000,000 1/6/2011 $ 6,000,000 $ -0-\nDividends\nTotal redemption value\n$ -0-\nSeries L Convertible Preferred Stock\nOn March 31, 2010, a private investor converted a $350,000 short-term promissory note into 35 shares of Series L Convertible Preferred Stock. The original purchase price/stated value is $10,000 per share and dividends accrue at an annual rate of 9%. The preferred stock is convertible into 474 shares of common stock for each share of preferred stock. On January 6, 2011, the private investor converted 15 shares of Series L Convertible Preferred Stock representing a principal value of $150,000. After the conversion, the private investor held 20 shares representing a principal value of $200,000. The remaining principal value of $200,000 is presented on the balance sheet as temporary equity, as the holder has the option to redeem for cash at any time. At June 30, 2022 and 2021, the balance of cumulative dividends owed to the investor which is included in redemption value was $233,939 and $215,939, respectively. The total presented on the balance sheet as temporary equity is $433,939 as of June 30, 2022 and $415,939 as of June 30, 2021.\nSeries M Convertible Preferred Stock\nThe Company had previously sold 600 Series M Convertible Preferred Stock to Viable International Investments, LLC, a Florida limited liability company, (Viable). Each share of the Series M Preferred Stock was convertible into 147,283 shares of Common Stock. In the event of a liquidation, the holders of the Series M Preferred Stock would have been entitled to receive, prior to any distribution of assets to holders of Common Stock or other class of capital stock or other equity securities of the Corporation, $10,000 per share of Series M Preferred Stock held plus accrued but unpaid dividends. The holders of the Series M Preferred Stock would have had identical voting rights as any holder of Common Stock and would have voted together, not as separate classes. The original purchase price/stated value of each share of Series M Preferred Stock was $10,000 and Viable was be entitled to receive cumulative dividends at the fixed rate of 9% of the stated value per share per annum. As of June 30, 2022 and June 30, 2021, the balance of Series M Preferred stock was $0.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(16) COMMON STOCK\nThe Company has 500,000,000 of common shares no par value authorized and 2,000,000 of no par preferred shares authorized.\nThe Company did not issue any shares of common or preferred stock during the year ended June 30, 2022.\nDuring the year ended June 30, 2021, the Company issued 280,392 shares of common stock pursuant to debt conversion agreements for $143,000 of accounts payable with Erhfort, LLC. The amount of debt converted per share was $.51.\n(17) STOCK OPTIONS\nOn December 4, 2016, the Board of Directors adopted the Companys 2016 Equity Incentive Plan (the 2016 Plan) which was subsequently approved and adopted by majority written consent in lieu of an annual meeting. The purpose of the 2016 Plan is to encourage and enable the officers, employees, directors and other key persons (including consultants) of the Company, upon whose judgment, initiative and efforts the Company largely depends for the successful conduct of its business, to acquire a proprietary interest in the Company. It is anticipated that providing such persons with a direct stake in the Companys welfare will assure a closer identification of their interests with those of the Company and its stockholders, thereby stimulating their efforts on the Companys behalf and strengthening their desire to remain with the Company.\nOn August 1, 2020, the Board granted an option to purchase 157,102 shares with an exercise price of $.51 and a fair value of $.51 to an employee. These options will vest when CTLM® 3.0 is ready for Alpha testing and will be expensed at that time. On May 1, 2021, the Board granted an option to purchase 1,500,000 shares with an exercise price of $.51 and fair value of $.13 per share to a consultant. These options will vest over a three-year period. The options will be expensed as they vest.\nIn computing the impact of stock option grants, the fair value of each option is estimated on the date of grant based on the Black-Scholes options-pricing model utilizing certain assumptions for a risk-free interest rate; volatility of a comparable company; and expected remaining lives of the awards. The assumptions used in calculating the fair value of share-based payment awards represent managements best estimates, but these estimates involve inherent uncertainties and the application of management judgment. As a result, if factors change and the Company uses different assumptions, the Companys stock-based compensation expense could be materially different in the future.\nIn addition, the Company is required to estimate the expected forfeiture rate and only recognize expense for those shares expected to vest. The Company cannot assess its forfeiture rate at this time due to the lack of historical data.\nAs of\nJune 30,\nAs of\nJune 30,\nExpected volatility 20% to 44%\n23% to 44%\nExpected term 0.5 to 4.83 Years\n0.5 to 4.83 Years\nRisk-Free interest rate 0.05% to 2.49%\n0.05% to 3.09%\nForfeiture rate 0.00%\n0.00%\nExpected dividend rate 0.00%\n0.00%\nAt June 30, 2022, the Company has unvested and vested options under the 2016 Plan with exercise prices that range from a low of $.20 per share to a high of $.51 per share. The following table summarizes information about all of the stock options outstanding under the 2016 Plan at June 30, 2022 and 2021:\nEmployees/Consultants Options Wtd. Avg.\nExercise\nPrice Wtd. Avg.\nRemaining\nTerm Aggregate\nIntrinsic\nValue\nOutstanding at June 30, 2020 15,095,833 $ 0.24 2.43 Years $ -\nGranted 1,657,102 $ 0.51\nExpired -\n$ -\nExercised -\n$ -\nCancelled -\n$ -\nOutstanding at June 30, 2021 16,752,935 $ 0.25 1.76 Years $ -\nGranted -\n$ -\nExpired (5,547,645 ) $ 0.20\nExercised -\n$ -\nCancelled -\n$ -\nOutstanding at June 30, 2022 11,205,290 $ 0.30 1.39 Years $ -\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(17) STOCK OPTIONS (Continued)\nThe following table summarizes information about vested and unvested options under the 2016 Plan at June 30, 2022 and June 30, 2021. The Company recognized an expense of $261,431 for the options vested during the year ended June 30, 2022:\nEmployees/Consultants Unvested Vested and Exercisable Total\nOutstanding at June 30, 2020 4,123,184 10,972,649 15,095,833\nGranted 1,657,102 -\n1,657,102\nVested and Exercisable (2,950,000 ) 2,950,000 -\nCancelled -\n-\n-\nExpired -\n-\n-\nRounding Adjustment (4 ) -\nOutstanding at June 30, 2021 2,830,290 13,922,645 16,752,935\nGranted -\n-\n-\nVested and Exercisable (1,235,000 ) 1,235,000 -\nCancelled -\n-\n-\nExpired -\n(5,547,645 ) -\nAdjustment -\n-\n-\nOutstanding at June 30, 2022 1,595,290 9,610,000 11,205,290\nUnvested options will be expensed under the Black-Scholes options-pricing model when they vest. As of June 30, 2022, the remaining options to be expensed when vested are estimated to be $179,028.\nAt June 30, 2022, the Company has issued options pursuant to six different stock option plans, the most recent being the 2016 Plan. The previous five plans through and including the 2012 Non-Statutory Plan have a remaining total of options vested and exercisable to purchase 12 shares at an exercise price of $350 per share.\nThe tables below summarize information about these five plans:\nEmployees/Consultants Options Wtd. Avg.\nExercise\nPrice Wtd. Avg.\nRemaining\nTerm Aggregate\nIntrinsic\nValue\nOutstanding at June 30, 2020 $ 976 2.01 Years $ -\nGranted -\n$ -\nExercised -\n$ -\nCancelled (1 ) $ 13,500\nOutstanding at June 30, 2021 $ 350 1.11 Years $ -\nGranted -\n$ -\nExercised -\n$ -\nCancelled -\n$ -\nOutstanding at June 30, 2022 $ 350 .11 Years $ -\nThe table below summarizes information about all stock options outstanding as of June 30, 2022:\nOutstanding Options Vested Options\nRange of Exercise price Number Outstanding at June 30, 2022 Weighted Averaged Exercise Price Weighted Averaged Remaining Life Number Exercisable at June 30, 2022 Weighted Averaged Exercise Price Weighted Averaged Remaining Life\n$0.20 - $0.51 16,752,935 $ 0.27 1.39 13,922,645 $ 0.23 1.03\n$350.00 $ 350 .11 $ 350 .11\nOutstanding options 16,752,947 $ 0.27 1.76 13,922,657 $ 0.23 1.39\nThe Companys common stock, symbol IMDS, was quoted on OTCmarkets.com Pink until September 25, 2014 at which time IDSIs registration was revoked by the Securities and Exchange Commission (SEC) for failure to timely file its Quarterly and Annual Reports. The last quoted price was $0.1. Because the Company was de-registered and OTC markets did not provide a quote for IMDS, there is no public market for the Companys shares. Given the exercise prices adjusted for the reverse split, it is highly unlikely that any employee holding pre-2016 Plan options will exercise them. The Company has sufficient authorized shares available for all outstanding option; however, if exercised, the shares will be issued with a restrictive legend because the Company was not an SEC reporting company until October 2018. Further, given its recent return to SEC reporting status, the Company is unable to file an S-8 Registration Statement to register shares issued because of option exercise pursuant to various stock option agreements.\nIMAGING DIAGNOSTIC SYSTEMS, INC.\nNotes to Financial Statements\nJune 30, 2022 and 2021\n(18) COMMITMENTS AND CONTINGENCIES\nThe Company previously carried $3,000,000 in product liability insurance to cover both clinical sites and sales. As part of its cost savings initiatives, the Company cancelled the policy as it had not had any adverse experiences after conducting more than 25,000 patient scans worldwide. The Company is now self-insuring the risk of product liability.\nFrom May 2010 to June 2012, claims were made by the IRS for payment of the Companys accrued payroll taxes, interest and penalties, which as of June 30, 2012 was $1,489,640. The Company engaged tax counsel to handle this matter and intends to fully satisfy its payroll tax obligations. On August 4, 2014, Viable purchased 250 shares of convertible preferred stock for $2,500,000, which gave them a 78.9% voting and economic interest in the Companys capital stock representing a change in control of the Company. New managements tax counsel negotiated a new Installment Agreement which stipulated a lump sum payment of $250,000, which was paid on September 4, 2014 and monthly installment payments of $20,000 beginning in September 2014 due on the 18th of each month until the balance of payroll taxes, interest and penalties are paid in full (See Note 11).\nDuring fiscal 2018, as part of new managements restructuring plan, the Company received funds from an accredited investor to pay off the payroll tax portion of the amount owed to the IRS. The Company engaged tax counsel to manage the settlement and payment. On June 27, 2018, the IRS provided counsel with a payoff calculation table indicating that the balance of taxes due was $381,224. On June 29, 2018, Viable International Investments LLC provided a bank check in that amount to counsel and they sent the check to the IRS with a letter requesting abatement of penalties and interest totaling $314,019. As of June 30, 2022, the Companys tax counsel is in the process of reviewing recent IRS correspondence to determine appeals status and will work towards final resolutions with the IRS on all outstanding liabilities. The Company has decided to wait until all resolutions are final before making any adjustments to the balance of $314,019 owed to the IRS.\nOn October 23, 2019, the Company entered into a consulting agreement (the Agreement) effective as of November 1, 2019, with Dr. Huabei Jiang to serve as IDSIs Chief Scientific Consultant. Pursuant to the Agreement, Dr. Jiang is focused on improving the technical performance and image quality of IDSIs CTLM® breast imaging device. Per the Agreement, the goal of the initial project was to complete image quality improvement by November 1, 2020. A payment of $500,000 will be due upon satisfactory completion of the project. As of June 30, 2022, Dr. Jiang has completed the first phase of image quality improvement and is currently collecting image data for evaluation and further technical improvement. We have yet to establish the effectiveness of the improvements, as completion of the project has been delayed due to the COVID-19 crisis.\n(19) SUBSEQUENT EVENTS\nOn July 19, 2022, the Company received loan proceeds of $8,847 from Viable International Investments, LLC. Interest is 0% and the principal is payable on demand.\nOn August 10, 2022, the sole director and CEO of IDSI, Chunming Zhang, appointed Lixin Yang, Zhonghe Liu and Lun Li to the Companys Board of Directors. Immediately thereafter, Chunming Zhang resigned from her positions as director and CEO of IDSI, and the Companys CFO, David Fong also resigned. Immediately thereafter, the newly constituted Board appointed Lun Li to serve as IDSIs CEO and Rongbin Wang to serve as the CFO.\nOn August 19, 2022, the Company received loan proceeds of $12,768 from Viable International Investments, LLC. Interest is 0% and the principal is payable on demand.\nOn September 6, 2022, the Company received loan proceeds of $9,988 from Viable International Investments, LLC. Interest is 0% and the principal is payable on demand.\nOn September 15, 2022, the Company received loan proceeds of $7,968 from Viable International Investments, LLC. Interest is 0% and the principal is payable on demand.\nOn September 30, 2022, the Company received loan proceeds of $6,968 from Viable International Investments, LLC. Interest is 0% and the principal is payable on demand. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nThere have been no changes in or disagreements with accountants on accounting or financial disclosure matters. Item 9A. Controls and Procedures\nWe maintain disclosure controls and procedures that are designed to ensure that the information required to be disclosed in the reports that we file under the Securities Exchange Act of 1934 (the Exchange Act) is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosures.\nUnder the supervision and participation of our Chief Executive Officer and Chief Financial Officer, our management has evaluated the effectiveness of our disclosure controls and procedures as of June 30, 2022. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer, or the persons performing similar functions, concluded that our disclosure controls and procedures were effective as of June 30, 2022.\nThere have been no changes in our internal controls over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during our most recent fiscal year that has materially affected, or is reasonably likely to materially affect, our internal controls over financial reporting. Item 9B. Other Information\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable. Item 10. Directors, Executive Officers and Corporate Governance\nOn August 10, 2022, the sole director and chief executive officer (CEO) of IDSI, Chunming Zhang, appointed Lixin Yang, Zhonghe Liu and Lun Li to the Companys Board of Directors. Immediately thereafter, Chunming Zhang resigned from her positions as director and CEO of IDSI, and our chief financial officer (CFO) David Fong also resigned. Immediately thereafter, the newly constituted Board appointed Lun Li to serve as IDSIs CEO and Rongbin Wang to serve as the CFO.\nAs a result of these management changes, effective as of August 10, 2022, our officers and directors are as follows:\nName\nAge\nPosition(s)\nHeld Since\nLun Li\nDirector, CEO\nLixin Yang\nDirector\nZhonghe Liu\nDirector\nRongbin Wang\nCFO\nGuanliang (Josh) Wang\nVice President of Operations and Secretary\nCertain background information as to our officers and directors is as follows:\nLixin Yang is the president and majority shareholder of IDSIs parent company, Sanya Wanbo (Viable) Investments, Ltd. Co. (Viable China), based in Hainan, China. He has long been engaged in the research, development and operation of real estate projects and businesses relating to senior care and health care. Mr. Yang has many years of business management experience and extensive marketing experience. He has held various executive positions for over 30 years. He is the husband of our former director and CEO Chunming Zhang.\nZhonghe Liu is based in Shaanxi, China, and has extensive experience in marketing planning, market operation, software development and application.s for retail businesses for over 15 years. M r. Liu holds positions with various other companies. He has served as the chairman of Zhilian Technology Group Co., Ltd., since 2020, the general manager of Hong Kong Lexiaoyao Marketing Planning Co., Ltd., since 2019 and the president of Chongqing Quguangjie Technology Co., Ltd., since 2020.\nLun Li graduated from Xian Jiaotong University in Shaanxi, China, in 2012 with a masters degree in engineering and has many years of project management experience. Currently a PhD candidate, she started working in the medical industry in 2017, and has been serving as the assistant to the general manager and manager representative of Xian IDI Laser Imaging Co., Ltd. since 2017.\nRongbin Wang is an experienced accountant and professional financial officer based in Shaanxi, China. He holds a degree in accounting from Xian Jiaotong University. He has been engaged in high level financial work for 10 years. He has worked in a number of large Chinese companies. Most recently he has served as the chief financial officer for Xian Jiexun Automobile Sales Co., Ltd. since 2018. He also has substantial experience in mergers and acquisitions as well as financial management.\nGuanliang (Josh) Wang is currently Vice President of Operations and Secretary of the Company. He began his employment with the Company as a Technical Specialist in August 2014. In March 2017 he was appointed Vice President of Operations and Secretary of the corporation. From 2013 to 2014, Mr. Wang was employed as a part-time IT Specialist at Florida College of Integrative Medicine (FCIM) in Orlando, FL and also was employed as a part-time Real Estate Agent from 2010 to 2014 and self-employed as an IT Specialist from 2010 to 2013. From 2008 to 2009, he was a Process Engineer Supervisor at Cutrale Citrus Juices USA in the greater Orlando, FL area. Mr. Wang graduated in 2008 with a B.S.E.E. degree in Electrical Engineering from University of Central Florida.\nGuanliang (Josh) Wang is currently Vice President of Operations and Secretary of the Company. He began his employment with the Company as a Technical Specialist in August 2014. In March 2017 he was appointed Vice President of Operations and Secretary of the corporation. From 2013 to 2014, Mr. Wang was employed as a part-time IT Specialist at Florida College of Integrative Medicine (FCIM) in Orlando, FL and also was employed as a part-time Real Estate Agent from 2010 to 2014 and self-employed as an IT Specialist from 2010 to 2013. From 2008 to 2009, he was a Process Engineer Supervisor at Cutrale Citrus Juices USA in the greater Orlando, FL area. Mr. Wang graduated in 2008 with a B.S.E.E. degree in Electrical Engineering from University of Central Florida. Item 11. Executive Compensation\nTable 6: Smaller Reporting Company Summary Compensation Table, Last 2 Completed Fiscal Years\nName and Positions Year Salary/Fee\n($) Bonus\n($) Stocks\n($) Options\n($) Other\n($) Total\n($)\nChunming Zhang FYE 06/30/21 -0- -0- -0-\nCEO FYE 06/30/22 -0- -0- -0-\nDavid Fong FYE 06/30/21 102,000 -0- -0- 102,000\nCFO FYE 06/30/22 102,000 -0- -0- 102,000\nGuanliang Wang FYE 06/30/21 -0- -0- -0-\nSecretary FYE 06/30/22 -0- -0- -0-\nOutstanding Equity Awards at Fiscal Year-End\nOutstanding Equity Awards at Fiscal Year-End\n(all amounts adjusted for Reverse Stock Split)\nOption Awards\nName Number of\nsecurities\nunderlying\nunexercised\noptions (#)\nexercisable Number of\nsecurities\nunderlying\nunexercised\noptions (#)\nunexercisable Equity incentive plan\nawards: number of\nsecurities underlying\nunexercised unearned\noptions (#) Option\nexercise\nprice ($) Option\nexpiration\ndate\nChunming Zhang -- -- -- -- --\nDavid Fong -- -- -- -- --\nGuanliang Wang -- -- -- -- --\nLun\nLi1 750,000 750,000 -- $ 0.51 5/1/2026\nRongbin\nWang -- -- -- -- --\n1 These options were granted to Lun Li on May 1, 2019, while she served as a consultant to IDSI.\nSmaller Reporting Companies Director Compensation Table, Last Completed Fiscal Year\nIDSI had no non-officer directors in the last completed fiscal year and paid no compensation for service as a director.\nCompensation Committee Interlocks and Insider Participation\nIDSI has no compensation committee. IDSIs sole director participated in deliberations concerning executive compensation in the last completed fiscal year. The information required by this item is contained under Items 10 and 13 herein. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information as of October 4, 2022 regarding the beneficial ownership of our common stock by (i) each person who beneficially owns more than 5% of our common stock; (ii) each of our directors and executive officers; and (iii) all of our executive officers and directors as a group. To our knowledge, no other person beneficially owns more than 5% of our common stock. As of October 4, 2022, we had 123,156,941 shares outstanding.\nAll share amounts in this table are adjusted for our 1 for 1000 reverse stock split effective July 27, 2018 (the Reverse Stock Split).\nName and Address of Beneficial Owner Shares Owned Percent of Class\nViable International Investments, LLC1\n1221 East Robinson Street\nOrlando, Florida 32801 87,104,689 70.73 %\nHongbo Li\nUnit 21, No. 1 Building\n#288 Ning Xia Road\nQingdao, Shandong, China 7,424,553 6.03 %\nOfficers and Directors\nLun Li 750,0002 .61 %\nLixin Yang3 87,104,6893 70.73 %\nZhongzhe Liu -- --\nRongbin Wang -- --\nGuanliang Wang -- --\nAll Directors and Executive Officers as a group (5 persons) 87,854,6894 70.90 %\n1 Viable International Investments LLC(Viable) is beneficially owned 72% by Lixin Yang, IDSI Director and Chairman of Viable China, and 28% by Hoi Po Yeung (Paul Yeung), brother of Lixin Yang, through Invescope, LLC (Invescope), a Florida limited liability company owned by other members of his family. Chunming Zhang, our former CEO, is the wife of Lixin Yang. She disclaims beneficial ownership of the shares held by Viable.\n2 These shares are covered by currently exercisable stock options.\n3 All of the Viable shares are beneficially owned by Mr. Yang, a 72% owner of Viable, due to his voting control of Viable.\n4 Includes 750,000 shares covered by currently exercisable stock options. Item 13. Certain Relationships and Related Transactions, and Director Independence\nRelated Party Transactions\nViable International Investments, LLC, a Florida limited liability company (Viable), owns 70.73% of IDSIs outstanding common stock. Viable is owned 72% by Viable China, which is beneficially owned by Lixin Wang, and 28% by Invescope, LLC, a Florida limited liability company beneficially owned by Paul Yang, the brother of Lixin Yang. Viable and its affiliates have been our main source of capital since the Viable Acquisition.\nIn June 2017, IDSI entered into a licensing agreement with Xian IDI which grants to Xian IDI the exclusive right to manufacture the CTLM® in China and market and sell the CTLM® in China, Taiwan, Hong Kong and Macau. Under this agreement, Xian IDI must pay to IDSI a royalty of 25% of its gross sales of CTLM® systems. Also, IDSI sells inventory parts to Xian IDI or acquires parts from third parties on behalf of Xian IDI. During the year ended June 30, 2021 there were no sales made to Xian IDI pursuant to this agreement. A majority of the shares of Xian IDI are beneficially owned by Lixin Yang.\nSince the Viable Acquisition in August 2014, Paul Yeung has provided consulting services to the Company through Erhfort, LLC, a Florida limited liability company (Erhfort) in exchange for a fee of $8,500 per month for fiscal 2022 and 2021. In his consulting capacity, Mr. Yeung, who lives in Orlando, Florida, regularly reviews the Companys operations and reports to IDSIs CEO Chunming Zhang, who lives in China. From August 2014 through August 2015, Erhforts fees were paid by Viable. Since September 2015, Erhforts fees have been paid by IDSI.\nWe expect that our board will adopt a written policy for the review of related party transactions. For purposes of the policy, a related party transaction will include transactions in which (1) the amount involved in any consecutive 12-month period is more than the lesser of (i) $120,000 or (ii) one percent of IDSIs average total assets at year-end in the prior two completed fiscal years, (2) IDSI is a participant, and (3) any related party has a direct or indirect material interest. The policy is expected to define a related party to include directors, nominees for director, executive officers, beneficial owners of more than 5% of IDSIs outstanding common stock and their respective immediate family members. Pursuant to the policy, all related party transactions must be approved by IDSIs board of directors or, in the event of an inadvertent failure to bring the transaction to the board, ratified by the board. In the event that a member of the board has an interest in a related party transaction, the transaction must be approved or ratified by the disinterested members of the board. In deciding whether to approve or ratify a related party transaction, the board will consider the following factors:\n● whether the terms of the transaction are (1) fair to IDSI and (2) at least as favorable to IDSI as would apply if the transaction did not involve a related party;\n● whether there are demonstrable business reasons for IDSI to enter into the transaction;\n● whether the transaction would impair the independence of an outside director under IDSIs director independence standards; and\n● whether the transaction would present an improper conflict of interest for any director or executive officer, taking into account the size of the transaction, the overall financial position of the related party, the direct or indirect nature of the related partys interest in the transaction and the ongoing nature of any proposed relationship, and any other factors the committee deems relevant.\nIndependent Directors\nIDSI currently has no independent director. Item 14. Principal Accounting Fees and Services\nFor the Fiscal Years ended June 30, 2022 and 2021, we paid audit fees totaling $47,000 and $45,500 respectively.\nJune 30,\nFees for Annual Audits $ 32,000 $ 30,500\nFees for Quarterly Reviews 15,750 15,000\nTotals $ 47,750 $ 45,500 Item 15. Exhibits, Financial Statement Schedules\n4.1\nDescription of Securities.\n31.1\nCertification by Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification by Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification by Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification by Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nDated: October 4, 2022\nImaging Diagnostic Systems, Inc.\nBy: /s/ Rongbin Wang\nRongbin Wang\nChief Financial Officer\n(PRINCIPAL ACCOUNTING OFFICER)\n/s/ Lun Li\nLun Li\nChief Executive Officer\nNONE\n0.01 0.01\nP3Y false FY P6M P6M 0.0005 0.0005\n2021-07-01 2022-06-30\n2022-10-04\n2021-12-31\n2022-06-30\n2021-06-30\n2020-07-01 2021-06-30\nus-gaap:CommonStockMember\n2021-06-30\nimds:SharesToBeIssuedMember\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nimds:SharesToBeIssuedMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nimds:SharesToBeIssuedMember\n2022-06-30\nus-gaap:CommonStockMember\n2020-06-30\nimds:SharesToBeIssuedMember\n2020-06-30\n2020-06-30\nus-gaap:CommonStockMember\n2020-07-01 2021-06-30\nimds:SharesToBeIssuedMember\n2020-07-01 2021-06-30\n2018-03-01 2018-03-22\nimds:ErhfortLLCMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCMember\n2020-07-01 2021-06-30\nimds:DavidFongMember\n2021-07-01 2022-06-30\nimds:DavidFongMember\n2020-07-01 2021-06-30\nimds:ErhfortLLCOneMember\n2022-06-30\nimds:ErhfortLLCOneMember\n2021-06-30\nimds:EhrfortLLCMember\n2022-06-30\nimds:EhrfortLLCMember\n2021-06-30\nimds:FongAssociatesLLCMember\n2022-06-30\nimds:FongAssociatesLLCMember\n2021-06-30\nimds:JMOneHoldingsLLCMember\n2022-06-30\nimds:JMOneHoldingsLLCMember\n2021-06-30\nus-gaap:ComputerEquipmentMember\n2022-06-30\nus-gaap:ComputerEquipmentMember\n2021-06-30\nus-gaap:ComputerEquipmentMember\n2021-07-01 2022-06-30\nimds:ThirdPartySoftwareMember\n2022-06-30\nimds:ThirdPartySoftwareMember\n2021-06-30\nimds:ThirdPartySoftwareMember\n2021-07-01 2022-06-30\nimds:ClinicalEquipmentMember\n2022-06-30\nimds:ClinicalEquipmentMember\n2021-06-30\nimds:ClinicalEquipmentMember\n2021-07-01 2022-06-30\n2018-06-27\nimds:ErhfortLLCsMember\n2020-07-01 2021-06-30\nimds:ViableInternationalInvestmentsMember\n2020-07-01 2021-06-30\nimds:XianIDIMember\n2020-07-01 2021-06-30\nimds:ErhfortLLCsMember\n2021-06-30\nimds:XianIDIMember\n2021-06-30\nimds:ViableInternationalInvestmentsMember\n2021-06-30\nimds:ErhfortLLCsMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCsMember\n2022-06-30\nimds:ErhfortLLCsMember\n2021-06-30\nimds:ErhfortLLCOneMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCOneMember\n2022-06-30\nimds:ErhfortLLCOneMember\n2021-06-30\nimds:JMOneHoldingsLLCMember\n2021-07-01 2022-06-30\nimds:JMOneHoldingsLLCMember\n2022-06-30\nimds:JMOneHoldingsLLCMember\n2021-06-30\nimds:ErhfortLLCTwoMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCTwoMember\n2022-06-30\nimds:ErhfortLLCTwoMember\n2021-06-30\nimds:ErhfortLLCThreeMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCThreeMember\n2022-06-30\nimds:ErhfortLLCThreeMember\n2021-06-30\nimds:ErhfortLLCFourMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCFourMember\n2022-06-30\nimds:ErhfortLLCFourMember\n2021-06-30\nimds:ErhfortLLCFiveMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCFiveMember\n2022-06-30\nimds:ErhfortLLCFiveMember\n2021-06-30\nimds:ErhfortLLCSixMember\n2021-07-01 2022-06-30\nimds:ErhfortLLCSixMember\n2022-06-30\nimds:ErhfortLLCSixMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCOneMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCOneMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCOneMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCTwoMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCTwoMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCTwoMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCThreeMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCThreeMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCThreeMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCFourMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCFourMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCFourMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCFiveMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCFiveMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCFiveMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCSixMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCSixMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCSixMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCSevenMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCSevenMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCSevenMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCEightMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCEightMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCEightMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCNineMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCNineMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCNineMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCTenMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCTenMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCTenMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCLevenMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCLevenMember\n2022-06-30\nimds:ViableInternationalInvestmentsLLCLevenMember\n2021-06-30\nimds:ViableInternationalInvestmentsLLCTwelveMember\n2021-07-01 2022-06-30\nimds:ViableInternationalInvestmentsLLCTwelveMember\n2022-06-30\nimds:XianIDIMember\n2021-07-01 2022-06-30\nimds:XianIDIMember\n2022-06-30\nimds:XianIDIMember\n2021-06-30\n2020-05-01 2020-05-09\n2021-10-01 2021-10-31\nimds:PPPLoanMember\n2021-07-01 2022-06-30\nimds:PPPLoanMember\n2020-07-01 2021-06-30\nimds:TruistBankMember\n2022-06-30\nimds:TruistBankMember\n2021-07-01 2022-06-30\nimds:TruistBankMember\n2021-06-30\nimds:SeriesMPreferredStockMember\n2014-08-01 2014-08-04\nimds:SeriesLPreferredStockMember\n2010-03-31\nimds:SeriesLPreferredStockMember\n2010-03-01 2010-03-31\nimds:SeriesLPreferredStockMember\n2011-01-01 2011-01-06\nimds:SeriesMPreferredStockMember\n2022-06-30\nimds:SeriesMPreferredStockMember\n2021-07-01 2022-06-30\nimds:SeriesMPreferredStockMember\n2021-06-30\nimds:IssuanceDate6Member imds:SeriesLPreferredStockMember\n2021-07-01 2022-06-30\nimds:IssuanceDate6Member imds:SeriesLPreferredStockMember\n2022-06-30\nimds:SeriesLPreferredStockMember\n2021-07-01 2022-06-30\n2020-07-20 2020-08-01\n2020-08-01\n2021-04-28 2021-05-01\n2021-05-01\nsrt:MinimumMember\n2021-07-01 2022-06-30\nsrt:MaximumMember\n2021-07-01 2022-06-30\nsrt:MinimumMember\n2020-07-01 2021-06-30\nsrt:MaximumMember\n2020-07-01 2021-06-30\nimds:VestedAndUnvestedOptionsMember\n2020-06-30\nimds:VestedAndUnvestedOptionsMember\n2020-07-01 2021-06-30\nimds:VestedAndUnvestedOptionsMember\n2021-06-30\nimds:VestedAndUnvestedOptionsMember\n2021-07-01 2022-06-30\nimds:VestedAndUnvestedOptionsMember\n2022-06-30\nimds:PreviousFivePlanIncludingNonStatutoryPlanMember\n2020-06-30\nimds:PreviousFivePlanIncludingNonStatutoryPlanMember\n2020-07-01 2021-06-30\nimds:PreviousFivePlanIncludingNonStatutoryPlanMember\n2021-06-30\nimds:PreviousFivePlanIncludingNonStatutoryPlanMember\n2021-07-01 2022-06-30\nimds:PreviousFivePlanIncludingNonStatutoryPlanMember\n2022-06-30\nimds:UnvestedMember\n2020-06-30\nimds:VestedAndExercisableMember\n2020-06-30\nimds:UnvestedMember\n2020-07-01 2021-06-30\nimds:VestedAndExercisableMember\n2020-07-01 2021-06-30\nimds:UnvestedMember\n2021-06-30\nimds:VestedAndExercisableMember\n2021-06-30\nimds:UnvestedMember\n2021-07-01 2022-06-30\nimds:VestedAndExercisableMember\n2021-07-01 2022-06-30\nimds:UnvestedMember\n2022-06-30\nimds:VestedAndExercisableMember\n2022-06-30\nimds:OutstandingOptionsMember imds:ExercisePriceRangeMember\n2022-06-30\nimds:OutstandingOptionsMember imds:ExercisePriceRangeMember\n2021-07-01 2022-06-30\nimds:VestedOptionsMember imds:ExercisePriceRangeMember\n2022-06-30\nimds:VestedOptionsMember imds:ExercisePriceRangeMember\n2021-07-01 2022-06-30\nimds:OutstandingOptionsMember imds:ExercisePriceRangeOneMember\n2022-06-30\nimds:OutstandingOptionsMember imds:ExercisePriceRangeOneMember\n2021-07-01 2022-06-30\nimds:VestedOptionsMember imds:ExercisePriceRangeOneMember\n2022-06-30\nimds:VestedOptionsMember imds:ExercisePriceRangeOneMember\n2021-07-01 2022-06-30\nimds:OutstandingOptionsMember\n2022-06-30\nimds:OutstandingOptionsMember\n2021-07-01 2022-06-30\nimds:VestedOptionsMember\n2022-06-30\nimds:VestedOptionsMember\n2021-07-01 2022-06-30\n2012-06-30\n2014-08-01 2014-08-04\n2014-09-04\n2018-06-29\n2019-10-01 2019-10-23\nus-gaap:SubsequentEventMember\n2022-07-01 2022-07-19\nus-gaap:SubsequentEventMember\n2022-07-19\nus-gaap:SubsequentEventMember\n2022-08-01 2022-08-19\nus-gaap:SubsequentEventMember\n2022-08-19\nus-gaap:SubsequentEventMember\n2022-09-06 2022-09-06\nus-gaap:SubsequentEventMember\n2022-09-06\nus-gaap:SubsequentEventMember\n2022-09-15 2022-09-15\nus-gaap:SubsequentEventMember\n2022-09-15\nus-gaap:SubsequentEventMember\n2022-09-30 2022-09-30\nus-gaap:SubsequentEventMember\n2022-09-30\nxbrli:shares\niso4217:USD\niso4217:USD\nxbrli:shares\niso4217:USD\ncompsci:item\nxbrli:pure"
}