{
    "cik": "794172",
    "company": "MERIDIAN BIOSCIENCE INC",
    "filing_type": "10-K",
    "filing_date": "2022-11-22",
    "period_of_report": "2022-09-30",
    "sic": "2835",
    "state_of_inc": "OH",
    "state_location": "OH",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/794172/0001193125-22-290521-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/794172/000119312522290521/d384542d10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/794172/0001193125-22-290521.txt",
    "filename": "794172_10K_2022_0001193125-22-290521.htm",
    "content": "ITEM 1.\nBUSINESS\nOverview\nMeridian is a fully-integrated life science company with principal businesses in: (i) the development, manufacture, sale and distribution of diagnostic testing systems and kits, primarily for certain gastrointestinal and respiratory infectious diseases, and elevated blood lead levels; and (ii) the manufacture and distribution of bulk antigens, antibodies, immunoassay blocking reagents, specialized Polymerase Chain Reaction (PCR) master mixes, and bioresearch reagents used by other diagnostic test manufacturers and researchers in immunological and molecular tests for human, animal, plant and environmental applications.\nOur website is www.meridianbioscience.com. We make available our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements and any amendments thereto, free of charge through this website, as soon as reasonably practicable after such material has been electronically filed with or furnished to the SEC. The SEC maintains an internet site containing these filings and other information regarding Meridian at www.sec.gov. The information on our website is not and should not be considered part of this Form 10-K.\nPending Merger\nOn July 7, 2022, the Company entered into an Agreement and Plan of Merger (as it may be amended, supplemented or otherwise modified from time to time, the Merger Agreement) with SD Biosensor, Inc., a corporation with limited liability organized under the laws of the Republic of Korea (SDB), Columbus Holding Company, a Delaware corporation (Parent), and Madeira Acquisition Corp., an Ohio corporation and a direct wholly owned subsidiary of Parent (Merger Sub). Meridian is informed that SJL Partners, LLC (SJL) is currently the sole shareholder of Parent, and SDB together with SJL will be the sole shareholders of Parent as of the closing of the Merger. Pursuant to the Merger Agreement, Merger Sub will merge with and into Meridian (the Merger), with Meridian surviving the Merger as a direct wholly owned subsidiary of Parent. Consummation of the Merger is subject to customary closing conditions, including, without limitation: (i) the absence of certain legal impediments; and (ii) the condition that no Specified Outcome, as such term is defined in the Merger Agreement, related to the DOJ LeadCare legal matter (which is described in the section entitled Legal Matter Relating to LeadCare Product Line of Item 3. Legal Proceedings) has occurred or is reasonably likely to occur.\nOn November 21, 2022, the parties received clearance from the Committee on Foreign Investment in the United States with respect to the Merger and the transactions contemplated by the Merger Agreement.\nThe foregoing description of the Merger Agreement and the transactions contemplated thereby does not purport to be complete and is subject to, and qualified in its entirety by reference to, the full text of the Merger Agreement, which is attached as an exhibit to our Current Report on Form 8-K filed with the SEC on July 7, 2022.\nReportable Segments\nOur reportable segments are Diagnostics and Life Science, both of which are headquartered in Cincinnati, Ohio. We describe these reportable segments in this Business section and in other locations in this report:\nType of Segment Information\nLocation within Form 10-K\nPhysical locations and activities\nItem 2. Properties\nNet revenues by geographic region\nItem 8. Note 2 of Consolidated Financial Statements\nFinancial information\nItem 8. Note 15 of Consolidated Financial Statements\n- 5 -\nDiagnostics Segment\nProducts and Markets\nPrior to the onset of the COVID-19 pandemic early in 2020, our largest source of net revenues was clinical diagnostic products, historically representing approximately two-thirds of our consolidated net revenues. However, primarily due to the effects of the COVID-19 pandemic, which led to the growth in our Life Science segment, our Diagnostics segment provided 47% of consolidated net revenues for fiscal 2022, following 40% of consolidated net revenues for fiscal 2021.\nOur clinical diagnostic products provide accuracy, simplicity and speed; enable early diagnosis and treatment of acute medical conditions; and provide for better patient outcomes at reduced costs. We target diagnostics for disease states that: (i) are conditions where rapid diagnosis impacts patient outcomes; (ii) have opportunistic demographic and disease profiles; (iii) are underserved by current diagnostic products; and/or (iv) have difficult sample handling requirements (e.g., stool). This approach has allowed us to establish meaningful market share in our target disease states, gastrointestinal and respiratory illnesses, and tests for elevated lead levels in blood.\nOur product portfolio includes approximately 200 diagnostic tests and transport media, and is marketed to acute care hospitals, reference laboratories, outpatient clinics and physician office laboratories in over 70 countries around the world. Our testing platforms include: Real-time PCR Amplification (Revogene brand); Isothermal DNA Amplification (Alethia brand); Lateral Flow Immunoassay using fluorescent chemistry (Curian brand); Rapid Immunoassay (ImmunoCard and ImmunoCard STAT! brands); Enzyme-linked Immunoassay (PREMIER brand); Anodic Stripping Voltammetry (LeadCare brands); and urea breath testing for H. pylori (BreathID and BreathTek brands).\nOur diagnostic assay research and development programs are focused on menu expansion for our Curian and Revogene instrument platforms, with disease targets in the gastrointestinal and respiratory areas, as well as next generation blood-chemistry testing. Currently pending clearance at the U.S. Food and Drug Administration (FDA) is a 510(k) application for our Curian EHEC Shiga Toxin assay. Our current new product development pipeline includes gastrointestinal and respiratory multi-plex assays on our Revogene instrument platform, and C. difficile combo common antigen and Toxins A and B, on our Curian instrument platform. In addition, we have other assays on both platforms moving through our upstream marketing assessment processes that are expected to add to the development pipeline. For our BreathID platform, we are actively looking at the feasibility of combining Urea and Citrica into a single sachet or pouch. We are also pursuing opportunities to complement our internal research and development programs by securing rights to finished diagnostics tests that we can immediately commercialize.\nThe April 2020 acquisition of Exalenz Bioscience Ltd. (Exalenz) and the BreathID system, along with the July 2021 acquisition of the BreathTek business, strengthened our position in H. pylori testing, as these products provide an alternative testing approach versus stool antigen testing.\nMarket Trends\nDespite the effects of the COVID-19 pandemic and the intense focus on SARS-CoV-2 testing, we believe the global market for infectious disease tests continues to expand as new disease states are identified, new therapies become available, and worldwide standards of living and access to health care improve. There is a continuing shift from conventional testing to more technologically advanced testing, which can be performed by less highly trained personnel and completed in minutes or hours.\nThe growing global pressures to contain total health care costs have accelerated the increased use of diagnostic testing. Integrated Delivery Networks (IDNs) in our U.S. market have the goal of increasing the efficiency of health care delivery, reducing spending and improving clinical outcomes. We believe our product portfolio positions us competitively with IDNs and health care systems that are transitioning from fee-for-service compensation models to value-based reimbursement.\n- 6 -\nWe also continue to see aggregation of buying power in our U.S. market via multi-hospital group purchasing organizations (GPOs) and IDNs, consolidation among reference laboratories, hospital laboratories being operated by large reference laboratories, and acquisition of physician practices by hospitals, health systems and for-profit specialty health care companies.\nCost containment pressures have also affected health care systems outside the U.S., particularly in Europe, where the health care systems are generally government-run. The level of government budget deficits can have an adverse effect on the amount of government health care spend.\nSales, Marketing and Distribution\nOur Diagnostics segment relies on direct sales personnel and independent distribution networks. We have a direct sales force in two countries, covering the United States (U.S.) and certain major markets in the EMEA region (i.e., in Europe, the Middle East and Africa). We also use independent distributors either in a complementary manner with our direct sales force (e.g., the U.S.) or solely to supply our products to end-users. We have two independent distribution customers and a reference laboratory customer that together comprised 29% of Diagnostics segment net revenues in fiscal 2022, with each contributing between 8% and 11% of the Diagnostics segments net revenues.\nCompetition\nOur major competitors in molecular diagnostics are Cepheid (a Danaher business) and Becton Dickinson, both of which have systems with multiple-assay menus. We also face competition in molecular diagnostics, but to a lesser degree, from companies such as Abbott (former Alere business) and QuidelOrtho. In recent years, companies such as bioMerieux have captured market share in our gastrointestinal category via its BioFire multi-plex panel tests. However, since their introduction to the market, payors have raised concerns over reimbursement levels relative to clinical utility, particularly for panels with 12 or more targets. Our major competitors in rapid immunoassay diagnostics are primarily Abbott (former Alere business) and QuidelOrtho.\nFor blood lead testing, we believe we have the only FDA-cleared, CLIA-waived point-of-care test available commercially. Other blood lead testing systems in use, marketed by our competitors, include Graphite Furnace Atomic Absorption Spectroscopy, which requires a highly skilled technician and larger laboratory space to operate, in addition to not being portable or suitable for point-of-care use.\nResearch and Development\nOur Diagnostics segments research and development personnel are organized into three pre-clinical teams: immunoassay, PCR-based molecular and blood-chemistry. We have a separate team responsible for execution of clinical trials across all three pre-clinical programs. Our research and development activities are focused on new product and new technology development, new applications for our existing technologies, and improvements to existing products, including assay-menu expansion. Research and development efforts may occur in-house or with collaborative partners. We believe that new product development is a key source for sustaining revenue growth. The products within our Revogene and Alethia molecular platforms, H. pylori product family and blood lead testing family were developed in-house.\nManufacturing\nOur diagnostics products are manufactured at four principal sites in Billerica, Massachusetts (blood-chemistry); Cincinnati, Ohio (immunoassays and molecular tests); Modiin, Israel, (urea breath tests for H. pylori); and Quebec City, Quebec, Canada (molecular tests). Our immunoassay and molecular assay products require the production of highly specialized reagents, primers and enzymes, and our BreathID and BreathTek products require the production of urea in pharmaceutical-grade form. We produce the vast majority of our own immunoassay requirements. Reagents, primers and enzymes for our Revogene molecular assay products, primers for our Alethia molecular assay products, and urea for our BreathID and BreathTek systems are purchased from outside vendors. Our blood lead testing products require the production of electrical chemical sensors, which we manufacture using critical raw materials purchased from outside vendors.\n- 7 -\nIntellectual Property, Patents and Licenses\nWe own or license U.S. and foreign patents, most of which are for select products manufactured by our Diagnostics segment. These patents are used in our manufacturing processes for select products (e.g., method patents) or may relate to the design of the test device technology format (e.g., design patents). In the absence of patent protection, we may be vulnerable to competitors who successfully replicate our production and manufacturing technologies and processes. Our employees are required to sign confidentiality and non-disclosure agreements designed to protect our proprietary products.\nThe patents applicable to our Alethia products, which represented 3%, 4% and 7% of consolidated net revenues for fiscal 2022, 2021 and 2020, respectively, were licensed from a third party, Eiken Chemical Co., Ltd., under a non-exclusive license agreement, with the last remaining U.S. patent having expired during the year ended September 30, 2022.\nThe patents for the Revogene platform and related products acquired as part of the GenePOC business are either wholly owned or licensed from two third parties, Laval University and The Regents of California, under an exclusive license agreement. These patents are issued in the U.S., European Union (EU) and other countries. The term of our exclusive license agreement and the related patents currently runs through June 15, 2034, after which we will be free to practice the patents without any restriction or royalty obligation. In September 2021, the U.S. Patent and Trademark Office granted to Meridian Bioscience Canada, Inc. (a wholly owned subsidiary) and Laval University a patent for our current Revogene test device and its microfluidic use in our Revogene instrument.\nThe patents for the BreathID system and related urea breath test for H. pylori are either wholly owned or licensed from a third party, Oridion Medical 1987 Ltd., under an exclusive, royalty free, license agreement. The licensed and wholly owned patents are issued in the U.S., EU, Israel, Japan, Australia and China. The wholly owned patents have varying expiration dates, with the last being in 2033.\nThe patents for our stool antigen H. pylori products, owned by us and which represented approximately 5%, 7% and 9% of consolidated net revenues for fiscal 2022, 2021 and 2020, respectively, expired in May 2016 in the U.S. and in May 2017 in countries outside the U.S. As a result, competition with respect to our stool antigen H. pylori products has increased, adversely impacting our selling prices for these products, and/or our ability to retain business at prices acceptable to us. To mitigate certain of the pricing and volume pressures we face within the gastrointestinal product category, we have: (i) operated under a strategic collaboration agreement with DiaSorin to sell H. pylori tests; (ii) adjusted selling prices to secure volume; and (iii) upon FDA clearance in March 2020, launched Curian HpSA, our first assay on the Curian platform, which we expect will help protect our existing customer base using lateral flow tests. We also expect the BreathID and BreathTek products to mitigate competitive pressures, as these products provide an alternative to stool antigen testing. We are unable to provide assurances that we will be successful with any strategy or that any strategy will prevent an adverse effect on our future results of operations and/or liquidity, including net revenues and gross profit.\nGovernment Regulation\nOur diagnostic products are regulated by the FDA as devices pursuant to the Federal Food, Drug, and Cosmetic Act (FDCA). Under the FDCA, medical devices are classified into one of three classes (i.e., Class I, II or III). While exempt Class I and Class II products do not require FDA review, non-exempt Class I and Class II devices are cleared for marketing (i.e., these products require FDA review prior to marketing clearance). Class III devices generally must receive pre-market approval (PMA) from the FDA as to safety and effectiveness. Our diagnostics manufacturing facilities are subject to periodic inspection by the FDA. See Lead Testing Matters beginning on page 32 within MD&A for discussion regarding the FDAs inspection of our Billerica facility.\nEach of the diagnostic products currently marketed by Meridian in the U.S. has been cleared, approved or authorized for use by the FDA or are exempt from such requirements. The majority of such products have been cleared by the FDA pursuant to its 510(k) premarket review process, whereas our BreathTek product has been approved under the FDAs PMA process. In the case of our Revogene SARS-CoV-2 test, it has not been FDA cleared or approved but rather has been authorized by the FDA for emergency use under its Emergency Use Authorization (EUA) process, noting that there will likely be modifications to the regulatory requirements related to these tests in the near future when the EUA is revoked. We believe that most products under development will be classified as Class I or II medical devices and, in the case of most of our Class I and all Class II devices, will be eligible for 510(k) clearance; however, we can make no assurances in this regard. Our urea breath test for H. pylori on the BreathID system was cleared as a Class I medical device since the urea drug component was approved by the FDA separately via the New Drug Application (NDA) process. Our urea breath test for H. pylori on the BreathTek system was approved by the FDA via the PMA process in 2012. Following receipt of EUA on November 9, 2021 for our original SARS-CoV-2 test, our Omicron variant enhanced SARS-CoV-2 test on the Revogene platform was submitted to the FDA under its EUA program on March 29, 2022, with EUA being granted on July 27, 2022.\n- 8 -\nSales of our diagnostic products in foreign countries are subject to foreign government regulation, which is similar to that of the FDA. Our Diagnostics segment facilities are certified to ISO 13485.\nFollowing a five-year transition period, sales of our diagnostic products in the EU are subject to new regulations under the In Vitro Diagnostics Regulation of 2017 (IVDR) beginning in May 2022. IVDR replaces the previous IVD Regulation (98/79/EC). In October 2021, the European Commission submitted a proposal to the European Parliament that would move back the May 2022 implementation date for diagnostic tests that are currently CE Marked to dates ranging from May 2022 (for Class A products) to May 2027 (for Class B products), depending on the risk classification of the diagnostic test. We have completed an assessment of needed remediation activities to comply with IVDR and also determined that several products will not be sellable under IVDR. The net revenues associated with these products are not expected to be material. New diagnostic products launched after May 2022 are required to comply with IVDR.\nLife Science Segment\nProducts and Markets\nOur Life Science segment develops, manufactures, sells and distributes bulk antigens, antibodies, immunoassay blocking reagents, specialized PCR master mixes, isothermal reagents, enzymes, nucleotides, and bioresearch reagents used predominantly by in vitro device (IVD) manufacturing companies, and to a lesser degree, by researchers and non-human clinical customers such as veterinary, food and environmental. The COVID-19 pandemic has provided the opportunity for our Life Science segment to showcase the breadth of its reagent products across not only SARS-CoV-2 testing platforms (molecular, rapid antigen and serology), but also RNA and DNA based molecular tests for nearly any infectious disease. For fiscal 2022, approximately 87% of Life Science segment net revenues were generated from the industrial market, defined as IVD manufacturers. Further, as it relates to our Life Science segment net revenues, a significant number of our Life Science segment customers now use our molecular reagents in multiple tests, including non-COVID-19 related tests, therefore making it increasingly difficult to accurately estimate the portion of molecular reagent sales related specifically to COVID-19. As a result, we are no longer reporting the portion of Life Science segment net revenues related to COVID-19. Such net revenues were identified and reported throughout fiscal 2021 and fiscal 2020, totaling approximately $111,900 and $71,500, respectively. We engage direct sales teams in the U.S., the United Kingdom (U.K.), France, Germany, China and Australia. During fiscal 2022, 28% of net revenues for this segment were from two IVD manufacturing customers.\nOur Life Science segment products are marketed to IVD manufacturing customers as a source of raw materials for their human clinical diagnostics tests, or as an outsourced step in their manufacturing processes. Independent distributors market our molecular biology products to academic/research customers. Our products are used in detecting DNA and RNA in human, animal, plant and environmental applications.\nMarket Trends\nMajor IVD manufacturing customers often have global footprints, where we are supplying reagents to specific manufacturing sites around the world. IVD manufacturers in specific countries of the Asia-Pacific region (e.g., China) are increasing their efforts in the development and manufacturing of infectious disease tests. We intend to use the breadth of our product portfolio, particularly molecular reagents, to continue to increase the penetration of our products in IVD manufacturing customers tests.\nCompetition\nThe market for bulk biomedical reagents is highly competitive with respect to product quality, price, customer service and reputation. Our competitors, such as Thermo Fisher, often have greater financial, research and development, sales and marketing, and manufacturing resources. Customers also may choose to manufacture their biomedical reagents in-house rather than purchase from us.\n- 9 -\nResearch and Development\nOur research and development activities for the Life Science segment focus on molecular reagents for use in PCR and isothermal chemistries in detecting both DNA and RNA. Our new product development programs are progressing through sample-specific (e.g., blood, saliva, urine, stool, and plant) mixes in both air-dryable and lyophilization-ready forms, and isothermal reagents in both air-dryable and lyophilization-ready forms. We also have enzyme development programs that meet the EU Registration, Evaluation, Authorization, and Restriction of Chemicals regulation. See Operating Expenses section on page 36 within MD&A. Additionally, through our recent EUPROTEIN, Inc. (EUPROTEIN) and Estel Biosciences, Inc. (Estel) transactions in April 2022 and October 2022, respectively, we have expanded our immunological research and development capabilities. See the following notes of the Consolidated Financial Statements for further discussion of these transactions: (i) Note 4, Business Combinations for EUPROTEIN, and Note 18, Subsequent Event for Estel.\nManufacturing and Government Regulation\nOur Life Science segment facilities are ISO 13485 certified, and where appropriate, our Life Science segment facilities comply with Regulation EC 1069.\nInternational Markets\nInternational markets are an important source of net revenues and future growth opportunities for both of our reportable segments. For both reportable segments combined, net revenues from customers located outside of the U.S. and its territories approximated $170,000 or 51% of consolidated 2022 net revenues, $173,000 or 55% of consolidated 2021 net revenues, and $122,000 or 48% of consolidated 2020 net revenues. Since the outbreak of the COVID-19 pandemic in fiscal 2020 and throughout fiscal 2021 and 2022, a significantly higher percentage of our Life Science segments net revenues have been generated from international markets, and we expect to continue to look to key European and Asian markets as a source of revenue growth. For the Life Science segment, we also continue to focus resources on IVD manufacturing customers in China, India, Japan and Korea. To date, we have not experienced any adverse effects from the trade tensions between the U.S. and China, but we cannot be sure that we will not experience any adverse effects in the future.\nFluctuations in foreign currency exchange rates in fiscal 2022 compared to fiscal 2021 had an approximate $5,200 unfavorable impact on consolidated 2022 net revenues; $1,700 within the Diagnostics segment and $3,500 within the Life Science segment. This compares to year-to-year currency exchange rates having an approximate $9,200 favorable impact on consolidated net revenues in 2021; $1,300 within the Diagnostics segment and $7,900 within the Life Science segment. In fiscal 2020, the unfavorable effect on net revenues totaled $1,250; $150 within the Diagnostics segment and $1,100 within the Life Science segment.\nEnvironmental\nWe are in compliance with applicable portions of the federal and state hazardous waste regulations and have never been a party to any environmental proceeding.\nHuman Capital\nAs of September 30, 2022, our Diagnostics segment had approximately 515 employees in eight countries, our Life Science segment had approximately 210 employees in six countries, and Corporate and Shared Services had approximately 45 employees, all in the U.S. Approximately 57% of our employees are women. In addition, of our U.S. based employees, which represents approximately 65% of our total worldwide workforce, approximately 25% are ethnically diverse.\nBelow is additional demographic information about our current employee base as of September 30, 2022.\nMeridian Employees\nSalaried workforce\nManagers and above\nPart-time employees\nAverage age\nAverage length of service in years\nEmployee turnover rate (voluntary)\n%\nFiscal 2022 net revenues per employee (in thousands)\n$\n- 10 -\nEqual Employment Opportunity Table (by number of employees)\nU.S. Employee Diversity as of September 30, 2022\nJob category\nGender\nWhite\nBlack/African\nAmerican\nHispanic/Latino\nAsian\nAmerican\nIndian/Alaskan\nNative\nTwo\nor\nmore\nraces\nTotal\nExecutive/senior level officials and managers\nMale\n-\n-\n-\n-\nFemale\n-\n-\n-\n-\nFirst/mid-level officials and managers\nMale\n-\n-\nFemale\n-\n-\n-\nProfessionals\nMale\n-\nFemale\n-\nAll other\nMale\n-\n-\nFemale\n-\nTotal\nMale\n-\nFemale\n-\nWe believe that developing a diverse, equitable and inclusive culture is critical to continuing to attract and retain the top talent necessary to deliver on our growth strategy. As such, we continue to invest in the creation of a work environment where our employees can feel inspired to deliver their workplace best every day. We continue to expand our Human Resources Information System (HRIS) and other systems to track key human capital metrics, including workforce demographics, diversity, turnover, engagement, and training data.\nDiversity, Equity and Inclusion\nIn 2020, we initiated the One Meridian Inclusion Diversity and Equity Team, which is comprised of a group of employees around the world and led by Dr. Lourdes Weltzien, Executive Vice President, Life Science, and Melissa McCarey, Vice President, Global Human Resources. Consistent with its mission statement, this team is providing topical programs throughout the year, in an effort to promote awareness so we can encourage and support an environment in which all employees feel included and empowered to achieve their best.\nCompensation and Benefits\nWe strive to provide pay, benefits, and services that are competitive to market and create incentives to attract and retain employees globally. Our compensation packages include market-competitive pay, cash bonuses, health care and retirement benefits, paid time off, and family leave, among others, depending upon locale. We are focused on pay equity globally and are striving to close the gap in pay among similar roles and responsibilities in certain locations within our organization, after accounting for legitimate business factors that can explain differences, such as performance, time at grade level, and tenure. We intend to conduct market surveys every two years to assess market compensation levels from a total compensation perspective. We also continue to advance transparency in our pay and representation data by complying with all applicable statutory filing requirements.\nCommunication and Engagement\nWe strongly believe that Meridians success depends on employees understanding how their work contributes to the Companys overall strategy. To this end, we utilize a variety of channels to facilitate open and direct communication, including: (i) One Meridian Company-wide intranet; (ii) quarterly CEO update videos; (iii) open forums or town hall meetings with executives; (iv) regular ongoing update communications; and (v) employee engagement surveys.\nHealth, Wellness and Safety\nWe are committed to the safety of our employees and communities, and safety in our operations, our product development activities and our supplier partnerships. Our ultimate goal is to achieve zero serious injuries through continued investment in, and focus on, our core safety programs and injury-reduction initiatives. We provide access to a variety of innovative, flexible, and convenient health and wellness tools.\n- 11 - ITEM 1A.\nRISK FACTORS\nIn addition to the other information set forth in this report, you should carefully consider the following factors, which could materially affect our business, financial condition, cash flows and/or future results. Any one of these factors could cause our actual results to vary materially from recent results or from anticipated future results. The risks described below are not the only risks facing our company. Additional risks and uncertainties not currently known to us, or that we currently deem to be immaterial, also may materially adversely affect our business, financial condition and/or operating results.\nRisk Factors Summary\nRisks Related to Our Strategy\nIf the Merger contemplated by the Merger Agreement does not occur, it could have a material adverse effect on our business, results of operations, financial condition and stock price.\nOur financial condition, results of operations and cash flows could be adversely affected by outbreaks of disease, such as the COVID-19 pandemic.\nNet revenues for our Diagnostics segment may be impacted by our reliance upon large customers in North America, seasonal factors and sporadic outbreaks, and changing diagnostic market conditions.\nNet revenues for our Life Science segment may be impacted by customer concentrations and buying patterns.\nIntense competition could adversely affect our profitability and operating results.\nWe expect to continue facing increased competition resulting from the expiration of our H. pylori patents.\nRisks Related to our Intellectual Property\nWe may be unable to protect or obtain adequate patent protection for intellectual property that we utilize or intend to utilize.\nProduct infringement claims by other companies could result in costly disputes and could limit our ability to sell our products.\nRisks Related to our Operations\nWe may be unable to develop new products or acquire products on favorable terms.\nWe may be unable to successfully integrate operations or to achieve expected cost savings from acquisitions we make.\nThe effective tax rate of the Company may be negatively impacted by changes in the mix of earnings as well as future changes to tax laws in global jurisdictions in which we operate.\nSignificant interruptions in production at our principal manufacturing facilities and/or third-party manufacturing facilities could adversely affect our business and operating results.\nWe depend on sole-source suppliers for certain critical raw materials, components and finished products. A supply interruption could adversely affect our business.\nOur ability to meet future customer demand for selected products is dependent upon our ability to successfully manage our manufacturing capacity and supply chains.\nIncreased prices for, poor quality of, or extended inability to source raw materials or services used in our products, and supply chain disruptions, could adversely affect profitability.\nRisks Related to Legal, Regulatory and International Matters\nWe are subject to comprehensive regulation, and our ability to earn profits may be restricted by these regulations.\nIf we or our third-party vendors fail to comply with FDA regulations relating to the manufacturing of our products or any component part, we may be subject to fines, injunctions and penalties, and our ability to commercially distribute and sell our products may be negatively impacted.\n- 12 -\nWe incur costs and demands upon management as a result of complying with the laws and regulations affecting public companies in the U.S., and failure to comply with these laws could harm our business and the price of our common stock.\nWe could be adversely affected by health care reform legislation.\nEfforts to reduce the U.S. federal deficit could adversely affect our results of operations.\nGlobal market, political, environmental, and economic conditions, including those related to the financial markets, could have a material adverse effect on our operating results, financial condition, and liquidity.\nWe depend on international net revenues, and our operating results may be adversely impacted by foreign currency, regulatory or other developments affecting international markets.\nNew tariffs and other trade measures could adversely affect our operating results.\nIf product liability lawsuits are successfully brought against us, we may incur substantial liabilities and may have to limit or cease sales of our products.\nRisks Related to Our Common Stock\nThe market price of our common stock may be volatile and fluctuate significantly, which could result in substantial losses for stockholders and subject us to litigation.\nOur business could be negatively impacted as a result of shareholder activism, an unsolicited takeover proposal or a proxy contest.\nThe authority of our board to issue preferred stock and the effects of certain provisions of Ohio corporation law may discourage takeover bids.\nGeneral Risk Factors\nOne or more cybersecurity incidents may adversely impact our financial condition, results of operations and/or reputation.\nOur business could be negatively affected if we are unable to attract, hire and retain key personnel.\nOur bank credit agreement imposes restrictions with respect to our operations, which could adversely impact our business.\nRisks Related to Our Strategy\nIf the Merger contemplated by the Merger Agreement does not occur, it could have a material adverse effect on our business, results of operations, financial condition and stock price.\nOn July 7, 2022, we entered into the Merger Agreement noted above within the Pending Merger section of Item 1. Business. Completion of the proposed Merger is subject to the satisfaction of various conditions. There is no assurance that all of the various conditions will be satisfied, or that the Merger will be completed within the expected timeframe, or at all. The proposed Merger gives rise to inherent risks that include:\nthe amount of the cash to be paid under the Merger Agreement is fixed and will not be adjusted for changes in our business, assets, liabilities, prospects, outlook, financial condition or results of operations or in the event of any change in the market price of, analyst estimates of, or projections relating to, our common stock;\nlegal or regulatory proceedings, or other matters that affect the timing or ability to complete the transaction as contemplated;\nthe possibility of disruption to our business, including increased costs and diversion of management time and resources;\ndifficulties maintaining business and operational relationships, including relationships with clients, vendors, suppliers, distributors, resellers and other business partners;\nthe inability to attract and retain key personnel pending consummation of the proposed Merger;\n- 13 -\npotential stockholder litigation relating to the Merger could prevent or delay the Merger or otherwise negatively impact our business and operations;\nthe inability to pursue alternative business opportunities or make changes to our business pending the completion of the proposed Merger;\ndevelopments beyond our control including, but not limited to, changes in domestic or global economic conditions that may affect the timing or success of the proposed Merger; and\nthe risk that if the proposed Merger is not completed, the market price of our common stock could decline, investor confidence could decline, stockholder litigation could be brought against us, relationships with clients, suppliers and other business partners may be adversely impacted, we may be unable to retain key personnel, and profitability may be adversely impacted due to costs incurred in connection with the proposed Merger and general disruption to our business.\nOur financial condition, results of operations and cash flows could be adversely affected by outbreaks of disease, such as the COVID-19 pandemic.\nAny outbreak of contagious diseases, such as COVID-19, or other adverse public health developments, could have material and adverse effects on our business operations. Such adverse effects could include diversion or prioritization of health care resources away from the conduct of diagnostic testing, disruptions of or restrictions on the ability of laboratories to process our tests, and delays or difficulties with respect to patients accessing our tests, including those resulting from an inability to travel as a result of quarantines or other restrictions resulting from such outbreaks. As COVID-19 continues to affect individuals and businesses around the globe, we may experience disruptions that could severely impact our business, including:\ndecreased volume of testing and related sales of certain of our Diagnostics segment products as a result of disruptions to health care providers and limitations on the ability of providers to administer tests;\ndisruptions or restrictions on the ability of the Companys, our collaborators, or our suppliers personnel to travel, and temporary closures of our facilities, or the facilities of our collaborators or suppliers;\nlimitations on employee resources that would otherwise be focused on the development of our products, the processing of our diagnostic tests, and/or the conduct of our clinical trials, because of illness of employees or their families, or requirements imposed on employees to avoid contact with large groups of people; and\ndelays in necessary interactions with local regulators, ethics committees, and other important agencies and contractors due to limitations in employee resources or forced furlough of government employees.\nIn addition, the continued spread of COVID-19 globally could adversely affect our manufacturing and supply chains. Parts of our direct and indirect supply chains are located overseas, including in China, and may accordingly be subject to disruption. Additionally, our results of operations could be adversely affected to the extent that COVID-19 or any other epidemic harms our business or the economy in general either domestically or in any other region in which we do business. The extent to which COVID-19 affects our operations will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the duration of the outbreak, new information that may emerge concerning the severity of COVID-19, and the actions to contain COVID-19 or treat its impact, among others, which could have an adverse effect on our business, results of operations and financial condition. Over the course of the COVID-19 pandemic, we have generally seen a slowing of our assay instrument placements and sales of related test kits, as diagnostic testing sites turned their attention to critical care testing. We are unable to predict when expected sales volume levels for our instruments and related test kits will return. Also, as a result of the COVID-19 pandemic, certain clinical trials related to our products which were underway or scheduled to begin were temporarily placed on hold. Such delays have impacted our timing for filing applications for product clearances with the FDA, as well as related timing of FDA clearances of such filings. Additionally, the COVID-19 pandemic slowed efforts to expand our product portfolio through acquisition opportunities, impacting the speed with which we are able to bring additional products to market.\n- 14 -\nNet revenues for our Diagnostics segment may be impacted by our reliance upon large customers in North America, seasonal factors and sporadic outbreaks, and changing diagnostic market conditions.\nKey Distributors\nOur Diagnostics segments net revenues from sales through three customers, including two key distributors, were approximately 29%, 33% and 32% of the Diagnostics segments total net revenues for 2022, 2021 and 2020, respectively, or approximately 13%, 13% and 15%, respectively, of each years consolidated net revenues. The loss of any one of these customers could negatively impact our net revenues and results of operations unless suitable alternatives were timely found or in the case of distributor customers, lost sales to one distributor were absorbed by another distributor. Finding a suitable alternative on satisfactory terms may pose challenges in our industrys competitive environment. As an alternative, we could expand our efforts to distribute and market our products directly. This alternative, however, would require substantial investment in additional sales, marketing and logistics resources, including hiring additional sales and customer service personnel, which would significantly increase our future selling, general and administrative expenses.\nIn addition, buying patterns of these customers may fluctuate from quarter to quarter, potentially leading to uneven concentration levels on a quarterly basis.\nSeasonal Factors and Sporadic Outbreaks\nOur principal business is the sale of a broad range of diagnostic test kits for common gastrointestinal and respiratory infectious diseases, and elevated blood lead levels. Certain infectious diseases may be seasonal in nature, while others may be associated with sporadic outbreaks, such as foodborne illnesses or pandemics such as an influenza outbreak or the COVID-19 pandemic. While we believe that the breadth of our Diagnostics segment product lines normally reduces the risk that infections subject to seasonality and sporadic outbreaks will cause significant variability in Diagnostics segment net revenues, the COVID-19 pandemic has had a significant adverse impact on our Diagnostics segment net revenues since it began in fiscal 2020. Accordingly, we can make no assurance that net revenues will not be negatively impacted period over period by such factors.\nChanging Diagnostic Market Conditions\nChanges in the U.S. health care delivery system have resulted in consolidation among reference laboratories, hospital laboratories being operated by large reference laboratories, and the formation of multi-hospital alliances, reducing the number of institutional customers for diagnostic test products. Consolidation in the U.S. health care industry has also led to the creation of GPOs and IDNs that aggregate buying power for hospital groups and put pressure on our selling prices. Due to such consolidation, we may not be able to enter into and/or sustain contractual or other marketing or distribution arrangements on a satisfactory commercial basis with institutional customers, GPOs and/or IDNs, which could adversely affect our results of operations.\nNet revenues for our Life Science segment may be impacted by customer concentrations and buying patterns.\nOur Life Science segments net revenues from three diagnostic manufacturing customers were 31%, 20% and 24% of the Life Science segments total net revenues for 2022, 2021 and 2020, respectively. Sales to these three diagnostic manufacturing customers comprised 17%, 12% and 13% of consolidated net revenues for 2022, 2021 and 2020, respectively. In addition, in excess of 10% of the Life Science segments total net revenues has historically been concentrated among a number of other significant customers. Any significant alteration of buying patterns from these customers resulting from the decline in COVID-19 related demand, or otherwise, could adversely affect our period over period net revenues and results of operations.\nIntense competition could adversely affect our profitability and operating results.\nThe markets for our products and services are characterized by substantial competition and rapid change. Hundreds of companies around the world supply diagnostic tests and immunoassay and molecular reagents. These companies range from multinational health care entities, for which diagnostics is one line of business, to small start-up companies. Many of our competitors have significantly greater financial, technical, manufacturing and marketing resources than we do. We cannot provide assurance that our products and services will be able to compete successfully with the products and services of our competitors.\n- 15 -\nWe expect to continue facing increased competition resulting from the expiration of our H. pylori patents.\nThe patents for our stool antigen H. pylori products, owned by us, expired in May 2016 in the U.S. and in May 2017 in countries outside the U.S. As a result, competition with respect to our stool antigen H. pylori products, products which currently represent approximately 5% of our total net revenues has increased, adversely impacting our selling prices for these products, and/or our ability to retain business at prices acceptable to us. To mitigate certain of the pricing and volume pressures we face within the gastrointestinal product category, we have: (i) operated under a strategic collaboration agreement with DiaSorin to sell H. pylori tests; (ii) adjusted selling prices to secure volume; and (iii) upon FDA clearance in March 2020, launched Curian HpSA, our first assay on the Curian platform, which we expect will help protect our existing customer base using lateral flow tests. We also expect the BreathID and BreathTek products to mitigate competitive pressures, as these systems provide an alternative to stool antigen testing. We are unable to provide assurances that we will be successful with any strategy or that any strategy will prevent an adverse effect on our future results of operations and liquidity, including net revenues and gross profit.\nRisks Related to Our Intellectual Property\nWe may be unable to protect or obtain adequate patent protection for intellectual property that we utilize or intend to utilize.\nIn developing and manufacturing our products, we employ a variety of proprietary and patented technologies. In addition, we have licensed, and expect to continue to license, various complementary technologies and methods from academic institutions and public and private companies. We cannot provide assurance that the technologies that we own or license provide protection from competitive threats or from challenges to our intellectual property. In addition, we cannot provide assurances that we will be successful in obtaining and retaining licenses, or proprietary or patented technologies, in the future.\nProduct infringement claims by other companies could result in costly disputes and could limit our ability to sell our products.\nLitigation over intellectual property rights is prevalent in the life science and diagnostic industries. As the market for diagnostics continues to grow and the number of participants in the market increases, we may increasingly be subject to patent infringement claims. It is possible that a third party may claim infringement against us. If found to infringe, we may attempt to obtain a license to such intellectual property; however, we may be unable to do so on favorable terms, or at all. Additionally, if our products are found to infringe on third-party intellectual property, we may be required to pay damages for past infringement and lose the ability to sell certain products, causing our revenues to decrease. Any substantial loss resulting from such a claim could have a material adverse effect on our profitability, and the damage to our reputation in the industry could have a material adverse effect on our future results of operations and liquidity, including net revenues and gross profit.\nRisks Related to Our Operations\nWe may be unable to develop new products or acquire products on favorable terms.\nThe medical diagnostic and life science industries are characterized by ongoing technological developments and changing customer requirements. As such, our results of operations and continued growth depend, in part, on our ability in a timely manner to develop or acquire rights to, and successfully introduce into the marketplace, enhancements of existing products and services, or new products and services that incorporate technological advances, meet customer requirements, and/or respond to products developed by our competition. We cannot provide any assurance that we will be successful in developing or acquiring such rights to products and services on a timely basis, or that such products and services will adequately address the changing needs of the marketplace, either of which could adversely affect our results of operations.\nIn addition, we must regularly allocate considerable resources to research and development of new or acquired products, services and technologies, and protecting intellectual property. The research and development process generally takes a significant amount of time from research to product launch. This process is conducted in various stages. During each stage, there is a risk that we will not achieve our goals on a timely basis, or at all, and we may have to abandon a project in which we have invested substantial resources, any of which could adversely affect our results of operations.\n- 16 -\nWe may be unable to successfully integrate operations or to achieve expected cost savings from acquisitions we make.\nOne of our growth strategies is the acquisition of companies and/or products. Although additional acquisitions of companies and products may enhance the opportunity to increase net earnings over time, such acquisitions could result in greater administrative burdens, increased exposure to the uncertainties inherent in marketing new products, financial risks of additional operating costs, disrupted operations, challenges in employee retention, and increased risk of asset impairments if future net revenues and cash flows are deficient. The principal benefits expected to result from any acquisitions we make will not be achieved fully unless we are able to successfully integrate the operations of the acquired entities with our operations and realize the anticipated synergies, cost savings and growth opportunities from integrating these businesses into our existing businesses. We cannot provide assurance that we will be able to identify and complete additional acquisitions on terms we consider favorable or that, if completed, will be successfully integrated into our operations. Furthermore, we cannot predict the outcome of goodwill impairment testing and the impact of goodwill impairments on the Companys net earnings and results of operations.\nThe effective tax rate of the Company may be negatively impacted by changes in the mix of earnings as well as future changes to tax laws in global jurisdictions in which we operate.\nWe are subject to income taxes in the U.S. and various other global jurisdictions. Our effective tax rate could be adversely affected by changes in the mix of earnings by jurisdiction and the valuation of deferred tax assets and liabilities. Recently, the current U.S. presidential administration committed to tax reform, and if enacted, the impact could be material to our tax provision and value of deferred tax assets and liabilities. We recognize deferred tax assets and liabilities based on the differences between the consolidated financial statement carrying amounts and the tax basis of assets and liabilities. Significant judgment is required in determining our provision for income taxes. We regularly review our deferred tax assets for recoverability and establish a valuation allowance if it is more likely than not that some portion or all of a deferred tax asset will not be realized. If we are unable to generate sufficient future taxable income, if there is a material change in the actual effective tax rates, or if there is a change to the time period within which the underlying temporary differences become taxable or deductible, we could be required to increase our valuation allowance against our deferred tax assets, which could result in a material increase in our effective tax rate.\nChanges in tax laws or tax rulings could have a material impact on our effective tax rate. Many countries in the EU, as well as several other countries and organizations such as the Organization for Economic Cooperation and Development, are actively considering changes to existing tax laws. Certain proposals could include recommendations that could increase our tax obligations in those countries where we do business. Any changes in the taxation of our activities in such jurisdictions may result in a material increase in our effective tax rate.\nSignificant interruptions in production at our principal manufacturing facilities and/or third-party manufacturing facilities would adversely affect our business and operating results.\nProducts and services manufactured at facilities we own or lease comprise a majority of our net revenues. Our global supply of these products and services is dependent on the uninterrupted and efficient operation of these facilities. In addition, we currently rely on a small number of third-party manufacturers to produce certain of our diagnostic products and product components. The operations of our facilities or these third-party manufacturing facilities could be adversely affected by power failures, or natural or other disasters such as earthquakes, floods, tornadoes or terrorist threats. Although we carry insurance to protect against certain business interruptions at our facilities, there can be no assurance that such coverage will be adequate or that such coverage will continue to remain available on acceptable terms, if at all. Any significant interruption in the Companys or a third-party suppliers manufacturing capabilities, including interruptions resulting from product recall activities like that experienced in our Billerica facility (see Lead Testing Matters beginning on page 32 within MD&A) could materially and adversely affect our results of operations.\n- 17 -\nWe depend on sole-source suppliers for certain critical raw materials, components and finished products. A supply interruption could adversely affect our business.\nRaw Materials and Components\nOur diagnostic products are made from a wide variety of raw materials that are biological or chemical in nature, and that generally are available from multiple sources of supply. We sole-source certain raw materials and components, which makes it time consuming and costly to switch raw materials and components in FDA-cleared products. If certain suppliers fail to supply required raw materials or components, we will need to secure other sources which may require us to conduct additional development and testing and obtain regulatory approval. These activities require significant time and resources, and there is no assurance that new sources will be secured or regulatory approvals, if necessary, will be obtained.\nWe utilize third-party manufacturers for certain of our instrumentation. One third party manufactures our proprietary Alethia Incubator/Reader (instrument), a component of our Alethia molecular system, and an additional third party manufactures our Curian instrument. These instruments are manufactured exclusively for Meridian according to our specifications. While other manufacturers for these types of instruments are available, we source each instrument solely from one manufacturer to limit the costs involved in clearing the system for marketing in the U.S. If these third-party manufacturers fail to supply us with instruments, we will need to secure another manufacturer, and it may take as long as 12 months to transfer instrument manufacturing. An interruption in the manufacturing of these instruments could have a material adverse effect on our results of operations.\nAdditionally, one third party manufactures a certain reagent for use with our Alethia assays. While alternative suppliers exist, we elect to utilize this third party exclusively in order to maintain consistency in our materials, which is critical in complying with FDA regulatory requirements. An interruption in the manufacturing of these reagents could have a material adverse effect on our results of operations.\nFinished Products\nWe outsource the manufacturing for certain finished diagnostic products to third parties. A disruption in the supply of these finished products could have a material adverse effect on our business until we find another supplier or bring manufacturing in-house.\nActivities undertaken by Meridian to reduce the risk of these sole-supplier arrangements include maintaining adequate inventory levels, supplier qualification procedures, supplier audits, site visits, and frequent communication. Additionally, we have identified potential alternate suppliers.\nOur ability to meet future customer demand for selected products is dependent upon our ability to successfully manage our manufacturing capacity and supply chains.\nTo manage our anticipated future growth effectively, it may become necessary for us to enhance our manufacturing and supply chain capabilities, infrastructure and operations, information technology infrastructure, and financial and accounting systems and controls. Organizational growth and scale-up of operations could strain our existing managerial, operational, financial, and other resources. If our management is unable to effectively prepare for our expected future growth, our expenses may increase more than anticipated, our net revenues could grow more slowly than expected, and we may not be able to achieve our commercialization, profitability, or product development goals. Our failure to effectively implement the necessary processes and procedures and otherwise prepare for our anticipated growth could have a material adverse effect on our future consolidated financial condition and results of operations.\nThe Russia / Ukraine war (the War) that developed during the second quarter of fiscal year 2022 also could disrupt our supply chains. While to date this War has not caused us to experience any material negative impacts on our business, financial condition, or results of operations, we are unable to estimate the extent to which, if at all, the war could hurt our supply chains. The evolving nature of the War, related international sanctions, other potential government actions, and economic consequences of the War, including incurring higher costs to source materials due to inflation or otherwise, are factors that could disrupt supply chains throughout the world, including potentially the supply chains on which our business relies. If the War either directly or indirectly disrupts our supply chains and we are unable to mitigate such disruption, the War could have a material adverse effect on our future consolidated financial condition and results of operations.\n- 18 -\nIncreased prices for, poor quality of, or extended inability to source raw materials or services used in our products, and supply chain disruptions, could adversely affect profitability.\nOur profitability is affected by the prices of the raw materials used in the manufacture of our products. These prices fluctuate based on a number of factors beyond our control, including changes in supply and demand, general economic conditions, labor costs, fuel-related delivery costs, competition, import duties, tariffs, currency exchange rates, and, in some cases, government regulation. Significant increases in the prices of raw materials, services and transportation costs, similar to the inflationary increases we have experienced since the second half of fiscal 2021, that cannot be recovered through increases in the price of our products and/or offset by savings in other areas, could adversely affect our results of operations and cash flows.\nWe cannot guarantee that the prices we are paying for raw materials today will continue in the future, or that the marketplace will continue to support current prices for our products, or that such prices can be adjusted to fully or partially offset raw material price increases in the future. Any increases in prices resulting from a tightening supply of these or other commodities could adversely affect our profitability. We do not engage in hedging transactions for raw material purchases, but we do enter into some fixed-price supply contracts.\nOur dependency upon regular deliveries of supplies and the quality of those supplies upon delivery from particular suppliers means that interruptions, stoppages, or deterioration of quality in such deliveries could adversely affect our operations until arrangements with alternate suppliers could be made. Several of the raw materials used in the manufacture of our products currently are procured from a single source. In some cases, we also outsource certain services to suppliers, including but not limited to, engineering, assembly, shipping, and commissioning services. If a supplier were unable to deliver these materials or services, or if the quality of these materials or services declined, for an extended period of time as a result of financial difficulties, catastrophic events affecting their facilities, or other factors, including recent supply chain disruptions we have experienced, or if we were unable to negotiate acceptable terms for the supply of materials or services with these suppliers, our business could be adversely affected. We may not be able to find acceptable alternatives, and any such alternatives could result in increased costs. Extended inability to source a necessary raw material or service could cause us to cease manufacturing one or more products for a period of time, which could also lead to loss of customers, as well as reputational, competitive, or business harm, which could have a material adverse effect on our business, consolidated financial condition, and results of operations.\nRisks Related to Legal, Regulatory and International Matters\nWe are subject to comprehensive regulation, and our ability to earn profits may be restricted by these regulations.\nMedical device diagnostics is a highly regulated industry. We cannot provide assurance that we will be able to obtain necessary governmental clearances or approvals, or timely clearances or approvals, to market future products in the U.S. and other countries. Costs and difficulties in complying with laws and regulations administered by the FDA, the U.S. Department of Agriculture, the U.S. Department of Commerce, the U.S. Drug Enforcement Agency, the Centers for Disease Control and Prevention (CDC), or other regulators can result in unanticipated expenses and delays, and interruptions to the sale of new and existing products.\nRegulatory approval can be a lengthy, expensive and uncertain process, making the timing and cost of approvals difficult to predict. Failure to comply with these regulations can result in delays in obtaining authorization to sell products, seizure or recall of products, suspension or revocation of authority to manufacture or sell products, and other civil or criminal sanctions.\n- 19 -\nIf we or our third-party vendors fail to comply with FDA regulations relating to the manufacturing of our products or any component part, we may be subject to fines, injunctions and penalties, and our ability to commercially distribute and sell our products may be negatively impacted.\nOur diagnostics manufacturing facilities, and the manufacturing facilities of any of our third-party diagnostic component manufacturers or critical suppliers, are required to comply with the FDAs Quality System Regulation (QSR), which sets forth minimum standards for the procedures, execution and documentation of the design, testing, production, control, quality assurance, labeling, packaging, sterilization, storage, and shipping of the products we sell, and related regulations, including Medical Device Reporting (MDR) regulations regarding reporting of certain malfunctions and adverse events potentially associated with our products. The FDA may evaluate our compliance with the QSR, MDR and other regulations, among other ways, through periodic announced or unannounced inspections which could disrupt our operations and interrupt our manufacturing. If in conducting an inspection of our manufacturing facilities, or the manufacturing facilities of any of our third-party component manufacturers or critical suppliers, an FDA investigator observes conditions or practices believed to violate the QSR, the investigator may document their observations on a Form FDA 483 that is issued at the conclusion of the inspection. A manufacturer that receives an FDA 483 may respond in writing and explain any corrective actions taken in response to the inspectional observations. The FDA will typically review the facilitys written response and may re-inspect to determine the facilitys compliance with the QSR and other applicable regulatory requirements. Failure to take adequate and timely corrective actions to remedy objectionable conditions listed on an FDA 483 could result in the FDA taking administrative or enforcement actions. Among these may be the FDAs issuance of a Warning Letter to a manufacturer, which informs it that the FDA considers the observed violations to be of regulatory significance that, if not corrected, could result in further enforcement action.\nFDA enforcement actions, which include seizure, injunction, criminal prosecution, and civil penalties, could result in total or partial suspension of a facilitys production and/or distribution, product recalls, fines, suspension of the FDAs review of product applications, and/or the FDAs issuance of adverse publicity. Thus, an adverse inspection could force a shutdown of our manufacturing operations or a recall of our products. Adverse inspections could also delay FDA approval of our products and could have an adverse effect on our production, net revenues and profitability.\nWe and any of our third-party vendors may also encounter other problems during manufacturing including failure to follow specific protocols and procedures, equipment malfunction, and environmental factors, any of which could delay or impede our ability to meet demand. The manufacture of our product also subjects us to risks that could harm our business, including problems relating to our facilities and errors in manufacturing components that could negatively affect the efficacy or safety of our products or cause delays in shipment of our products. Any interruption or delay in the manufacture of the product, or any of its components, could impair our ability to meet the demand of our customers and cause them to cancel orders or switch to competitive products, which could, therefore, have a material adverse effect on our business, consolidated financial condition and results of operations.\nAs described in Item 3. Legal Proceedings, on April 17, 2018, the Companys wholly owned subsidiary Magellan received a subpoena from the U.S. Department of Justice (DOJ) regarding its LeadCare product line. The subpoena outlined documents to be produced, and the Company is cooperating with the DOJ in this matter. The Company maintains rigorous policies and procedures to promote compliance with applicable regulatory agencies and requirements and is working with the DOJ to promptly respond to the subpoena, including responding to additional information requests that have followed receipt of the subpoena in April 2018. The Company has executed tolling agreements to extend the statute of limitations. In March and April 2021, DOJ issued two subpoenas, both to former employees of Magellan, calling for witnesses to testify before a federal grand jury related to this matter. In September and October 2021, DOJ issued additional subpoenas to individuals seeking testimony and documents in connection with its ongoing investigation. It is the Companys understanding that multiple witnesses have testified before the federal grand jury and the DOJs investigation is ongoing. Discussions continue with the DOJ to explore resolution of the matter. As of September 30, 2022, in accordance with applicable accounting guidance, the Company believes a loss is probable in the DOJ LeadCare legal matter and has accrued $10,000 as an estimate of the cost to resolve the DOJ LeadCare legal matter, which is reflected in litigation and select legal costs within the Consolidated Statement of Operations for the year ended September 30, 2022. The Company cannot predict when the investigation will be resolved or the outcome of the investigation, and the ultimate resolution of the DOJ LeadCare legal matter may exceed the amount accrued at September 30, 2022 and could be material to the Company. Expense for attorneys fees related to this matter totaling $3,510, $2,803 and $2,035 is included within the Consolidated Statements of Operations for the years ended September 30, 2022, 2021 and 2020, respectively.\n- 20 -\nMagellan submitted 510(k) applications in December 2018, seeking to reinstate venous blood sample-types for its LeadCare II, LeadCare Plus and LeadCare Ultra testing systems. In the second fiscal quarter of 2019, the FDA informed Magellan that each of these 510(k) applications had been put on Additional Information hold. On July 15, 2019, we provided responses to the FDAs requests for Additional Information. These 510(k) applications have since expired and are no longer under FDA review. Further, while Magellans LeadCare testing systems remain cleared for marketing by the FDA and permitted for use with capillary blood samples, the FDA advised that it has commissioned a third-party study of the Companys LeadCare testing systems using both venous and capillary blood samples. According to the FDA, the results of the field study will be used in conjunction with other information to determine whether further action by the FDA or the CDC is necessary to protect the public health. The Company intends to fully cooperate with the FDA or CDC on any follow-up based on the third-party study.\nDuring October 2019, the FDA performed a follow-up inspection of Magellans manufacturing facility. The FDA issued five Form FDA 483 observations. On March 18, 2020, we participated in a regulatory meeting with the FDA at the FDAs request to further discuss the Form FDA 483 observations and our remediation efforts. Since the inspection, we have submitted a number of written responses to the FDA regarding the five Form FDA 483 observations issued in the October 2019 inspection, and have worked diligently to execute a remediation plan. During October 2020, the FDA issued Establishment Inspection Reports which closed out the inspections from June 2017 and October 2019 under 21 C.F.R.20.64(d)(3).\nDuring June 2021, the FDA performed an inspection of Magellans manufacturing facility. As a result of this inspection, the FDA issued one Form 483 observation. On August 3, 2021, FDA sent Magellan a close-out letter for the Warning Letter that FDA issued to Magellan on October 23, 2017. The FDAs close-out letter notified Magellan that FDA has completed an evaluation of Magellans corrective actions in response to FDAs Warning Letter, and based on FDAs evaluation, Magellan has addressed the issues identified in the Warning Letter. FDAs close-out letter also stated that future FDA inspections of Magellan and regulatory activities will further assess the adequacy and sustainability of Magellans corrections.\nWe incur costs and demands upon management as a result of complying with the laws and regulations affecting public companies in the U.S., and failure to comply with these laws could harm our business and the price of our common stock.\nAs a public company listed in the U.S., we incur significant legal, accounting and other expenses. In addition, changing laws, regulations and standards relating to corporate governance and public disclosure, including regulations implemented by the SEC, the Public Company Accounting Oversight Board (PCAOB) and the NASDAQ Global Select Market, may increase our legal and financial compliance costs and/or make some activities more time consuming. These laws, regulations and standards are subject to varying interpretations and, as a result, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies. We intend to invest resources to comply with evolving laws, regulations and standards, and this investment may result in increased general and administrative expenses and a diversion of managements time and attention from revenue-generating activities to compliance activities. If we fail to comply with new laws, regulations and standards, regulatory authorities may initiate legal proceedings against us, and our business may be harmed.\nWe could be adversely affected by health care reform legislation.\nThird-party payers for medical products and services, including state, federal and foreign governments, are increasingly concerned about escalating health care costs and can indirectly affect the pricing or the relative attractiveness of our products by regulating the maximum amount of reimbursement they will provide for diagnostic testing services. Following years of increasing pressure, during 2010 the U.S. government enacted comprehensive health care reform with the enactment of the Patient Protection and Affordable Care Act, as amended by the Health Care and Education Reconciliation Act, which made changes that significantly impact the pharmaceutical and medical device industries. The Protecting Access to Medicare Act of 2014 requires applicable laboratories to report all private payor reimbursement rates and the volumes for each test they perform. The statute requires that Medicare establish reimbursement rates based on the weighted median of private insurance reimbursement rates effective January 1, 2017. The new Medicare rates would be subject to a maximum reduction of 10% a year for the initial three-year period and a maximum of 15% a year for the subsequent three-year period. There is no limit on the amount of potential rate increases. As a result, some of our customers in the U.S. may experience lower Medicare reimbursement rates for our products, which may adversely affect our business, financial condition and results of operations. We are seeing some effect on the reimbursement rates for our products. If reimbursement amounts for diagnostic testing services decrease further in the future, such decreases may reduce the amount that will be reimbursed to hospitals or physicians for such services and consequently, could place constraints on the levels of overall pricing, which could have a material effect on our net revenues and results of operations.\n- 21 -\nAdditional state and federal health care reform measures may be adopted in the future, any of which could have a material adverse effect on our ability to successfully commercialize our products and on our industry in general. For example, the U.S. government has in the past considered, is currently considering, and may in the future consider, health care policies and proposals intended to curb rising health care costs, including those that could significantly affect both private and public reimbursement for health care services. Further, state and local governments, as well as a number of foreign governments, are also considering or have adopted similar types of policies. Future significant changes in the health care system in the U.S. or elsewhere, and current uncertainty about whether and how changes may be implemented, could have a negative impact on the demand for our products. We are unable to predict whether health care policies, including policies stemming from legislation or regulations affecting our business, may be proposed or enacted in the future, what effect such policies would have on our business, or the effect that ongoing uncertainty about these matters will have on the purchasing decisions of our customers.\nEfforts to reduce the U.S. federal deficit could adversely affect our results of operations.\nAny reductions in government health care spending or research funding in an effort to reduce the U.S. federal deficit could result in reduced demand for our products or additional pricing pressure. Further, there is ongoing uncertainty regarding the federal budget and federal spending levels, including the possible impacts of a failure to increase the debt ceiling. Any U.S. government default on its debt could have broad macroeconomic effects that could, among other things, raise our borrowing costs. Any future shutdown of the federal government or failure to enact annual appropriations could also have a material adverse impact on our consolidated financial condition, and results of operations.\nGlobal market, political, environmental, and economic conditions, including those related to the financial markets, could have a material adverse effect on our operating results, financial condition, and liquidity.\nOur business is sensitive to changes in general economic, political and environmental conditions, both inside and outside the U.S. Conditions such as the following, among others, may create additional risk to our results of operations: (i) continuing uncertainties in the eurozone; (ii) the effects of climate change regulation; (iii) the global effects of the ongoing COVID-19 pandemic, including the Emergency Temporary Standard (ETS) COVID-19 workplace vaccination and testing mandate from the Occupational Safety and Health Administration (OSHA); (iv) unanticipated implications from the voluntary exit of the U.K. from the EU; and (v) uncertainties in China and emerging markets.\nInstability in the global economy and financial markets can adversely affect our business in several ways, including limiting our customers ability to obtain sufficient credit or pay for our products within the terms of sale. Competition could further intensify among the manufacturers and distributors with whom we compete for volume and market share, resulting in lower net revenue due to steeper discounts and product mix-down. In particular, if certain key or sole suppliers were to become capacity constrained or insolvent, it could result in a reduction or interruption in supplies or a significant increase in the price of supplies.\nThe U.K. left the EU on January 31, 2020. While all EU rules and laws continued to apply to the U.K. through the transition period, which ended December 31, 2020, the U.K. and the EU reached a free trade agreement on December 24, 2020, which was ratified on April 28, 2021 and went into effect on May 1, 2021. The agreement includes regulatory and customs cooperation mechanisms, as well as provisions supporting open and fair competition. Under the trade agreement, the U.K. is free to set its own trade policy and can negotiate with other countries that do not currently have free trade deals with the EU. Although the full impact of the trade agreement is uncertain, it is possible that the recent changes to the trading relationship between the U.K. and the EU due to the trade agreement could result in increased cost of goods imported into and exported from the U.K., which may decrease the profitability of our operations. Additional currency volatility could drive a weaker British pound, which could increase the cost of goods imported into the U.K. and may decrease the profitability of our operations. A weaker British pound versus the U.S. dollar may also cause local currency results of our operations to be translated into fewer U.S. dollars during a reporting period. Given the lack of comparable precedent, it is unclear what financial, trade, regulatory and legal implications the trade agreement will have on our business; however, Brexit and its related effects could potentially have an adverse impact on our consolidated financial condition, and results of operations.\n- 22 -\nWe depend on international net revenues, and our operating results may be adversely impacted by foreign currency, regulatory or other developments affecting international markets.\nWe sell products and services into approximately 70 countries. For fiscal 2022, approximately one-third of our consolidated net revenues were transacted in currencies other than the U.S. dollar. We are subject to the risks associated with fluctuations in the exchange rates for the Australian dollar, British pound, Canadian dollar, Chinese yuan, Euro, and New Israeli shekel. In addition, we have manufacturing operations, suppliers, and employees located outside the U.S. Since our growth strategy depends in part on our ability to further penetrate markets outside the U.S., we expect to continue to increase our revenue and presence outside the U.S., including in emerging markets.\nOur international business is subject to risks that are often encountered in non-U.S. operations, including:\ninterruption in the transportation of materials to us and finished goods to our customers, including conditions where recovery from natural disasters may be delayed due to country-specific infrastructure and resources;\ndifferences in terms of sale, including payment terms;\nlocal product preferences and product requirements;\nchanges in a countrys or regions political or economic condition, including with respect to safety and health issues;\ntrade protection measures and import or export licensing requirements;\nunexpected changes in laws or regulatory requirements, including unfavorable changes with respect to tax, trade or sanctions compliance matters;\nlimitations on ownership and on repatriation of earnings and cash;\ndifficulty in staffing and managing widespread operations;\ndiffering labor regulations;\ndifficulties in enforcing contract and property rights under local law;\ndifficulties in implementing restructuring actions on a timely or comprehensive basis; and\ndiffering protection of intellectual property.\nSuch risks may be more likely or pronounced in emerging markets, where our operations may be subject to greater uncertainty due to increased volatility associated with the developing nature of their economic, legal, and governmental systems.\nIf we are unable to successfully manage the risks associated with expanding our global business or to adequately manage operational fluctuations, it could adversely affect our business, consolidated financial condition, or results of operations.\nNew tariffs and other trade measures could adversely affect our operating results.\nThe current U.S. administration has expressed strong concerns about imports from countries that it perceives as engaging in unfair trade practices, and it is possible the administration could impose import duties or other restrictions on products, components or raw materials sourced from those countries, which may include countries from which we import components or raw materials. We are currently not aware of any new import duties imposed on our products. Any such new import duties or restrictions could have a material adverse effect on our business, results of operations or financial condition. Moreover, these new tariffs, or other changes in U.S. trade policy, could trigger retaliatory actions by affected countries. Certain foreign governments have instituted or are considering imposing trade sanctions on certain U.S. goods.\nOther foreign governments are considering the imposition of sanctions that will deny U.S. companies access to critical raw materials. A trade war of this nature or other governmental actions related to tariffs or international trade agreements or policies has the potential to adversely impact demand for our products, our costs, customers, manufacturers, suppliers and/or the economic environments in which we operate and, thus may adversely impact our businesses. In addition, there may be changes to existing trade agreements, like the North American Free Trade Agreement (NAFTA) and its anticipated successor agreement, the U.S.-Mexico-Canada Agreement (USMCA), which is still subject to approval by the U.S., Mexico and Canada, greater restrictions on free trade generally, and significant increases in tariffs on goods imported into the U.S., particularly tariffs on products manufactured in Mexico, among other possible changes. It remains unclear what the U.S. administration or foreign governments will or will not do with respect to tariffs, NAFTA, USMCA or other international trade agreements and policies. Any changes to NAFTA (or subsequent trade agreements) could impact our operations in countries where we manufacture or sell products, or source components or materials, which could adversely affect our business and results of operations.\n- 23 -\nIf product liability lawsuits are successfully brought against us, we may incur substantial liabilities and may have to limit or cease sales of our products.\nThe testing, manufacturing and marketing of medical diagnostic products involves an inherent risk of product liability claims. If we cannot successfully defend ourselves against product liability claims, we may incur substantial liabilities or be required to limit or cease sales of our products. We currently carry product liability insurance at a level we believe is commercially reasonable, although there is no assurance that it will be adequate to cover claims that may arise. In certain customer contracts, we indemnify third parties for certain product liability claims related to our products. These indemnification obligations may cause us to pay significant sums of money for claims that are covered by these indemnifications. In addition, a defect in the design or manufacture of our products could have a material adverse effect on our reputation in the industry and subject us to claims of liability for injury and otherwise. Any substantial underinsured loss resulting from such a claim could have a material adverse effect on our profitability, and the damage to our reputation in the industry could have a material adverse effect on our results of operations.\nRisks Related to Our Common Stock\nThe market price of our common stock may be volatile and fluctuate significantly, which could result in substantial losses for stockholders and subject us to litigation.\nThe market price of our common stock may be subject to significant fluctuations due to numerous factors, including but not limited to the risks described in this Risk Factors section. In addition, the stock market in general, the NASDAQ Global Market and the market for diagnostics companies in particular may experience a loss of investor confidence. A loss of investor confidence may result in extreme price and volume fluctuations in our common stock that are unrelated or disproportionate to the operating performance of our business, financial condition or results of operations. These broad market and industry factors may materially harm the market price of our common stock and expose us to securities class-action litigation. Class-action litigation, even if unsuccessful, could be costly to defend and divert managements attention and resources, which could further materially harm our consolidated financial condition and results of operations.\nOur business could be negatively impacted as a result of shareholder activism, an unsolicited takeover proposal or a proxy contest.\nIn recent years, proxy contests and other forms of stockholder activism have been directed against numerous public companies. If a proxy contest or an unsolicited takeover proposal is made with respect to us, we could incur significant costs in defending our company, which would have an adverse effect on our financial results. Shareholder activists may also seek to involve themselves in the governance, strategic direction and operations of our company. Such proposals may disrupt our business and divert the attention of our management and employees, and any perceived uncertainties as to our future direction resulting from such a situation could result in the loss of potential business opportunities, be exploited by our competitors, cause concern to our current or potential customers, and make it more difficult to attract and retain qualified personnel and business partners, all of which could adversely affect our business. In addition, actions of activist stockholders may cause significant fluctuations in our stock price based on temporary or speculative market perceptions or other factors that do not necessarily reflect the underlying fundamentals and prospects of our business.\nThe authority of our board to issue preferred stock and the effects of certain provisions of Ohio corporation law may discourage takeover bids.\nOur board of directors has the authority to issue up to one million shares of undesignated preferred stock and to determine the rights, preferences, privileges and restrictions, including voting rights, of such shares without any future vote or action by the shareholders. The issuance of preferred stock under certain circumstances could have the effect of delaying or preventing a change in control of our company. Ohio corporation law contains provisions that may discourage takeover bids for our company that have not been negotiated with the board of directors. Such provisions could limit the price that investors might be willing to pay in the future for shares of our common stock. In addition, sales of substantial amounts of shares in the public market could adversely affect the market price of our common stock and our ability to raise additional capital at a price favorable to us.\n- 24 -\nGeneral Risk Factors\nOne or more cybersecurity incidents may adversely impact our financial condition, results of operations and reputation.\nOur operations involve the use of multiple systems that process, store and transmit sensitive information about our customers, suppliers, employees, financial position, operating results and strategies. We face global cybersecurity risks and threats on a continual and ongoing basis, which include, but are not limited to, attempts to access systems and information, computer viruses, or denial-of-service attacks. These risks and threats range from uncoordinated individual attempts to sophisticated and targeted measures. While we are not aware of any material cyber-attacks or breaches of our systems to date, we have and continue to implement measures to safeguard our systems and information and mitigate potential risks, including employee training around phishing, malware and other cyber risks, but there is no assurance that such actions will be sufficient to prevent cyber-attacks or security breaches that manipulate or improperly use our systems, compromise sensitive information, destroy or corrupt data, or otherwise disrupt our operations. The occurrence of such events, including breaches of our security measures or those of our third-party service providers, could negatively impact our reputation and our competitive position and could result in litigation with third parties, regulatory action, loss of business due to disruption of operations and/or reputational damage, potential liability and increased remediation and protection costs, any of which could have a material adverse effect on our consolidated financial condition and results of operations. In an effort to mitigate the financial impact such an attack might have on the Company, we maintain cyber liability insurance coverage. However, such coverage may be insufficient to cover the full impact of a cyber-attack. Additionally, as cybersecurity risks become more sophisticated, we may need to increase our investments in security measures which could have a material adverse effect on our consolidated financial condition and results of operations.\nOur business could be negatively affected if we are unable to attract, hire and retain key personnel.\nOur future success depends on our continued ability to attract, hire and retain highly qualified personnel, including our executive officers and scientific, technical, sales and marketing employees, and their ability to manage growth successfully. If such key employees were to leave and we were unable to obtain adequate replacements, our results of operations could be adversely affected.\nOur bank credit agreement imposes restrictions with respect to our operations, which could adversely impact our business.\nOur bank credit agreement contains a number of financial covenants that require us to meet certain financial ratios and tests. If we fail to comply with the obligations in the credit agreement, we would be in default under the credit agreement. If an event of default is not cured or waived, it could result in acceleration of any indebtedness under our credit agreement, which could have a material adverse effect on our business. At September 30, 2022, we had $25,000 outstanding on a $200,000 bank revolving credit facility. ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNone. ITEM 2.\nPROPERTIES\nOur corporate offices are located in the Village of Newtown, a suburb of Cincinnati, Ohio. Our Newtown campus includes sites for diagnostic test manufacturing and distribution, immunoassay research and development and administrative functions. Our Newtown campus also includes a new facility where we are expanding and automating our Revogene diagnostic test device manufacturing. We also have diagnostic test manufacturing and distribution sites in Billerica, Massachusetts (blood-chemistry), Modiin, Israel (BreathID and BreathTek urea breath testing systems), and Quebec City, Quebec, Canada (Revogene diagnostic test device and instrument manufacturing). Our sites in Billerica, Modiin and Quebec City also include research and development functions. We also operate a Diagnostics sales and distribution center near Milan, Italy, and space in Manasquan, New Jersey to house BreathID technical service and repair functions.\n- 25 -\nOur Life Science operations are conducted in several facilities in Memphis, Tennessee; Boca Raton, Florida; North Brunswick, New Jersey; London, England; Luckenwalde, Germany; Sydney, Australia; and Beijing, China. Manufacturing of molecular reagents occurs in our London and Luckenwalde sites. Manufacturing of immunoassay reagents occurs in our Memphis and Boca Raton sites. Our sites in London and North Brunswick also include our primary research and development functions. ITEM 3.\nLEGAL PROCEEDINGS\nWe are a party to various litigation matters that we believe are in the normal course of business, including matters related to the previously discussed pending merger. Aside from the matters discussed below, the ultimate resolution of these matters is not expected to have a material adverse effect on our consolidated financial position, results of operations or cash flows, and no material provision has been made in the Consolidated Financial Statements for these matters.\nLegal Matter Relating to LeadCare Product Line\nOn April 17, 2018, the Companys wholly owned subsidiary Magellan received a subpoena from the U.S. Department of Justice (DOJ) regarding its LeadCare product line. The subpoena outlined documents to be produced, and the Company is cooperating with the DOJ in this matter. The Company maintains rigorous policies and procedures to promote compliance with applicable regulatory agencies and requirements and is working with the DOJ to promptly respond to the subpoena, including responding to additional information requests that have followed receipt of the subpoena in April 2018. The Company has executed tolling agreements to extend the statute of limitations. In March and April 2021, DOJ issued two subpoenas, both to former employees of Magellan, calling for witnesses to testify before a federal grand jury related to this matter. In September and October 2021, DOJ issued additional subpoenas to individuals seeking testimony and documents in connection with its ongoing investigation. It is the Companys understanding that multiple witnesses have testified before the federal grand jury and the DOJs investigation is ongoing. Discussions continue with the DOJ to explore resolution of the matter. As of September 30, 2022, in accordance with applicable accounting guidance, the Company believes a loss is probable in the DOJ LeadCare legal matter and has accrued $10,000 as an estimate of the cost to resolve the DOJ LeadCare legal matter, which is reflected in litigation and select legal costs within the Consolidated Statement of Operations for the year ended September 30, 2022. The Company cannot predict when the investigation will be resolved or the outcome of the investigation, and the ultimate resolution of the DOJ LeadCare legal matter may exceed the amount accrued at September 30, 2022 and could be material to the Company. Expense for attorneys fees related to this matter totaling $3,510, $2,803 and $2,035 is included within the Consolidated Statements of Operations for the years ended September 30, 2022, 2021 and 2020, respectively. See Lead Testing Matters beginning on page 32 within MD&A.\nLitigation Relating to the Merger\nOn September 9, 2022, a purported shareholder of the Company filed an action against the Company and the members of the Companys board of directors in the United States District Court for the Southern District of New York, captioned Warren v. Meridian Bioscience Inc., No. 1:22-cv-07727 (S.D.N.Y.). This was followed by four other substantively similar actions also brought by purported shareholders against the Company and the members of the Companys board of directors. These were Stein v. Meridian Bioscience Inc., No. 1:22-cv-07814 (S.D.N.Y.), filed on September 13, 2022; Coffman v. Meridian Bioscience Inc., No. 1:22-cv-07984 (S.D.N.Y.), filed on September 19, 2022; Morgan v. Meridian Bioscience Inc., No. 1:22-cv-08057 (S.D.N.Y.), filed on September 21, 2022; and Scott v. Meridian Bioscience Inc., No. 1:22-cv-08114 (S.D.N.Y.), filed on September 22, 2022. Plaintiffs in each case generally alleged that the proxy statements filed by Meridian with the U.S. Securities and Exchange Commission on August 25, 2022 and September 8, 2022 in connection with the Merger misrepresented and/or omitted certain material information and asserted violations of Sections 14(a) and 20(a) of the Securities Exchange Act of 1934. Among other relief, the plaintiffs in each case sought injunctive relief, including directing Meridian to disclose the allegedly omitted material information, enjoining the completion of the Merger, rescinding the Merger in the event it is consummated, and awarding rescissory damages. While Meridian believed that the actions were without merit, on September 30, 2022, Meridian voluntarily filed a Form 8-K that made certain supplemental disclosures related to the Merger. Thereafter, plaintiffs in all five actions voluntarily dismissed their complaints without prejudice.\n- 26 - ITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II. ITEM 5.\nMARKET FOR REGISTRANTS COMMON\nEQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock trades on the NASDAQ Global Select Market under the symbol VIVO.\nHolders of our Common Stock\nAs of September 30, 2022, there were approximately 490 holders of record and approximately 23,850 beneficial owners of our common shares.\nDividends\nDuring 2019, the Company suspended the payment of a quarterly cash dividend as part of the Companys regular evaluation of its capital allocation, with the action taken in order to deploy cash into new product development activities and to preserve capital resources and liquidity for general corporate purposes. Any declaration and amount of dividends will be determined by the board of directors in its discretion based upon its evaluation of earnings, cash flow requirements, business developments and opportunities, and any other factors the board of directors determines are relevant to its evaluation. At this time, we do not expect to resume paying cash dividends.\nStock Total Return Performance\nThe graph below compares the cumulative 5-Year total return realized by shareholders on Meridian Bioscience, Inc.s common stock relative to the cumulative total returns of the NASDAQ Composite index and a customized peer group comprised of the following ten companies:\nBio-Rad Laboratories, Inc., Bio-Techne Corporation, bioMerieux S.A., DiaSorin S.p.a., Hologic, Inc., Myriad Genetics, Inc., OraSure Technologies, Inc., Qiagen N.V., QuidelOrtho Corporation, and Trinity Biotech Plc.\nAn investment of $100 (with reinvestment of all dividends) is assumed to have been made in our common stock, in the index and in the peer group (including reinvestment of dividends) on September 30, 2017, and its relative performance is tracked through September 30, 2022.\n- 27 - ITEM 6.\nINTENTIONALLY OMITTED ITEM 7.\nMANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nRefer to Note About Forward-Looking Statements following the Index in front of this Form 10-K and Item 1A Risk Factors on pages 12 through 25 of this Annual Report.\nIn the discussion that follows, all dollar amounts are in thousands (both tables and text), except per share data.\n- 28 -\nThe purpose of Managements Discussion and Analysis is to provide an understanding of the financial condition, changes in consolidated financial condition and results of operations of Meridian Bioscience, Inc. (Meridian, the Company, We). This discussion should be read in conjunction with the Consolidated Financial Statements and notes. It should be noted that the terms revenue and/or revenues are utilized throughout the Managements Discussion and Analysis of Financial Condition and Results of Operations (MD&A) to indicate net revenue and/or net revenues. In addition, throughout the MD&A, we refer to certain product tradenames and trademarks, which are protected under applicable intellectual property laws and are our property. Solely for convenience, these tradenames and trademarks are referred to without the ® or ™ symbols, but such references are not intended to indicate in any way that we will not assert, to the fullest extent of the law, our rights to these tradenames and trademarks.\nReportable Segments\nOur reportable segments are Diagnostics and Life Science. The Diagnostics segment consists of manufacturing operations for infectious disease products in Cincinnati, Ohio; Quebec City, Canada; and Modiin, Israel; and manufacturing operations for blood chemistry products in Billerica, Massachusetts (near Boston). These diagnostic test products are sold and distributed in the countries comprising North and Latin America (the Americas); Europe, Middle East and Africa (EMEA); and other countries outside of the Americas and EMEA (rest of the world, or ROW). The Life Science segment consists of manufacturing operations in Memphis, Tennessee; Boca Raton, Florida; London, England; and Luckenwalde, Germany, and the sale and distribution of bulk antigens, antibodies, immunoassay blocking reagents, specialized Polymerase Chain Reaction (PCR) master mixes, isothermal mixes, enzymes, nucleotides, and bioresearch reagents domestically and abroad, including a sales and business development facility, with outsourced distribution capabilities, in Beijing, China to further pursue growing revenue opportunities in Asia.\nRecent Developments\nAgreement and Plan of Merger\nOn July 7, 2022, the Company entered into an Agreement and Plan of Merger (as it may be amended, supplemented or otherwise modified from time to time, the Merger Agreement) with SD Biosensor, Inc., a corporation with limited liability organized under the laws of the Republic of Korea (SDB), Columbus Holding Company, a Delaware corporation (Parent), and Madeira Acquisition Corp., an Ohio corporation and a direct wholly owned subsidiary of Parent (Merger Sub). Meridian is informed that SJL Partners, LLC (SJL) is currently the sole shareholder of Parent, and SDB together with SJL will be the sole shareholders of Parent as of the closing of the Merger. Pursuant to the Merger Agreement, Merger Sub will merge with and into Meridian (the Merger), with Meridian surviving the Merger as a direct wholly owned subsidiary of Parent.\nAt the effective time of the proposed Merger (the Effective Time), each share of common stock, no par value per share, of the Company issued and outstanding as of immediately prior to the Effective Time (other than dissenting shares or shares of the Companys common stock held by the Company as treasury stock or owned by SDB, Merger Sub or any subsidiary of the Company or SDB) will be cancelled and cease to exist and automatically convert into the right to receive cash in an amount equal to $34.00, without interest (the Merger Consideration).\nConsummation of the Merger is subject to customary closing conditions, including, without limitation: (i) the absence of certain legal impediments; and (ii) the condition that no Specified Outcome, as such term is defined in the Merger Agreement, related to the DOJ LeadCare legal matter (which is described in the section entitled Legal Matter Relating to LeadCare Product Line of Item 3. Legal Proceedings) has occurred or is reasonably likely to occur.\nOn November 21, 2022, the parties received clearance from the Committee on Foreign Investment in the United States with respect to the Merger and the transactions contemplated by the Merger Agreement.\nThe Merger Agreement contains certain termination rights for the Company and SDB. In addition to the foregoing termination right, and subject to certain limitations: (i) the Company or SDB may terminate the Merger Agreement if the Merger is not consummated by January 6, 2023; and (ii) the Company and SDB may mutually agree to terminate the Merger Agreement.\nThe foregoing description of the Merger Agreement and the transactions contemplated thereby does not purport to be complete and is subject to, and qualified in its entirety by reference to, the full text of the Merger Agreement, which is attached as an exhibit to our Current Report on Form 8-K filed with the SEC on July 7, 2022.\n- 29 -\nThe Company incurred transaction related costs of approximately $6,800 in the year ended September 30, 2022 related to the Merger, which is recorded in acquisition and transaction related costs in the Consolidated Statements of Operations.\nImpact of COVID-19 Pandemic\nStarting in the latter half of fiscal 2020 and continuing to the date of this filing, the ongoing COVID-19 pandemic has had both positive and negative effects on our business.\nOur Life Science segments products were well positioned to respond to in vitro device (IVD) manufacturers increased demand for reagents used in the manufacture of molecular, rapid antigen and serology tests. Consequently, through the end of the second quarter of fiscal 2022, our Life Science segment consistently delivered significantly higher levels of net revenues and operating income than those achieved prior to the COVID-19 pandemic, with the peak to date in such levels occurring during the second quarter of fiscal 2022. This revenue peak has been followed by a significant decrease in such net revenue levels during the fiscal 2022 third and fourth quarters, reflecting the softening in demand for COVID-19 related reagents during the second half of our fiscal year.\nOur Diagnostics segment, on the other hand, has generally been negatively impacted by health systems increased focus on COVID-19 testing over traditional infectious disease testing. The impacts of the COVID-19 pandemic are most dramatically evident in the 34% year-over-year decline in revenues from respiratory illness assays in fiscal 2021, following flat year-over-year revenue levels experienced in fiscal 2020. Reflecting what we believe to be a continuation of a return to pre-pandemic activity levels, during fiscal 2022, net revenues from our respiratory illness assays were 51% higher than fiscal 2021, a marked improvement over the aforementioned 34% decline in fiscal 2021.\nDespite these recent COVID-19 pandemic related trends, due to the many uncertainties surrounding the COVID-19 pandemic, we can provide no assurances with respect to our views of the longevity or severity of the positive or negative impacts to our consolidated financial condition of the ongoing COVID-19 pandemic.\nEmployee Safety\nWhile the majority of our employee base has returned to working on-site at our facilities, we have implemented a hybrid work-from-home program for certain personnel whose on-site presence has been deemed to be non-essential. We also continue to utilize enhanced cleaning and sanitizing procedures, and provide additional personal hygiene supplies at all our sites. We have implemented policies for employees to adhere to Centers for Disease Control and Prevention (CDC) guidelines on social distancing, and similar guidelines by authorities outside the U.S. To date, we have been able to manufacture and distribute products globally, and all our sites have continued to operate with little, if any, impact on shipments to customers. As the COVID-19 pandemic continues, along with continuing governmental restrictions which vary by locale and jurisdiction, there is an increased risk of employee absenteeism, which could materially impact our operations at one or more sites. To date, the steps we have taken, including our work-from-home processes, have not materially impacted the Companys financial reporting systems, internal controls over financial reporting or disclosure controls.\nSupply Chains\nSupply chains supporting our products have generally remained intact, providing access to sufficient inventory of the key materials needed for manufacturing. While we have experienced extended lead times for certain select raw materials, delays and allocations for raw materials have to date been limited and have not had a material impact on our results of operations. From time to time, we identify alternative suppliers to address the risk of a current suppliers inability to deliver materials in volumes sufficient to meet our manufacturing needs; or we may choose to purchase certain materials in bulk volumes where we have supply chain scarcity concerns. It remains possible that we may experience some sort of interruption to our supply chains, and such an interruption could materially affect our ability to timely manufacture and distribute our products and unfavorably impact our results of operations.\nSince the second half of fiscal 2021, we have experienced input cost inflation, including materials, labor and transportation costs. Pricing actions and supply chain productivity initiatives have mitigated and are expected to continue to mitigate some of these inflationary pressures, but we may not be successful in fully offsetting these incremental costs, which could have an impact on the Companys results of operations and cash flows in the future.\n- 30 -\nProduct Development and Clinical Trials\nOur Diagnostics segments new product development programs are continuing to progress at a slower pace than normal, due in part to the prevalence of certain infectious diseases having been lower than normal during the COVID-19 pandemic. These matters continue to impact our timing for filing applications for product clearances with the U.S. Food and Drug Administration (FDA), as well as related timing of FDA clearances of such filings. Additionally, the ongoing COVID-19 pandemic has slowed and could continue to slow down our efforts to expand our product portfolio, impacting the speed with which we are able to bring additional products to market.\nProduct Demand\nOur Life Science segment manufactures, markets and sells a number of molecular and immunological reagents to IVD customers, including those who are making both molecular and immunoassay COVID-19 tests. While there have been quarter-to-quarter fluctuations in demand throughout the COVID-19 pandemic, from late in the second quarter of fiscal 2020 through the second quarter of fiscal 2022, we generally experienced unprecedented demand for certain of our molecular reagents (e.g., ribonucleic acid (RNA) master mixes and nucleotides). While we expect demand to continue to exceed pre-COVID-19 pandemic levels, the significant decline in COVID-19 related demand experienced during the third and fourth quarters of fiscal 2022 is expected to continue into fiscal 2023. These expectations will certainly be impacted by infection rates and the responses to such levels of infection varying by country based on their individual COVID-19 case statistics, potential seasonality of infection rates and vaccine programs. Furthermore, a significant number of our Life Science segment customers now use our molecular reagents in multiple tests, including non-COVID-19 related tests. This development makes it increasingly difficult to accurately estimate the portion of molecular reagent sales related specifically to COVID-19. As a result, we are no longer reporting the portion of Life Science segment net revenues related to COVID-19. Such net revenues were identified and reported throughout fiscal 2021 and fiscal 2020, totaling approximately $111,900 and $71,500, respectively.\nOur Diagnostics segment manufactures, markets and sells a number of molecular, immunoassay, blood chemistry and urea breath tests for various infectious diseases and blood-lead levels. Sales volumes for a number of these assays have been adversely affected by the COVID-19 pandemic over the past two fiscal years, as such assays are often used in non-critical care settings; however, we have seen indications of a return to more normal pre-pandemic levels. The COVID-19 pandemic also has depressed instrument orders and placements for our BreathID, Curian and Revogene platforms. Order activity for our Revogene platform was affected by the delay in obtaining emergency use authorization (EUA) for our SARS-CoV-2 assay, as customers took a wait and see approach throughout our entire EUA application process. We received the EUA on November 9, 2021, but did not begin to ship product at that time, as our SARS-CoV-2 assay required enhancement to detect the Omicron variants of the COVID-19 infection. We completed validation of these changes during the second quarter of fiscal 2022 and submitted the required information to the FDA. The FDA also requested the completion of additional clinical studies, which we completed and submitted. On July 28, 2022 notification was received from the FDA that it has re-authorized the EUA for the Revogene SARS-CoV-2 assay. As such, we began shipping this product in October 2022. Despite the situation encountered with our EUA application for the SARS-CoV-2 assay, and the delay in shipment due to the Omicron variant related enhancements, we proceeded with the process of increasing our capacity to produce these tests, as well as other tests on the Revogene platform, at our facilities in Quebec and Cincinnati. Specifically, we have: (i) added a second production line at our Quebec manufacturing facility; (ii) installed a production line in a leased facility near our corporate headquarters in Cincinnati; and (iii) are in the process of installing an additional production line in the Cincinnati leased facility. With a gross cost of approximately $17,700 through September 30, 2022, we expect these expansion efforts to be completed during calendar 2022 at a total gross cost of approximately $22,600, which is expected to be partially offset by the monies received under the National Institutes of Health Rapid Acceleration of Diagnostics (RADx) initiative grant entered into on February 1, 2021, and as amended on January 25, 2022, $2,750 of which had been received and used to offset the above gross cost as of September 30, 2022 (see Note 14, National Institutes of Health Contracts of the Consolidated Financial Statements for further discussion).\n- 31 -\nLead Testing Matters\nOn September 1, 2021, the Companys wholly owned subsidiary Magellan announced the expansion of the Class I voluntary recall of its LeadCare test kits for the detection of lead in blood, which it had initiated in May 2021 after identifying an issue in certain manufactured lots of its LeadCare test kits. As a result of the identified issue, impacted test kit lots could potentially underestimate blood lead levels when processing patient blood samples. Although it was initially believed that the root cause of the issue related to the plastic containers used for the treatment reagent, additional studies have indicated that the root cause related to the third-party-sourced cardboard trays that held the treatment reagent containers. Upon correction of the identified supplier issue, shipment of product resumed during the second quarter of fiscal 2022. The Company continues to work closely with the FDA in its execution of the recall activities, which has included Magellan notifying customers and distributors affected by the recall and providing instructions for the return of impacted test kits. Of the $5,100 estimated and accrued as of September 30, 2021 to cover the estimated costs of the recall, it was estimated at September 30, 2022 that the remaining costs of the recall exceeded the amount accrued, and as a result, an adjustment was made to the product recall reserve. The effect of this adjustment is reflected in product recall costs (adjustment) within the Consolidated Statement of Operations for the year ended September 30, 2022, and results in approximately $430 of remaining accrued product recall costs reflected in the Consolidated Balance Sheet as of September 30, 2022. Anticipated recall-related costs primarily include temporary labor costs, product replacement and/or refund costs, mailing/shipping costs, attorneys fees and other miscellaneous costs.\nAs described in Item 3. Legal Proceedings, on April 17, 2018, the Companys wholly owned subsidiary Magellan received a subpoena from the U.S. Department of Justice (DOJ) regarding its LeadCare product line. The subpoena outlined documents to be produced, and the Company is cooperating with the DOJ in this matter. The Company maintains rigorous policies and procedures to promote compliance with applicable regulatory agencies and requirements and is working with the DOJ to promptly respond to the subpoena, including responding to additional information requests that have followed receipt of the subpoena in April 2018. The Company has executed tolling agreements to extend the statute of limitations. In March and April 2021, DOJ issued two subpoenas, both to former employees of Magellan, calling for witnesses to testify before a federal grand jury related to this matter. In September and October 2021, DOJ issued additional subpoenas to individuals seeking testimony and documents in connection with its ongoing investigation. It is the Companys understanding that multiple witnesses have testified before the federal grand jury and the DOJs investigation is ongoing. Discussions continue with the DOJ to explore resolution of the matter. As of September 30, 2022, in accordance with applicable accounting guidance, the Company believes a loss is probable in the DOJ LeadCare legal matter and has accrued $10,000 as an estimate of the cost to resolve the DOJ LeadCare legal matter, which is reflected in litigation and select legal costs within the Consolidated Statement of Operations for the year ended September 30, 2022. The Company cannot predict when the investigation will be resolved or the outcome of the investigation, and the ultimate resolution of the DOJ LeadCare legal matter may exceed the amount accrued at September 30, 2022 and could be material to the Company. Expense for attorneys fees related to this matter totaling $3,510, $2,803 and $2,035 is included within the Consolidated Statements of Operations for the years ended September 30, 2022, 2021 and 2020, respectively.\nMagellan submitted 510(k) applications in December 2018, seeking to reinstate venous blood sample-types for its LeadCare II, LeadCare Plus and LeadCare Ultra testing systems. In the second fiscal quarter of 2019, the FDA informed Magellan that each of these 510(k) applications had been put on Additional Information hold. On July 15, 2019, we provided responses to the FDAs requests for Additional Information. These 510(k) applications have since expired and are no longer under FDA review. Further, while Magellans LeadCare testing systems remain cleared for marketing by the FDA and permitted for use with capillary blood samples, the FDA advised that it has commissioned a third-party study of the Companys LeadCare testing systems using both venous and capillary blood samples. According to the FDA, the results of the field study will be used in conjunction with other information to determine whether further action by the FDA or the CDC is necessary to protect the public health. The Company intends to fully cooperate with the FDA or CDC on any follow-up based on the third-party study.\n- 32 -\nDuring October 2019, the FDA performed a follow-up inspection of Magellans manufacturing facility. The FDA issued five Form FDA 483 observations. On March 18, 2020, we participated in a regulatory meeting with the FDA at the FDAs request to further discuss the Form FDA 483 observations and our remediation efforts. Since the inspection, we have submitted a number of written responses to the FDA regarding the five Form FDA 483 observations issued in the October 2019 inspection, and have worked diligently to execute a remediation plan. During October 2020, the FDA issued Establishment Inspection Reports which closed out the inspections from June 2017 and October 2019 under 21 C.F.R.20.64(d)(3).\nDuring June 2021, the FDA performed an inspection of Magellans manufacturing facility. As a result of this inspection, the FDA issued one Form 483 observation. On August 3, 2021, FDA sent Magellan a close-out letter for the Warning Letter that FDA issued to Magellan on October 23, 2017. FDAs close-out letter notified Magellan that FDA has completed an evaluation of Magellans corrective actions in response to FDAs Warning Letter, and based on FDAs evaluation, Magellan has addressed the issues identified in the Warning Letter. FDAs close-out letter also stated that future FDA inspections of Magellan and regulatory activities will further assess the adequacy and sustainability of Magellans corrections.\nResults of Operations\nFourth Quarter\nNet earnings for the fourth quarter of fiscal 2022 decreased 14% to $5,705, or $0.13 per diluted share, from net earnings for the fourth quarter of fiscal 2021 of $6,657, or $0.15 per diluted share. The level of net earnings in the fourth quarter of fiscal 2022 results primarily from the decline in net revenues and operating income in our Life Science segment, stemming from the continued softening in demand for COVID-19 related reagents during the quarter. As it relates to our Life Science segment net revenues, a significant number of our Life Science segment customers now use our molecular reagents in multiple tests, including non-COVID-19 related tests. This development makes it increasingly difficult to accurately estimate the portion of molecular reagent sales related specifically to COVID-19. As a result, we are no longer reporting the portion of Life Science segment net revenues related to COVID-19. Such net revenues were identified and reported throughout fiscal 2021 and totaled approximately $23,300 in the fourth quarter of fiscal 2021. By contrast, the fourth quarter of fiscal 2021 was adversely affected by approximately $5,600, or $0.10 per diluted share, of LeadCare product recall expenses and a $4,596, or $0.08 per diluted share, upward adjustment to the fair value of acquisition consideration related to the acquisition of the business of GenePOC, Inc. (GenePOC) (i.e., incremental expense), offsetting the impact of higher net revenues and resulting gross profit.\nConsolidated net revenues for the fourth quarter of fiscal 2022 totaled $65,675, a decrease of 14% compared to the fourth quarter of fiscal 2021.\nNet revenues from the Diagnostics segment for the fourth quarter of fiscal 2022 increased 14% to $39,187, compared to the fourth quarter of fiscal 2021, comprised of a 22% increase in non-molecular assay products, partially offset by a 27% decrease in molecular assay products. Non-molecular assay product sales include the addition of sales of the BreathTek product, which was acquired July 31, 2021. The fourth quarter of fiscal 2022 represents the sixth consecutive quarter our Diagnostics segment has shown positive revenue growth versus the same quarter in the prior fiscal year. Our Diagnostics segment generated a $122 operating loss for the fourth quarter of fiscal 2022, compared to an operating loss of $11,680 in the fourth quarter of fiscal 2021, largely due to the fiscal 2021 fourth quarter including $5,600 of LeadCare product recall expenses and $4,596 upward adjustment to the fair value of acquisition consideration related to the acquisition of the business of GenePOC (i.e., incremental expense) (see Note 3, Fair Value Measurements of the Consolidated Financial Statements).\nWith a 53% decrease in net revenues from molecular reagents products and an 8% decrease in net revenues from immunological reagents products, net revenues for our Life Science segment decreased 37% to $26,488 during the fourth quarter of fiscal 2022 compared to the fourth quarter of fiscal 2021. Our Life Science segment generated $10,064 of operating income, or a margin of 38%, for the fourth quarter of fiscal 2022, a decrease of $13,118 from $23,182, or a margin of 55%, achieved in the fourth quarter of fiscal 2021, primarily due to the decrease in net revenues and associated gross profit margins, resulting in large part from the immunological reagent products representing a higher percentage of net revenues, as described in the respective sections below.\n- 33 -\nFiscal Year\nNet earnings for fiscal 2022 decreased 41% to $42,459, or $0.96 per diluted share, from net earnings for fiscal 2021 of $71,407, or $1.62 per diluted share. The level of net earnings in fiscal 2022 reflects primarily: (i) the overall increase in operating expenses described in the Operating Expenses section below; and (ii) the decrease in gross profit margins resulting from immunological reagent products representing a higher percentage of both Life Science segment and total consolidated net revenues in the fiscal 2022 period, compared to higher margin molecular reagent products in the fiscal 2021 period. As previously noted, we are no longer reporting the portion of Life Science segment net revenues related to COVID-19, noting that such net revenues totaled approximately $111,900 in fiscal 2021.\nConsolidated net revenues for fiscal 2022 totaled $333,018, an increase of 5% compared to fiscal 2021.\nDiagnostics segment net revenues increased 22% to $155,903 in fiscal 2022, comprised of a 27% increase in non-molecular assay products including the addition of sales of the BreathTek product, which was acquired July 31, 2021, partially offset by a 5% decrease in molecular assay products. Our Diagnostics segment generated operating income of $2,982 in fiscal 2022, compared to an operating loss of $7,280 in fiscal 2021. This year over year improvement in operating income resulted primarily from the combined effects of: (i) the Diagnostics segments increase in net revenues; and (ii) fiscal 2021 including $5,600 of LeadCare product recall expenses. These factors contributing to the improvement in operating margin were partially offset by the effect of lower gross profit margins and increase in operating expenses described in the respective sections below.\nWith a 30% decrease in net revenues from molecular reagents products and a 43% increase in net revenues from immunological reagents products, including COVID-19 related products, net revenues for our Life Science segment decreased 7% to $177,115 during fiscal 2022 compared to fiscal 2021. Our Life Science segment generated $86,040 of operating income in fiscal 2022, a decrease of $28,974 from fiscal 2021, primarily due to the decrease in net revenues and gross profit margins, resulting from the aforementioned mix of products sold, and the increase in operating expenses, as described in the respective sections below.\nREVENUE OVERVIEW\nBelow are analyses of the Companys net revenues, by reportable segment, provided for each of the following:\n- By Geographic Region\n- By Product Platform/Type\nRevenue Overview - By Reportable Segment & Geographic Region\nRevenues for the Diagnostics segment, in the normal course of business, may be affected from year to year by buying patterns of major distributors and reference laboratories, seasonality and severity of seasonal diseases and outbreaks (including the ongoing COVID-19 pandemic), and foreign currency exchange rates. Revenues for the Life Science segment, in the normal course of business, may be affected from year to year by buying patterns of major IVD manufacturing customers, severity of disease outbreaks (specifically the ongoing COVID-19 pandemic), and foreign currency exchange rates.\nSee Note 2, Revenue Recognition of the Consolidated Financial Statements for detailed revenue disaggregation information.\nFollowing is a discussion of the net revenues generated by these product platforms/types and/or disease states:\nDiagnostics Segment Products\nThe Diagnostics segments overall 22% growth in net revenues during fiscal 2022 primarily results from the combined effects of the following:\nVolume growth in the gastrointestinal product family, including the benefit of a full year of net revenues from sales of the BreathTek product, acquired in late July 2021 (total increase in gastrointestinal product revenue of 27% in fiscal 2022, including approximately $23,100 of net revenues from BreathTek);\n- 34 -\nVolume growth in sales of respiratory illness products, comprised of tests for Group A Strep, Mycoplasma pneumonia, Influenza, and Pertussis, among others, reflecting an increase in the testing for these illnesses compared to fiscal 2021 in the midst of the COVID-19 pandemic (total increase in respiratory illness products of 51% in fiscal 2022);\nVolume declines from sales of blood chemistry products due to the ongoing LeadCare product recall, which commenced in May 2021, with shipment of product resuming in the second quarter of fiscal 2022 (approximately $1,200 decrease in net revenues in fiscal 2022, compared to fiscal 2021); and\nOngoing pricing pressure on our H. pylori stool antigen tests, which contributed approximately $2,200 of unfavorable price variance from customers in the U.S.\nLife Science Segment Products\nDuring fiscal 2022, net revenues for the Life Science segment decreased 7% from fiscal 2021. While the level of net revenues during fiscal 2022 reflects the significant decline in demand for COVID-19 related reagents during the last half of fiscal year 2022, such level of net revenues significantly outpaced the net revenues generated in fiscal 2020 (partial pandemic) and fiscal 2019 (pre-pandemic) as follows:\nFiscal 2020\nIncreased 34% in total; 17% for molecular reagents and 58% for immunological reagents\nFiscal 2019\nIncreased 175% in total; 295% for molecular reagents and 108% for immunological reagents\nForeign Currency\nFluctuations in foreign currency exchange rates in fiscal 2022 compared to fiscal 2021 had an approximate $5,200 unfavorable impact on fiscal 2022 consolidated net revenues; $1,700 within the Diagnostics segment and $3,500 within the Life Science segment. This compares to year-to-year currency exchange rates having an approximate $9,200 favorable impact on consolidated net revenues in fiscal 2021; $1,300 within the Diagnostics segment and $7,900 within the Life Science segment.\nSignificant Customers\nRevenue concentrations related to certain customers within our Diagnostics and Life Science segments are set forth in Note 15, Reportable Segments and Major Concentration Data of the Consolidated Financial Statements.\nGross Profit:\n2022 vs. 2021\nInc (Dec)\nGross Profit\n$ 188,356\n$ 201,148\n(6 )%\nGross Profit Margin\n%\n%\n-6 points\nOverall gross profit margins during fiscal 2022 have been unfavorably impacted by a decline in net revenues from our Life Science segments molecular reagent products, which are some of our highest margin products. During fiscal 2022, approximately 28% of consolidated net revenues related to sales of molecular reagent products, compared to approximately 41% during fiscal 2021, which included the peak of the COVID-19 pandemic.\nAdditionally, overall gross profit margins in fiscal 2022 have been unfavorably impacted in our Diagnostics segment by the previously discussed LeadCare product recall (see Lead Testing Matters above) and production capacity ramp-up costs at our Cincinnati and Quebec Revogene manufacturing facilities.\n- 35 -\nOperating Expenses-Segment Detail and Corporate\nResearch &\nDevelopment\nSelling &\nMarketing\nGeneral &\nAdministrative\nOther (1)\nTotal Operating\nExpenses\nFiscal 2021:\nDiagnostics\n$ 21,406\n$ 21,430\n$ 24,055\n$ 5,079\n$ 71,970\nLife Science\n2,505\n5,350\n13,501\n-\n21,356\nCorporate\n-\n-\n11,985\n2,803\n14,788\nTotal 2021 Expenses\n$ 23,911\n$ 26,780\n$ 49,541\n$ 7,882\n$ 108,114\nFiscal 2022:\nDiagnostics\n$ 21,424\n$ 24,268\n$ 28,563\n$\n$ 75,014\nLife Science\n2,911\n7,005\n14,176\n24,244\nCorporate\n-\n-\n14,409\n20,298\n34,707\nTotal 2022 Expenses\n$ 24,335\n$ 31,273\n$ 57,148\n$ 21,209\n$ 133,965\n(1) Product recall expenses are included within the Diagnostics segments fiscal 2021 other expenses, while the Diagnostics segments fiscal 2022 other expenses include an adjustment to the accrual for such product recall costs.\nOperating expenses in fiscal 2022 increased $25,851 to $133,965. Major components of this increase were as follows:\nIncreased Selling & Marketing costs in both the Diagnostics and Life Science segments, primarily reflecting the effects of filling certain open positions and the easing of certain travel and meeting restrictions imposed during the prior years in connection with the COVID-19 pandemic;\nIncreased General & Administrative costs, primarily reflecting the combined effects of: (i) increased purchase accounting amortization expense; and (ii) additional investment in incentive compensation tied to the Companys financial performance;\nA $6,548 increase in acquisition and transaction related costs, primarily within Corporate and related to the previously discussed pending merger (see Agreement and Plan of Merger above); and\nA $10,707 increase in litigation and select legal costs, reflected within Corporate and primarily related to the previously discussed LeadCare legal matter (see Lead Testing Matters above).\nOffsetting these increases was a $5,946 total net decrease in product recall costs within our Diagnostics segment, primarily related to the LeadCare product recall initiated in fiscal 2021.\nOperating Income\nOperating income decreased 42% in fiscal 2022, following a 52% increase in fiscal 2021, as a result of the factors discussed above.\nOther Expense\nOther expense, net primarily includes: (i) interest costs on the Companys long-term borrowings and contingent grant obligations due to the Israel Innovation Authority; (ii) grant income under the RADx initiative (fiscal 2021; see Note 14, National Institutes of Health Contracts of the Consolidated Financial Statements); (iii) a $935 gain on the termination of interest rate swap contracts (fiscal 2022); and (iv) net currency gains and losses. Interest costs related to the revolving credit facility with a commercial bank were $1,057 and $1,420 in fiscal 2022 and 2021, respectively. The varying levels of interest costs on the revolving credit facility reflect the following approximate levels of average debt outstanding, as detailed in Note 10, Bank Credit Arrangements of the Consolidated Financial Statements: (i) fiscal 2022 - $39,233; and (ii) fiscal 2021 - $56,505.\n- 36 -\nIncome Taxes\nThe effective rate for income taxes was 22% and 21% for fiscal 2022 and 2021, respectively. The increase in effective tax rates primarily results from the anticipated non-deductibility of the previously discussed DOJ LeadCare legal matter (see Lead Testing Matters above), partially offset by various tax effects associated with the Companys currently unremitted earnings of international subsidiaries.\nImpact of Inflation\nTo the extent feasible, we have consistently followed the practice of reviewing our prices to consider the impacts of inflation on salaries and fringe benefits for employees, the cost of purchased materials and services, and transportation costs. Inflation and changing prices did not have a material adverse impact on our gross margin, net revenues or operating income in fiscal 2022 or fiscal 2021.\nLiquidity and Capital Resources:\nLiquidity\nOur cash flow and financing requirements are determined by analyses of operating and capital spending budgets and debt service. We have historically maintained a credit facility to augment working capital requirements and to respond quickly to acquisition opportunities.\nWe have an investment policy that guides the holdings of our investment portfolio, which presently consists of bank savings accounts and institutional money market funds. Our objectives in managing the investment portfolio are to: (i) preserve capital; (ii) provide sufficient liquidity to meet working capital requirements and fund strategic objectives such as acquisitions; and (iii) capture a market rate of return commensurate with market conditions and our policys investment eligibility criteria. As we look forward, we will continue to manage the holdings of our investment portfolio with preservation of capital being the primary objective.\nWe intend to continue to fund our working capital requirements from current cash flows from operating activities and cash on hand, and such sources are anticipated to be adequate to fund working capital requirements, capital expenditures and debt service during the next twelve months. However, if needed, we also have an additional source of liquidity through the amount remaining available on our $200,000 bank revolving credit facility, which totaled $175,000 as of September 30, 2022. The Company also maintains a shelf registration statement on file with the SEC. Our liquidity needs may change if overall economic conditions worsen and/or liquidity and credit within the financial markets tightens for an extended period, and such conditions impact the collectability of our customer accounts receivable, impact credit terms with our vendors, or disrupt the supply of raw materials and services.\nAs of September 30, 2022, our cash and cash equivalents balance was $81,453, an increase of $31,682 compared to September 30, 2021. This net increase primarily results from the combined net effects of: (i) generating $82,361 of cash flow from operations, an increase of 23% over fiscal 2021; (ii) using cash to pay down $35,000 on the revolving credit facility; (iii) using cash to acquire property, plant and equipment ($7,365 net of RADx grant monies received); and (iv) acquiring EUPROTEIN, Inc. ($3,750) (see Note 4, Business Combinations of the Consolidated Financial Statements). In addition, the net balance of cash and cash equivalents was reduced by approximately $5,300 as of September 30, 2022, as a result of the movement in foreign currency exchange rates, specifically the British pound and Euro, since September 30, 2021.\nConsidering these factors, our balance of cash and cash equivalents on hand exceeded our total debt (defined as bank debt, government grant obligations and obligations related to acquisitions) by approximately $49,700 at September 30, 2022.\nCapital Resources\nAs described in Note 10, Bank Credit Arrangements of the Consolidated Financial Statements, the Company maintains a $200,000 credit facility, which is secured by substantially all our U.S. assets and includes certain restrictive financial covenants. As of September 30, 2022, the Company was in compliance with all covenants. The Company also maintains a shelf registration statement on file with the SEC.\n- 37 -\nOur capital expenditures totaled $8,615 for fiscal 2022, $1,250 of which was offset by receipts under the RADx grant initiative (see Note 14, National Institutes of Health Contracts of the Consolidated Financial Statements), and which largely related to expanding manufacturing capacity. During fiscal 2023, our capital expenditures are estimated to total approximately $10,000, comprised of approximately $6,500 and $3,500 in the Diagnostics and Life Science segments, respectively. Such expenditures may be funded with cash and cash equivalents on hand, operating cash flows, and/or availability under the $200,000 revolving credit facility discussed above.\nContractual Obligations:\nAmong the Companys contractual obligations as of September 30, 2022 were the following (reflected along with the Note to the Consolidated Financial Statements in which the obligation is detailed):\n(i) operating leases (Note 9, Leasing Arrangements)\n(ii) the revolving credit facility (Note 10, Bank Credit Arrangements)\n(iii) uncertain income tax positions (Note 11, Income Taxes)\n(iv) contingent government grant obligations (Note 13, Contingent Obligations and Non-Current Liabilities)\nThe Companys additional contractual obligations and their related due dates were as follows as of September 30, 2022:\nTotal\nLess than 1\nYear\n1-3 Years\n4-5 Years\nMore than\n5 Years\nPurchase obligations (1)\n$ 41,291\n$ 40,182\n$ 1,104\n$\n$ -\nAcquisition price holdback (2)\n1,500\n1,000\n-\n-\nTotal\n$ 42,791\n$ 41,182\n$ 1,604\n$\n$ -\n(1) Purchase obligations relate primarily to outstanding purchase orders for machinery and equipment, inventory, including instruments, service items, and research and development activities. These contractual commitments are not in excess of expected production requirements over the next twelve months.\n(2) Pursuant to the purchase agreements related to the April 30, 2022 and July 31, 2021 acquisitions of EUPROTEIN Inc. and BreathTek, respectively, Meridians remaining consideration to be paid is comprised solely of purchase price holdbacks totaling $500 for EUPROTEIN Inc. and $1,000 for BreathTek.\nOther Commitments and Off-Balance Sheet Arrangements:\nLicense Agreements\nMeridian has entered into various license agreements that require payment of royalties based on a specified percentage of sales of related products, with such percentages generally ranging from approximately 3% to 10%. During fiscal 2022, royalty expense totaled approximately $2,300, with 40% and 60% of such expense relating to our Diagnostics and Life Science segments, respectively. This compares to a total of approximately $5,200 of royalty expense in fiscal 2021, with 25% and 75% relating to our Diagnostics and Life Science segments, respectively. Meridian expects that payments under these agreements will amount to approximately $700 in fiscal 2023, with the decrease from fiscal 2022 largely resulting from the last of the licensed patents applicable to the Alethia product line having expired during fiscal 2022.\nOff-Balance Sheet Arrangements\nWe utilize foreign currency exchange forward contracts to limit exposure to volatility in foreign currency gains and losses related to financial assets denominated in other than the holding subsidiarys functional currency. These contracts are generally settled within a 30-day time frame and are not formally designated or accounted for as accounting hedges. We also utilize interest rate swap agreements to limit exposure to volatility in the LIBOR interest rate in connection with the revolving credit facility. The interest rate swap agreements are designated and accounted for as accounting hedges (see Note 3, Fair Value Measurements of the Consolidated Financial Statements). Aside from these instruments, we do not utilize special-purpose financing vehicles or have any material undisclosed off-balance sheet arrangements.\n- 38 -\nMarket Risk Exposure:\nForeign Currency Risk\nWe have market risk exposure related to foreign currency transactions from our operations outside the U.S., as well as certain suppliers to our domestic businesses located outside the U.S. The foreign currencies where we have market risk exposure are the Australian dollar, British pound, Canadian dollar, Chinese yuan, Euro, and New Israeli shekel. Assessing foreign currency exposures is a component of our overall ongoing risk management process, with such currency risks managed as we deem appropriate.\nConcentration of Customers/Products Risk\nOur Diagnostics segments net revenues from sales to three customers were 29% and 33% of the Diagnostics segments total net revenues for fiscal 2022 and 2021, respectively, or 13% of consolidated net revenues in each fiscal year. Additionally, our three major Diagnostics segment product families - gastrointestinal, respiratory illnesses and blood chemistry - accounted for 82% and 80% of our Diagnostics segments net revenues during fiscal 2022 and 2021, respectively, or 39% and 32% of each years consolidated net revenues.\nOur Life Science segments net revenues from sales to three diagnostics manufacturing customers were 31% and 20% of the Life Science segments total net revenues for fiscal 2022 and 2021, respectively, or 17% and 12% of consolidated net revenues in each fiscal year.\nCritical Accounting Policies:\nThe Consolidated Financial Statements included in this Form 10-K have been prepared in accordance with U.S. generally accepted accounting principles. Such accounting principles require management to make judgments about estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses and related disclosures. Listed below are the accounting policies management believes to be critical to understanding the Consolidated Financial Statements, along with reference to location of the policy discussion within the Consolidated Financial Statements. The listed policies are considered critical due to the fact that application of such polices requires the use of significant estimates and assumptions, and the carrying values of related assets and liabilities are material.\nAccounting Policy\nLocation\nWithin Consolidated\nFinancial Statements\nExamples of Key Estimate Assumptions\nDOJ LeadCare Legal Matter\nNote 5\nEstimate of loss contingency\nRevenue Recognition\nNote 1(i)\nDistributor price adjustments and fee accruals\nIncome Taxes\nNote 1(l) and Note 11\nUncertain positions and state apportionment factors\nRecent Accounting Pronouncements:\nA description of accounting pronouncements recently adopted by the Company, as well as accounting pronouncements issued but not yet adopted by the Company, are set forth in Note 1(s), Summary of Significant Accounting Policies- Recent Accounting Pronouncements of the Consolidated Financial Statements. ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nSee Capital Resources and Market Risk Exposure above within Item 7, beginning on page 37.\n- 39 -\nhttp://fasb.org/us-gaap/2022#OtherAssetsNoncurrenthttp://fasb.org/us-gaap/2022#OtherLiabilitiesNoncurrent ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to Consolidated Financial Statements\nManagements Report on Internal Control over Financial Reporting\nReports of Independent Registered Public Accounting Firms (PCAOB ID #42 for the years ended September 30, 2022 and 2021) (PCAOB ID #248 for the year ended September 30, 2020)\nConsolidated Statements of Operations for the years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows for the years ended September 30, 2022, 2021 and 2020\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the years ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\nSchedule No. II - Valuation and Qualifying Accounts for the years ended September 30, 2022, 2021 and 2020\nAll other supplemental schedules are omitted due to the absence of conditions under which they are required or because the information is shown in the Consolidated Financial Statements or Notes thereto.\n- 40 -\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f).\nThe Companys internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting can only provide reasonable assurance and may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of our management, including the Chief Executive Officer and the Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2022, based on the framework and criteria in the 2013 Internal Control - Integrated Framework,\nissued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on managements evaluation and those criteria, the Company concluded that its system of internal control over financial reporting was effective as of September 30, 2022.\nThe Companys independent registered public accounting firm has issued an attestation report on the registrants internal control over financial reporting.\n/s/ Jack Kenny\n/s/ Andrew S. Kitzmiller\nJack Kenny\nAndrew S. Kitzmiller\nChief Executive Officer\nExecutive Vice President and\nNovember 22, 2022\nChief Financial Officer\nNovember 22, 2022\n- 41 -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of Meridian Bioscience, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Meridian Bioscience, Inc. (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for years then ended, and the related notes and consolidated financial statement schedule listed in the Index to Annual Report on Form 10-K at Item 15 (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 22, 2022, expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nLeadCare legal matter\nDescription of the Matters\nAs discussed in Note 5, at September 30, 2022, the Company has accrued $10.0 million as an estimate of the cost to settle the LeadCare legal matter with the U.S. Department of Justice (DOJ). As background, the Companys wholly owned subsidiary Magellan Biosciences, Inc. (Magellan) received a subpoena from the DOJ regarding its LeadCare product line. The subpoena outlined documents to be produced, and the Company is and has been cooperating with the DOJs investigation in this matter and discussions continue with the DOJ to explore resolution of the matter. As of September 30, 2022, the Company believes it is probable that it had incurred a loss related to the resolution of the LeadCare legal matter and has accrued for its estimate of the cost to settle the LeadCare legal matter with the DOJ.\n- 42 -\nAuditing managements accounting for and disclosure of the estimated loss contingency from the LeadCare legal matter is especially challenging as evaluating the probability and amount of loss is subjective and requires judgment due in part to the uncertain nature of when the LeadCare legal matter will be resolved or the outcome of the investigation, and the ultimate resolution of the LeadCare legal matter.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the identification, evaluation and disclosure of loss contingencies, including the Companys assessment and measurement of the estimate of the probable cost and liability.\nTo test the assessment of the probability of incurrence of a loss and the estimated loss, to the extent it was reasonably estimable, we performed audit procedures that included, among others, reviewing related correspondence with external legal counsel and the DOJ, reviewing legal counsel confirmation letters, assessing scope and cost estimates the Company used in determination for its estimate of the cost to settle the LeadCare legal matter, and searching for other available information that might indicate new or contrary facts related to the matter.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2020.\nCincinnati, Ohio\nNovember 22, 2022\n- 43 -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nMeridian Bioscience, Inc.\nOpinion on the financial statements\nWe have audited the consolidated balance sheet of Meridian Bioscience, Inc. (an Ohio corporation) and subsidiaries (the Company) as of September 30, 2020 (not presented herein), and the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for the year then ended and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2020, and the results of its operations and its cash flows for the year ended September 30, 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ GRANT THORNTON LLP\nWe served as the Companys auditor from 2005 to 2020.\nCincinnati, Ohio\nNovember 23, 2020\n- 44 -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of Meridian Bioscience, Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited Meridian Bioscience, Inc.s (the Company) internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2022 and 2021, the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for years then ended, and the related notes and consolidated financial statement schedule listed in the Index to Annual Report on Form 10-K at Item 15 and our report dated November 22, 2022, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting (Managements Report). Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nCincinnati, Ohio\nNovember 22, 2022\n- 45 -\nCONSOLIDATED STATEMENTS OF OPERATIONS (in thousands, except per share data)\nMeridian Bioscience, Inc. and Subsidiaries\nFor the Year Ended September 30,\nNet Revenues\n$\n333,018\n$ 317,896\n$ 253,667\nCost of Sales\n144,662\n116,748\n97,419\nGross Profit\n188,356\n201,148\n156,248\nOperating Expenses:\nResearch and development\n24,335\n23,911\n23,729\nSelling and marketing\n31,273\n26,780\n26,486\nGeneral and administrative\n57,148\n49,541\n44,345\nProduct recall costs (adjustment)\n(350\n)\n5,596\n-\nAcquisition and transaction related costs\n6,940\n3,890\nLitigation and select legal costs\n13,510\n2,803\n2,080\nRestructuring costs\n1,109\n-\nChange in fair value of acquisition consideration and settlement\n-\n(909 )\n(6,293 )\nTotal Operating Expenses\n133,965\n108,114\n94,924\nOperating Income\n54,391\n93,034\n61,324\nOther Income (Expense):\nInterest income\n-\nInterest expense\n(1,189\n)\n(1,878 )\n(2,632 )\nRADx grant income\n-\n1,000\n-\nOther, net\n1,098\n(1,705 )\nTotal Other Expense, Net\n(74\n)\n(2,583 )\n(2,031 )\nEarnings Before Income Taxes\n54,317\n90,451\n59,293\nIncome Tax Provision\n11,858\n19,044\n13,107\nNet Earnings\n$\n42,459\n$ 71,407\n$ 46,186\nEarnings Per Share Data:\nBasic earnings per common share\n$\n0.97\n$ 1.65\n$ 1.08\nDiluted earnings per common share\n$\n0.96\n$ 1.62\n$ 1.07\nCommon shares used for basic earnings per common share\n43,583\n43,259\n42,855\nEffect of dilutive stock options and restricted share units\nCommon shares used for diluted earnings per common share\n44,375\n44,012\n43,174\nAnti-Dilutive Securities:\nCommon share options and restricted share units\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n- 46\n-\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (in thousands)\nMeridian Bioscience, Inc. and Subsidiaries\nFor the Year Ended September 30,\nNet Earnings\n$\n42,459\n$ 71,407\n$ 46,186\nOther Comprehensive Income (Loss):\nForeign currency translation adjustment\n(11,929\n)\n1,780\n3,884\nRecognition of gains on cash flow hedges\n(935\n)\n(154 )\n(308 )\nUnrealized gain (loss) on cash flow hedge\n2,560\n(713 )\nIncome taxes related to items of other comprehensive income (loss)\n(398\n)\n(78 )\nOther Comprehensive Income (Loss), Net of Tax\n(10,702\n)\n2,058\n3,115\nComprehensive Income\n$\n31,757\n$ 73,465\n$ 49,301\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n- 47\n-\nCONSOLIDATED STATEMENTS OF CASH FLOWS (in thousands)\nMeridian Bioscience, Inc. and Subsidiaries\nFor the Year Ended September 30,\nCash Flows From Operating Activities\nNet earnings\n$\n42,459\n$ 71,407\n$ 46,186\nNon-cash items included in net earnings:\nDepreciation of property, plant and equipment\n6,599\n6,510\n5,823\nAmortization of intangible assets\n9,912\n8,776\n7,744\nStock compensation expense\n6,900\n4,156\n3,802\nDeferred income taxes\n(1,101\n)\n(3,835 )\nEstimated litigation costs\n10,000\n-\n-\nChange in fair value of acquisition consideration and settlement\n-\n(909 )\n(6,293 )\nChange in the following, net of acquisitions:\nAccounts receivable\n4,564\n(12,766 )\n(971 )\nInventories\n5,223\n(7,800 )\n(18,977 )\nPrepaid expenses and other current assets\n(1,553\n)\n(3,711 )\n(153 )\nAccounts payable and accrued expenses\n1,038\n6,346\n7,248\nIncome taxes payable\n(329 )\n1,435\nOther, net\n(2,245\n)\n(980 )\n1,372\nNet cash provided by operating activities\n82,361\n66,865\n47,976\nCash Flows From Investing Activities\nPurchase of property, plant and equipment\n(8,615\n)\n(18,312 )\n(3,299 )\nRADx grant proceeds offsetting cost of equipment\n1,250\n1,500\n-\nAcquisitions, net of cash acquired and holdback\n(3,750\n)\n(18,585 )\n(51,299 )\nPayment of acquisition consideration holdback\n-\n(5,000 )\n-\nNet cash used in investing activities\n(11,115\n)\n(40,397 )\n(54,598 )\nCash Flows From Financing Activities\nPayment on revolving credit facility\n(35,000\n)\n(18,824 )\n(57,000 )\nProceeds from revolving credit facility\n-\n10,000\n50,000\nPayment of acquisition consideration\n-\n(20,000 )\n-\nPayment on government grant obligations\n-\n(5,297 )\n-\nPayment of debt issuance costs\n(404\n)\n-\n(116 )\nProceeds from exercise of stock options\n2,450\n3,052\n3,559\nEmployee taxes paid upon stock option exercises and net share settlement of restricted share units\n(1,349\n)\n-\n-\nNet cash used in financing activities\n(34,303\n)\n(31,069 )\n(3,557 )\nEffect of Exchange Rate Changes on Cash and Cash Equivalents\n(5,261\n)\n1,296\nNet Increase (Decrease) in Cash and Cash Equivalents\n31,682\n(3,743 )\n(8,883 )\nCash and Cash Equivalents at Beginning of Period\n49,771\n53,514\n62,397\nCash and Cash Equivalents at End of Period\n$\n81,453\n$ 49,771\n$ 53,514\nSupplemental Consolidated Cash Flow Information:\nSee Notes 1(g), 3, 9, 10 and 11.\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n- 48\n-\nCONSOLIDATED BALANCE SHEETS (in thousands)\nMeridian Bioscience, Inc. and Subsidiaries\nAs of September 30,\nAssets\nCurrent Assets:\nCash and cash equivalents\n$\n81,453\n$ 49,771\nAccounts receivable, less allowances of $1,325 and $1,078, respectively\n47,235\n53,568\nInventories, net\n67,814\n76,842\nPrepaid expenses and other current assets\n14,095\n12,626\nTotal Current Assets\n210,597\n192,807\nProperty, Plant and Equipment:\nLand\nBuildings and improvements\n32,983\n32,765\nMachinery, equipment and furniture\n79,517\n78,410\nConstruction in progress\n10,589\n9,991\nSubtotal\n124,057\n122,155\nLess: accumulated depreciation and amortization\n79,199\n78,941\nNet Property, Plant and Equipment\n44,858\n43,214\nOther Assets:\nGoodwill\n116,302\n114,668\nOther intangible assets, net\n74,131\n84,151\nRight-of-use assets, net\n5,850\n5,786\nDeferred income taxes\n9,278\n8,731\nOther assets\n2,081\nTotal Other Assets\n207,642\n213,701\nTotal Assets\n$\n463,097\n$ 449,722\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n- 49\n-\nCONSOLIDATED BALANCE SHEETS (in thousands)\nMeridian Bioscience, Inc. and Subsidiaries\nAs of September 30,\nLiabilities and Shareholders Equity\nCurrent Liabilities:\nAccounts payable\n$\n17,759\n$ 11,701\nAccrued employee compensation costs\n17,682\n16,853\nAccrued estimated litigation costs\n10,000\n-\nAccrued product recall costs\n1,157\n5,100\nCurrent operating lease obligations\n1,830\n1,990\nCurrent government grant obligations\nOther accrued expenses\n5,048\n7,027\nIncome taxes payable\n3,808\n3,848\nTotal Current Liabilities\n57,951\n47,157\nNon-Current Liabilities:\nPost-employment benefits\n1,673\n2,253\nLong-term operating lease obligations\n4,127\n3,932\nLong-term debt\n25,000\n60,000\nGovernment grant obligations\n4,620\n5,176\nLong-term income taxes payable\nDeferred income taxes\n1,055\nOther non-current liabilities\n1,378\nTotal Non-Current Liabilities\n37,085\n74,263\nCommitments and Contingencies\nShareholders Equity:\nPreferred stock, no par value; 1,000,000 shares authorized; none issued\n-\n-\nCommon shares, no par value; 71,000,000 shares authorized, 43,755,188 and 43,361,898 issued, respectively\n-\n-\nAdditional paid-in capital\n155,664\n147,403\nTreasury stock, at cost, 9,655 shares\n(259\n)\n-\nRetained earnings\n223,160\n180,701\nAccumulated other comprehensive income (loss)\n(10,504\n)\nTotal Shareholders Equity\n368,061\n328,302\nTotal Liabilities and Shareholders Equity\n$\n463,097\n$ 449,722\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n- 50\n-\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY (in thousands, except per share data)\nMeridian Bioscience, Inc. and Subsidiaries\nCommon\nShares\nAdditional\nPaid-In\nCapital\nTreasury Stock\nRetained\nEarnings\nAccumulated\nOther Comp.\nIncome (Loss)\nTotal\nShareholders\nEquity\nSh.\nAmt.\nBalance at September 30, 2019\n42,712\n$ 132,834\n-\n$ -\n$ 63,108\n$ (4,975 )\n$ 190,967\nConversion of restricted share units and exercise of stock options\n3,559\n-\n-\n-\n-\n3,559\nStock compensation expense\n-\n3,802\n-\n-\n-\n-\n3,802\nNet earnings\n-\n-\n-\n-\n46,186\n-\n46,186\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n3,884\n3,884\nHedging activity, net of tax\n-\n-\n-\n-\n-\n(769 )\n(769 )\nBalance at September 30, 2020\n43,069\n$ 140,195\n-\n$ -\n$ 109,294\n$ (1,860 )\n$ 247,629\nConversion of restricted share units and exercise of stock options\n3,052\n-\n-\n-\n-\n3,052\nStock compensation expense\n-\n4,156\n-\n-\n-\n-\n4,156\nNet earnings\n-\n-\n-\n-\n71,407\n-\n71,407\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n1,780\n1,780\nHedging activity, net of tax\n-\n-\n-\n-\n-\nBalance at September 30, 2021\n43,362\n$ 147,403\n-\n$ -\n$ 180,701\n$\n$ 328,302\nConversion of restricted share units and exercise of stock options\n1,361\n(10 )\n(259 )\n-\n-\n1,102\nStock compensation expense\n-\n6,900\n-\n-\n-\n-\n6,900\nNet earnings\n-\n-\n-\n-\n42,459\n-\n42,459\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n(11,929 )\n(11,929 )\nHedging activity, net of tax\n-\n-\n-\n-\n-\n1,227\n1,227\nBalance at September 30, 2022\n43,755\n$ 155,664\n(10 )\n$ (259 )\n$ 223,160\n$ (10,504 )\n$ 368,061\nThe accompanying notes are an integral part of these Consolidated Financial Statements.\n- 51\n-\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nMeridian Bioscience, Inc. and Subsidiaries\n(in thousands, except per share data)\n(1)\nSummary of Significant Accounting Policies\n(a)\nBusiness Description\n- Meridian is a fully-integrated life science company whose principal businesses are: (i) the development, manufacture, sale and distribution of diagnostic testing systems and kits, primarily for certain gastrointestinal and respiratory infectious diseases, and elevated blood lead levels; and (ii) the manufacture and distribution of bulk antigens, antibodies, immunoassay blocking reagents, specialized Polymerase Chain Reaction (PCR) master mixes, isothermal mixes, enzymes, nucleotides, and bioresearch reagents used by other diagnostic manufacturers and researchers.\nOur reportable segments are Diagnostics and Life Science. The Diagnostics segment consists of: (i) manufacturing operations for infectious disease products in Cincinnati, Ohio; Quebec City, Canada; and Modiin, Israel; (ii) manufacturing operations for blood chemistry products in Billerica, Massachusetts (near Boston); and (iii) the sale and distribution of diagnostics products domestically and abroad. This segments products are used by hospitals, reference labs and physician offices to detect infectious diseases and elevated lead levels in blood.\nThe Life Science segment consists of: (i) manufacturing operations in Memphis, Tennessee; Boca Raton, Florida; London, England; and Luckenwalde, Germany; and (ii) the sale and distribution of bulk antigens, antibodies, PCR/qPCR reagents, isothermal reagents, nucleotides, and bioresearch reagents domestically and abroad, including a sales and business development facility, with outsourced distribution capabilities, in Beijing, China. This segments products are used by manufacturers and researchers in a variety of applications (e.g., in vitro medical device manufacturing, microRNA detection, next-generation sequencing, plant genotyping, and mutation detection, among others).\n(b)\nPrinciples of Consolidation and Basis of Presentation -\nThe Consolidated Financial Statements include the accounts of Meridian Bioscience, Inc. and its subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation. Unless the context requires otherwise, references to Meridian, we, us, our or our company refer to Meridian Bioscience, Inc. and its subsidiaries.\nIt should be noted that the terms revenue and/or revenues are utilized throughout these notes to the Consolidated Financial Statements to indicate net revenue and/or net revenues.\n(c)\nUse of Estimates -\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the Consolidated Financial Statements, and the reported amounts of net revenues and expenses during the reporting period. The Companys results are affected by economic, political, legislative, regulatory and legal actions. Economic conditions, such as recessionary trends, inflation, supply chain disruptions, interest and monetary exchange rates, government fiscal policies, government policies surrounding the containment of the ongoing COVID-19 pandemic, and changes in prices of raw materials, can have a significant effect on the results of operations. Actual results could differ from the Companys estimates.\n(d)\nForeign Currency Translation\n- Assets and liabilities of foreign operations are translated using year-end exchange rates with gains or losses resulting from translation included as a separate component of accumulated other comprehensive income (loss). Net revenues and expenses are translated using exchange rates prevailing during the year. We also recognize foreign currency transaction gains and losses on certain assets and liabilities that are denominated in the Australian dollar, British pound, Canadian dollar, Chinese yuan, Euro, and New Israeli shekel currencies. These gains and losses are included in other expense, net in the Consolidated Statements of Operations.\n- 52\n-\n(e)\nCash and Cash Equivalents\n- We consider short-term investments with original maturities of 90 days or less to be cash equivalents, including institutional money market funds. At times our investments of cash and cash equivalents with various high credit quality financial institutions may be in excess of the Federal Deposit Insurance Corporation (FDIC) insurance limit.\n(f)\nInventories\n- Inventories are stated at the lower of cost or net realizable value. Cost is determined on a first-in, first-out (FIFO) basis. Diagnostic testing instruments are carried in inventory until they are sold outright or placed with a customer under the customer reagent rental program, at which time they are transferred to property, plant and equipment.\nWe establish reserves against cost for excess and obsolete materials, finished goods whose shelf life may expire before sale to customers, and other identified exposures. The Company specifically considered the impact of the ongoing COVID-19 pandemic, specifically the demand for COVID-19 related products, on its inventories at September 30, 2022 and 2021. Such reserves were $6,132 and $4,997 at September 30, 2022 and 2021, respectively. We estimate these reserves based on assumptions about future demand and market conditions. If actual demand and market conditions were to be less favorable than such estimates, additional inventory write-downs would be required and recorded in the period known.\n(g)\nProperty, Plant and Equipment\n- Property, plant and equipment are stated at cost. Upon retirement or other disposition, the cost and related accumulated depreciation are removed from the accounts and the resulting gain or loss is reflected in net earnings. Maintenance and repairs are expensed as incurred. Depreciation is computed on the straight-line method in amounts sufficient to write-off the cost over the estimated useful lives, generally as follows:\nBuildings and improvements - 18 to 40 years\nLeasehold improvements - life of the lease\nMachinery, equipment and furniture - 3 to 10 years\nComputer equipment and software - 3 to 5 years\nInstruments under customer reagent rental arrangements - 5 years\nSupplemental Cash Flow Information (Non-Cash Capital Expenditures)\nAdditions to property, plant and equipment for which cash remained unpaid totaled $793, $416 and $236 at September 30, 2022, 2021 and 2020, respectively.\n(h)\nIntangible Assets\n- Goodwill is subject to an annual impairment review (or more frequently if impairment indicators arise) at the reporting unit level, which is performed as of the first day of the fourth fiscal quarter (July 1).\nAt both September 30, 2022 and 2021, we had two reporting units (Diagnostics and Life Science), both of which contained goodwill. We review our reporting unit structure annually, or more frequently if facts and circumstances warrant. Goodwill is considered impaired if the carrying value of the reporting unit exceeds its fair value. We have no intangible assets with indefinite lives other than goodwill.\nDuring fiscal 2022, the annual impairment review of the Companys goodwill consisted of qualitative assessments for each of our Diagnostics and Life Science reporting units. A qualitative assessment is first performed to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value using qualitative indicators. In the event that the reporting unit does not pass the qualitative assessment, the reporting units carrying value is compared to its fair value, with fair value of the reporting unit estimated using market value and discounted cash flow approaches. Both our Diagnostics and Life Science reporting units satisfied the qualitative assessments as of July 1, 2022, and no impairment was recognized.\nThe annual goodwill impairment assessment of the Companys goodwill as of July 1, 2021, consisted of quantitative assessments for each of our Diagnostics and Life Science reporting units. The quantitative assessments determined fair value via both market (comparable company) and income (discounted cash flows) approaches. Based upon these approaches, the fair value of each reporting unit exceeded its carrying value; therefore, each of the Diagnostics and Life Science reporting units satisfied the quantitative assessment at July 1, 2021. The impact of the ongoing COVID-19 pandemic has had varying impacts on the Diagnostics and Life Science reporting units, and specifically an adverse impact on the Diagnostics reporting unit. However, even in light of the COVID-19 pandemic, the estimated fair value of the Diagnostics reporting unit, as calculated at July 1, 2021, was over 50% greater than its carrying value.\n- 53\n-\nLong-lived assets, excluding goodwill, are reviewed for impairment when events or circumstances indicate that such assets may not be recoverable at their carrying value. Whether an event or circumstance triggers an impairment is determined by comparing an estimate of the assets future undiscounted cash flows to its carrying value. If impairment has occurred, it is measured by a fair-value based calculation.\nOur ability to recover the carrying value of our identifiable intangible assets is dependent upon the future cash flows of the related assets. We make judgments and assumptions regarding future cash flows, including net revenues levels, gross profit margins, operating expense levels, working capital levels, and capital expenditures. With respect to identifiable intangible assets and fixed assets, we also make judgments and assumptions regarding useful lives.\nWe consider the following factors in evaluating events and circumstances for possible impairment: (i) significant under-performance relative to historical or projected operating results; (ii) negative industry trends; (iii) net revenues levels of specific groups of products (related to specific identifiable intangibles); (iv) changes in overall business strategies; and (v) other factors. If actual cash flows are less favorable than projections, this could trigger impairment of identifiable intangible assets and other long-lived assets. No triggering events have been identified by the Company for the years ended September 30, 2022, 2021 and 2020.\n(i)\nRevenue Recognition and Accounts Receivable\n-\nRevenue Recognition Policies\nProduct Sales\nRevenue from contracts with customers is recognized in an amount that reflects the consideration we expect to receive in exchange for products when obligations under such contracts are satisfied. Revenue is generally recognized at a point-in-time when products are shipped, and control has passed to the customer. Such contracts can include various combinations of products that are generally accounted for as distinct performance obligations.\nRevenue is reduced in the period of sale for fees paid to distributors, which are inseparable from the distributors purchase of our product and for which we receive no goods or services in return. Revenue is reduced at the date of sale for product price adjustments payable to certain distributors under local contracts. Management estimates accruals for distributor price adjustments based on local contract terms, sales data provided by distributors, historical statistics, current trends, and other factors. Changes to the accruals are recorded in the period that they become known. Such accruals are netted against accounts receivable.\nShipping and handling costs incurred after control of the product is transferred to our customers are treated as fulfillment costs and not a separate performance obligation.\nOur payment terms differ by jurisdiction and customer, but payment is generally required in a term ranging from 30 to 90 days from the date of shipment or satisfaction of the performance obligation. Accounts receivable are recorded in the Consolidated Balance Sheets at invoiced amounts less provisions for distributor price adjustments under local contracts and doubtful accounts. The allowance for doubtful accounts represents our estimate of probable credit losses and is based on historical write-off experience and known conditions that would likely lead to non-payment. Customer invoices are charged off against the allowance for doubtful accounts when we believe it is probable that the invoices will not be paid. The Company specifically considered the impact of the ongoing COVID-19 pandemic on its accounts receivable and determined there was no material impact on existing accounts receivable at September 30, 2022 or 2021.\nPractical Expedients and Exemptions\nRevenue is recognized net of any taxes collected from customers (sales tax, value added tax, etc.), which are subsequently remitted to government authorities.\n- 54\n-\nOur diagnostic assay products are generally not subject to a customer right of return except for product recall events under the rules and regulations of the U.S. Food and Drug Administration (FDA) or equivalent agencies outside the U.S. In this circumstance, the costs to replace or refund affected products would be accrued at the time a loss was probable and estimable.\nWe expense as incurred the costs to obtain contracts, as the amortization period would be one year or less. These costs, recorded within selling and marketing expense, include our internal sales force compensation programs and certain partner sales incentive programs, as we have determined that annual compensation is commensurate with annual selling activities.\nReagent Rental Arrangements\nCertain of our Diagnostics segments product platforms require the use of instruments for the tests to be processed. In many cases, a customer is given use of the instrument provided they continue purchasing the associated tests, also referred to as consumables or reagents. If a customer stops purchasing the consumables, the instrument must be returned to us. Such arrangements are common practice in the diagnostics industry and are referred to as Reagent Rentals. Reagent Rentals may also include instrument related services such as a limited replacement warranty, training and installation. We concluded that the use of the instrument and related services (collectively known as lease elements) are not within the scope of Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers\nbut rather ASC 842, Leases\n. Accordingly, we first allocate the transaction price between the lease elements and the non-lease elements based on estimates of relative standalone selling prices. Lease revenue is derived solely from the sale of consumables and is therefore recognized monthly as earned, which coincides with the transfer of control of the non-lease elements.\nFor the portion of the transaction price allocated to the non-lease elements, which are principally the test kits, the related revenue is recognized at a point-in-time when control transfers.\n(j)\nFair Value Measurements\n- Certain assets and liabilities are recorded at fair value in accordance with ASC 820, Fair Value Measurements and Disclosures\n. ASC 820 defines fair value as the price that would be received to sell an asset or would be paid to transfer a liability in an orderly transaction between market participants at the measurement date. ASC 820 establishes a three-level hierarchy, which prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy level assigned to each asset and liability is based on the assessment of the transparency and reliability of the inputs used in the valuation of such items at the measurement date based on the lowest level of input that is significant to the fair value measurement. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements).\nAssets and liabilities measured and reported at fair value are classified and disclosed in one of the following categories based on inputs:\nLevel 1\nUnadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities\nLevel 2\nQuoted prices in markets that are not active and financial instruments for which all significant inputs are observable, either directly or indirectly\nLevel 3\nPrices or valuations that require inputs that are both significant to the fair value measurement and unobservable\n(k)\nResearch and Development Costs\n- Research and development costs are charged to expense as incurred. Research and development costs include, among other things, salaries and wages for research scientists, materials and supplies used in the development of new products, costs for development of instrumentation equipment, costs for clinical trials, costs of regulatory compliance activities, and costs for facilities and equipment.\n- 55\n-\n(l)\nIncome Taxes\n- The provision for income taxes includes federal, foreign, state and local income taxes currently payable and those deferred because of temporary differences between income for financial reporting and income for tax purposes. We prepare estimates of permanent and temporary differences between income for financial reporting purposes and income for tax purposes. These differences are adjusted to actual upon filing of our tax returns, typically occurring in the third and fourth quarters of the current fiscal year for the preceding fiscal years estimates.\nThe Company has certain deferred income tax assets in select jurisdictions. The recoverability of these deferred income tax assets is assessed periodically, and valuation allowances are recognized if it is determined that it is more likely than not that the benefits will not be realized. When performing the assessment, the Company considers the ability to carryback losses to prior tax periods, future taxable income, the reversal of existing temporary differences, and tax planning strategies.\nWe account for uncertain tax positions using a benefit recognition model with a two-step approach: (i) a more-likely-than-not recognition criterion; and (ii) a measurement attribute that measures the position as the largest amount of tax benefit that is greater than 50% likely of being ultimately realized upon ultimate settlement. If it is not more likely than not that the benefit will be sustained on its technical merits, no benefit is recorded. We recognize accrued interest related to unrecognized tax benefits as a portion of our income tax provision in the Consolidated Statements of Operations.\n(m)\nStock-Based Compensation\n- We recognize compensation expense for all share-based awards made to employees based upon the fair value of the share-based award on the date of the grant.\n(n)\nComprehensive Income (Loss)\n- Comprehensive income (loss) represents the net change in shareholders equity during a period from sources other than transactions with shareholders. As reflected in the Consolidated Statements of Comprehensive Income, our comprehensive income is comprised of net earnings, foreign currency translation, recognition of gains on previous cash flow hedges, unrealized gain (loss) on current cash flow hedge, and the income taxes thereon.\nThe primary component of accumulated comprehensive income (loss) is cumulative currency translation adjustments, which totaled ($11,794) and $135 at September 30, 2022 and 2021, respectively.\n(o)\nShipping and Handling Costs\n- Shipping and handling costs invoiced to customers are included in net revenues. Costs to distribute products to customers, including freight costs, warehousing costs, and other shipping and handling activities are included in cost of sales.\n(p)\nNon-Income Government-Assessed Taxes\n- We classify all non-income, government-assessed taxes (sales, use and value-added) collected from customers and remitted by us to appropriate revenue authorities, on a net basis (excluded from net revenues) in the Consolidated Statements of Operations.\n(q)\nAcquisition\ns\n- Assets and liabilities associated with business acquisitions are recorded at fair value, using the acquisition method of accounting. The Company allocates the purchase price of acquisitions based upon the fair value of each component, which may be derived from observable or unobservable inputs and assumptions. The Company may utilize third-party valuation specialists to assist us in this allocation. Initial purchase price allocations are preliminary and subject to revision within the measurement period, generally not to exceed one year from the date of acquisition.\n(r)\nOther expense, net\n- Other expense, net, consists principally of transaction currency gains or losses. When a transaction is denominated in a currency other than the subsidiarys functional currency, the Company recognizes a transaction gain or loss in other expense, net within the Consolidated Statements of Operations when the transaction is settled.\nFrom time to time, the Company enters into short-term (generally 30 days or less) foreign currency forward contracts to manage its exposure to certain foreign currencies. These foreign currency forward contracts are not designated as hedging instruments and, therefore, all changes in fair value and the settlement of the foreign current forward contracts is recorded in other expense, net within the Consolidated Statement of Operations. For the years ended September 30, 2022, 2021 and 2020, we recognized losses of approximately $2,100, $100, and $0, respectively related to foreign currency forward contracts.\n- 56 -\n(s)\nRecent Accounting Pronouncements\n-\nPronouncements Adopted\nOn October 1, 2021, the Company adopted Financial Accounting Standards Board (FASB) Accounting Standards Update (ASU) 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes\n(ASU\n2019-12), which clarified and simplified accounting for income taxes by eliminating certain exceptions for intraperiod tax allocation principles, the methodology for calculating income tax rates in an interim period, and recognition of deferred taxes for outside basis differences in an investment, among other updates. Adoption of ASU\n2019-12 did not have a material impact on the Consolidated Financial Statements.\nPronouncements Issued but Not Yet Adopted as of September 30, 2022\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting\n, to provide temporary optional guidance relating to reference rate reform, particularly as it relates to easing the potential burden resulting from the expected discontinuation of the London Interbank Offered Rate (LIBOR). The guidance provides practical expedients and exceptions for applying GAAP to contracts, hedging relationships and other transactions affected by reference rate reform if certain criteria are met, which may be applied through December 31, 2022. The Company continues to evaluate the impacts of this guidance but does not expect its application to have a material impact on the Consolidated Financial Statements.\nNo other new accounting pronouncements recently adopted or issued had or are expected to have a material impact on the Consolidated Financial Statements.\n(t)\nReclassifications -\nWithin the notes to the Consolidated Financial Statements, certain reclassifications have been made to the prior year allocation of expenses between segments in order to conform to the current year presentation. Such reclassifications had no impact on any consolidated figures or segment net revenues.\n(2)\nRevenue Recognition\nThe following tables present our net revenues disaggregated by major geographic region, major product platform and disease state (Diagnostics segment only):\nNet Revenues by Reportable Segment & Geographic Region\nYear Ended September 30,\nDiagnostics-\nAmericas\n$ 132,175\n$ 101,293\n$ 97,228\nEMEA\n22,135\n24,475\n21,826\nROW\n1,593\n1,992\n2,078\nTotal Diagnostics\n155,903\n127,760\n121,132\nLife Science-\nAmericas\n33,062\n46,063\n37,391\nEMEA\n81,305\n93,655\n58,125\nROW\n62,748\n50,418\n37,019\nTotal Life Science\n177,115\n190,136\n132,535\nConsolidated\n$ 333,018\n$ 317,896\n$ 253,667\n- 57\n-\nNet Revenues by Product Platform/Type\nYear Ended September 30,\nDiagnostics-\nMolecular assays\n$ 18,177\n$ 19,037\n$ 21,907\nNon-molecular assays\n137,726\n108,723\n99,225\nTotal Diagnostics\n155,903\n127,760\n121,132\nLife Science-\nMolecular reagents\n91,816\n130,537\n78,431\nImmunological reagents\n85,299\n59,599\n54,104\nTotal Life Science\n177,115\n190,136\n132,535\nConsolidated\n$ 333,018\n$ 317,896\n$ 253,667\nNet Revenues by Disease State (Diagnostics only)\nYear Ended September 30,\nDiagnostics-\nGastrointestinal assays\n$ 87,568\n$ 68,890\n$ 55,040\nRespiratory illness assays\n26,632\n17,608\n26,694\nBlood chemistry assays\n14,189\n15,398\n17,534\nOther\n27,514\n25,864\n21,864\nTotal Diagnostics\n$ 155,903\n$ 127,760\n$ 121,132\nRoyalty Income\nRoyalty income received from a third party related to sales of H. pylori\nproducts, totaled approximately $6,750, $6,330 and $3,540 for the years ended September 30, 2022, 2021 and 2020, respectively. Such revenue is included as part of Non-molecular assays and Other within the Net Revenues by Product Platform/Type and Net Revenues by Disease State tables, respectively, above.\nReagent Rental Arrangements\nRevenue allocated to the lease elements of Reagent Rental arrangements totaled approximately $3,925, $3,710 and $4,600 for the years ended September 30, 2022, 2021 and 2020, respectively. Such revenue is included as part of net revenues in our Consolidated Statements of Operations.\n(3)\nFair Value Measurements\nTo limit exposure to volatility in the LIBOR interest rate, the Company has entered into interest rate swap agreements, which effectively convert the variable interest rate on the outstanding revolving credit facility discussed in Note 10 to a fixed rate. The fair values of the interest rate swap agreements were determined by reference to a third-party valuation, which is considered a Level 2 input within the fair value hierarchy of valuation techniques. In conjunction with the paydown of $25,000 on the revolving credit facility in March 2022, a $25,000 interest rate swap agreement was terminated, resulting in a gain of $935, which is recorded in other expense, net in our Consolidated Statement of Operations for the year ended September 30, 2022.\nAs indicated in Note 4, we acquired EUPROTEIN Inc. of North Brunswick, New Jersey (EUPROTEIN) on April 30, 2022 and BreathTek on July 31, 2021. The fair values of inventories acquired were valued using Level 2 inputs, which included data points that were observable, such as established values of comparable assets and historical sales information (market approach). Identifiable intangible assets, if applicable and specifically the acquired customer relationships, were valued using Level 3 inputs, which are unobservable by nature, and included internal estimates of future cash flows and attrition rates (income approach). Significant increases (decreases) in any of those unobservable inputs, as of the date of the acquisition, in isolation would result in a significantly lower (higher) fair value measurement.\n- 58\n-\nIn connection with the acquisition of the business of GenePOC, Inc. (GenePOC) in fiscal 2019 and subsequent amendments to modify certain terms of the agreement related to contingent consideration achievement levels and milestone dates, the Company was required to make contingent consideration payments of up to $64,000 (originally $70,000 at the acquisition date), comprised of up to $14,000 for achievement of product development milestones (originally $20,000 at the acquisition date) and up to $50,000 for achievement of certain financial targets. The fair value for the contingent consideration recognized upon the acquisition as part of the purchase price allocation was $27,202. Giving effect to subsequent agreements to modify certain terms of the agreement related to contingent consideration achievement levels and milestone dates, the fair value of the product development milestone payments were estimated by discounting the probability-weighted contingent payments to present value and presented on the Consolidated Balance Sheets based on the Companys anticipated date of payment at each reporting period. Assumptions used in the calculations included probability of success, duration of the earn-out and discount rate, with such calculations being updated for the effect of the previously noted amendments to the contingent consideration achievement levels and milestone dates. The fair value of the financial performance target payments was determined using a Monte Carlo simulation-based model. Assumptions used in these calculations included expected net revenues, probability of certain developments, expected expenses and discount rate. In August 2021, the Company paid $20,000 to settle the contingent consideration obligation, resulting in a $909 net gain for the year ended September 30, 2021.\nThe following table provides information by level for financial assets and liabilities that are measured at fair value on a recurring basis\n, the carrying values for which are included within other assets and other non-current liabilities of the September 30, 2022 and 2021 Consolidated Balance Sheets, respectively\n:\nFair Value Measurements Using\nInputs Considered as\nCarrying\nValue\nLevel 1\nLevel 2\nLevel 3\nInterest rate swap agreements -\nAs of September 30, 2022\n$ 1,421\n$ -\n$ 1,421\n$ -\nAs of September 30, 2021\n$ (203 )\n$ -\n$ (203 )\n$ -\nSupplemental Cash Flow Information (Non-Cash Acquisition Consideration)\nIn arriving at the $20,000 settlement payment in fiscal 2021, the acquisition consideration obligation related to acquisition of the GenePOC business decreased $909 during the year ended September 30, 2021, due in large part to amendment of certain terms of the original contingent consideration achievement levels and milestone dates, as well as the settlement in August 2021.\n(4)\nBusiness Combinations\nAcquisition of EUPROTEIN\nOn April 30, 2022, we acquired substantially all of the assets of EUPROTEIN for $4,250 in cash, of which $3,750 was paid at closing, with the remainder held back for final closing adjustments, which is recorded in other non-current liabilities on the Consolidated Balance Sheets and is payable within 18 months of the acquisition date. EUPROTEIN offers custom development and production of high-quality bioresearch reagents, with a particular focus on human and other mammalian proteins and recombinant monoclonal antibodies. The acquired assets of EUPROTEIN are included within the Life Science segment and are expected to help the Company accelerate its pipeline of new immunological reagents, while expanding recombinant capabilities. The acquired assets, which are comprised of goodwill, property, plant and equipment, prepaid expenses, and inventories, were valued on April 30, 2022, on a preliminary basis at $3,947, $279, $14 and $10, respectively.\nThe goodwill for EUPROTEIN is attributable to combining EUPROTEIN and Meridians products and capabilities to give the Companys customers access to new immunological reagents. The goodwill is not expected to be deductible for income tax purposes. The preliminary purchase price allocation may change in the future as the fair valuing of assets is completed.\n- 59\n-\nAcquisition of BreathTek Business\nOn July 31, 2021, we acquired BreathTek, a urea breath test for the detection of H. pylori\n, from Otsuka America Pharmaceutical, Inc. Cash consideration totaled $19,585, subject to a $1,000 holdback, which is recorded in other accrued expenses and other non-current liabilities on the Consolidated Balance Sheets as of September 30, 2022 and 2021, respectively, to secure the selling partys performance of certain post-closing obligations and is payable 15 months following the BreathTek acquisition date. As part of the acquisition, we acquired BreathTek inventories and assumed the customer relationships to supply the BreathTek product in North America. Giving effect to purchase adjustments made during the permitted measurement period to increase the value of acquired inventories by approximately $100, the final acquired inventories and customer relationships were valued on July 31, 2021 at $9,955 and $9,630, respectively, with the useful life of the customer relationships estimated at five years.\nThe Companys consolidated results include approximately the following from BreathTek products:\nYear Ended September 30,\nNet revenues\n$\n23,100\n$ 3,840\nNet earnings\n7,500\n1,000\nThese results, which are reported as part of the Diagnostics segment, include amortization expense related to the customer relationships recorded in the purchase price allocation totaling $1,919 and $324 for the years ended September 30, 2022 and 2021, respectively.\nUnaudited Pro Forma Information\nThe following table provides the unaudited consolidated pro forma results for the periods presented as if the BreathTek business had been acquired as of the beginning of fiscal 2021:\nYear Ended September 30,\nNet revenues\n$\n333,018\n$ 337,118\nNet earnings\n42,459\n77,066\nBased on the nature of the EUPROTEIN business, EUPROTEIN is not expected to contribute materially to net revenues and net earnings and therefore, no amounts are included in the table above.\n(5)\nLead Testing Matters\nOn September 1, 2021, the Companys wholly owned subsidiary Magellan announced the expansion of the Class I voluntary recall of its LeadCare test kits for the detection of lead in blood, which it had initiated in May 2021 after identifying an issue in certain manufactured lots of its LeadCare test kits. As a result of the identified issue, impacted test kit lots could potentially underestimate blood lead levels when processing patient blood samples. Although it was initially believed that the root cause of the issue related to the plastic containers used for the treatment reagent, additional studies have indicated that the root cause related to the third-party-sourced cardboard trays that held the treatment reagent containers. Upon correction of the identified supplier issue, shipment of product resumed during the second quarter of fiscal 2022. The Company continues to work closely with the FDA in its execution of the recall activities, which\nhas included\nMagellan notifying customers and distributors affected by the recall and providing instructions for the return of impacted test kits. Of the $5,100 estimated and accrued as of September 30, 2021 to cover the estimated costs of the recall, it was estimated at September 30, 2022 that the remaining costs of the recall exceeded the amount accrued, and as a result, an adjustment was made to the product recall reserve. The effect of this adjustment is reflected in product recall costs (adjustment) within the Consolidated Statement of Operations for the year ended September 30, 2022, and results in approximately $430 of remaining accrued product recall costs reflected in the Consolidated Balance Sheet as of September 30, 2022. Anticipated recall-related costs primarily include\ntemporary labor costs,\nproduct replacement and/or refund costs, mailing/shipping costs, attorneys fees and other miscellaneous costs. Information utilized in the accrual estimation process includes observable inputs such as customer on-hand inventory data, product sales data, average sales price, and product inventory turns, among other things.\n- 60\n-\nOn April 17, 2018, the Companys wholly owned subsidiary Magellan received a subpoena from the U.S. Department of Justice (DOJ) regarding its LeadCare product line. The subpoena outlined documents to be produced, and the Company is cooperating with the DOJ in this matter. The Company maintains rigorous policies and procedures to promote compliance with applicable regulatory agencies and requirements and is working with the DOJ to promptly respond to the subpoena, including responding to additional information requests that have followed receipt of the subpoena in April 2018. The Company has executed tolling agreements to extend the statute of limitations. In March and April 2021, DOJ issued two subpoenas, both to former employees of Magellan, calling for witnesses to testify before a federal grand jury related to this matter. In September and October 2021, DOJ issued additional subpoenas to individuals seeking testimony and documents in connection with its ongoing investigation. It is the Companys understanding that multiple witnesses have testified before the federal grand jury and the DOJs investigation is ongoing. Discussions continue with the DOJ to explore resolution of the matter. As of September 30, 2022,\nin accordance with applicable accounting guidance,\nthe Company believes a loss is probable in the DOJ LeadCare legal matter and has accrued $10,000 as\nan estimate of the cost to resolve the DOJ LeadCare legal matter, which is reflected in litigation and select legal costs within the Consolidated Statement of Operations for the year ended September 30, 2022. The Company estimated this cost based on discussions with the DOJ. The Company cannot predict when the investigation will be resolved or the outcome of the investigation, and the ultimate resolution of the DOJ LeadCare legal matter may exceed the amount accrued at September 30, 2022 and could be material to the Company. Expense for attorneys fees related to this matter\ntotaling $3,510, $2,803 and $2,035 is included within the Consolidated Statements of Operations for the years ended September 30, 2022, 2021 and 2020, respectively.\nMagellan submitted 510(k) applications in December 2018, seeking to reinstate venous blood sample-types for its LeadCare II, LeadCare Plus and LeadCare Ultra testing systems. In the second fiscal quarter of 2019, the FDA informed Magellan that each of these 510(k) applications had been put on Additional Information hold. On July 15, 2019, we provided responses to the FDAs requests for Additional Information. These 510(k) applications have since expired and are no longer under FDA review. Further, while Magellans LeadCare testing systems remain cleared for marketing by the FDA and permitted for use with capillary blood samples, the FDA advised that it has commissioned a third-party study of the Companys LeadCare testing systems using both venous and capillary blood samples. According to the FDA, the results of the field study will be used in conjunction with other information to determine whether further action by the FDA or the Centers for Disease Control and Prevention (CDC) is necessary to protect the public health. The Company intends to fully cooperate with the FDA or CDC on any follow-up based on the third-party study.\nDuring October 2019, the FDA performed a follow-up inspection of Magellans manufacturing facility. The FDA issued five Form FDA 483 observations. On March 18, 2020, we participated in a regulatory meeting with the FDA at the FDAs request to further discuss the Form FDA 483 observations and our remediation efforts. Since the inspection, we have submitted a number of written responses to the FDA regarding the five Form FDA 483 observations issued in the October 2019 inspection, and have worked diligently to execute a remediation plan. During October 2020, the FDA issued Establishment Inspection Reports which closed out the inspections from June 2017 and October 2019 under 21 C.F.R.20.64(d)(3).\nDuring June 2021, the FDA performed an inspection of Magellans manufacturing facility. As a result of this inspection, the FDA issued one Form 483 observation. On August 3, 2021, FDA sent Magellan a close-out letter for the Warning Letter that FDA issued to Magellan on October 23, 2017. FDAs close-out letter notified Magellan that FDA has completed an evaluation of Magellans corrective actions in response to FDAs Warning Letter, and based on FDAs evaluation, Magellan has addressed the issues identified in the Warning Letter. FDAs close-out letter also stated that future FDA inspections of Magellan and regulatory activities will further assess the adequacy and sustainability of Magellans corrections.\n- 61\n-\n(6)\nCash and Cash Equivalents\nCash and cash equivalents are comprised of the following:\nAs of September 30,\nInstitutional money market funds\n$\n1,027\n$ 1,020\nCash on hand, unrestricted\n80,426\n48,751\nTotal\n$\n81,453\n$ 49,771\nCash equivalents and institutional money market funds are classified within Level 1 of the fair value hierarchy. Financial instruments classified as Level 1 are based on quoted market prices in active markets. The Company does not adjust the quoted market price for such financial instruments.\n(7)\nInventories, Net\nInventories, net are comprised of the following:\nAs of September 30,\nRaw materials\n$\n15,726\n$ 14,843\nWork-in-process\n21,570\n25,072\nFinished goods - instruments\n1,796\n2,260\nFinished goods - kits and reagents\n28,722\n34,667\nTotal\n$\n67,814\n$ 76,842\n(8)\nGoodwill and Other Intangible Assets, Net\nDuring fiscal 2022, goodwill increased $1,634, comprised of the following: (i) a $492 decrease in Diagnostics segment goodwill; and (ii) a $2,126 increase in Life Science segment goodwill. This overall increase in goodwill reflects $3,947 of goodwill acquired in the EUPROTEIN acquisition (see Note 4), partially offset by the effects of foreign currency translation.\nDuring fiscal 2021, goodwill increased $482, reflecting: (i) a $56 increase from the currency translation adjustment on goodwill in the Diagnostics segment; (ii) a $433 increase from the currency translation adjustment on goodwill in the Life Science segment; and (iii) a $7 decrease related to Exalenz, reflecting additional measurement period adjustments.\nA summary of Meridians intangible assets subject to amortization is as follows:\nAs of September 30,\nGross\nCarrying\nValue\nAccum.\nAmort.\nGross\nCarrying\nValue\nAccum.\nAmort.\nManufacturing technologies, core products and cell lines\n$\n56,289\n$\n20,321\n$ 64,867\n$ 25,084\nTradenames, licenses and patents\n18,257\n10,491\n18,489\n9,492\nCustomer lists, customer relationships and supply agreements\n52,703\n22,363\n54,941\n19,649\nNon-compete agreements\n$\n127,359\n$\n53,228\n$ 138,407\n$ 54,256\nThe aggregate amortization expense for these intangible assets for the years ended September 30, 2022, 2021 and 2020 was $9,912, $8,776 and $7,744, respectively. The estimated aggregate amortization expense for these intangible assets for each of the five succeeding fiscal years is as follows: fiscal 2023 - $9,905, fiscal 2024 - $9,900, fiscal 2025 - $9,890, fiscal 2026 - $8,900 and fiscal 2027 - $6,645.\n- 62 -\n(9)\nLeasing Arrangements\nThe Company is party to several operating leases, the majority of which are related to office, warehouse and manufacturing space. The related operating lease assets and obligations are reflected within right-of-use assets, net, current operating lease obligations and long-term operating lease obligations on the Consolidated Balance Sheets. Lease expense for these leases is recognized on a straight-line basis over the lease term, with variable lease payments recognized in the period those payments are incurred.\nThe lease costs for these operating leases reflected in our Consolidated Statements of Operations, as well as the right-of-use assets, net obtained during these periods in exchange for operating lease liabilities, are as follows:\nYear Ended September 30,\nLease costs within cost of sales\n$\n$\nLease costs within operating expenses\n1,406\n1,542\nRight-of-use assets, net obtained in exchange for operating lease liabilities\n3,068\n1,073\nIn addition, the Company periodically enters into other short-term operating leases, generally with an initial term of twelve months or less. These leases are not recorded on the Consolidated Balance Sheets and the related lease expense is immaterial for fiscal 2022, 2021 and 2020.\nThe Company often has options to renew lease terms, with the exercise of lease renewal options generally at the Companys sole discretion. In addition, certain lease arrangements may be terminated prior to their original expiration date at our discretion. We evaluate renewal and termination options at the lease commencement date to determine if we are reasonably certain to exercise the option on the basis of economic factors. The discount rate implicit within our leases is generally not determinable and, therefore, the Company uses its incremental borrowing rate as the basis for its discount rate. The weighted average remaining lease term for our operating leases and the weighted average discount rate used to measure our operating leases were as follows:\nAs of September 30,\nWeighted average remaining lease term\n3.9 yrs.\n3.6 yrs.\nAverage discount rate\n3.5\n%\n3.2 %\nMaturities of lease liabilities by fiscal year for the Companys operating lease liabilities were as follows as of September 30, 2022:\n$ 1,952\n1,614\n1,343\nThereafter\nTotal lease payments\n6,360\nLess amount of lease payment representing interest\n(403 )\nTotal present value of lease payments\n$ 5,957\n- 63\n-\nSupplemental Cash Flow Information (Cash Paid for Amounts Included in Measurement of Lease Liabilities)\nYear Ended September 30,\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n2,338\n$ 2,228\n$ 1,693\n(10)\nBank Credit Arrangements\nThe Company maintains a revolving credit facility with a commercial bank in an aggregate principal amount not to exceed $200,000, which expires in October 2026. Outstanding principal amounts bear interest at a fluctuating rate tied to, at the Companys option, either the federal funds rate or LIBOR, resulting in an effective interest rate of 2.69% and 2.51% on the revolving credit facility during fiscal 2022 and 2021, respectively. In light of the interest being determined on a variable rate basis, the fair value of the borrowings under the credit facility at both September 30, 2022 and 2021 approximates the current carrying value reflected in the Consolidated Balance Sheets of $25,000 and $60,000, respectively, which is consistent with a level 2 fair value measurement.\nThe revolving credit facility is collateralized by the business assets of the Companys U.S. subsidiaries and requires compliance with financial covenants that limit the amount of debt obligations and require a minimum level of coverage of fixed charges, as defined in the revolving credit facility agreement. As of September 30, 2022, the Company was in compliance with all covenants.\nSupplemental Cash Flow Information (Interest Paid)\nCash paid for interest totaled $934, $1,348 and $2,690 in fiscal 2022, 2021 and 2020, respectively.\n(11)\nIncome Taxes\n(a) Earnings before income taxes, and the related income tax provision were as follows:\nYear Ended September 30,\nDomestic\n$\n(14,012\n)\n$ 11,354\n$ 9,068\nForeign\n68,329\n79,097\n50,225\nTotal earnings before income taxes\n$\n54,317\n90,451\n59,293\nProvision (benefit) for income taxes -\nFederal -\nCurrent\n$\n(460\n)\n$ 4,431\n$ 1,173\nDeferred\n(1,125\n)\n(2,595 )\nState and local\n1,163\n1,170\nForeign -\nCurrent\n13,316\n16,305\n10,194\nDeferred\n(324\n)\n(260 )\n(174 )\nTotal income tax provision\n$\n11,858\n$ 19,044\n$ 13,107\n- 64\n-\n(b) The following is a reconciliation between the statutory U.S. income tax rate and the effective rate derived by dividing the income tax provision by earnings before income taxes:\nYear Ended September 30,\nComputed income taxes at statutory rate\n$\n11,407\n21.0\n%\n$ 18,995\n21.0 %\n$ 12,452\n21.0 %\nIncrease (decrease) in taxes resulting from -\nState and local income taxes\n0.7\n1,204\n1.3\n1.3\nForeign-Derived Intangible Income tax\n-\n-\n(563 )\n(0.6 )\n(136 )\n(0.2 )\nGlobal Intangible Low Taxed Income (GILTI) tax\n6,924\n12.7\n8,061\n8.9\n4,970\n8.4\nForeign tax credit\n(6,572\n)\n(12.1\n)\n(7,802 )\n(8.6 )\n(4,767 )\n(8.0 )\nForeign tax rate differences\n(1,679\n)\n(3.1\n)\n(869 )\n(1.0 )\n(534 )\n(0.9 )\nDOJ LeadCare legal matter accrual\n2,100\n3.9\n-\n-\n-\n-\nUncertain tax position activity\n0.3\n0.2\n0.1\nValuation allowance\n(197\n)\n(0.4\n)\n0.8\n0.3\nStock-based compensation\n1.5\n(498 )\n(0.5 )\n0.1\nTransaction costs\n-\n-\n-\n-\n0.9\nUnrepatriated earnings\n(1,148\n)\n(2.1\n)\n0.8\n0.3\nOther, net\n(330\n)\n(0.6\n)\n(1,098 )\n(1.2 )\n(716 )\n(1.2 )\n$\n11,858\n21.8\n%\n$ 19,044\n21.1 %\n$ 13,107\n22.1 %\nThe Companys GILTI and foreign tax credit details were as follows:\nYear Ended September 30,\nU.S. GILTI inclusion\n$\n32,971\n$ 38,384\n$ 23,666\nResulting permanent tax expense\n6,924\n8,061\n4,970\nOffsetting foreign tax credit\n(6,572\n)\n(7,802 )\n(4,767 )\n(c) The components of net deferred taxes were as follows:\nAs of September 30,\nDeferred tax assets -\nValuation reserves and non-deductible expenses\n$\n4,274\n$ 4,939\nStock compensation expense not deductible\n2,609\n2,276\nNet operating loss and tax credit carryforwards\n12,108\n12,711\nIntangible asset basis differences and amortization\n1,254\nUnrepatriated earnings\n1,205\n-\nOther\n1,357\n1,512\nSubtotal\n22,807\n21,943\nLess valuation allowance\n(1,427\n)\n(1,624 )\nDeferred tax assets\n21,380\n20,319\nDeferred tax liabilities -\nProperty, plant and equipment basis differences and depreciation\n(5,540\n)\n(4,778 )\nIntangible asset basis differences and amortization\n(6,218\n)\n(7,000 )\nUnrepatriated earnings\n(922\n)\n(865 )\nDeferred tax liabilities\n(12,680\n)\n(12,643 )\nNet deferred tax assets\n$\n8,700\n$ 7,676\n- 65\n-\nFor income tax purposes, we have recorded deferred tax assets related to operating loss and tax credit carryforwards of\n$12,108\nin foreign jurisdictions as of September 30, 2022, reduced by valuation reserves totaling\n$1,125. At September 30, 2021, such deferred tax assets totaled\n$179 and $12,532\nin U.S. and foreign jurisdictions, respectively, reduced by valuation reserves totaling\n$1,322. The operating loss carryforwards in foreign jurisdictions, the majority of which relate to Israel, have no expiration date. The aggregate amount of foreign operating loss carryforwards totaled approximately\n$87,000\nat September 30, 2022.\nThe Company has recognized a net deferred tax asset\nof $\n283 and a net\ndeferred tax liability of $\nat September 30, 2022 and 2021, respectively, related to unrepatriated foreign earnings.\nThe realization of deferred tax assets is dependent upon the generation of future taxable income in the applicable jurisdictions. We have considered the levels of currently anticipated pre-tax income in U.S. and foreign jurisdictions in assessing the required level of the deferred tax asset valuation allowance including the characterization of the income as ordinary or capital. Taking into consideration historical and current operating results, and other factors, we believe that it is more likely than not that the net deferred tax asset of $21,380 will be realized. The amount of the net deferred tax asset considered realizable, however, could be reduced in future years if estimates of future taxable income are reduced.\nWe utilize a comprehensive model for the recognition, measurement, presentation and disclosure of uncertain tax positions, assuming full knowledge of all relevant facts by the applicable tax authorities. The total amount of unrecognized tax benefits at September 30, 2022 and 2021 related to such positions was $774 and $700, respectively, of which $700 at September 30, 2022 would favorably impact the effective tax rate if recognized. We generally recognize interest and penalties related to uncertain tax positions as a component of our income tax provision. During fiscal 2022 and 2021, such penalties and interest totaled approximately $24 and $31, respectively. We had approximately $194 accrued for the payment of interest and penalties at September 30, 2022, compared to $170 accrued at September 30, 2021. The amount of our liability for uncertain tax positions expected to be paid or settled in the next 12 months is uncertain.\nA reconciliation of the beginning and ending amounts of unrecognized tax benefits is as follows:\nYear Ended September 30,\nUnrecognized income tax benefits at beginning of year\n$\n$\n$\nAdditions for tax positions of prior years\n-\n-\nReductions for tax positions of prior years\n-\n-\n-\nAdditions for tax positions of current year\nTax examination and other settlements\n(64\n)\n(40 )\n(45 )\nUnrecognized income tax benefits at end of year\n$\n$\n$\nWe are subject to examination by the tax authorities in the U.S. (both federal and state) and the countries of Australia, Belgium, Canada, China, England, France, Germany, Holland, Israel and Italy. In the U.S., tax years subsequent to fiscal 2018 remain open. In countries outside the U.S., open tax years generally range from fiscal 2017 and forward. However, in Australia and Belgium, the utilization of local net operating loss carryforwards extends the statute of limitations for examination well into the foreseeable future. To the extent that adjustments result from the completion of these examinations or the lapsing of statutes of limitation, they will affect tax liabilities in the period known. We believe that the results of any tax authority examinations would not have a significant adverse impact on our consolidated financial condition or results of operations.\nSupplemental Consolidated Cash Flow Information (Income Taxes Paid)\nCash paid for income taxes totaled $26,824, $27,466 and $9,816 in fiscal 2022, 2021 and 2020, respectively.\n- 66\n-\n(12)\nEmployee Benefits\n(a)\nSavings and Investment Plan\n- We have a profit sharing and retirement savings plan covering substantially all full-time U.S. employees. Profit sharing contributions to the plan, which are discretionary, are approved by the board of directors. The plan permits participants to contribute to the plan through salary reduction. Under terms of the plan, we match 100% of an employees contributions, up to a maximum match of 4% of eligible compensation. Our discretionary and matching contributions to the plan, which are recorded primarily within operating expenses, amounted to approximately $2,727, $2,869 and $2,434, for the years ended September 30, 2022, 2021 and 2020, respectively.\n(b)\nStock-Based Compensation Plans\n- During fiscal 2022, the Company had two active stock-based compensation plans, the 2012 Stock Incentive Plan, which became effective January 25, 2012 (the 2012 Plan) and the 2021 Omnibus Award Plan, which became effective January 27, 2021 (the 2021 Plan).\nThe 2021 Plan is authorized to grant new shares for options, restricted shares or restricted share units for up to 2,839 shares, including 1,839 non-granted shares from the 2012 Plan permitted to be carried forward and added to the 2021 Plan authorized limit.\nConsidering grants, cancellation and forfeitures that have occurred during the year, as\nof September 30, 2022, the\nremaining authorized limit\nunder the 2021 Plan totals approximately\n2,200 shares. Options may be granted at exercise prices not less than 100% of the closing market value of the underlying common shares on the date of grant and have maximum terms up to ten years. Vesting schedules for options, restricted shares and restricted share units are established at the time of grant and may be set based on future service periods, achievement of performance targets, or a combination thereof. All options contain provisions restricting their transferability and limiting their exercise in the event of termination of employment, or the disability or death of the optionee. We recognize compensation expense for all share-based payments made to employees, based upon the fair value of the share-based payment on the date of the grant.\nDuring fiscal years 2020 through 2022, we granted, in the aggregate for the three-year period, approximately 875 restricted share units (with weighted-average grant date fair values of $10.13 per share in fiscal 2020, $18.81 per share in fiscal 2021 and $20.50 per share in fiscal 2022) to certain employees, including CEO Jack Kenny, as separately detailed below. The units granted in fiscal 2022 were generally time-vested restricted share units vesting in total on the fourth anniversary of the grant date, while units granted in fiscal 2021 and 2020 were generally time-vested restricted share units vesting in total on the third anniversary of the grant date.\nAdditionally, during fiscal 2022, we granted approximately 105 restricted share units (with a weighted-average grant date fair value of $19.54 per share) to certain employees, including\nMr.\nKenny to incentivize the achievement of certain Company and segment net revenues and operating targets in fiscal 2024. These awards can only be earned if specified net revenues and operating income thresholds are achieved during fiscal 2024, with increased amounts available to be earned as established increased levels are achieved, which range from 50% to 200% of the targeted payout. Based upon information available as September 30, 2022, it is estimated that these performance-based restricted stock units will be paid out at the target level, and the associated stock compensation expense is being recorded ratably through September 30, 2024. Such expense totaled approximately $510 during fiscal 2022.\nDuring fiscal 2020, in connection with Mr. Kennys Amended and Restated Employment Agreement, effective October 1, 2019, we granted to Mr. Kenny: (i) options to purchase approximately 198 shares of common stock of the Company (with a grant date fair value of $3.38 per share) vesting on a pro rata basis over the three years ending October 1, 2022; and (ii) approximately 100 restricted share units (with a grant date fair value of $10.10 per share) vesting 100% on the October 1, 2022, which are included within the restricted share units noted above.\nGiving effect to these grants, cancellations and certain other activities for restricted shares and restricted share units throughout the years, including conversions to common shares, forfeitures, and new hire and employee promotion grants, approximately 790 restricted share units remain outstanding as of September 30, 2022, with a weighted-average grant date fair value of $15.93 per share, a weighted-average remaining vesting period of 1.08 years and an aggregate intrinsic value of $24,898. The weighted-average grant date fair value of the approximate 306 restricted share units that vested during fiscal 2022 was $17.34 per share.\n- 67\n-\nThe amount of stock-based compensation expense was $6,900, $4,156 and $3,802 for the years ended September 30, 2022, 2021 and 2020, respectively. The fiscal 2022 expense is comprised of $1,414 related to stock options and $5,486 related to restricted share units; the fiscal 2021 expense is comprised of $1,080 related to stock options and $3,076 related to restricted share units ; and the fiscal 2020 expense is comprised of $1,006 related to stock options and $2,796 related to restricted share units. The total income tax benefit recognized in the Consolidated Statements of Operations for these stock-based compensation arrangements was $1,638, $1,516 and $898, for the years ended September 30, 2022, 2021 and 2020, respectively. As of September 30, 2022, we expect future stock compensation expense for unvested options and unvested restricted share units to total $905 and $5,821, respectively, which will be recognized during fiscal years 2023 through 2026.\nWe recognize stock-based compensation expense only for the portion of shares that we expect to vest. As such, we apply estimated forfeiture rates to our stock-based compensation expense calculations. These rates have been derived using historical forfeiture data, stratified by several employee groups, and range from 0% to 16% in each of the years ended September 30, 2022, 2021 and 2020. During the years ended September 30, 2022, 2021 and 2020, we recorded $192, $183 and $148, respectively, in stock-based compensation expense to adjust estimated forfeiture rates to actual.\nWe have elected to use the Black-Scholes option pricing model to determine grant-date fair value for stock options, with the following assumptions: (i) expected share price volatility based on the average of Meridians historical volatility over the options expected lives and implied volatility based on the value of tradable call options; (ii) expected life of options based on contractual lives, employees historical exercise behavior and employees historical post-vesting employment termination behavior; (iii) risk-free interest rates based on treasury rates that correspond to the expected lives of the options; and (iv) dividend yield based on the expected yield on underlying Meridian common stock. A summary of these key assumptions are as follows:\nYear ended September 30,\nShare price volatility\n51%-59%\n53%-59\n%\n%\nLife of option\n4.00-7.06 yrs.\n4.00-7.47 yrs.\n6.51 yrs.\nRisk-free interest rates\n0.95%-1.73%\n0.26%-0.79 %\n1.60 %\nDividend yield\n0%\n%\n%\nA summary of the status of our stock option plans as of September 30, 2022, and changes during the year ended September 30, 2022, is presented in the table and narrative below:\nOptions\nWtd Avg\nExercise\nPrice\nWtd Avg\nRemaining\nLife (Yrs)\nAggregate\nIntrinsic\nValue\nOutstanding beginning of period\n1,001\n$ 15.31\nGrants\n19.52\nExercises\n(186 )\n13.27\nForfeitures\n-\n-\nCancellations\n(9 )\n20.26\nOutstanding end of period\n$ 16.55\n6.19\n$ 14,515\nExercisable end of period\n$ 16.62\n4.97\n$ 9,124\n- 68\n-\nA summary of the status of our nonvested options as of September 30, 2022, and changes during the year ended September 30, 2022, is presented below:\nOptions\nWeighted-\nAverage\nGrant Date\nFair Value\nNonvested beginning of period\n$ 5.70\nGranted\n9.26\nVested\n(209 )\n5.73\nForfeitures\n-\n-\nNonvested end of period\n$ 7.30\nFor the years ended September 30, 2022, 2021 and 2020: (i) the weighted average grant-date fair value of options granted was $9.26, $9.18 and $3.54, respectively; (ii) the total intrinsic value of options exercised was $3,032, $2,890 and $1,585, respectively; and (iii) the total grant-date fair value of options that vested was $1,187, $621 and $528, respectively.\nCash received from options exercised was $2,450, $3,052 and $3,559 for the years ended September 30, 2022, 2021 and 2020, respectively.\n(13)\nContingent Obligations and Non-Current Liabilities\nIn connection with the acquisition of Exalenz Bioscience Ltd. (Exalenz) in fiscal 2020, the Company assumed several Israeli government grant obligations. The repayment of the grants, along with interest incurred at varying stated fixed rates based on LIBOR at the time each grant was received, is not dictated by an established repayment schedule. Rather, the grants and related interest are required to be repaid using 3% of the net revenues generated from the sales of BreathID products, with the timing of repayment contingent upon the level and timing of such revenues. In addition, the grants have no collateral or financial covenant provisions generally associated with traditional borrowing instruments. These obligation amounts total $5,287 and $5,814 as of September 30, 2022 and 2021, with the grant obligations remaining at September 30, 2022 bearing interest at rates ranging from 0.58% to 2.02%.\nThe grant obligations are reflected in the Consolidated Balance Sheets as follows:\nYear Ended September 30,\nCurrent liabilities\n$\n$\nNon-current liabilities\n4,620\n5,176\nAdditionally, the Company has provided certain post-employment benefits to its former Chief Executive Officer, and these obligations total $1,284 and $1,676 at September 30, 2022 and 2021, respectively. In addition, the Company is required by the governments of certain foreign countries in which we operate to maintain a level of accruals for potential future severance indemnity. These accruals total $566 and $754 at September 30, 2022 and 2021, respectively.\n(14)\nNational Institutes of Health Contracts\nIn December 2020, the Company entered into a sub-award grant contract with the University of Massachusetts Medical School as part of the National Institutes of Health Rapid Acceleration of Diagnostics (RADx) initiative to support the Companys research and development of its diagnostic test for the SARS-CoV-2 antigen. The Company has received $1,000 under the grant contract for reimbursement of eligible research and development expenditures. These amounts are\nincluded within other expense\n, net\nin the Consolidated Statement of Operations for the year ended September 30, 2021.\n- 69\n-\nOn January 25, 2022, the Company entered into a contract to amend the Companys second grant contract under the RADx initiative, which was originally effective February 1, 2021. The purpose of the grant is to support the Companys manufacturing production scale-up and expansion to meet the demand for COVID-19 testing, as well as the Companys Revogene respiratory panel. The amended contract is a 24-month service contract through January 2023, with payment of up to $8,000 being made based on the Company achieving key milestones related to increasing its capacity to produce COVID-19 tests and the Revogene respiratory panel. As of September 30, 2022, $2,750 has been received related to this contract and is reflected as a reduction in the cost of building and improvements on the Consolidated Balance Sheet, in accordance with applicable accounting guidance.\n(15)\nReportable Segments and Major Concentration Data\nThe Companys reportable segments maintain separate financial information for which results of operations are evaluated on a regular basis by the Companys chief operating decision maker in deciding how to allocate resources and in assessing performance.\nThe Company records the direct costs of business operations to the reportable segments, including allocations for certain corporate-wide costs such as treasury management, human resources and technology, among others. Corporate provides certain executive management and administrative services to each reportable segment. These services primarily include executive oversight by non-segment-specific executives, including the Board of Directors, along with certain other corporate-wide support functions such as insurance, legal and business development. The Company generally does not allocate these types of corporate expenses to the reportable segments.\nReportable segment and corporate information is as follows:\nDiagnostics\nLife Science\nCorporate\n(1)\nEliminations\n(2)\nTotal\nFiscal 2022\nNet revenues -\nThird-party\n$ 155,903\n$ 177,115\n$ -\n$ -\n$ 333,018\nInter-segment\n-\n(393 )\n-\nOperating income (loss)\n2,982\n86,040\n(34,707 )\n54,391\nDepreciation and amortization\n14,708\n1,803\n-\n-\n16,511\nCapital expenditures\n6,882\n1,733\n-\n-\n8,615\nGoodwill\n94,412\n21,890\n-\n-\n116,302\nOther intangible assets, net\n74,129\n-\n-\n74,131\nTotal assets\n357,630\n105,511\n-\n(44 )\n463,097\nFiscal 2021\nNet revenues -\nThird-party\n$ 127,760\n$ 190,136\n$ -\n$ -\n$ 317,896\nInter-segment\n-\n(558 )\n-\nOperating income (loss)\n(7,280 )\n115,014\n(14,788 )\n93,034\nDepreciation and amortization\n13,432\n1,854\n-\n-\n15,286\nCapital expenditures\n15,827\n2,485\n-\n-\n18,312\nGoodwill\n94,904\n19,764\n-\n-\n114,668\nOther intangible assets, net\n84,149\n-\n-\n84,151\nTotal assets\n339,208\n110,536\n-\n(22 )\n449,722\nFiscal 2020\nNet revenues -\nThird-party\n$ 121,132\n$ 132,535\n$ -\n$ -\n$ 253,667\nInter-segment\n-\n(587 )\n-\nOperating income (loss)\n5,276\n68,893\n(12,895 )\n61,324\nDepreciation and amortization\n11,451\n2,116\n-\n-\n13,567\nCapital expenditures\n1,850\n1,449\n-\n-\n3,299\nGoodwill\n94,855\n19,331\n-\n-\n114,186\nOther intangible assets, net\n83,179\n-\n-\n83,197\nTotal assets\n306,812\n98,483\n-\n(34 )\n405,261\n(1) Includes acquisition and transaction related costs, litigation and select legal costs and restructuring costs totaling $20,298, $2,803 and $2,080 for the years ended September 30, 2022, 2021 and 2020, respectively\n.(2)\nEliminations consist of inter-segment transactions.\n- 70 -\nA reconciliation of reportable segment operating income to consolidated earnings before income taxes is as follows:\nYear Ended September 30,\nOperating income (loss):\nDiagnostics segment\n$\n2,982\n$ (7,280 )\n$ 5,276\nLife Science segment\n86,040\n115,014\n68,893\nEliminations\nTotal reportable segment operating income\n89,098\n107,822\n74,219\nCorporate operating expenses\n(34,707\n)\n(14,788 )\n(12,895 )\nInterest income\n-\nInterest expense\n(1,189\n)\n(1,878 )\n(2,632 )\nRADx initiative grant income\n-\n1,000\n-\nOther, net\n1,098\n(1,705 )\nConsolidated earnings before income taxes\n$\n54,317\n$ 90,451\n$ 59,293\nTransactions between reportable segments are accounted for at established intercompany prices for internal and management purposes with all intercompany amounts eliminated in consolidation.\nNet revenues generated by the Companys three major Diagnostics segment product families - gastrointestinal, respiratory illnesses and blood chemistry - accounted for 39%, 32% and 39% of consolidated net revenues during the years ended September 30, 2022, 2021 and 2020, respectively.\nWhile no individual Diagnostics or Life Science segment customers accounted for greater than 10% of consolidated net revenues during the years ended September 30, 2022, 2021 and 2020, individual Diagnostics or Life Science segment customers, including their affiliates, comprising 10% or more of reportable segment net revenues were as follows:\nYear Ended September 30,\nDiagnostics\nCustomer A\n%\n%\n%\nCustomer B\n%\n%\n%\nCustomer C\n%\n%\n%\nLife Science\nCustomer D\n%\n%\n%\nCustomer E\n%\n%\n%\nCustomer F\n%\n%\n- %\n- 71\n-\nIn addition, for the years ended September 30, 2022, 2021 and 2020, the Life Science segments ten largest customers, including their affiliates, accounted for approximately 56%, 44% and 48%, respectively, of Life Science segment net revenues, and 30%, 27% and 25%, respectively, of consolidated net revenues.\nOne Diagnostics segment customer (Customer B above) and one Life Science segment customer (not listed above) accounted for approximately 12% and 11%, respectively, of consolidated accounts receivable as of September 30, 2022. As of September 30, 2021, o\nne Diagnostics segment customer (Customer B above) and one Life Science segment customer (Customer E above) accounted for approximately 12% and 10%, respectively, of consolidated accounts receivable.\nNet revenues generated by the Company outside of the U.S. and its territories totaled $170,467, $173,475 and $121,596 for the years ended September 30, 2022, 2021 and 2020, respectively, with net revenues by country for the Diagnostics and Life Science segments as follows (net revenues are attributed to the geographic area based on the location to which the product is delivered):\nYear Ended September 30,\nU.S. and territories\n$\n130,101\n$ 99,636\n$ 95,382\nItaly\n9,741\n12,240\n9,797\nUnited Kingdom\n3,972\n2,197\n2,312\nBelgium\n1,339\n1,554\n1,440\nHolland\n1,051\n1,279\n1,183\nOther countries\n9,699\n10,854\n11,018\nTotal Diagnostics\n$\n155,903\n$ 127,760\n$ 121,132\nYear Ended September 30,\nSouth Korea\n$\n33,642\n$ 9,242\n$ 1,908\nU.S. and territories\n32,450\n44,785\n36,689\nGermany\n17,969\n18,460\n14,190\nChina\n15,368\n13,559\n19,047\nUnited Kingdom\n12,882\n13,097\n14,765\nFrance\n11,948\n10,733\n5,579\nSpain\n11,134\n12,593\n7,242\nFinland\n10,317\n17,936\n2,518\nTurkey\n7,858\n7,281\n2,819\nJapan\n6,591\n6,532\n3,707\nAustralia\n4,312\n9,115\n5,957\nItaly\n3,735\n7,516\n4,067\nCzech Republic\n1,926\nIndia\n1,257\n5,558\n2,099\nSwitzerland\n1,119\nOther countries\n4,607\n12,175\n10,589\nTotal Life Science\n$\n177,115\n$ 190,136\n$ 132,535\n- 72\n-\nIn locations outside the U.S., the Companys identifiable assets were concentrated as follows at the end of the most recent fiscal years, with no additional countrys total of assets exceeding $5,000:\nAs of September 30,\nIsrael\n$\n71,536\n$ 80,416\nUnited Kingdom\n27,927\n30,027\nGermany\n16,734\n22,293\nCanada\n15,875\n15,236\nItaly\n7,225\n6,921\n(16)\nCommitments and Contingent Obligations\n(a)\nRoyalty Commitments\n-\nWe have entered into various license agreements that require payment of royalties based on a specified percentage of net revenues from licensed products, with such percentages generally ranging from approximately 3% to 10%. During the year ended September 30, 2022, royalty expense associated with these agreements totaled approximately $2,300, with 40% and 60% of such expense relating to our Diagnostics and Life Science segments, respectively. These royalty expenses are recognized as the related revenues are earned and are recorded as a component of cost of sales. Annual royalty expenses associated with these agreements totaled approximately $5,200 and $1,900 for the years ended September 30, 2021 and 2020, respectively, with the Diagnostics/Life Science segment split of such net revenues equating to approximately 25/75 and 80/20 in each of these years, respectively.\n(b)\nPurchase Commitments\n- Excluding the operating lease commitments reflected in Note 9, we have purchase commitments primarily for inventories and service items as part of the normal course of business. Commitments made under these obligations are $40,182 for fiscal 2023 and $1,109 for fiscal 2024 through fiscal 2026. No purchase commitments have been made beyond fiscal 2026.\n(c)\nLitigation\n- We are a party to various litigation matters from time to time that we believe are in the normal course of business. The ultimate resolution of these routine matters is not expected to have a material adverse effect on our consolidated financial position, results of operations or cash flows. Additionally, the Company has also become a party to certain legal matters that are outside the normal course of business. See Note 5 for a discussion of Magellans DOJ LeadCare legal matter.\n(d)\nIndemnifications\n- In conjunction with certain contracts and agreements, we provide routine indemnifications related to our performance obligations. The terms of these indemnifications range in duration and in some circumstances are not explicitly defined. The maximum obligation under some such indemnifications is not explicitly stated and, as a result of our having no history of paying such indemnifications, cannot be reasonably estimated. We have not made any payments for these indemnifications and no liability is recorded at September 30, 2022 or 2021.\n(17)\nPending Merger\nOn July 7, 2022, the Company entered into an Agreement and Plan of Merger (as it may be amended, supplemented or otherwise modified from time to time, the Merger Agreement) with SD Biosensor, Inc., a corporation with limited liability organized under the laws of the Republic of Korea (SDB), Columbus Holding Company, a Delaware corporation (Parent), and Madeira Acquisition Corp., an Ohio corporation and a direct wholly owned subsidiary of Parent (Merger Sub). Meridian is informed that SJL Partners, LLC (SJL) is currently the sole shareholder of Parent, and SDB together with SJL will be the sole shareholders of Parent as of the closing of the Merger. Pursuant to the Merger Agreement, Merger Sub will merge with and into Meridian (the Merger), with Meridian surviving the Merger as a direct wholly owned subsidiary of Parent.\nAt the effective time of the proposed Merger (the Effective Time), each share of common stock, no par value per share, of the Company issued and outstanding as of immediately prior to the Effective Time (other than dissenting shares or shares of the Companys common stock held by the Company as treasury stock or owned by SDB, Merger Sub or any subsidiary of the Company or SDB) will be cancelled and cease to exist and automatically convert into the right to receive cash in an amount equal to $34.00, without interest.\n- 73\n-\nConsummation of the Merger is subject to customary closing conditions, including, without limitation: (i) the absence of certain legal impediments; and (ii) the condition that no Specified Outcome, as such term is defined in the Merger Agreement, related to the DOJ LeadCare legal matter (which is described in the section entitled Legal Matter Relating to LeadCare Product Line of Item 3. Legal Proceedings) has occurred or is reasonably likely to occur.\nOn November 21, 2022, the parties received clearance from the Committee on Foreign Investment in the United States with respect to the Merger and the transactions contemplated by the Merger Agreement.\nThe Merger Agreement contains certain termination rights for the Company and SDB. In addition to the foregoing termination right, and subject to certain limitations: (i) the Company or SDB may terminate the Merger Agreement if the Merger is not consummated by January 6, 2023; and (ii) the Company and SDB may mutually agree to terminate the Merger Agreement.\nThe Company incurred transaction related costs of approximately $6,800 during the year ended September 30, 2022 related to the Merger, which is recorded in acquisition and transaction related costs in the Consolidated\nStatements of Operations.\n(18)\nSubsequent Event\nOn October 26, 2022, Meridian acquired select assets from Estel Biosciences, Inc., as part of Meridians continued investment in its immunological research and development capabilities. Among other assets, the Company acquired intellectual property that will be incorporated into the Life Science operations in North Brunswick, New Jersey and Memphis, Tennessee for the design and manufacture of recombinant proteins using an insect cell expression system. ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS\nON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable. ITEM 9A.\nCONTROLS AND PROCEDURES\nAs of September 30, 2022, an evaluation was completed under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures pursuant to Rule 13a-15(b) and 15d-15(b) promulgated under the Securities Exchange Act of 1934, as amended (the Exchange Act). Based on that evaluation, our management, including the CEO and CFO, concluded that our disclosure controls and procedures were effective as of September 30, 2022. There have been no changes in our internal control over financial reporting identified in connection with the evaluation of internal control that occurred during the fourth fiscal quarter that has materially affected, or is reasonably likely to affect, our internal control over financial reporting, or in other factors that could significantly affect internal control subsequent to September 30, 2022.\nOur internal control report is included in this Form 10-K after Item 8, under the caption Managements Report on Internal Control over Financial Reporting.\n- 74 -       ITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) (1) and (2) FINANCIAL STATEMENTS AND SCHEDULES.\nAll financial statements and schedules required to be filed by Item 8 of this Form and included in this report have been so identified under Item 8. No additional financial statements or schedules are being filed since the requirements of paragraph (c) under Item 15 are not applicable to Meridian.\n(b) (3) EXHIBITS.\nExhibit\nNumber\nDescription of Exhibit\n2.1\nAgreement and Plan of Merger, dated as of July 7, 2022, by and among Meridian, SD Biosensor, Inc., Columbus Holding Company, and Madeira Acquisition Corp. (Incorporated by reference to Meridians Form 8-K filed with the Securities and Exchange Commission (SEC) on July 7, 2022)\n3.1\nAmended Articles of Incorporation (Incorporated by reference to Meridians Form 10-K filed with the SEC on November 26, 2019)\n3.2\nAmended and Restated Code of Regulations (Incorporated by reference to Meridians Form 10-K filed with the SEC on November 26, 2019)\n4.1\nDescription of Securities (Incorporated by reference to Meridians Form 10-K filed with the SEC on November 26, 2019)\n10.1*\nAmendment No. 1 to Supplemental Benefit Agreement Dated September 23, 2014 between Meridian and John A. Kraeutler (Incorporated by reference to Meridians Form 8-K filed with the SEC on September 25, 2014)\n10.2*\nThird Amended and Restated Employment Agreement Dated October 3, 2016 between Meridian and John A. Kraeutler (Incorporated by reference to Meridians Form 8-K filed with the SEC on October 5, 2016)\n10.3*\nAmended and Restated Employment Agreement dated effective October 1, 2019 between Meridian and John P. Kenny (Incorporated by reference to Meridians Form 8-K filed with the SEC on November 7, 2019)\n10.4*\n2012 Stock Incentive Plan, effective January 25, 2012 (Incorporated by reference to Meridians Quarterly Report on Form 10-Q for the Quarterly Period Ended December 31, 2011)\n10.5*\nIsraeli Appendix to the Meridian Bioscience, Inc. 2012 Stock Incentive Plan dated effective July 10, 2020 (Incorporated by reference to Meridians Annual Report on Form 10-K for the Fiscal Year Ended September 30, 2020)\n- 75 -\n10.6*\nMeridian Bioscience, Inc. 2021 Omnibus Award Plan (Incorporated by reference to Meridians Quarterly Report on Form 10-Q for the Quarterly Period Ended March 31, 2021)\n10.7*\nForm of Time-Based Restricted Share Unit Award Agreement (Incorporated by reference to Meridians Form 10-K filed with the SEC on November 23, 2021)\n10.8*\nForm of Nonqualified Stock Option Agreement (Incorporated by reference to Meridians Form 10-K filed with the SEC on November 23, 2021)\n10.9*\nForm of Performance-Based Restricted Share Unit Award Agreement (Incorporated by reference to Meridians Quarterly Report on Form 10-Q for the Quarterly Period Ended December 31, 2021)\n10.10*\nChief Executive Officer Cash-Based Incentive Compensation Plan for Fiscal Year 2022 (Incorporated by reference to Meridians Quarterly Report on Form 10-Q for the Quarterly Period Ended December 31, 2021)\n10.11*\nExecutive Vice President Cash-Based Incentive Compensation Plan for Fiscal Year 2022 (Incorporated by reference to Meridians Quarterly Report on Form 10-Q for the Quarterly Period Ended December 31, 2021)\n10.12*\nForm of Meridian Bioscience, Inc. Change in Control Agreement dated August 4, 2016 (Incorporated by reference to Meridians Quarterly Report on Form 10-Q for the Quarterly Period Ended June 30, 2016)\n10.13\nAmended and Restated Credit Agreement, dated as of October 25, 2021, by and among Meridian Bioscience, Inc., as Borrower, the Guarantors party thereto, the Lenders party thereto, PNC Bank, National Association, as administrative agent, PNC Capital Markets LLC, as joint lead arranger and sole bookrunner, and Fifth Third Bank, National Association, as joint lead arranger and syndication agent (Incorporated by reference to Meridians Form 8-K filed with the SEC on October 29, 2021)\n10.14*\nOffer Letter, dated February 8, 2022, between Meridian and Andrew Kitzmiller (Incorporated by reference to Meridians Form 8-K filed with the SEC on February 21, 2022)\n10.15\nForm of Indemnification Agreement (Incorporated by reference to Meridians Current Report on Form 8-K filed with the SEC on July 7, 2022)\nList of Subsidiaries of the Registrant (Filed herewith)\n23.1\nConsent of Independent Registered Public Accounting Firm (Filed herewith)\n23.2\nConsent of Independent Registered Public Accounting Firm (Filed herewith)\n31.1\nCertification of Principal Executive Officer required by Rule 13a-14(a) (Filed herewith)\n31.2\nCertification of Principal Financial Officer required by Rule 13a-14(a) (Filed herewith)\n32**\nSection 1350 Certification of Chief Executive Officer and Chief Financial Officer (Furnished herewith)\n101.INS***\nInline XBRL Instance Document\n101.SCH***\nInline XBRL Taxonomy Extension Schema\n- 76 -\n101.CAL***\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF***\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB***\nInline XBRL Taxonomy Extension Label Linkbase\n101.PRE***\nInline XBRL Taxonomy Extension Presentation Linkbase\n104***\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n* Management Compensatory Contracts\n** Furnished, not filed\n*** Pursuant to Rule 406T of Regulation S-T, these interactive data files are deemed not filed or part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933 or Section 18 of the Securities Exchange Act of 1934 and otherwise are not subject to liability.\nSchedules to and certain portions of these exhibits have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The omitted information is not material and would likely cause competitive harm to the Registrant if publicly disclosed. The Registrant hereby agrees to furnish a copy of any omitted schedule or other portion to the SEC upon request.\nMeridian will provide shareholders with any exhibit upon the payment of a specified reasonable fee, which fee shall be limited to Meridians reasonable expenses in furnishing such exhibit.\nITEM 16.\nFORM 10-K SUMMARY\nNot applicable.\n- 77 -\nSIGNATURES\nPursuant to the requirements of Sections 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMERIDIAN BIOSCIENCE, INC.\nBy:\n/s/ Jack Kenny\nDate: November 22, 2022\nJack Kenny\nChief Executive Officer\nWe, the undersigned directors and officers of the Registrant, hereby severally constitute Jack Kenny and Andrew S. Kitzmiller, and each of them singly, our true and lawful attorneys with full power to them and each of them to sign for us, in our names in the capacities indicated below, any and all amendments to the Annual Report on Form 10-K filed with the Securities and Exchange Commission.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nCapacity\nDate\n/s/ Jack Kenny\nChief Executive Officer and Director\nNovember 22, 2022\nJack Kenny\n/s/ Andrew S. Kitzmiller\nExecutive Vice President and Chief\nNovember 22, 2022\nAndrew S. Kitzmiller\nFinancial Officer (Principal Financial Officer)\n/s/ Julie Smith\nSenior Vice President and Controller\nNovember 22, 2022\nJulie Smith\n(Principal Accounting Officer)\n/s/ John C. McIlwraith\nChairman of the Board\nNovember 22, 2022\nJohn C. McIlwraith\n/s/ James M. Anderson\nDirector\nNovember 22, 2022\nJames M. Anderson\n/s/ Anthony P. Bihl III\nDirector\nNovember 22, 2022\nAnthony P. Bihl III\n/s/ Dwight E. Ellingwood\nDirector\nNovember 22, 2022\nDwight E. Ellingwood\n/s/ John M. Rice, Jr.\nDirector\nNovember 22, 2022\nJohn M. Rice, Jr.\n/s/ Catherine A. Sazdanoff\nDirector\nNovember 22, 2022\nCatherine A. Sazdanoff\n/s/ Felicia Williams\nDirector\nNovember 22, 2022\nFelicia Williams\n- 78 -\nSCHEDULE II\nMeridian Bioscience, Inc.\nand Subsidiaries\nValuation and Qualifying Accounts\n(Dollars in thousands)\nYears Ended September 30, 2022, 2021 and 2020\nDescription\nBalance at\nBeginning\nof Period\nCharged to\nCosts and\nExpenses\nDeductions\nOther (a)\nBalance at\nEnd of\nPeriod\nYear Ended September 30, 2022:\nAllowance for doubtful accounts\n$ 1,078\n$\n$ (662 )\n$ (37 )\n$ 1,325\nInventory realizability reserves\n4,997\n5,121\n(3,882 )\n(104 )\n6,132\nValuation allowances - deferred taxes\n1,624\n(760 )\n(103 )\n1,427\nYear Ended September 30, 2021:\nAllowance for doubtful accounts\n$\n$\n$ (34 )\n$\n$ 1,078\nInventory realizability reserves\n3,629\n2,703\n(1,297 )\n(38 )\n4,997\nValuation allowances - deferred taxes\n-\n-\n1,624\nYear Ended September 30, 2020:\nAllowance for doubtful accounts\n$\n$\n$ (75 )\n$\n$\nInventory realizability reserves\n2,441\n1,775\n(564 )\n(23 )\n3,629\nValuation allowances - deferred taxes\n(106 )\n-\n(a) Balances reflect the effects of currency translation.\n- 79 -"
}