{
    "cik": "796505",
    "company": "Clearfield, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-29",
    "period_of_report": "2023-09-30",
    "sic": "3661",
    "state_of_inc": "MN",
    "state_location": "MN",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/796505/0001171843-23-007342-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/796505/000117184323007342/clfd20230930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/796505/0001171843-23-007342.txt",
    "filename": "796505_10K_2023_0001171843-23-007342.htm",
    "content": "ITEM 1. BUSINESS\nCompany Overview\nWe design, manufacture, and distribute fiber protection, fiber management, and fiber delivery solutions to enable rapid and cost-effective fiber-fed deployment throughout the broadband service provider space primarily across North America. Our fiber to anywhere platform serves the unique requirements of Community Broadband customers (Tier 2 and 3 telco carriers, utilities, municipalities, and alternative carriers), Multiple System Operators (cable television), Large Regional Service Providers (ILEC operating a multi-state network with more than 500,000 subscribers), National Carriers (wireline/wireless national telco carriers (Tier 1)), and International customers (primarily Europe, Canada, Mexico, and Caribbean Markets).\nOur mission is to enable the lifestyle that better broadband provides through innovative product design that accelerates fiber-based deployment, making communications simpler and more affordable for people everywhere. We believe our products offer broadband service providers a competitive advantage at a crucial time when demand for fiber-based services is increasing to historic levels as providers focus on passing and connecting more homes. We are driven to help broadband service providers reduce the cost - and increase the speed - of fiber deployment.\nStrategy Overview\nIn 2022, we launched a transformative multi-year strategy plan called LEAP. To leap means jumping higher, further and with greater force. The LEAP plan is our roadmap to how we intend to scale as a company to seize the opportunity Clearfield was built to achieve. There are four tenets in our LEAP plan, one for each letter.\nThe L is to leverage our decade-long excellence in community broadband. We are a leader in community broadband fiber connectivity and have been focused on serving this market since we were founded. We make decisions by listening to our customers and understanding their evolving needs. Building on our decade plus of success in this market, weve demonstrated that we can nimbly adapt to a changing marketplace and grow with our customers as they grow.\nThe E is to execute capacity enhancement. This tenet is centered around aligning us closer to market demand by building production capacity that facilitates optimal time to market. We are structured to maintain our market leadership position and to gain market share from competitors and grow the business overall, by matching our capacity to address the significant market demand for fiber broadband.\nThe A is to accelerate infrastructure investments. This tenet reflects our commitment to continue investing in our organizational infrastructure to support the growing business and effectively manage our expanded capacity. This includes attracting and retaining key personnel, optimizing internal processes, and adding information systems to take advantage of the opportunity to achieve scalable company growth.\nFinally, the P in LEAP stands for position innovation at the forefront of our value proposition. Accelerating our customers time to revenue by designing craft-friendly products that require less skilled labor is the foundation of our value proposition. We intend to achieve this tenet by emphasizing innovation in our product designs and increasing the cadence of our product expansions with the goal of facilitating our customers fiber broadband deployments.\nSegments\nWe are engaged in global operations. Our operations currently comprise of two reportable segments: the Clearfield Operating Segment (referred to herein as Clearfield), and the Nestor Cables Operating Segment (referred to herein as Nestor Cables or Nestor), which we established following our acquisition of Nestor Cables on July 26, 2022. Prior to July 26, 2022, we had a single reportable segment structure.\nClearfield Operating Segment\nClearfield is focused on providing fiber management, fiber protection, and fiber delivery products that accelerate the turn-up of fiber-based networks in residential homes, businesses, and network infrastructure in the wireline and wireless access network. We offer a broad portfolio of fiber products that allow service providers to build fiber networks faster, meet service delivery demands, and align build costs with take rates.\nClearfields products allow its customers to connect twice as many homes in their Fiber to the Home (FTTH) builds by using fewer resources in less time. Our products speed up the time to revenue for our service provider customers in Multiple Dwelling Units (MDUs) and Multiple Tenant Units (MTUs) by reducing the amount of labor and materials needed to provide gigabit service. Our products help make business services more profitable through faster building access, easier reconfiguration, and quicker services turn-up. Finally, Clearfield is removing barriers to wireless 4G/5G deployments in backhaul from the tower to the cloud and fiber fronthaul from the tower to the antenna at the cell site through better fiber management, test access, and fiber protection.\nSubstantially all of the final build and assembly is completed at Clearfields plants in Brooklyn Park, Minnesota and Tijuana, Mexico, with manufacturing support from a network of domestic and global manufacturing partners. Clearfield specializes in producing these products on both a quick-turn and scheduled delivery basis.\nNestor Cables Operating Segment\nAs of July 26, 2022, Clearfield, through its newly created Finnish subsidiary, Clearfield Finland Oy, acquired Nestor Cables. Nestor Cables is based in Oulu, Finland, with operations in Estonia through its wholly owned subsidiary, Nestor Cables Baltics OÜ. Nestor Cables manufactures fiber optic and copper telecommunication cables and equipment which it distributes to telecommunication operators, network owners, electric companies, building contractors, and industrial companies. Prior to the acquisition, Nestor Cables had been a supplier to Clearfield for over a decade and that relationship continued following the closing of the acquisition. Nestor has two types of production processes, the process of making cable in its Finland facility and the finished assembly portion of its business performed in Estonia. Nestor Cables customer base includes telecom operators, network owners, contractors, industries and wholesalers. Products are sold via distributors and directly to end users. Nestor Cables is subject to Finnish government regulation and Nestor Cables Baltics is subject to Estonian government regulation.\nProducts\nOur product strategy involves analyzing the broadband communications industry environment and technology, with a particular focus on simplifying our customers business, and developing innovative, high-quality products utilizing modular designs wherever possible. We are committed to make fiber deployment success easier by providing craft-friendly, pre-connectorized plug-and-play fiber assemblies, fiber management and pathway products to speed deployments and provide the lowest total cost of ownership for our customers networks. With the innovation of forward-thinking products, a 100 percent plug-and-play platform and creative deployment methods, we are fulfilling our mission to enable the lifestyle that better broadband provides.\nThroughout the fiber deployment journey from the Inside Plant (ISP) to the Outside Plant (OSP), into the Access Network and all the way to the fiber connection at the home, our labor lite solutions solve service provider fiber network design and installation challenges. Our methodologies provide easy to engineer and easy to install solutions that take the mystery out of deploying fiber networks.\nLeveraging factory terminated single-fiber and multi-fiber plug-and-play connectors, homes passed, and homes connected metrics can be greatly increased. The speed to turn up the entire network is maximized, while helping ensure superior optical performance achieved by using low-loss connectors, terminated in the factory.\nWhether inside a cabinet or at the home, innovative slack storage spools and deploy reels reduce the dependence on making exact cable measurements. This enables the deployment of double-ended, standard cable lengths rather than relying on highly engineered, built to order cable assemblies or multiple field splicing events.\nProduct development for the Companys product line program has mainly been conducted internally. We believe that the communication industry environment is constantly evolving, and our success depends on our ability to anticipate and respond to these changes. Research and development are reflected in Selling, General, & Administrative expenses.\nSome of our products currently offered are described below:\nFieldSmart® is a series of panels, cabinets, wall boxes and other enclosures that provide a consistent design from the inside plant of the telcos central office or cable televisions head-end, all the way through the outside plant to the access network to within the home or business. The Clearview® Cassette is the core building block of every product within the FieldSmart fiber management system. Clearview configuration options support tool-less installation, in-cassette buffer tube/ribbon slack storage as well as front access-only designs. The small footprint reduces real estate costs and improves density without compromising critical design elements of access, bend-radius protection, physical fiber protection and route path diversity. All types of fiber cable construction can be integrated within the cassette to support all patch only, patch and splice (in-cassette splicing), passive optical component hardware and plug-and-play scenarios.\nWaveSmart® optical components are integrated for signal coupling, splitting, termination, multiplexing, demultiplexing and attenuation for a seamless integration within our fiber management platform. The products are built and tested for harsh environments to meet the strictest industry standards ensuring customers trouble-free performance in extreme outside plant conditions.\nActive Cabinets using our FiberFlex product lines feature either fully integrated, fully engineered cabinets equipped with specific active electronics configurations or universal cabinets ready for mounting other electronic equipment. This product line features Clearfields fiber management solutions housing the Clearview Cassette. The FieldSmart® FiberFlex product line of outdoor active cabinets feature multiple sizes for universal configurations of electronic equipment.\nCraftSmart® FiberFirst™ pedestals are designed to support fiber-only networks. Purpose-built to support a wide variety of service network designs, the pedestal eliminates the need for multiple, specialty pedestals and can support a passive optical network (PON) option, a splice-only option, or an access terminal option. The FiberFirst Pedestal Access Terminal options provide a cable management and mounting bracket kit that supports the deployment of all Clearfield access terminals.\nAccess Terminals from Clearfield are designed to ensure every service provider has the freedom of choice to match drop cable configuration and technology with the needs of their environment and first-cost priorities. The patented SeeChange® terminal and hardened connector system lets the operator push fiber deeper in the neighborhood using a completely plug-and-play approach. The YOURx® access terminals also offer flexibility with cable mid-span and internal splicing options. Clearfield access terminals can be deployed in a variety of locations including pedestal, vault, flowerpot, pole-mount, smart-pole, or strand mounted options.\nFieldShield® platform is a patented fiber pathway and protection method aimed at reducing the cost of broadband deployment. Our FieldShield fiber drop cable assemblies are designed to connect the fiber access point (hand hole, pedestal or aerial) to the optical network terminal (ONT), on the home, in a fiber to the home (FTTH) network. FieldShield starts with a ruggedized microduct designed to support all aerial, direct bury, and inside plant last mile needs. FieldShield microduct is strong enough to be placed using traditional methods of boring and plowing, leveraging existing conduit placement equipment, as well as newer, less disruptive technologies such as micro trenching or saw cutting.\nFiber Assemblies - Clearfield manufactures high quality fiber assemblies with an industry-standard or customer-specified configuration.  In addition, Clearfields engineering services team works alongside the engineering design departments of our original equipment manufacturer (OEM) customers to design and manufacture custom solutions for both in-the-box as well as network connectivity assemblies specific to that customers product line.\nFiber Optic Cables manufactured by Nestor Cables include a comprehensive range of optical fiber cables that offer dependable solutions for various installation conditions and special requirements, including direct buried cables, duct cables, microduct cables, indoor/outdoor cables, aerial cables and submarine cable.\nCopper Cables manufactured by Nestor cables include copper conducted instrumentation and automation cables as well as central and signaling cables Nestor also manufactures copper cable for telecommunications networks.\nNestor Optimus product family is a complete solution which includes all needed products - cables, microducts, microduct accessories and tools - for construction of microduct networks which are easily expandable, suitable for changing and growing urban and suburban areas, and enables the use of lighter installation techniques, which reduces construction costs and interference during installation.\nNesCon Connectivity Products is a product family by Nestor Cables that includes essential installation and connection accessories for fiber optic networks, all of which are compatible with Nestor Cables optical fiber cables.\nMarkets and Customers\nThe Companys products are sold across broadband service providers, which we categorize as National Carrier (wireline/wireless national telco carriers (Tier 1)), Community Broadband (Tier 2 and 3 telco carriers, utilities, municipalities, and alternative carriers), Large Regional Service Providers (ILEC operating a multi-state network with more than 500,000 subscribers), Multiple System Operators (cable television), International (primarily Europe, Central/Latin America and Canada), and Legacy build-to-print copper and fiber assemblies (primarily contract manufacturing). Nestors products are sold to telecommunication wholesalers and telecommunication operators, primarily in Europe.\nThe Companys products are sold direct to customers through the Companys sales force as well as through authorized distributors. In addition, the Company uses manufacturing sales representatives and sales agents for customer and geography specific needs.\nThe Company considers the primary markets for its products to be as follows:\nFTTP\nFiber to the Premise (also called Fiber to the Home) is a means of delivering the highest possible level of bandwidth directly to the user. The Companys sales and marketing efforts have principally been focused on the U.S., with additional efforts in Canada and Central/Latin America. We intend to leverage our Nestor platform to cross sell connectivity products into Europe.\nFTTB\nFiber to the Business is principally for Multiple System Operators (cable television) and wireline/wireless national telco carriers (Tier 1) to penetrate the business marketplace.\nFTT-Cell site\nFiber to the Cell site is the trend in which wireless service providers enhance their coverage for bandwidth. Currently, the majority of these cell sites are served by fiber backhaul and fronthaul.\nBuild to Print\nIn addition to a proprietary product line designed for the broadband service provider marketplace, Clearfield provides contract manufacturing services for original equipment manufacturers requiring copper and fiber cable assemblies built to their specification.\nCompetition\nThe market for the fiber management, fiber protection, and fiber delivery products provided by the Clearfield segment is highly competitive. Competition is largely based on any one or a combination of the following factors: functionality and features, price, product quality, product availability and lead times, cost and ease of installation, service and support, long-term returns to customers, scalability, product innovation, and manufacturing capability.\nCompetitors to the FieldSmart product lines include, but are not limited to, products offered by Corning Cabling Systems, Inc., OFS (Furukawa Electric North America, Inc.), AFL Telecommunications (a subsidiary of Fujikura Ltd.), Fujikura Ltd., Nokia, Hextronics Group and CommScope, Inc. Competitors to the CraftSmart and FiberFlex active cabinet product lines include products offered by Emerson Network Power, a subsidiary of Vertiv Co., and Charles Industries, Ltd., a subsidiary of Amphenol. Competitors to FieldShield product lines include products offered by PPC Broadband, a subsidiary of Belden, Inc and Emtelle UK Limited. In various geographic or vertical markets, there are also several smaller companies with which we compete. Clearfield believes that it has a competitive advantage with customers who can leverage the cost savings the Clearview Cassette can provide and those who require quick-turn, high-performance customized products, and that it is at a competitive disadvantage with customers who principally seek large volume commodity products.\nThe Nestor Cables segment faces competition from numerous competitors within each of the markets it serves. The Nestor Cables segment competes primarily on the basis of its product performance and its ability to meet its customers highly specified design, engineering and delivery needs on a timely basis. The market demand and resulting build rates of fiber optic networks and capital expenditures by telecommunications wholesalers and telecommunications providers, has a large and direct influence on the demand for the Nestor Cables segment products.\nMany of our competitors have greater resources than we do, including greater sales, product development, marketing, financial, technical, or engineering resources. As a result, our competitors may be able to procure necessary components and labor at much lower prices than we can or may offer competitive products at below market prices, which could prevent us from competing effectively.\nSources of Materials and Supply Chain\nNumerous purchased materials and components and sources of labor are used in the manufacturing of the Companys products. Most of these are available from multiple suppliers. However, some components and third-party contract manufacturing services are purchased from a single or a limited number of suppliers. The loss of access to some components and third-party contract manufacturing services could have an adverse effect on our ability to deliver products on a timely basis and on our financial performance.\nClearfields Mexico facility operates under a Maquiladora arrangement. Under this arrangement, we contract with a company to provide certain personnel and other services at the production facilities in Mexico that complete final build and assembly of a significant portion of Clearfields products. Maquiladora status also allows us to import certain items from the United States into Mexico duty-free, provided that such items, after processing, are exported from Mexico within a stipulated time frame.\nOur supply chain management team oversees our suppliers to source and procure materials, manufacture and deliver our products to customers from the site of manufacture, whether at Clearfields facility in Brooklyn Park, Minnesota or the facility in Tijuana, Mexico that operates as Maquiladoras. Our supply chain management team consists of planning, sourcing, and logistics personnel. We tightly integrate our supply chain management, our product innovation activities, and our manufacturing operations. Our supply chain team also manages the critical logistics and transport services for our materials, components and finished products in and out of Mexico to ensure sufficient materials to timely produce products and to ensure timely export of products in order to qualify as duty-free.\nOver the last several years, we have taken steps to improve our supply chain operations, enhance resiliency and mitigate risk of disruption.\nMajor Customers and Financial Information about Geographic Areas\nFor the fiscal year ended September 30, 2023, the Company had one customer that comprised 16% of net sales. This customer is a distributor. For the fiscal year ended September 30, 2022, the Company had one customer that comprised 14% of net sales. This customer was a distributor. For the fiscal year ended September 30, 2021, the Company had two customers that comprised a combined 28% of net sales. Both of these customers were distributors. These major customers, like our other customers, purchase our products from time to time through purchase orders and we do not have any agreements that obligate these major customers to purchase products in the future from us.\nAs of September 30, 2023, three customers accounted for a combined 40% of accounts receivable. These customers are all distributors. As of September 30, 2022, one customer accounted for 20% of accounts receivable. This customer is a distributor.\nThe Company allocates sales from external customers to geographic areas based on the location to which the product is transported. Sales outside the United States are principally to customers in Canada as well as countries in the Caribbean, Europe and Central and South America. Since our acquisition of Nestor Cables in July 2022, we experienced an increased concentration of customers based in Europe.\nPatents and Trademarks\nAs of September 30, 2023, Clearfield has 47 patents granted and multiple patent applications pending both inside and outside the United States. These patents begin to expire in 2028. We have also developed and are using multiple trademarks and logos to market and promote our products.\nSeasonality\nWe are affected by the seasonal trends in the industries we serve. We typically experience sequentially lower sales in our first and second fiscal year quarters, primarily due to customer budget cycles, deployment schedules of outdoor products, some customer geographical concentrations, as well as standard vacation and holiday calendars. Sales have usually reached a seasonal peak in our third and fourth fiscal quarters.\nHuman Capital Resources\nAs of September 30, 2023, the Company had approximately 400 full-time employees, of which 65% were based in the United States (U.S.) and 35% were based outside of the U.S., primarily in Finland and Estonia due to our Nestor Cables operations. We also employ seasonal, part-time employees and independent contractors. Subject to customarily local collective bargaining arrangements for employees in Finland and Estonia, none of our employees are covered by any collective bargaining agreement.\nOur U.S. employees include approximately 165 office personnel and 100 manufacturing personnel as of September 30, 2023. The substantial majority of these employees work out of our Brooklyn Park, Minnesota headquarters. The Companys office personnel are comprised of sales, marketing, engineering, and administrative personnel. The manufacturing personnel include both individuals directly involved in the manufacturing of our products, as well as warehouse and operations supervisory personnel. Certain positions within our organization require industry specific technical knowledge. Our manufacturing personnel currently work in one shift as needed at our Brooklyn Park facility.\nWe invest significant management attention, time, and resources to attract, engage, develop, and retain our employees, particularly for positions that require technical knowledge or expertise. For this reason, we offer rigorous training programs for manufacturing and other technical employees to allow them to develop the necessary skillset for their roles and promote career development. To date, our training programs and overall collaborative working environment have allowed us to be successful in attracting and retaining qualified technical personnel for these positions.\nNestor Cables has approximately 30 office personnel and 105 manufacturing personnel as of September 30, 2023.\nAs of September 30, 2023, we had contracted for approximately 600 personnel in the Mexico facility through a Maquiladora agreement.\nIn our manufacturing operations, we monitor key metrics and goals based on quality, productivity, and ability to meet shipping promise dates. As a measure of quality, we focus on First Pass Yield (FPY), which is calculated as the percentage of product that meets all performance criteria upon first completion from our manufacturing floor and requires no rework. The Companys target for FPY ranges from 92-99%, depending on key manufacturing steps and the product line being produced. We also measure our On-Time Delivery (OTD) which is determined by the Companys ability to ship product on the date necessary, accounting for standard shipping times, in order to meet the agreed upon delivery date with our customers. The Companys OTD target is a minimum of 95%. This metric is important as the Company has taken a strategic approach to be able to offer low industry lead times for our customers. The Company incentivizes certain of its personnel based on these metrics.\nClimate Change\nCertain government and regulatory bodies have introduced or are contemplating regulatory changes relating to climate change. While we do not believe climate-related risks are reasonably likely to have a material impact on our business, results of operations, or financial condition at this time, we are continuing to assess the nature and extent of risk from a changing climate and the potential for increased regulation.\nThe majority of our manufacturing operations calls for compiling raw material and other purchased components from suppliers. As part of our operations, we focus on minimizing scrap and other waste and look to recycle and salvage this scrap wherever possible. Any new regulation of emissions may result in additional costs to our suppliers which may be passed on to us.\nIn addition, the physical impacts of climate change and other natural events, including adverse weather conditions such as heavy or sustained rainfall, flooding, cold weather and snow, can impact deployment schedules of outdoor products and potentially affect demand for our products. Additionally, we may need to take into account an increase in the frequency of extreme weather events in the development of our products.\nAn increase in the frequency of extreme weather events, changes in weather patterns, drought, rising ocean and temperature levels, earthquakes and the like may impact our manufacturing operations or the manufacturing operations of suppliers of our critical raw materials or components. These types of impacts may also result in transportation-related supply chain challenges and negatively impact the delivery of raw materials, components, or products to or from our facilities. These potential physical effects may increase costs, cause delays or shortages in components required to produce our products or cause delays in the shipment of our products to customers.\nChanges in environmental and climate change laws or regulations, including laws relating to greenhouse gas (GHG) emissions, could lead to new or additional investment in the Companys products or facilities and could increase environmental compliance expenditures. Changes in climate change concerns, or in the regulation of such concerns, including GHG emissions, could subject the Company to additional costs and restrictions, including increased energy and raw material costs and other compliance requirements which could negatively impact the Companys reputation, business, capital expenditures, results of operations, and financial position.\nCorporate Information\nClearfield, Inc. was incorporated under the laws of Minnesota in 1979. Our corporate headquarters are located at 7050 Winnetka Avenue North, Suite 100, Brooklyn Park, Minnesota, 55428, and our corporate website is www.seeclearfield.com. We do not incorporate the information on or accessible through our website into this annual report on Form 10-K, and you should not consider any information on, or that can be accessed through, our website as part of this annual report on Form 10-K.\nOur annual report on Form 10-K, our quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act are available free of charge at our website as soon as reasonably practicable after we file such material with, or furnish it to, the SEC. The SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers, like Clearfield, that file electronically with the SEC and that internet site is http://www.sec.gov.\nWe use various trademarks and trade names in our business, including without limitation our corporate name and logo. Solely for convenience, the trademarks and trade names in this annual report may be referred to without the ® and ™ symbols, but such references should not be construed as any indicator that we will not assert, to the fullest extent under applicable law, our rights thereto. ITEM 1A. RISK FACTORS\nRisks Relating to Our Operations\nInflationary price pressures and uncertain availability of components, raw materials, labor and logistics used by us, and our suppliers could negatively impact our profitability.\nIncreases in the price of raw materials, labor and other components utilized in the production of our products, along with logistics and other related costs, may lead to higher production and shipping costs for our products. Additionally, increasing global demand for, and uncertain supply of, such materials could disrupt our ability to obtain such materials in a timely manner to meet our supply needs and could lead to increased costs. An increase in the cost of inputs needed to produce our products could lead to higher costs and could negatively impact our results of operation, future profitability, and ability to meet customer demand. Passing along these increased prices to our customers to offset the impact of higher costs may cause certain customers to cancel, push out, or refrain from purchasing our products, which could negatively impact demand for our products, and therefore also negatively impact our results of operations and future profitability.\nWe rely on single-source suppliers, which could cause delays, increases in costs, or prevent us from completing customer orders, all of which could materially harm our business.\nWe assemble our products using materials and components supplied by various subcontractors and suppliers. We purchase critical components for our products, including injected molded parts, various cabling, optical components, and connectors from third parties, some of whom are single- or limited-source suppliers. If any of our suppliers are unable to ship critical components, we may be unable to manufacture and ship products to our distributors or customers. If the price of these components increases for any reason, or if these suppliers are unable or unwilling to deliver, we may have to find another source, which could result in interruptions, increased costs, delays, lost sales, and quality control problems.\nFurther, the costs to obtain certain raw materials and supplies, such as fiber and copper cabling, are subject to price fluctuations, which may be substantial, because of global market demands. Many companies utilize the same raw materials and supplies in the production of their products as we use in our products. Companies with more resources than us may have a competitive advantage in obtaining raw materials and supplies due to greater purchasing power. Some raw materials or supplies may be subject to regulatory actions, which may affect available supplies. Further, tariffs may be imposed by the U.S. on imports from other countries that are the single- or limited-source of our materials and components. Tariffs increase the cost of the materials and components that go into making our products, but we are generally unable to pass most of these increased costs on to our customers. Accordingly, these increased costs adversely impact the gross margin that we earn on our products. Furthermore, due to general economic conditions in the U.S. and globally, our suppliers may experience financial difficulties, which could result in increased delays, additional costs, or loss of a supplier.\nThe termination or interruption of any of these relationships, or the failure of these manufacturers or suppliers to supply components or raw materials to us on a timely basis or in sufficient quantities, likely would cause us to be unable to meet orders for our products and harm our reputation and our business. Identifying and qualifying alternative suppliers would take time, involve significant additional costs, and may delay the production of our products. If we fail to forecast our manufacturing requirements accurately or fail to properly manage our inventory with our contract manufacturers, we could incur additional costs, experience manufacturing delays, and lose sales. Further, if we obtain a new supplier or assemble our product using an alternative source of supply, we may need to conduct additional testing of our products to ensure they meet our quality and performance standards. Any delays in delivery of our product to distributors or customers could be extended, and our costs associated with the change in product manufacturing could increase.\nThe failure of our third-party manufacturers to manufacture the products for us or the failure of our suppliers of components and raw materials to supply us these items consistent with our requirements as to quality, quantity and timeliness could materially harm our business by causing delays, lost sales, increases in costs and lower gross profit margins.\nAn increasing number of products manufactured by the Company are produced outside the U.S., including in our Mexico facilities. The Companys manufacturing facilities in Mexico are authorized to operate as Maquiladoras by the Ministry of Economy of Mexico. Maquiladora status allows the Company to import certain items from the U.S. into Mexico duty-free, provided that such items, after processing, are exported from Mexico within a stipulated time frame. Maquiladora status, which is renewed periodically, is subject to various restrictions and requirements, including compliance with the terms of the Maquiladora program and other local regulations. Failure to comply with these regulations or other disruptions within the program could adversely affect the Companys financial position, results of operations, and cash flows.\nWe depend on the availability of sufficient supply of certain materials. Global disruptions in the supply chain for these materials could prevent us from meeting customer demand for our products.\nWe purchase critical components for our products, including injected molded parts, various cabling, optical components, components for active cabinets, and connectors from third parties, some of whom are single- or limited-source suppliers. We depend on the ability of these third-party suppliers to secure a sufficient supply of raw materials and maintain sufficient manufacturing and shipping capacity. The global supply chain for raw materials critical to our products has in the past, and may again in the future, suffer shortages, shipping delays and shipping shortages. This may lead some manufacturers who depend on these raw materials to experience shortages, delivery delays and price increases for both the raw materials and shipping, with the corresponding consequence that these manufacturers may be delayed in delivering products to us or may charge higher prices for these products, or there may be increased shipping costs associated with the products. Some manufacturers may also allocate short supply of products among Clearfield and their other customers.\nIncreased demand for the Companys products from its customers may put pressure on the Companys supply chain, particularly during periods of disruption in the global supply chain and may lead to increases in costs or delays in obtaining the materials and components for our products from our suppliers. The Companys ability to recognize revenue in the future for customer orders will depend on our ability to manufacture and deliver products to the customers and fulfill other contractual obligations. Our ability to meet future customer demand for our products will in turn depend upon our suppliers receiving timely and adequate supplies of raw materials to be able to produce the critical materials and components they supply to us. Although we place a high value on long-term relationships with our suppliers, generally we do not have long-term supply contracts but instead conduct business on an order-by-order basis. Therefore, we also compete with other companies for the production capacity of manufacturers of the materials and components we need for our products. We also are exposed to potentially increasing costs associated with the materials and components we purchase from suppliers or increased costs associated with shipping generally. We may attempt to mitigate the effect of increases in our cost of goods sold through sourcing or stocking initiatives and by selectively increasing the prices of our products. However, we may be unable to fully pass on these costs to our customers. Long lead times for certain components and changes in demand for our products may impact our ability to accurately forecast our production requirements. As a result, certain component inventory purchases may become excess or obsolete, which could have an adverse effect on our financial condition and results of operations.\nThe reduction of available production capacity among our suppliers, their failures to meet production deadlines or increases to us in their manufacturing or shipping costs may impact our ability to deliver quality products to our customers on a timely basis, make our products less competitive due to extended delivery times or increased price, negatively impact our customer or distributor relationships, and result in lower net sales and profit. Any delays or inabilities in meeting customer required shipping dates may also expose us to order cancellations in our sales order backlog by customers, which could have an adverse effect on our results of operations.\nA significant percentage of our sales in the last three fiscal years have been made to a small number of customers, and the loss of these major customers could adversely affect us.\nOur customer base includes direct customers, OEMs, and distributors. For fiscal year 2023, the Company had one customer that comprised 16% of net sales. For fiscal year 2022, the Company had one customer that comprised 14% of net sales, and for fiscal year 2021 the Company had two customers that comprised a combined 28%, of net sales. These customers are all distributors.\nThese customers, like our other customers, purchase our products from time to time through purchase orders. We do not have any agreements that obligate our customers to purchase products in the future from us. Our agreements with our distributor customers do not prohibit them from purchasing or offering products or services that compete with ours.\nWe believe that the loss of our major distributor customers would likely result in purchases being re-directed through other sales channels, for example our other distributors, independent sales representatives, or through direct sales by the Company to customers. However, there can be no assurance that the loss of a distributor customer would not have an adverse effect on our sales or gross margins in this event.\nThe loss of any one or more of our key customers, the substantial reduction, delay, or cancellation of orders received from any of our customers in our sales backlog or our inability to collect the accounts receivable from these customers, could have a material adverse effect on our business, financial position and results of operations.\nFurther consolidation among our customers may result in the loss of some customers and may reduce sales during the pendency of business combinations and related integration activities.\nWe believe consolidation among our customers in the future will continue in order for them to increase market share and achieve greater economies of scale. In connection with this merger and acquisition activity, our customers may postpone or cancel orders for our product based on revised plans for technology or network expansion pending consolidation activity. Customers integrating large-scale mergers or acquisitions may also reduce their purchases of equipment during the integration period or postpone or cancel orders.\nThe impact of significant mergers and acquisitions among our customers on our business is likely to be unclear until sometime after such transactions are completed, which may take a year or more. After a consolidation occurs, a customer may choose to reduce the number of vendors from which it purchases equipment and may choose one of our competitors as its preferred vendor. There can be no assurance that we will continue to supply equipment to the surviving company after a business combination is completed.\nWe may be subject to risks associated with acquisitions, and the risks could adversely affect future operating results.\nWe monitor our product portfolio and business and customer trends. In response, we have made and may continue to make acquisitions. The success of our acquisitions will depend on our ability to successfully identify and properly value suitable acquisition candidates, negotiate appropriate acquisition terms, obtain financing at a reasonable cost, prevail against competing acquirers, complete the acquisitions, and integrate the acquired businesses into our existing business. We cannot ensure that the expected benefits of any acquisition will be realized or will be realized within the time frames we expect. Costs could be incurred on pursuits or proposed acquisitions that have not yet or may not close which could impact our operating results, financial condition, or cash flows. Additionally, after the acquisition, unforeseen issues could arise which adversely affect the anticipated returns, or which are otherwise not recoverable as an adjustment to the purchase price. The price we pay for a business or product line may exceed the value we realize, and we cannot provide assurance that we will obtain the expected revenues, anticipated synergies, and strategic benefits of any acquisition within the time we expect or at all. Acquisitions may result in the recording of goodwill and other intangible assets which are subject to potential impairments in the future that could negatively impact our financial results.\nIf we are unable to complete acquisitions or successfully integrate and develop acquired businesses, our financial results could be materially and adversely affected. The risks inherent in pursuing or completing an acquisition include:\n●\ndiversion of managements time and attention away from existing business activities;\n●\ndifficulties or delays in integrating and assimilating information and financial systems, operations and products of an acquired business or other business venture or in realizing projected efficiencies, growth prospects, cost savings and synergies;\n●\npotential difficulties in managing our expanded operations and, in the case of international acquisitions, potential difficulties in managing non-U.S. subsidiaries, including the burden and cost of complying with a variety of international laws;\n●\npotential loss of key employees, customers and suppliers of the acquired businesses or adverse effects on relationships with existing customers and suppliers;\n●\nadverse impact on overall profitability if the acquired business does not achieve the return on investment projected at the time of acquisition;\n●\ncurrency translations and fluctuations may adversely affect the financial performance of our consolidated operations; and\n●\nwith respect to the acquired assets and liabilities, inaccurate assessment of additional post-acquisition capital investments; undisclosed, contingent, or other liabilities; problems executing backlog of material supply or installation projects; unanticipated costs; and an inability to recover or manage such liabilities and costs.\nThese risks associated with acquisition, integration of acquired businesses and management of our expanded operations may have a material adverse effect on our sales, financial condition, and results of operations.\nWe have exposure to movements in foreign currency exchange rates.\nNestor Cables functional currency is the Euro, which is translated to the Companys reporting currency of the U.S. dollar. Fluctuations in exchange rates between the Euro and U.S. dollar may impact our results of operations, financial position and cashflows. The Company expects to continue to experience fluctuations in the value of the U.S. dollar against the Euro and other currencies if it is not possible, cost-effective or should we not elect to hedge certain currency exposure. These factors, which are variable and generally outside of our control, could materially impact our results of operations, anticipated future results, financial position, and cash flows.\nAdverse global economic conditions and geopolitical issues could have a negative effect on our business, and results of operations and financial condition.\nOur business, including global supply chain, is affected by global economic conditions and geopolitical issues. Geopolitical issues, such as the Russian invasion of Ukraine and related economic sanctions and tensions between Russia and NATO countries, has resulted in increasing global tensions, rising energy costs and creates uncertainty for our global supply chain. Sustained or worsening global economic conditions and geopolitical issues may disrupt or increase our cost of doing business and otherwise disrupt and delay our supply chain operations. These factors could negatively affect the cost and supply of components needed for our products, our ability to ship products to customers and ultimately impact our business, financial condition, and result of operations.\nGrowth may strain our business infrastructure, which could adversely affect our operations and financial condition.\nAs we grow, we will face the risk that our existing resources and systems, including management resources, enterprise technology and operating systems, may be inadequate to support our growth. There can be no assurance that we will be able to retain the personnel or make the changes in our systems that may be required to support our growth. Failure to secure these resources and implement these systems on a timely basis could have a material adverse effect on our operating results. In addition, hiring additional personnel and implementing changes and enhancements to our systems will require capital expenditures and other increased costs that could also have a material adverse impact on our operating results.\nProduct defects or the failure of our products to meet specifications or domestic content requirements could cause us to lose customers and sales or to incur unexpected expenses.\nIf our products do not meet our customers performance requirements, our customer relationships may suffer. Also, our products may contain defects or fail to meet product specifications. Any failure or poor performance of our products could result in:\n●\nlack of or delayed market acceptance of our products;\n●\ndelayed product shipments;\n●\nunexpected expenses and diversion of resources to replace defective products or identify and correct the source of errors;\n●\ndamage to our reputation and our customer relationships;\n●\ndelayed recognition of sales or reduced sales;\n●\nincreased product warranty claims; and\n●\nproduct liability claims or other claims for damages that may be caused by any product defects or performance failures.\nIn addition, certain of our products will be required to meet Build America, Buy America (BABA) Act domestic content requirements to enable certain customers to qualify for grant funding under the Broadband Equity, Access, and Deployment (BEAD) program. Any failure of such products to meet BABA domestic content requirements would result in those products being ineligible for purchase and use by certain customers under the BEAD program, and could result in lost sales, lost business opportunity, breach of warranty claims, and damage to our reputation and customer relationships.\nOur products are often critical to the performance of telecommunications systems. We offer customers limited warranty provisions. If the limitations on the product warranties are unenforceable in a particular jurisdiction or if we are exposed to product liability claims that are not covered by insurance, a claim could harm our business.\nWe are dependent on key personnel.\nOur failure to attract, develop and retain skilled personnel could hinder the management and growth of our business, our research and development, our sales and marketing efforts and our manufacturing capabilities. Our future success depends to a significant degree upon the continued services of key senior management personnel, including Cheryl Beranek, our Chief Executive Officer, and John P. Hill, our Chief Operating Officer. We have employment agreements with Ms. Beranek and Mr. Hill that provide that if we terminate the employment of either executive without cause or if the executive terminates her or his employment for good reason, we would be required to make specified payments to them as described in their employment agreements. We have key person life insurance on Ms. Beranek and Mr. Hill. We also have employment agreements with other key management. Further, our future success also depends on our continuing ability to attract, develop, retain, and motivate highly qualified managerial, technical and sales personnel. Our inability to attract, develop and retain qualified personnel could have a significant negative effect and thereby materially harm our business and financial condition.\nCyber-security incidents, including ransomware, data breaches or computer viruses, could disrupt our business operations, damage our reputation, result in increased expense and potentially lead to legal proceedings.\nCybersecurity threats continue to expand and evolve, making it difficult to detect and prevent such threats from impacting the Company. While we monitor our networks and continue to enhance our network security measures, cyber-attacks have increased in frequency and sophistication, and our efforts may not be adequate to prevent all cybersecurity incidents. Cybersecurity threats to the Company could lead to unauthorized access to the Companys information technology systems, customers, suppliers, and third-party service providers. Cybersecurity incidents could potentially result in the disruption of our business operations and/or the theft, destruction, publication, or corruption of critical data and confidential or proprietary information. Cybersecurity events could also result in the Company being unable to access critical data in a timely manner, or at all. Cybersecurity incidents could also result from unauthorized parties gaining access to our systems or information through fraudulent or other means of deceiving our employees, suppliers, customers, or third-party service providers. Despite the Companys implementation of preventative security measures and controls to prevent, detect, and mitigate these threats, our infrastructure may still be susceptible to disruptions from cybersecurity incidents including ransomware attacks, security breaches, computer viruses, outages, and systems failures, any of which could include the inability to access critical data, reputational damage, loss of our intellectual property, release of highly sensitive confidential information, litigation with third parties and/or governmental investigations and fines, which could have a material adverse effect on our financial condition and results of operations. Additionally, as cybersecurity threats continue to evolve, we may be required to devote additional resources to continue to enhance our information security measures and controls to mitigate these new and emerging threats.\nOur business is dependent on interdependent management information systems.\nWe rely on effective management information systems, including our enterprise resource planning (ERP) software, for critical business operations and to support strategic business decisions. We rely on our ERP system to support such important business operations as processing sales orders and invoicing, manufacturing, shipping, inventory control, purchasing and supply chain management, human resources, and financial reporting. Some of these systems are made up of multiple software and system providers. The interdependence of these solutions and systems is a risk, and the failure of any one system could have a material adverse effect on our overall information technology infrastructure. We are in the process of consolidating several of these solutions and systems into one integrated ERP system for our North American operations. Failure to successfully consolidate and integrate these solutions and systems could result in disruptions to our operations and adversely impact our business. Failure or abandonment of all or any part of the ERP system consolidation and integration project could result in a write-off of all or part of the costs that have been capitalized in connection with the project, which may negatively impact our financial results. We also rely on management information systems to produce information for business decision-making and planning. If we are unable to maintain our management information systems, including our IT infrastructure, to support critical business operations and to produce information for business decision-making activities, we could experience a material adverse impact on our business or an inability to timely and accurately report our financial results.\nOur IT systems may also be vulnerable to disruptions from human error, outdated applications, computer viruses, natural disasters, unauthorized access, cyber-attack, and other similar disruptions. Any system failure, accident or security breach could result in disruptions to our operations. To the extent that any disruptions, cyber-attack or other security breach results in a loss or damage to our data, or inappropriate disclosure of confidential information, it could harm our business. In addition, we may be required to incur significant costs to protect against damage caused by these disruptions or security breaches in the future.\nNatural disasters, extreme weather conditions or other catastrophic events could negatively affect our business, financial condition, and operating results.\nNatural disasters, extreme weather events and other catastrophic events such as flooding, tornadoes, hurricanes, unusually heavy precipitation, earthquakes, tsunamis, fires, explosions, acts of war, terrorism, civil unrest, or pandemics could increase the cost of doing business or otherwise harm our operations, our suppliers and our customers. Such events could reduce demand for our products or make it difficult or impossible for us to receive raw materials from suppliers and deliver products to our customers.\nPandemics and other health crises, including COVID-19, could have a material adverse effect on our business, financial condition, and operating results.\nPandemics and other health crises, including COVID-19, and governmental, business, and societal responses to pandemics or other health crises, have had, and in the future may have, an adverse effect on our operations, work force, supply chains, distribution channels, and customers. Constraints and limits imposed on our operations due to pandemics or other health crises may slow or diminish our sales and marketing programs, product development activities and qualification activities with our customers. Restrictions on our manufacturing, support operations or workforce, or similar limitations for our suppliers, could limit our ability to meet customer demand. Restrictions or disruptions of transportation, such as reduced availability of air transport, port closures and increased border controls or closures, resulting in higher costs and delays, could harm our profitability, make our products less competitive, or cause our customers to seek alternative suppliers. Employee health, availability, productivity, and efficiency may be adversely impacted. The degree to which pandemics and other health crises impact our results will depend on numerous factors and future developments, which are highly uncertain and cannot be predicted, including, but not limited to, the duration and spread of the outbreak, its severity, the actions to contain the pandemic and address its impact, and how quickly and to what extent normal economic and operating conditions can resume.\nRisks Relating to Our Markets and Industry\nTo compete effectively, we must continually improve existing products and introduce new products that achieve market acceptance.\nThe telecommunications equipment industry is characterized by rapid technological changes, evolving industry standards, changing market conditions and frequent new product and service introductions and enhancements. The introduction of products using new technologies, or the adoption of new industry standards can make our existing products, or products under development, obsolete or unmarketable. In order to remain competitive and increase sales, we will need to anticipate and adapt to these rapidly changing technologies, enhance our existing products and introduce new products to address the changing demands of our customers.\nMany of our competitors have greater engineering and product development resources than we have. Although we expect to continue to invest resources in product development activities, our efforts to achieve and maintain profitability will require us to be selective and focused with our research and development expenditures. In addition, sales to certain broadband service providers may require third-party independent laboratory testing in order to obtain industry certifications to be able to sell to those customers. Further, our existing and development-stage products may become obsolete if our competitors introduce newer or more appealing technologies. If these technologies are patented or proprietary to our competitors, we may not be able to access these technologies.\nIf we fail to anticipate or respond in a cost-effective and timely manner to technological developments, changes in industry standards or customer requirements, or if we experience any significant delays in product development or introduction, our business, operating results, and financial condition could be affected adversely.\nIf the telecommunications market does not continue to expand, our business may not grow as fast as we expect, which could adversely impact our business, financial condition, and operating results.\nOur future success as a provider of fiber management, fiber protection and fiber delivery products depends on the continued growth of demand for fiber broadband and, in particular, the continued expansion in the United States and in our other markets of information networks, particularly those directly or indirectly dependent upon a fiber optic infrastructure. As part of that growth, we anticipate that demand for voice, video, and other data services delivered over high-speed connections (both wired and wireless) will continue to increase. If this demand does not increase, the need for enhanced high-speed bandwidth using fiber connections may not increase. Currently, demand for high-speed broadband capabilities and access is increasing, but future growth may be limited by several factors, including, among others: (1) relative strength or weakness of the global economy or certain countries or regions, (2) an uncertain regulatory environment, (3) uncertainty regarding long-term sustainable business models as multiple industries, such as the cable, traditional telecommunications, wireless and satellite industries, offer competing content delivery solutions, (4) excess product inventory in the marketplace, (5) lack of available skilled labor to install product; and (6) delays in the permitting process for fiber optic network installations. If the factors described above were to occur and cause the demand for fiber broadband capabilities or access to slow, stop or reverse, our business, financial condition and operating results would be negatively affected.\nChanges in U.S. government funding programs may cause our customers and prospective customers to delay, reduce, or accelerate purchases, leading to unpredictable and irregular purchase cycles.\nThe telecommunications and cable television industries are subject to significant and changing U.S. federal and state regulation, some of which subsidizes or encourages spending on initiatives that utilize our products.\nFor example, programs like the Connect America Fund (CAF), which provides a capital expenditure subsidy for the build-out of the countrys broadband network, the Rural Digital Opportunity Fund (RDOF), which will provide a capital expenditure subsidy for the support of high-speed broadband networks in rural America, and the Broadband Equity, Access and Deployment (BEAD) program, among others, which will provide funding for broadband deployment, mapping and adoption projects in unserved and underserved areas in the United States, its territories, and the District of Columbia, may subsidize or encourage spending by our customers or prospective customers on capital spending projects that utilize our products. Customers may seek to time or otherwise adjust their technology or network expansion projects to the availability of subsidies under these or other programs, which will affect the timing and size of orders for our products. In addition, other universal service and inter-carrier compensation reforms scheduled to begin in the coming years will eliminate subsidies that carriers have traditionally relied upon to support service in high-cost, rural areas. Changes in government programs in our industry or uncertainty regarding future changes could adversely impact our customers or prospective customers decisions regarding timing and amounts of capital spending, which could decrease demand for our products, delay orders or result in pricing pressure from these customers. Moreover, disruptions at U.S. government agencies responsible for implementing broadband programs and subsidies, including as a result of government shutdowns or pandemics like COVID-19, may also delay the availability of subsidies or implementation of programs affecting our customers, which may adversely affect our business.\nIntense competition in our industry may result in price reductions, lower gross profits, and loss of market share.\nCompetition in the telecommunications equipment and services industry is intense. Our competitors may have or could develop or acquire marketing, financial, development and personnel resources that exceed ours. Our ability to compete successfully will depend on whether we can continue to advance the technology of our products and develop new products, the acceptance of our products among our customers and prospective customers, and our ability to anticipate customer needs in product development, as well as the price, quality and reliability of our products, our delivery and service capabilities and our control of production capacity and operating expenses.\nThere can be no assurance that we will be able to compete successfully against our current or future competitors. Competition from manufacturers of telecommunications equipment such as ours may result in price reductions, lower gross profit margins, increased discounts to customers, and loss of market share, which could require increased spending by us on research and development, sales and marketing, and customer support.\nOur success depends upon adequate protection of our patent and other intellectual property rights.\nOur future success depends in part upon our proprietary technology. We attempt to protect our proprietary technology through patents, trademarks, copyrights, and trade secrets. However, these legal means afford us only limited protection and may not adequately protect our rights or remedies to gain or keep any advantages we may have over our competitors. Accordingly, we cannot predict whether these protections will be adequate, or whether our competitors will develop similar technology independently, without violating our proprietary rights.\nOur competitors, many of which have significant resources, may make substantial investments in competing products and technologies, or may apply for and obtain patents that will prevent, limit, or interfere with our ability to manufacture or market our products. We may litigate to enforce patents issued to us and to defend against claimed infringement of the rights of others or to determine the ownership, scope, or validity of our proprietary rights and the rights of others.\nLitigation has been necessary in the past and may be necessary in the future to defend or enforce our intellectual property rights, to protect our patents and trade secrets, and to determine the validity and scope of our proprietary rights. Any litigation also may involve substantial costs and diversion of the attention of Company management away from operational activities. Any claim of infringement against us could involve significant liabilities to third parties, could require us to seek licenses from third parties, and could prevent us from manufacturing, selling or using our products. The occurrence of litigation or the effect of any settlement or an adverse determination in litigation could have a material adverse effect on our business, financial condition, and results of operations.\nWe face risks associated with expanding our sales outside of the United States.\nWe believe that our future growth depends in part upon our ability to manage our international operations and increase sales in international markets. These sales are subject to a variety of risks, including fluctuations in currency exchange rates, tariffs, import restrictions and other trade barriers, unexpected changes in legal and regulatory requirements, longer accounts receivable payment cycles, potentially adverse tax consequences, and export license requirements. In addition, we are subject to the risks inherent in conducting business internationally, including political and economic instability, unexpected changes in diplomatic and trade relationships, and a complex system of commercial and trade laws, regulations, and policies, including those related to data privacy, trade compliance, anti-corruption, and anti-bribery. Currency fluctuations may also increase the cost of our international operations and increase the relative price of our product in international markets and thereby cause our products to become less affordable or less price competitive than those of international manufacturers. These risks associated with international operations may have a material adverse effect on our revenue from or costs associated with international operations or sales.\nExpectations relating to environmental, social and governance matters may increase our cost of doing business and expose us to reputational harm and potential liability.\nMany regulators, investors, employees, vendors, customers, community members and other stakeholders are increasingly focused on environmental, social and governance matters relating to businesses, including climate change, greenhouse gas emissions, human capital, civil rights, and diversity, equity, and inclusion. We may make public statements about various environmental, social and governance matters and initiatives from time to time through our website, press releases and other communications. Addressing stakeholder expectations relating to environmental, social and governance matters requires an investment of time, money and other resources, and depends in part on third-party performance or data that is outside of our control, any, or all of which may increase our cost of doing business. In addition, as investor and other stakeholder expectations relating to environmental, social and governance matters change and evolve over time, any failure or perceived failure by us to adequately address those expectations may damage our reputation and adversely affect our business and results of operations. Similarly, public statements we make about environmental, social and governance matters and initiatives may result in increased scrutiny by our stakeholders and require additional attention relating to these issues. Federal, state or international government bodies or agencies have in the past adopted, and may in the future adopt, laws and regulations relating to environmental, social or governance matters. These laws or regulations could require us to modify our business practices to comply and could result in increased costs. Additionally, any failure to comply with federal, state, or international environmental, social and governance laws and regulations, could adversely affect our business and results of operations.\nRisks Relating to Our Common Stock\nOur operating results may fluctuate significantly from quarter to quarter, which may make budgeting for expenses difficult and may negatively affect the market price of our common stock.\nBecause many purchases by customers of our products relate to a specific customer project and are procured by the customer from time to time through purchase orders, the short-term demand for our products can fluctuate significantly. This fluctuation can be further affected by the long sales cycles necessary to obtain contracts to supply equipment for these projects, the availability of capital to fund our customers projects, changes or delays in customer deployment schedules, and the impact of government programs to encourage service to unserved or underserved communities, rural areas or other high-cost areas on customer buying patterns. These long sales cycles may result in significant effort expended with no resulting sales or sales that are not made in the anticipated quarter or fiscal year. Certain customers and prospective customers, typically larger broadband service providers, are conducive to these long sales cycles which may be multi-year efforts. Demand for our products will also depend upon the extent to which our customers and prospective customers initiate these projects and the extent to which we are selected to provide our equipment in these projects, neither of which can be assured. In addition, a sharp increase in demand could result in actual lead times longer than quoted, and a sharp decrease in demand could result in excess stock. These factors generally result in fluctuations, sometimes significant, in our operating results. Other factors that may affect our quarterly operating results include:\n●\nthe volume and timing of orders from and shipments to our customers, particularly significant customers;\n●\nmergers and acquisitions activity among our customers;\n●\nwork stoppages and other developments affecting the operations of our customers;\n●\nthe timing of and our ability to obtain required certifications or qualifications to sell products, the timing of and our ability to obtain new customer contracts, and the timing of revenue recognition;\n●\nthe timing of new product and service announcements;\n●\nthe availability of products and services;\n●\nseasonal trends in the industries we serve;\n●\nmarket acceptance of new and enhanced versions of our products and services, including the impact of government programs on customers purchasing decisions;\n●\nvariations in the mix of products and services we sell;\n●\nthe utilization of our production capacity and employees, including foreign operations;\n●\nthe availability and cost of key components of our products, including the impact of new or increased tariffs; and\n●\naccounting treatment related to stock-based compensation.\nFurther, we budget our expenses based in part on expectations of future sales. If sales levels in a particular quarter are lower than expected, our operating results will be affected adversely.\nBecause of these factors, our quarterly operating results are difficult to predict and are likely to vary in the future. If our operating results are below financial analysts or investors expectations, the market price of our common stock may fall abruptly and significantly.\nOur stock price has been volatile historically and may continue to be volatile. The price of our common stock may fluctuate significantly.\nThe trading price of our common stock has been and may continue to be subject to wide fluctuations. Our stock price may fluctuate in response to a number of events and factors, such as quarterly variations in operating results, announcements of technological innovations or new products by us or our competitors, changes in financial estimates and recommendations by securities analysts, the operating and stock price performance of other companies that investors may deem comparable to us, and new reports relating to trends in our markets or general economic conditions.\nIn addition, the stock market is subject to price and volume fluctuations that affect the market prices for companies in general, and small-capitalization, high-technology companies like us in particular. These broad market and industry fluctuations may adversely affect the price of our common stock, regardless of our operating performance. Further, any failure by us to meet or exceed the expectations of financial analysts or investors is likely to cause a decline in our common stock price. Further, recent industry and economic conditions have resulted in significant fluctuations in stock prices for many companies, including Clearfield. We cannot predict when the stock markets and the market for our common stock may stabilize. In addition, although our common stock is listed on the Nasdaq Stock Market, our common stock has at times experienced low trading volume in the past. Limited trading volume subjects our common stock to greater price volatility and may make it difficult for our shareholders to sell shares at an attractive price.\nAnti-takeover provisions in our organizational documents, Minnesota law and other agreements could prevent or delay a change in control of our Company.\nCertain provisions of our articles of incorporation and bylaws, Minnesota law, and other agreements may make it more difficult for a third-party to acquire, or discourage a third-party from attempting to acquire, control of our Company, including:\n●\nthe provisions of our bylaws setting forth the advance notice and information requirements for shareholder proposals, including nominees for directors, to be considered properly brought before shareholders;\n●\nthe right of our board of directors to establish more than one class or series of shares and to fix the relative rights and preferences of any such different classes or series;\n●\nthe provisions of Minnesota law relating to business combinations and control share acquisitions; and\n●\nthe provisions of our equity compensation plans allowing for the acceleration of vesting or payments of awards granted under the plans in the event of specified events that result in a change in control and provisions of agreements with certain of our executive officers requiring payments if their employment is terminated and there is a change in control.\nThese measures could discourage or prevent a takeover of us or changes in our management, even if an acquisition or such changes would be beneficial to our shareholders. This may have a negative effect on the price of our common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nClearfield leases an 85,000 square foot facility at 7050 Winnetka Avenue North, Brooklyn Park, Minnesota, consisting of corporate offices, manufacturing, and warehouse space. The lease term is ten years and two months, ending on February 28, 2025, and is renewable. The renewal options have not been included within the lease term because it is not reasonably certain that the Company will exercise either option.\nIn July 2021, Clearfield entered into an indirect lease arrangement for an approximately 318,000 square foot manufacturing facility in Tijuana, Mexico. The lease term is for 7 years of which 5 years are mandatory, commencing March 2022. The lease contains written options to renew for two additional consecutive periods of 5 years each. The lease calls for monthly rental payments of $162,000, increasing 2% annually. The renewal options have not been included within the lease term because it is not reasonably certain that the Company will exercise either option.\nClearfields Mexico facility operates under a Maquiladora arrangement pursuant to which we contract with a company to provide certain personnel and other services at the Tijuana, Mexico facility. Maquiladora status allows us to import certain items from the United States into Mexico duty-free, provided that such items, after processing, are exported from Mexico within a stipulated time frame. Maquiladora status, which is renewed with the Ministry of the Economy of Mexico periodically, is subject to various restrictions and requirements, including compliance with the terms of the Maquiladora program and other local regulations, which have become stricter in recent years.\nOn November 19, 2021, Clearfield signed a lease for a 105,000 square foot warehouse in Brooklyn Park, Minnesota. The lease term is five years commencing March 2022 and ending on February 28, 2027, with rent payments increasing annually. The lease includes an option to extend the lease for an additional five years. The renewal option has not been included within the lease term because it is not reasonably certain that the Company will exercise the option. The lease commenced in the second quarter of fiscal 2022.\nNestor leases an approximately 25,000 square foot manufacturing facility in Oulu, Finland, which is utilized for the operations of Nestor Cables. The original lease term ends on October 31, 2022, but auto renews indefinitely until terminated with two years written notice. It is not reasonably certain that the Company will not exercise the termination option. The lease calls for monthly rental payments of approximately €40,000. Rent is increased each year on January 1st based upon the cost-of-living index published by the Finnish government.\nOn May 11, 2023, Nestor Cables signed a lease for an approximately 49,000 square foot manufacturing facility in Tabasalu, Estonia, to be utilized for the operations of Nestor Cables Baltics. The lease is without a fixed term and requires two years written notice to terminate the lease. Additionally, the lease grants to Nestor Cables the option to lease an expansion facility that is to be constructed no later than August 31, 2024. The expansion facility will be constructed on the same premises as the existing facility. Once the expansion option is exercised and the expansion facility is made available for use, the lease term of the existing facility will become a minimum of 60 months. The lease calls for monthly rental payments of approximately €20,400 until April 2024 and €25,000 afterwards. Rent is increased each year on May 1st based upon the cost-of-living index published by the Estonian government and capped at 5%. ITEM 3. LEGAL PROCEEDINGS\nThere are no pending legal proceedings against or involving the Company for which the outcome is likely to have a material adverse effect upon its financial position or results of operations. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II. ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDERMATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is traded on the Nasdaq Global Market under the symbol CLFD.\nNumber of Holders of Common Stock\nThere were 290 holders of record of our common stock as of September 30, 2023.\nDividends\nWe have never paid cash dividends on our common stock. We currently intend to retain any earnings for use in our operations, continued organic growth, and potential future strategic transactions, as well as execution of the repurchase program described below, and do not intend in the foreseeable future to pay cash dividends on our common stock.\nStock Performance Graph\nThe following graph shows a comparison of the 5-year cumulative total return on Clearfield, Inc.s common stock relative to the Standard & Poors 500 Stock Index (S&P500 Index), which the Company has selected as a broad market index, and The Standard & Poors 1500 Communications Equipment Index (S&P 1500 Communications Equipment Index), which the Company has selected as a published industry index. The graph assumes an investment of $100 (with reinvestment of all dividends) is made in the Companys common stock and in each index on September 30, 2018, and its relative performance is tracked through September 30, 2023. The returns shown are based on historical results and are not intended to suggest future performance.\nCompany/Index\nSeptember 30, 2018\nSeptember 30, 2019\nSeptember 30, 2020\nSeptember 30, 2021\nSeptember 30, 2022\nSeptember 30, 2023\nClearfield, Inc.\n$ 100.00\n$ 87.13\n$ 148.31\n$ 324.63\n$ 769.41\n$ 212.72\nS&P 500 Index\n100.00\n117.95\n133.49\n170.98\n142.32\n170.20\nS&P 1500 Communications Equipment Index\n100.00\n138.73\n114.40\n160.72\n130.81\n171.24\nIssuer Repurchases\nThe Company repurchased a total of 7,084 shares of our common stock during the fourth quarter of fiscal year 2023 in connection with payment of taxes upon the vesting of restricted stock previously issued to employees. These repurchases are unrelated to the stock repurchase program.\nEffective January 27, 2022, the Company reinstated its stock repurchase program that had been suspended due to COVID uncertainty in April 2020. In addition, effective January 27, 2022, the Companys board of directors increased the share repurchase program by an additional $10 million to an aggregate of $22 million, from the previous $12 million. As of September 30, 2023, we have repurchased an aggregate of 565,590 shares for approximately $7,019,000, leaving approximately $14,981,000 available within our $22,000,000 stock repurchase program. The repurchase program does not obligate Clearfield to repurchase any particular amount of common stock during any period. The repurchase will be funded by cash on hand. During the year ended September 30, 2023, the Company did not repurchase any shares under the stock repurchase program.\nThe following table presents the total number of shares repurchased during the fourth quarter of fiscal 2023 by month and the average price paid per share:\nISSUER PURCHASES OF EQUITY SECURITIES\nPeriod\nTotal\nNumber\nof Shares\nPurchased\nAverage\nPrice Paid\nper Share\nTotal Number of\nShares\nPurchased as Part\nof Publicly\nAnnounced Plans\nor Programs\nApproximate Dollar Value\nof Shares that\nMay Yet Be Purchased\nUnder the Program (1)\nJuly 1-31, 2023\n-\n$ -\n-\n$ 14,980,671\nAugust 1-31, 2023\n7,084\n37.50\n-\n14,980,671\nSeptember1-30, 2023\n-\n-\n-\n14,980,671\nTotal\n7,084\n$ 37.50\n-\n$ 14,980,671\n(1)\nAmount remaining from the aggregate $22,000,000 repurchase authorizations approved by the Companys board of directors on January 27, 2022.\nOn November 7, 2023, the Companys board of directors increased the share repurchase program to an aggregate of $40 million from the previous $22 million, leaving approximately $32,980,671 available for repurchase.\nEquity compensation plans information is incorporated by reference from Part III, Item 12, Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters, of this Annual Report, and should be considered an integral part of Item 5. ITEM 6. [RESERVED]\nNot applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCautionary Statement Regarding Forward-Looking Information\nStatements made in this Annual Report on Form 10-K, in the Companys other SEC filings, in press releases and in oral statements, that are not statements of historical fact are forward-looking statements. Such forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results or performance of the Company to be materially different from the results or performance expressed or implied by such forward-looking statements. The words believes, expects, anticipates, seeks, may, will, and similar expressions identify forward-looking statements. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date the statement was made. The risks and uncertainties that could cause actual results to differ materially and adversely from those expressed or implied by the forward-looking statements include those risks described in Part I, Item 1A Risk Factors.\nOverview of Business: The Clearfield operating segment designs, manufactures, and distributes fiber optic management, protection, and delivery products for communications networks. Its fiber to the anywhere platform serves the unique requirements of leading broadband service providers in the United States, which include Community Broadband, Large Regional Service Provider, National Carriers, and Multiple System Operators (MSOs or cable TV), while also serving the broadband needs of the International markets, primarily in the European, Caribbean Markets, Canada, and Mexico. These customers are collectively included in the category of Broadband Service Providers. The Clearfield operating segment also provides contract manufacturing services to its Legacy customers for build-to-print services which include OEM requiring copper and fiber cable assemblies built to their specifications. The Companys sales channels include direct to customer, through distribution partners, and to original equipment suppliers who private label its products. The Companys products are sold by its sales employees and independent sales representatives.\nThe Nestor Cables operating segment manufactures fiber optic and copper telecommunication cables and equipment which it distributes to telecommunication operators, network owners, electric companies, building contractors, and industrial companies. Nestor Cables has been a supplier to Clearfield for over a decade. Nestor has two types of production processes, the process of manufacturing cable in its Finland facility and the finished assembly portion of its business performed in Estonia. Nestor Cables sells its products predominantly to customers in Europe.\nResults of Operations\nYear ended September 30, 2023, compared to year ended September 30, 2022\nThe Companys net sales for fiscal year 2023 decreased 1%, or $2,163,000 to $268,720,000 from net sales of $270,883,000 in fiscal year 2022. The Company allocates sales from external customers to geographic areas based on the location to which the product is transported. Accordingly, international sales represented 19% and 6% of net sales for the years ended September 30, 2023, and 2022, respectively.\nThe decrease in net sales for fiscal year 2023 of $2,163,000 compared to fiscal year 2022 is attributable to decreased demand across Clearfields core markets. Sales to the Community Broadband market decreased 12% or $15,312,000 from $127,478,000 in fiscal year 2022 to $112,166,000 fiscal year 2023. Sales to Clearfields MSO/Cable TV market decreased 5% or $2,252,000 from $47,921,000 in fiscal year 2022 to $45,669,000 in fiscal year 2023. Sales to National Carriers decreased 17% or $1,817,000 from $10,772,000 in fiscal year 2022 to $8,954,000 in fiscal year 2023. The decrease in sales to these customers was due to a lull in demand for fiber connectivity products as customers digest their larger than normal inventory levels built up during the pandemic which were purchased over the previous several quarters. Net sales to International customers increased 226% or $34,570,000 from $15,316,000 in fiscal year 2022 to $49,885,000 in fiscal year 2023, primarily driven by the Companys acquisition of Nestor Cables on July 26, 2022.\nRevenue from customers is obtained from purchase orders submitted from time to time, with a limited number of customers recently issuing purchase orders for longer time frames. The Companys ability to predict orders in future periods or trends affecting orders in future periods is limited. The Companys ability to predict revenue is further limited by global supply chain issues, customer deployment schedules and factors affecting customer ordering patterns, which may result in changes in customer ordering trends in a relatively short period of time. The Companys ability to recognize revenue in the future for customer orders will depend on the Companys ability to manufacture and deliver products to the customers and fulfill its other contractual obligations.\nCost of sales for fiscal year 2023 was $183,441,000, an increase of $25,505,000, or 16%, from the $157,936,000 in fiscal year 2022. Gross profit decreased 25%, or $27,669,000 from $112,947,000 for fiscal year 2022 to $85,278,000 for fiscal year 2023. The decrease in gross profit was due to lower net sales and lower gross profit margin in fiscal year 2023.\nGross profit percent was 31.7% in fiscal year 2023 compared to 41.7% for fiscal year 2022. Gross profit margin was negatively affected by excess overhead and production capacity in the Companys Clearfield segment that was underutilized. The Company continues to realign capacity to current market conditions. Gross profit was also affected by lower gross profit realized in our Nestor Cables cable manufacturing business which was acquired in July 2022 and was not included in the comparable period of fiscal 2022. The Company expects to operate at gross profit percentage levels at or below these levels for several quarters until revenue levels increase, which is expected to bring improved margins.\nSelling, general and administrative expense for fiscal year 2023 was $47,992,000, a decrease of $1,155,000, or 2%, compared to $49,130,000 for fiscal year 2022. While relatively consistent year over year, expense for the year ended September 30, 2023, decreased due to lower performance-based compensation and transaction costs, offset by additional professional and legal expenses related to the Nestor Cables business acquired in July 2022, as well as increased Clearfield employee compensation costs, stock-based compensation and travel and entertainment expenses.\nIncome from operations for fiscal year 2023 was $37,286,000 compared to $63,817,000 for fiscal year 2022. The decrease is attributable to lower gross profit as a result of higher unabsorbed overhead related to expanded manufacturing capacities in the Clearfield segment, as well as a full year of Nestor Cables, which has a lower gross profit profile related to its bulk cable and duct product offerings. Nestor Cables was acquired in July 2022.\nNet investment income in fiscal year 2023 was $5,206,000 compared to $328,000 for fiscal year 2022. The increase in interest income is due to a higher average investments balance and higher interest rates earned for the year ended September 30, 2023. The higher investments balance is a result of the Companys capital raise of approximately $130,000,000 completed in the first fiscal quarter of 2023. The Company invests its excess cash primarily in Federal Deposit Insurance Company (FDIC) backed bank certificates of deposit, United States (U.S.) treasury securities, and money market funds and accounts. We expect interest income to remain at these levels through fiscal year 2024, subject to changes in market interest rates and changes in the average investments balance.\nInterest expense in fiscal year 2023 was $881,000 compared to $311,000 for fiscal year 2022. The increase is primarily due to incurring a full year of interest expense on the factoring liability held by Nestor Cables which was acquired in July 2022.\nIncome tax expense for fiscal year 2023 was $9,079,000 compared to $14,472,000 for fiscal year 2022. The decrease in tax expense of $5,393,000 from the year ended September 30, 2022 is primarily due to the decrease in taxable income for fiscal year 2023. The decrease in the income tax expense rate to 21.8% for fiscal year 2023 from 22.7% for fiscal year 2022 is due to decreased permanent addback items including nondeductible compensation and transaction costs. Our provision for income taxes includes current U.S. federal tax expense and state tax expense, Finland taxes and deferred tax expense.\nNet income for fiscal year 2023 was $32,533,000 or $2.17 per basic and diluted share compared to $49,362,000 or $3.58 per basic and $3.55 per diluted share for fiscal year 2022.\nYear ended September 30, 2022, compared to year ended September 30, 2021\nThe Companys net sales for fiscal year 2022 increased 92%, or $130,128,000, to $270,883,000 from net sales of $140,755,000 in fiscal year 2021. The Company allocates sales from external customers to geographic areas based on the location to which the product is transported. Accordingly, international sales represented 6% and 7% of net sales for the years ended September 30, 2022, and 2021, respectively.\nThe increase in net sales for fiscal year 2022 of $130,128,000 compared to fiscal year 2021 was attributable to increased demand across Clearfields core markets. Sales to the Community Broadband market increased 84% or $82,651,000 from $97,978,000 in fiscal year 2021 to $180,629,000 fiscal year 2022. Sales to Clearfields MSO/Cable TV market increased 164% or $30,379,000 from $18,490,000 in fiscal year 2021 to $48,868,000 in fiscal year 2022. Sales to National Carriers increased 96% or $11,499,000 from $11,956,000 in fiscal year 2021 to $23,456,000 in fiscal year 2022. The increase in sales to these customers was due to continuing increased demand for fiber connectivity products in response to COVID-19 driven by customers accelerating their purchasing decisions and deployment schedules of our fiber optic solutions and the need for high-speed broadband required in the work from anywhere environment. Net sales to International customers increased 62% or $5,846,000 from $9,470,000 in fiscal year 2021 to $15,276,000 in fiscal year 2022, partially driven by the Companys acquisition of Nestor Cables on July 26, 2022.\nCost of sales for fiscal year 2022 was $157,936,000, an increase of $78,358,000, or 98%, from the $79,578,000 in fiscal year 2021. Gross profit increased 85%, or $51,770,000 from $61,177,000 for fiscal year 2021 to $112,947,000 for fiscal year 2022.\nGross profit percent was 41.7% in fiscal year 2022 compared to 43.5% for fiscal year 2021. The decrease in gross profit margin for the period was primarily due to component cost increases absorbed by the Company due to the inflationary economic environment, increased facility costs from our expanded Mexico manufacturing and Minnesota distribution center operations, and increased freight and transportation costs. Despite the decrease in gross profit percentage, gross profit dollars increased due to the increase net sales.\nSelling, general and administrative expense for fiscal year 2022 was $49,130,000, an increase of $13,187,000, or 37%, compared to $35,943,000 for fiscal year 2021. This increase was primarily comprised of an increase of $6,976,000 in Clearfields compensation costs due to additional personnel in fiscal year 2022 over fiscal year 2021, higher performance-based compensation accruals as well as sales commissions due to significantly higher sales volumes, expenses and fees related to the acquisition of Nestor Cables of $1,647,000, increased travel, entertainment, and tradeshows cost of $1,382,000 due to reduced COVID-19 travel restrictions as compared to fiscal year 2021, and increased stock compensation expenses of $990,000 due to issuances of equity awards in fiscal year 2022.\nIncome from operations for fiscal year 2022 was $63,817,000 compared to $25,234,000 for fiscal year 2021. This increase was attributable to increased sales and gross profit, partially offset by increased selling, general and administrative expenses as described above.\nNet investment income in fiscal year 2022 was $328,000 compared to $500,000 for fiscal year 2021. The decrease was due to lower interest rates earned on decreased investment balances in fiscal year 2022.\nInterest expense in fiscal year 2022 was $311,000. The increase was due to $141,000 in interest as a result of $16,700,000 borrowed on the Companys line of credit drawn on in the fourth quarter of fiscal 2022 to fund the acquisition of Nestor Cables, and $170,000 in interest on debt held with Nestor Cables. The Company did not have any interest expense for fiscal year 2021.\nIncome tax expense for fiscal year 2022 was $14,472,000 compared to $5,407,000 for fiscal year 2021. The increase in tax expense of $9,065,000 from the year ended September 30, 2021, was primarily due to the increase in taxable income for fiscal year 2022. The increase in the income tax expense rate to 22.7% for fiscal year 2022 from 21.0% for fiscal year 2021 was due to increased permanent addback items including nondeductible compensation and transaction costs. Our provision for income taxes included current U.S. federal tax expense and state tax expense, Finland taxes and deferred tax expense.\nNet income for fiscal year 2022 was $49,362,000 or $3.58 per basic and $3.55 per diluted share compared to $20,327,000 or $1.48 per basic and $1.47 per diluted share for the fiscal year 2021.\nReportable Segments\nThe Companys reportable segments are based on the Companys method of internal reporting. These results are not necessarily indicative of the results of operations that would have occurred had each segment been an independent, stand-alone entity during the periods presented. The internal reporting of these operating segments is defined based, in part, on the reporting and review process used by the Companys Chief Executive Officer.\nOn July 26, 2022, Clearfield, through its newly created Finnish subsidiary, Clearfield Finland Oy, acquired all of the equity of Nestor Cables Oy, which has a wholly owned Estonian subsidiary Nestor Cables Baltics OÜ. Following the closing of the acquisition of Nestor Cables on July 26, 2022, the Company reassessed its operating segments as defined under ASC 280, Segment Reporting. Under ASC 280, operating segments are defined as components of an enterprise where discrete financial information is available that is evaluated regularly by the chief operating decision-maker (CODM), in deciding how to allocate resources and in assessing performance. Prior to July 26, 2022, we were considered to be a single operating segment structure. Based upon the Companys assessment following the acquisition of Nestor Cables, the Company determined that the business of Nestor Cables was considered a second reportable segment as of July 26, 2022. Accordingly, beginning with the year ended September 30, 2022, the Company has two reportable segments: (1) Clearfield and (2) Nestor Cables. The entities that comprise the Nestor Cables segment are Clearfield Finland Oy, Nestor Cables Oy and Nestor Cables Baltics OÜ.\nReportable segments are as follows:\n●\nClearfield Segment - The Clearfield segment designs, manufactures, and sells fiber management, protection, and delivery solutions. For fiscal year 2023, net sales from the Clearfiled segment comprised 84% of the Companys total net sales.\n●\nNestor Cables Segment - The Nestor Cables segment designs, manufactures, and sells fiber optic and copper telecommunication cables and equipment. For fiscal year 2023, net sales from the Nestor Cables segment comprised 16% of the Companys total net sales.\nClearfield Segment\nThe following table provides net sales and net income for the Clearfield segment for the fiscal years ended:\n(In thousands)\nSeptember 30, 2023\nSeptember 30, 2022\nSeptember 30, 2021\nSegment net sales\n$ 225,722\n$ 263,822\n$ 140,755\nSegment net income\n$ 32,834\n$ 49,771\n$ 20,327\nNet sales in the Clearfield segment decreased 14% or $38,100,000 for the fiscal year ended September 30, 2023, resulting from decreased sales to its Community Broadband, MSO/Cable TV, and Large Regional customers as these customers work to digest inventory that was purchased previously.\nNet income in the Clearfield segment for the fiscal year ended September 30, 2023, decreased 34% or $16,937,000 from the fiscal year ended September 30, 2022, driven by the changes in sales outlined above, as well as lower gross profit margin which was negatively affected by the buildup in capacity that was not utilized.\nNestor Cables Segment\nThe following table provides net sales and net income for the Nestor Cables segment for the fiscal year ended:\n(In thousands)\nSeptember 30, 2023\nSeptember 30, 2022\nSeptember 30, 2021\nSegment net sales\n$ 42,998\n$ 7,061\n$ -\nSegment net loss\n$ (301 )\n$ (409 )\n$ -\nNet sales in the Nestor Cables segment increased 509% or $35,937,000 for the fiscal year ended September 30, 2023, due to a full year of operations in fiscal 2023 after being acquired in the fourth quarter of fiscal 2022.\nNet loss in the Nestor Cables segment for the fiscal year ended September 30, 2023 decreased 26% or $108,000 from the fiscal year ended September 30, 2022, driven by non-recurring acquisition related expenses in the prior year.\nSales Backlog\nSales backlog reflects purchase order commitments for our products received from customers that have yet to be fulfilled. The Company had a backlog of $57,285,000 and $164,914,000 as of September 30, 2023, and 2022, respectively. The decrease in backlog was primarily due to a lull in demand for fiber connectivity products as customers digest their larger than normal inventory levels built up during the pandemic which were purchased over the previous several quarters. As of September 30, 2023, most of the Companys backlog orders are scheduled to ship within the next nine months. We believe that the Nestor Cables segment generally experiences the same seasonality as the Clearfield segment.\nLiquidity and Capital Resources\nAs of September 30, 2023, the Company had combined consolidated balances of cash, cash equivalents, short-term and long-term investments of $174,456,000 compared to $45,199,000 as of September 30, 2022. Additionally, we have a line of credit for $40 million that has no outstanding borrowing as of September 30, 2023. Our excess cash is invested mainly in certificates of deposit backed by the FDIC, U.S. Treasury securities, and money market funds.\nOn April 27, 2022, Clearfield entered into a loan agreement and a security agreement to provide the Company with a $40 million revolving line of credit that is secured by certain of the Companys U.S. assets. The line of credit matures on April 27, 2025, and borrowed amounts will bear interest at a variable rate of the CME Group one-month term Secured Overnight Financing Rate (SOFR) plus 1.85%, but not less than 1.80% per annum. As of September 30, 2023, the interest rate was 7.18%. The loan agreement and the security agreement contains customary affirmative and negative covenants and requirements relating to the Company and its operations, including a requirement that the Company maintain a debt service coverage ratio of not less than 1.20 to 1 as of the end of each fiscal year for the fiscal year then ended and maintain a debt to cash flow ratio of not greater than 2 to 1 measured as of the end of each of the Companys fiscal quarters for the trailing twelve (12) month period. Debt service coverage ratio is the ratio of Cash Available for Debt Service to Debt Service, each as defined in the loan agreement. Debt and Cash Flow are also as defined in the loan agreement for the purposes of the debt to cash flow ratio covenant. As of September 30, 2023, the Company had no borrowings against this line of credit. As of September 30, 2023, the Company was in compliance with all covenants. We had no long-term debt obligations as of September 30, 2023, and $18,666,000 as of September 30, 2022. We believe the combined balances of short-term cash and investments, along with long-term investments and available bank lines of credit provide a more accurate indication of our available liquidity.\nWe believe our existing cash equivalents and short-term investments, along with cash flow from operations and line of credit, will be sufficient to meet our working capital and investment requirements beyond the next 12 months. The Company intends on utilizing its available cash and assets primarily for its continued organic growth and potential future strategic transactions, as well as execution of the share repurchase program adopted by our board of directors. Effective January 27, 2022, the Company reinstated its stock repurchase program that had been suspended due to COVID uncertainty in April 2020. In addition, effective January 27, 2022, the Companys board of directors increased the share repurchase program by an additional $10 million to an aggregate of $22 million, from the previous $12 million. As of September 30, 2023, we have repurchased an aggregate of 565,590 shares for approximately $7,019,000, leaving approximately $14,981,000 available within our $22,000,000 stock repurchase program. The repurchase program does not obligate Clearfield to repurchase any particular amount of common stock during any period. The repurchase will be funded by cash on hand. During the year ended September 30, 2023, the Company did not repurchase any shares under the stock repurchase program.\nOn November 7, 2023, the Companys board of directors increased the share repurchase program to an aggregate of $40 million from the previous $22 million, leaving approximately $32,980,671 available for repurchase.\nOperating Activities\nNet cash provided by operations for the fiscal year ended September 30, 2023, totaled $20,010,000. Cash provided by operations included net income of $32,533,000 for the fiscal year ended September 30, 2023, non-cash expenses for depreciation and amortization of $6,043,000, stock-based compensation of $3,578,000, amortization of discount on investments of $3,512,000, in addition to changes in operating assets and liabilities using cash. Changes in operating assets and liabilities using cash include an increase in net inventories of $15,083,000 and a decrease in accounts payable and accrued expenses of $26,257,000. The increase in inventory is a result of additional stocking levels to support the Companys anticipated customer demand, as well as stocking of long lead time components to limit manufacturing delays due to raw material component shortages and supply chain delays experienced during the pandemic. The decrease in accounts payable is due to lower purchasing activity of inventory near the end of the period in response to lower demand from customers, as well as lower performance-based compensation accruals as of September 30, 2023. Also, changes in operating assets and liabilities providing cash include a decrease in accounts receivable of $26,277,000, due to lower net sales in the Companys fourth quarter of fiscal 2023 compared to the prior year. Days sales outstanding (DSO), which measures how quickly receivables are collected, remained relatively consistent as it increased 1 day from 52 to 53 from September 30, 2022, to September 30, 2023.\nNet cash provided by operations for the fiscal year ended September 30, 2022, totaled $1,001,000. Cash provided by operations included net income of $49,362,000 for the fiscal year ended September 30, 2022, non-cash expenses for depreciation and amortization of $3,413,000, stock-based compensation of $2,339,000, in addition to changes in operating assets and liabilities using cash. Changes in operating assets and liabilities using cash include an increase in net inventories of $43,744,000 and accounts receivables of $24,234,000. The increase in inventory is a result of additional stocking levels to support the Companys increased sales backlog and higher demand, and stocking of high turn and long lead time components to limit manufacturing delays due to raw material component shortages and supply chain delays. The increase in accounts receivable was due to higher net sales as well as increased DSO due to higher sales to certain customers with longer payment terms. DSO increased 13 days from 39 to 52 from September 30, 2021, to September 30, 2022. Also, changes in operating assets and liabilities providing cash include an increase in accounts payable and accrued expenses of $14,502,000, due to timing of accounts payable and $8,738,000 in fiscal year 2022 incentive compensation accruals to be paid after year end.\nNet cash provided by operations for the fiscal year ended September 30, 2021, totaled $10,903,000. Cash provided by operations included net income of $20,327,000 for the fiscal year ended September 30, 2021, non-cash expenses for depreciation and amortization of $2,302,000, stock-based compensation of $1,280,000, and decrease in allowance for doubtful accounts of $210,000, in addition to changes in operating assets and liabilities using cash. Changes in operating assets and liabilities using cash include an increase in net inventories of $13,116,000 and accounts receivables of $9,151,000. The increase in inventory is a result of additional stocking levels to support the Companys increased sales backlog and higher demand, and stocking of high turn and long lead time components to limit manufacturing delays due to raw material component shortages and delays. The increase in accounts receivable was due to higher net sales experienced over the prior year. The Companys DSO increased 1 day from 38 to 39 from September 30, 2020, to September 30, 2021. Also, changes in operating assets and liabilities providing cash include an increase in accounts payable and accrued expenses of $9,776,000, due to timing of accounts payable and $6,513,000 in fiscal year 2021 incentive compensation accruals to be paid after year end.\nInvesting Activities\nFor the fiscal year ended September 30, 2023, the Company received proceeds from maturities of investments of $107,060,000 and used cash to purchase $210,923,000 of investments in certificates of deposit below FDIC insured levels and U.S. Treasuries. The Company used $8,384,000 in cash to purchase fixed and intangible assets. The result is cash used in investing activities of $112,247,000 in fiscal year 2023. In fiscal year 2024, the Company intends to continue investing in the necessary information technology, manufacturing equipment and facility needs.\nFor the fiscal year ended September 30, 2022, the Company had $17,386,000 of FDIC-backed certificates of deposit and U.S. Treasuries mature or be sold. The Company used $9,148,000 in cash to purchase fixed and intangible assets. Additionally, the Company used $16,187,000 in cash to acquire Nestor Cables on July 26, 2022. The result was cash used in investing activities of $8,197,000 in fiscal year 2022.\nFor the fiscal year ended September 30, 2021, we purchased $24,809,000 of FDIC-backed certificates of deposit and U.S. Treasuries and had $13,255,000 of FDIC-backed certificates of deposit and U.S. Treasuries mature or be called. The result was cash used in investing activities of $13,600,000 in fiscal year 2021. The increase in cash used in investing activities was driven by increased investment of cash in excess of operating needs into long-term investments. During fiscal year 2021, we used $2,046,000 in cash for the purchase of capital equipment and software and for obtaining patents. These purchases were mainly related to manufacturing and information technology equipment.\nFinancing Activities\nFor the fiscal year ended September 30, 2023, the Company received $130,262,000 of net proceeds through the issuance of common stock in the first quarter of fiscal 2023. The Company also received $611,000 from employees purchase of stock through our Employee Stock Purchase Plan (ESPP) and $954,000 related to issuance of stock as payment for incentive compensation. The Company used $16,700,000 to pay down in full the then-outstanding principal on our line of credit, which was originally drawn in the fourth quarter of fiscal 2022 to fund the acquisition of Nestor Cables. The Company also used $491,000 related to share withholding for exercise and taxes associated with the issuance of common stock upon cashless exercise of stock options and used $1,220,000 to pay for taxes as a result of employees vesting of restricted shares using share withholding. As a result, the net cash provided by financing activities during fiscal year 2023 was $113,416,000.\nFor the fiscal year ended September 30, 2022, the Company borrowed $16,700,000 on its line of credit to fund the July acquisition of Nestor Cables. The Company received $544,000 from employees purchase of stock through our ESPP. The Company used $5,183,000 related to share withholding for exercise and taxes associated with the issuance of common stock upon cashless exercise of stock options and used $1,406,000 to pay for taxes as a result of employees vesting of restricted shares using share withholding. As a result, the net cash provided by financing activities during fiscal year 2022 was $10,655,000.\nFor the fiscal year ended September 30, 2021, the Company received $384,000 from employees purchase of stock through our ESPP. The Company used $462,000 to pay for taxes related to employees exercises of stock options and $458,000 to pay for taxes related to employees vesting of restricted shares using share withholding. As a result, the net cash used in financing activities during fiscal year 2021 was $536,000.\nOperating Leases\nWe have entered into various non-cancelable operating lease agreements for office equipment and our office and manufacturing spaces in Minnesota, Mexico, Finland, and Estonia expiring at various dates through August 2034. Certain of these leases have escalating rent payment provisions. We recognize rent expense under such leases on a straight-line basis over the term of the lease.\nCritical Accounting Estimates\nIn preparing our financial statements, we make estimates, assumptions and judgments that can have a significant impact on our sales, income from operations and net income, as well as on the value of certain assets and liabilities on our consolidated balance sheets. We believe that there are several accounting policies that are critical to an understanding of our historical and future performance, as these policies affect the reported amounts of sales, expenses and significant estimates and judgments applied by management. While there are a number of accounting policies, methods and estimates affecting our financial statements, areas that are particularly significant include:\n●\nAccounting for stock-based compensation\n●\nIncome taxes\n●\nValuation of inventory, long-lived assets, finite lived intangible assets and goodwill\n●\nValuation in business combinations\nStock-Based Compensation\nWe measure and recognize compensation expense for all stock-based awards at fair value over the requisite service period. We use the Black-Scholes option pricing model to determine the fair value of options. For restricted stock grants, fair value is determined as the closing price of the Companys stock on the date of grant. Equity-based compensation expense is broken out between cost of sales and selling, general and administrative expenses based on the classification of the employee. The determination of fair value of stock-based awards on the date of grant using an option-pricing model is affected by our stock price as well as by assumptions regarding a number of subjective variables. These variables include, but are not limited to, the expected stock price volatility over the term of the awards, and actual and projected employee stock option exercise behaviors.\nThe expected terms of the options are based on evaluations of historical and expected future employee exercise behavior. The risk-free interest rate is based on the U.S. Treasury rates at the date of grant with maturity dates approximately equal to the expected life at grant date. Volatility is based on historical and expected future volatility of the Companys stock. The Company has not historically issued any dividends and does not expect to in the future. Forfeitures for both option and restricted stock grants are estimated at the time of the grant and revised in subsequent periods if actual forfeitures differ from estimates.\nIf factors change and we employ different assumptions in the determination of the fair value of grants in future periods, the related compensation expense that we record may differ significantly from what we have recorded in the current periods.\nIncome Taxes\nWe account for income taxes in accordance with ASC 740, Income Taxes, under which deferred income taxes are recognized based on the estimated future tax effects of differences between the financial statement and tax bases of assets and liabilities given the provisions of enacted tax laws. Deferred income tax provisions and benefits are based on changes to the assets or liabilities from year to year. In providing for deferred taxes, we consider tax regulations of the jurisdictions in which we operate, estimates of future taxable income, and available tax planning strategies. If tax regulations, operating results, or the ability to implement tax-planning strategies vary, adjustments to the carrying value of deferred tax assets and liabilities may be required. A valuation allowance is recorded when it is more likely than not that a deferred tax asset will not be realized. The recorded valuation allowance is based on significant estimates and judgments and if the facts and circumstances change, the valuation allowance could materially change.\nIn accounting for uncertainty in income taxes, we recognize the financial statement benefit of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more likely than not threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement with the relevant tax authority. The Company recognizes interest and penalties accrued on any unrecognized tax benefits as a component of income tax expense.\nAs of September 30, 2023, and 2022, the Company had no U.S. federal, state, or Estonia net operating loss (NOL) carry-forwards. As of September 30, 2023, and 2022 there is a Finnish NOL of $1,000 and $4,000, respectively.\nAs part of the process of preparing our financial statements, we are required to estimate our income tax liability in each of the jurisdictions in which we do business. This process involves estimating our actual current tax expense together with assessing temporary differences resulting from differing treatment of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities. We must then assess the likelihood that these deferred tax assets will be recovered from future taxable income and, to the extent we believe that recovery is not more likely than not or unknown, we must establish a valuation allowance. If the valuation allowance is reduced, the Company would record an income tax benefit in the period in which that determination is made. If the valuation allowance is increased, the Company would record additional income tax expense.\nThe Company files income tax returns in the U.S. Federal jurisdiction and various state and foreign jurisdictions. Based on its evaluation, the Company has concluded that it has no significant unrecognized tax benefits. The Company is generally subject to U.S. federal examination for all tax years after 2018. The Company is subject to state examinations for all tax years after 2013 due to unexpired research and development credit carryforwards still open under statute. Nestor is generally subject to Finland examination for all tax years after 2019 and Estonia examination for all tax years after 2019.\nImpairment of Long-Lived Assets, Intangible Assets and Goodwill\nThe Companys long-lived assets as of September 30, 2023, consisted primarily of property, plant and equipment, right of use lease assets, patents, intangibles, and goodwill. The Company reviews the carrying amount of its property, plant and equipment, right of use lease assets, and intangible assets if events or changes in circumstances indicate that the carrying amount of the assets may not be recoverable. When this review indicates the carrying amount of an asset or asset group exceeds the sum of the future undiscounted cash flows expected to be generated by the assets, the Company recognizes an asset impairment charge against operations for the amount by which the carrying amount of the impaired asset exceeds its fair value.\nDetermining fair values of property, plant, and equipment, right of use lease assets, and intangible assets using a discounted cash flow method involves significant judgment and requires the Company to make significant estimates and assumptions, including long-term projections of cash flows, market conditions and appropriate discount rates. Judgments are based on historical experience, current market trends, consultations with external valuation specialists and other information. If facts and circumstances change, the use of different estimates and assumptions could result in a materially different outcome. The Company generally develops these forecasts based on recent sales data for existing products, planned timing of new product launches or acquisitions, and estimated future growth of the FTTP market.\nGoodwill represents the excess purchase price over the fair value of tangible net assets acquired in acquisitions after amounts have been allocated to intangible assets. Goodwill is tested for impairment annually at fiscal year-end, or more frequently when events or changes in circumstances indicate that the asset might be impaired. Examples of such events or circumstances include, but are not limited to, a significant adverse change in legal or business climate, an adverse regulatory action or unanticipated competition. The Company assesses qualitative factors to determine whether the existence of events or circumstances would indicate that it is more likely than not that the fair value of the reporting unit is less than its carrying amount. During the years ended September 30, 2023, 2022, and 2021, there were no triggering events that indicated goodwill or intangible assets may be impaired.\nIf after assessing the totality of events or circumstances, the Company were to determine that it is more likely than not that the fair value of the reporting unit is less than its carrying amount, then the Company would perform a quantitative test that compares the fair value to its carrying value to determine the amount of any impairment.\nIf the carrying amount of a reporting unit exceeds its fair value, the Company would measure the possible goodwill impairment loss based on an allocation of the estimate of fair value of the reporting unit to all of the underlying assets and liabilities of the reporting unit, including any previously unrecognized intangible assets. The excess of the fair value of a reporting unit over the amounts assigned to its assets and liabilities is the implied fair value of goodwill. An impairment loss is recognized to the extent that a reporting unit's recorded goodwill exceeds the implied fair value of goodwill. An impairment loss would be based on significant estimates and judgments, and if the facts and circumstances change, a potential impairment could have a material impact on the Companys financial statements.\nNo impairment of goodwill or intangible assets has occurred during the years ended September 30, 2023, 2022, and 2021, respectively.\nValuation of Inventory\nThe Company maintains a material amount of inventory to support its manufacturing operations and customer demand. This inventory is stated average cost, subject to the lower of cost or net realizable value. On a regular basis, the Company reviews its inventory and identifies inventory which is excess, slow moving, or obsolete by considering factors such as inventory levels, expected product life, and forecasted sales demand. Any identified excess, slow moving, and obsolete inventory is written down to its market value through a charge to cost of sales. It is possible that additional inventory write-down charges may be required in the future if there is a significant decline in demand for the Companys products and the Company does not adjust its inventory procurement accordingly.\nValuation in Business Combinations\nWe record tangible and intangible assets acquired and liabilities assumed in business combinations under the purchase method of accounting under ASC 805, Business combinations. Amounts paid for each acquisition are allocated to the assets acquired and liabilities assumed based on their fair values at the dates of acquisition. The value recorded is based on estimates of future financial projections. These cash flow projections are discounted with a risk adjusted rate. The fair value of identifiable intangible assets is based on detailed valuations that use information and assumptions provided by management, which is considered managements best estimate of inputs and assumptions that a market participant would use. We allocate any excess purchase price over the fair value of the net tangible and intangible assets acquired and liabilities assumed to goodwill.\nNew Accounting Pronouncements:\nIn June 2016, the Financial Accounting Standards Board (FASB) issued the Accounting Standards Update (ASU) 2016-13, Measurement of Credit Losses on Financial Instruments. In November 2018, the FASB issued update ASU 2018-19 that clarifies the scope of the standard in the amendments in ASU 2016-13. This guidance introduces a new model for recognizing credit losses on financial instruments based on an estimate of current expected credit losses. Financial instruments impacted include accounts receivable, other financial assets measured at amortized cost and other off-balance sheet credit exposures. The new guidance is effective for the Company beginning in the first quarter of fiscal 2024, with early adoption permitted. The Company has evaluated the impact of the adoption of ASU 2016-13 on its consolidated financial statements and determined that the adoption of the new standard would not have a material impact on the Company's consolidated financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company currently invests its excess cash in bank certificates of deposit that are fully insured by the Federal Deposit Insurance Corporation and United States Treasury securities with terms of not more than five years, as well as money market funds. The fair value of these investments fluctuates subject to changes in market interest rates. As of September 30, 2023, and 2022, the Company had combined consolidated balances of cash, cash equivalents, short term, and long-term investments of $174,456,000 and $45,199,000, respectively.\nForeign Exchange Rates:\nThe Company uses the U.S. dollar as its reporting currency. The functional currency of Nestor Cables is the Euro. The changing relationships of the U.S. dollar to the Euro could have a material impact on our financial results. Fluctuations in the Euro to U.S. dollar exchange rate impacts our consolidated balance sheets, as well as sales, cost of sales, and net income. If the Euro had appreciated or depreciated by 10%, relative to the U.S. Dollar, our operating expenses for fiscal year 2023 would have increased or decreased by approximately $570,000 or approximately 1%. We do not hedge against foreign currency fluctuations. As such, fluctuations in foreign currency exchange rates could have a material impact on the Companys financial statements.\nInflation\nRising costs, including wages, logistics, components, and commodity prices are negatively impacting our profitability. We are subject to market risk from fluctuating market prices of certain purchased commodities and raw materials which has outpaced our ability to reduce the cost structure and manufacturability. We do not hedge commodity prices. Accordingly, inflation impacts our profitability, including cost of sales and operating expenses, and may have a material impact on the Companys financial statements. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining an adequate system of internal control over financial reporting of the Company. This system is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with United States generally accepted accounting principles.\nOur internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement conducted an evaluation of the effectiveness of the system of internal control over financial reporting as of September 30, 2023. In making this evaluation, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-2013 Integrated Framework. Based on managements evaluation and those criteria, management concluded that the Companys system of internal control over financial reporting was effective as of September 30, 2023.\nManagements internal control over financial reporting as of September 30, 2023, has been audited by Baker Tilly LLP, an independent registered public accounting firm, as stated in their report appearing on the following page, in which they expressed an unqualified opinion thereon.\nDate: November 29, 2023\n/s/ Cheryl Beranek\nCheryl Beranek\nChief Executive Officer\n/s/ Daniel Herzog\nDaniel Herzog\nChief Financial Officer\nFurther discussion of our internal controls and procedures is included in Item 9A of this report, under the caption Controls and Procedures.\nClearfield, Inc.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 23)\nFinancial Statements\nConsolidated Balance Sheets\nConsolidated Statements of Earnings\nConsolidated Statement of Comprehensive Income\nConsolidated Statements of Shareholders Equity\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the board of directors of Clearfield, Inc.:\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Clearfield, Inc. (the \"Company\") as of September 30, 2023 and 2022, the related consolidated statements of earnings, comprehensive income, shareholders' equity, and cash flows, for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the \"consolidated financial statements\"). We also have audited the Companys internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework: (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of their operations and their cash flows for each of the three years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework: (2013) issued by COSO.\nBasis for Opinions\nThe Companys management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying management report. Our responsibility is to express an opinion on the Company's consolidated financial statements and an opinion on the Companys internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved or are especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Baker Tilly, US, LLP\nWe have served as the Company's auditor since 2013.\nMinneapolis, Minnesota\nNovember 29, 2023\nCLEARFIELD, INC.\nCONSOLIDATED BALANCE SHEETS\n(IN THOUSANDS, EXCEPT SHARE DATA)\nSeptember 30,\nSeptember 30,\nAssets\nCurrent Assets\nCash and cash equivalents\n$ 37,827\n$ 16,650\nShort-term investments\n130,286\n5,802\nAccounts receivables, net\n28,392\n53,704\nInventories, net\n98,055\n82,208\nOther current assets\n1,695\n1,758\nTotal current assets\n296,255\n160,122\nProperty, plant and equipment, net\n21,527\n18,229\nOther Assets\nLong-term investments\n6,343\n22,747\nGoodwill\n6,528\n6,402\nIntangible assets, net\n6,092\n6,376\nRight-of-use lease assets\n13,861\n13,256\nDeferred tax asset\n3,039\n1,414\nOther\n1,872\nTotal other assets\n37,735\n50,777\nTotal Assets\n$ 355,517\n$ 229,128\nLiabilities and Shareholders Equity\nCurrent Liabilities\nCurrent portion of lease liability\n$ 3,737\n$ 3,385\nCurrent maturities of long-term debt\n2,112\n-\nAccounts payable\n8,891\n24,118\nAccrued compensation\n5,571\n13,619\nAccrued expenses\n2,404\n6,181\nFactoring liability\n6,289\n4,391\nTotal current liabilities\n29,004\n51,694\nOther Liabilities\nLong-term debt, net of current maturities\n-\n18,666\nLong-term portion of lease liability\n10,629\n10,412\nDeferred tax liability\nTotal liabilities\n40,354\n81,546\nShareholders Equity\nPreferred stock, $.01 par value; 500,000 shares; no shares issued or outstanding\n-\n-\nCommon stock, authorized 50,000,000, $.01 par value; 15,254,725 and 13,818,452 shares issued and outstanding as of September 30, 2023 and 2022, respectively\nAdditional paid-in capital\n188,218\n54,539\nAccumulated other comprehensive loss\n(544 )\n(1,898 )\nRetained earnings\n127,336\n94,803\nTotal shareholders equity\n315,163\n147,582\nTotal Liabilities and Shareholders Equity\n$ 355,517\n$ 229,128\nSEE ACCOMPANYING NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nCLEARFIELD, INC.\nCONSOLIDATED STATEMENTS OF EARNINGS\n(IN THOUSANDS, EXCEPT SHARE DATA)\nYear Ended\nYear Ended\nYear Ended\nSeptember 30,\nSeptember 30,\nSeptember 30,\nNet sales\n$ 268,720\n$ 270,883\n$ 140,755\nCost of sales\n183,441\n157,936\n79,578\nGross profit\n85,279\n112,947\n61,177\nOperating expenses\nSelling, general and administrative\n47,992\n49,130\n35,943\nIncome from operations\n37,287\n63,817\n25,234\nNet investment income\n5,206\nInterest expense\n(881 )\n(311 )\n-\nIncome before income taxes\n41,612\n63,834\n25,734\nIncome tax expense\n9,079\n14,472\n5,407\nNet income\n$ 32,533\n$ 49,362\n$ 20,327\nNet income per share Basic\n$ 2.17\n$ 3.58\n$ 1.48\nNet income per share Diluted\n$ 2.17\n$ 3.55\n$ 1.47\nWeighted average shares outstanding:\nBasic\n14,975,972\n13,771,665\n13,720,699\nDiluted\n15,012,527\n13,905,984\n13,784,294\nSEE ACCOMPANYING NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nCLEARFIELD, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(IN THOUSANDS)\nYear Ended\nYear Ended\nYear Ended\nSeptember 30,\nSeptember 30,\nSeptember 30,\nComprehensive Income:\nNet income\n$ 32,533\n$ 49,362\n$ 20,327\nOther comprehensive income (loss), net of tax\nUnrealized gain (loss) on available-for-sale investments\n(1,590 )\n-\nUnrealized gain (loss) on foreign currency translation\n(308 )\n-\nTotal other comprehensive income (loss)\n1,354\n(1,898 )\n-\nTotal comprehensive income\n$ 33,887\n$ 47,464\n$ 20,327\nSEE ACCOMPANYING NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nCLEARFIELD, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(IN THOUSANDS)\nFor the year ended September 30, 2023\nAccumulated other\nCommon Stock\nAdditional\ncomprehensive\nRetained\nTotal share-\nShares\nAmount\npaid-in capital\nloss\nearnings\nholders equity\nBalance as of September 30, 2022\n13,818\n$\n$ 54,539\n$ (1,898 )\n$ 94,803\n$ 147,582\nStock-based compensation expense\n-\n-\n3,578\n-\n-\n3,578\nIssuance of common stock under equity compensation plans, net\n-\n-\n-\nIssuance of common stock under employee stock purchase plan\n-\n-\n-\nExercise of stock options, net of shares exchanged for payment\n-\n(491 )\n-\n-\n(491 )\nRepurchase of shares for payment of withholding taxes for vested restricted stock grants\n(17 )\n-\n(1,220 )\n-\n-\n(1,220 )\nIssuance of common stock, net\n1,380\n130,247\n-\n-\n130,262\nOther comprehensive income\n-\n-\n-\n1,354\n-\n1,354\nNet income\n-\n-\n-\n-\n32,533\n32,533\nBalance at September 30, 2023\n15,254\n$\n$ 188,218\n$ (544 )\n$ 127,336\n$ 315,163\nFor the year ended September 30, 2022\nAccumulated other\nCommon Stock\nAdditional\ncomprehensive\nRetained\nTotal share-\nShares\nAmount\npaid-in capital\nloss\nearnings\nholders equity\nBalance as of September 30, 2021\n13,732\n$\n$ 58,246\n$ -\n$ 45,441\n$ 103,824\nStock-based compensation expense\n-\n-\n2,339\n-\n-\n2,339\nIssuance of common stock under equity compensation plans, net\n-\n-\n-\n-\n-\nIssuance of common stock under employee stock purchase plan\n-\n-\n-\nExercise of stock options, net of shares exchanged for payment\n(5,184 )\n-\n-\n(5,183 )\nRepurchase of shares for payment of withholding taxes for vested restricted stock grants\n(13 )\n-\n(1,406 )\n-\n-\n(1,406 )\nOther comprehensive loss\n-\n-\n-\n(1,898 )\n-\n(1,898 )\nNet income\n-\n-\n-\n-\n49,362\n49,362\nBalance at September 30, 2022\n13,818\n$\n$ 54,539\n$ (1,898 )\n$ 94,803\n$ 147,582\nFor the year ended September 30, 2021\nAccumulated other\nCommon Stock\nAdditional\ncomprehensive\nRetained\nTotal share-\nShares\nAmount\npaid-in capital\nloss\nearnings\nholders equity\nBalance as of September 30, 2020\n13,650\n$\n$ 57,503\n$ -\n$ 25,114\n$ 82,754\nStock-based compensation expense\n-\n-\n1,280\n-\n-\n1,280\nIssuance of common stock under equity compensation plans, net\n-\n-\n-\n-\n-\nIssuance of common stock under employee stock purchase plan\n-\n-\n-\nExercise of stock options, net of shares exchanged for payment\n-\n(458 )\n-\n-\n(458 )\nRepurchase of shares for payment of withholding taxes for vested restricted stock grants\n(12 )\n-\n(462 )\n-\n-\n(462 )\nNet income\n-\n-\n-\n-\n20,327\n20,327\nBalance at September 30, 2021\n13,732\n$\n$ 58,246\n$ -\n$ 45,441\n$ 103,824\nSEE ACCOMPANYING NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nCLEARFIELD, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(IN THOUSANDS)\nYear Ended\nYear Ended\nYear Ended\nSeptember 30,\nSeptember 30,\nSeptember 30,\nCash flows from operating activities\nNet income\n$ 32,533\n$ 49,362\n$ 20,327\nAdjustments to reconcile net income to net cash provided by (used in) operating activities:\nDepreciation and amortization\n6,054\n3,426\n2,302\nChange in allowance for doubtful accounts\n-\n-\nAmortization of discount on investments\n(3,512 )\n(42 )\n(7 )\nDeferred taxes\n(2,114 )\n(326 )\n(187 )\nStock-based compensation\n3,578\n2,339\n1,280\nChanges in operating assets and liabilities, net of acquired amounts:\nAccounts receivable\n26,277\n(24,234 )\n(9,151 )\nInventories, net\n(15,083 )\n(43,744 )\n(13,116 )\nOther assets\n(1,466 )\n(282 )\n(531 )\nAccounts payable and accrued expenses\n(26,257 )\n14,502\n9,776\nNet cash provided by operating activities\n20,010\n1,001\n10,903\nCash flows from investing activities\nPurchases of property, plant and equipment and intangible assets\n(8,384 )\n(9,148 )\n(2,046 )\nPurchases of investments\n(210,923 )\n(248 )\n(24,809 )\nProceeds from sales and maturities of investments\n107,060\n17,386\n13,255\nBusiness acquisition, net of cash acquired\n-\n(16,187 )\n-\nNet cash used in investing activities\n(112,247 )\n(8,197 )\n(13,600 )\nCash flows from financing activities\nIssuance (Repayment) of long-term debt\n(16,700 )\n16,700\n-\nProceeds from issuance of common stock under employee stock purchase plan\nRepurchase of shares for payment of withholding taxes for vested restricted stock grants\n(1,220 )\n(1,406 )\n(462 )\nWithholding related to exercise of stock options\n(491 )\n(5,183 )\n(458 )\nIssuance of stock under equity compensation plans\n-\n-\nNet proceeds from issuance of common stock\n130,262\n-\n-\nNet cash provided by (used in) financing activities\n113,416\n10,655\n(536 )\nEffect of exchange rates on cash\n(2 )\n(24 )\n-\nIncrease (decrease) in cash and cash equivalents\n21,177\n3,434\n(3,233 )\nCash and cash equivalents, beginning of year\n16,650\n13,216\n16,450\nCash and cash equivalents, end of year\n$ 37,827\n$ 16,650\n$ 13,216\nSupplemental disclosures for cash flow information\nCash paid during the year for income taxes\n$ 12,967\n$ 13,744\n$ 5,505\nCash paid for interest\n$\n$\n$ -\nNon-cash financing activities\nCashless exercise of stock options\n$\n$ 1,624\n$ 1,271\nSEE ACCOMPANYING NOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1. Summary of Significant Accounting Policies\nDescription of Business: Clearfield, Inc. and subsidiaries (the Company) manufactures a broad range of fiber connectivity products to customers throughout the United States and internationally, and since the July 26, 2022, acquisition of Nestor Cables Oy, manufactures fiber optic and copper telecommunication cables and equipment through its Finnish subsidiaries. Refer to Note 11 for further information regarding the acquisition of Nestor Cables.\nWe are engaged in global operations. Our operations currently comprise of two reportable segments: the Clearfield segment, (referred to herein as Clearfield) and, since July 26, 2022, the Nestor Cables segment (referred to herein as Nestor Cables or Nestor). Prior to July 26, 2022, we were considered to be in a single operating segment structure.\nThe Companys products include fiber distribution systems, optical components, Outside Plant (OSP) cabinets, and fiber and copper cable assemblies that serve the communication service provider markets, including Fiber-to-the-Premises (FTTP), large enterprise, and original equipment manufacturer (OEM) markets.\nPrinciples of Consolidation: The consolidated financial statements include the accounts of Clearfield, Inc. and its wholly owned subsidiaries. All significant intercompany accounts and transactions have been eliminated in consolidation.\nRevenue Recognition: Our revenue is comprised of the sale of our products to customers and is recognized when the Company satisfies its performance obligations under the applicable sales contract. A performance obligation is a promise in a sales contract to transfer a distinct product or service to a customer. Substantially all our sales contracts have a single performance obligation and are short term in nature. We recognize revenue by transferring the promised products to the customer, with substantially all revenue recognized at the point in time when the customer obtains control of the products. Shipping and handling costs charged to our customers are included in net sales, while the corresponding shipping expenses are included in cost of sales. Sales, value add, and other taxes collected from customers and remitted to governmental authorities are accounted for on a net (excluded from revenue) basis.\nCash and Cash Equivalents: The Company considers all highly liquid investments with original maturities of three months or less to be cash equivalents. The following table presents the Companys cash and cash equivalents balances:\n(In thousands)\nSeptember 30,\nSeptember 30,\nCash and cash equivalents:\nCash including money market accounts\n$ 11,360\n$ 16,635\nMoney market funds\n26,467\nTotal cash and cash equivalents\n$ 37,827\n$ 16,650\nThe Company maintains cash balances at multiple financial institutions, and at times, such balances exceeded insured limits. The Company has not experienced any losses in such accounts.\nInvestments: The Company currently invests its excess cash in bank certificates of deposit (CDs) that are fully insured by the Federal Deposit Insurance Corporation (FDIC) and United States Treasury (Treasuries) securities with terms of not more than five years, as well as money market accounts. Historically, the Companys investment portfolio had been classified as held-to-maturity and recorded at amortized cost. During the second quarter of fiscal 2022, the Company sold investments and has reclassified its investment portfolio to available-for-sale, which is reported at fair value. The unrealized gain or loss on investment securities is recorded in other comprehensive income, net of tax. Realized gains and losses on available-for-sale securities are recognized upon sale and are included in net investment income in the consolidated statement of earnings.\nForeign Currency Translation: Balance sheet and statement of earnings of our international subsidiaries are measured using local currency as their functional currency. Assets and liabilities of these operations are translated at the exchange rates in effect at each fiscal year-end. Statements of operations accounts are translated at the average rates of exchange prevailing during the year. Translation adjustments arising from the use of differing exchange rates from period to period are included as a cumulative translation adjustment in shareholders equity.\nComprehensive Income (Loss): Total comprehensive income and the components of accumulated other comprehensive loss are presented in the Consolidated Statements of Comprehensive Income and the Consolidated Statements of Shareholders' Equity. Accumulated other comprehensive loss is composed of foreign currency translation effects and unrealized gains and losses on available-for-sale marketable debt securities. We use the individual item approach for releasing income tax effects from accumulated other comprehensive loss.\nFair Value of Financial Instruments: The financial statements include the following financial instruments: cash and cash equivalents, investments, accounts receivable and accounts payable. The Company estimates the fair value of investments as of the balance sheet date. All other financial instruments carrying values approximate fair values because of the short-term nature of the instruments.\nAccounts Receivable: Credit is extended based on the evaluation of a customers financial condition and collateral is generally not required. Accounts that are outstanding longer than the contractual payment terms are considered past due. The Company does not charge interest on past due receivables. The Company determines its allowance for doubtful accounts by considering a number of factors, including the length of time trade receivables are past due, the Companys previous loss history, the customers current ability to pay its obligation to the Company, and the condition of the general economy and the industry as whole. The Company writes off accounts receivable when they become uncollectible; payments subsequently received on such receivables are credited to the allowance for doubtful accounts.\nThe allowance for doubtful accounts activity for the years ended September 30, 2023, and 2022 is as follows:\nYear Ended\nBalance at\n\t\t\tBeginning of Year\nAdditions\n\t\t\t(Recoveries)\n\t\t\tCharged to\n\t\t\tCosts and\n\t\t\tExpenses\nLess\n\t\t\tWrite-offs\nBalance at End of\n\t\t\tYear\nSeptember 30, 2023\n$ 79,000\n$ -\n$ -\n$ 79,000\nSeptember 30, 2022\n$ 79,000\n$ -\n$ 79,000\nInventories: Inventories consist of finished goods, raw materials, and work-in-process and are stated at average cost, subject to the lower of cost or net realizable value. Certain components of the Companys inventory classified as raw materials or finished goods can be used as a component to manufacture products or can be sold directly to the customer. Inventory is valued using material costs, labor charges, and allocated factory overhead charges and consists of the following:\nSeptember 30,\nSeptember 30,\n(In thousands)\nRaw materials\n$ 73,657\n$ 69,142\nWork-in-process\n1,462\n4,592\nFinished goods\n29,696\n10,803\nInventories, gross\n104,815\n84,537\nInventory reserve\n(6,760 )\n(2,329 )\nInventories, net\n$ 98,055\n$ 82,208\nOn a regular basis, the Company reviews its inventory and identifies that which is excess, slow moving, and obsolete by considering factors such as inventory levels, expected product life, and forecasted sales demand. A reserve is established for any identified excess, slow moving, and obsolete inventory through a charge to cost of sales. Inventory write-down charges may be required in the future if there is a significant decline in demand for the Companys products and the Company does not adjust its manufacturing production accordingly or if new products are not accepted by the market.\nProperty, Plant and Equipment: Property, plant and equipment are recorded at cost. Significant additions or improvements extending asset lives are capitalized, while repairs and maintenance are charged to expense when incurred. Depreciation is provided in amounts sufficient to relate the cost of assets to operations over their estimated useful lives. Leasehold improvements are amortized over the shorter of the remaining term of the lease or estimated life of the asset.\nEstimated useful lives of the assets are as follows:\nYears\nEquipment\n3 - 15\nLeasehold improvements\n7-10 or life of lease\nVehicles\nProperty, plant and equipment consist of the following:\n(In thousands)\nSeptember 30,\nSeptember 30,\nManufacturing equipment\n$ 23,580\n$ 18,418\nOffice equipment\n4,560\n4,174\nLeasehold improvements\n6,107\n5,000\nVehicles\nConstruction in progress\n2,447\n1,715\nProperty, plant and equipment, gross\n37,140\n29,647\nLess accumulated depreciation\n15,613\n11,418\nProperty, plant and equipment, net\n$ 21,527\n$ 18,229\nDepreciation expense for the years ended September 30, 2023, 2022, and 2021 was $4,915,000, $2,647,000, and $1,699,000, respectively.\nGoodwill and Intangible Assets: Goodwill represents the excess purchase price over the fair value of tangible net assets acquired in acquisitions after amounts have been allocated to intangible assets. Goodwill is tested for impairment annually at fiscal year-end, or more frequently when events or changes in circumstances indicate that the asset might be impaired. Examples of such events or circumstances include, but are not limited to, a significant adverse change in legal or business climate, an adverse regulatory action or unanticipated competition. The Company assesses qualitative factors to determine whether the existence of events or circumstances would indicate that it is more likely than not that the fair value of the reporting unit is less than its carrying amount. During the years ended September 30, 2023, 2022, and 2021, there were no triggering events that indicated goodwill or intangible assets may be impaired.\nIf after assessing the totality of events or circumstances, the Company were to determine that it is more likely than not that the fair value of the reporting unit is less than its carrying amount, then the Company would perform a quantitative test that compares the fair value to its carrying value to determine the amount of any impairment.\nIf the carrying amount of a reporting unit exceeds its fair value, the Company would measure the possible goodwill impairment loss based on an allocation of the estimate of fair value of the reporting unit to all the underlying assets and liabilities of the reporting unit, including any previously unrecognized intangible assets. The excess of the fair value of a reporting unit over the amounts assigned to its assets and liabilities is the implied fair value of goodwill. An impairment loss is recognized to the extent that a reporting unit's recorded goodwill exceeds the implied fair value of goodwill. An impairment loss would be based on significant estimates and judgments, and if the facts and circumstances change, a potential impairment could have a material impact on the Companys financial statements.\nNo impairment of goodwill or intangible assets has occurred during the years ended September 30, 2023, 2022, and 2021, respectively.\nThe Company capitalizes legal costs incurred to obtain patents. Once accepted by either the U.S. Patent Office or the equivalent office of a foreign country, these legal costs are amortized using the straight-line method over the remaining estimated lives, not exceeding 20 years. As of September 30, 2023, the Company has 47 patents granted and multiple pending applications both inside and outside the United States.\nIn addition, the Company has various finite life intangible assets, most of which were acquired as a result of the acquisition of a portfolio of Telcordia certified outdoor active cabinet products from Calix, Inc. (Calix) during fiscal year 2018 and the acquisition of Nestor Cables as of July 26, 2022. Refer to Note 11 for further information regarding the acquisition of Nestor Cables. Finite life intangible assets as of September 30, 2023, and 2022 are as follows:\nSeptember 30, 2023\n(In thousands)\nUseful\n\t\t\tLife\n\t\t\t(Years)\nGross Carrying\n\t\t\tAmount\nAccumulated\n\t\t\tAmortization\nNet Book Value\n\t\t\tAmount\nCustomer relationships\n$ 4,894\n$ 1,582\n$ 3,312\nCertifications\nTrademarks\n8-10\n1,333\nPatents\n1,119\nDeveloped Technology\nOther\n-\nSoftware\n1-3\n2,613\n2,026\nTotals\n$ 10,860\n$ 4,768\n$ 6,092\nSeptember 30, 2022\n(In thousands)\nUseful\n\t\t\tLife\n\t\t\t(Years)\nGross Carrying\n\t\t\tAmount\nAccumulated\n\t\t\tAmortization\nNet Book Value\n\t\t\tAmount\nCustomer relationships\n$ 4,833\n$ 1,273\n$ 3,559\nCertifications\nTrademarks\n8-10\n1,306\nPatents\nDeveloped Technology\nOther\n-\nSoftware\n1-3\n2,452\n1,909\nTotals\n$ 10,407\n$ 4,030\n$ 6,376\nAmortization expense related to these assets for the years ended September 30, 2023, 2022, and 2021 was $1,128,000, $766,000, and $602,000, respectively.\nOur future estimated amortization expense for intangibles is as follows as of September 30, 2023:\n(In thousands)\nEstimated amortization\n\t\t\texpense\nFY 2024\n$ 1,148\nFY 2025\nFY 2026\nFY 2027\nFY 2028\nThereafter\n2,754\nTotal\n$ 6,092\nImpairment of Long-Lived Assets: The Company assesses potential impairments to its long-lived assets or asset groups when there is evidence that events occur or changes in circumstances indicate that the carrying amount of an asset or asset group may not be recovered. An impairment loss is recognized when the carrying amount of the long-lived asset or asset group is not recoverable and exceeds its fair value. The carrying amount of a long-lived asset or asset group is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset or asset group.\nAny required impairment loss is measured as the amount by which the carrying amount of a long-lived asset or asset group exceeds its fair value and is recorded as a reduction in the carrying value of the related asset or asset group and a charge to operating results. No impairment of long-lived assets occurred during the years ended September 30, 2023, 2022, or 2021, respectively.\nIncome Taxes: The Company records income taxes in accordance with the liability method of accounting. Deferred taxes are recognized for the estimated taxes ultimately payable or recoverable based on enacted tax law. The Company establishes a valuation allowance to reduce the deferred tax assets when it is more likely than not that a deferred tax asset will not be realizable. Changes in tax rates are reflected in the tax provision as they occur.\nIn accounting for uncertainty in income taxes, we recognize the financial statement benefit of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more likely than not threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement with the relevant tax authority. As of September 30, 2023, and 2022, the Company did not have any unrecognized tax benefits. The Company recognizes interest and penalties accrued on any unrecognized tax benefits as a component of income tax expense. We do not expect any material changes in our unrecognized tax benefits over the next 12 months.\nStock-Based Compensation: We measure and recognize compensation expense for all stock-based awards at fair value over the requisite service period. We use the Black-Scholes option pricing model to determine the fair value of options. For restricted stock grants, fair value is determined as the average price of the Companys stock on the date of grant. Equity-based compensation expense is broken out between cost of sales and selling, general and administrative expenses based on the classification of the employee. The determination of fair value of stock-based awards on the date of grant using an option-pricing model is affected by our stock price as well as by assumptions regarding a number of subjective variables. These variables include, but are not limited to, the expected stock price volatility over the term of the awards, and actual and projected employee stock option exercise behaviors.\nThe expected terms of the options are based on evaluations of historical and expected future employee exercise behavior. The risk-free interest rate is based on the U.S. Treasury rates at the date of grant with maturity dates approximately equal to the expected life at grant date. Volatility is based on historical and expected future volatility of the Companys stock. The Company has not historically issued any dividends and does not expect to in the future. Forfeitures for both option and restricted stock grants are estimated at the time of the grant and revised in subsequent periods if actual forfeitures differ from estimates.\nIf factors change and we employ different assumptions in the determination of the fair value of grants in future periods, the related compensation expense that we record may differ significantly from what we have recorded in the current periods.\nShare Repurchase Program: Effective January 27, 2022, the Company reinstated its stock repurchase program that had been suspended in April 2020 due to COVID uncertainty. In addition, effective January 27, 2022, the Companys board of directors increased the share repurchase program by an additional $10 million to an aggregate of $22 million, from the previous $12 million. As of September 30, 2023, we have repurchased an aggregate of 565,590 shares for approximately $7,019,000, leaving approximately $14,981,000 available within our $22,000,000 stock repurchase program. The repurchase program does not obligate the Company to repurchase any particular amount of common stock during any period. The repurchase will be funded by cash on hand. During the year ended September 30, 2023, the Company did not repurchase any shares under the stock repurchase program. As of September 30, 2022, we had repurchased an aggregate of 565,590 shares for approximately $7,019,000, leaving approximately $14,981,000 available within our $22,000,000 stock repurchase program.\nOn November 7, 2023, the Company's board of directors increased the share repurchase program to an aggregate of 40 million from the previous $22 million, leaving approximately $32,980,671 available for repurchase.\nThe Company is authorized to issue 50,000,000 shares of common stock at $.01 par value and 5,000,000 undesignated shares. From the undesignated shares, 500,000 shares have been designated as Series B Junior Participating Preferred Shares and none of such shares have been issued or are outstanding. The Board of Directors may, by resolution, establish from the remaining undesignated shares different classes or series of shares and may fix the relative rights and preferences of shares in any class or series.\nResearch and Development Costs: Research and development costs amounted to $3,115,000, $895,000 and $1,243,000 for the years ended September 30, 2023, 2022, and 2021, respectively, and are charged to expense when incurred.\nAdvertising Costs: Advertising costs amounted to $609,000, $537,000, and $436,000 for the years ended September 30, 2023, 2022, and 2021, respectively, and are charged to expense when incurred.\nNet Income Per Share: Basic and diluted net income per share is computed by dividing net income by the weighted average number of common shares outstanding and the weighted average number of dilutive shares outstanding, respectively.\nWeighted average common shares outstanding for the years ended September 30, 2023, 2022, and 2021 were as follows:\nYear ended September 30,\n(In thousands except share data)\nNet income\n$ 32,533\n$ 49,362\n$ 20,327\nWeighted average common shares\n14,975,972\n13,771,665\n13,720,699\nDilutive potential common shares\n36,555\n134,319\n63,593\nWeighted average dilutive common shares outstanding\n15,012,527\n13,905,984\n13,784,294\nEarnings per share:\nBasic\n$ 2.17\n$ 3.58\n$ 1.48\nDiluted\n$ 2.17\n$ 3.55\n$ 1.47\nThere were no antidilutive shares for the years ended September 30, 2023, 2022, or 2021.\nUse of Estimates: The preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, related revenues and expenses and disclosure about contingent assets and liabilities at the date of the financial statements. Significant estimates include the rebates related to revenue recognition, stock-based compensation and the valuation of inventory, long-lived assets, finite lived intangible assets and goodwill. Actual results may differ materially from these estimates.\nReclassification: For the purposes of comparability, certain prior period amounts have been reclassified to conform to current period classification. There was no impact to prior period net income or shareholders equity.\nNew Accounting Pronouncements:\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments. In November 2018, the FASB issued update ASU 2018-19 that clarifies the scope of the standard in the amendments in ASU 2016-13. This guidance introduces a new model for recognizing credit losses on financial instruments based on an estimate of current expected credit losses. Financial instruments impacted include accounts receivable, other financial assets measured at amortized cost and other off-balance sheet credit exposures. The new guidance is effective for the Company beginning in the first quarter of fiscal 2024, with early adoption permitted. The Company has evaluated the impact of the adoption of ASU 2016-13 on its consolidated financial statements and determined that the adoption of the new standard would not have a material impact on the Company's consolidated financial statements.\nNote 2. Stock Based Compensation\nStock-Based Compensation: The Companys stock-based compensation plans are administered by the Compensation Committee of the board of directors, which selects persons to receive awards and determines the number of shares subject to each award and the terms, conditions, performance measures and other provisions of the award.\nOn February 23, 2023, the Companys shareholders approved the Clearfield, Inc. 2022 Stock Compensation Plan (the 2022 Plan). The 2022 Plan became effective on the date of shareholder approval, and no further awards may be made under the Clearfield, Inc. Amended and Restated 2007 Stock Compensation Plan (the Prior Plan) following the effective date of the 2022 Plan. The total number of shares of stock reserved and available for distribution under the 2022 Plan upon approval was 1,461,461 shares, which includes the number of shares remaining for grant and delivery under the Prior Plan, plus any shares subject to outstanding awards under the Prior Plan as of the effective date of the 2022 Plan that were forfeited, cancelled, or settled for cash.\nAs of September 30, 2023, $4,445,000 of total unrecognized compensation expense related to non-vested awards is expected to be recognized over a period of approximately 2.9 years. The Company recorded related compensation expense for the years ended September 30, 2023, 2022, and 2021 of $3,578,000, $2,339,000, and $1,280,000, respectively. For the year ended September 30, 2023, $3,407,000 of this expense was included in selling, general and administrative expense and $171,000 was included in cost of sales. For the year ended September 30, 2022, $2,213,000 of this expense was included in selling, general and administrative expense and $126,000 was included in cost of sales. For the year ended September 30, 2021, $1,223,000 of this expense was included in selling, general and administrative expense and $57,000 was included in cost of sales.\nStock Options: The Company uses the Black-Scholes option pricing model to determine the fair value of options granted. During the fiscal year ended September 30, 2023, the Company granted employees non-qualified stock options to purchase an aggregate of 40,266 shares of common stock with a weighted average contractual term of five years, a weighted average three-year vesting term, and a weighted average exercise price of $64.38. During the fiscal year ended September 30, 2022, the Company granted employees non-qualified stock options to purchase an aggregate of 62,730 shares of common stock with a weighted average contractual term of five years, a weighted average three-year vesting term, and a weighted average exercise price of $66.48. During the fiscal year ended September 30, 2021, the Company granted employees non-qualified stock options to purchase an aggregate of 105,089 shares of common stock with a weighted average contractual term of 5 years, a 3-year weighted average vesting term, and an exercise price of $23.74.\nThe fair value of stock option awards during the year ended September 30, 2023, 2022, and 2021 was estimated as of the respective grant dates using the assumptions listed below:\nYear ended September 30, 2023\nYear ended September 30, 2022\nYear ended September 30, 2021\nDividend yield\n%\n%\n%\nWeighted average expected volatility\n63.14 %\n52.02 %\n46.90 %\nWeighted average risk-free interest rate\n3.75 %\n0.97 %\n0.24 %\nWeighted average expected life\n5 years\n5 years\n5 years\nVesting period\n3 years\n3 years\n3 years\nThe expected stock price volatility is based on the historical volatility of the Companys stock for a period approximating the expected life. The expected life represents the period of time that options are expected to be outstanding after their grant date. The risk-free interest rate reflects the interest rate at grant date on zero-coupon U.S. governmental bonds having a remaining life similar to the expected option term.\nOptions are generally granted at fair market values determined on the date of grant and vesting normally occurs over a three to five-year period. The maximum contractual term is normally six years. Shares issued upon exercise of a stock option are issued from the Companys authorized but unissued shares. There were 79,911 options vested during the year ended September 30, 2023, 113,727 options vested during the year ended September 30, 2022, and 79,833 options vested during the year ended September 30, 2021. For the year ended September 30, 2023, there were 21,630 stock options that were exercised using a cashless method of exercise. For the year ended September 30, 2022, there were 125,651 stock options that were exercised using a cashless method of exercise. For the year ended September 30, 2021, there were 101,966 stock options that were exercised using a cashless method of exercise. The intrinsic value of options exercised during the years ended September 30, 2023, 2022, and 2021 was $1,603,000, $11,279,000, and $1,315,000 respectively.\nOption transactions under the 2022 Plan during the year ended September 30, 2023, and under the Prior Plan for the years ended September 30, 2022 and 2021 are summarized as follows:\nNumber of shares\nWeighted average exercise price\nWeighted average fair value\nOutstanding as of September 30, 2020\n337,100\n$ 12.48\nGranted\n105,089\n23.74\n$ 8.14\nExercised\n(101,966 )\n12.47\nForfeited and expired\n(38,709 )\n13.68\nOutstanding as of September 30, 2021\n301,514\n$ 16.25\nGranted\n62,730\n66.48\n$ 25.54\nExercised\n(125,651 )\n12.92\nForfeited and expired\n(2,084 )\n19.94\nOutstanding as of September 30, 2022\n236,509\n$ 31.30\nGranted\n40,266\n64.38\n$ 30.83\nExercised\n(21,630 )\n26.16\nForfeited and expired\n(1,021 )\n18.18\nOutstanding as of September 30, 2023\n254,124\n$ 37.04\nThe following table summarizes information concerning options exercisable under the 2022 Plan and the Prior Plan as of the years ended September 30, 2023, 2022 and 2021:\nAs of Year Ended\nExercisable\nWeighted average remaining contractual life\nWeighted average exercise price\nAggregate intrinsic value (in thousands)\nSeptember 30, 2023\n97,056\n2.28 years\n$ 28.13\n$ 2,731\nSeptember 30, 2022\n39,276\n2.78 years\n$ 20.26\n$ 3,314\nSeptember 30, 2021\n51,201\n2.29 years\n$ 12.28\n$ 1,632\nThe following table summarizes information concerning options currently outstanding at:\nAs of Year Ended\nNumber outstanding\nWeighted average remaining contractual life\nWeighted average exercise price\nAggregate intrinsic value (in thousands)\nSeptember 30, 2023\n254,124\n2.72 years\n$ 37.04\n$ 9,413\nSeptember 30, 2022\n236,509\n3.30 years\n$ 31.30\n$ 17,343\nSeptember 30, 2021\n301,514\n3.22 years\n$ 16.25\n$ 8,412\nRestricted Stock: The 2022 Plan permits, and the Prior Plan permitted, the Compensation Committee of the board of directors to grant stock-based awards, including stock options and restricted stock, to key employees and non-employee directors. The Company has made restricted stock grants that vest over one to ten years.\nRestricted stock transactions during the years ended September 30, 2023, 2022, and 2021 are summarized as follows:\nNumber of shares\nWeighted average grant date fair value\nUnvested shares as of September 30, 2020\n109,070\n$ 12.98\nGranted\n39,807\n24.20\nVested\n(35,840 )\n12.48\nForfeited\n(4,198 )\n15.45\nUnvested shares as of September 30, 2021\n108,839\n$ 17.14\nGranted\n29,512\n65.90\nVested\n(37,094 )\n17.78\nForfeited\n(2,749 )\n16.84\nUnvested share, s as of September 30, 2022\n98,508\n$ 31.51\nGranted\n41,492\n70.50\nVested\n(47,869 )\n30.98\nForfeited\n(1,556 )\n15.61\nUnvested shares as of September 30, 2023\n90,575\n$ 49.92\nThe fair value of restricted shares vested during the year end September 30, 2023, 2022, and 2021 was $3,141,000, $3,744,000, and $1,364,000 respectively. The Company repurchased a total of 12,862 shares of our common stock at an average price of $62.20 in connection with payment of taxes upon the vesting of restricted stock previously issued to employees for the year ended September 30, 2023. The Company repurchased a total of 13,292 shares of our common stock at an average price of $105.78 in connection with payment of taxes upon the vesting of restricted stock previously issued to employees for the year ended September 30, 2022. The Company repurchased a total of 11,754 shares of our common stock at an average price of $39.32 in connection with payment of taxes upon the vesting of restricted stock previously issued to employees for the year ended September 30, 2021.\nBonus Stock: During the fiscal year ended September 30, 2023, the Company granted employees an aggregate of 9,144 shares of common stock as a discretionary bonus for fiscal 2022 performance. The bonus stock consisted of common stock with no vesting period or restrictions. The fair value on the date of issuance was $104.36 per share. No bonus stock was granted in the fiscal year ended September 30, 2022.\nEmployee Stock Purchase Plan: The Clearfield, Inc. 2010 Employee Stock Purchase Plan (ESPP) allows participating employees to purchase shares of the Companys common stock at a discount through payroll deductions. The ESPP is available to all employees subject to certain eligibility requirements. Terms of the ESPP provide that participating employees may purchase the Companys common stock on a voluntary after-tax basis. Employees may purchase the Companys common stock at a price that is no less than the lower of 85% of the fair market value of one share of common stock at the beginning or end of each stock purchase period or phase. The ESPP is carried out in six-month phases, with phases beginning on July 1 and January 1 of each calendar year. For the phase that ended on June 30, 2023, employees purchased 7,754 shares at a price of $40.25 per share. For the phase that ended on December 31, 2022, employees purchased 5,585 shares at a price of $53.52 per share. As of September 30, 2023, the Company has withheld approximately $154,000 from employees participating in the phase that began on July 1, 2023. In February 2020, the shareholders of Clearfield, Inc. approved an increase of 200,000 in the shares authorized for issuance under the ESPP. After the employee purchase on June 30, 2023, 168,251 shares of common stock were available for future purchase under the ESPP.\nNote 3. Investments\nThe Company invests in CDs in amounts that are fully insured by the FDIC and Treasuries with terms of not more than five years, as well as money market funds. During the second quarter of fiscal 2022, the Company sold investments and has reclassified its investment portfolio to available-for-sale, which is reported at fair value. The unrealized gain or loss on investment securities is recorded in other comprehensive income (loss), net of tax. Realized gains and losses on available-for-sale securities are recognized upon sale and are included in net investment income in the consolidated statement of earnings. The Company did not sell investment securities during the years ended September 30, 2023.\nAs of September 30, 2023, available-for-sale investments consist of the following:\nSeptember 30, 2023\n(In thousands)\nCost\nUnrealized Gains\nUnrealized Losses\nFair Value\nShort-Term\nU.S. treasury securities\n$ 122,534\n$ -\n$\n$ 122,391\nCertificates of deposit\n8,014\n-\n7,895\nInvestment securities - short-term\n$ 130,548\n$ -\n$\n$ 130,286\nLong-Term\nU.S treasury securities\n$ 6,719\n$ -\n$\n$ 6,123\nCertificates of deposit\n-\nInvestment securities - long-term\n$ 6,967\n$ -\n$\n$ 6,343\nAs of September 30, 2022, available-for-sale investments consisted of the following:\nSeptember 30, 2022\n(In thousands)\nCost\nUnrealized Gains\nUnrealized Losses\nFair Value\nShort-Term\nCertificates of deposit\n$ 5,945\n$ -\n$\n$ 5,802\nInvestment securities - short-term\n$ 5,945\n$ -\n$\n$ 5,802\nLong-Term\nU.S treasury securities\n$ 16,178\n$ -\n$ 1,085\n$ 15,093\nCertificates of deposit\n8,016\n-\n7,654\nInvestment securities - long-term\n$ 24,194\n$ -\n$ 1,447\n$ 22,747\nThe Company did not sell any investments in the year ended September 30, 2023. For the year ended September 30, 2022, proceeds from the sale of investments was $14,365,000, upon which the Company realized within earnings gross realized gains on the sale of $92,000 partially offset by gross realized losses of $53,000. The specific identification method is used to determine the cost of the securities sold. The Companys sale of investment securities was associated with its need to respond to significant unanticipated and unprecedented growth in its sales order backlog coupled with supply chain challenges to obtain the inventory necessary for fulfillment of these orders, as well as the reevaluation of the Companys approach to use of available capital.\nAs of September 30, 2023, investments in debt securities in an unrealized loss position were as follows:\nIn Unrealized Loss Position For Less Than 12 Months\nIn Unrealized Loss Position For Greater Than 12 Months\n(In thousands)\nFair Value\nGross Unrealized Losses\nFair Value\nGross Unrealized Losses\nU.S treasury securities\n$ 112,908\n$\n$ 15,606\n$\nCertificates of deposit\n-\n7,870\nInvestment securities\n$ 113,153\n$\n$ 23,476\n$\nAs of September 30, 2022, investments in debt securities in an unrealized loss position were as follows:\nIn Unrealized Loss Position For Less Than 12 Months\nIn Unrealized Loss Position For Greater Than 12 Months\n(In thousands)\nFair Value\nGross Unrealized Losses\nFair Value\nGross Unrealized Losses\nU.S treasury securities\n$ -\n$ -\n$ 15,093\n$ 1,085\nCertificates of deposit\n6,345\n7,111\nInvestment securities\n$ 6,345\n$\n$ 22,204\n$ 1,414\nAs of September 30, 2023, there were 42 securities in an unrealized loss position which is due to the securities paying lower interest rates than the market. As of September 30, 2023, there are no securities which are other than temporarily impaired as the Company intends to hold these securities until their value recovers and there is negligible credit risk due to the nature of the securities which are backed by the FDIC and US federal government.\nNote 4. Fair Value Measurements\nThe Company determines the fair value of its assets and liabilities based on the market price that would be received for an asset or paid to transfer a liability (exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. The Company determines the fair value of Treasuries and CDs based on valuations provided by an external pricing service, which obtains them from a variety of industry standard data providers.\nThe Companys investments are categorized according to the three-level fair value hierarchy which distinguishes between observable and unobservable inputs, in one of the following levels:\nLevel 1- Quoted prices in active markets for identical assets or liabilities.\nLevel 2- Observable inputs other than quoted prices included in Level 1, such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data.\nLevel 3- Unobservable inputs to the valuation methodology that are supported by little or no market activity and that are significant to the measurement of the fair value of the assets or liabilities. Level 3 assets and liabilities include those with fair value measurements that are determined using pricing models, discounted cash flow valuation or similar techniques, as well as significant management judgment or estimation.\nThe following provides information regarding fair value measurements for the Companys investment securities as of September 30, 2023, according to the three-level fair value hierarchy:\nFair Value Measurements as of September 30, 2023\n(In thousands)\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash equivalents:\nMoney market funds\n$ 26,467\n$ 26,467\n$ -\n$ -\nTotal cash equivalents\n$ 26,467\n$ 26,467\n$ -\n$ -\nInvestment securities:\nCertificates of deposit\n$ 8,115\n$ -\n$ 8,115\n$ -\nU.S. Treasury securities\n128,514\n-\n128,514\n-\nTotal investment securities\n$ 136,629\n$ -\n$ 136,629\n$ -\nDuring the year ended September 30, 2023, we owned no Level 3 securities and there were no transfers within the fair value level hierarchy.\nNon-financial assets such as equipment and leasehold improvements, goodwill and intangible assets and right-of-use assets for operating leases are subject to non-recurring fair value measurements if they are deemed impaired. We had no re-measurements of non-financial assets to fair value in the years-end September 30, 2023 and 2022.\nThe following provides information regarding fair value measurements for the Companys investment securities as of September 30, 2022, according to the three-level fair value hierarchy:\nFair Value Measurements as of September 30, 2022\n(In thousands)\nTotal\nLevel 1\nLevel 2\nLevel 3\nCash equivalents:\nMoney market funds\n$\n$\n$ -\n$ -\nTotal cash equivalents\n$\n$\n$ -\n$ -\nInvestment securities:\nCertificates of deposit\n$ 13,456\n$ -\n$ 13,456\n$ -\nU.S. Treasury securities\n15,093\n-\n15,093\n-\nTotal investment securities\n$ 28,549\n$ -\n$ 28,549\n$ -\nNote 5. Other Comprehensive Income (Loss)\nChanges in components of other comprehensive income (loss), net of tax, are as follows:\n(In thousands)\nAvailable-for-Sale Securities\nForeign Currency Translation\nAccumulated Other Comprehensive Loss\nBalances at September 30, 2021\n$ -\n$ -\n$ -\nOther comprehensive loss for the twelve months ended September 30, 2022\n(1,224 )\n(674 )\n(1,898 )\nBalances at September 30, 2022\n$ (1,224 )\n$ (674 )\n$ (1,898 )\nOther comprehensive income for the twelve months ended September 30, 2023\n1,354\nBalances at September 30, 2023\n$ (682 )\n$\n$ (544 )\nThe Company did not have any other comprehensive income or loss for the year ended September 30, 2021.\nNote 6. Income Taxes\nComponents of income tax expense are as follows for the years ended:\nSeptember 30,\nSeptember 30,\nSeptember 30,\n(In thousands)\nCurrent:\nFederal\n$ 9,449\n$ 13,230\n$ 5,154\nState\n1,435\n1,532\nForeign\n-\nCurrent income tax expense\n11,028\n14,810\n5,594\nDeferred:\nFederal\n(1,751 )\n(509 )\n(234 )\nState\n(251 )\nForeign\n-\nDeferred income tax expense\n(1,949 )\n(334 )\n(187 )\nIncome tax expense\n$ 9,079\n$ 14,472\n$ 5,407\nThe following is a reconciliation of the federal statutory income tax rate to the effective tax rate as a percent of pre-tax income for the following years ended:\nSeptember 30,\nSeptember 30,\nSeptember 30,\nFederal statutory rate\n21.0 %\n21.0 %\n21.0 %\nState income taxes\n2.8 %\n2.1 %\n2.2 %\nForeign income taxes\n(0.1 %)\n0.4 %\n-\nPermanent differences\n0.8 %\n4.6 %\n-\nResearch and development credits\n(1.0 %)\n(0.5 %)\n(0.7 %)\nExcess tax benefits from stock-based compensation\n(1.7 %)\n(4.9 %)\n(1.5 %)\nEffective Tax rate\n21.8 %\n22.7 %\n21.0 %\nAs of September 30, 2023, and 2022, the current income tax payable was approximately $84,000, and $1,791,000 respectively. Current income tax payable amounts are included in accrued expenses in the Companys consolidated balance sheets.\nAs of September 30, 2023, and 2022, the Company had no U.S. federal, state or Estonian net operating loss (NOL) carryforwards. As of September 30, 2023, and September 30, 2022 there is a Finnish NOL of $1,000 and $4,000, respectively. The Company has not recorded a valuation allowance on these deferred tax assets as the Company believes it is more likely than not they will be utilized. In addition, as of September 30, 2023, the Company had Minnesota research and development tax credits of $255,000. As of September 30, 2022, the Company had Minnesota research and development tax credits of $292,000. The Company has not recorded a valuation allowance on these research and development related deferred tax assets as the Company believes it is more likely than not they will be utilized before they begin to expire in fiscal year 2038.\nSignificant components of deferred income tax assets and liabilities are as follows at:\nSeptember 30,\nSeptember 30,\n(In thousands)\nInventories\n$ 2,154\n$\nR&D expenses\n-\nStock-based compensation\nAccrued expenses and reserves\n1,020\nUnrealized loss on investments\nNet operating loss carry forwards and credits\nForeign currency translation loss\n-\nTotal deferred tax asset\n$ 4,506\n$ 3,050\nGoodwill\n(1,123 )\n(1,077 )\nProperty and equipment depreciation\n(683 )\n(1,068 )\nPrepaid expenses\n(193 )\n(163 )\nIntangibles\n(153 )\n(102 )\nForeign currency translation gain\n(36 )\n-\nTotal deferred tax liability\n$ (2,188 )\n$ (2,410 )\nNet deferred tax asset\n$ 2,318\n$\nRealization of NOL carryforwards and other deferred tax temporary differences are contingent upon future taxable earnings. The deferred tax assets and deferred tax liabilities are not netted due to being within different tax jurisdictions. The Companys deferred tax assets were reviewed for expected utilization by assessing the available positive and negative factors surrounding their recoverability. As of September 30, 2023, and 2022, no valuation allowance was deemed necessary as the Company determined it was more likely than not that the Companys deferred tax assets will be realized.\nThe Company is required to recognize the financial statement benefit of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more likely than not threshold, the amount recognized in the financial statements is the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement with the relevant tax authority. The Company applies the interpretation to all tax positions for which the statute of limitations remained open. The Company had no liability for unrecognized tax benefits and did not recognize any interest or penalties during the years ended September 30, 2023, or 2022.\nThe Company is subject to income taxes in the U.S. federal and various state and foreign jurisdictions, including Finland. Tax regulations within each jurisdiction are subject to the interpretation of the related tax laws and regulations and require significant judgment to apply. Clearfield, Inc. is generally subject to U.S. federal examination for all tax years after 2018 and state examinations for all tax years after 2014 due to unexpired research and development credit carryforwards still open under statute. Nestor is generally subject to Finland examination for all tax years after 2019.\nNote 7. Concentrations\nSuppliers: The Company purchases critical components for our products, including injection molded parts and connectors from third parties, some of whom are single- or limited-source suppliers. If any of our suppliers are unable to ship critical components, we may be unable to manufacture and ship products to our distributors or customers. If the price of these components increases for any reason, or if these suppliers are unable or unwilling to deliver, we may have to find another source, which could result in interruptions, increased costs, delays, loss of sales and quality control problems.\nCustomers: For the fiscal year ended September 30, 2023, the Company had one customer that comprised 16% of net sales. This customer is a distributor. For the fiscal year ended September 30, 2022, the Company had one customer that comprised 14% of net sales. This customer is a distributor. For the fiscal year ended September 30, 2021, the Company had two customers that comprised a combined 28% of net sales. Both of these customers were distributors. These major customers, like our other customers, purchase our products from time to time through purchase orders, and we do not have any agreements that obligate these major customers to purchase products in the future from us.\nAs of September 30, 2023, three customers accounted for 16%, 13% and 11% of accounts receivable, respectively. These customers are all distributors. As of September 30, 2022, one customer accounted for 20% of accounts receivable. This customer is a distributor.\nDisaggregation of Revenue: The Company allocates sales from external customers to geographic areas based on the location to which the product is transported. Sales outside the United States are principally to customers in Europe, the Caribbean, Canada, and in Central and South America.\nThe following table presents our domestic and international sales for each of the last three fiscal years:\nYear Ended September 30,\nUnited States\n$ 218,835\n$ 255,607\n$ 131,285\nAll Other Countries\n49,885\n15,276\n9,470\nTotal Net Sales\n$ 268,720\n$ 270,883\n$ 140,755\nThe Company sells its products to the Broadband Service Provider marketplace. In addition, the Company provides Legacy services for original equipment manufacturers requiring copper and fiber cable assemblies built to their specification.\nThe percentages of our sales by these markets were as follows for each of the last three fiscal years:\nYear Ended September 30,\nBroadband service providers\n%\n%\n%\nOther customers\n%\n%\n%\nTotal Net Sales\n%\n%\n%\nBroadband Service Providers are made up of Community Broadband, which includes local and regional telecom companies, utilities, municipalities and alternative carriers, also referred to as Tier 2 and 3 customers, National Carriers, which includes large national and global wireline and wireless providers also referred to as Tier 1s, Large Regional Service providers with a national footprint, MSOs, which include cable television companies, and international customers.\nLong-lived assets: As of September 30, 2023, and 2022, the Company had property, plant, and equipment with a net book value of $7,003,000, and $4,213,000, respectively, located in Mexico. In addition, as of September 30, 2023, and 2022, the Company had property, plant, and equipment with a net book value of $6,703,000, and $6,916,000, respectively, located in Finland and $660,000, and $280,000, respectively, located in Estonia. All other property, plant, and equipment is located within the United States.\nNote 8. Employee Benefit Plan\nClearfield, Inc. maintains a contributory 401(k) profit sharing benefit plan, whereby eligible employees may contribute a portion of their earnings, not to exceed annual amounts allowed under the Internal Revenue Code. The Company matched 100% of the first 3% and 50% of the next 3% of the participants eligible compensation that was contributed by the participant. The Companys contributions under this plan were $1,017,000, $1,129,000, and $915,000 for the years ended September 30, 2023, 2022 and 2021, respectively.\nNestor Cables is mandated by the Finnish government to participate in a pension and social expense plan to which Nestor and its employees make contributions. The plan is accounted for as defined contribution plan and Nestor Cables is responsible for an average of 18.3% and 17.4% of employees wages for plan years ended September 30, 2023, and 2022, respectively. Nestors contributions under this plan were $1,112,000 and $204,000 for the years ended September 30, 2023, and 2022, respectively.\nNote 9. Leases\nClearfield, Inc. leases an 85,000 square foot facility at 7050 Winnetka Avenue North, Brooklyn Park, Minnesota consisting of corporate offices, manufacturing and warehouse space. The lease term is ten years and two months, ending on February 28, 2025, and is renewable. The renewal options have not been included within the lease term because it is not reasonably certain that the Company will exercise either option.\nIn July 2021, Clearfield, Inc. entered into an indirect lease arrangement for an approximately 318,000 square foot manufacturing facility in Tijuana, Mexico. The lease term is for 7 years of which 5 years are mandatory, commencing March 2022. The lease contains written options to renew for two additional consecutive periods of 5 years each. The lease calls for monthly rental payments of $162,000, increasing 2% annually. The renewal options have not been included within the lease term because it is not reasonably certain that the Company will exercise either option.\nOn November 19, 2021, Clearfield, Inc. signed a lease for a 105,000 square foot warehouse in Brooklyn Park, Minnesota. The lease term is five years commencing March 2022 and ending on February 28, 2027, with rent payments increasing annually. The lease includes an option to extend the lease for an additional five years. The renewal option has not been included within the lease term because it is not reasonably certain that the Company will exercise the option. The lease commenced in the second quarter of fiscal 2022.\nNestor Cables leases an approximately 25,000 square foot manufacturing facility in Oulu, Finland, which is utilized for the operations of Nestor Cables. The original lease term ended on October 31, 2022, but auto renews indefinitely until terminated with two years written notice. It is not reasonably certain that the Company will not exercise the termination option. The lease calls for monthly rental payments of approximately $40,000. Rent is increased each year on January 1st based upon the cost-of-living index published by the Finnish government.\nOn May 11, 2023, Nestor Cables signed a lease for an approximately 49,000 square foot manufacturing facility in Tabasalu, Estonia, to be utilized for the operations of Nestor Cables Baltics. The lease is without a fixed term and requires two years written notice to terminate the lease. Additionally, the lease grants to Nestor Cables the option to lease an expansion facility that is to be constructed no later than August 31, 2024. The expansion facility will be constructed on the same premises as the existing facility. Once the expansion option is exercised and the expansion facility is made available for use, the lease term of the existing facility will become a minimum of 60 months.\nThe lease calls for monthly rental payments of approximately €20,400 until April 2024 and €25,000 afterwards. Rent is increased each year on May 1st based upon the cost-of-living index published by the Estonian government and capped at 5%.\nRight-of-use lease assets and lease liabilities are recognized as of the commencement date based on the present value of the remaining lease payments over the lease term which includes renewal periods we are reasonably certain to exercise. Our leases do not contain any material residual value guarantees or material restrictive covenants.\nOperating lease expense included within cost of sales and selling, general and administrative expense was as follows:\n(In thousands)\nOperating lease expense under ASC842, Leases, within:\nYear ended September 30, 2023\nYear ended September 30, 2022\nYear ended September 30, 2021\nCost of sales\n$ 4,067\n$ 2,534\n$\nSelling, general and administrative\nTotal lease expense\n$ 4,311\n$ 2,801\n$ 1,216\nOur future lease obligations for leases that have commenced were as follows as of September 30, 2023:\n(In thousands)\nOperating \t\t\tLeases\nFY 2024\n$ 4,064\nFY 2025\n3,921\nFY 2026\n3,242\nFY 2027\n1,572\nFY 2028\nThereafter\n2,626\nTotal lease payments\n15,809\nLess: Interest\n(1,443 )\nPresent value of lease liabilities\n$ 14,366\nAs of September 30, 2023, the weighted average term and weighted average discount rate for our leases were 5.16 years and 3.59%, respectively. As of September 30, 2022, the weighted average term and weighted average discount rate for our leases were 4.04 years and 3.22%, respectively. As of September 30, 2021, the weighted average term and weighted average discount rate for our leases were 3.09 years and 3.41%, respectively. For the years ended September 30, 2023, 2022, and 2021 the operating cash outflows from our leases were $3,954,000, $2,064,000, and $1,290,000, respectively.\nNote 10. Debt\nOn April 27, 2022, the Company entered into a loan agreement and a security agreement with a bank that provides the Company with a $40,000,000 revolving line of credit that is secured by certain of the Companys U.S. assets. The line of credit matures on April 27, 2025, and borrowed amounts will bear interest at a variable rate of the CME Group one-month term Secured Overnight Financing Rate (SOFR) plus 1.85%, but not less than 1.80% per annum. As of September 30, 2023, the interest rate was 7.18%. The loan agreement and the security agreement contains customary affirmative and negative covenants and requirements relating to the Company and its operations, including a requirement that the Company maintain a debt service coverage ratio of not less than 1.20 to 1 as of the end of each fiscal year for the fiscal year then ended and maintain a debt to cash flow ratio of not greater than 2 to 1 measured as of the end of each of the Companys fiscal quarters for the trailing twelve (12) month period. Debt service coverage ratio is the ratio of Cash Available for Debt Service to Debt Service, each as defined in the loan agreement. Debt and Cash Flow are also as defined in the loan agreement for the purposes of the debt to cash flow ratio covenant. As of September 30, 2023, the Company had no borrowings against this line of credit. As of September 30, 2022, the Company had borrowed $16,700,000 against the line of credit. As of September 30, 2023, and 2022, the Company was in compliance with all covenants. The line of credit is collateralized by Clearfield, Incs assets of $335,412,000 as of September 30, 2023.\nDuring March 2021, Nestor Cables entered into a loan agreement, providing €2 million senior loan with a term of three years. The National Emergency Supply Agency of Finland (NESA) pays the interest, capped at 5% with the interest to be paid by NESA when the loan is used for stockpiling purposes and is repayable with a 2% additional interest penalty if there is a violation of the terms. The loan is due on March 31, 2024. The loan is fully secured by a Finnish Government guarantee. If used for any purposes other than stockpiling, the lender has the right to terminate the agreement and the entire outstanding balance will become due. As of September 30, 2023, and 2022, the Company owed €2,000,000 on this loan, which equates to $2,112,000 and $1,966,000, as of September 30, 2023, and 2022, respectively. As of September 30, 2023, and 2022, Nestor Cables was in compliance with all covenants. The interest expense associated with this loan has been presented net of government payments on the Companys income statement.\nNote 11. Acquisition of Nestor Cables\nOn July 26, 2022, the Company, through its newly formed wholly owned subsidiary, Clearfield Finland Oy, acquired 100% of the share capital of Nestor Cables Oy, a leading developer and manufacturer of fiber optic cable solutions located in Finland, upon the terms and conditions contained in a Share Sale and Purchase Agreement entered into on May 17, 2022. The total purchase price and the acquisition date fair value of the consideration transferred for the shares totaled €7.9 million ($8.0 million) in addition to €7.6 million ($7.8 million) related to the repayment of certain of Nestor Cables' debt. The purchase price was funded from a draw of $16.7 million under the Companys revolving line of credit. The purchase of Nestor Cables is expected to provide the Company with the ability to vertically integrate the supply of fiber optic cables and fulfill customer demand more rapidly. Nestor Cables' technical expertise is expected to extend the supply of the Companys FieldShield product line into the North American market, to reduce cost and complexity of transportation. Finally, Nestor Cables enhances the possibility of introducing Clearfield's cassette-based fiber management solutions into the European market.\nThe following table summarizes the estimated fair value of the assets and liabilities acquired as of July 26, 2022:\n(in thousands)\nCash\n$\nAccounts receivables\n10,562\nInventories\n11,377\nOther current assets\nTotal current assets\n22,184\nProperty and equipment\n7,689\nIntangibles assets\n1,840\nRight of use lease asset\n1,297\nGoodwill\n1,762\nOther\nTotal assets\n$ 34,827\nAccounts payable\n5,839\nAccrued compensation\n1,430\nAccrued expenses\n1,916\nDeferred tax liability\nLease liability\n1,297\nFactoring liability\n5,849\nLong term debt\n2,045\nTotal liabilities\n$ 18,997\nNet assets acquired\n$ 15,830\nThe Nestor Cablesacquisition resulted in approximately $1,700,000 of goodwill due to intangible assets not qualifying for separate recognition as well as expected synergies. The goodwill created from the acquisition of Nestor Cables is expected to be deductible for tax purposes.\nNestor Cables acquired accounts receivable balance is the gross amount which is expected to be collected, which approximates fair value. As of the acquisition date no allowance for uncollectible amounts is deemed necessary.\nThe intangible assets acquired include customer relationships, developed technology and trademarks. The remaining weighted average useful life of intangible assets acquired is 12.82 years as of the acquisition date. Refer to Note 1 for further detail.\nThe Company incurred approximately $1,600,000 in legal, professional, and other costs related to the acquisition which were accounted for as selling, general and administrative expenses when incurred. Refer to Note 12-Segment Reporting for the operating results of Nestor Cables from the date of acquisition through September 30, 2022.\nThe Company has a fiscal year end of September 30 and reports its financial results in accordance with U.S. GAAP. Nestor Cables has historically had a fiscal year end of December 31 and reported its results under Finnish Accounting Standards. Accordingly, it is impracticable to disclose the revenue and earnings of the combined entity as though the business combination occurred as of the beginning of the comparable prior year periods due to the differing basis of accounting and reporting periods of the entities requiring assumptions about managements intent that cannot be independently substantiated. In addition, these disclosures would require significant estimates that are not possible to reliably establish in order to distinguish objective information that provides evidence of circumstances that existed on the dates at which those amounts would have been recognized, measured and disclosed and would have been available when the financial statements for that prior period were issued.\nNote 12. Segment Reporting\nThe Companys reportable segments are based on the Companys method of internal reporting. These results are not necessarily indicative of the results of operations that would have occurred had each segment been an independent, stand-alone entity during the periods presented. The internal reporting of these operating segments is defined based, in part, on the reporting and review process used by the Companys Chief Executive Officer.\nUpon closing of the acquisition of Nestor Cables, the Company reassessed its operating segments as defined under ASC 280, Segment Reporting. Under ASC 280, operating segments are defined as components of an enterprise where discrete financial information is available that is evaluated regularly by the chief operating decision-maker (CODM), in deciding how to allocate resources and in assessing performance. Based upon the Companys assessment, the Company determined that the business of Nestor Cables was considered a second reportable segment as of July 26, 2022.\nFor the year ended September 30, 2023, the Company has two reportable segments: (1) Clearfield and (2) Nestor Cables. Clearfields Finnish holding company Clearfield Finland Oy purchased Nestor Cables Oy, including its Estonia subsidiary Nestor Cables Baltics on July 26, 2022. These entities comprise the Nestor Cables segment. Refer to Note 11 - Acquisition of Nestor Cables for additional information on this transaction.\nFinancial results for the reportable segments are prepared on a basis consistent with the internal disaggregation of financial information to assist the CODM in making internal operating decisions. For consolidated reporting, the Company eliminates transactions between reportable segments.\nThe following table summarizes the amounts between the two reportable segments for the year ended September 30, 2023:\nYear ended September 30, 2023\n(in thousands)\nClearfield\nNestor Cables\nEliminations\nConsolidated\nRevenue from external customers\n$ 225,722\n$ 42,998\n$ -\n$ 268,720\nRevenue from internal customers (Clearfield)\n-\n5,408\n(5,408 )\n-\nNet investment income\n5,315\n(116 )\n5,206\nInterest Expense\n(116 )\nDepreciation and amortization\n4.598\n1,456\n-\n6,054\nStock based compensation\n3,528\n-\n3,578\nIncome taxes\n8,883\n-\n9,079\nNet Income\n32,834\n(1,020 )\n32,533\nCapital Expenditures\n6,759\n-\n7,684\nThe following table summarizes the amounts between the two reportable segments for the year ended September 30, 2022:\nYear ended September 30, 2022\n(in thousands)\nClearfield\nNestor Cables\nEliminations\nConsolidated\nRevenue from external customers\n$ 263,822\n$ 7,061\n$ -\n$ 270,883\nRevenue from internal customers (Clearfield)\n-\n(182 )\n-\nNet investment income\n-\nInterest Expense\n-\nDepreciation and amortization\n3,187\n-\n3,426\nStock based compensation\n2,339\n-\n-\n2,339\nIncome taxes\n14,258\n-\n14,472\nNet Income (loss)\n49,771\n(389 )\n(20 )\n49,362\nCapital Expenditures\n8,487\n-\n8,500\nThe following table summarizes the amounts between the two reportable segments as of September 30, 2023, and September 30, 2022:\nYear ended September 30, 2023\n(in thousands)\nClearfield\nNestor Cables\nEliminations\nConsolidated\nGoodwill\n$ 4,709\n$ 1,819\n$ -\n$ 6,528\nTotal assets\n$ 335,412\n$ 43,550\n$ (23,445 )\n$ 355,517\nYear ended September 30, 2022\n(in thousands)\nClearfield\nNestor Cables\nEliminations\nConsolidated\nGoodwill\n$ 4,709\n$ 1,693\n$ -\n$ 6,402\nTotal assets\n$ 214,785\n$ 31,023\n$ (16,680 )\n$ 229,128\nNote 13. Financing Receivables\nNestor Cables factors certain of its accounts receivable, with recourse provisions that are accounted for as a secured borrowing. Nestor Cables has a total factoring liability of $6,289,000and $4,391,000 as of September 30, 2023, and 2022, respectively. Nestor receives cash for 80% of the receivable balance from the bank initially and the remaining 20% when the invoice is paid up to a limit of €12.5 million ($13.2 million). Due to the conditions mentioned above, these transactions do not qualify as a sale and are thus accounted for as secured borrowing. The contractual interest rate on Nestors factoring arrangements is the 3-month Euribor rate plus a range of .75% to 1.3%. The average interest rate for the year ended September 30, 2023, and 2022, was 3.89% and 2.14%, respectively. These agreements are indefinite with a termination notice period ranging from zero to one month. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nThe Companys management carried out an evaluation, under the supervision and with the participation of the Companys Chief Executive Officer and the Companys Chief Financial Officer of the effectiveness of the design and operation of the Companys disclosure controls and procedures (as such term is defined in Rule 13a-15(e) under the Securities Exchange Act of 1934, as amended) as of September 30, 2023. Based upon that evaluation, the Companys Chief Executive Officer and the Companys Chief Financial Officer concluded that the Companys disclosure controls and procedures were effective.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) and 15d-15(f) of the Exchange Act. Under the supervision and with the participation of our management, including our Chief Executive Officer and our Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 30, 2023 based on the framework in the 2013 Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on that evaluation, management concluded that, as of September 30, 2023, our internal control over financial reporting was effective based on the COSO internal control criteria. The effectiveness of our internal control over financial reporting as of September 30, 2023 has been audited by Baker Tilly US, LLP, an independent registered public accounting firm, as stated in their report included in this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting that occurred during the fourth quarter of fiscal year 2023 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nDuring the quarter ended September 30, 2023, none of our directors or officers informed us of the adoption, modification or termination of a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement, as those terms are defined in Regulation S-K, Item 408(a).\nOn November 10, 2023, the Compensation Committee of the board of directors added performance stock units (PSUs) to the executive compensation program for fiscal 2024 due to the strong alignment between performance-based equity awards and the Compensation Committees philosophy of emphasizing performance-based compensation. The Compensation Committee determined to keep the overall target value of the equity grants to the named executive officers flat year-over-year, but to divide the target value of the equity grants evenly between restricted shares and PSUs. Accordingly, for Ms. Beranek and Mr. Hill, the Compensation Committee targeted $500,000 in restricted stock and $500,000 in PSUs, and for Mr. Herzog, the Compensation Committee targeted $250,000 in restricted stock and $250,000 in PSUs. The PSUs will vest, and the restrictions on the PSUs will lapse, on the first anniversary of the date of grant, subject to continued employment through such date and the Company attaining fiscal 2024 target adjusted EBITDA. The Compensation Committee intends to grant PSUs that vest over a three-year period as part of the fiscal year 2025 executive compensation program.\nAll PSUs awarded to the named executive officers under the 2022 Stock Compensation Plan (the 2022 Plan) will be subject to clawback under the Companys Compensation Recoupment Policy adopted September 23, 2021, as amended through September 28, 2023, and the terms of the 2022 Plan.\nThe form of Performance Stock Unit Award Agreement for awards of PSUs under the 2022 Plan is filed as Exhibit 10.16 hereto and is incorporated by reference in this Annual Report on Form 10-K.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III. ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by Item 10 to be included in our Proxy Statement for our 2024 Annual Meeting of Shareholders (the 2024 Proxy Statement), which will be filed with the Securities and Exchange Commission pursuant to Regulation 14A within 120 days after the end of the fiscal year for which this report is filed, is incorporated herein by reference into this section. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by Item 11 to be included in the 2024 Proxy Statement, is incorporated herein by reference into this section. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 12 to be included in the 2024 Proxy Statement, is incorporated herein by reference into this section. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 13 to be included in the 2024 Proxy Statement, is incorporated herein by reference into this section. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by Item 14 to be included in the 2024 Proxy Statement, is incorporated herein by reference into this section.\nPART IV. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed as part of this report.\n(1) Financial Statements.\nThe financial statements of Clearfield, Inc. are filed herewith under Item 8. Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n(2) Certain financial statement schedules have been omitted because they are not required, not applicable or the required information is provided in other financial statements or the note to the financial statements.\n(3) Exhibits: See Items 15(b) below.\n(b) Exhibits.\nEXHIBIT INDEX\nNumber\nDescription\nIncorporated\nby Reference to\n1.1 Underwriting Agreement dated December 6, 2022 by and among Clearfield, Inc. and Cowen and Company, LLC and Needham & Company, LLC as representatives for the several underwriters named therein. Exhibit 1.1 to Registrants Current Report on Form 8-K dated December 9, 2022\n3.1\nRestated Articles of Incorporation, of APA Optics, Inc. (n/k/a Clearfield, Inc.) dated November 3, 1983 and Articles of Amendment dated December 9, 1983, July 30, 1987, March 22, 1989, September 14, 1994 and August 17, 2000\nExhibit 3.1 to Registrants Quarterly Report on Form 10-Q for the quarter ended September 30, 2000\n3.1 (a)\nArticles of Amendment to Articles of Incorporation dated August 25, 2004\nExhibit 3.1 to Registrants Quarterly Report on Form 10-Q for the quarter ended September 30, 2004\n3.2\nAmended and Restated Bylaws of Clearfield, Inc.\nExhibit 3.1 to Registrants Current Report on Form 8-K dated February 25, 2016\n4.1\nDescription of the Registrants Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934\nExhibit 4.1 to the Registrants Annual Report on Form 10-K for the year ended September 30, 2019\n*10.1\nForm of Agreement regarding Indemnification of Directors and Officers with certain current and former directors\nExhibit 10.1 to Registrants Annual Report on Form 10-K for the year ended September 30, 2017\n*10.2\n2007 Stock Compensation Plan, as amended through December 23, 2016\nAppendix A to the Registrants Proxy Statement filed with the SEC on January 10, 2017 for the 2017 Annual Meeting of Shareholders held on February 23, 2017\n*10.3\nEmployment Agreement dated December 16, 2008 by and between Clearfield, Inc. and Cheryl P. Beranek\nExhibit 10.26 to Registrants Current Report on Form 8-K dated December 16, 2008\n*10.4\nEmployment Agreement dated December 16, 2008 by and between Clearfield, Inc. and John P. Hill\nExhibit 10.27 to Registrants Current Report on Form 8-K dated December 16, 2008\n*10.5\nClearfield, Inc. Code 280G Tax Gross Up Payment Plan Adopted November 18, 2010\nExhibit 10.1 to Registrants Current Report on Form 8-K dated November 18, 2010\n10.6\nClearfield, Inc. 2010 Employee Stock Purchase Plan, as amended\nAppendix A to the Registrants Proxy Statement filed with the SEC on January 14, 2020 for the 2020 Annual Meeting of Shareholders held on February 27, 2020\n10.7\nStandard Form Industrial Building Lease dated September 9, 2014 by and between Clearfield, Inc. and First Industrial, L.P.\nExhibit 10.1 to Registrants Current Report on Form 8-K dated September 10, 2014\n10.8\nFirst Amendment to Lease Agreement dated May 9, 2019 by and between First Industrial, L.P. and Clearfield, Inc.\nExhibit 10.1 to Registrants Current Report on Form 8-K dated May 15, 2019\n*10.9\nEmployment Agreement dated November 16, 2017 by and between Clearfield, Inc. and Daniel Herzog\nExhibit 10.1 to Registrants Current Report on Form 8-K dated November 16, 2017\nNumber\nDescription\nIncorporated\nby Reference to\n*10.10\nAmendment No. 1 to Employment Agreement dated December 3, 2019 by and between Daniel Herzog and Clearfield, Inc.\nExhibit 10.1 to Registrants Current Report on Form 8-K dated December 6, 2019\n10.11\nLoan Agreement dated April 27, 2022 by and between Clearfield, Inc. and Bremer Bank, National Association\nExhibit 10.1 to Registrants Current Report on Form 8-K dated April 27, 2022\n10.12\nSecurity Agreement dated April 27, 2022 by Clearfield, Inc. in favor of Bremer Bank, National Association\nExhibit 10.2 to Registrants Current Report on Form 8-K dated April 27, 2022\n10.13\nClearfield, Inc. 2022 Stock Compensation Plan, as amended through January 23, 2023\nExhibit 10.1 to Registrants Current Report on Form 8-K dated January 25, 2023\n10.14 Form of Stock Option Agreement under the Clearfield, Inc. 2022 Stock Compensation Plan Exhibit 10.2 to Registrants Current Report on Form 8-K filed February 24, 2023\n10.15 Form of Restricted Stock Award Agreement under the Clearfield, Inc. 2022 Stock Compensation Plan. Exhibit 10.3 to Registrants Current Report on Form 8-K filed February 24, 2023\n10.16 Form of Performance Stock Unit Agreement under the Clearfield, Inc. 2022 Stock Compensation Plan. **\n21.1\nSubsidiaries of Clearfield, Inc.\n**\n23.1\nConsent of Baker Tilly US, LLP\n**\n31.1\nCertification of Chief Executive Officer (principal executive officer) Pursuant to Rules 13a-14(a) and 15d-14(a) of the Exchange Act\n**\n31.2\nCertification of Chief Financial Officer (principal financial officer) Pursuant to Rules 13a-14(a) and 15d-14(a) of the Exchange Act\n**\nCertification of Chief Executive Officer and Principal Financial Officer Pursuant to 18 U.S.C. § 1350\n**\n97.1 Compensation Recoupment Policy, as amended September 28, 2023 Exhibit 10.1 to Registrants Current Report on Form 8-K filed October 4, 2023\n101.INS\nInline XBRL Instance Document\n**\n101.SCH\nInline XBRL Taxonomy Extension Schema\n**\n101.CAL\nInline XBRL Taxonomy Calculation Linkbase\n**\n101.LAB\nInline XBRL Taxonomy Labels Linkbase\n**\n101.PRE\nInline XBRL Taxonomy Presentation Linkbase\n**\n101.DEF\nInline XBRL Taxonomy Definition Linkbase\n**\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101). **\nSchedules have been omitted pursuant to Item 601(b)(2) of Regulation S-K.\n* Indicates a management contract or compensatory plan or arrangement.\n** Filed herewith.\n(c) Financial Statement Schedules.\nAll schedules are omitted because they are not applicable or the required information is included in the consolidated financial statements or notes.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nClearfield, Inc.\nDate: November 29, 2023\n/s/ Cheryl Beranek\nCheryl Beranek\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nEach person whose signature appears below hereby constitutes and appoints Cheryl Beranek and Daniel Herzog and each of them, as his true and lawful attorney-in-fact and agent, with full power of substitution, to sign on his behalf, individually and in each capacity stated below, all amendments to this Form 10-K and to file the same, with all exhibits thereto and any other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully and to all intents and purposes as each might or could do in person, hereby ratifying and confirming each act that said attorneys-in-fact and agents may lawfully do or cause to be done by virtue thereof.\nSignatures\nTitle\nDate\n/s/ Cheryl Beranek\n\t\t\tCheryl Beranek\nPresident, Chief Executive Officer (principal executive officer) and Director\nNovember 29, 2023\n/s/ Daniel Herzog\n\t\t\tDaniel Herzog\nChief Financial Officer (principal financial and accounting officer)\nNovember 29, 2023\n/s/ Ronald G. Roth\n\t\t\tRonald G. Roth\nDirector\nNovember 29, 2023\n/s/ Roger G. Harding\n\t\t\tRoger G. Harding\nDirector\nNovember 29, 2023\n/s/ Donald R. Hayward\n\t\t\tDonald R. Hayward\nDirector\nNovember 29, 2023\n/s/ Charles N. Hayssen\n\t\t\tCharles N. Hayssen\nDirector\nNovember 29, 2023\n/s/ Patrick F. Goepel\n\t\t\tPatrick F. Goepel\nDirector\nNovember 29, 2023\n/s/ Walter L. Jones, Jr.\n\t\t\tWalter L. Jones, Jr.\nDirector\nNovember 29, 2023\n/s/ Carol A. Wirsbinski\n\t\t\tCarol Wirsbinski\nDirector\nNovember 29, 2023"
}