{
    "cik": "80420",
    "company": "POWELL INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-06",
    "period_of_report": "2022-09-30",
    "sic": "3613",
    "state_of_inc": "NV",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/80420/0000080420-22-000036-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/80420/000008042022000036/powl-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/80420/0000080420-22-000036.txt",
    "filename": "80420_10K_2022_0000080420-22-000036.htm",
    "content": "Item 1. Business\nOverview\nPowell Industries, Inc. is a Delaware corporation founded by William E. Powell in 1947. We develop, design, manufacture and service custom-engineered equipment and systems which (1) distribute, control and monitor the flow of electrical energy and (2) provide protection to motors, transformers and other electrically powered equipment. We are headquartered in Houston, Texas, and our major subsidiaries, all of which are wholly owned, include: Powell Electrical Systems, Inc.; Powell (UK) Limited; Powell Canada, Inc.; and Powell Industries International, B.V.\nOur website is powellind.com. We make available, free of charge on or through our website, copies of our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports, filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 as soon as is reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (SEC). Additionally, all of our reports filed with the SEC are available via their website at sec.gov.\nReferences to Fiscal 2022, Fiscal 2021 and Fiscal 2020 used throughout this Annual Report relate to our fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nProducts and Services\nOur principal products include integrated power control room substations (PCRs®), custom-engineered modules, electrical houses (E-Houses), traditional and arc-resistant distribution switchgear and control gear, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, switches and bus duct systems. These products are designed for application voltages ranging from 480 volts to 38,000 volts and are used in oil and gas refining, onshore and offshore oil and gas production, petrochemical, liquefied natural gas (LNG) terminals, pipeline, terminal, mining and metals, light rail traction power, electric utility, pulp and paper and other municipal, commercial and other industrial markets. Our product scope includes designs tested to meet both United States (U.S.) and international standards, under both the American National Standards Institute (ANSI) and International Electrotechnical Commission (IEC). We assist customers by providing field service inspection, installation, commissioning, modification, and repair services, as well as spare parts, retrofit and retrofill components for existing systems, and replacement circuit breakers for obsolete switchgear no longer produced by the original manufacturer. We seek to establish long-term relationships with the end users of our systems as well as design and construction engineering firms contracted by those end users. We believe that our exemplary culture of safety and focus on customer satisfaction, along with our financial strength, allow us to continue to capitalize on opportunities in the industries we serve.\nProducts and services are principally sold directly to the end user or to an engineering, procurement and construction (EPC) firm on behalf of the end user. Each project is specifically engineered and manufactured to meet the exact specifications and requirements of the individual customer. Powells expertise is in the design, engineering, manufacturing, project management and integration of assorted systems into a single, custom-engineered deliverable. We market and sell our products and services, which are typically awarded in competitive bid situations, to a wide variety of customers and governmental agencies spanning across diverse markets and geographic regions. Contracts often represent large-scale and complex projects with an individual customer. By their nature, these projects are typically non-recurring. Thus, multiple and/or continuous projects of similar magnitude with the same customer are not predictable. The timing of large project awards may cause material fluctuations in our revenues and gross profits.\nOccasionally our contracts may operate under a consortium or teaming arrangement. Typically, we enter into these arrangements with reputable companies with whom we have previously conducted business. These arrangements are generally made to leverage competitive positioning, or where scale and/or size dictates the use of such arrangement.\nDue to the nature and timing of large projects, a significant percentage of our revenues in a given period may result from one specific contract or customer. The large domestic industrial project that was awarded in Fiscal 2020 accounted for approximately 15% and 20% of our consolidated revenues in Fiscal 2022 and 2021, respectively. We believe the reduction in business volume from a particular industry or the loss of a major customer could have an adverse effect on our business. From time to time, an individual manufacturing facility may have significant volume from one particular customer that would be material to that facility. If during that time the customer were to experience financial distress, a decline in business or circumstances that would otherwise necessitate a cancellation of a project with us, our revenue could be adversely impacted. No customer accounted for more than 10% of our consolidated revenues in Fiscal 2020.\nResearch and development activities are critical to Powells future and are focused on both the development of new products and services as well as enhancing current product offerings. Our expertise in vacuum circuit breaker engineering is internationally recognized, and we commit to incorporating continuous product improvements that will ensure sustained operational safety and reliability across the markets we serve.\nMarkets\nWe strive to be the supplier of choice for custom-engineered system solutions and services to a broad array of customers and markets. Demand for our services and products is driven predominantly by the oil and gas and electric utility industries, but we also serve other markets where customers need to manage, monitor and control large amounts of electrical energy through a complex network of electrical components and systems. The majority of our business is in support of capital investment projects that are highly complex and competitively bid. Our customized systems are designed to meet the specifications of our customers. Each system is designed, engineered and manufactured to the specific requirements of the particular application. We consider our engineering, project management, systems integration and technical support capabilities vital to the success of our business.\nSpecific to the oil and gas sector, we serve the upstream, midstream and downstream end markets. Within the downstream market, our primary customers typically are engaged in refining activities and/or leveraging natural gas feedstocks for the production of petrochemical or LNG products. Strong relationships have developed with our customers over the years and we are recognized as a preferred service provider to solve our customers' complex electrical needs.\nWe believe that our products and services, integration capabilities, technical and project management acumen, application engineering expertise and specialty contracting experience, together with our financial strength and responsiveness to the needs of our customers, give us a sustainable competitive advantage in our markets. We compete with a small number of multinational competitors that sell to a broad industrial and geographic market, as well as smaller, regional competitors that typically have limited capabilities and scope of supply. Some of our competitors are significantly larger and have substantially greater global resources such as engineering, manufacturing and marketing. Our principal competitors include ABB, Eaton, Schneider, and Siemens. The competitive factors used during bid evaluation by our customers vary from project to project and may include technical support and application expertise, engineering and manufacturing capabilities, equipment rating, delivered value, scheduling and price. While projects are typically non-recurring, a significant portion of our business is from repeat customers and many times involves third-party EPC firms hired by the end user and with whom we often have long, established relationships. Ultimately, our competitive position is dependent upon our ability to provide quality custom-engineered products, services and systems on a timely basis at a competitive price.\nBacklog\nBacklog represents management's estimate of the remaining unsatisfied performance obligation from work to be performed on our firm orders under uncompleted contracts and customer purchase orders, including approved change orders as well as new contractual agreements on which work has not begun. Our backlog will be recognized as revenue as we complete the remaining performance obligations. Our backlog does not include service and maintenance type contracts for which we have the rights to invoice as services are performed. Typically, our contracts may have an early termination for convenience clause at the discretion of our customers; however, most of these contracts typically provide for the reimbursement of our costs incurred and a reasonable margin in the event of such early termination. Our methodology for determining backlog may not be comparable to the methodology used by other companies.\nOur backlog at September 30, 2022 totaled $592.2 million compared to $414.9 million at September 30, 2021. We anticipate that approximately $375.0 million of Fiscal 2022 ending backlog will be fulfilled during our fiscal year ending September 30, 2023. Backlog may not be indicative of future operating results as orders in our backlog may be cancelled or modified by our customers and may not be indicative of continuing revenue performance over future fiscal quarters.\nRaw Materials\nThe principal raw materials used in our operations include steel, copper and aluminum and various electrical components. Material costs represented 51% of revenues in Fiscal 2022, 49% of revenues in Fiscal 2021 and 47% of revenues in Fiscal 2020. Unanticipated changes in material requirements, market conditions and disruptions in the supply chain or price increases could impact production costs and affect our consolidated results of operations.\nOver the past two years, as a result of the challenges created by global economic uncertainty, the COVID-19 pandemic and commodity market volatility, we have experienced supply chain disruptions and anticipate that such disruptions, driven predominately by availability and cost volatility across our raw materials, components and labor force, may continue. As we address disruptions, delays and increased costs, we continue to work with our suppliers of key components and commodities to ensure that we are able to meet our customer commitments. While we have experienced some issues related to increased prices as well as increased delivery lead times for the purchase of key raw materials or components, we continue to monitor the availability (including transportation) and price of components and raw materials on a regular basis, as well as any potential impact on our operations.\nOur supply base for certain key components and raw materials is limited. Many of our products require raw materials and components supplied by a limited number of suppliers, and in some instances, a single supplier. Changes in our design to accommodate similar components from other suppliers could be implemented to resolve a supply problem related to a sole-sourced component. Supply problems could result in delays in our ability to meet commitments to our customers and potentially result in delay damages assessed by our customers. We believe that sources of supply for raw materials and components are generally sufficient, and we do not believe a temporary shortage of materials will cause any significant adverse impact in the future.\nOur business is subject to the effects of changing material prices. During Fiscal 2021 and 2022, we began to encounter availability constraints from key suppliers as well as cost increases driven by using alternate suppliers, increased commodity costs as well as higher logistics expense. Supply chain disruptions driven by both availability and cost volatility have created project delivery challenges. We continue to monitor material availability closely but cannot provide assurance that we will mitigate material shortages in the future, in which case our results of operations may be adversely affected. While the cost outlook for commodities used in the production of our products is not certain, we believe we can manage this volatility through contract pricing adjustments, with material-cost predictive estimating, hedging and by actively pursuing internal cost reduction efforts. During Fiscal 2022, we entered into a derivative contract to hedge a portion of our exposure to commodity price risk. We did not enter into any derivative contracts to hedge our exposure to commodity price changes in Fiscal 2021 or 2020.\nHuman Capital\nAt September 30, 2022, we had 1,935 full-time employees and 236 contract employees located primarily in the U.S., Canada and the United Kingdom (U.K.) Our employees are not represented by unions, and we believe that our relationship with our employees is good. Periodically, we find it challenging to source qualified personnel in certain geographic areas due to increased construction or economic activity. We continue to monitor our demand for skilled and unskilled labor and provide training and competitive compensation packages in an effort to attract and retain skilled employees. A decline in our employee relations, labor shortages or increased labor costs could impair our ability to maintain our business, meet customer commitments or grow our revenues, and may adversely impact our business and results of operations.\nOur top human capital priorities include the well-being, health and safety, and retention of our employees, as well as enhanced learning and leadership training opportunities, workplace safety, internal promotion and key employee retention. Powell emphasizes a culture of safety that runs throughout the Company. We establish annual goals and monthly operating metrics, which have resulted in a safety incident rate that is approximately one-half the industry average, according to the U.S. Bureau of Labor Statistics. We believe that the 11-year average tenure of our employees is a reflection of our inclusive and supportive culture, and focused efforts on internal promotion, key employee retention and succession planning. Our annual Organizational Capabilities Review is focused on succession planning within our organization and is reviewed annually by our Board of Directors. We measure our success based on the percentage of internal promotions to key positions and our ability to attract and retain key employees.\nIntellectual Property\nWhile we hold various patents, trademarks, servicemarks, copyrights and licenses, we do not consider any individual intellectual property to be material to our consolidated business operations.\nSeasonality\nOur operations are not generally affected by seasonality. However, weather and natural phenomena can temporarily impact the performance of our operations. Furthermore, quarterly operating results may fluctuate in our first fiscal quarter due to the reduction in the number of workdays related to the number of holidays and paid time off that is taken in that fiscal quarter.\nGovernment Regulations\nWe are subject to various government regulations in the U.S. as well as various international locations where we operate. These regulations cover diverse areas including environmental compliance, import and export controls, economic sanctions, data and privacy protection, transfer pricing rules, anti-bribery, anti-trafficking and anti-trust provisions. Our policies mandate compliance with applicable laws and regulations administered by various state, federal and international agencies. We have established a multi-faceted compliance program that includes educating employees and leadership, performing risk based due diligence and evaluating our supplier base. We require legal and ethical practices in our everyday work. We do not believe that compliance with governmental regulations will have a material impact on our capital expenditures, results of operations or competitive position. Item 1A. Risk Factors\nOur business is subject to a variety of risks and uncertainties, including, but not limited to, the risks and uncertainties described below. If any of the following risks occur, the business's financial condition, cash flows, liquidity and results of operations may be negatively impacted, and we may not be able to achieve our quarterly, annual or long-range plans. Additional risks and uncertainties not known to us or not described below may also negatively impact our business and results of operations. This Annual Report also includes statements reflecting assumptions, expectations, projections, intentions or beliefs about future events that are intended as forward-looking statements under the Private Securities Litigation Reform Act of 1995 and should be read in conjunction with the discussion under Forward-Looking Statements, above.\nRisk Factors Related to our Business and Industry\nOur business is subject to the cyclical nature of the end markets that we serve. This has had, and may continue to have, an adverse effect on our future operating results.\nThe end markets that we serve have historically been cyclical and will continue to be vulnerable to general downturns, which in turn could materially and adversely affect the demand for our products and services. Our customer projects, budgets for capital expenditures and the need for our services have in the past, and may in the future, be adversely affected by among other things, the price of oil and gas, poor economic conditions, commodity prices, political uncertainties, cost of capital, and currency fluctuations. These variables may impact the number and/or the amount of new awards, delays in the timing of awards or potential cancellation of projects. Changes in product mix or services can have a significant impact on our gross margins on a quarterly and annual basis. The uncertainty of our contract award timing is outside of our control and can also present difficulties in matching workforce size with contract requirements. In some cases, we bear and maintain the cost of a ready workforce that may be larger than necessary in anticipation of future workforce needs. If an expected contract is delayed or not received, we may incur additional costs in staff or facility redundancy that could have an adverse impact on our business, financial condition and results of operations.\nOur industry is highly competitive.\nSome of our competitors are significantly larger and have substantially greater global resources such as engineering, manufacturing and marketing resources, and at various times, may be our customer or supplier on any given project. Competition in the industry depends on a number of factors, including the number of projects available, technical ability, production capacity, location and the ability to win projects we bid. Certain of our competitors may have lower cost structures or a more favorable geographic footprint and may, therefore, be able to provide their products or services at lower prices. Similarly, we cannot be certain that we will be able to maintain or enhance our competitive position within our industry, maintain our customer base at current levels, increase our customer base or continue to provide technologically superior products at a competitive price. New companies may enter the markets in which we compete, or industry consolidation may occur, further increasing competition in our markets. Our failure to compete effectively and secure projects could adversely affect future revenues and could have an adverse impact on our business and results of operations.\nTechnological innovations may make existing products and production methods obsolete.\nAll of the products that we manufacture and sell depend upon optimizing available technology for success in the marketplace. The industries in which we operate are characterized by intense competition and are highly sensitive to technological innovation and customer requirements. It is possible for competitors (both domestic and international) to develop products or production methods that will make current products or methods obsolete or at a minimum hasten their obsolescence; therefore, we cannot\nbe certain that our competitors will not develop the expertise, experience and resources to provide products and services that are superior in both price and quality. Our future success will depend, in part, on our ability to anticipate and offer products that meet changing industry and customer specifications as well as fund our research and development costs. Consumer demand for further automation is changing the markets we operate in. Failure to successfully develop new products, or to enhance existing products, could result in the loss of existing customers to competitors, the inability to attract new business or an overall reduction in our competitive position, any of which could adversely affect our business and results of operations.\nUnforeseen difficulties with expansions, relocations, or consolidations of existing facilities could adversely affect our operations.\nFrom time to time we may decide to enter new markets, build or lease additional facilities, expand our existing facilities, relocate or consolidate one or more of our operations or exit a facility we may own or lease. Increased costs and production delays arising from the staffing, relocation, sublease, expansion or consolidation of our facilities could adversely affect our business and results of operations.\nQuality problems with our products could harm our reputation and erode our competitive position.\nThe success of our business depends upon the quality of our products and our relationships with customers. In the event that one of our products fails to meet our customers' standards or safety requirements or fails to operate effectively, our reputation could be harmed, which would adversely affect our marketing and sales efforts. We provide warranties to our customers for our products and services and the cost to satisfy customer warranty claims, which may include, among other things, costs for the repair or replacement of products, could adversely impact our business and results of operations.\nGrowth and product diversification through strategic acquisitions involve a number of risks.\nOur strategy includes the pursuit of growth and product diversification through the acquisition of companies or assets and entering into joint ventures that could enable us to expand our geographic coverage and product and service offerings. We periodically review potential acquisitions; however, we may be unable to successfully implement this strategy. Acquisitions involve certain risks, including difficulties in the integration of operations and systems; failure to realize cost savings; the termination of relationships by key personnel and customers of the acquired company and a failure to retain or add additional employees to handle the increased volume of business. Additionally, financial and accounting challenges and complexities in areas such as valuation, tax planning, treasury management, systems integration and financial reporting from our acquisitions may impact our operating results. Due diligence may not be adequate or reveal all risks and challenges associated with our acquisitions. Companies that we acquire may not achieve revenues, profitability or cash flows that we expected, or that ultimately justify the investment. It is possible that impairment charges resulting from the overpayment for an acquisition may negatively impact our results of operations. Financing for acquisitions may require us to obtain additional equity or debt financing, which may not be available on attractive terms, if at all, or which may be restricted under the terms of our credit facility or other financing arrangements. Any failure to successfully complete or successfully integrate acquisitions could have a material adverse effect on our business and results of operations.\nOur business requires skilled and unskilled labor, and we may be unable to attract and retain qualified employees.\nOur ability to maintain our productivity at competitive levels may be limited by our ability to employ, compensate, train and retain personnel necessary to meet our requirements. We face competition within and outside of our markets for qualified personnel across all of our workforce. We may experience shortages of qualified personnel such as engineers, project managers, supervisors, office personnel and select skilled trades. We cannot be certain that we will be able to maintain an adequate skilled or unskilled labor force or key technical personnel necessary to operate efficiently and to support our growth strategy and operations. We cannot be certain that our labor costs will not increase as a result of a shortage in the supply of skilled, unskilled and technical personnel or any governmental regulations. Labor shortages or increased labor costs could impair our ability to maintain our business, meet customer commitments or grow our revenues, and could adversely impact our business and results of operations.\nWe are exposed to risks relating to the use of subcontractors.\nWe hire subcontractors to perform work on some projects and may depend on third-party labor suppliers to provide the personnel necessary to engineer, manufacture and ship our products. If our subcontractors do not perform as expected for any reason, we may experience delays in completing our projects or incur additional costs. In addition, we may have disputes with these independent subcontractors arising from, among other things, the price, quality or timeliness of the work performed. Some of the third parties we engage in support of our operations operate internationally and thus we may be impacted by the\neconomic, political and labor conditions in those regions as well as uncertainty caused from international relations issues between the United States and those countries. Any of these factors could adversely impact our business and results of operations.\nMisconduct by our employees or subcontractors, or a failure to comply with laws or regulations, could harm our reputation, damage our relationships with customers and subject us to criminal and civil enforcement actions.\nMisconduct, fraud, non-compliance with applicable laws and regulations, or other improper activities by one or more of our employees or subcontractors could have a significant negative impact on our business and reputation. While we take precautions to prevent and detect these activities, such precautions may not be effective and are subject to inherent limitations, including human error and fraud. Acts of misconduct, or our failure to comply with applicable laws or regulations, could subject us to fines and penalties, harm our reputation, damage our relationships with customers and could adversely impact our business and results of operations.\nUnsatisfactory safety performance may subject us to penalties, negatively impact customer relationships, result in higher operating costs, and negatively impact employee morale and turnover.\nWe place great emphasis on workplace safety in our entire organization through various safety initiatives and training. We have both indoor and outdoor manufacturing and fabrication facilities that are susceptible to numerous industrial safety risks that can lead to personal injury, loss of life, damage to property and equipment, as well as potential environmental damage. While we take every precaution to avoid incidents, we have experienced accidents in the past and may again in the future, which can negatively affect our safety record. A poor safety record can harm our reputation with existing and potential customers, jeopardize our relationship with employees, increase our insurance and operating costs and could adversely impact our business and results of operations.\nCatastrophic events, including natural disasters, health epidemics (including the COVID-19 pandemic and any new variants), acts of war and terrorism, among others, could disrupt our business.\nThe occurrence of catastrophic events, ranging from natural disasters and extreme weather conditions to health epidemics (including the COVID-19 pandemic and any new variants), to acts of war and terrorism, among others, could increase operating costs, disrupt or delay our ability to operate our business and complete projects for our customers and could potentially expose us to third-party liability claims or delay damages under our contracts. A significant portion of our operations are located near the Texas Gulf Coast; as a result, our operations have been and are subject to the potential impacts of weather-related events, including but not limited to hurricanes and flooding. Future weather events could cause significant damage to our property and equipment or customer projects and adversely impact our operations. We may declare the existence of a force majeure event under our contracts in certain situations; however, a customer may dispute our force majeure claim, which may result in additional liabilities. Losses or delays arising from such events may or may not be fully covered by our various insurance policies or may be subject to deductibles or exceed coverage limits. In addition, such events could result in temporary or long-term delays of existing projects as well as cancellations of orders for raw materials from our suppliers that could impact our project execution. These situations or other disruptions are outside of our control and may adversely impact our business and results of operations.\nRisk Factors Related to our Financial Condition and Markets\nGlobal economic uncertainty and financial market conditions may impact our customer base, suppliers and backlog.\nVarious factors drive demand for our products and services, including the price and demand for oil and gas, capital expenditures, economic forecasts, global political environments (including war and terrorism) and financial markets. Unanticipated increases in raw material and component requirements or prices, the imposition of tariffs, and changes in supplier availability or supplier consolidation, could increase production costs and adversely affect profitability. Uncertainty regarding these factors could impact our customers and severely impact the demand for projects and orders for our products and services. Additionally, the loss of significant volume from one particular customer at one of our facilities could adversely impact the operating results of that facility. If one or more of our suppliers or subcontractors experiences difficulties that result in a reduction, delay or interruption in supply to us, or they fail to meet our manufacturing requirements, our business could be adversely impacted until we are able to secure alternative sources. Furthermore, our ability to maintain or expand our business would be limited in the future if we are unable to maintain or increase our bonding capacity or our bank credit facility on favorable terms or at all. Similarly, disruptions in the capital markets may also adversely impact our customer's ability to finance projects, which could result in contract cancellations or delays. These disruptions could lead to reduced demand for our products and services and could have an adverse impact on our business, financial condition and results of operations.\nOur backlog is subject to unexpected adjustments, cancellations and scope reductions and, therefore, may not be a reliable indicator of our future earnings.\nWe have a backlog of uncompleted contracts. Backlog represents management's best estimate of the remaining performance obligation from work to be performed on uncompleted contracts, including new contractual agreements on which work has not begun. From time to time, projects are cancelled, delayed or modified due to customer, industry or macroeconomic conditions. While we may be reimbursed for certain costs, we may not have a contractual right to the total revenue reflected in our backlog. The ultimate realization of the future revenue in our backlog is based upon our ability to complete the projects and we cannot control all of the various factors that might impact the timely delivery of our projects to our customers. We may be unable to recover certain costs and cancelled or suspended projects may also result in additional unrecoverable costs due to the underutilization of our assets and personnel. Accordingly, the amounts recorded in backlog may not be a reliable indicator of our future operating results and may not be indicative of continuing revenue performance over future fiscal years or quarters.\nRevenues recognized over time from our fixed-price contracts could result in volatility in our results of operations.\nAs discussed in Managements Discussion and Analysis of Financial Condition and Results of Operations - Critical Accounting Estimates and in the Notes to Consolidated Financial Statements included elsewhere in this Annual Report, the majority of our revenues are recognized over time. Revenues are recognized as work is performed and costs are incurred. The revenue earned to date is calculated by multiplying the total contract price by the percentage of performance to date, which is based on total costs incurred to date compared to the total estimated costs at completion. The determination of the revenue recognized requires the use of estimates of costs to be incurred for the performance of the contract. The timing of the costs incurred may lead to fluctuations in revenue recognized on a quarterly and annual basis. The cost estimation process is based upon the professional knowledge and experience of our management teams, engineers, project managers and financial professionals. We bear the risk of cost overruns and delays in most of our contracts, which may result in reduced profits. Contract losses are recognized in full when determined, and estimates of revenue and cost to complete are adjusted based on ongoing reviews of estimated contract performance. Previously recorded estimates of revenues and costs are adjusted as the project progresses and circumstances change. In certain circumstances, it is possible that such adjustments to estimated costs and revenues could have an adverse impact on our results of operations.\nMany of our contracts contain performance obligations that may subject us to penalties or additional liabilities.\nMany of our customer contracts have schedule and performance obligation clauses that, if we fail to meet, could subject us to penalty provisions, liquidated damages or claims against the company or our outstanding letters of credit or performance bonds. In addition, some customer contracts stipulate protection against our gross negligence or willful misconduct. Each individual contract seeks to define the conditions under which the customer may make a claim against us. It is possible that adjustments arising from such claims, or our failure to manage our contract risk, may not be covered by insurance and could have an adverse impact on our results of operations.\nFluctuations in the price and supply of materials used to manufacture our products may reduce our profits and could adversely impact our ability to meet commitments to our customers.\nOur material costs represented 51% of our consolidated revenues for Fiscal 2022. Unanticipated shortages in raw material and components, rising prices due to overall inflationary pressure, the imposition of tariffs, changes in supplier availability, delays in transportation, or supplier consolidation could increase production costs or lead times and adversely affect profitability as fixed-price contracts may prohibit our ability to charge the customer for the increase in raw material prices. We purchase a wide variety of materials and component parts from various suppliers around the world to manufacture our products, including steel, aluminum, copper and various components. Our supply base for certain key components and raw materials is limited and may come from a single supplier. If we are unable to obtain key components and raw materials from these suppliers, the key components and raw materials may not be readily available from other suppliers or available with acceptable terms and price levels. Our success depends on our ability to meet customer commitments and could be negatively impacted if a supplier experiences a disruption or discontinuance in their operations or we experience a delay in transportation of materials and components from our suppliers. The time and effort associated with the selection and qualification of a new supplier and changes in our design and testing to accommodate similar components from other suppliers could be significant. Additionally, we rely on certain competitors for key materials used in our products. This could negatively impact our ability to manufacture our products if the relationships change or become unfavorable and could have an adverse impact on our results of operations.\nWe have chosen to mitigate our inventory risks by increasing the levels of inventory for certain key components and raw materials and entering into commodity hedges when appropriate. Such increased inventory levels may increase the potential for excess and obsolete inventories.\nObtaining surety bonds, letters of credit, bank guarantees, or other financial assurances, may be necessary for us to successfully bid on and obtain certain contracts.\nWe are often required to provide our customers security for the performance of their projects in the form of surety bonds, letters of credit or other financial assurances. Our continued ability to obtain surety bonds, letters of credit or other financial assurances will depend on our capitalization, working capital and financial performance. Our ability to issue letters of credit is dependent upon the availability of adequate credit issued by our banks and could be negatively impacted by our compliance with our financial covenants. Future compliance with such financial covenants may be affected by factors beyond our control, including general or industry-specific economic downturns. We are also dependent on the overall bonding capacity, pricing and terms available in the surety markets. As such, we cannot guarantee our ability to maintain a sufficient level of bonding capacity in the future. The restriction, reduction or termination of our surety bond agreements could limit our ability to bid on new opportunities and would require us to issue letters of credit under our bank facilities in lieu of surety bonds, thereby reducing availability under our credit facility, which could have an adverse impact on our business and results of operations.\nFailure to remain in compliance with covenants or obtain waivers or amendments under our credit agreement could adversely impact our business.\nOur credit agreement contains various financial covenants and restrictions, which are described in Note G of the Notes to Consolidated Financial Statements. Our ability to remain in compliance with such financial covenants and restrictions may be affected by factors beyond our control, including general or industry-specific economic downturns. If we fail to remain in compliance with such covenants and restrictions, absent an amendment or waiver, this could result in an event of default under the credit agreement. Among other things, the occurrence of an event of default could limit our ability to pay dividends, issue letters of credit, obtain additional financing or result in acceleration of outstanding amounts under the credit agreement or a termination of the agreement, any of which could have an adverse impact on our liquidity, business and results of operations.\nWe extend credit to customers in conjunction with our performance under fixed-price contracts which subjects us to potential credit risks.\nWe typically agree to allow our customers to defer payment on projects until certain performance milestones have been met or until the projects are substantially completed, and customers often withhold some portion of amounts due to us as retainage. Our payment arrangements subject us to potential credit risk related to changes in business and economic factors affecting our customers, including material changes in our customers' revenues or cash flows. If we are unable to collect amounts owed to us, or retain amounts paid to us, our cash flows would be reduced, and we could experience losses if those amounts exceed current allowances. Any of these factors could adversely impact our business and results of operations.\nA significant portion of our revenues may be concentrated among a small number of customers.\nDue to the nature and timing of large projects, a significant percentage of our revenues in a given period may result from one specific contract or customer. During Fiscal 2022, approximately 15% of our consolidated revenues were generated from our large domestic industrial project that was awarded in Fiscal 2020. We believe the reduction in business volume from a particular industry or the loss of a major customer could have an adverse effect on our business. From time to time, an individual manufacturing facility may have significant volume from one particular customer that would be material to that facility. If during that time the customer were to experience financial distress, a decline in business or circumstances that would otherwise necessitate a cancellation of a project with us, our revenue could be adversely impacted.\nWe carry insurance against many potential liabilities, but our management of risk may leave us exposed to unidentified or unanticipated risks.\nAlthough we maintain insurance policies with respect to our related exposures, including certain casualty, property, professional, business interruption, cyber security and self-insured medical and dental programs, these policies contain deductibles, self-insured retentions and limits of coverage. In addition, we may not be able to continue to obtain insurance at commercially reasonable rates, or at the policy limits we may require or may be faced with liabilities not covered by insurance, such as, but not limited to, cyber security, environmental contamination or terrorist attacks. We estimate our liabilities for known claims and unpaid claims and expenses based on information available as well as projections for claims incurred but not reported. However, insurance liabilities, some of which are self-insured, are difficult to estimate due to various factors. If any of our insurance policies, coverage limits or programs are not effective in mitigating our risks, we may incur losses that are not covered by our insurance policies, that are subject to deductibles or that exceed our estimated accruals or our insurance policy limits, which could adversely impact our business and results of operations.\nOur international operations expose us to risks that are different from, or possibly greater than, the risks we are exposed to domestically and may adversely affect our operations.\nRevenues associated with projects located outside of the U.S., including revenues generated from our operations in the U.K. and Canada, accounted for approximately 24% of our consolidated revenues in Fiscal 2022. While our manufacturing facilities are located in developed countries with historically stable operating and fiscal environments, our business and results of operations could be adversely affected by a number of factors, including: political and economic instability; social unrest, acts of terrorism, force majeure, war or other armed conflict; inflation; changes in tax laws; the application of foreign labor regulations; currency fluctuations, devaluations and conversion restrictions and/or governmental activities that limit or disrupt markets, restrict payments or limit the movement of funds and trade restrictions or economic embargoes imposed by the U.S. or other countries. Additionally, compliance with foreign and domestic import and export regulations and anti-corruption laws, such as the U.S. Foreign Corrupt Practices Act, General Data Protection Regulation, or similar laws of other jurisdictions outside the U.S., could adversely impact our ability to compete for contracts in such jurisdictions. Moreover, the violation of such laws or regulations, by us or our representatives, could result in severe penalties including monetary fines, criminal proceedings and suspension of export privileges.\nAdditionally, fluctuating foreign currency exchange rates may impact our financial results. The functional currency of our foreign operations is typically the currency of the country in which the foreign operation is located. Accordingly, our financial performance is subject to fluctuations due to changes in foreign currency exchange rates relative to the U.S. dollar and such fluctuations could adversely impact our financial position and results of operations.\nFailures or weaknesses in our internal controls over financial reporting could adversely affect our ability to report on our financial condition and results of operations accurately and/or on a timely basis.\nWe are required to comply with Section 404 of the Sarbanes-Oxley Act of 2002, which requires, among other things, an assessment by our management of our internal control over financial reporting. Preparing our financial statements involves a number of complex processes, many of which are performed manually and are dependent upon individual data input or review. We are continually working to maintain and strengthen our internal controls over operational and financial reporting, however, any system of controls has limitations, including the possibility of human error, availability of qualified personnel, circumvention or overriding of controls and/or fraud. Our failure to maintain effective internal controls over financial reporting could adversely affect our ability to report our financial results on a timely and accurate basis, which could result in a loss of investor confidence in our financial reports, a decline in our stock price or have an adverse impact on our business and results of operations.\nA failure in our business systems or cyber security attacks on any of our facilities, or those of third parties, could adversely affect our business and our internal controls.\nOur organization is dependent upon the proper functioning of our business systems that support our production, engineering, human resources, estimating, finance, and project management functions. If any of our financial, operational, or other data processing systems fail or have other significant shortcomings due to natural disaster, power loss, telecommunications failures, cyber security attacks or other similar events, our business or results of operations could be adversely affected. In addition, despite implementation of security measures, our business systems may be vulnerable to computer viruses, ransomware attacks, cyber-attacks, social engineering, the accidental release of sensitive information and other unauthorized access. These failures of our business systems or security breaches could impact our customers, employees and reputation and result in a disruption to our operations or in legal claims or proceedings. A material breach of our business systems could involve the theft of intellectual property, financial data, employee or customer data, which may be used by competitors. We rely on third-party systems which could suffer operational system failure, engineered social manipulation or cyber-attacks. Any of these occurrences may not be covered by insurance and could disrupt our business, result in potential liability or reputational damage or otherwise have an adverse effect on our business and results of operations.\nCertain network security and internal control measures have been implemented to address these risks and disruptions to our business. However, our portfolio of hardware and software products, solutions and services and information contained within our enterprise information technology (IT) systems may be vulnerable to damage or disruption caused by circumstances beyond our control such as catastrophic events, cyber-attacks, other malicious activities from unauthorized third parties, power outages, natural disasters, computer system or network failures, insider attacks or computer viruses. Any significant disruption or failure could damage our reputation or have a material adverse effect on our business and our results of operations.\nRisk Factors Related to our Common Stock\nOur stock price could decline or fluctuate significantly due to unforeseen circumstances which may be outside of our control. These fluctuations may cause our stockholders to incur losses.\nOur stock price could fluctuate or decline due to a variety of factors including, but not limited to, the risk factors described herein, declines in the overall financial and economic outlook, timing and cancellation of projects, changes in our estimated costs to complete projects, investors' opinions of the sectors and markets in which we operate or failure of our operating results to meet the expectations of securities analysts or investors, which could reduce investor confidence. These factors could adversely affect our business, and the trading price of our common stock could decline significantly.\nThere can be no assurance that we will declare or pay future dividends on our common stock.\nOur Board of Directors has approved a regular quarterly dividend since our fiscal year ended September 30, 2014. The declaration, amount and timing of future dividends are subject to capital availability and determinations by our Board of Directors that cash dividends are in the best interest of our stockholders and are in compliance with all respective laws and applicable agreements. Our ability to declare and pay dividends will depend upon, among other factors, our financial condition, results of operations, cash flows, current and anticipated expansion plans, requirements under Delaware law and other factors that our Board of Directors may deem relevant. A reduction in or elimination of our dividend payments could have a material negative effect on our stock price.\nRisk Factors Related to Legal and Regulatory Matters\nOur operations could be adversely impacted by the effects of government regulations.\nWe are subject to various government regulations in the United States as well as various international locations where we operate. These regulations cover several areas including environmental compliance, import and export controls, economic sanctions, data and privacy protection, transfer pricing rules, anti-bribery, anti-trafficking and anti-trust provisions. These laws and regulations are administered by various state, federal and international agencies. Changes in policy, laws or regulations, including those affecting oil and gas exploration and development activities or climate change matters and the resulting decisions by customers and other industry participants, could reduce demand for our products and services, which would have a negative impact on our operations. Increased regulations and reporting requirements around the world may adversely affect the operators in the markets we serve. Further, we cannot predict future changes in any country in which we operate or do business and how those changes may affect our ability to perform projects in those regions.\nThe Dodd-Frank Wall Street Reform and Consumer Protection Act requires disclosure of use of \"conflict\" minerals mined from the Democratic Republic of Congo and adjoining countries and our efforts to prevent the use of such minerals. In our industry,\nconflict minerals are most commonly found in metals. As there may be only a limited number of suppliers offering \"conflict-free\" metals, we cannot be sure that we will be able to obtain necessary metals in sufficient quantities or at competitive prices. Also, we may face challenges with our customers and suppliers if we are unable to sufficiently verify that the metals used in our products are \"conflict-free.\"\nChanges in and compliance with environmental laws and regulations, including those regarding climate change, could adversely impact our financial results.\nPrivate lawsuits or enforcement actions by federal, state, provincial or foreign regulatory agencies may materially increase our costs. Certain environmental laws may make us potentially liable for the remediation of contamination at or emanating from our properties or facilities. Although we seek to obtain indemnities against liabilities relating to historical contamination at the facilities we own or operate, we cannot provide any assurance that we will not incur liabilities relating to the remediation of potential contamination, including contamination we did not cause. These potential environmental liabilities may or may not be fully covered by our various insurance policies and may adversely affect our business and results of operations.\nClimate change regulations could require us or our customers to incur additional expenditures to either purchase new, or modify existing, equipment or processes. These laws and regulations may also increase our raw materials cost from our suppliers. The potential for future environmental, social and governance (ESG) and climate risk reporting requirements may result in additional costs to monitor, track and report sustainability measures. Additionally, increased attention to climate change, conservation measures, energy transition and consumer demand for alternatives to hydrocarbons could reduce the demand for oil and gas and have an adverse impact on demand for the products produced by our customers and therefore reduce demand for our products, which could adversely impact our business and results of operations.\nProvisions of our charter documents or Delaware law could delay or prevent an acquisition of our company, even if the acquisition would be beneficial to our stockholders, and could make it more difficult to change management.\nBecause we are governed by Delaware law, we are subject to the provisions of Section 203 of the Delaware General Corporation Law. These provisions prohibit a publicly held Delaware corporation from engaging in a business combination with an interested stockholder, generally, a person who, together with its affiliates, owns, or within the last three years has owned, 15% of our voting stock, for a period of three years after the date of the transaction in which the person became an interested stockholder, unless the business combination is approved in a prescribed manner.\nIn addition, provisions of our Certificate of Incorporation and bylaws may discourage, delay or prevent a merger, acquisition or other change in control that stockholders might otherwise consider favorable, including transactions in which stockholders might otherwise receive a premium for their shares. These provisions may frustrate or prevent any attempt by our stockholders to replace or remove our current management by making it more difficult to replace or remove our Board of Directors.\nSignificant developments arising from tariffs and other economic proposals could adversely impact our business.\nAdditional restrictions or economic disincentives on U.S. or international trade such as significant increases in tariffs on goods could adversely impact our business. Changes in U.S. or international social, political, regulatory and economic conditions or in laws and policies governing foreign trade, manufacturing, development and investment in the territories and countries where we currently develop and sell our products, and any negative sentiment towards the U.S. as a result of such changes, could adversely impact our business and results of operations.\nGeneral Risk Factors\nActual and potential claims, lawsuits and proceedings could ultimately reduce our profitability and liquidity and weaken our financial condition.\nWe could be named as a defendant in legal proceedings that claim damages in connection with the operation of our business. Most of the actions against us arise out of the normal course of our performing services or manufacturing equipment. From time to time, we may be a plaintiff in legal proceedings against customers in which we seek to recover payment of contractual amounts due to us, as well as claims for increased costs incurred by us. When appropriate, we establish estimated provisions against certain legal exposures, and we adjust such provisions from time to time according to ongoing developments related to each exposure, as well as any potential recovery from our insurance, if applicable. If, in the future, our assumptions and estimates related to such exposures prove to be inadequate or wrong, or our insurance coverage is insufficient, our business and results of operations could be adversely affected. In addition, claims, lawsuits and proceedings may harm our reputation or divert management resources away from operating our business. Losses arising from such events may or may not be fully covered by our various insurance policies or may be subject to deductibles or exceed coverage limits.\nChanges in tax laws and regulations may change our effective tax rate and could have a material effect on our financial results.\nWe are subject to income taxes in the U.S. and numerous foreign jurisdictions. A change in tax laws, deductions or credits, treaties or regulations, or their interpretation, in the countries in which we operate could result in a higher tax rate on our pre-tax income, which could have a material impact on our net income. We are regularly under audit by tax authorities, and our tax estimates and tax positions could be materially affected by many factors including the final outcome of tax audits and related litigation, the introduction of new tax accounting standards, legislation, regulations and related interpretations, our global mix of earnings, the extent to which deferred tax assets are realized and changes in uncertain tax positions. A significant increase in our statutory tax rates or loss of our ability to claim Research and Development Tax Credits could have a material impact on our net income or loss and cash flow.\nThe departure of key personnel could disrupt our business.\nWe depend on the continued efforts of our executive officers, senior management and other key personnel. We cannot be certain that any individual will continue in such capacity for any particular period of time. The loss of key personnel, or the inability to hire, train and retain qualified employees, could negatively impact our ability to perform and manage our business. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nWe own our principal manufacturing and fabrication facilities and periodically lease smaller facilities throughout the U.S., Canada and the U.K. Our facilities are generally located in areas that are readily accessible to materials and labor pools and are maintained in good condition. These facilities are expected to meet our needs for the foreseeable future.\nOur principal locations as of September 30, 2022, were as follows:\nLocation Description Acres Approximate\nSquare Footage\nHouston, TX Corporate office and manufacturing facility 21.4 428,515\nHouston, TX Office and manufacturing facility 53.4 290,554\nHouston, TX Office, fabrication facility, bulkhead and yard 62.4 82,320\nNorth Canton, OH Office and manufacturing facility 8.0 115,200\nNorthlake, IL Office and manufacturing facility 10.0 103,500\nBradford, U.K. Office and manufacturing facility 7.9 129,200\nAcheson, Alberta, Canada Office and manufacturing facility 20.1 330,168 Item 3. Legal Proceedings\nWe are involved in various legal proceedings, claims and other disputes arising from our commercial operations, projects, employees and other matters which, in general, are subject to uncertainties and in which the outcomes are not predictable. Although we can give no assurances about the resolution of pending claims, litigation or other disputes and the effect such outcomes may have on us, management believes that any ultimate liability resulting from the outcome of such proceedings, to the extent not otherwise provided or covered by insurance, will not have a material adverse effect on our consolidated financial position or results of operations or liquidity. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock trades on the NASDAQ Global Market (NASDAQ) under the symbol POWL.\nHolders\nAs of December 2, 2022, there were 245 stockholders of record of our common stock. All common stock held in street names is recorded in the Companys stock register as being held by one stockholder.\nSecurities Authorized for Issuance under Equity Compensation Plans\nSee Part III, Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters of this Annual Report for information regarding securities authorized for issuance under our equity compensation plans.\nDividend Policy\nThe Board anticipates declaring cash dividends in future quarters; however, there is no assurance as to future dividends or their amounts because they depend on future earnings, capital requirements, financial condition and debt covenants.\nPerformance Graph\nThe following Performance Graph and related information shall not be deemed soliciting material or to be filed with the SEC, nor shall such information be incorporated by reference into any future filing under the Securities Act of 1933 or Securities Exchange Act of 1934, each as amended, except to the extent that we specifically incorporate it by reference into such filing.\nThe following graph compares, for the period from September 29, 2017 to September 30, 2022, the cumulative stockholder return on our common stock with the cumulative total return on the IShares Russell 2000, the Invesco S&P SmallCap 600 Energy, the new Industrial Electrical Equipment Group (a select group of peer companies - Altra Industrial Motion Corp.; Ameresco, Inc.; AZZ Inc.; Belden Inc.; Daktronics Inc.; EnerSys; Franklin Electric Co, Inc.; Gibraltar International (ROCK); Littelfuse Inc.; LSI Industries Inc.; Matthews International (MATW); Preformed Line Products; A O Smith Corporation; Thermon Group Holdings and Woodward, Inc.) and the old Industrial Electrical Equipment Group (Altra Industrial Motion Corp.; Ameresco, Inc.; AZZ Inc.; Belden Inc.; Daktronics Inc.; EnerSys; Franklin Electric Co, Inc.; Littelfuse Inc.; LSI Industries Inc.; Preformed Line Products; A O Smith Corporation; Thermon Group Holdings and Woodward, Inc.). The comparison assumes that $100 was invested on September 29, 2017, in our common stock, the IShares Russell 2000, the Invesco S&P SmallCap 600 Energy, the new Industrial Electrical Equipment Group and the old Industrial Electrical Equipment Group, and that all dividends were re-invested. The stock price performance reflected on the following graph is not necessarily indicative of future stock price performance. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations for the twelve months ended September 30, 2022 compared to the twelve months ended September 30, 2021 should be read in conjunction with the accompanying consolidated financial statements and related notes. We have elected to omit discussion on the earliest of the three years covered by the consolidated financial statements presented. Refer to Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations located in our Form 10-K for the fiscal year ended September 30, 2021, filed on December 8, 2021, for discussion of the fiscal year ended September 30, 2020, the earliest of the three fiscal years presented. Any forward-looking statements made by or on our behalf are made pursuant to the safe-harbor provisions of the Private Securities Litigation Reform Act of 1995. Readers are cautioned that such forward-looking statements involve risks and uncertainties, and the actual results may differ materially from those projected in the forward-looking statements. For a description of the risks and uncertainties, please see Cautionary Statement Regarding Forward-Looking Statements; Risk Factors and Part I, Item 1A. Risk Factors, included elsewhere in this Annual Report.\nOverview\nWe develop, design, manufacture and service custom-engineered equipment and systems which (1) distribute, control and monitor the flow of electrical energy and (2) provide protection to motors, transformers and other electrically powered equipment. We are headquartered in Houston, Texas, and serve the oil and gas and petrochemical markets, which include onshore and offshore production, LNG facilities and terminals, pipelines, refineries and petrochemical plants. Additional markets include electric utility and light rail traction power as well as mining and metals, pulp and paper and other municipal, commercial and other industrial markets. Revenues and costs are primarily related to custom engineered-to-order equipment and systems and are accounted for under percentage-of-completion accounting, which precludes us from providing detailed price and volume information. Our backlog includes various projects that typically take a number of months to produce.\nThe markets in which we participate are capital-intensive and cyclical in nature. Cyclicality is predominantly driven by customer demand, global economic and geopolitical conditions and anticipated environmental, safety or regulatory changes which affect the manner in which our customers proceed with capital investments. Our customers analyze various factors, including the demand and price for oil, gas and electrical energy, the overall economic and financial environment, governmental budgets, regulatory actions and environmental concerns. These factors influence the release of new capital projects by our customers, which are traditionally awarded in competitive bid situations. Scheduling of projects is matched to customer requirements, and projects typically take a number of months to produce. Schedules may change during the course of any particular project, and our operating results can, therefore, be impacted by factors outside of our control.\nWithin the industrial sector, specifically oil, gas and petrochemical, the demand for our electrical distribution solutions is very cyclical and closely correlated to the level of capital expenditures of our end-user customers as well as prevailing global economic conditions.\nOver the past few years, there has been an increase in capital spending within North America on LNG facilities as the market responds to the increased international demand for LNG. As a result, the business was awarded a substantial contract in the second quarter of Fiscal 2020 that will support the integrated electrical distribution requirements for a large domestic LNG industrial complex that was substantially completed in Fiscal 2022.\nImpact of Global Economic Uncertainty and Commodity Market Volatility on Powell\nVarious factors resulting in global economic uncertainty have negatively impacted our results over the past two years. Uncertainty and demand disruptions have resulted in considerable volatility across commodity markets. Although global oil prices have rebounded, our industrial end markets have responded with modest increases in capital expenditures. Additionally, we continue to experience supply chain disruptions driven predominately by availability and cost volatility across our raw materials, components and labor force. All of these factors have contributed to the lower margins realized in Fiscal 2021 and 2022. As we address disruptions and increased costs, we continue to work with our suppliers of key components and commodities to ensure that we are able to meet our customer commitments. Additionally, we have adjusted our pricing models with our customers in response to the increased cost environment.\nIn response to the lower demand and uncertainty across select end markets, we have taken and will continue to take various actions to maintain or reduce costs. We continue to operate below capacity in some areas and will consistently monitor the macro-economic conditions as we head into our fiscal year ending September 30, 2023.\nAs discussed further under the heading \"Outlook\" below, it is difficult to predict the economic impact that this global economic uncertainty, as well as commodity price volatility, may have on our business, results of operations and cash flows going forward.\nResults of Operations\nTwelve Months Ended September 30, 2022 Compared to Twelve Months Ended September 30, 2021\nRevenue and Gross Profit\nRevenues increased by 13%, or $62.0 million, to $532.6 million in Fiscal 2022. Domestic revenues increased by 15%, or $53.5 million, to $405.0 million in Fiscal 2022. International revenues increased by 7%, or $8.5 million, to $127.6 million. Our international revenues include both revenues generated from our international facilities as well as revenues from export projects generated at our domestic facilities.\nRevenue from our core oil and gas markets (excluding petrochemical) increased by 15%, or $27.5 million, to $215.2 million while petrochemical revenue increased by 13%, or $7.6 million, to $66.5 million in Fiscal 2022, primarily due to increased market activity. Revenue from our utility end markets increased by 10%, or $11.1 million, to $122.4 million and traction market revenue decreased by 24%, or $14.2 million, to $44.9 million in Fiscal 2022. Commercial and other industrial market revenue increased by 109%, or $29.4 million, to $56.5 million driven by an increase in traditionally non-core markets such as data centers, university projects and other miscellaneous applications. Revenue from all other markets combined increased by $0.6 million to $27.1 million in Fiscal 2022.\nGross profit increased by 13%, or $10.0 million, to $85.0 million in Fiscal 2022. Despite the increase in revenues, gross profit as a percentage of revenues remained flat to the prior fiscal year at 16% in Fiscal 2022 due to increased costs impacting older projects in our backlog that were subject to inflationary pressures on raw materials and components, with little or no recourse from the customer to reprice the project. On more recent projects in the backlog, we were able to successfully pass the inflationary impact to the customer in the form of increased pricing. Additionally, favorable project execution, volume leverage and product mix, including fast track service and replacement projects across our service division, all helped to offset the negative inflationary pressure carried by the older projects in the backlog. Additionally, gross profit from our international operations improved over the prior year driven by favorable project execution and increased volume. Throughout the second half of Fiscal 2022, gross margins benefited from favorable close out gains and associated productivity on select projects. Additionally, revenue and gross profit increased by $2.5 million resulting from the settlement of a claim for cost overruns from prior years related to a U.S. based municipal transit project.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses increased by 5%, or $3.6 million, to $70.8 million in Fiscal 2022, primarily due to increased variable performance based compensation. Selling, general and administrative expenses, as a percentage of revenues, decreased to 13% in Fiscal 2022, compared to 14% in Fiscal 2021, primarily due to the ability to leverage our cost structure with the increase in revenues.\nOther Income\nDuring Fiscal 2022 we recorded other income of $2.3 million related to a gain on the sale of a small, non-core, industrial valve repair and servicing business within our Canadian operations as well as the sale of an excess parcel of land in the U.S. We did not record other income in Fiscal 2021.\nIncome Tax Provision (Benefit)\nWe recorded an income tax benefit of $3.9 million in Fiscal 2022, resulting in an effective tax rate of negative 40%, compared to an income tax provision of $0.5 million in Fiscal 2021 at an effective tax rate of 42%. In Fiscal 2022, the tax benefit primarily resulted from the release of the valuation allowance previously recorded against the Canadian net deferred tax assets in the amount of $5.9 million and the estimated Research and Development Tax Credit (R&D Tax Credit). The tax benefit was partially offset by certain non-deductible items, the tax expense related to the gain on the disposition of a small, non-core division of our Canadian operations and the tax impact of U.S. global intangible income.\nIn Fiscal 2021, the effective tax rate was negatively impacted by our inability to recognize a tax benefit related to losses incurred in various jurisdictions outside of the United States as well as the establishment of a valuation allowance against the deferred tax assets in Mexico. The estimated R&D Tax Credit as well as the utilization of net operating loss carryforwards in Canada that were fully reserved with a valuation allowance provided a tax benefit for Fiscal 2021.\nNet Income\nIn Fiscal 2022, we recorded net income of $13.7 million, or $1.15 per diluted share, compared to net income of $0.6 million, or $0.05 per diluted share in Fiscal 2021. This increase in net income is primarily due to the increase in bookings which led to an increase in revenues, the release of a Canadian valuation allowance recorded against net deferred tax assets, the gain on the sale of a non-core business within our Canadian operations and the settlement of a claim from a project completed in prior years.\nBacklog\nThe order backlog at September 30, 2022 was $592.2 million, a 43% increase from $414.9 million at September 30, 2021. Bookings, net of cancellations and scope reductions, increased by 78% in Fiscal 2022 to $718.6 million, compared to $403.9 million in Fiscal 2021. The large year-over-year increase was due to strength across our utility, petrochemical, and commercial and other industrial end markets.\nOutlook\nAs noted in \"Overview\" above, the markets in which we participate are capital-intensive and generally cyclical in nature. A significant portion of our revenues has historically been from the oil, gas and petrochemical markets. Oil and gas commodity price levels have been volatile over the last several years, and our customers have in certain cases, delayed or cancelled some of their major capital investment projects due to price volatility and changes in return expectations. Recently we have seen increased global demand for cleaner-burning fuels; however, the uncertainty in oil prices and the global economic impacts from COVID-19, including supply chain disruptions and associated inflationary pressures, as well as other geopolitical events may have a negative impact on our business going forward, as discussed in more detail below. Specific to the energy industry focus on transitioning to natural gas and cleaner-burning fuels, the business was awarded a substantial contract in Fiscal 2020 that will support the integrated electrical distribution requirements for a large domestic industrial complex and was substantially completed in Fiscal 2022. We continue to experience increased demand from markets outside our core oil, gas and petrochemical end markets, as we increase focus on diversification of our project portfolio.\nOur operating results are impacted by factors such as the timing of new order awards, customer approval of final engineering and design specifications and delays in customer construction schedules, all of which contribute to short-term earnings variability and the timing of project execution. Our operating results also have been, and may continue to be, impacted by the timing and resolution of change orders, project close-out and resolution of potential contract claims and liquidated damages, all of which could improve or deteriorate gross margins during the period in which these items are resolved with our customers. Disruption in the global supply chain has negatively impacted our business and operating results as well due to the reduction in availability and uncertainty in the timing of the receipt of certain key component parts and commodities. These factors may result in periods of underutilization of our resources and facilities, which may negatively impact our ability to cover our fixed costs or inhibit our ability to deliver completed products on time. Additionally, the increases in commodity and component costs from projects awarded in prior years and increased labor costs may have a negative impact on our operating results in the\nevent that we are not able to pass these cost increases to our customers. Prior to Fiscal 2022, we experienced periods of lower commercial activity driven in large part from the uncertainty resulting from the COVID-19 pandemic, as discussed in \"Overview\" above. Considering the long cycle nature of our business, we are exposed to cyclical conditions in our business. We will continue to remain focused on the variables that impact our markets as well as cost management, labor and supply chain challenges. We will also continue to adjust to the global conditions in order to maintain competitive cost and technological advantages in the markets that we serve.\nThe consequences of a prolonged economic decline could include, but are not limited to, a reduction in commercial and industrial activity. The Company cannot reasonably estimate the duration or severity of these global economic challenges, or the extent to which the resulting disruptions may materially impact our business, results of operations or cash flows. We will take prudent measures to maintain our strong liquidity and cash position, which may include reducing our capital expenditures and research and development costs, as well as reducing or eliminating future dividend payments.\nLiquidity and Capital Resources\nAs of September 30, 2022, current assets exceeded current liabilities by 2.0 times.\nCash, cash equivalents and short-term investments decreased to $116.5 million at September 30, 2022, compared to $134.0 million at September 30, 2021. This decrease in cash was primarily driven by the timing of contract billing milestones which increased accounts receivable and the strategic increase in inventory from the advance purchase of certain raw materials and component parts in response to uncertainty from the global supply challenges. We believe that our strong working capital position, available borrowings under our credit facility and available cash should be sufficient to finance future operating activities, capital improvements and research and development initiatives for the foreseeable future.\nWe have a credit agreement with Bank of America, N.A. (the U.S. Revolver) which is a $75.0 million revolving credit facility available for both borrowings and letters of credit and expires September 27, 2024. The U.S. Revolver states that up to $30 million may be deducted from the amount of letters of credit outstanding (not to be less than zero) when calculating the consolidated funded indebtedness which is a component of the consolidated net leverage ratio. Additionally, we have the option to cash collateralize all or a portion of the letters of credit outstanding, which would favorably impact the consolidated funded indebtedness calculation and the consolidated net leverage ratio.\nOn October 1, 2021, our industrial development revenue bonds matured and as a result we had no long-term debt at September 30, 2022. As of September 30, 2022, there were no amounts borrowed under the U.S. Revolver, and letters of credit outstanding were $36.7 million. As of September 30, 2022, $38.3 million was available for the issuance of letters of credit and borrowing under the U.S. Revolver. We are required to maintain certain financial covenants, the most significant of which are a consolidated net leverage ratio of less than 3.0 to 1.0 and a consolidated interest coverage ratio of greater than 3.0 to 1.0. Our most restrictive covenant, the consolidated net leverage ratio, is the ratio of earnings before interest, taxes, depreciation, amortization and stock-based compensation (EBITDAS) to funded indebtedness, which includes letters of credit. An increase in indebtedness or a decrease in EBITDAS could restrict our ability to issue letters of credit or borrow under the U.S. Revolver. For further information regarding our debt, see Notes G and H of Notes to Consolidated Financial Statements.\nApproximately $25.8 million of our cash, cash equivalents and short-term investments at September 30, 2022 was held outside of the U.S. for our international operations. It is our intention to indefinitely reinvest all current and future foreign earnings internationally in order to ensure sufficient working capital to support our international operations. In the event that we elect to repatriate some or all of the foreign earnings that were previously deemed to be indefinitely reinvested outside the U.S., we may incur additional tax expense upon such repatriation under current tax laws.\nOperating Activities\nOperating activities used net cash of $3.6 million in Fiscal 2022 and $30.5 million in Fiscal 2021. Cash flow from operations is primarily influenced by the timing of milestone payments from our customers, project volume and the associated working capital requirements, as well as payment terms with our suppliers. This decrease in cash flows used in operations was primarily due to the timing of contract billing milestones and an increase in accounts payable and accrued liabilities, although offset by the increase in accounts receivable and inventory safety stock levels to mitigate global supply chain risks.\nInvesting Activities\nInvesting activities provided $6.5 million of cash during Fiscal 2022 compared to $2.5 million of cash used in Fiscal 2021. The increase in cash provided by investing activities in Fiscal 2022 was primarily due to proceeds of $4.3 million received from the sale of a small, non-core division of our Canadian operations.\nFinancing Activities\nNet cash used in financing activities was $13.3 million in Fiscal 2022 and $13.2 million during the same period in Fiscal 2021, which primarily consisted of approximately $12.2 million and $12.1 million of dividends paid in the respective years.\nOther Commercial Commitments\nWe are contingently liable for letters of credit and bank guarantees totaling $39.7 million as of September 30, 2022, with the following potential cash outflows in the event that we are unable to perform under our contracts (in thousands):\nPayments Due by Period: Letters of\nCredit/Bank Guarantees\nLess than 1 year $ 8,807\n1 to 3 years 24,294\nMore than 3 years 6,648\nTotal long-term commercial obligations $ 39,749\nWe also had surety bonds totaling $241.0 million that were outstanding at September 30, 2022. Surety bonds are primarily used to guarantee our contract performance to our customers.\nOff-Balance Sheet Arrangements\nWe had no significant off-balance sheet arrangements during the periods presented.\nEffects of Inflation\nWe are subject to inflation, which can cause increases in our costs of labor, indirect expenses and raw materials, primarily copper, aluminum and steel. Fixed-price contracts can limit our ability to pass these increases to our customers, thus negatively impacting our earnings. Inflation in commodity prices and general indirect expenses had a negative impact on our financial results in Fiscal 2022. Additionally, inflation related specifically to commodity and labor prices may potentially impact our operations in future years.\nCritical Accounting Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities known to exist at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. We evaluate our estimates on an ongoing basis, based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. There can be no assurance that actual results will not differ from those estimates.\nWe believe the following accounting estimates to be critical in the preparation and reporting of our consolidated financial statements.\nRevenue Recognition\nOur revenues are primarily generated from the manufacturing of custom-engineered products and systems under long-term fixed-price contracts under which we agree to manufacture various products such as traditional and arc-resistant distribution switchgear and control gear, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, switches and bus duct systems. These products may be sold separately as an engineered solution, but are typically integrated into custom-built enclosures which we also build. These enclosures are referred to as power control room\nsubstations (PCRs®), custom-engineered modules or electrical houses (E-Houses). Some contracts may also include the installation and the commissioning of these enclosures.\nRevenue from these contracts is generally recognized over time utilizing the cost-to-cost method. Under the cost-to-cost method, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the total estimated costs at completion of the performance obligation. We believe that this method is the most accurate representation of our performance, because it directly measures the value of the services transferred to the customer over time as we incur costs on our contracts. Contract costs include all direct materials, labor, and indirect costs related to contract performance, which may include indirect labor, supplies, tools, repairs and depreciation costs.\nContract Estimates\nActual revenues and project costs may vary from previous estimates due to changes in a variety of factors. The cost estimation process is based upon the professional knowledge and experience of our engineers, project managers and financial professionals. Factors that are considered in estimating the work to be completed and ultimate contract recovery include the availability and productivity of labor, the nature and complexity of the work to be performed, the availability of materials, and the effect of any delays on our project performance. We periodically review our job performance, job conditions, estimated profitability and final contract settlements, including our estimate of total costs and make revisions to costs and income in the period in which the revisions are probable and reasonably estimable. We bear the risk of cost overruns in most of our contracts, which may result in reduced profits. Whenever revisions of estimated contract costs and contract values indicate that the contract costs will exceed estimated revenues, thus creating a loss, a provision for the total estimated loss is recorded in that period. See Note E of Notes to Consolidated Financial Statements for disclosures related to changes in contract estimates.\nPerformance Obligations\nA performance obligation is a promise in a contract or with a customer to transfer a distinct good or service. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue as the performance obligations are satisfied. To determine the proper revenue recognition for contracts, we evaluate whether a contract should be accounted for as more than one performance obligation or, less commonly, whether two or more contracts should be combined and accounted for as one performance obligation. This evaluation of performance obligations requires significant judgment. The majority of our contracts have a single performance obligation where multiple engineered products and services are combined into a single, custom-engineered solution. Our contracts include a standard one-year assurance warranty. Occasionally, we provide service-type warranties that will extend the warranty period. These extended warranties qualify as separate performance obligations, and revenue is deferred and recognized over the warranty period. If we determine during the evaluation of the contract that there are multiple performance obligations, we allocate the transaction price to each performance obligation using our best estimate of the standalone selling price of each distinct good or service in the contract.\nVariable Consideration\nIt is common for our long-term contracts to contain variable consideration that can either increase or decrease the transaction price. Due to the nature of our contracts, estimating total cost and revenue can be complex and subject to variability due to change orders, back charges, spare parts, early completion bonuses, customer allowances and liquidated damages. We estimate the amount of variable consideration based on the expected value method, which is the sum of probability-weighted amounts, or the most likely amount method, which uses various factors including experience with similar transactions and assessment of our anticipated performance. Variable consideration is included in the transaction price if legally enforceable and to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur once the uncertainty associated with the variable consideration is resolved.\nContract Modifications\nContracts may be modified for changes in contract specifications and requirements. We consider contract modifications to exist when the modification either creates new or changes the enforceable rights and obligations under the contract. Most of our contract modifications are for goods and services that are not distinct from the existing performance obligation. Contract modifications result in a cumulative catch-up adjustment to revenue based on our measure of progress for the performance obligation.\nImpairment of Long-Lived Assets\nWe review long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying value may not be realizable. If an evaluation is required, the estimated future undiscounted cash flows associated with the asset are compared to the assets carrying amount to determine if recording an impairment of such asset is necessary. This requires us to make long-term forecasts of the future revenues and costs related to the assets subject to review. Forecasts require assumptions about demand for our products and future market conditions. Estimating future cash flows requires significant judgment, and our projections may vary from cash flows eventually realized. Future events and unanticipated changes to assumptions could require a provision for impairment in a future period. The effect of any impairment would be reflected in income (loss) from operations in the Consolidated Statements of Operations. In addition, we estimate the useful lives of our long-lived assets and other intangibles and periodically review these estimates to determine whether these lives are appropriate.\nAccruals for Contingent Liabilities\nFrom time to time, contingencies such as insurance-related claims, liquidated damages and legal claims arise in the normal course of business. Pursuant to applicable accounting standards, we must evaluate such contingencies to subjectively determine the likelihood that an asset has been impaired, or a liability has been incurred at the date of the financial statements, as well as evaluate whether the amount of the loss can be reasonably estimated. If the likelihood is determined to be probable, and it can be reasonably estimated, the estimated loss is recorded. The amounts we record for contingent liabilities require judgments regarding the amount of expenses that will ultimately be incurred. We use past experience and history, as well as the specific circumstances surrounding each contingent liability, including estimated legal costs, in evaluating the amount of liability that should be recorded. Actual results could differ from our estimates.\nWarranty Costs\nEstimated costs of warranties are accrued based on historical warranty claim costs in relation to current revenues. In addition, specific provisions are made when product failures are projected outside historical experience. Our standard terms and conditions of sale include a warranty for parts and service for one year. Occasionally, we provide service-type warranties that will extend the warranty period. Actual results could differ from our estimate.\nProjects may require, on occasion, warranty terms that are longer than our standard terms due to the nature of the project. Extended warranty terms may be negotiated and included in our contracts. The allocated revenue associated with the extended warranty is deferred and recorded as a contract liability and recognized as revenue over the extended warranty period.\nAccounting for Income Taxes\nWe account for income taxes under the asset and liability method, based on the income tax laws and rates in the countries in which operations are conducted, and income is earned. This approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax basis of assets and liabilities. Developing our provision for income taxes requires significant judgment and expertise in federal, international and state income tax laws, regulations and strategies, including the determination of deferred tax assets and liabilities and, if necessary, any valuation allowances that may be required for deferred tax assets. In assessing the extent to which net deferred tax assets may be realized, we consider whether it is more likely than not that some portion or all of the net deferred tax assets may not be realized. The ultimate realization of net deferred tax assets is dependent on the generation of future taxable income during the periods in which those temporary differences become deductible. Estimates may change as new events occur, estimates of future taxable income during the carryforward period are reduced or increased, additional information becomes available, or operating environments change, which may result in a full or partial reversal of the valuation allowance. We will continue to assess the adequacy of the valuation allowance on a quarterly basis. Our judgments and tax strategies are subject to audit by various taxing authorities.\nThe objectives of accounting for income taxes are to recognize the amount of taxes payable or refundable for the current year and deferred tax liabilities and assets for the future tax consequences of events that have been recognized in an entitys financial statements or tax returns. We recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. Accounting literature also provides guidance on derecognition of income tax assets and liabilities, classification of current and deferred income tax assets and liabilities, accounting for interest and penalties associated with tax positions, and income tax disclosures. Judgment is required in assessing the future tax consequences of events that have been recognized in our financial statements or tax returns. Variations in the actual outcome of these future tax consequences could materially impact our financial position and results of operations.\nSee Note I of Notes to Consolidated Financial Statements for disclosures related to the valuation allowance recorded in relation to deferred taxes. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to certain market risks arising from transactions we have entered into in the normal course of business. These risks primarily relate to fluctuations in market conditions, commodity prices, foreign currency transactions and interest rates.\nMarket Risk\nWe are exposed to general market risk and its potential impact on accounts receivable or costs and estimated earnings in excess of billings on uncompleted contracts. The amounts recorded may be at risk if our customers ability to pay these obligations is negatively impacted by economic conditions. Our customers are typically in the oil and gas and petrochemical markets, which include onshore and offshore production, LNG facilities and terminals, pipelines, refineries and petrochemical plants. Additional markets include electric utility and light rail traction power as well as mining and metals, pulp and paper and other municipal, commercial and other industrial markets. Occasionally, our customers may include an engineering, procurement and construction (EPC) firm which may increase our market risk exposure based on the business climate of the EPC firm. We maintain ongoing discussions with customers regarding contract status with respect to payment status, change orders and billing terms in an effort to monitor collections of amounts billed.\nCommodity Price Risk\nWe are subject to market risk from fluctuating market prices of certain raw materials used in our products. While such materials are typically available from numerous suppliers, commodity raw materials are subject to price fluctuations. We attempt to pass along such commodity price increases to our customers on a contract-by-contract basis to avoid a negative effect on our profit margin. We have entered into a derivative contract to hedge a portion of our exposure to commodity price risk. This contract is immaterial for Fiscal 2022. In the future, we may enter into additional derivative contracts to further hedge our exposure to commodity price risk. We continue to experience price volatility with some of our key raw materials and components. Fixed-price contracts may limit our ability to pass cost increases to our customers, thus negatively impacting our earnings. Fluctuations in commodity prices may have a material impact on our future earnings and cash flows.\nForeign Currency Transaction Risk\nWe have foreign operations that expose us to foreign currency exchange rate risk in the British Pound Sterling, the Canadian Dollar and to a lesser extent the Singapore Dollar and the Euro, among others. Amounts invested in our foreign operations are translated into U.S. Dollars at the exchange rates in effect at the balance sheet date. The resulting translation adjustments are recorded as accumulated other comprehensive loss, a component of stockholders equity in our Consolidated Balance Sheets. We believe the exposure to the effects that fluctuating foreign currencies have on our consolidated results of operations is limited because the foreign operations primarily invoice customers and collect payments in their respective local currencies or U.S. Dollars. Additionally, expenses associated with these transactions are generally contracted and paid for in the same local currencies. For Fiscal 2022, our realized foreign exchange gain was $0.3 million and is included in selling, general and administrative expenses in the Consolidated Statements of Operations.\nOur accumulated other comprehensive loss, which is included as a component of stockholders equity, was $29.0 million as of September 30, 2022, an increase of $8.6 million compared to September 30, 2021. This increase in comprehensive loss was primarily a result of fluctuations in the currency exchange rates for the Canadian Dollar and British Pound Sterling as we remeasured the foreign operations of those divisions.\nWe do not typically hedge our exposure to potential foreign currency translation adjustments.\nInterest Rate Risk\nIf we borrow under our U.S. Revolver, we will be subject to market risk resulting from changes in interest rates related to our floating rate bank credit facility. If we were to make such borrowings, a hypothetical 100 basis point increase in variable interest rates may result in a material impact to our financial statements. While we do not currently have any derivative contracts to hedge our exposure to interest rate risk, in the past we have entered and may in the future enter into such contracts. During each of the periods presented, we have not experienced a significant effect on our business due to changes in interest rates. Item 8. Financial Statements and Supplementary Data\nIndex to Consolidated Financial Statements Page\nFinancial Statements:\nReport of Independent Registered Public Accounting Firm (PCAOB ID 238)\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Comprehensive Income for the Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Stockholders Equity for the Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of Powell Industries, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of Powell Industries, Inc. and its subsidiaries (the Company) as of September 30, 2022 and 2021, and the related consolidated statements of operations, of comprehensive income, of stockholders equity and of cash flows for each of the three years in the period ended September 30, 2022, including the related notes (collectively referred to as the consolidated financial statements). We also have audited the Company's internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Report on Internal Control Over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other\nprocedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Long-term fixed priced contracts\nAs described in Notes B and E to the consolidated financial statements, approximately 94% of the Companys total revenue of $532.6 million for the year ended September 30, 2022 was generated from the manufacturing of custom-engineered products and systems under long-term fixed-price contracts. Revenue from these contracts is generally recognized over time utilizing the cost-to-cost method to measure the extent of progress toward the completion of the performance obligation and the recognition of revenue over time. Management believes that this method is the most accurate representation of performance, because it directly measures the value of the services transferred to the customer over time as costs are incurred on the contracts. Contract costs include all direct materials, labor, and indirect costs related to contract performance, which may include indirect labor, supplies, tools, repairs and depreciation costs. Under the cost-to-cost method, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the total estimated costs at completion of the performance obligation. Due to the nature of the contracts, estimating total cost and revenue can be complex and subject to variability due to change orders, back charges, spare parts, early completion bonuses, customer allowances and liquidated damages. Management estimates the amount of variable consideration based on the expected value method, which is the sum of the probability-weighted amount, or the most likely amount method which uses various factors including experience with similar transactions and assessment of anticipated performance.\nThe principal considerations for our determination that performing procedures relating to revenue recognized over time utilizing the cost-to-cost method is a critical audit matter are the significant judgment by management when determining the estimated total cost and revenue, which in turn led to a high degree of auditor judgment, subjectivity and effort in performing procedures and in evaluating managements judgment about assumptions related to the estimates of costs to complete and liquidated damages.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the revenue recognition process, including controls over the determination of total estimated costs at completion of the performance obligation and determination of total contract price. These procedures also included, among others, evaluating and testing managements process for determining the estimated total cost and revenue for a sample of contracts, which included (i) obtaining executed purchase orders and agreements, (ii) evaluating the appropriateness of the method to measure estimated total cost and revenue, (iii) testing the completeness and accuracy of the underlying data used by management, and (iv) evaluating the reasonableness of significant assumptions related to the total estimated costs at completion and liquidated damages used by management and considering the factors that can affect the accuracy of those estimates. Evaluating the reasonableness of significant assumptions related to estimated total cost involved assessing managements ability to reasonably estimate total costs to complete and liquidated damages by testing managements process to evaluate the remaining direct materials, labor, and indirect costs related to the performance obligation and evaluating the timely identification of circumstances which may warrant a modification to the total estimated costs or liquidated damages.\n/s/ PricewaterhouseCoopers LLP\nHouston, Texas\nDecember 6, 2022\nWe have served as the Companys auditor since 2004.\nPOWELL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(In thousands, except share and per share data)\nSeptember 30,\n2022 2021\nASSETS\nCurrent Assets:\nCash and cash equivalents $ 101,954 $ 114,314\nShort-term investments 14,554 19,667\nAccounts receivable, less allowance for doubtful accounts of $344 and $333\n106,111 78,304\nContract assets 88,351 54,199\nInventories 50,415 29,835\nIncome taxes receivable 105 161\nPrepaid expenses 4,679 4,382\nOther current assets 3,814 1,599\nTotal Current Assets 369,983 302,461\nProperty, plant and equipment, net 98,628 109,457\nOperating lease assets, net 2,179 3,453\nGoodwill and intangible assets, net 1,003 1,003\nDeferred income taxes 9,161 4,639\nOther assets 12,426 15,179\nTotal Assets $ 493,380 $ 436,192\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent Liabilities:\nCurrent maturities of long-term debt $ - $ 400\nAccounts payable 63,423 45,247\nContract liabilities 79,857 42,433\nAccrued compensation and benefits 24,785 20,395\nAccrued product warranty 2,345 2,531\nCurrent operating lease liabilities 1,777 1,415\nIncome taxes payable 1,720 1,076\nOther current liabilities 12,466 7,659\nTotal Current Liabilities 186,373 121,156\nLong-term debt, net of current maturities - -\nDeferred compensation (Note J) 7,749 8,613\nLong-term operating lease liabilities 545 2,413\nOther long-term liabilities 1,507 2,787\nTotal Liabilities 196,174 134,969\nCommitments and Contingencies (Note H)\nStockholders' Equity:\nPreferred stock, par value $0.01; 5,000,000 shares authorized; none issued\n- -\nCommon stock, par value $0.01; 30,000,000 shares authorized; 12,588,011 and 12,497,691 shares issued, respectively\n126 125\nAdditional paid-in capital 67,439 63,948\nRetained earnings 283,638 282,505\nTreasury stock, 806,018 shares at cost\n(24,999) (24,999)\nAccumulated other comprehensive loss (28,998) (20,356)\nTotal Stockholders' Equity 297,206 301,223\nTotal Liabilities and Stockholders' Equity $ 493,380 $ 436,192\nThe accompanying notes are an integral part of these consolidated financial statements.\nPOWELL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(In thousands, except per share data)\nYear Ended September 30,\n2022 2021 2020\nRevenues $ 532,582 $ 470,559 $ 518,499\nCost of goods sold 447,564 395,496 423,924\nGross profit 85,018 75,063 94,575\nSelling, general and administrative expenses 70,831 67,217 67,662\nResearch and development expenses 6,963 6,670 6,265\nAmortization of intangible assets - 157 177\nRestructuring and other, net - - 1,400\nOperating income 7,224 1,019 19,071\nOther income (2,285) - (506)\nInterest income, net (334) (73) (753)\nIncome before income taxes 9,843 1,092 20,330\nIncome tax provision (benefit) (3,894) 461 3,670\nNet income $ 13,737 $ 631 $ 16,660\nEarnings per share:\nBasic $ 1.16 $ 0.05 $ 1.43\nDiluted $ 1.15 $ 0.05 $ 1.42\nWeighted average shares:\nBasic 11,797 11,705 11,624\nDiluted 11,943 11,789 11,693\nDividends per share $ 1.04 $ 1.04 $ 1.04\nThe accompanying notes are an integral part of these consolidated financial statements.\nPOWELL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In thousands)\nYear Ended September 30,\n2022 2021 2020\nNet income $ 13,737 $ 631 $ 16,660\nForeign currency translation adjustments (8,689) 4,253 60\nLoss on cash flow commodity hedge (325) - -\nPostretirement benefit adjustment, net of tax 372 (96) (26)\nComprehensive income $ 5,095 $ 4,788 $ 16,694\nThe accompanying notes are an integral part of these consolidated financial statements.\nPOWELL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\n(In thousands)\nCommon Stock Additional\nPaid-in\nCapital Retained\nEarnings Treasury Stock Accumulated\nOther\nComprehensive\nIncome/(Loss)\nShares Amount Shares Amount Total\nBalance, September 30, 2019 12,373 $ 124 $ 59,153 $ 289,422 (806) $ (24,999) $ (24,547) $ 299,153\nNet income - - - 16,660 - - - 16,660\nForeign currency translation adjustments - - - - - - 60 60\nStock-based compensation 49 - 3,474 - - - - 3,474\nShares withheld in lieu of employee tax withholding - - (629) - - - - (629)\nDividends - - - (12,066) - - - (12,066)\nPostretirement benefit adjustment, net of tax of $7\n- - - - - - (26) (26)\nBalance, September 30, 2020 12,422 $ 124 $ 61,998 $ 294,016 (806) $ (24,999) $ (24,513) $ 306,626\nNet income - - - 631 - - - 631\nForeign currency translation adjustments - - - - - - 4,253 4,253\nStock-based compensation 76 1 2,582 - - - - 2,583\nShares withheld in lieu of employee tax withholding - - (632) - - - - (632)\nDividends - - - (12,142) - - - (12,142)\nPostretirement benefit adjustment, net of tax of $26\n- - - - - - (96) (96)\nBalance, September 30, 2021 12,498 $ 125 $ 63,948 $ 282,505 (806) $ (24,999) $ (20,356) $ 301,223\nNet income - - - 13,737 - - - 13,737\nForeign currency translation adjustments - - - - - - (8,689) (8,689)\nStock-based compensation 90 1 4,089 - - - - 4,090\nShares withheld in lieu of employee tax withholding - - (675) - - - - (675)\nDividends - - 77 (12,604) - - - (12,527)\nLoss on cash flow commodity hedge - - - - - - (325) (325)\nPostretirement benefit adjustment, net of tax of $99\n- - - - - - 372 372\nBalance, September 30, 2022 12,588 $ 126 $ 67,439 $ 283,638 (806) $ (24,999) $ (28,998) $ 297,206\nThe accompanying notes are an integral part of these consolidated financial statements.\nPOWELL INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In thousands)\nYear Ended September 30,\n2022 2021 2020\nOperating Activities:\nNet income $ 13,737 $ 631 $ 16,660\nAdjustments to reconcile net income to net cash provided by (used in) operating activities:\nDepreciation and amortization 9,358 10,335 10,538\nGain on sale of division (2,006) - -\nStock-based compensation 4,090 2,583 3,474\nBad debt expense, net 162 48 258\nDeferred income taxes (4,861) (995) 1,473\nGain on cash surrender value of life insurance - - (506)\nChanges in operating assets and liabilities:\nAccounts receivable, net (31,629) (7,509) 41,969\nContract assets and liabilities, net 3,122 (39,951) 12,546\nInventories (21,426) (599) 304\nIncome taxes 688 (473) 720\nPrepaid expenses and other current assets (2,577) 412 662\nAccounts payable 18,594 9,760 (15,309)\nAccrued liabilities 8,908 (3,151) 465\nOther, net 258 (1,552) (860)\nNet cash provided by (used in) operating activities (3,582) (30,461) 72,394\nInvesting Activities:\nPurchases of short-term investments (22,381) (27,735) (18,553)\nMaturities of short-term investments 26,320 27,688 6,146\nProceeds from sale of division 4,348 - -\nPurchases of property, plant and equipment (2,451) (2,931) (5,163)\nProceeds from sale of property, plant and equipment 629 40 33\nProceeds from life insurance policy - 474 -\nNet cash provided by (used in) investing activities 6,465 (2,464) (17,537)\nFinancing Activities:\nPayments on industrial development revenue bonds (400) (400) (400)\nShares withheld in lieu of employee tax withholding (675) (632) (629)\nDividends paid (12,233) (12,142) (12,066)\nNet cash used in financing activities (13,308) (13,174) (13,095)\nNet increase (decrease) in cash, cash equivalents and restricted cash (10,425) (46,099) 41,762\nEffect of exchange rate changes on cash, cash equivalents and restricted cash (1,935) 197 (185)\nCash, cash equivalents and restricted cash at beginning of period 114,314 160,216 118,639\nCash, cash equivalents and restricted cash at end of period $ 101,954 $ 114,314 $ 160,216\nThe accompanying notes are an integral part of these consolidated financial statements.\nPOWELL INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nA. Business and Organization\nPowell Industries, Inc. (we, us, our, Powell or the Company) was incorporated in the state of Delaware in 2004 as a successor to a Nevada company incorporated in 1968. The Nevada company was the successor to a company founded by William E. Powell in 1947, which merged into the Company in 1977. Our major subsidiaries, all of which are wholly owned, include: Powell Electrical Systems, Inc.; Powell (UK) Limited; Powell Canada Inc.; and Powell Industries International, B.V.\nWe develop, design, manufacture and service custom-engineered equipment and systems which (1) distribute, control and monitor the flow of electrical energy and (2) provide protection to motors, transformers and other electrically powered equipment. Our principal products include integrated power control room substations (PCRs®), custom-engineered modules, electrical houses (E-Houses), traditional and arc-resistant distribution switchgear and control gear, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, switches and bus duct systems. These products are designed for application voltages ranging from 480 volts to 38,000 volts. Our products are used in the oil and gas markets, onshore and offshore production, liquefied natural gas (LNG) facilities and terminals, pipeline, refineries and petrochemical plants. Additionally, we manufacture products for the electric utility, light rail traction power as well as mining and metals, pulp and paper and other municipal, commercial and other industrial markets. Our product scope includes designs tested to meet both United States (U.S.) and international standards, under both the American National Standards Institute (ANSI) and International Electrotechnical Commission (IEC). We assist customers by providing field service inspection, installation, commissioning, modification, and repair services, as well as spare parts, retrofit and retrofill components for existing systems and replacement circuit breakers for obsolete switchgear no longer produced by the original manufacturer. We seek to establish long-term relationships with the end users of our systems as well as the design and construction engineering firms contracted by those end users. We believe that our culture of safety and focus on customer satisfaction, along with our financial strength, allow us to continue to capitalize on opportunities in the industries we serve.\nReferences to Fiscal 2022, Fiscal 2021 and Fiscal 2020 used throughout these Notes to Consolidated Financial Statements relate to our fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nImpact of Oil and Gas Commodity Market Volatility on Powell\nThe consequences of a prolonged global macro-economic decline could include, but are not limited to, a continued reduction in commercial and industrial activity. Accordingly, the Company cannot reasonably estimate the duration or severity of a potential decline in demand, or the extent to which the disruption may materially impact our business, results of operations or cash flows. We will take prudent measures to maintain our strong liquidity and cash position, which may include reducing our capital expenditures and research and development costs, as well as reducing or eliminating future dividend payments.\nB. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of Powell and our wholly-owned subsidiaries. All intercompany accounts and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States (U.S. GAAP) requires management to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying footnotes. The most significant estimates used in our consolidated financial statements affect revenue recognition and estimated cost recognition on our customer contracts, the allowance for credit losses, provision for excess and obsolete inventory, warranty accruals and income taxes. The amounts recorded for warranties, legal, income taxes, impairment of long-lived assets (when applicable), liquidated damages and other contingent liabilities require judgments regarding the amount of expenses that will ultimately be incurred. We base our estimates on historical experience, forecasts and various other assumptions, as well as the specific circumstances surrounding these contingent liabilities, in evaluating the amount of liability that should be recorded. Additionally, the recognition of deferred tax assets requires estimates related to future income and other assumptions regarding timing and future profitability because the ultimate realization of net deferred tax assets is dependent on the generation of future taxable income during periods in which temporary differences become\ndeductible. Estimates routinely change as new events occur, additional information becomes available or operating environments change. Actual results may differ from our prior estimates.\nCash and Investments\nCash and cash equivalents - Cash and cash equivalents, primarily funds held in money market savings instruments, are reported at their current carrying value, which approximates fair value due to the short-term nature of these instruments, and are included in cash and cash equivalents in our Consolidated Balance Sheets.\nShort-term Investments - Short-term investments include time deposits with original maturities of three months or more.\nSupplemental Disclosures of Cash Flow Information (in thousands):\nYear Ended September 30,\n2022 2021 2020\nCash paid (received) during the period for:\nInterest received, net of interest expense $ (334) $ (73) $ (753)\nIncome taxes paid, net of refunds 533 1,886 1,770\nNon-cash capital expenditures 1,133 226 264\nFair Value of Financial Instruments\nFinancial instruments include cash, cash equivalents, short-term investments, restricted cash, receivables, deferred compensation, payables and debt obligations. Except as described below, due to the short-term nature of account receivables and account payables, the book value is representative of their fair value. The carrying value of debt approximates fair value as interest rates are indexed to the Federal Funds Rate or the banks prime rate.\nAccounts Receivable\nAccounts receivable are stated net of allowances for credit losses. We maintain and continually assess the adequacy of the allowance for credit losses representing our estimate for losses resulting from the inability of our customers to pay amounts due to us. This estimated allowance is based on historical experience of uncollected accounts, the level of past due accounts, the overall level of outstanding accounts receivable, information about specific customers with respect to their inability to make payments and expectations of future conditions that could impact the collectability of accounts receivable. Future changes in our customers operating performance and cash flows, or in general economic conditions, could have an impact on their ability to fully pay these amounts, which could have a material impact on our operating results. In most cases, receivables are not collateralized. However, we utilize letters of credit to secure payment on projects when possible. As of September 30, 2022 and 2021, accounts receivable included retention amounts of $6.9 million and $9.6 million, respectively. Retention amounts are in accordance with applicable provisions of contracts and become due upon completion of contractual requirements. Of the retained amount at September 30, 2022, $6.0 million is expected to be collected in the next twelve months and is recorded in accounts receivable. The remaining $0.9 million is recorded in other assets and is expected to be collected in the fiscal year ending September 30, 2023.\nContract Balances\nThe timing of revenue recognition, billings and cash collections affects accounts receivable, contract assets and contract liabilities in our Consolidated Balance Sheets.\nContract assets are recorded when revenues are recognized in excess of amounts billed for fixed-price contracts as determined by the billing milestone schedule. Contract assets are transferred to accounts receivable when billing milestones have been met, or we have an unconditional right to payment.\nContract liabilities typically represent advance payments from contractual billing milestones and billings in excess of revenue recognized. It is unusual to have advanced milestone payments with a term greater than one year, which could represent a financing component on the contract.\nOur contract assets and liabilities are reported in a net position on a contract-by-contract basis at the end of each reporting period and are generally classified as current.\nInventories\nInventories are stated at the lower of cost or net realizable value using weighted-average methods and include the cost of materials, labor and manufacturing overhead. We use estimates in determining the level of reserves required to state inventory at the lower of cost or net realizable value. Our estimates are based on market activity levels, production requirements, the physical condition of products and technological innovation. Changes in any of these factors may result in adjustments to the carrying value of inventory.\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost and are depreciated using the straight-line method over the estimated useful lives of the assets. Expenditures for repairs and maintenance are charged to expense when incurred. Expenditures for major renewals and improvements, which extend the useful lives of existing equipment, are capitalized and depreciated. Upon retirement or disposition of property, plant and equipment, the cost and related accumulated depreciation are removed from the accounts, and any resulting gain or loss is recognized in the Consolidated Statements of Operations.\nWe review property, plant and equipment for impairment whenever events or changes in circumstances indicate that the carrying value may not be realizable. If an evaluation is required, the estimated future undiscounted cash flows associated with the asset are compared to the assets carrying amount to determine if recording an impairment of such asset is necessary. If an impairment is indicated, we record an impairment loss equal to the difference between the carrying value and the fair value of the long-lived asset. This requires us to make long-term forecasts of the future revenues and the costs related to the assets subject to review. Forecasts require assumptions about demand for our products and future market conditions. Estimating future cash flows requires significant judgment, and our projections may vary from cash flows eventually realized. Future events and unanticipated changes to assumptions could require a provision for impairment in a future period. The effect of any impairment would be reflected in income (loss) from operations in the Consolidated Statements of Operations. In addition, we estimate the useful lives of our property, plant and equipment and periodically review these estimates to determine whether these lives are appropriate.\nIncome Taxes\nWe account for income taxes under the asset and liability method, based on the income tax laws and rates in the countries in which operations are conducted, and income is earned. This approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax basis of assets and liabilities. Developing our provision for income taxes requires significant judgment and expertise in federal, international and state income tax laws, regulations and strategies, including the determination of deferred tax assets and liabilities and, if necessary, any valuation allowances that may be required for deferred tax assets. In assessing the extent to which net deferred tax assets may be realized, we consider whether it is more likely than not that some portion or all of the net deferred tax assets may not be realized. The ultimate realization of net deferred tax assets is dependent on the generation of future taxable income during the periods in which those temporary differences become deductible. Estimates may change as new events occur, estimates of future taxable income during the carryforward period are reduced or increased, additional information becomes available or operating environments change, which may result in a full or partial reversal of the valuation allowance. We will continue to assess the adequacy of the valuation allowance on a quarterly basis. Our judgments and tax strategies are subject to audit by various taxing authorities.\nThe objectives of accounting for income taxes are to recognize the amount of taxes payable or refundable for the current year and deferred tax liabilities and assets for the future tax consequences of events that have been recognized in an entitys financial statements or tax returns. We recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. Accounting literature also provides guidance on derecognition of income tax assets and liabilities, classification of current and deferred income tax assets and liabilities, accounting for interest and penalties associated with tax positions, and income tax disclosures. Judgment is required in assessing the future tax consequences of events that have been recognized in our financial statements or tax returns. Variations in the actual outcome of these future tax consequences could materially impact our financial statements.\nRevenue Recognition\nOur revenues are primarily generated from the manufacturing of custom-engineered products and systems under long-term fixed-price contracts that may last from one month to several years, depending on the contract. Revenue from these contracts is generally recognized over time utilizing the cost-to-cost method. Under the cost-to-cost method, the extent of progress towards\ncompletion is measured based on the ratio of costs incurred to date to the total estimated costs at completion of the performance obligation. We believe that this method is the most accurate representation of our performance because it directly measures the value of the services transferred to the customer over time as we incur costs on our contracts. Contract costs include all direct materials, labor and indirect costs related to contract performance, which may include indirect labor, supplies, tools, repairs and depreciation costs.\nWe also have contracts to provide field service inspection, installation, commissioning, modification, and repair services, as well as spare parts, retrofill components for existing systems, and replacement circuit breakers for obsolete or out-of-production switchgear no longer produced by the original manufacturer. If the service contract terms give us the right to invoice the customer for an amount that corresponds directly with the value of our performance completed to date (i.e., a service contract in which we bill a fixed amount for each hour of service provided), then we recognize revenue over time in each reporting period corresponding to the amount with which we have the right to invoice. Our performance obligations are satisfied as the work progresses.\nWe also have sales orders for spare parts and replacement circuit breakers for switchgear that are obsolete or that are no longer produced by the original manufacturer. Revenues from these sales orders are recognized at the time we fulfill our performance obligation to the customer, which is typically upon shipment.\nAdditionally, some contracts may contain a cancellation clause that could limit the amount of revenue we are able to recognize over time. In these instances, revenue and costs associated with these contracts are deferred and recognized at a point in time when the performance obligation is fulfilled.\nSelling and administrative costs incurred in relation to obtaining a contract are typically expensed as incurred. We periodically utilize a third-party sales agent to obtain a contract and will pay a commission to that agent. We record the full commission liability to the third-party sales agents at the order date, with a corresponding deferred asset. As the project progresses, we record commission expense based on percentage of completion rates that correlate to the project and reduce the deferred asset. Once we have been paid by the customer, we pay the commission and the liability is reduced.\nWarranty Costs\nEstimated costs of warranties are accrued based on historical warranty claim costs in relation to current revenues. In addition, specific provisions are made when product failures are projected outside historical experience. Our standard terms and conditions of sale include a warranty for parts and service for one year. Occasionally, we provide service-type warranties that will extend the warranty period. Actual results could differ from our estimate.\nProjects may require, on occasion, warranty terms that are longer than our standard terms due to the nature of the project. Extended warranty terms may be negotiated and included in our contracts. The allocated revenue associated with the extended warranty is deferred and recorded as a contract liability and recognized as revenue over the extended warranty period.\nResearch and Development Expense\nResearch and development activities are directed toward the development of new products and processes as well as improvements in existing products and processes. These costs, which primarily include salaries, contract services and supplies, are expensed as incurred. Such amounts were $7.0 million, $6.7 million and $6.3 million in Fiscal 2022, 2021 and 2020, respectively.\nForeign Currency Translation\nThe functional currency for our foreign subsidiaries is the local currency in which the entity is located. The financial statements of all subsidiaries with a functional currency other than the U.S. Dollar have been translated into U.S. Dollars. All assets and liabilities of foreign operations are translated into U.S. Dollars using year-end exchange rates, and all revenues and expenses are translated at average rates during the respective period. The U.S. Dollar results that arise from such translation, as well as exchange gains and losses on intercompany balances of a long-term investment nature, are included in the cumulative currency translation adjustments in accumulated other comprehensive loss in stockholders equity.\nStock-Based Compensation\nWe measure stock-based compensation cost at the grant date based on the fair value of the award. Compensation expense is recognized over the period during which the recipient is required to provide service in exchange for the awards, typically the vesting period. Excess income tax benefits related to share-based compensation expense are recognized as income tax expense or benefit in the Consolidated Statement of Operations. Cash paid when directly withholding shares on an employee's behalf for tax withholding purposes is classified as a financing activity. We account for forfeitures as they occur, rather than estimate expected forfeitures.\nC. Earnings Per Share\nWe compute basic earnings per share by dividing net income by the weighted average number of common shares outstanding during the period. Diluted earnings per common and potential common share includes the weighted average of additional shares associated with the incremental effect of dilutive restricted stock and restricted stock units, as prescribed by the Financial Accounting Standards Board (FASB) guidance on earnings per share.\nThe following table reconciles basic and diluted weighted average shares used in the computation of earnings per share (in thousands, except per share data):\nYear Ended September 30,\n2022 2021 2020\nNumerator:\nNet income $ 13,737 $ 631 $ 16,660\nDenominator:\nWeighted average basic shares 11,797 11,705 11,624\nDilutive effect of restricted stock units 146 84 69\nWeighted average diluted shares 11,943 11,789 11,693\nEarnings per share:\nBasic $ 1.16 $ 0.05 $ 1.43\nDiluted $ 1.15 $ 0.05 $ 1.42\nD. Detail of Selected Balance Sheet Accounts\nAllowance for Credit Losses\nActivity in our allowance for credit losses consisted of the following (in thousands):\nSeptember 30,\n2022 2021\nBalance at beginning of period $ 333 $ 510\nBad debt expense, net 162 48\nUncollectible accounts written off, net of recoveries (117) (242)\nChange due to foreign currency translation (34) 17\nBalance at end of period $ 344 $ 333\nInventories\nThe components of inventories are summarized below (in thousands):\nSeptember 30,\n2022 2021\nRaw materials, parts and subassemblies $ 54,220 $ 33,149\nWork-in-progress 1,202 1,147\nProvision for excess and obsolete inventory (5,007) (4,461)\nTotal inventories $ 50,415 $ 29,835\nProperty, Plant and Equipment\nProperty, plant and equipment are summarized below (in thousands):\nSeptember 30, Range of\n2022 2021 Asset Lives\nLand $ 21,299 $ 22,355 -\nBuildings and improvements 120,506 124,798 3 - 39 Years\nMachinery and equipment 88,213 96,017 3 - 15 Years\nFurniture and fixtures 3,581 3,683 3 - 10 Years\nConstruction in process 1,728 752 -\n$ 235,327 $ 247,605\nLess: Accumulated depreciation (136,699) (138,148)\nTotal property, plant and equipment, net $ 98,628 $ 109,457\nThere were no assets under finance lease as of September 30, 2022 or September 30, 2021. Depreciation expense was $9.4 million, $10.2 million and $10.4 million for fiscal years 2022, 2021, and 2020, respectively.\nAccrued Product Warranty\nActivity in our product warranty accrual consisted of the following (in thousands):\nSeptember 30,\n2022 2021\nBalance at beginning of period $ 2,531 $ 2,771\nIncrease to warranty expense 1,425 2,140\nDeduction for warranty charges (1,564) (2,406)\nChange due to foreign currency translation (47) 26\nBalance at end of period $ 2,345 $ 2,531\nE. Revenue\nRevenue Recognition\nOur revenues are primarily generated from the manufacturing of custom-engineered products and systems under long-term fixed-price contracts under which we agree to manufacture various products such as traditional and arc-resistant distribution switchgear and control gear, medium-voltage circuit breakers, monitoring and control communications systems, motor control centers, switches and bus duct systems. These products may be sold separately as an engineered solution, but are typically integrated into custom-built enclosures which we also build. These enclosures are referred to as power control room substations (PCRs®), custom-engineered modules or electrical houses (E-Houses). Some contracts may also include the installation and the commissioning of these enclosures.\nRevenue from these contracts is generally recognized over time utilizing the cost-to-cost method. Under the cost-to-cost method, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the total estimated costs at completion of the performance obligation. We believe that this method is the most accurate representation of our\nperformance, because it directly measures the value of the services transferred to the customer over time as we incur costs on our contracts. Contract costs include all direct materials, labor and indirect costs related to contract performance, which may include indirect labor, supplies, tools, repairs and depreciation costs.\nWe also have contracts to provide field service inspection, installation, commissioning, modification, and repair services, as well as retrofit and retrofill components for existing systems. If the service contract terms give us the right to invoice the customer for an amount that corresponds directly with the value of our performance completed to date (i.e., a service contract in which we bill a fixed amount for each hour of service provided), then we recognize revenue over time in each reporting period corresponding to the amount that we have the right to invoice. Our performance obligations are satisfied as the work progresses. Revenues from our custom-engineered products and value-added services transferred to customers over time accounted for approximately 94% and 93% of revenues for the years ended September 30, 2022 and September 30, 2021, respectively.\nWe also have sales orders for spare parts and replacement circuit breakers for switchgear that are obsolete or that are no longer produced by the original manufacturer. Revenues from these sales orders are recognized at the time we fulfill our performance obligation to the customer, which is typically upon shipment and represented approximately 6% and 7% of revenues for the years ended September 30, 2022 and September 30, 2021, respectively.\nAdditionally, some contracts may contain a cancellation clause that could limit the amount of revenue we are able to recognize over time. In these instances, revenue and costs associated with these contracts are deferred and recognized at a point in time when the performance obligation is fulfilled.\nSelling and administrative costs incurred in relation to obtaining a contract are typically expensed as incurred. We periodically utilize a third-party sales agent to obtain a contract and will pay a commission to that agent. We record the full commission liability to the third-party sales agents at the order date, with a corresponding deferred asset. As the project progresses, we record commission expense based on percentage of completion rates that correlate to the project and reduce the deferred asset. Once we have been paid by the customer, we pay the commission, and the deferred liability is reduced.\nPerformance Obligations\nA performance obligation is a promise in a contract or with a customer to transfer a distinct good or service. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue as the performance obligations are satisfied. To determine the proper revenue recognition for contracts, we evaluate whether a contract should be accounted for as more than one performance obligation or, less commonly, whether two or more contracts should be combined and accounted for as one performance obligation. This evaluation of performance obligations requires significant judgment. The majority of our contracts have a single performance obligation where multiple engineered products and services are combined into a single custom-engineered solution. Our contracts include a standard one-year assurance warranty. Occasionally, we provide service-type warranties that will extend the warranty period. These extended warranties qualify as a separate performance obligation, and revenue is deferred and recognized over the warranty period. If we determine during the evaluation of the contract that there are multiple performance obligations, we allocate the transaction price to each performance obligation using our best estimate of the standalone selling price of each distinct good or service in the contract.\nRemaining unsatisfied performance obligations, which we refer to as backlog, represent the estimated transaction price for goods and services for which we have a material right, but work has not been performed. As of September 30, 2022, we had backlog of $592.2 million, of which approximately $375.0 million is expected to be recognized as revenue within the next twelve months. Backlog may not be indicative of future operating results as orders may be cancelled or modified by our customers. Our backlog does not include service and maintenance-type contracts for which we have the right to invoice as services are performed.\nContract Estimates\nActual revenues and project costs may vary from previous estimates due to changes in a variety of factors. The cost estimation process is based upon the professional knowledge and experience of our engineers, project managers and financial professionals. Factors that are considered in estimating the work to be completed and ultimate contract recovery include the availability and productivity of labor, the nature and complexity of the work to be performed, the availability of materials, and the effect of any delays on our project performance. We periodically review our job performance, job conditions, estimated profitability and final contract settlements, including our estimate of total costs and make revisions to costs and income in the period in which the revisions are probable and reasonably estimable. We bear the risk of cost overruns in most of our contracts, which may result in reduced profits. Whenever revisions of estimated contract costs and contract values indicate that the contract costs will exceed estimated revenues, thus creating a loss, a provision for the total estimated loss is recorded in that period.\nFor the years ended September 30, 2022 and 2021, our operating results were positively impacted by $11.3 million and $12.5 million, respectively, as a result of changes in contract estimates related to projects in progress at the beginning of the respective period. These changes in estimates resulted primarily from favorable project execution and negotiations of variable consideration, discussed below, as well as revenue and reduced costs recognized from project cancellations and other changes in facts and circumstances during these periods.\nVariable Consideration\nIt is common for our long-term contracts to contain variable consideration that can either increase or decrease the transaction price. Due to the nature of our contracts, estimating total cost and revenue can be complex and subject to variability due to change orders, back charges, spare parts, early completion bonuses, customer allowances and liquidated damages. We estimate the amount of variable consideration based on the expected value method, which is the sum of the probability-weighted amounts, or the most likely amount method which uses various factors including experience with similar transactions and assessment of our anticipated performance. Variable consideration is included in the transaction price if legally enforceable and to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur once the uncertainty associated with the variable consideration is resolved.\nContract Modifications\nContracts may be modified for changes in contract specifications and requirements. We consider contract modifications to exist when the modification either creates new or changes the enforceable rights and obligations under the contract. Most of our contract modifications are for goods and services that are not distinct from the existing performance obligation. Contract modifications result in a cumulative catch-up adjustment to revenue based on our measure of progress for the performance obligation.\nContract Balances\nThe timing of revenue recognition, billings and cash collections affects accounts receivable, contract assets and contract liabilities in our Consolidated Balance Sheets.\nContract assets are recorded when revenues are recognized in excess of amounts billed for fixed-price contracts as determined by the billing milestone schedule. Contract assets are transferred to accounts receivable when billing milestones have been met, or we have an unconditional right to payment.\nContract liabilities typically represent advance payments from contractual billing milestones and billings in excess of revenue recognized. It is unusual to have advanced milestone payments with a term greater than one year, which could represent a financing component on the contract.\nOur contract assets and liabilities are reported in a net position on a contract-by-contract basis at the end of each reporting period and are generally classified as current. The timing of contract billing milestones related to our Fiscal 2020 contract award for a large industrial project contributed significantly to our net contract liability at September 31, 2020.\nContract assets and liabilities as of September 30, 2022 and September 30, 2021 are summarized below (in thousands):\nSeptember 30,\n2022 2021\nContract assets $ 88,351 $ 54,199\nContract liabilities (79,857) (42,433)\nNet contract asset $ 8,494 $ 11,766\nThe decrease in net contract asset at September 30, 2022 from September 30, 2021 was primarily due to the timing of contract billing milestones and new orders as well as cash used on our large industrial project awarded in Fiscal 2020. To determine the amount of revenue recognized during the period from contract liabilities, we first allocate revenue to the individual contract liability balance outstanding at the beginning of the period until the revenue exceeds that balance. During the year ended September 30, 2022, we recognized revenue of approximately $39.1 million related to contract liabilities outstanding at September 30, 2021.\nThe timing of our invoice process is typically dependent on the completion of certain milestones and contract terms and subject to agreement by our customer. Payment is typically expected within 30 days of invoice. Any uncollected invoiced amounts for our performance obligations recognized over time, including contract retentions, are recorded as accounts receivable in the Consolidated Balance Sheets. Certain contracts allow customers to withhold a small percentage of billings pursuant to retainage provisions, and such amounts are generally due upon completion of the contract and acceptance of the project by the customer.\nBased on our experience in recent years, the majority of these retainage balances are expected to be collected within approximately twelve months. As of September 30, 2022 and September 30, 2021, accounts receivable included retention amounts of $6.9 million and $9.6 million, respectively. Of the retained amount at September 30, 2022, $6.0 million is expected to be collected in the next twelve months and is recorded in accounts receivable. The remaining $0.9 million is recorded in other assets.\nDisaggregation of Revenue\nThe following tables present our disaggregated revenue by geographic destination and market sector for the years ended September 30, 2022 and September 30, 2021 (in thousands):\n2022 2021\nUnited States $ 404,973 $ 351,422\nCanada 81,218 68,655\nEurope, Middle East and Africa 38,411 39,642\nAsia/Pacific 4,885 8,889\nMexico, Central and South America 3,095 1,951\nTotal revenues by geographic destination $ 532,582 $ 470,559\n2022 2021\nOil and gas (excludes petrochemical) $ 215,235 $ 187,660\nPetrochemical 66,538 58,986\nElectric utility 122,361 111,244\nTraction power 44,930 59,106\nCommercial and other industrial 56,448 27,065\nAll others 27,070 26,498\nTotal revenues by market sector $ 532,582 $ 470,559\nF. Goodwill and Intangible Assets\nOur intangible assets consist of goodwill of $1.0 million, which is not being amortized. In Fiscal 2021, our purchased technology was fully amortized and we no longer have any intangible assets subject to amortization. No impairment expense has been recorded for the last three fiscal years. Amortization of intangible assets recorded for each of the years ended September 30, 2021 and 2020 was $0.2 million.\nG. Long-Term Debt\nLong-term debt consisted of the following (in thousands):\nSeptember 30,\n2022 2021\nIndustrial development revenue bonds $ - $ 400\nLess: current portion - (400)\nTotal long-term debt $ - $ -\nU.S. Revolver\nWe have a credit agreement with Bank of America, N.A. (the U.S. Revolver), which is a $75.0 million revolving credit facility that is available for both borrowings and letters of credit and expires September 27, 2024. The U.S. Revolver states that up to $30 million may be deducted from the amount of letters of credit outstanding (not to be less than zero) when calculating the consolidated funded indebtedness which is a component of the consolidated net leverage ratio. Additionally, we have the option to cash collateralize all or a portion of the letters of credit outstanding, which would favorably impact the consolidated funded indebtedness calculation and the consolidated net leverage ratio. As of September 30, 2022, there were no amounts borrowed under the U.S. Revolver, and letters of credit outstanding were $36.7 million. There was $38.3 million available for the issuance of letters of credit and borrowings under the U.S. Revolver as of September 30, 2022.\nWe are required to maintain certain financial covenants, the most significant of which are a consolidated net leverage ratio less than 3.0 to 1.0 and a consolidated interest coverage ratio of greater than 3.0 to 1.0. Our most restrictive covenant, the consolidated net leverage ratio, is the ratio of earnings before interest, taxes, depreciation, amortization and stock-based compensation (EBITDAS) to funded indebtedness. An increase in indebtedness, which includes letters of credit, or a decrease in EBITDAS could restrict our ability to issue letters of credit or borrow under the U.S. Revolver. Additionally, we must maintain a consolidated cash balance of $30 million at all times, which can be deducted from the letters of credit outstanding as noted above. The U.S. Revolver also contains a \"material adverse effect\" clause which is a material change in our operations, business, properties, liabilities or condition (financial or otherwise) or a material impairment of our ability to perform our obligations under our credit agreements. As of September 30, 2022, we were in compliance with all of the financial covenants of the U.S. Revolver.\nThe U.S. Revolver allows the Company to elect that any borrowing under the facility bears an interest rate based on either the base rate or the eurocurrency rate, in each case, plus the applicable rate. The base rate is generally the highest of (a) the federal funds rate plus 0.50%, (b) the Bank of America prime rate or (c) the London Interbank Offered Rate (LIBOR) successor rate plus 1.00%. The applicable rate is generally a range from (0.25)% to 1.75% depending on the type of loan and the Company's consolidated net leverage ratio. On December 31, 2021, the Company entered into a LIBOR Transition Agreement with Bank of America that states that LIBOR will be replaced with a successor rate in accordance with the U.S. Revolver.\nThe U.S. Revolver is collateralized by a pledge of 100% of the voting capital stock of each of our domestic subsidiaries and 65% of the voting capital stock of each non-domestic subsidiary. The U.S. Revolver provides for customary events of default and carries cross-default provisions with other existing debt agreements. If an event of default (as defined in the U.S. Revolver) occurs and is continuing, on the terms and subject to the conditions set forth in the U.S. Revolver, amounts and letters of credit outstanding under the U.S. Revolver may be accelerated and may become immediately due and payable.\nIndustrial Development Revenue Bonds\nWe borrowed $8.0 million in October 2001 through a loan agreement funded with proceeds from tax-exempt industrial development revenue bonds (Bonds) for the completion of our Northlake, Illinois facility. The Bonds matured on October 1, 2021, and our final payment of $0.4 million was made.\nH. Commitments and Contingencies\nLetters of Credit, Bank Guarantees and Bonds\nCertain customers require us to post letters of credit, bank guarantees or surety bonds. These security instruments assure that we will perform under the terms of our contract. In the event of default, the counterparty may demand payment from the bank under a letter of credit or bank guarantee, or performance by the surety under a bond. To date, there have been no significant draws or claims related to security instruments for the periods reported. We were contingently liable for letters of credit of $36.7 million as of September 30, 2022. We also had surety bonds totaling $241.0 million that were outstanding, with additional bonding capacity of $359.0 million available, at September 30, 2022. We have strong surety relationships; however, a change in market conditions or the sureties' assessment of our financial position could cause the sureties to require cash collateralization for undischarged liabilities under the bonds.\nWe have a $5.6 million facility agreement (Facility Agreement) between Powell (UK) Limited and a large international bank that provides Powell (UK) Limited the ability to enter into bank guarantees as well as forward exchange contracts and currency options. At September 30, 2022, we had outstanding guarantees totaling $3.1 million and amounts available under this Facility Agreement were $2.5 million. The Facility Agreement provides for customary events of default, and carries cross-default provisions with our U.S. Revolver. If an event of default (as defined in the Facility Agreement) occurs and is continuing, per\nthe terms and subject to the conditions set forth therein, obligations outstanding under the Facility Agreement may be accelerated and declared immediately due and payable. Additionally, we are required to maintain cash collateral for guarantees greater than two years. As of September 30, 2022, we were in compliance with all of the financial covenants of the Facility Agreement.\nLitigation\nWe are involved in various legal proceedings, claims and other disputes arising from our commercial operations, projects, employees and other matters which, in general, are subject to uncertainties and in which the outcomes are not predictable. Although we can give no assurances about the resolution of pending claims, litigation or other disputes and the effect such outcomes may have on us, management believes that any ultimate liability resulting from the outcome of such proceedings, to the extent not otherwise provided or covered by insurance, will not have a material adverse effect on our consolidated financial position or results of operations or liquidity.\nLiquidated Damages\nCertain of our customer contracts have schedule and performance obligation clauses that, if we fail to meet them, could require us to pay liquidated damages. Each individual contract defines the conditions under which the customer may make a claim against us. As of September 30, 2022, our exposure to possible liquidated damages was $3.5 million, of which approximately $2.2 million was probable. Based on our actual or projected failure to meet these various contractual commitments, $1.4 million has been recorded as a reduction to revenue. We will attempt to obtain change orders, contract extensions or accelerate project completion, which may resolve the potential for any unrecorded liquidated damage. We have claimed force majeure on certain contracts due to delays associated with the COVID-19 pandemic. Should we fail to achieve relief on some or all of these contractual obligations, we could be required to pay additional liquidated damages, which could negatively impact our future operating results.\nI. Income Taxes\nThe components of the income tax provision were as follows (in thousands):\nYear Ended September 30,\n2022 2021 2020\nCurrent:\nFederal $ 557 $ 911 $ 945\nState 403 472 1,186\nForeign 7 73 66\n967 1,456 2,197\nDeferred:\nFederal (154) (1,062) 1,045\nState (41) (30) (91)\nForeign (4,666) 97 519\n(4,861) (995) 1,473\nTotal income tax provision (benefit) $ (3,894) $ 461 $ 3,670\nIncome before income taxes was as follows (in thousands):\nYear Ended September 30,\n2022 2021 2020\nU.S. $ 3,175 $ 3,076 $ 21,243\nForeign 6,668 (1,984) (913)\nIncome before income taxes $ 9,843 $ 1,092 $ 20,330\nA reconciliation of the statutory U.S. income tax rate and the effective income tax rate, as computed on earnings before income tax provision (benefit) in each of the three years presented in the Consolidated Statements of Operations, was as follows:\nYear Ended September 30,\n2022 2021 2020\nStatutory rate 21 % 21 % 21 %\nState income taxes, net of federal benefit 3 25 5\nResearch and development credit (14) (101) (13)\nForeign rate differential 1 10 -\nForeign taxes - 10 -\nValuation allowance (62) 62 4\nDeferred tax rate differential (1) (19) -\nNon-deductible expenses 9 30 1\nImpact of U.S. global intangible taxes and benefits 3 - -\nOther(1)\n- 4 -\nEffective rate (40) % 42 % 18 %\n(1) Certain prior year amounts have not been reclassified for consistency with the current year presentation.\nOur income tax benefit reflects an effective tax rate on pre-tax results of negative 40% in Fiscal 2022 compared to 42% and 18% in Fiscal 2021 and 2020, respectively. The income tax benefit for Fiscal 2022 was largely a result of the reversal of a valuation allowance on the Canadian deferred tax assets that were previously fully reserved, in addition to the current year estimated Research and Development Tax Credit (R&D Tax Credit). These items were partially offset by the tax expense related to certain nondeductible expenses, the gain on the disposition of a small, non-core division of our Canadian operations and an inclusion related to U.S. global intangible income.\nThe tax provision for Fiscal 2021 and 2020 was favorably impacted by the estimated R&D Tax Credit as well as the utilization of net operating loss carryforwards in Canada that were fully reserved with a valuation allowance. In Fiscal 2021, the tax provision was negatively impacted by the losses recognized in other foreign jurisdictions, primarily in the United Kingdom (U.K.), that were reserved with a valuation allowance as well as the establishment of a valuation allowance against the deferred tax assets in Mexico. While in Fiscal 2020, discrete items recorded in the third quarter in the amount of $1.7 million associated with the release of reserves for unrecognized tax benefits as a result of the expiration of statutes of limitations and the IRS audit settlement favorably impacted the effective tax rate. The effective tax rate was negatively impacted by the discrete item recorded in the second quarter of Fiscal 2020 for the valuation allowance against our U.K. deferred tax assets in the amount of $0.5 million as well as by the losses recognized in various foreign jurisdictions that were reserved with a valuation allowance.\nWe record and maintain valuation allowances against the deferred tax assets of various foreign jurisdictions until sufficient evidence is available to demonstrate that it is more likely than not that the net deferred tax assets will be recognized. As of each reporting date, management considers new evidence, both positive and negative, that could affect its view of the future realization of deferred tax assets. During the period ended June 30, 2022, management determined that there was sufficient positive evidence to conclude that Canadian net deferred tax assets of $5.9 million were realizable. This determination was based on current and anticipated market conditions, continued market diversification, operating results over the past three years and anticipated future taxable income from our Canadian operations. The valuation allowance was released accordingly, and a $5.9 million tax benefit and corresponding increase in the deferred tax assets were recorded. During our assessment of deferred income taxes in Fiscal 2020 and 2021, we recorded a valuation allowance of $0.5 million against our U.K. net deferred tax assets in the second quarter of Fiscal 2020 and a valuation allowance of $0.1 million against our Mexican net deferred tax assets in the fourth quarter of Fiscal 2021. In assessing the realizability of net deferred tax assets, we determined it was more likely than not that the net deferred tax assets may not be realized based upon recent U.K. and Mexican tax losses and anticipated results in the near term. Estimates may change as new events occur, estimates of future taxable income are reduced or increased, additional information becomes available, or operating environments change, which may result in a full or partial reversal of the valuation allowance.\nWe have not recorded deferred income taxes on $13.5 million of undistributed earnings of our foreign subsidiaries because of managements intent to indefinitely reinvest such earnings. Upon distribution of these earnings in the form of dividends or otherwise, we may be subject to U.S. income taxes and foreign withholding taxes. It is not practical, however, to estimate the amount of taxes that may be payable on the eventual remittance of these earnings.\nWe are subject to income tax in the U.S., multiple state jurisdictions and certain international jurisdictions, primarily the U.K. and Canada. We do not consider any state in which we do business to be a major tax jurisdiction. We remain open to examination in the other jurisdictions as follows: Canada 2015 - 2021, United Kingdom 2021 and the United States 2019 - 2021. As of September 30, 2022, we did not have any state audits underway that would have a material impact on our financial position or results of operations.\nThe net deferred income tax asset was comprised of the following (in thousands):\nSeptember 30,\n2022 2021\nGross assets $ 17,941 $ 20,427\nGross liabilities and valuation allowance (8,780) (15,788)\nNet deferred income tax asset $ 9,161 $ 4,639\nThe tax effect of temporary differences between U.S. GAAP accounting and federal income tax accounting creating deferred income tax assets and liabilities was as follows (in thousands):\nSeptember 30,\n2022 2021\nDeferred Tax Assets:\nNet operating loss $ 10,186 $ 12,682\nCredit carryforwards 1,332 1,598\nDeferred compensation 1,897 2,095\nUniform capitalization and inventory 1,506 1,222\nStock-based compensation 1,083 921\nReserve for accrued employee benefits 872 718\nWarranty accrual 559 579\nAccrued legal 161 130\nPostretirement benefits liability - 156\nOther 345 326\nDeferred tax assets $ 17,941 $ 20,427\nDeferred Tax Liabilities:\nDepreciation and amortization $ (3,764) $ (4,404)\nRetention and other (1,229) (886)\nDeferred tax liabilities $ (4,993) $ (5,290)\nLess: valuation allowance (3,787) (10,498)\nNet deferred tax asset $ 9,161 $ 4,639\nAs of September 30, 2022, our tax credit carryforwards are fully reserved with a valuation allowance. We had deferred tax assets related to international net operating loss carryforwards of $7.7 million that were not reserved with a valuation allowance available to offset future tax liabilities in the respective jurisdictions. The majority of these net operating loss carryforwards are related to our Canadian operations and expire beginning in 2033. The remaining unreserved carryforwards related to other jurisdictions have an indefinite carryforward period.\nWe have established a valuation allowance in the amount of $3.8 million primarily related to the U.K. net deferred tax assets. The net decrease in the total valuation allowance during the year was $6.7 million which was largely a result of the reversal of the Canadian valuation allowance. In assessing the realizability of net deferred tax assets, we consider whether it is more likely than not that some portion or all of the net deferred tax assets may not be realized. The ultimate realization of net deferred tax assets is dependent on the generation of future taxable income during the periods in which those temporary differences become deductible.\nA reconciliation of the beginning and ending amount of the unrecognized tax benefits follows (in thousands):\nYear Ended September 30,\n2022 2021 2020\nBalance at beginning of period $ 1,409 $ 1,252 $ 2,703\nIncreases related to tax positions taken during the current period 240 251 220\nIncreases related to tax positions taken during a prior period 92 75 97\nDecreases related to expiration of statute of limitations (327) - (545)\nDecreases related to settlement with taxing authorities (37) (169) (1,223)\nBalance at end of period $ 1,377 $ 1,409 $ 1,252\nIncluded in the balance of unrecognized tax benefits at the end of Fiscal 2022, 2021, and 2020 are $1.1 million, $1.1 million, and $0.8 million, respectively, of tax benefits that, if recognized, would affect the effective tax rate. Our policy is to recognize interest and penalties related to income tax matters as tax expense. The amount of interest and penalty expense recorded for the year ended September 30, 2022 was not material.\nManagement believes that, within the next twelve months, it is reasonably possible that the unrecognized tax benefits will decrease by approximately $0.3 million due to the expiration of certain federal statutes of limitations. We are unable to make reasonably reliable estimates regarding the timing of future cash outflows, if any, associated with the remaining unrecognized tax benefits for the open periods of fiscal years ended September 30, 2019 - 2022.\nManagement believes that an adequate provision has been made for any adjustments that may result from tax examinations. However, the outcome of tax audits cannot be predicted with certainty. If any issues addressed in our tax audits are resolved in a manner not consistent with managements expectations, we could be required to adjust our provision for income tax in the period such resolution occurs.\nJ. Employee Benefit Plans\nRetirement Plans\nWe have defined employee contribution plans for substantially all of our U.S. employees (401k plan) and our Canadian employees (Registered Retirement Savings Plan). We recognized expenses under these plans primarily related to matching contributions of $3.0 million, $2.9 million and $3.1 million in Fiscal 2022, 2021 and 2020, respectively.\nDeferred Compensation\nWe offer a non-qualified deferred compensation plan to a select group of management and highly compensated individuals. The plan permits the deferral of up to 50% of a participants base salary and/or 100% of a participants annual incentive bonus. The deferrals are held in a separate irrevocable rabbi trust (the Rabbi Trust), which has been established to administer the plan. The Rabbi Trust is intended to be used as a source of funds to match respective funding obligations to participants. The assets of the trust are subject to the claims of our creditors in the event that we become insolvent. Consequently, the Rabbi Trust qualifies as a grantor trust for income tax purposes. We make periodic payments into company-owned life insurance policies held in this Rabbi Trust to fund the expected obligations arising under this plan. Changes in the deferred compensation balance are recorded to compensation expense and reflected within the selling, general and administrative line in the Consolidated Statements of Operations. The plan is not qualified under Section 401 of the Internal Revenue code. We recorded net compensation expense adjustments of $0.3 million related to this plan in Fiscal 2022. At September 30, 2022, total assets held by the trustee were $7.7 million and recorded in other assets and the liability was $7.7 million and recorded in deferred compensation in our Consolidated Balance Sheets. The $7.7 million of assets held by the trustee is invested in company-owned life insurance policies.\nCertain former executives were provided an executive benefit plan that provides for fixed payments upon normal retirement on or after age 65 and the completion of at least 10 years of continuous employment. The estimated present value of these payments was accrued over the service life of these individuals, and less than $0.1 million is recorded in deferred compensation related to this executive benefit plan. To assist in funding the deferred compensation liability, we invested in company-owned life insurance policies. The cash surrender value of these policies is presented in other assets and was $3.4 million at September 30, 2022.\nRetiree Medical Plan\nWe have an unfunded plan that extends health benefits to retirees that are also available to active employees under our existing health plans. The current plan provides coverage for employees with at least 10 years of service who are age 55 or older but less than 65. Effective January 1, 2023, eligibility requirements to participate in the plan are changing. At that time, current employees between the ages of 50 to 64 will be eligible to participate in the retiree medical plan once they have completed at least 10 years of service and retire between the ages of 60 and 64. The retiree is required to pay the COBRA rate less a subsidy provided by us based on years of service at the time of retirement. The unfunded liability is recorded in other long-term liabilities and was $0.4 million as of September 30, 2022 and $0.9 million as of September 30, 2021. Our net periodic postretirement benefit expenses were $0.1 million in Fiscal 2022 and less than $0.1 million for both Fiscal 2021 and 2020. Due to the immateriality of the costs and liabilities of this plan, no further disclosure is being presented.\nK. Stock-Based Compensation\nWe have the following stock-based compensation plans:\nRestricted Stock Units\nIn February 2014, our stockholders approved and adopted at the Annual Meeting of Stockholders the 2014 Equity Incentive Plan (the 2014 Plan), which replaced our 2006 Equity Compensation Plan (2006 Plan). Persons eligible to receive awards under the 2014 Plan include our officers and employees. The 2014 Plan authorizes stock options, stock appreciation rights, restricted stock, restricted stock units and performance-based awards, as well as certain other awards.\nIn accordance with the 2014 Plan, the Compensation Committee has authorized grants of restricted stock units (RSUs) to certain officers and key employees of the company. The fair value of the RSUs is based on the price of our common stock as reported on the NASDAQ Global Market on the grant dates. Typically, these grants vest over a three-year period from the date of issuance and are a blend of time-based and performance-based shares. Fifty percent of the grant is time-based and vests over a three-year period on each anniversary of the grant date, based on continued employment. The remaining fifty percent of the grant is earned based on the three-year earnings and safety performance of the Company following the grant date. At September 30, 2022, there were 239,862 RSUs outstanding. The RSUs do not have voting rights but do receive dividend equivalents upon vesting which are accrued quarterly. Additionally, the shares of common stock underlying the RSUs are not considered issued and outstanding until vested and common stock is issued.\nTotal RSU activity (number of shares) for the past fiscal year is summarized below:\nNumber of\nRestricted\nStock\nUnits Weighted\nAverage\nGrant Value\nPer Share\nOutstanding at September 30, 2021 199,919 $ 30.34\nGranted 113,860 24.69\nVested (73,517) 32.79\nForfeited/cancelled (400) 38.58\nOutstanding at September 30, 2022 239,862 $ 26.11\nWe have reserved 750,000 shares of common stock for issuance under the 2014 Plan.\nRestricted Stock\nIn February 2022, our stockholders approved an amendment to the 2014 Non-Employee Director Equity Incentive Plan (the 2014 Director Plan) that extended the term of the 2014 Director Plan by ten years and increased the number of shares of common stock that may be issued under the 2014 Director Plan by 200,000 shares for a total of 350,000 shares. The plan is administered by the Compensation Committee. Eligibility to participate in the plan is limited to those individuals who are members of the Board of Directors of the Company and who are not employees of the Company or any affiliate of the Company.\nUnder the terms of the 2014 Director Plan, the maximum number of shares that may be granted during any calendar year to any individual is 12,000 shares. The total number of shares that may be issued for awards to any single participant during a calendar year for other stock-based awards (excluding stock options and SARs) is 4,000 shares. The Compensation Committee has determined that each non-employee director will receive 2,400 restricted shares of the Companys common stock annually. Fifty percent of the restricted stock granted to each of our non-employee directors vests immediately, while the remaining fifty\npercent vests on the anniversary of the grant date. Compensation expense is recognized immediately for the first fifty percent of the restricted stock granted, while compensation expense for the remaining fifty percent is recognized over the remaining vesting period.\nUnder this 2014 Director Plan, in February 2022, 16,800 shares of restricted stock were issued to our non-employee directors at a price of $23.09 per share. In February 2021, we issued 16,800 shares of restricted stock to our non-employee directors at a price of $31.33 per share. The total number of shares of common stock available for future awards under the 2014 Director plan was 206,200 shares as of September 30, 2022. At September 30, 2022 and 2021, there were 7,200 shares and 8,400 shares, respectively, of unvested restricted stock outstanding.\nCompensation Expense\nTotal compensation expense related to restricted stock grants under all plans was $0.4 million, $0.5 million and $0.6 million for the years ended September 30, 2022, 2021 and 2020, respectively. Total compensation expense related to RSUs under all plans was $3.7 million, $2.0 million and $2.9 million for the years ended September 30, 2022, 2021 and 2020, respectively.\nWe record the amortization of non-vested restricted stock and restricted stock units as an increase to additional paid-in capital. As of September 30, 2022 and 2021, amounts of deferred compensation expense not yet recognized related to non-vested stock and RSUs totaled $1.2 million and $1.1 million, respectively. As of September 30, 2022, the total weighted average remaining contractual life of our non-vested restricted stock and RSUs is approximately six months and 1.5 years, respectively.\nL. Fair Value Measurements\nWe measure certain financial assets and liabilities at fair value. Fair value is defined as an exit price, which represents the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants as of the measurement date. As such, fair value is a market-based measurement that should be determined based on assumptions that market participants would use in valuing an asset or liability. The accounting guidance requires the use of valuation techniques to measure fair value that maximize the use of observable inputs and minimize the use of unobservable inputs. As a basis for considering such assumptions and inputs, a fair value hierarchy has been established that identifies and prioritizes three levels of inputs to be used in measuring fair value.\nThe three levels of the fair value hierarchy are as follows:\nLevel 1 - Observable inputs such as quoted prices (unadjusted) in active markets for identical assets or liabilities.\nLevel 2 - Inputs other than the quoted prices in active markets that are observable either directly or indirectly, including: quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active or other inputs that are observable or can be corroborated by observable market data.\nLevel 3 - Unobservable inputs that are supported by little or no market data and require the reporting entity to develop its own assumptions.\nThe following table summarizes the fair value of our assets and liabilities that were accounted for at fair value on a recurring basis as of September 30, 2022 (in thousands):\nFair Value Measurements at September 30, 2022\nQuoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3) Fair Value at September 30, 2022\nAssets:\nCash and cash equivalents $ 101,954 $ - $ - $ 101,954\nShort-term investments 14,554 - - 14,554\nOther assets - 7,730 - 7,730\nLiabilities:\nDeferred compensation - 7,714 - 7,714\nThe following table summarizes the fair value of our assets and liabilities that were accounted for at fair value on a recurring basis as of September 30, 2021 (in thousands):\nFair Value Measurements at September 30, 2021\nQuoted Prices in\nActive Markets for\nIdentical Assets\n(Level 1) Significant Other\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3) Fair Value at September 30, 2021\nAssets:\nCash and cash equivalents $ 114,314 $ - $ - $ 114,314\nShort-term investments 19,667 - - 19,667\nOther assets - 9,100 - 9,100\nLiabilities:\nDeferred compensation - 8,527 - 8,527\nFair value guidance requires certain fair value disclosures to be presented in both interim and annual reports. The estimated fair value amounts of financial instruments have been determined using available market information and valuation methodologies described below.\nCash and cash equivalents - Cash and cash equivalents, primarily funds held in money market savings instruments, are reported at their current carrying value, which approximates fair value due to the short-term nature of these instruments and are included in cash and cash equivalents in our Consolidated Balance Sheets.\nShort-term Investments - Short-term investments include time deposits with original maturities of three months or more.\nOther Assets and Deferred Compensation - We hold investments in an irrevocable Rabbi Trust for our deferred compensation plan. The assets are primarily related to company-owned life insurance policies and are included in other assets in the accompanying Consolidated Balance Sheets. Because the mutual funds and company-owned life insurance policies are combined in the plan, they are therefore categorized as Level 2 in the fair value measurement hierarchy. The deferred compensation liability represents the investment options that the plan participants have designated to serve as the basis for measurement of the notional value of their accounts. Because the deferred compensation liability is intended to offset the plan assets, it is also categorized as Level 2 in the fair value measurement hierarchy.\nThere were no transfers between levels within the fair value measurement hierarchy during the year ended September 30, 2022.\nM. Leases\nOur leases consist primarily of office and manufacturing space, construction equipment and office equipment. All of our future lease obligations are related to non-cancelable operating leases. The most significant portion of our lease portfolio relates to leases of office and manufacturing facilities in Canada which we no longer occupy. We currently sublease the majority of these Canadian facilities. The following table provides a summary of lease cost components for the years ended September 30, 2022 and 2021, respectively (in thousands):\nLease Cost 2022 2021\nOperating lease cost $ 2,146 $ 2,435\nLess: sublease income (685) (706)\nVariable lease cost(1)\n457 443\nShort-term lease cost(2)\n1,643 1,281\nTotal lease cost $ 3,561 $ 3,453\n(1) Variable lease cost represents common area maintenance charges related to our Canadian office space lease.\n(2) Short-term lease cost includes leases and rentals with initial terms of one year or less.\nWe recognize operating lease assets and operating lease liabilities representing the present value of the remaining lease payments for leases with initial terms greater than twelve months. Leases with initial terms of twelve months or less are not recorded in our Consolidated Balance Sheets. As of September 30, 2022 and 2021, our operating lease assets have been reduced\nby a lease accrual of $0.1 million and $0.4 million, respectively, related to certain unused facility leases in Canada. The following table provides a summary of the operating lease assets and operating lease liabilities included in our Consolidated Balance Sheets as of September 30, 2022 and 2021, respectively (in thousands):\nSeptember 30,\nOperating Leases 2022 2021\nAssets:\nOperating lease assets, net $ 2,179 $ 3,453\nLiabilities:\nCurrent operating lease liabilities 1,777 1,415\nLong-term operating lease liabilities 545 2,413\nTotal lease liabilities $ 2,322 $ 3,828\nThe following table provides the maturities of our operating lease liabilities as of September 30, 2022 (in thousands):\nOperating Leases\n2023 $ 1,861\n2024 375\n2025 114\n2026 20\n2027 2\nThereafter -\nTotal future minimum lease payments $ 2,372\nLess: present value discount (imputed interest) (50)\nPresent value of lease liabilities $ 2,322\nThe weighted average discount rate as of September 30, 2022 was 3.73%. The weighted average remaining lease term was 1.51 years at September 30, 2022.\nN. Segment Information\nWe manage our business as one reportable operating segment related to the development, design, manufacturing and servicing of custom-engineered equipment and systems for the distribution, control and monitoring of electrical energy.\nRevenues by country represent sales to unaffiliated customers as determined by the ultimate destination of our products and services, summarized for the last three fiscal years by region in the table below (in thousands):\nYear Ended September 30,\n2022 2021 2020\nUnited States $ 404,973 $ 351,422 $ 397,983\nCanada 81,218 68,655 66,064\nMiddle East and Africa 20,712 26,615 18,162\nAsia/Pacific 4,885 8,889 18,079\nEurope 17,699 13,027 15,866\nMexico, Central and South America 3,095 1,951 2,345\nTotal revenues $ 532,582 $ 470,559 $ 518,499\nLong-lived assets by country consist of property, plant and equipment, net of accumulated depreciation and are determined based on the location of the tangible assets, summarized for the last two fiscal years in the table below (in thousands):\nSeptember 30,\n2022 2021\nLong-lived assets:\nUnited States $ 58,531 $ 62,308\nCanada 36,381 42,375\nUnited Kingdom 3,716 4,774\nTotal $ 98,628 $ 109,457\nO. Quarterly Information\nThe table below sets forth the unaudited consolidated operating results by fiscal quarter for the years ended September 30, 2022 and 2021 (in thousands, except per share data):\n2022 Quarters\nFirst(1)\nSecond Third(2)\nFourth(3)\nRevenues $ 106,569 $ 127,854 $ 135,483 $ 162,676 $ 532,582\nGross profit 13,436 19,083 19,059 33,440 85,018\nNet income (loss) (2,846) (1,217) 9,061 8,739 13,737\nEarnings (loss) per share:\nBasic $ (0.24) $ (0.10) $ 0.77 $ 0.74 $ 1.16\nDiluted $ (0.24) $ (0.10) $ 0.76 $ 0.73 $ 1.15\n(1) The results for the first quarter of Fiscal 2022 demonstrated normal seasonality and were negatively impacted by holidays and work schedules compared to other quarterly periods.\n(2) The results for the third quarter of Fiscal 2022 were positively impacted by the release of a $5.9 million Canadian valuation allowance and a $2.0 million pre-tax gain on the sale of a non-core business within our Canadian operations.\n(3) The results for the fourth quarter of Fiscal 2022 were positively impacted by a $2.5 million settlement of a claim for cost overruns from prior years related to a U.S. based municipal transit project.\n2021 Quarters\nFirst(1)\nSecond(1)\nThird(1)\nFourth(2)\nRevenues $ 106,575 $ 118,716 $ 115,813 $ 129,455 $ 470,559\nGross profit 18,271 17,153 17,167 22,472 75,063\nNet income (loss) (364) (225) (2,041) 3,261 631\nEarnings (loss) per share:\nBasic $ (0.03) $ (0.02) $ (0.17) $ 0.28 $ 0.05\nDiluted $ (0.03) $ (0.02) $ (0.17) $ 0.28 $ 0.05\n(1) The results for the first quarter of Fiscal 2021 demonstrated normal seasonality and were negatively impacted by holidays and work schedules compared to other quarterly periods. Gross profit decreased during the first three quarters of Fiscal 2021 as compared to Fiscal 2020 due to a decrease in volume, as well as project delays and cancellations of potential projects associated with the global economic impact resulting from the COVID-19 pandemic and associated reduction in demand across our industrial end markets.\n(2) The results for the fourth quarter of Fiscal 2021 were positively impacted by higher volume and favorable productivity across the service and manufacturing entities.\nThe sum of the individual earnings per share amounts may not agree with year-to-date earnings per share as each periods computation is based on the weighted-average number of shares outstanding during the period.\nP. Divestiture\nOn June 30, 2022, we sold a non-core, industrial valve repair and servicing business within our Canadian operations and received proceeds of $4.3 million. We recorded a $2.0 million pre-tax gain on this transaction, which has been presented in other income on our Consolidated Statement of Operations for the year ended September 30, 2022.\nQ. Separation Costs\nIn response to the COVID-19 pandemic, reductions in oil and gas demand and volatility of commodity prices, we implemented workforce reductions at most of our locations. As a result, we recorded $1.4 million of separation costs in restructuring and other, net on the Consolidated Statement of Operations during the third quarter of Fiscal 2020.\nR. Subsequent Event\nQuarterly Dividend Declared\nOn November 3, 2022, our Board of Directors declared a quarterly cash dividend on our common stock in the amount of $0.26 per share. The dividend is payable on December 14, 2022 to shareholders of record at the close of business on November 16, 2022. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe have established and maintain a system of disclosure controls and procedures that are designed to provide reasonable assurance that information required to be disclosed in our reports filed with the SEC pursuant to the Securities Exchange Act of 1934, as amended (Exchange Act), is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC and that such information is accumulated and communicated to our management, including our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), as appropriate, to allow timely decisions regarding required disclosures.\nManagement, with the participation of our CEO and CFO, has evaluated the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act) as of the end of the period covered by this Annual Report on Form 10-K. Based on such evaluation, our CEO and CFO have each concluded that, as of September 30, 2022, the end of the period covered by this Annual Report on Form 10-K, our disclosure controls and procedures were effective to provide reasonable assurance that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and that such information is accumulated and communicated to our management, including the CEO and CFO, as appropriate, to allow timely decisions regarding required disclosures.\nManagements Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining effective internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Our system of internal control was designed using a top-down risk-based approach to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Due to its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become ineffective due to changes in conditions or deterioration in the degree of compliance with the policies or procedures.\nManagement of the Company has assessed the effectiveness of our internal control over financial reporting as of September 30, 2022. Management evaluated the effectiveness of our internal control over financial reporting based on the criteria in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on managements evaluation, management has concluded that our internal control over financial reporting was effective at the reasonable assurance level as of September 30, 2022, based on criteria in Internal Control - Integrated Framework (2013) issued by the COSO.\nPricewaterhouseCoopers LLP, an independent registered public accounting firm, has audited and issued their report on the effectiveness of our internal control over financial reporting as of September 30, 2022, which appears in their report on the financial statements included herein.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during the last fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item is incorporated in this Annual Report by reference to our definitive proxy statement pursuant to Regulation 14A, to be filed with the Securities and Exchange Commission not later than 120 days after the close of our fiscal year ended September 30, 2022.\nWe have adopted a Code of Business Conduct and Ethics that applies to all employees, including our executive officers and directors. A copy of our Code of Business Conduct and Ethics may be obtained at the Investor Relations section of our website, www.powellind.com, or by written request addressed to the Secretary, Powell Industries, Inc., 8550 Mosley Road, Houston, Texas 77075. We will satisfy the requirements under Item 5.05 of Form 8-K regarding disclosure of amendments to, or waivers from, provisions of our code of ethics that apply to the chief executive officer, chief financial officer or controller by posting such information on our website. Item 11. Executive Compensation\nThe information required by this item is incorporated in this Annual Report by reference to our definitive proxy statement pursuant to Regulation 14A, to be filed with the Securities and Exchange Commission not later than 120 days after the close of our fiscal year ended September 30, 2022. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item is incorporated in this Annual Report by reference to our definitive proxy statement pursuant to Regulation 14A, to be filed with the Securities and Exchange Commission not later than 120 days after the close of our fiscal year ended September 30, 2022. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item is incorporated in this Annual Report by reference to our definitive proxy statement pursuant to Regulation 14A, to be filed with the Securities and Exchange Commission not later than 120 days after the close of our fiscal year ended September 30, 2022. Item 14. Principal Accountant Fees and Services\nThe information required by this item is incorporated in this Annual Report by reference to our definitive proxy statement pursuant to Regulation 14A, to be filed with the Securities and Exchange Commission not later than 120 days after the close of our fiscal year ended September 30, 2022.\nPART IV Item 15. Exhibits. Financial Statement Schedules\n1. Financial Statements. Reference is made to the Index to Consolidated Financial Statements at Item 8 of this Annual Report.\n2. Financial Statement Schedule. All financial statement schedules are omitted because they are not applicable, or the required information is shown in the Consolidated Financial Statements or the Notes to the Consolidated Financial Statements included elsewhere in this Annual Report.\n3. Exhibits.\nNumber Description of Exhibits\n3.1 - Certificate of Incorporation of Powell Industries, Inc. filed with the Secretary of State of the State of Delaware on February 11, 2004 (filed as Exhibit 3.1 to our Form 8-A/A filed November 1, 2004, and incorporated herein by reference).\n3.2 - Amended and Restated By-laws of Powell Industries, Inc. (filed as Exhibit 3.1 to our Form 8-K filed October 12, 2012, and incorporated herein by reference).\n3.3 - Amendment No. 1 to Amended and Restated By-laws of Powell Industries, Inc. (filed as Exhibit 3.1 to our Form 8-K filed February 26, 2021, and incorporated herein by reference).\n10.1 - Description of Supplemental Executive Benefit Plan (filed as Exhibit 10 to our Form 10-K for the fiscal year ended October 31, 1984, and incorporated herein by reference).\n10.2 - Powell Industries, Inc. Directors Fees Program (filed as Exhibit 10.7 to our Form 10-K for the fiscal year ended October 31, 1992, and incorporated herein by reference).\n10.3 - Powell Industries, Inc. Deferred Compensation Plan (filed as Exhibit 10.9 to our Form 10-K for the fiscal year ended October 31, 2002, and incorporated herein by reference).\n10.4 - Banking facilities between HSBC Bank plc and Switchgear & Instrumentation Limited and Switchgear & Instrumentation Properties Limited dated September 12, 2005 (filed as Exhibit 10.16 to our Form 10-K for the fiscal year ended October 31, 2005, and incorporated herein by reference).\n10.5 - Lease Agreement between the Company and C&L Partnership, Ltd. dated April 19, 2006 (filed as Exhibit 10.2 to our Form 8-K filed August 9, 2006, and incorporated herein by reference).\n10.6 - Employment Agreement dated as of May 8, 2012 between the Company and Milburn E. Honeycutt (filed as Exhibit 10.2 to our Form 10-Q for the quarter ended March 31, 2012, and incorporated herein by reference).\n10.7 - Amended and Restated Credit Agreement dated as of April 26, 2012, between Powell PowerComm Inc., as Borrower, Powell Industries, Inc., Nextron Limited, PPC Technical Services Inc., as Guarantors, and HSBC Bank Canada, as Lender (filed as Exhibit 10.4 to our Form 10-Q for the quarter ended March 31, 2012, and incorporated herein by reference).\n10.8 - Stock Purchase Agreement dated as of January 15, 2014, between the Company and Kapsch TrafficCom IVHS, Inc. (filed as Exhibit 10.1 to our Form 8-K filed January 17, 2014, and incorporated herein by reference).\n*10.9 - Amended and Restated Powell Supply Agreement dated as of December 30, 2013, between the Company and General Electric Company (filed as Exhibit 10.2 to our Form 10-Q filed February 5, 2014 and incorporated herein by reference).\n10.10 - 2014 Equity Incentive Plan (filed as Exhibit 10.2 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.11 - Form of Restricted Stock Award Agreement under 2014 Equity Incentive Plan (filed as Exhibit 10.3 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\nNumber Description of Exhibits\n10.12 - Form of Restricted Stock Unit Award Agreement under 2014 Equity Incentive Plan (filed as Exhibit 10.4 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.13 - Form of Performance Unit Award Agreement under 2014 Equity Incentive Plan (filed as Exhibit 10.5 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.14 - Form of Stock Option Award Agreement under 2014 Equity Incentive Plan (filed as Exhibit 10.6 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.15 - Form of Stock Appreciation Right Award Agreement under 2014 Equity Incentive Plan (filed as Exhibit 10.7 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.16 - 2014 Non-Employee Director Equity Incentive Plan (filed as Exhibit 10.8 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.17 - Form of Restricted Stock Award Agreement under 2014 Non-Employee Director Equity Incentive Plan (filed as Exhibit 10.9 to our Form 10-Q filed May 7, 2014 and incorporated herein by reference).\n10.18 - Renewed banking facilities between HSBC Bank plc and Powell (UK) Limited dated October 20, 2014 (filed as Exhibit 10.48 to our Form 10-K filed December 3, 2014, and incorporated herein by reference).\n10.19 - Amending Agreement to Amended and Restated Credit Agreement, effective as of March 31, 2015, between Powell Canada Inc., Powell Industries, Inc., Nextron Limited, PCG Northern Services Inc. and HSBC Bank Canada (filed as Exhibit 10.1 to our Form 10-Q filed May 6, 2015 and incorporated herein by reference).\n10.20 - Employment Agreement dated September 29, 2016, between the Company and Brett A. Cope (filed as Exhibit 10.1 to our 8-K filed September 30, 2016 and incorporated herein by reference).\n10.21 - Employment Agreement effective November 5, 2018 by and between the Company and Michael W. Metcalf (filed as Exhibit 10.1 to our Form 8-K filed November 1, 2018 and incorporated herein by reference).\n10.22 - Amended and Restated Credit Agreement, dated September 27, 2019, by and between the Company, as Borrower, certain subsidiaries of the Company identified therein, as Guarantors, Bank of America, N.A., as Administrative Agent, Swingline Lender and L/C Issuer, the Lenders party thereto and BofA Securities, Inc., as Sole Lead Arranger and Sole Bookrunner (filed as Exhibit 10.25 to our Form 10-K filed December 5, 2019 and incorporated herein by reference).\n10.23 - First Amendment to Credit Agreement dated March 12, 2021 (filed as Exhibit 10.1 to our Form 8-K filed March 16, 2021 and incorporated herein by reference).\n10.24 - LIBOR Transition Amendment, dated December 31, 2021, by and between the Company, as Borrower, certain subsidiaries of the Company identified therein, as Guarantors, the Lenders party thereto and Bank of America, N.A., as Administrative Agent (filed as Exhibit 10.1 to our Form 10-Q filed February 9, 2022 and incorporated herein by reference).\n**21.1 - Subsidiaries of Powell Industries, Inc.\n**23.1 - Consent of PricewaterhouseCoopers LLP.\n**31.1 - Certification of Chief Executive Officer pursuant to Rule 13a-14(a)/15d-14(a).\n**31.2 - Certification of Chief Financial Officer pursuant to Rule 13a-14(a)/15d-14(a).\n***32.1 - Certification of Chief Executive Officer Pursuant to Section 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nNumber Description of Exhibits\n***32.2 - Certification of Chief Financial Officer Pursuant to Section 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n**101 - The following financial statements from the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2022, formatted in Inline XBRL: (i) Consolidated Balance Sheets; (ii) Consolidated Statements of Operations; (iii) Consolidated Statements of Comprehensive Income; (iv) Consolidated Statements of Stockholders' Equity; (v) Consolidated Statements of Cash Flows; and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n**104 - The cover page from the Companys Annual Report on Form 10-K for the fiscal year ended September 30, 2022, formatted in Inline XBRL (included as Exhibit 101).\n* Portions of this exhibit have been omitted based on a request for confidential treatment pursuant to Rule 24b-2 of the Securities Exchange Act of 1934. Such omitted portions have been filed separately with the Commission.\n** Filed herewith.\n*** Furnished herewith.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPOWELL INDUSTRIES, INC.\nBy: /s/ Brett A. Cope\nBrett A. Cope\nPresident and Chief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant in the capacities and on the date indicated:\nSignature Title\n/s/Brett A. Cope Chairman of the Board\nPresident and Chief Executive Officer\n(Principal Executive Officer)\nBrett A. Cope\n/s/Michael W. Metcalf Executive Vice President\nChief Financial Officer\n(Principal Financial Officer)\nMichael W. Metcalf\n/s/Milburn Honeycutt Vice President\nChief Accounting Officer\nCorporate Controller\n(Principal Accounting Officer)\nMilburn Honeycutt\n/s/ Christopher E. Cragg Director\nChristopher E. Cragg\n/s/ Katheryn B. Curtis Director\nKatheryn B. Curtis\n/s/ James W. McGill Director\nJames W. McGill\n/s/ John G. Stacey Director\nJohn G. Stacey\n/s/ John D. White Director\nJohn D. White\n/s/ Richard E. Williams\nDirector\nRichard E. Williams\nDate: December 6, 2022"
}