{
    "cik": "810136",
    "company": "PHOTRONICS INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-23",
    "period_of_report": "2022-10-31",
    "sic": "3674",
    "state_of_inc": "CT",
    "state_location": "CT",
    "fiscal_year_end": "1031",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/810136/0001140361-22-046880-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/810136/000114036122046880/brhc10045687_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/810136/0001140361-22-046880.txt",
    "filename": "810136_10K_2022_0001140361-22-046880.htm",
    "content": "ITEM 1.\nBUSINESS\nGeneral\nPhotronics, Inc. (and its subsidiaries, collectively referred to herein as Photronics, the Company, we, our, or us) is the worlds leading manufacturer of photomasks, which are high precision photographic quartz or glass plates containing microscopic images of electronic circuits. Photomasks are a key element in the manufacture of ICs and FPDs and are used as masters to transfer circuit patterns onto semiconductor wafers and FPD substrates during the fabrication of ICs, a variety of FPDs and, to a lesser extent, other types of electrical and optical components. We have eleven manufacturing facilities, which are located in Taiwan (3), China (2), Korea, the United States (3), and Europe (2).\nOur principal executive offices are located at 15 Secor Road, Brookfield, Connecticut, 06804, telephone (203) 775-9000. Our website address is http://www.photronics.com. We make available, free of charge through our website, our Forms 10-K, Definitive Proxy Statements on Schedule 14A, Forms 10-Q, Current Reports on Form 8-K, and any amendments to these reports as soon as reasonably practicable after such materials are electronically filed with or furnished to the SEC. The information found on, or incorporated into, our website is not part of this or any other report we file with or furnish to the SEC. The SEC also maintains a website at http://www.sec.gov that contains reports, proxy statements and other information regarding SEC registrants, including Photronics.\nImpact of the COVID-19 Pandemic\nAll of our facilities have continued to operate throughout the COVID-19 pandemic. However, since shortly after it was first identified near the end of calendar year 2019, the pandemic has had an impact on our business in a number of ways including customer shutdowns, which led to delays in new photomask design releases, and travel restrictions, which delayed tool installations and servicing. To date, we have not experienced significant raw material shortages; however, supply-chain disruptions could potentially delay or prevent us from fulfilling customer orders.\nAt certain facilities, employees not required to be on-site to maintain production have worked remotely at various times - either at our discretion or due to government mandates. The implementation of these measures has not materially affected our operations.\nSales\nWe manufacture photomasks, which are used as masters to transfer circuit patterns onto semiconductor wafers and FPD substrates. The photomasks we manufacture incorporate circuit designs provided to us on a confidential basis by our customers. Photomasks are typically sold in sets comprised of layers, with each layer having a distinct pattern that is etched onto a different photomask. The resulting series of photomasks is then used to image the circuit patterns onto each successive layer of a semiconductor wafer or FPD substrate. The typical manufacturing process for a photomask involves the receipt and conversion of circuit design data to manufacturing pattern data. A lithography system then exposes the circuit pattern onto a photomask blank. The exposed areas are developed and etched to imprint the pattern on the photomask. The photomask is then inspected for defects and conformity to the customers design data. After the repair of any defects, the photomask is cleaned, any required pellicles (protective translucent cellulose membranes) are applied and, after final inspection, the photomask is shipped to the customer.\nHigh-end photomasks support 28 nanometer and smaller design nodes for ICs and Generation 10.5+, AMOLED, and LTPS display-based process technologies for FPDs. However, 32 nanometer and above geometries for semiconductors and Generation 8 and below (excluding AMOLED and LTPS) process technologies for displays, which we refer to as mainstream photomasks, constitute the majority of designs currently being fabricated in volume. At these geometries and at various high-end nodes, we can produce full lines of photomasks. Moreover, there is no significant technology employed by our competitors that is not available to us. We expect advanced-generation designs to continue to be developed throughout fiscal 2023, and we believe we are well positioned to service an increasing volume of this business as a result of our ongoing investments in manufacturing processes and technology in the regions where our customers are located.\nGenerally, Photronics and each of its customers engage in a qualification and correlation process before we become an approved supplier. Thereafter, based on the customers specifications, we typically negotiate pricing parameters for the customers order. Some prices may remain in effect for an extended period of time. In many instances, we enter into sales arrangements with an understanding that, as long as our performance is competitive, we will receive a specified percentage of that customers photomask orders.\nThe first several layers of photomasks are sometimes required to be delivered to customers within twenty-four hours from the time we receive customer design data. Because of the short period between order and shipment dates (typically from one day to three weeks) for a significant amount of our revenue, the dollar amount of our current backlog is not a reliable indicator of future revenue. However, the demand for some IC photomasks has recently expanded beyond the industrys capacity to supply them within the traditional time period; thus, for some products, our backlog can expand to as long as two to three months.\nThe ability to manufacture high-quality photomasks within short time periods is dependent upon robust processes, efficient manufacturing methods, high production yield, available manufacturing capacity, and high equipment reliability. We work to meet these requirements by making significant investments in research and development, manufacturing capacity, preventive and on-going equipment maintenance programs, manufacturing and data processing systems, and by utilizing statistical process control methods to optimize our manufacturing processes and reduce cycle times.\nQuality control is an integral part of the photomask manufacturing process. Photomasks are manufactured in temperature, humidity, and particulate-controlled clean rooms because of the high level of precision, quality and manufacturing yield required. Each photomask is inspected several times during the manufacturing process to ensure compliance with customer specifications. We continue to make substantial investments in equipment to produce, inspect and repair photomasks to ensure that customer specifications are met.\nWe conduct our sales and marketing activities primarily through a staff of full-time sales personnel and customer service representatives who work closely with the Companys management and technical personnel. We support non-U.S. customers through both our domestic and foreign facilities and consider our presence in non-U.S. markets to be an important factor in attracting new customers, as it provides global solutions to our customers, minimizes delivery time, and allows us to serve customers that utilize manufacturing foundries outside of the United States, principally in Asia. See Notes 7 and 15 to our consolidated financial statements in Part II, Item 8 of this report for the amount of revenue and long-lived assets attributable to each of our geographic areas of operations.\nResearch and Development\nWe primarily conduct research and development activities for IC photomasks at our Boise, Idaho, facility and, to a lesser degree, Photronics DNP Mask Corporation (PDMC), our joint-venture subsidiary in Taiwan. Research and development for FPD photomasks is primarily conducted at Photronics Cheonan, Ltd., our subsidiary in South Korea. Additionally, we conduct site-specific research and development programs to support local, strategic customer roadmaps. All of these research and development programs and activities are undertaken to advance our competitiveness in technology and manufacturing efficiency. We also conduct application-oriented research and development, including data and service technology to support the integration of photomasks into customer processes. Currently, research and development for IC photomasks are primarily focused on photomasks enabling wafer geometries of 14 nanometer node and smaller and, for FPDs, on Generations 8 and 10 substrate size photomasks for new TV technologies, emerging opportunities for micro- and mini-LED displays, and photomask technology for the complex FPD photomasks required in the manufacture of advanced mobile displays, such as AMOLED. We believe these core competencies will continue to be a critical part of semiconductor and FPD manufacturing, as wafer and FPD substrate optical lithography continues to enable new high-end ICs and displays. We incurred research and development expenses of $18.3 million, $18.5 million, and $17.1 million in 2022, 2021 and 2020, respectively. It is our belief that we own, control, or license the proprietary information (including trade secrets and patents) that we need to continue to meet our customers requirements. We also believe that our intellectual property and trade secret know-how will continue to be important to our maintaining technical leadership in the field of photomasks.\nMarkets\nThe market for photomasks primarily consists of semiconductor and FPD manufacturers and designers worldwide. Photomasks are manufactured by independent merchant manufacturers like Photronics and by semiconductor and FPD manufacturers that produce photomasks for their own use (captive manufacturers). In rare instances, captive manufacturers also sell to other semiconductor or FPD manufacturers. Previously, there was a trend towards the divesture or closing of captive photomask operations by semiconductor manufacturers, and an increase in the share of the market served by independent merchant manufacturers. This trend was driven by the increased complexity and cost of capital equipment used in manufacturing photomasks and the lack of economy of scale for many semiconductor and FPD manufacturers to effectively utilize the equipment. However, more recently, to reach certain roadmap milestones, some captive mask facilities have been investing at faster rates than independent manufacturers, particularly in the foundry logic and memory spaces. Nevertheless, most captive manufacturers maintain business and technology relationships with independent photomask manufacturers for ongoing support.\nWe support customers across the full spectrum of IC production and FPD technologies by manufacturing photomasks using electron beam or optical (laser-based) lithography systems. For IC photomasks, the predominant writing technology used for advanced photomasks with fine-scale resolution requirements is electron beam writing systems, while FPD mask fabrication utilizes optical writing systems. These systems are capable of producing the most advanced semiconductor and display photomasks for use in an array of products. End markets served with IC photomasks include devices used for microprocessors, memory, telecommunications, the Internet of Things, crypto mining, and other applications. We own a number of both high-end and mature electron beam and laser-based lithography systems.\nWe sell our products primarily to leading semiconductor and FPD designers and manufacturers. These include integrated device manufacturers, fabless semiconductor companies, and pure play foundries. During 2022, we sold our products to approximately 550 customers. Revenue from United Microelectronics Corp. Co., Ltd. accounted for approximately 15%, 17% and 16% of our total revenues in 2022, 2021 and 2020, respectively, and revenue from Samsung Electronics Co., Ltd. accounted for approximately 11%, 12% and 14% of our total revenues in those respective years. Our five largest customers, in the aggregate, accounted for approximately 45%, 43% and 45% of our revenue in 2022, 2021 and 2020, respectively. A significant decrease in the amount of revenue from any of these customers could have a material adverse effect on our financial performance and business prospects.\nCompetition\nThe photomask industry is highly competitive, and most of our customers utilize multiple photomask suppliers. Our ability to compete depends primarily upon the consistency of our product quality, timeliness of delivery, competitive pricing, technical capability, and service, which we believe are the principal factors considered by customers in selecting their photomask suppliers. An inability to meet these requirements could adversely affect our financial condition, results of operations, and cash flows. We also believe that geographic proximity to customers is an important factor in certain markets where cycle time from order to delivery is critical. While some of our competitors may have greater financial, sales, marketing, or other resources than Photronics, we believe that we are able to compete effectively because of our dedication to customer service, ongoing investments in state-of-the-art photomask equipment and facilities, and experienced technical employees.\nWe estimate that, for the types of photomasks we manufacture (IC and FPD), the size of the total market (captive and merchant) is approximately $7.5 billion. Our competitors include Compugraphics International, Ltd., Dai Nippon Printing Co., Ltd (outside of Taiwan and China), Hoya Corporation, LG Innotek Co., Ltd., Shenzhen Newway Photomask Making Co., Ltd., Shenzhen Qingyi Photomask, Ltd., SK-Electronics Co., Ltd., Taiwan Mask Corporation, and Toppan Electronics Products Co., Ltd. We also compete with semiconductor and FPD manufacturers captive photomask manufacturing operations that supply photomasks for internal use and, in some instances, also for external customers and foundries. We expect to face continued competition which, in the past, has led to pressure to reduce prices. We believe the pressure to reduce prices, together with the significant investment required in capital equipment to manufacture high-end photomasks, has contributed to the decrease in the number of independent manufacturers, and we expect such pressure to continue in the future.\nInternational Operations\nRevenues from our non-U.S. operations were approximately 85%, 84% and 83% of our total revenues in 2022, 2021 and 2020, respectively. We believe that our ability to serve non-U.S. markets is enhanced by our having, among other things, a local presence in the markets we serve. This requires significant investments in financial, managerial, operational, and other resources.\nOperations outside of the United States are subject to inherent risks, including fluctuations in exchange rates, political and economic conditions in various countries, legal compliance and regulatory requirements, tariffs and other trade barriers, difficulties in staffing and managing international operations, longer accounts receivable collection cycles, potential restrictions on transfers of funds, and potentially adverse tax consequences. These factors may have a material adverse effect on our ability to generate revenue outside of the United States and to deploy resources where they could otherwise be used to their greatest advantage and, consequently, may adversely affect our financial condition and results of operations. Notes 7 and 15 of our consolidated financial statements, in Part II, Item 8 of this report, respectively, present our revenue and long-lived assets by geographic area.\nResources\nRaw materials used by Photronics generally include: high precision quartz plates (including large area plates), which are used as photomask blanks and are primarily obtained from Japanese and Korean suppliers; pellicles and electronic grade chemicals, which are used in the manufacturing process; and compacts, which are durable plastic containers in which photomasks are shipped. These materials are generally sourced from several suppliers. We believe that our utilization of a select group of strategic suppliers enables us to access the most technologically advanced materials available. On an ongoing basis, we continue to consider additional supply sources.\nWe typically enter into annual pricing agreements with our suppliers, some of which include volume-based incentives that have resulted in substantial cost savings; these agreements do not require us to purchase minimum dollar amounts or quantities of their subject materials.\nWe rely on a limited number of equipment suppliers to develop and provide the equipment used in the photomask manufacturing process. Although, historically, we have been able to obtain equipment on a timely basis, an inability to obtain or repair equipment when required could have a material adverse effect on our business and results of operations.\nIntellectual Property Rights\nWe have developed and hold ownership interests in intellectual property (IP) rights, in the forms of patents issued in the U.S., and other trademark and trademark registrations in the U.S. and other countries. Patents in which we hold ownership interests generally relate to the manufacture of photomasks or the use of photomasks to manufacture other products. While we believe that our IP rights are, and will continue to be, important to our technical leadership in the field of photomasks, our operations are not dependent on any one individual IP right. In addition to patenting, when practicable, we further protect our IP rights, and our other proprietary processes, by utilizing non-disclosure agreements with employees, customers, and vendors.\nSeasonality\nOur business is typically impacted during the first quarter of our fiscal year by the North American, European, and Asian holiday periods, as some customers reduce their development and buying activities during those periods.\nGovernment Contracts\nWe are party to a limited number of fixed-price contracts with the U.S. government. Revenues earned from these contracts do not comprise a significant portion of our total revenue.\nGovernment Regulation\nWe are subject to government regulations within the U.S. and in other countries in which we produce or market our products. The effects of compliance with these regulations are currently not material to our results of operations, capital expenditures, or competitive position. However, compliance with changes to existing or new regulations may have a material adverse effect on our future results of operations, capital expenditures, or competitive position. We discuss the potential impact of our not adhering to a number of these regulations in ITEM 1A.\nRISK FACTORS\nSet forth below are discussions of the risk factors we believe can make an investment in our business speculative or risky.\nConcentration Related Risk Factors\nOur dependency on the microelectronics industry, which as a whole is volatile, could create volatility in our demand and have a negative material impact on our business.\nWe sell substantially all of our photomasks to semiconductor or FPD designers, manufacturers and foundries, as well as to other high-performance electronics manufacturers. We believe that the demand for photomasks depends primarily on design activity rather than sales volume from products using photomask technologies. Consequently, an increase in semiconductor or FPD sales does not necessarily result in a corresponding increase in photomask sales. In addition, the reduced use of application-specific ICs, reductions in design complexities, other changes in the technology or methods of manufacturing or designing semiconductors or FPDs, or a slowdown in the introduction of new semiconductor or FPD designs could reduce demand for photomasks - even if the demand for semiconductors and FPDs increases. Historically, the microelectronics industry has been volatile, with sharp periodic downturns and slowdowns. These negative trends have been characterized by, among other things, diminished product demand, excess production capacity, and accelerated erosion of selling prices with a concomitant effect on revenue and profitability.\nWe depend on a limited number of suppliers for equipment and raw materials and, if those suppliers fail to timely deliver their products to us, we may be unable to fulfill orders from our customers, which could adversely affect our business and results of operations.\nWe rely on a limited number of photomask equipment manufacturers to develop, supply, and repair the equipment we use. These equipment manufacturers usually require lead times of twelve months or longer between the order date and the delivery of certain photomask imaging and inspection equipment. The failure of our suppliers to develop or deliver such equipment on a timely basis due to internal issues, supply chain constraints or government imposed restrictions could have a material adverse effect on our business and results of operations. In addition, the manufacturing equipment necessary to produce advanced photomasks could become prohibitively expensive, which could similarly affect us.\nWe use high-precision quartz photomask blanks, pellicles, and electronic grade chemicals in our manufacturing processes. There are a limited number of suppliers of these raw materials, and we do not have long-term contracts with these suppliers. Any delays or quality problems in connection with significant raw materials, particularly photomask blanks, could cause delays in the shipments of photomasks, which could have a material adverse effect on our business and results of operations. The fluctuation of foreign currency exchange rates, with respect to prices of equipment and raw materials used in manufacturing, could also have a material adverse effect on our business and results of operations.\nWe have been dependent on sales to a limited number of large customers; the loss of any of these customers or a significant reduction in orders from these customers could have a material adverse effect on our revenues and results of operations.\nHistorically, we have sold a significant proportion of photomasks to a limited number of IC and FPD manufacturers. During 2022, 2021 and 2020, our two largest customers accounted for 25%, 29% and 29%, respectively, of our revenue. Our five largest customers accounted for 45%, 43% and 45% of our revenue in 2022, 2021 and 2020, respectively. The loss of a significant customer, a significant reduction or delay in orders from any significant customer (including reductions or delays due to customer departures from recent buying patterns), or an unfavorable change in competitive conditions in the semiconductor or FPD industries could have a material adverse effect on our financial performance and business prospects. The consolidation of semiconductor manufacturers, or an economic downturn in the semiconductor industry, may increase the likelihood of losing a significant customer and could also have an adverse effect on our financial performance and business prospects.\nFinancing Related Risk Factors\nOur cash flows from operations and current holdings of cash may not be adequate for our current and long-term needs.\nOur liquidity, as we operate in a high fixed-cost environment, is highly dependent on our revenue volume and the timing of our capital expenditures, which can vary significantly from period to period. Depending on conditions in the semiconductor and FPD markets, our cash flows from operations and current holdings of cash may not be adequate to meet our current and long-term needs for capital expenditures, operations, and debt repayments. Historically, in certain years, we have used external financing to fund these needs. Due to conditions in the credit markets and covenant restrictions on our existing debt, some financing instruments used by us in the past may not be available. Therefore, we cannot provide assurance that additional sources of financing would be available to us on commercially favorable terms, if at all, should our cash requirements exceed our existing cash, operating cash flows, and cash available under our credit agreements.\nOur credit facility restricts our business activities, limits our ability to obtain additional financing or pay cash dividends, and may obligate us to repay debt before its maturity.\nFinancial covenants related to our credit facility, which expires in September 2023, include a total leverage ratio, a minimum interest coverage ratio, and minimum unrestricted cash balances. Our credit facility may also limit our flexibility in planning for, or reacting to, changes in our business and industry, which may place us at a disadvantage with our competitors. We are also subject to covenants that limit our financing flexibility, such as a limit on the amount we can spend to repurchase shares of our common stock. Existing covenant restrictions, and noncompliance with covenants or cross-default provisions could limit our ability to draw down on current facilities or our ability to obtain additional debt financing, and limit the amounts of dividends, distributions, and redemptions we can pay on our common stock to an annual amount of $50 million. Should we be unable to meet one or more of these covenants, our lenders may require us to repay any outstanding balance prior to the expiration date of our agreements. Our ability to comply with the financial and other covenants in our credit agreements may be affected by deteriorating economic or business conditions, or other events. We cannot assure that, under such circumstances, additional sources of financing would be available to fund operating requirements or repay any long-term borrowings, to avoid default.\nOur operations will continue to require substantial capital expenditures, for which we may be unable to provide or obtain funding.\nThe manufacture of leading-edge photomasks requires us to make substantial investments in additional manufacturing capability. We expect that we will be required to continue to make substantial capital expenditures to meet customer requirements and to position us for future growth. Our capital expenditure payments for fiscal 2023 are expected to be approximately $130 million, of which approximately $5.3 million was included in Accounts payable and Accrued liabilities on our October 31, 2022, consolidated balance sheet. We cannot provide assurance that we will be able to obtain the additional capital required to fund our operations or capital expenditures on reasonable terms, if at all, or that any such inability will not have a material adverse effect on our business and results of operations.\nServicing our debt requires a significant amount of cash, and we may not generate sufficient cash flows from our operations to pay our indebtedness.\nOur ability to make scheduled payments of debt principal and interest, or to refinance our indebtedness, depends on our future performance, which is subject to economic, financial, competitive, and other factors beyond our control. Our business may not continue to generate sufficient cash flows from operations to fund operations, service our debt and make necessary capital expenditures. If we are unable to generate such cash flows, we may be required to adopt one or more alternatives, such as selling assets, restructuring debt, or obtaining additional equity capital on terms that may be onerous or highly dilutive. Our ability to refinance our indebtedness would depend upon the conditions in the capital markets and our financial condition at such time. We may not be able to engage in any of these activities or engage in these activities on desirable terms, which could result in a default on our debt obligations.\nIndustry and Competitive Related Risk Factors\nOur business depends on managerial and technical personnel, who are in great demand, and our inability to attract and retain qualified employees could adversely affect our business and results of operations.\nOur success depends, in part, upon key managerial and technical personnel, as well as our ability to continue to attract and retain additional qualified personnel. The loss of certain key personnel (for example, our chief executive officer, chief financial officer and chief technology officer) could have a material adverse effect on our business and results of operations. We cannot offer assurance that we can retain our key managerial and technical employees, or that we can attract similar additional employees in the future.\nThe photomask industry is dependent on the semiconductor and display industries, which are subject to rapid technological change and fluctuations in capacity needs. Consequently, we might fail to adequately time our capabilities to market needs, which could have a material adverse effect on our business and results of operations.\nThe photomask industry has been, and we expect it to continue to be, characterized by technological change and evolving industry requirements, which recent supply chain regionalization efforts have accelerated. In order to remain competitive, we will be required to continually anticipate, respond to, and scale technologies of increasing complexity in both traditional and emerging markets that we serve. In particular, we believe that, as semiconductor geometries continue to become smaller and FPDs become larger or otherwise more advanced, we will be required to manufacture photomasks of increasingly more challenging complexity. Moreover, the demand for photomasks in non-leading-edge nodes may increase beyond our ability to meet our customers requirements within adequate response times. Additionally, the demand for photomasks has been, and could in the future be, adversely affected by changes in semiconductor and high-performance electronics fabrication methods that affect the type or quantity of photomasks utilized, such as changes in semiconductor demand that favor field-programmable gate arrays and other semiconductor designs that replace application-specific ICs, or the use of certain chip-stacking methodologies that lessen the emphasis on conventional lithography technology. Furthermore, evidence of the viability and the corresponding market acceptance of alternative methods of transferring IC designs onto semiconductor wafers could reduce or eliminate the need for photomasks in the production of semiconductors. As of the end of 2022, one alternative method, direct-write lithography, has not been proven to be a commercially viable alternative to photomasks, as it is considered to be too slow for high-volume semiconductor wafer production. However, should direct-write or any other alternative method of transferring IC or FPD designs without the use of photomasks achieve market acceptance, and if we are unable to anticipate, respond to, or utilize these or other technological changes, due to resource, technological, or other constraints, our business and results of operations could be materially adversely affected.\nThe risk of loss of our intellectual property, trade secrets, or other sensitive business or customer confidential information or disruption of operations due to cyberattacks or data breaches could negatively impact our financial results.\nCyberattacks or data breaches could compromise confidential, business-critical information, cause disruptions in our operations, expose us to potential litigation, or harm our reputation. We have important assets, including intellectual property, trade secrets, and other sensitive, business-critical and/or confidential information which may be vulnerable to such incidents. While we have a comprehensive cybersecurity program that is continually reviewed, maintained, and upgraded, we cannot assure that we are invulnerable to cyberattacks and data breaches which, if significant, could negatively impact our business and financial results.\nWe may be unable to enforce or defend our ownership and use of proprietary technology, and the utilization of unprotected company developed technology by our competitors could adversely affect our business, results of operations, and financial position.\nWe believe that the success of our business depends more on proprietary technology, information and processes, and know-how than on our patents or trademarks. Much of our proprietary information and technology related to manufacturing processes is not patented and may not be patentable. We cannot offer assurance that:\nwe will be able to adequately protect our technology;\ncompetitors will not independently develop similar technology;\ninternational intellectual property laws will adequately protect our intellectual property rights.\nWe may become the subject of infringement claims or legal proceedings by third parties with respect to current or future products or processes. Any such claims, with or without merit, or litigation to enforce or protect our intellectual property rights that require us to defend against claimed infringements of the rights of others, could result in substantial costs, diversion of resources, and product shipment delays or could force us to enter into royalty or license agreements, rather than dispute the merits of these claims. Any of the foregoing could have a material adverse effect on our business, results of operations, and financial position.\nWe operate in a highly competitive environment, and, should we be unable to meet our customers requirements for product quality, timeliness of delivery or technical capabilities, our revenue could be adversely affected.\nThe photomask industry is highly competitive, and most of our customers utilize more than one photomask supplier. Our competitors include Compugraphics International, Ltd., Dai Nippon Printing Co., Ltd (outside of Taiwan and China), Hoya Corporation, LG Innotek Co., Ltd., Shenzhen Newway Photomask Making Co., Ltd., Shenzhen Qingyi Photomask, Ltd., SK-Electronics Co. Ltd., Taiwan Mask Corporation, and Toppan Electronics Products Co., Ltd. We also compete with semiconductor and FPD manufacturers captive photomask manufacturing operations, some of which market their photomask manufacturing services to outside customers. We expect to face continued competition from these and other suppliers in the future. Some of our competitors have substantially greater financial, sales, marketing, or other resources than we do. Also, when producing smaller geometry photomasks, some of our competitors may be able to more rapidly develop and produce such masks and achieve higher manufacturing yields than we can. We believe that consistency of product quality, timeliness of delivery, competitive pricing, technical capability and service are the principal factors considered by customers when selecting their photomask suppliers. Our inability to meet these competitive requirements could have a material adverse effect on our business and results of operations. In the past, competition has led to pressure to reduce prices and the need to invest in advanced manufacturing technology, which we believe contributed to the decrease in the number of independent photomask suppliers. These pressures may continue in the future.\nInvestment Related Risk Factors\nJoint ventures may not operate according to their business plans if our partners fail to fulfill their obligations, which may adversely affect our results of operations and compel us to dedicate additional resources to these joint ventures.\nThe nature of a joint venture requires us to share control in certain areas with unaffiliated third parties. If our joint venture partner does not fulfill its obligations, the affected joint venture may not be able to operate in accordance with its business plan. Under such a scenario, our results of operations may be adversely affected, and we may be compelled to increase the level of our resources devoted to the joint venture. Also, differing views among joint venture participants may result in delayed decisions, or failures to agree on major issues. If such differences caused a joint venture to deviate from its business plan, our results of operations could be adversely affected.\nOur operations in China expose us to substantial risks.\nIn 2019, we commenced operations at our two manufacturing facilities in China. These investments are subject to substantial risks which may include, but are not limited to: the inability to protect our intellectual property rights under Chinese law, which may not offer as high a level of protection as U.S. law; unexpectedly long negotiation periods with Chinese suppliers and customers; quality issues related to materials sourced from local vendors; limited access to electricity; unexpectedly high labor costs due to a tight labor supply; and difficulty in repatriating funds and selling or transferring assets. Our investments in China also exposed us to a significant additional foreign currency exchange risk, which we had not been subject to in prior years. In addition, as tensions have, from time to time, escalated between the U.S. and China, we believe there is an enhanced risk that our substantial investments in China may be subject to unforeseen restrictions, which may include expropriation of the investments by the Chinese government. These and other risks may result in our not realizing a return on, or losing some, or all, of our investments in China, which would have a material adverse effect on our financial condition and financial performance.\nWe may incur unforeseen charges related to possible future facility closures, restructurings, or forfeitures.\nWe cannot provide assurance that there will not be facility closures, restructurings, or forfeitures in the near or long term, nor can we assure that we will not incur significant charges should there be any future facility closures, restructurings or forfeitures.\nWe may not be able to consummate future acquisitions or joint ventures or integrate acquisitions into our business, which could result in unanticipated expenses and losses.\nAs part of our business growth strategy, we have acquired businesses and entered into joint ventures in the past, and we may pursue acquisitions and joint venture opportunities in the future. Our future efforts to grow the Company may include expanding into new or related markets or industries. Our ability to implement this component of our growth strategy may be limited by both our ability to identify appropriate acquisition or joint venture candidates and our financial resources, including our available cash and borrowing capacity. The expense incurred in consummating acquisitions or entering into joint ventures, the time it takes to integrate an acquisition, or our failure to integrate businesses successfully, could result in unanticipated expenses and losses. Furthermore, we may not be able to realize any of the anticipated benefits from acquisitions or joint ventures.\nThe process of integrating acquired operations into our existing operations may result in unforeseen operating difficulties, and may require significant financial resources that would otherwise be available for the ongoing development or expansion of existing operations. Some of the risks associated with the integration of acquisitions include: potential disruption of our ongoing business; distraction of management; unforeseen claims and liabilities, including unexpected environmental exposures; unforeseen adjustments, taxes, charges and write-offs; problems enforcing the indemnification obligations of sellers of businesses or joint venture partners for claims and liabilities; unexpected losses of customers of, or suppliers to, the acquired business; difficulty in conforming the acquired business standards, processes, procedures and controls with our operations; variability in financial performance arising from the implementation of acquisition accounting; inability to coordinate new product and process development; loss of senior managers and other critical personnel; problems with new labor unions; and challenges arising from the increased scope, geographic diversity, and complexity of our operations.\nOperations Related Risk Factors\nOur quarterly operating results fluctuate significantly and may continue to do so in the future.\nWe have experienced fluctuations in our quarterly operating results, and we anticipate that such fluctuations will continue and could intensify in the future. Fluctuations in operating results may result in volatility in the prices of our common stock and financial instruments linked to its value. Operating results may fluctuate as a result of many factors, including the size and timing of orders and shipments, the loss of significant customers, changes in product mix, the flow of customer design releases, technological change, fluctuations in manufacturing yields, the actions of our competitors, and general economic conditions. We operate in a high fixed-cost environment and, should our revenues and asset utilization decrease, our operating margins could be negatively impacted.\nOur customers generally order photomasks on an as-needed basis; thus, our revenue in any quarter is dependent primarily on orders received during that quarter. Since we operate with little backlog, and the rate of new orders may vary significantly from quarter to quarter, our capital expenditures and consequential expense levels are, to some extent, based primarily on sales forecasts and technological advancements in photomask manufacturing equipment. Consequently, if anticipated revenues in any quarter do not occur when expected, our capital investments could result in underutilized capacity and disproportionately high expense levels, causing operating results to be adversely affected. Due to the foregoing factors, we believe that quarter to quarter comparisons of our operating results cannot be relied upon as indicators of future performance. In addition, in future quarters, our operating results could be below guidance we may provide or the expectations of public market analysts and investors, which could have a material adverse effect on the market price of our common stock.\nOur substantial non-U.S. operations are subject to additional risks.\nRevenues from our non-U.S. operations were approximately 85%, 84% and 83% of our total revenues in 2022, 2021 and 2020, respectively. We believe that maintaining significant international operations requires us to have, among other things, a local presence in the geographic markets that we supply. This requires significant investments in financial, managerial, operational, and other resources. Since 1996, we have significantly expanded our operations in international markets by acquiring existing businesses in Europe and Asia, and building manufacturing facilities in Taiwan and China. In order to enable us to optimize our investments and other resources, we closely monitor the semiconductor and FPD manufacturing markets for indications of geographic movement and, in conjunction with these efforts, continue to assess the locations of our manufacturing facilities. These assessments could result in the opening of additional facilities or closing of our current facilities.\nOperations outside of the United States are subject to inherent risks, including: fluctuations in currency exchange rates; unstable political and economic conditions in various countries; changes in economic alliances; unexpected changes in regulatory requirements including import and export regulations; compliance with a variety of burdensome foreign laws and regulations; compliance with anti-bribery and anti-corruption laws (such as the Foreign Corrupt Practices Act); tariffs and other trade barriers; difficulties in staffing and managing international operations; and longer accounts receivable collection cycles. In addition: foreign countries may enact other restrictions on foreign trade or investment, including: currency exchange controls; trade sanctions which result in our losing access to customers and suppliers; legislation which renders agreements to be difficult to enforce; impositions on the movement of funds or other assets; or we may be subject to adverse tax consequences. These factors may have a material adverse effect on our costs or our ability to generate revenues outside of the United States and, consequently, on our business and results of operations.\nWe could be subject to damages based on claims brought against us by our customers, or lose customers as a result of the failure of our products to meet certain quality specifications.\nOur products provide important performance attributes for our customers products. If a product fails to perform in a manner consistent with quality specifications, or has a shorter useful life than warrantied, a customer could seek replacement of the product or damages for costs incurred as a result of the product failing to perform, particularly if such products are sold under agreements that contain limited performance and life cycle warranties. Our customers often require us to guarantee that our products conform to certain product specifications that they provide. Any failure to comply with such specifications could result in claims or legal action. A successful claim, or series of claims, against us could have a material adverse effect on our financial condition and results of operations and could result in a loss of one or more customers.\nWe face risks associated with the use of sophisticated equipment and complex manufacturing processes and technologies. Our inability to effectively utilize such equipment and technologies and perform such processes could have a material adverse effect on our business and results of operations.\nOur complex manufacturing processes require the use of expensive and technologically sophisticated equipment and materials, and are continually modified in an effort to improve manufacturing yields and product quality. Minute impurities, defects, or other difficulties in the manufacturing process can lower manufacturing yields and render products unmarketable. Moreover, the manufacture of leading-edge photomasks is more complex and time consuming than manufacturing less advanced photomasks, and their fabrication may result in delays in the manufacture of all levels of photomasks. We have, on occasion, experienced manufacturing difficulties and capacity limitations that have delayed our ability to deliver products within the time frames contracted for by our customers. We cannot provide assurance that we will not experience these or other manufacturing difficulties, or be subject to increased costs, which could result in a loss of customers or otherwise have a material adverse effect on our business and results of operations.\nWe have a high level of fixed costs.\nBecause of the capital-intensive nature of the photomask manufacturing business, we have a high level of fixed costs and a high degree of operating leverage. Accordingly, should our sales volumes decline as a result of a decrease in design releases from our customers or for any other reason, we may have excess or underutilized production capacity which could significantly impact our operating margins or result in write-offs from asset impairments.\nRegulatory Related Risk Factors\nCOVID-19 vaccination mandates could adversely affect our ability to attract and maintain employees.\nIn response to COVID-19, we implemented significant changes that we determined were in the best interest of our employees and which complied with government orders in all the states and countries where we operate. For U.S. employees we require vaccination but may change this policy at any time.\nAdditional taxes could adversely affect our financial results.\nOur tax filings are subject to audits by tax authorities in the various jurisdictions in which we do business. These audits may result in assessments of additional taxes that are subsequently resolved with the taxing authorities or through the courts. Currently, we believe there are no outstanding assessments whose resolution would result in a material adverse financial result. However, we cannot offer assurances that unasserted or potential future assessments would not have a material adverse effect on our financial condition or results of operations.\nOn August 16, 2022, the Inflation Reduction Act (IRA) was enacted in the U.S. Among other provisions, the IRA included a new fifteen percent Corporate Alternative Minimum Tax (CAMT) and a one percent excise tax on corporate share repurchases. The CAMT, which we are not currently subject to, is effective for tax years beginning on or after January 1, 2023. The one percent excise tax on share repurchases applies to shares repurchased after December 31, 2022, and excludes repurchases under $1 million. We do not anticipate that the IRA will have a material effect on our financial performance.\nOur products and technology could be subject to U.S. export control laws and the export control laws of the foreign jurisdictions where we operate.\nWe are subject to various laws relating to the export of products we manufacture, and the technology related thereto, and our failure to comply with these laws could subject us to substantial fines, penalties, and even injunctions, the imposition of which could have a material adverse effect on the success of our business.\nCertain of our products are or could be subject to the Export Administration Regulations (EAR) if they are manufactured in the U.S., or based on U.S. technology, or contain more than a de minimis amount of controlled U.S. content. The EAR could prohibit the export of certain products out of the US or could prohibit our foreign sites from manufacturing or delivering photomasks to certain restricted entities. Additionally, the Company has a large, global business with sales outside the U.S. representing a majority of the Companys total net sales, and the Company believes that it generally benefits from growth in international trade. However, trade policies and disputes and other international conflicts can result in tariffs, sanctions and other measures that restrict international trade, and can materially adversely affect the Companys business, particularly if these measures occur in regions where the Company derives a significant portion of its revenues.\nBased on the complex relationships between the United States and certain foreign countries including, but not limited to China, there is inherent risk that political, diplomatic and national security influences might lead to trade disputes, impacts and/or disruptions to our operations or our ability to sell our photomasks. The United States and other countries have imposed and may continue to impose trade restrictions and have also levied tariffs and taxes on certain goods and imposed export restrictions. Increases in tariffs, additional taxes or other trade restrictions and retaliatory measures may increasingly impact customer demand and customer investment in manufacturing equipment, increase our manufacturing costs, decrease margins, reduce the competitiveness of our products, or inhibit our ability to sell, export products or purchase necessary equipment and supplies, which could have a material adverse effect on our business, results of operations, or financial condition.\nWe may be unprepared for changes to environmental laws and regulations and may incur liabilities arising from environmental matters.\nWe are subject to numerous environmental laws and regulations that impose various environmental controls on, among other things, the discharge of pollutants into the air and water and the handling, use, storage, disposal, and cleanup of solid and hazardous wastes. Changes in these laws and regulations may have a material adverse effect on our financial position and results of operations, and inadequate compliance with their requirements could give rise to significant liabilities.\nIf we violate environmental, health or safety laws or regulations, in addition to being required to correct such violations, we can be held liable in administrative, civil, or criminal proceedings, and substantial fines and other sanctions could be imposed that could disrupt or limit our operations. Liabilities associated with the investigation and cleanup of hazardous substances, as well as personal injury, property damages or natural resource damages arising from the release of, or exposure to, such hazardous substances, may be imposed in many situations without regard to violations of laws or regulations or other fault, and may also be imposed jointly and severally (so that a responsible party may be held liable for more than its share of the losses involved, or even the entire loss). Such liabilities may also be imposed on many different entities with a relationship to the hazardous substances at issue, including, for example, entities that formerly owned or operated the property affected by the hazardous substances and entities that arranged for the disposal of the hazardous substances at the affected property, as well as entities that currently own or operate such property. The nature of our business, including historical operations at our current and former facilities, exposes us to risks of liability under these laws and regulations due to the production, storage, use, transportation and sale of materials that can cause contamination or personal injury if released into the environment. Additional information may arise in the future concerning the nature or extent of our liability with respect to identified sites and additional sites that may be identified, for which we are alleged to be liable.\nGeneral Risk Factors\nIneffective internal controls could impact our business and operating results.\nOur internal controls over financial reporting may not prevent or detect misstatements because of their inherent limitations in detecting human errors, the circumvention or overriding of controls, or fraud; even effective internal controls can provide only reasonable assurance with respect to the preparation and fair presentation of financial statements. If we: fail to maintain the adequacy of our internal controls, including any failure to implement required new or improved controls; otherwise fail to prevent financial reporting misstatements; or experience difficulties in implementing internal controls, our business and operating results could be adversely impacted, and we could fail to meet our financial reporting obligations.\nOur business could be adversely impacted by global or regional catastrophic events.\nOur business could be materially, adversely affected by terrorist acts, widespread outbreaks of infectious diseases (such as COVID-19), government responses emplaced to limit the impact of infectious diseases (such as shelter-in-place directives), or the outbreak or escalation of wars including, but not limited to, the invasion of Ukraine by the Russian Federation. Such events in the geographic regions in which we do business, including escalations of political tensions and military conflicts in the U.S., Europe, the Republic of South Korea, the Peoples Republic of China, or the Republic of China (Taiwan), and any governmental sanctions enacted in reaction thereto, could result in a global energy crisis, economic inflation, supply-chain disruptions, or the confiscation or destruction of our facilities; all and any of these outcomes could have material, adverse impacts on our results of operations, financial condition, and cash flows.\nOur production facilities could be damaged or disrupted by natural or manmade disasters or labor strikes, either of which could adversely affect our financial position, results of operations, and cash flows.\nA major catastrophe, such as an earthquake, flood, fire, or other disaster, labor strike, or work stoppage at any of our manufacturing facilities, or a manufacturing facility of our suppliers or customers, could result in a prolonged interruption of our business. A disruption resulting from any one of these events could cause significant delays in shipments of our products and the loss of revenue and customers, which could have a material adverse effect on our financial position, results of operations, and cash flows. Our facilities in Taiwan are located in a seismically-active area.\nOur sales can be impacted by the health and stability of the general economy, which could adversely affect our results of operations and cash flows.\nUnfavorable general economic conditions in the U.S. or other countries in which we or our customers conduct business may have the effect of reducing the demand for photomasks. Economic downturns may lead to a decrease in demand for end products whose manufacturing processes involve the use of photomasks, which may result in a reduction in new product design and development by semiconductor or FPD manufacturers and adversely affect our results of operations and cash flows.\nTechnology failures or cyber security breaches could have a material adverse effect on our operations.\nWe rely on information technology systems to process, transmit, store, and protect electronic information. For example, a significant portion of the communications between our personnel, customers, and suppliers depends on information technology. Our information technology systems may be vulnerable to a variety of interruptions due to events beyond our control, including, but not limited to, natural disasters, terrorist attacks, telecommunications failures, computer viruses, hackers, and other security issues. Although we have technology and information security processes and disaster recovery plans in place to mitigate our risks to these vulnerabilities, these measures may not be adequate to ensure that our operations will not be disrupted, should such an event occur.\nThe General Data Protection Regulation (GDPR), which went into effect in the European Union (EU) on May 25, 2018, applies to the collection, use, retention, security, processing, and transfer of personally identifiable information of residents of E.U. countries. The GDPR created a range of new compliance obligations and imposes significant fines and sanctions for violations. It is possible that the GDPR may be interpreted or applied in a manner that is adverse to, or unforeseen by us, including requirements that are inconsistent with our practices, or that we may otherwise fail to construe its requirements in ways that are satisfactory to the E.U. authorities. Upon leaving the E.U. on January 31, 2021, the U.K. enacted a new domestic data privacy law called the U.K. - General Data Protection Regulation (UK-GDPR). Although somewhat less restrictive than the GDPR, the UK-GDPR is similar to the GDPR with respect to both an entitys obligation to protect personal information and the imposition of significant fines for violations.\nAny failure, or perceived failure, by us to comply with the GDPR or the UK-GDPR, or with any applicable regulatory requirements or orders, including, but not limited to privacy, data protection, information security, or consumer protection related privacy laws and regulations, in one or more jurisdictions within the E.U., the U.K. or elsewhere, could: result in proceedings or actions against us by governmental entities or individuals; subject us to significant fines, penalties, and/or judgments; require us to change our business practices; limit access to our products and services in certain countries, or otherwise adversely affect our business, as we would be at risk to lose both customers and revenue, and incur substantial costs.\nWe may, in the future, incur net losses.\nAlthough the Company has been profitable since fiscal 2010, it has, in the past, incurred net losses. We cannot provide assurance that the Company will not incur net losses in the future.\nMarket Related Risk Factors\nChanges in foreign currency exchange rates could have a material adverse effect on our results of operations, financial condition, or cash flows.\nOur consolidated financial statements are prepared in accordance with U.S. GAAP and are reported in U.S. dollars. Our operations have transactions and balances denominated in currencies other than the U.S. dollar; primarily the South Korean won, New Taiwan dollar, Japanese yen, Chinese renminbi, euro, Singapore dollar, and the British pound sterling. In 2022, we recorded a net gain from changes in foreign currency exchange rates of $27.3 million in our consolidated statement of income, while our net assets decreased by $151.2 million as a result of the translation of foreign currency financial statements to U.S. dollars. Significant foreign currency fluctuations may adversely affect our results of operations, financial condition, or cash flows.\nOur hedging activity could negatively impact our results of operations and cash flows.\nWe may enter into derivatives to manage our exposures to interest rate and currency movements. If we do not accurately forecast our results of operations, execute contracts that do not effectively mitigate our economic exposures to interest rates and currency rates, elect to not apply hedge accounting (when doing so would have mitigated our losses), or fail to comply with the complex accounting requirements for hedging transactions, our results of operations and cash flows could be volatile, as well as negatively impacted.\nThe market price of our common stock is subject to volatility and could fluctuate widely in response to various factors, many of which are beyond our control.\nFactors that may influence the price of our common stock include, but are not limited to, the following:\nloss of any of our key customers or suppliers;\nadditions or departures of key personnel;\nthird party sales of common stock;\nshort interest in our common stock;\nour ability to execute our business plan, including but not limited to, our expansion into China;\nannouncements and consummations of business acquisitions;\noperating results that fall below or exceed expectations;\nannouncements of forecasted earnings or material transactions;\nissuances or repurchases of our common stock;\nintellectual property disputes;\nreputational damage suffered with or without merit;\nindustry developments;\nnews about or disclosures made by our competitors or customers;\nbusiness combinations, divestitures, or bankruptcies by customers, suppliers, or competitors;\neconomic and other external factors including (but not limited to) inflation, recessions, natural disasters, military actions, political instability, or social unrest; and\nperiod to period fluctuations in our financial results.\nIn addition, securities markets have from time-to-time experienced significant price and volume fluctuations that are unrelated to the operating performance of particular companies. These market fluctuations may also materially and adversely affect the market price of our common stock. Such fluctuations may be the result of imbalances between buy and sell offers, the actions of quantitative or algorithmic stock traders and short-sellers, or low trading volume which can magnify the effects of a small number of transactions on the price of a stock.\nWe operate in a global, competitive environment which gives rise to operating and market risk exposure.\nWe sell our products in a competitive, global environment, and compete worldwide for sales on the basis of product quality, price, technology, and customer service. Sales of our products are also subject to federal, state, local, and foreign taxes, laws and regulations, trade agreements, import and export controls, duties, and tariffs. The imposition of additional regulations or controls including export controls, duties, tariffs, or changes to bilateral and regional trade agreements, could negatively impact our results of operations. ITEM 1B.\nUNRESOLVED STAFF COMMENTS\nNone. ITEM 2.\nPROPERTIES\nThe following table presents certain information about the Companys photomask manufacturing facilities:\nLocation\nType of\nInterest\nAllen, Texas\nOwned\nBoise, Idaho\nOwned\nBrookfield, Connecticut\nOwned\nBridgend, Wales\nLeased\nCheonan, Korea\nOwned\nHefei, China\nOwned (1)\nDresden, Germany\nLeased\nHsinchu, Taiwan\nOwned (1)\nHsinchu, Taiwan\nLeased\nTaichung, Taiwan\nOwned (1)\nXiamen, China\nOwned (1)\n(1) We own our manufacturing facilities in Hefei, Taichung, Xiamen, and one of our manufacturing facilities in Hsinchu. However, we lease the related land at these sites. We believe our facilities, with planned expansions, are adequate to support our current and near-term requirements. ITEM 3.\nLEGAL PROCEEDINGS\nPlease refer to Note 13 to our consolidated financial statements in Part II, Item 8 of this report for information on legal proceedings involving the Company. ITEM 4.\nMINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5.\nMARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is traded on the NASDAQ Global Select Market (NASDAQ) under the symbol PLAB. On December 15, 2022, the closing sale price of our common stock, per the NASDAQ Global Select Market, was $17.35. Based on available information, we have 238 registered shareholders.\nTo date, we have not paid any cash dividends on Photronics shares, and, for the foreseeable future, we anticipate that earnings will continue to be retained for use in our business. Further, our credit agreement limits the amount that can be paid as cash dividends on Photronics stock.\nIn September 2020, the Companys board of directors authorized the repurchase of up to $100 million of its common stock, pursuant to a repurchase plan under Rule 10b5-1 of the Securities Act. Share repurchases under this authorization commenced on September 16, 2020. In 2022, we repurchased 0.2 million shares at a cost of $2.5 million (an average of $13.43 per share) and, since the programs inception, we repurchased 5.8 million shares at a cost of $68.3 million (an average of $11.70 per share). All shares repurchased under the program have been retired.\nThe table below presents share repurchase activity during the fourth quarter of 2022 as part of the repurchase program described above as well as shares repurchased in connection with the payment of withholding taxes related to the vesting of restricted stock awards.\nTotal Number of\nShares Purchased\nAverage Price\nPaid\nPer share\nTotal Number of Shares\nPurchased as Part of\nPublicly Announced\nProgram\nDollar Value of\nShares That May\nYet Be Purchased\n(in millions)\nAugust 1, 2022 - August 28, 2022\n$\n0.00\n$\n31.7\nAugust 29, 2022 - September 25, 2022\n$\n0.00\n$\n31.7\nSeptember 26, 2022 - October 31, 2022\n$\n16.16\n$\n31.7\nTotal\nSecurities authorized for issuance under equity compensation plans\nThe information regarding our equity compensation required to be disclosed by Item 201(d) of Regulation S-K is incorporated by reference from the Photronics, Inc. 2023 Definitive Proxy Statement in Item 12 of Part III of this report. The 2023 Definitive Proxy Statement will be filed within 120 days after our fiscal year ended October 31, 2022. ITEM 6.\n[RESERVED] ITEM 7.\nMANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nWe sell substantially all of our photomasks to semiconductor designers and manufacturers, and manufacturers of FPDs. Photomask technology is also being applied to the fabrication of other higher-performance electronic products such as photonics, micro-electronic mechanical systems, and certain nanotechnology applications. Our selling cycle is tightly interwoven with the development and release of new semiconductor and display designs and applications, particularly as they relate to the semiconductor industrys migration to more advanced product innovation, design methodologies, and fabrication processes. The demand for photomasks primarily depends on design activity rather than sales volumes from products manufactured using photomask technologies. Consequently, an increase in semiconductor or display sales does not necessarily result in a corresponding increase in photomask sales. However, the reduced use of application-specific ICs, reductions in design complexities, other changes in the technology or methods of manufacturing or designing semiconductors, or a slowdown in the introduction of new semiconductor or display designs could reduce demand for photomasks - even if the demand for semiconductors and FPDs increases. Advances in semiconductor, display, and photomask design and production methods that shift the burden of achieving device performance away from lithography could also reduce the demand for photomasks. Historically, the microelectronics industry has been volatile, experiencing periodic downturns and slowdowns in design activity. These negative trends have been characterized by, among other things, diminished product demand, excess production capacity, and accelerated erosion of selling prices with a concomitant effect on revenue and profitability.\nWe are typically required to fulfill customer orders within a short period of time, sometimes within twenty-four hours. This results in a minimal level of backlog orders, typically one to two weeks of backlog for IC photomasks and two to three weeks of backlog for FPD photomasks. However, the demand for some IC photomasks has recently expanded beyond the industrys capacity to supply them within the traditional time period; thus, for some products, our backlog can expand to as long as two to three months.\nThe global semiconductor and FPD industries are driven by end markets which have been closely tied to consumer-driven applications of high-performance devices, including, but not limited to, mobile display devices, mobile communications, and computing solutions. While we cannot predict the timing of the industrys transition to volume production of next-generation technology nodes, or the timing of up and down-cycles with precise accuracy, we believe that such transitions and cycles will continue into the future, beneficially and adversely affecting our business, financial condition, and operating results as they occur. We believe our ability to remain successful in these environments is dependent upon the achievement of our goals of being a service and technology leader and efficient solutions supplier, which we believe should enable us to continually reinvest in our global infrastructure.\nWe are focused on improving our competitiveness by advancing our technology and reducing costs and, in connection therewith, have invested and plan to continue to invest in manufacturing equipment to serve both the high-end photomask and trailing-edge markets. As we face challenges that require us to make significant improvements in our competitiveness, we continue to evaluate further cost reduction initiatives.\nState-of-the-art production for semiconductor masks is considered to be 28 nanometer and smaller for ICs and Generation 10.5+ and AMOLED and LTPS display-based process technologies for FPDs. However, 32 nanometer and above geometries for semiconductors and Generation 8 and below (excluding AMOLED and LTPS) process technologies for displays constitute the majority of designs currently being fabricated in volume. At these geometries, we can produce full lines of photomasks, and there is no significant technology employed by our competitors that is not available to us. We expect advanced-generation designs to continue to move to production throughout fiscal 2023, and we believe we are well positioned to service an increasing volume of this business as a result of our investments in manufacturing processes and technology in the regions where our customers are located.\nThe photomask industry has been, and is expected to continue to be characterized by technological change and evolving industry standards. In order to remain competitive, we will be required to continually anticipate, respond to, and utilize changing technologies. In particular, we believe that, as semiconductor geometries continue to become smaller, and display designs become larger or otherwise more advanced, we will be required to manufacture even more complex optically-enhanced reticles, including optical proximity correction and phase-shift photomasks. Additionally, demand for photomasks has been, and could in the future be, adversely affected by changes in high-performance electronics fabrication methods that affect the type or quantity of photomasks used, such as changes in semiconductor demand that favor field-programmable gate arrays and other semiconductor designs that replace application-specific ICs, or the use of certain chip-stacking methodologies that lessen the emphasis on conventional lithography technology. Furthermore, increased market acceptance of alternative methods of transferring circuit designs onto semiconductor wafers could reduce or eliminate the need for photomasks in the production of semiconductors. As of the end of 2022, one alternative method, direct-write lithography, has not been proven to be a commercially viable alternative to photomasks, as it is considered to be too slow for high-volume semiconductor wafer production, and we have not experienced a significant loss of revenue as a result of this or other alternative semiconductor design methodologies. However, should direct-write lithography or any other alternative method of transferring IC designs to semiconductor wafers without the use of photomasks achieve market acceptance, and we do not anticipate, respond to, or utilize these or other changing technologies due to resource, technological, or other constraints, our business and results of operations could be materially adversely affected.\nBoth our revenues and costs have been affected by the increased demand for high-end-technology photomasks that require more advanced manufacturing capabilities, but generally command higher ASPs. Our capital expenditure payments were $112.3 million, $109.1 million and $70.8 million in 2022, 2021 and 2020, respectively, and the depreciation on these investments has significantly contributed to our cost of goods sold. Nonetheless, we intend to continue to make the required investments to support the technological demands of our customers that we believe will position us for future growth. In support of this effort, we expect capital expenditure payments to be approximately $130 million in fiscal year 2023.\nThe manufacture of photomasks for use in fabricating ICs, FPDs, and other related products built using comparable photomask-based process technologies has been, and continues to be, capital intensive. Our employees and our integrated global manufacturing network represent a significant portion of our fixed operating cost base. Should our revenue decrease as a result of a decrease in design releases from our customers, we may have excess or underutilized production capacity, which could significantly impact our operating margins, or result in write-offs from asset impairments.\nRecent Developments\nIn the second quarter of 2021, under an MLA which we entered into effective October 2020, we entered into a five-year $7.2 million finance lease for a high-end inspection tool. Monthly payments on the lease, which commenced in February 2021, are $0.1 million per month. Upon the payment of the fiftieth monthly payment and prior to payment of the fifty-first monthly payment, we may exercise an early buyout option to purchase the tool for $2.4 million. If we do not exercise the early buyout option, then at the end of the five-year lease term, the lease shall continue to renew on a month-to-month basis at the same rental terms; at our option, after the original term or any renewal periods, we may return the tool, elect to extend the lease, or purchase the tool at its fair market value. Since we are reasonably certain that we will exercise the early buyout option, our lease liability reflects such exercise and we have classified the lease as a finance lease. The interest rate implicit in the lease is 1.08%.\nIn the first quarter of 2021, under an MLA which we entered into effective July 2019, we entered into a five-year $35.5 million finance lease for a high-end lithography tool. Monthly payments on the lease, which commenced in January 2021, increased from $0.04 million after the first three months to $0.6 million for the following nine months, followed by forty-eight monthly payments of $0.5 million. As of the due date of the forty-eighth monthly payment, we may exercise an early buyout option to purchase the tool for $14.1 million. If we do not exercise the early buyout option, then at the end of the five-year lease term, at our option, we may return the tool, elect to extend the lease term for a period and a lease payment to be agreed with lessor at the time, or purchase the tool for its then-fair market value as determined by the lessor. Since we are reasonably certain that we will exercise the early buyout option, our lease liability reflects such exercise and we have classified the lease as a finance lease. The interest rate implicit in the lease is 1.58%. The lease agreement incorporates the covenants included in our Corporate Credit Agreement, which are detailed in Note 6 to our consolidated financial statements in Part II, Item 8 of this report, and includes a cross-default provision for any agreement or instrument with an outstanding, committed balance greater than $5.0 million in which we are the indebted party.\nIn the fourth quarter of 2020, we entered into a MLA with a financing entity for the lease of an inspection tool with a maximum value of $10 million. The tool was delivered during the fourth quarter of 2020, and the financing entity made a progress payment to the vendor of $6.5 million in the first quarter of 2021. The progress payment accrued interest at 1.56% payable monthly until the final payment for the tool was made in the second quarter of 2021, at which point the $7.2 million lease described above began.\nIn the fourth quarter of 2020, our Hefei, China, facility was approved to borrow 200 million RMB from the China Construction Bank Corporation. This credit facility was subject to annual reviews and extension; the most recent extension allowing us to borrow additional funds was expired in August 2022. The loan proceeds were used to fund purchases of two lithography tools at the Hefei facility. As of October 31, 2021, we had borrowed 135.7 million RMB ($21.2 million) against this approval (all of which was then outstanding), and 64.3 million RMB ($10.1 million) remained available to borrow; we repaid the entire outstanding balance in 2022, and did not apply to extend the agreement. The interest rate on the loan was variable and based on the RMB Loan Prime Rate of the National Interbank Funding Center. The borrowings were secured by the Hefei facility, its related land use right, and certain manufacturing equipment. The Hefei Equipment Loan was subject to covenants and provisions, certain of which relate to the assets pledged as security for the loan, including covenants for the ratio of total liabilities to total assets and the ratio of current assets to current liabilities, all of which we were in compliance with at the time of our repayment.\nIn the fourth quarter of 2020, the Companys board of directors authorized the repurchase of up to $100 million of its common stock, pursuant to a repurchase plan under Rule 10b5-1 of the Securities Act. Through October 31, 2022, we had repurchased 5.8 million shares at a cost of $68.3 million (an average price of $11.70 per share) under this authorization. All shares repurchased under the program have been retired. On August 16, 2022, the Inflation Reduction Act (IRA) was enacted in the U.S. Among other provisions, the IRA included a one percent excise tax on corporate share repurchases. The one percent excise tax on share repurchases applies to shares repurchased after December 31, 2022, and excludes repurchases under $1 million. We do not anticipate that the IRA will have a material effect on our financial performance.\nIn the first quarter of 2020, we acquired the remaining 0.2% of noncontrolling interests in Photronics Cheonan, Ltd. for $0.6 million.\nIn the first quarter of 2020, we adopted ASU 2016-02 and all subsequent amendments, collectively codified in Accounting Standards Codification Topic 842 - Leases (Topic 842). This guidance requires modified retrospective adoption, either at the beginning of the earliest period presented or at the beginning of the period of adoption; we elected to apply the guidance at the beginning of the period of adoption, and recognized right-of-use leased assets of approximately $6.5 million, and corresponding lease liabilities, which were discounted at our incremental borrowing rates, on our November 1, 2019, consolidated balance sheet to reflect our adoption of the guidance. Our adoption of Topic 842 did not affect our cash flows or our ability to comply with covenants under our credit agreements.\nResults of Operations\nThe following tables present selected operating information expressed as a percentage of revenue. The columns may not foot due to rounding.\nThree Months Ended\nOctober 31,\nJuly 31,\nOctober 31,\nRevenue\n100.0\n%\n100.0\n%\n100.0\n%\nCost of goods sold\n61.8\n61.9\n71.3\nGross profit\n38.2\n38.1\n28.7\nSelling, general and administrative expenses\n7.5\n7.3\n7.9\nResearch and development expenses\n1.9\n1.9\n2.3\nOperating income\n28.8\n29.0\n18.5\nNon-operating income (expense), net\n5.1\n1.7\n2.1\nIncome before income tax provision\n33.9\n30.6\n20.6\nIncome tax provision\n7.6\n8.3\n4.8\nNet income\n26.3\n22.4\n15.8\nNet income attributable to noncontrolling interests\n8.7\n8.2\n4.9\nNet income attributable to Photronics, Inc. shareholders\n17.6\n%\n14.2\n%\n10.9\n%\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nRevenue\n100.0\n%\n100.0\n%\n100.0\n%\nCost of goods sold\n64.3\n74.8\n77.9\nGross profit\n35.7\n25.2\n22.1\nSelling, general and administrative expenses\n7.8\n8.7\n8.8\nResearch and development expenses\n2.2\n2.8\n2.8\nOther operating income, net\n0.0\n0.5\n-\nOperating income\n25.7\n14.2\n10.5\nNon-operating income (expense), net\n3.3\n1.1\n(0.4\n)\nIncome before income tax provision\n29.0\n15.4\n10.1\nIncome tax provision\n7.3\n3.5\n3.5\nNet income\n21.7\n11.9\n6.6\nNet income attributable to noncontrolling interests\n7.3\n3.5\n1.1\nNet income attributable to Photronics, Inc. shareholders\n14.4\n%\n8.4\n%\n5.5\n%\nNote: All the following tabular comparisons, unless otherwise indicated, are for the three months ended October 31, 2022 (Q4 FY22), July 31, 2022 (Q3 FY22) and October 31, 2021 (Q4 FY21), and for the fiscal years ended October 31, 2022 (FY22) and October 31, 2021 (FY21). Please refer to Part II, Item 7 of our 2021 Form 10-K for comparative discussion of our fiscal years ended October 31, 2021, and October 31, 2020. The tables in this item may not foot due to rounding.\nRevenue\nOur quarterly revenues can be affected by the seasonal purchasing practices of our customers. As a result, demand for our products is typically reduced during the first quarter of our fiscal year by the North American, European, and Asian holiday periods, as some of our customers reduce their development and, consequently, their buying activities during those periods.\nThe following tables present changes in revenue disaggregated by product type and geographic origin, in Q4 FY22 and FY22 from revenue in prior reporting periods.\nQuarterly Changes in Revenue by Product Type\nQ4 FY22 compared to Q3 FY22\nQ4 FY22 compared to Q4 FY21\nRevenue in\nQ4 FY22\nIncrease\n(Decrease)\nPercent\nChange\nIncrease\n(Decrease)\nPercent\nChange\nIC\nHigh-end*\n$\n44.3\n$\n(8.3\n)\n(15.8\n)%\n$\n1.8\n4.1\n%\nMainstream\n111.9\n3.3\n3.0\n%\n29.0\n35.0\n%\nTotal IC\n$\n156.2\n$\n(5.0\n)\n(3.1\n)%\n$\n30.8\n24.5\n%\nFPD\nHigh-end*\n$\n43.4\n$\n(7.3\n)\n(14.4\n)%\n$\n2.4\n5.9\n%\nMainstream\n10.6\n2.6\n33.0\n%\n(4.2\n)\n(28.3\n)%\nTotal FPD\n$\n54.1\n$\n(4.6\n)\n(7.9\n)%\n$\n(1.8\n)\n(3.2\n)%\nTotal Revenue\n$\n210.3\n$\n(9.7\n)\n(4.4\n)%\n$\n29.0\n16.0\n%\n* High-end photomasks typically have higher ASPs than mainstream products.\nQuarterly Changes in Revenue by Geographic Origin**\nQ4 FY22 compared to Q3 FY22\nQ4 FY22 compared to Q4 FY21\nRevenue in\nQ4 FY22\nIncrease\n(Decrease)\nPercent\nChange\nIncrease\n(Decrease)\nPercent\nChange\nTaiwan\n$\n76.3\n$\n(1.1\n)\n(1.4\n)%\n$\n7.1\n10.3\n%\nChina\n52.4\n(8.1\n)\n(13.4\n)%\n14.1\n36.7\n%\nKorea\n38.0\n0.1\n0.2\n%\n0.2\n0.4\n%\nUnited States\n34.0\n(0.7\n)\n(1.9\n)%\n7.4\n28.0\n%\nEurope\n9.0\n0.1\n1.3\n%\n0.1\n0.9\n%\nOther\n0.5\n0.0\n2.3\n%\n0.1\n21.9\n%\nTotal revenue\n$\n210.3\n$\n(9.7\n)\n(4.4\n)%\n$\n29.0\n16.0\n%\n** This table disaggregates revenue by the location in which it was earned.\nRevenue in Q4 FY22 of $210.3 million represented a decrease of 4.4% compared with Q3 FY22, and an increase of 16.0% from Q4 FY21.\nOverall IC revenue decreased 3.1% from Q3 FY22 due to lower high-end foundry and logic demand in Asia, but increased 24.5% from the prior year quarter. IC mainstream growth continued in Q4 FY22, increasing 3.0% from Q3 FY22, and 35.0% from Q4 FY21, due to continued growth in demand and favorable pricing on photomasks used to produce semiconductors required to make or support consumer products, the internet-of-things, 5G wireless technology, and cryptocurrency mining.\nFPD revenue decreased 7.9% and 3.2% in Q4 FY22, compared, respectively, with Q3 FY22 and Q4 FY21. The decreases were caused by weakened demand from Q322 for high-end large-area masks used for mobile displays and G10.5+ masks used for ultra-large screen televisions. Revenue from mainstream products increased 33.0% from Q3 FY22, as capacity became available from the decreased demand for high-end products.\nYear-over-Year Changes in Revenue by Product Type\nFY22 compared to FY21\nRevenue in FY22\nIncrease (Decrease)\nPercent\nChange\nIC\nHigh-end*\n$\n195.3\n$\n32.4\n19.9\n%\nMainstream\n397.7\n100.5\n33.8\n%\nTotal IC\n$\n593.0\n$\n132.9\n28.9\n%\nFPD\nHigh-end*\n$\n187.0\n$\n31.3\n20.1\n%\nMainstream\n44.5\n(3.4\n)\n(7.1\n)%\nTotal FPD\n$\n231.5\n$\n27.9\n13.7\n%\nTotal Revenue\n$\n824.5\n$\n160.8\n24.2\n%\n* High-end photomasks typically have higher ASPs than mainstream photomasks.\nYear-over-Year Changes in Revenue by Geographic Origin**\nFY22 compared to FY21\nRevenue in\nFY22\nIncrease\n(Decrease)\nPercent\nChange\nTaiwan\n$\n291.3\n$\n42.7\n17.2\n%\nChina\n212.6\n96.9\n83.7\n%\nKorea\n156.1\n(0.3\n)\n(0.2\n)%\nUnited States\n126.2\n21.2\n20.2\n%\nEurope\n36.4\n0.2\n0.4\n%\nOther\n1.9\n0.1\n4.9\n%\nTotal Revenue\n$\n824.5\n$\n160.8\n24.2\n%\n** This table disaggregates revenue by the location in which it was earned.\nRevenue in YTD FY22 of $824.5 million surpassed our prior record revenue set in YTD FY21 by $160.8 million, or 24.2%. IC revenue increased by 28.9%, due to strong demand for both high-end and mainstream photomasks and improved pricing for mainstream products and products at the most advanced node levels. FPD revenue increased by 13.7%, driven by a 20.1% increase in revenue from high-end products, which was driven by increased demand and better pricing for AMOLED products used in mobile displays and increased demand for G10.5+ large area masks used for ultra-large televisions.\nGross Margin\nPercent Change\nQ4 FY22\nQ3 FY22\nQ4 FY21\nQ4 FY22\nfrom\nQ3 FY22\nQ4 FY22\nfrom\nQ4 FY21\nGross profit\n$\n80.3\n$\n83.9\n$\n51.9\n(4.3\n)%\n54.5\n%\nGross margin\n38.2\n%\n38.1\n%\n28.7\n%\nGross margin was 38.2% for Q4 FY22, representing a slight increase from the Q3 FY22 gross margin of 38.1%, as decreased revenue of 4.4% was offset by decreased material costs which fell 7.7%, or 80 basis points as a percentage of revenue. Labor costs increased 5.2%, or 100 basis points as a percentage of revenue, due to increased costs in some locations. Equipment and other overhead costs decreased 5.3%, or 30 basis points as a percentage of revenue, with lower outsourced manufacturing costs, partially offset by increased equipment maintenance costs, most significantly contributing to the net cost decrease.\nGross margin increased by 9.5 percentage points in Q4 FY22, from Q4 FY21, primarily as a result of the increase in revenue from the prior year quarter, together with 1.6% decrease in material costs from the prior year quarter. Labor costs increased 21.8% from the prior year quarter, or 50 basis points as a percentage of revenue, primarily due to increased costs in some locations. Equipment and other overhead costs decreased 4.9%, or 580 basis points, as a percentage of revenue. Decreased depreciation expense and outsourced manufacturing costs, which were partially offset by increased equipment maintenance costs, were the primary contributors to the overall decrease.\nFY22\nFY21\nPercent Change\nFY22 from FY21\nGross profit\n$\n294.2\n$\n167.0\n76.1\n%\nGross margin\n35.7\n%\n25.2\n%\nGross margin increased by 10.5 percentage points in FY22, from FY21, primarily as a result of the increase in revenue from the prior year period, offset somewhat by the following net cost increases: Material costs increased 7.9% from the prior year period, but decreased 380 basis points as a percentage of revenue. Labor costs increased 15.6% from the prior year, or 100 basis points as a percentage of revenue. Equipment and other overhead costs increased by 2.7%, but decreased 580 basis points as a percentage of revenue, with increased outsourced manufacturing costs, which were partially offset by decreased depreciation expense, most significantly contributing to the overall cost increase.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses were $15.7 million in Q4 FY22, compared with $16.0 million in Q3 FY22, and $14.3 million in Q4 FY21. The decrease from Q3 FY22 was primarily the result of decreased compensation and related expenses of $0.5 million, and the increase from the prior year quarter was primarily the result of increased professional fees of $0.7 million and increased travel expenses of $0.3 million. Selling, general and administrative expenses increased $6.5 million to $64.0 million in FY22, from $57.5 million in FY21, primarily due to an increase in compensation and related expenses, professional fees, and travel expenses in the respective amounts of $4.6 million, $0.7 million, and $0.6 million.\nResearch and Development Expenses\nResearch and development expenses, which primarily consist of development and qualification efforts related to process technologies for high-end IC and FPD applications, decreased $0.1 million to $4.0 million in Q4 FY22, from Q3 FY22; the decrease was primarily caused by a decline in development activities in the U.S., which were partially offset by increased activities in Asia. Research and development expenses in Q4 FY22 decreased by $0.1 million in Q4 FY22 from Q4 FY21 as a result of decreased development activities in Asia moderately exceeding increased development activities in the U.S. On a year-to-date basis, research and development expenses decreased $0.1 million, to $18.3 million, primarily due to decreased development activities in Asia exceeding increased activities in the U.S.\nOther Operating Income, Net\nIn the third quarter of 2021, we recorded a $3.5 million gain on the trade-in of a lithography tool with a tool vendor as partial compensation for a more advanced tool.\nNon-Operating Income (Expense)\nQ4 FY22\nQ3 FY22\nQ4 FY21\nForeign currency transactions impact, net\n$\n10.4\n$\n3.9\n$\n4.3\nInterest expense, net\n(0.4\n)\n(0.6\n)\n(1.0\n)\nInterest income and other income, net\n0.8\n0.4\n0.5\nTotal other income (expense)\n$\n10.8\n$\n3.6\n$\n3.8\nNon-operating income (expense) increased in Q4 FY22 from Q3 FY22 by $7.2 million, and from Q4 FY21 by $7.0 million, primarily due to foreign currency impacts, driven by favorable movements of the South Korean won, the New Taiwan dollar, and the Singapore dollar against the U.S. dollar offsetting unfavorable movements of the RMB against the U.S. dollar. In addition, higher average cash, cash equivalents, and short-term investments balances in Q4 FY22 resulted in increased interest income compared to both prior comparative periods, and lower average interest-bearing debt balances resulted in lower interest expense, net of subsidies received in Q4 FY22, than was incurred in the prior comparative periods.\nFY22\nFY21\nForeign currency transactions impact, net\n$\n27.3\n$\n8.0\nInterest expense, net\n(1.9\n)\n(1.7\n)\nInterest income and other income, net\n1.7\n1.2\nTotal other income (expense)\n$\n27.2\n$\n7.5\nNon-operating income (expense) increased $19.7 million in full year FY22, compared with full year FY21, primarily due to foreign currency transactions, driven by favorable movements of the South Korean won, the New Taiwan dollar, and the Singapore dollar offsetting unfavorable movements of the RMB against the U.S. dollar. In addition, higher average cash, cash equivalents, and short-term investments balances in FY22, compared with FY21, resulted in increased interest income in the current year. Interest expense, net of subsidies increased in FY22, compared with FY21, due to receiving a lower amount of interest subsidies on our China-based debt in FY22, the effect of which was partially mitigated by lower average interest-bearing debt balance in FY22 than in the prior year.\nIncome Tax Provision\nQ4 FY22\nQ3 FY22\nQ4 FY21\nIncome tax provision\n$\n16.1\n$\n18.1\n$\n8.7\nEffective income tax rate\n22.5\n%\n26.9\n%\n23.3\n%\nThe effective income tax rates are sensitive to the jurisdictional mix of our earnings, due, in part, to the non-recognition of tax benefits on losses in jurisdictions with valuation allowances where the tax benefits of losses are not available.\nThe effective income tax rate decreased in Q4 FY22, compared with Q3 FY22, primarily due to changes in the period-to-period mix of jurisdictional earnings. The effective income tax rate decrease in Q4 FY22, compared with Q4 FY21, is primarily due to the benefits of investment credits in certain non-U.S. jurisdictions in Q4 FY22, as well as changes in the jurisdictional mix of earnings.\nFY22\nFY21\nIncome tax provision\n$\n59.8\n$\n23.2\nEffective income tax rate\n25.0\n%\n22.7\n%\nThe increase in the effective income tax rate on a full-year basis in FY22, compared with FY21, is primarily due to an increase of unremitted earnings tax and a decrease in credits in non-U.S. jurisdictions and the release of a valuation allowance for a loss carryforward in a non-U.S. jurisdiction in FY21.\nWe consider all available evidence when evaluating the potential future realization of deferred tax assets, and when, based on the weight of all available evidence, we determine that it is more likely than not that some portion or all of our deferred tax assets will not be realized, we reduce our deferred tax assets by a valuation allowance. We also regularly assess the potential outcomes of ongoing and future tax examinations and, accordingly, have recorded accruals for such contingencies. Included in the balance of unrecognized tax benefits as of October 31, 2022 and October 31, 2021, are $5.6 million and $3.8 million respectively, recorded in Other liabilities in the consolidated balance sheets that, if recognized, would impact the effective tax rates.\nNet Income Attributable to Noncontrolling Interests\nNet income attributable to noncontrolling interests was $18.2 million in Q4 FY22, compared with $18.0 million in Q3 FY22; the increase was the result of a net increase in the net incomes of our joint venture operations. Net income attributable to noncontrolling interests increased by $9.4 million in Q4 FY22 from Q4 FY21, and by $37.1 million in FY22 from FY21, as a result of increased net income at both our Taiwan-based and China-based IC facilities.\nLiquidity and Capital Resources\nCash and cash equivalents was $319.7 million and $276.7 million as of October 31, 2022, and October 31, 2021, respectively. As of the most recent balance sheet date, total cash and cash equivalents included $299.7 million held by foreign subsidiaries. Net Cash, a non-GAAP financial measure as defined and discussed in the Non-GAAP Financial Measures section below, was $316.2 million and $165.0 million as of October 31, 2022, and October 31, 2021, respectively. Our primary sources of liquidity are our cash on hand, cash we generate from operations, short-term investments, and borrowing capacity we have available from financial institutions. Our corporate credit agreement has a $50 million borrowing limit, with an expansion capacity to $100 million. Although we have not accessed funds under our corporate credit facilities since 2011, it continues to afford us financial flexibility. In addition, in China, we have approximately $21.5 million of borrowing capacity to support local operations. See Note 6 to our condensed consolidated financial statements in Part II, Item 8 for additional information on our currently available financing.\nWe continually evaluate alternatives for efficiently funding our capital expenditures and ongoing operations. These reviews may result in our engagement in a variety of investing and financing transactions, in the transfer of cash among subsidiaries, and/or the repatriation of cash to the U.S. The transfer of funds among subsidiaries could be subject to foreign withholding taxes; in certain jurisdictions, repatriation of these funds to the U.S. may subject them to U.S. state income taxes and/or local country withholding taxes. We believe that our liquidity, including available financing, is sufficient to meet our requirements through the next twelve months and thereafter for the foreseeable future. Through the utilization of our existing liquidity, cash we generate from operations, short-term investments, and (potentially) our borrowing capacity under our financing arrangements, we plan to continue to invest in our business, with our investments targeted to align with our customers technology road maps. In addition, we stand ready to invest in mergers, acquisitions, or strategic partnerships, should a suitable opportunity arise.\nWe estimate capital expenditures for our fiscal year 2023 will be approximately $130 million; these investments will be targeted towards high-end and mainstream point tools that will increase our operating capacity and efficiency, and enable us to support our customers near-term demands. As of October 31, 2022, we had outstanding capital commitments of approximately $147.8 million and recognized liabilities related to capital equipment purchases of approximately $5.3 million. Although payment timing could vary, primarily as a result of the timing of tool delivery, installation and testing, we currently estimate that we will fund $90.0 million of our total $153.1 million committed and recognized obligations for capital expenditures over the next twelve months. Please refer to Notes 8 and 13 to our consolidated financial statements in Part II, Item 8 for additional information on our lease liabilities and unrecognized commitments, respectively.\nIn September 2020, the Companys board of directors authorized the repurchase of up to $100 million of its common stock, pursuant to a repurchase plan under Rule 10b5-1 of the Securities Act. This authorization does not obligate the Company to repurchase any dollar amount or number of shares of common stock. As of October 31, 2022, there was approximately $31.7 million remaining under that authorization. Depending on market conditions, we may utilize some or the entire remaining approved amount to reacquire additional shares. On August 16, 2022, the Inflation Reduction Act (IRA) was enacted in the U.S. Among other provisions, the IRA included a one percent excise tax on corporate share repurchases. The one percent excise tax on share repurchases applies to shares repurchased after December 31, 2022, and excludes repurchases under $1 million. We do not anticipate that the IRA will have a material effect on our liquidity.\nAs discussed in Note 4 of our consolidated financial statements in Part II, Item 8, DNP, the noncontrolling interest in our China-based joint venture has, under certain circumstances, the right to put its interest in the joint venture to Photronics, or to purchase our interest in the joint venture. Under all such circumstances, the sale of DNPs interest would be at its ownership percentage of the joint ventures net book value, with closing to take place within three business days of obtaining required approvals and clearance. As of the date of issuance of this report, DNP had not indicated its intention to exercise this right. As of October 31, 2022, Photronics and DNP each had net investments in this joint venture of approximately $93.3 million.\nCash Flows\nYear Ended\nOctober 31, 2022\nOctober 31, 2021\nOctober 31, 2020\nNet cash provided by operating activities\n$\n275.2\n$\n150.8\n$\n143.0\nNet cash used in investing activities\n$\n(147.8\n)\n$\n(103.5\n)\n$\n(65.7\n)\nNet cash used in financing activities\n$\n(38.7\n)\n$\n(53.9\n)\n$\n(16.0\n)\nOperating Activities: Net cash provided by operating activities reflects net income adjusted for certain non-cash items, including depreciation and amortization, share-based compensation, and the effects of changes in operating assets and liabilities. Net cash provided by operating activities increased by $124.4 million in FY22, compared with FY21, primarily due to increased net income and net cash-favorable changes in working capital, predominantly in Asia.\nFree Cash Flow, which is a non-GAAP financial measure as discussed in the Non-GAAP Financial Measures section below, increased by $119.0 million in FY22, compared with FY21, primarily due to increased net cash provided by operating activities, and decreased by $30.0 million in FY21, compared with FY20, primarily due to an increase in spending on property, plant and equipment.\nInvesting Activities: In FY22, net cash flows used in investing activities primarily consisted of purchases of $112.3 million of property, plant and equipment. Net cash flows used in investing activities increased by $44.3 million in FY22, compared with FY21, primarily as a result of our investment of $38.9 million in short-term debt securities in FY22.\nFinancing Activities: In FY22, net cash flows used in financing activities primarily consisted of debt repayments of $65.4 million, which were partially offset by contributions from noncontrolling interests of $25.0 million. Net cash used in financing activities decreased by $15.2 million in FY22, compared with FY21, primarily due to decreased share repurchases of $45.7 million and an excess of the change in contributions from, as compared with distributions to, noncontrolling interests of $34.6 million, which were partially offset by increased debt repayments of $45.1 million (which included early repayments of $15.8 million), and decreased proceeds from long-term debt of $20.9 million.\nOur cash, cash equivalents, and restricted cash balances were negatively impacted by changes in foreign currency exchange rates in FY22 by $46.0 million.\nNon-GAAP Financial Measures\nWe consider Free Cash Flow and Net Cash, which are non-GAAP financial measures (as such term is defined by the SEC), to be useful metrics in measuring our cash-generating performance. (Note that we may define these terms differently than other companies that use similarly-named non-GAAP financial measures.) These non-GAAP metrics are not intended to represent funds available for our discretionary use or to be used as a substitute for Cash and cash equivalents or Net cash provided by operating activities, as measured under GAAP. The following tables reconcile Net cash provided by operating activities to Free Cash Flow for FY22, FY21 and FY20. The columns may not foot due to rounding.\nFY22\nFY21\nFY20\nFree Cash Flow\nNet cash provided by operating activities\n$\n275.2\n$\n150.8\n$\n143.0\nPurchases of property, plant and equipment\n(112.3\n)\n(109.1\n)\n(70.8\n)\nGovernment incentives\n3.6\n5.8\n5.3\nFree cash flow\n$\n166.5\n$\n47.4\n$\n77.5\nThe following table reconciles Cash and cash equivalents to Net Cash at the balance sheet dates. The increase in Net Cash was primarily driven by an increase in Net\ncash provided by operating activities, as discussed above. The columns may not foot due to rounding.\nAs of\nOctober 31,\nOctober 31,\nNet Cash\nCash, cash equivalents\n$\n319.7\n$\n276.7\nShort-term investments\n38.9\n-\nCurrent portion of Long-term debt\n(10.0\n)\n(22.2\n)\nLong-term debt\n(32.3\n)\n(89.4\n)\nNet cash\n$\n316.2\n$\n165.0\nBusiness Outlook\nOur current business outlook and guidance was provided in our Full Year and Fourth Quarter Fiscal 2022 Results earnings call, and related slide deck. These can be accessed in the investor section of our website - www.photronics.com.\nOur future results of operations and the other forward-looking statements contained in this filing and in our Full Year and Fourth Quarter Fiscal 2022 Results earnings call and presentation involve a number of risks and uncertainties, some of which are discussed in Part I, Item 1A of this report. A number of other unforeseeable factors could cause actual results to differ materially from our expectations.\nCritical Accounting Estimates\nOur consolidated financial statements are based on the selection and application of accounting policies, which require management to make significant estimates and assumptions. We believe the following to be the more critical areas that require judgment when applying our accounting policies:\nRevenue Recognition: The application of GAAP related to the measurement and recognition of revenue requires us to make judgments and estimates, including the determination of whether we should recognize revenues as we perform or upon the completion of our performance, as these determinations impact the timing and amount of our reported revenues and net income. Other significant judgments include the estimation of the point in the manufacturing process at which we are entitled to recognize revenue, as well as the measurement of our progress towards satisfying our performance obligations, which determine the amount of revenue we are entitled to recognize.\nProperty, Plant and Equipment: Significant judgment and assumptions are employed when we establish the estimated useful lives of asset classes, and determine when depreciation should commence for individual assets, as these determinations can significantly impact our gross margin and research and development expenses. Significant judgement would also be employed when events or changes in circumstances indicate that the carrying amount of a group of assets may not be recoverable, as the recoverability assessment requires us to forecast future cash flows related to these assets; this evaluation can significantly impact our gross margin and operating expense.\nLeases: Significant judgement is applied in the determination of whether an arrangement is, or contains, a lease and, in certain instances, whether the lease should be classified as an operating lease or a finance lease, which can impact the timing and classification of lease costs.\nContingencies: We are subject to the possibility of losses from various contingencies. Significant judgment is necessary to estimate the probability and amount of a loss, if any, from such contingencies. An accrual is made when it is probable that a liability has been incurred or an asset has been impaired and the amount of loss can be reasonably estimated. Changes in estimates related to, and resolutions of, contingencies may have a material impact on our financial performance.\nIncome Taxes: Our annual tax rate is determined based on our income and the jurisdictions where it is earned, statutory tax rates, and the tax impacts of items treated differently for tax purposes than for financial reporting purposes. Also inherent in determining our annual tax rate are judgments and assumptions regarding the recoverability of certain deferred tax assets, and our ability to uphold certain tax positions. We are subject to complex tax laws, in the U.S. and numerous foreign jurisdictions, and the manner in which they apply can be open to interpretation. Realization of deferred tax assets is dependent upon generating sufficient taxable income in the appropriate jurisdiction in future periods, which involves business plans, planning opportunities, and expectations about future outcomes. Our assessment relies on estimates and assumptions, and may involve a series of complex judgments about future events.\nThere are a number of estimates and assumptions inherent in calculating the various components of our tax provision. Future events such as changes in tax legislation, geographic mix of earnings, findings in tax audits, and earnings repatriation plans could have an impact on those estimates and our effective tax rate.\nPlease refer to Notes 1, 11, and 13 to our consolidated financial statements in Part II, Item 8 for additional information related to these critical accounting estimates.\nEffect of Recent Accounting Pronouncements\nSee Note 20 to our consolidated financial statements in Part II, Item 8 of this report for recent accounting pronouncements that may affect our financial reporting. ITEM 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nForeign Currency Exchange Rate Risk\nWe conduct business in several major currencies throughout our worldwide operations, and our financial performance may be affected by fluctuations in the exchange rates of these currencies. Changes in exchange rates can positively or negatively affect our reported revenue, operating income, assets, liabilities, and equity. The functional currencies of our Asian subsidiaries are the South Korean won, the New Taiwan dollar, the RMB, and the Singapore dollar. The functional currencies of our European subsidiaries are the British pound and the euro. In addition, we engage in transactions and have exposures to the Japanese yen.\nWe attempt to minimize our risk of foreign currency transaction losses by producing products in the same country in which the products are sold (thereby generating revenues and incurring expenses in the same currency), and by managing our working capital. However, in some instances, we sell products in a currency other than the functional currency of the country where it was produced, or purchase products in a currency that differs from the functional currency of the purchasing entity. We may also enter into derivative contracts to mitigate our exposure to foreign currency fluctuations when we have a significant purchase obligation or significant receivable denominated in a currency that differs from the functional currency of the transacting subsidiary. We do not enter into derivatives for speculative purposes. There can be no assurance that this approach will protect us from the need to recognize significant foreign currency transaction gains and losses, especially in the event of a significant adverse movement in the value of any foreign currency in which we conduct business against any of our functional currencies, including the U.S. dollar.\nOur primary net foreign currency exposures as of October 31, 2022, included the South Korean won, the Japanese yen, the New Taiwan dollar, the Chinese renminbi, the Singapore dollar, the British pound sterling, and the euro. As of October 31, 2022, a 10% adverse movement in the value of these currencies against the functional currencies of our subsidiaries would have resulted in a net unrealized pre-tax loss of $34.7 million, which represents a decrease of $0.5 million from the same movement as of October 31, 2021. The decrease in foreign currency rate change risk is primarily the result of decreased net exposures of the RMB against the U.S. dollar, which were largely offset increased net exposures of the New Taiwan dollar against the U.S. dollar. We do not believe that a 10% change in the exchange rates of other non-U.S. dollar currencies would have had a material effect on our October 31, 2022, consolidated financial statements.\nInterest Rate Risk\nA 10% adverse movement in the interest rates on our variable rate borrowings would not have had a material effect on our October 31, 2022, consolidated financial statements. ITEM 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm Deloitte & Touche LLP (PCAOB ID 34)\nConsolidated Balance Sheets\nConsolidated Statements of Income\nConsolidated Statements of Comprehensive (Loss) Income\nConsolidated Statements of Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Photronics, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Photronics, Inc. (the Company) as of October 31, 2022 and 2021, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the three years in the period ended October 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 31, 2022 and October 31, 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated December 23, 2022, expressed an unqualified opinion on the Companys internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue - Contracts with Customers- Refer to Note 7 to the financial statements\nCritical Audit Matter Description\nThe Company recognizes revenue over time for in-process production orders that have not shipped for contracts with customers for which it has an enforceable right to bill and collect consideration, including a reasonable profit, in the event the in-process orders are cancelled by the customers. This results in the Company recording a corresponding contract asset as of period-end for these contracts. Significant judgment is exercised by the Company in determining the amount of revenue to recognize for these contracts and the corresponding contract asset, specifically in estimating the point within the production cycle at which the production orders stand in relation to the Companys enforceable right within the contract. Pursuant to these contracts, revenue recognized over time and the associated contract asset as of October 31, 2022 was $15.8 million.\nWe identified the determination of revenue recognized over time for in-process productions orders as of October 31, 2022 as a critical auditing matter because of the significant estimates and assumptions management makes in determining the amount of revenue to recognize for these contracts. This required a high degree of audit judgment and an increased extent of effort when performing audit procedures to evaluate the reasonableness of managements determination of the progress point of in-process orders and the amount of revenue recognized over time and the corresponding contract asset as of October 31, 2022.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Companys determination of the progress point of in-process orders and resulting revenue recognized over time and corresponding contract asset as of October 31, 2022 included the following:\n- We tested the operating effectiveness of controls over managements determination of the point in the production process and correlation to stated contractual rights.\n- We tested the mathematical accuracy of managements calculations of revenue and the associated timing of revenue recognized in the consolidated financial statements.\n- We tested the accuracy and completeness of the in-process orders report by performing physical observation.\n- We selected a sample of in-process production orders as of October 31, 2022, and performed the following procedures for each selection:\n- Obtained and read the contract.\n- Tested managements identification of significant contract terms and resulting revenue recognition for the in-process production order.\n- Tested managements estimate of the production point for the in-process order and corresponding revenue recognition and contract asset based on the Companys enforceable right within the contract.\n/s/ Deloitte & Touche LLP\nBoston, Massachusetts\nDecember 23, 2022\nWe have served as the Companys auditor since 1991.\nPHOTRONICS, INC.\nConsolidated Balance Sheets\n(in thousands, except per share amounts)\nOctober 31,\nOctober 31,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n319,680\n$\n276,670\nShort-term investments\n38,820\n-\nAccounts receivable, net of allowance of $1,002 in 2022 and $1,218 in 2021\n198,147\n174,447\nInventories\n50,753\n55,249\nOther current assets\n37,252\n44,250\nTotal current assets\n644,652\n550,616\nProperty, plant and equipment, net\n643,873\n696,553\nDeferred income taxes\n19,816\n24,353\nOther assets\n7,489\n22,680\nTotal assets\n$\n1,315,830\n$\n1,294,202\nLIABILITIES AND EQUITY\nCurrent liabilities:\nCurrent portion of long-term debt\n$\n10,024\n$\n22,248\nAccounts payable\n79,566\n81,534\nAccrued liabilities\n104,207\n72,366\nTotal current liabilities\n193,797\n176,148\nLong-term debt\n32,310\n89,446\nOther liabilities\n27,634\n28,046\nTotal liabilities\n253,741\n293,640\nCommitments and contingencies\nEquity:\nPreferred stock, $0.01 par value, 2,000 shares authorized, none issued and outstanding\n-\n-\nCommon stock, $0.01 par value, 150,000 shares authorized, 60,791 shares issued and outstanding at October 31, 2022, and 60,024 shares issued and outstanding at October 31, 2021\nAdditional paid-in capital\n493,741\n484,672\nRetained earnings\n435,634\n317,849\nAccumulated other comprehensive (loss) income\n(98,456\n)\n20,571\nTotal Photronics, Inc. shareholders equity\n831,527\n823,692\nNoncontrolling interests\n230,562\n176,870\nTotal equity\n1,062,089\n1,000,562\nTotal liabilities and equity\n$\n1,315,830\n$\n1,294,202\nSee accompanying notes to consolidated financial statements.\nPHOTRONICS, INC.\nConsolidated Statements of Income\n(in thousands, except per share amounts)\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nRevenue\n$\n824,549\n$\n663,761\n$\n609,691\nCost of goods sold\n530,336\n496,717\n475,037\nGross profit\n294,213\n167,044\n134,654\nOperating expenses:\nSelling, general and administrative\n63,989\n57,525\n53,582\nResearch and development\n18,341\n18,490\n17,144\nTotal operating expenses\n82,330\n76,015\n70,726\nOther operating (loss) income, net\n(17 )\n3,525\n-\nOperating income\n211,866\n94,554\n63,928\nNon-operating income (expense):\nForeign currency transactions impacts, net\n27,344\n7,972\n(501\n)\nInterest expense, net of subsidies\n(1,857\n)\n(1,685\n)\n(2,367\n)\nInterest income and other income, net\n1,680\n1,165\nIncome before income tax provision\n239,033\n102,006\n61,601\nIncome tax provision\n59,791\n23,190\n21,258\nNet income\n179,242\n78,816\n40,343\nNet income attributable to noncontrolling interests\n60,456\n23,367\n6,523\nNet income attributable to Photronics, Inc. shareholders\n$\n118,786\n$\n55,449\n$\n33,820\nEarnings per share:\nBasic\n$\n1.96\n$\n0.90\n$\n0.52\nDiluted\n$\n1.94\n$\n0.89\n$\n0.52\nWeighted-average number of common shares outstanding:\nBasic\n60,559\n61,407\n64,866\nDiluted\n61,189\n61,999\n65,470\nSee accompanying notes to consolidated financial statements.\nPHOTRONICS, INC.\nConsolidated Statements of Comprehensive (Loss) Income\n(in thousands)\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nNet income\n$\n179,242\n$\n78,816\n$\n40,343\nOther comprehensive (loss) income, net of tax of $0:\nForeign currency translation adjustments\n(151,209\n)\n8,478\n36,381\nOther\n(69\n)\n(390\n)\nNet other comprehensive (loss) income\n(150,786\n)\n8,409\n35,991\nComprehensive income\n28,456\n87,225\n76,334\nLess: comprehensive income attributable to noncontrolling interests\n28,697\n29,163\n15,551\nComprehensive (loss) income attributable to Photronics, Inc. shareholders\n$\n(241\n)\n$\n58,062\n$\n60,783\nSee accompanying notes to consolidated financial statements.\nPHOTRONICS, INC.\nConsolidated Statements of Equity\nYears Ended October 31, 2022, 2021 and 2020\n(in thousands)\nPhotronics, Inc. Shareholders\nCommon Stock\nAdditional\nPaid-In\nRetained\nTreasury\nAccumulated\nOther\nComprehensive\nNon-\nControlling\nTotal\nShares\nAmount\nCapital\nEarnings\nStock\nIncome (Loss)\nInterests\nEquity\nBalance at October 31, 2019\n65,595\n$\n$\n524,319\n$\n253,922\n$\n-\n$\n(9,005\n)\n$\n141,200\n$\n911,092\nNet income\n-\n-\n-\n33,820\n-\n-\n6,523\n40,343\nOther comprehensive income\n-\n-\n-\n-\n-\n26,963\n9,028\n35,991\nShares issued under equity plans\n3,492\n-\n-\n-\n-\n3,499\nShare-based compensation expense\n-\n-\n4,927\n-\n-\n-\n-\n4,927\nContribution from noncontrolling interest\n-\n-\n-\n-\n-\n-\n17,596\n17,596\nDividends to noncontrolling interest\n-\n-\n-\n-\n-\n-\n(16,151\n)\n(16,151\n)\nRepurchase of common stock of subsidiary\n-\n-\n-\n-\n-\n(892\n)\n(637\n)\nPurchases of treasury stock\n-\n-\n-\n-\n(34,394\n)\n-\n-\n(34,394\n)\nRetirement of treasury stock\n(3,194\n)\n(32\n)\n(25,657\n)\n(8,705\n)\n34,394\n-\n-\n-\nBalance at October 31, 2020\n63,138\n507,336\n279,037\n-\n17,958\n157,304\n962,266\nNet income\n-\n-\n-\n55,449\n-\n-\n23,367\n78,816\nOther comprehensive income\n-\n-\n-\n-\n-\n2,613\n5,796\n8,409\nShares issued under equity plans\n3,561\n-\n-\n-\n-\n3,569\nShare-based compensation expense\n-\n-\n5,348\n-\n-\n-\n-\n5,348\nDividends to noncontrolling interest\n-\n-\n-\n-\n-\n-\n(9,597\n)\n(9,597\n)\nPurchases of treasury stock\n-\n-\n-\n-\n(48,249\n)\n-\n-\n(48,249\n)\nRetirement of treasury stock\n(3,919\n)\n(39\n)\n(31,573\n)\n(16,637\n)\n48,249\n-\n-\n-\nBalance at October 31, 2021\n60,024\n484,672\n317,849\n-\n20,571\n176,870\n1,000,562\nNet income\n-\n-\n-\n118,786\n-\n-\n60,456\n179,242\nOther comprehensive loss\n-\n-\n-\n-\n-\n(119,027 )\n(31,759 )\n(150,786 )\nShares issued under equity plans\n4,280\n-\n-\n-\n-\n4,290\nShare-based compensation expense\n-\n-\n6,308\n-\n-\n-\n-\n6,308\nContribution from noncontrolling interest\n-\n-\n-\n-\n-\n-\n24,995\n24,995\nPurchases of treasury stock\n-\n-\n-\n-\n(2,522 )\n-\n-\n(2,522 )\nRetirement of treasury stock\n(187 )\n(2 )\n(1,519 )\n(1,001 )\n2,522\n-\n-\n-\nBalance at October 31, 2022\n60,791\n$\n$ 493,741\n$ 435,634\n$ -\n$ (98,456 )\n$ 230,562\n$ 1,062,089\nSee accompanying notes to consolidated financial statements.\nPHOTRONICS, INC.\nConsolidated Statements of Cash Flows\n(in thousands)\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nCash flows from operating activities:\nNet income\n$\n179,242\n$\n78,816\n$\n40,343\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization of property, plant and equipment\n79,971\n87,535\n89,171\nAmortization of intangible assets\n2,861\n4,643\nShare-based compensation\n6,308\n5,348\n4,927\nDeferred income taxes\n(2,110\n)\n(444\n)\nChanges in assets, liabilities, and other:\nAccounts receivable\n(51,233\n)\n(36,620\n)\n6,986\nInventories\n(2,039\n)\n2,987\n(6,938\n)\nOther current assets\n1,204\n(13,472\n)\n7,849\nAccounts payable, accrued liabilities and other\n60,566\n25,427\n(3,491\n)\nNet cash provided by operating activities\n275,187\n150,772\n143,046\nCash flows from investing activities:\nPurchases of property, plant and equipment\n(112,338\n)\n(109,099\n)\n(70,815\n)\nPurchases of available-for-sale debt securities\n(38,854 )\n-\n-\nGovernment incentives\n3,615\n5,775\n5,263\nPurchases of intangible assets\n(205\n)\n(170\n)\n(159\n)\nOther\n-\n-\nNet cash used in investing activities\n(147,757\n)\n(103,494\n)\n(65,711\n)\nCash flows from financing activities:\nRepayments of debt\n(65,440\n)\n(20,352\n)\n(7,392\n)\nPurchases of treasury stock\n(2,522\n)\n(48,249\n)\n(34,394\n)\nContributions from noncontrolling interests\n24,995\n-\n17,596\nDividends paid to noncontrolling interests\n-\n(9,597\n)\n(16,151\n)\nProceeds from share-based arrangements\n5,749\n3,874\n4,239\nProceeds from long-term debt\n-\n20,858\n20,340\nNet settlements of restricted stock awards\n(1,471 )\n(437 )\n(248 )\nNet cash used in financing activities\n(38,689\n)\n(53,903\n)\n(16,010\n)\nEffects of exchange rate changes on cash, cash equivalents, and restricted cash\n(46,012\n)\n4,703\n10,986\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n42,729\n(1,922\n)\n72,311\nCash, cash equivalents, and restricted cash at beginning of year\n279,680\n281,602\n209,291\nCash, cash equivalents, and restricted cash at end of year\n322,409\n279,680\n281,602\nLess: Ending restricted cash\n2,729\n3,010\n2,937\nCash and cash equivalents at end of year\n$ 319,680\n$ 276,670\n$ 278,665\nSupplemental disclosure of non-cash information:\nAccruals for property, plant and equipment purchased during year\n$\n3,266\n$\n7,794\n$\n13,062\nSee accompanying notes to consolidated financial statements.\nPHOTRONICS, INC.\nNotes to Consolidated Financial Statements\nYears Ended October 31, 2022, October 31, 2021 and October 31, 2020\n(in thousands, except share amounts)\nNOTE 1 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBusiness\nPhotronics, Inc. (Photronics, the Company, we, our, or us) is one of the worlds leading manufacturers of photomasks, which are high-precision photographic quartz or glass plates containing microscopic images of electronic circuits. Photomasks are a key element in the manufacture of ICs and FPDs, and are used as masters to transfer circuit patterns onto semiconductor wafers and FPD substrates during the fabrication of integrated circuits, a variety of FPDs and, to a lesser extent, other types of electrical and optical components. We currently have eleven manufacturing facilities, located in Taiwan (3), China (2), Korea, the United States (3), and Europe (2).\nConsolidation\nThe accompanying consolidated financial statements include the accounts of Photronics, Inc., its wholly owned subsidiaries, and the majority-owned subsidiaries which it controls. All intercompany balances and transactions have been eliminated in consolidation.\nEstimates and Assumptions\nThe preparation of financial statements in conformity with U.S.GAAP requires us to make estimates and assumptions that affect amounts reported in them. Our estimates are based on historical experience and on various assumptions that are believed to be reasonable, including estimates of the impact of COVID 19, based on the facts and circumstances available at the time they are made. Subsequent actual results may differ from such estimates. We review these estimates periodically and reflect any effects of revisions in the period in which they are determined.\nReclassifications\nCertain immaterial prior periods amounts in the consolidated financial statements and notes thereto have been reclassified to conform to the current period presentation.\nCash and Cash Equivalents\nCash and cash equivalents include cash and highly liquid investments with an original maturity of three months or less, readily convertible to known amounts of cash, and so near to their maturity that they present insignificant risk of changes in value because of changes in interest rates. The carrying values of cash equivalents approximate their fair values, due to the short-term maturities of these instruments.\nInvestments\nInvestments consist of U. S. government securities and are classified as available-for-sale. We classify available-for-sale securities on our consolidated balance sheet as follows:\n-\nMaturing within three months or less from the date of purchase\nCash and cash equivalents\n-\nMaturing, as of the date of purchase, more than three months, but\nwith remaining maturities of less than one year, from the balance sheet date\nShort-term investments\n-\nMaturing one year or more from the balance sheet date\nLong-term marketable investments\nAs of October 31, 2022, all of our available-for-sale securities had remaining maturities of more than three months, but less than one year, and have been classified as Short-term investments. As of October 31, 2021, we did not hold any investments.\nAvailable-for-sale debt investments are reported at fair value, with unrealized gains or losses (net of tax) reported in Accumulated other comprehensive (loss) income. The fair values of our available-for-sale securities are Level 1 measurements, based on quoted prices from active markets for identical assets. In the event of a sale of an available-for-sale debt investment, we would determine the cost of the investment sold at the specific individual security level, and would include any gain or loss in Interest income and other income, net, where we also report periodic interest earned and the amortization (accretion) of discounts (premiums) related to these investments. The table below provides information on our available-for-sale debt securities.\nOctober 31, 2022\nOctober 31, 2021\nAmortized\nCost\nUnrealized\nGains\nUnrealized\nLosses\nCarrying\nValue\nAmortized\nCost\nUnrealized\nGains\nUnrealized\nLosses\nCarrying\nValue\nGovernment securities\n$ 38,911\n$ -\n$ (91 )\n$ 38,820\n$ -\n$ -\n$ -\n$ -\nPeriodically, at the individual security level, we review our investments to determine if they are impaired. An investment would be impaired if its amortized cost exceeds its fair value. In the event that an investments amortized cost exceeds its fair value, we would determine whether the impairment is temporary or other than temporary. Factors indicating that an other than temporary impairment had occurred that we would consider in our determination include whether we have decided to sell the security and whether it is more likely than not that we may be required to sell the security before its amortized cost basis is recovered. In addition, for certain types of securities, we would assess whether the discounted cash flows we expect to collect on an investment are less than its amortized cost and, under such a circumstance, recognize the existing credit loss as an impairment.\nAccounts Receivable and Allowance for Credit Losses\nWe generally record our accounts receivable at their billed amounts. All outstanding past due customer invoices are reviewed for collectability during, and at the end of, every reporting period. To the extent that we believe a loss on the collection of a customer invoice is probable, we record the loss and credit an allowance for credit losses. In the event that an amount is determined to be uncollectible, we charge the allowance for credit losses and derecognize the related receivable. Refer to our revenue recognition policy, below, for additional information on our accounting for accounts receivable.\nInventories\nInventories are stated at the lower of cost, determined under the first-in, first-out (FIFO) method, or net realizable value. The components of Inventories at the balance sheet dates are presented below.\nOctober 31,\nOctober 31,\nRaw materials\n$\n49,326\n$\n54,019\nWork in process\n1,408\n1,121\nFinished goods\n$\n50,753\n$\n55,249\nProperty, Plant and Equipment\nProperty, plant and equipment, except as explained below under Impairment of Long-Lived Assets, is stated at cost less accumulated depreciation and amortization. Repairs and maintenance, as well as renewals and replacements of a routine nature, are charged to operations as incurred, while those that improve or extend the lives of existing assets are capitalized. Upon sale or other disposition, the cost of the asset and its related accumulated depreciation are removed from the accounts, and any resulting gain or loss is reflected in earnings.\nDepreciation and amortization, essentially all of which are included in Cost of goods sold in our consolidated statements of income, are computed using the straight-line method over the estimated useful lives of the related assets. Buildings and improvements are depreciated over 10 to 39 years, machinery and equipment over 5 to 15 years, and furniture, fixtures, and office equipment over 3 to 5 years. Leasehold improvements are amortized over the lessor of the life of the lease or the estimated useful life of the improvement. We employ judgment when making assumptions about the estimated useful lives and depreciation periods we assign to property, plant and equipment, and when events or changes in circumstances such as a significant industry downturn, plant closures, technological obsolescence, or other occurrences indicate that their carrying amounts may not be recoverable.\nImpairment of Long-Lived Assets\nLong-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. Determinations of recoverability are based upon our judgment and estimates of undiscounted future cash flows resulting from the use of the assets and their eventual disposition. Measurement of an impairment loss for long-lived assets that we expect to hold and use is based on the fair value of the assets, determined using a market or income approach, compared with the carrying value of the asset. The carrying values of assets determined to be impaired would be reduced to their estimated fair values.\nIntangible Assets\nIntangible assets are stated at fair value as of the date acquired, less accumulated amortization. Amortization is calculated based on the estimated useful lives of the assets, which range from 3 to 15 years, using the straight-line method or another method that more fairly represents the utilization of the assets.\nWe periodically evaluate the remaining useful lives of our intangible assets to determine whether events or changes in circumstances warrant a revision to the remaining periods of amortization. In the event that the estimate of an intangible assets remaining useful life has changed, the remaining carrying amount of the intangible asset is amortized prospectively over that revised remaining useful life. If it is determined that an intangible asset has an indefinite useful life, that intangible asset would be subject to impairment testing annually or whenever events or changes in circumstances indicate that its carrying value may not, based on future undiscounted cash flows or market factors, be recoverable. An impairment loss, the recorded amount of which would be based on the fair value of the intangible asset at the measurement date, would be recorded in the period in which the impairment determination was made.\nRestricted Cash\nRestricted cash in the amounts of $2.7 million and $3.0 million are included in Other assets on our October 31, 2022 and October 31, 2021, consolidated balance sheets, respectively. The restrictions on these amounts are primarily related to land lease agreements and customs requirements.\nTreasury Stock\nWe record treasury stock purchases under the cost method, recording the entire cost of the acquired stock as treasury stock. Gains and losses on subsequent reissuances would be credited or charged to additional paid-in capital, and we would employ the average cost method (with average cost being determined separately for each share repurchase program), in the event that we subsequently reissue shares.\nRevenue Recognition\nWe recognize revenue when, or as, control of a good or service transfers to a customer, in an amount that reflects the consideration to which we expect to be entitled in exchange for transferring those goods or services. We account for an arrangement as a revenue contract when each party has approved and is committed to perform under the contract, the rights of the contracting parties regarding the goods or services to be transferred and the payment terms are identifiable, the arrangement has commercial substance, and collection of consideration is probable. Substantially all of our revenue comes from the sales of photomasks. We typically contract with our customers to sell sets of photomasks, which are comprised of multiple layers, the predominance of which we invoice as they ship to customers. As the photomasks are manufactured to customer specifications, they have no alternative use to us and, as our contracts generally provide us with the right to payment for work completed to date, we recognize revenue as we perform, or over time, on most of our contracts. We measure our performance to date using an input method, which is based on our estimated costs to complete the various manufacturing phases of a photomask. At the end of a reporting period, there are a number of uncompleted revenue contracts on which we have performed; for any such contracts under which we are entitled to be compensated for our costs incurred plus a reasonable profit, we recognize revenue and a corresponding contract asset for such performance. We account for shipping and handling activities that we perform after a customer obtains control of a good as being activities to fulfill our promise to transfer the good to the customer, rather than as promised services, or performance obligations, under the contract. We report our revenue net of any sales or similar taxes we collect on behalf of governmental entities.\nAs stated above, photomasks are manufactured to customer specifications in accordance with their proprietary designs; thus, they are individually unique. Due to their uniqueness and other factors, their transaction prices are individually established through negotiations with customers; consequently, our photomasks do not have standard or list prices. The transaction prices of the vast majority of our revenue contracts include only fixed amounts of consideration. In certain instances, such as when we offer a customer an early payment discount, an estimate of variable consideration would be included in the transaction price, but only to the extent that a significant reversal of revenue would not occur when the uncertainty related to the variability was resolved.\nContract Assets, Contract Liabilities, and Accounts Receivable\nWe recognize a contract asset when our performance under a contract precedes our receipt of consideration from a customer, or before payment is due, and our receipt of consideration is conditional upon factors other than the passage of time. Contract assets reflect our transfer of control to customers of photomasks that are in process or completed but not yet shipped to customers. A receivable is recognized when we have an unconditional right to payment for our performance, which generally occurs when we ship the photomasks. Our contract assets primarily consist of a significant amount of our in-process production orders and fully manufactured photomasks which have not yet shipped, for which we have an enforceable right to collect consideration (including a reasonable profit) in the event the in-process orders are cancelled by customers. On an individual contract basis, we net contract assets with contract liabilities (deferred revenue) for financial reporting purposes. We did not impair any contract assets or accounts receivable in 2022, 2021, or 2020.\nThe following table provides information about our contract balances at the balance sheet dates.\nClassification\nOctober 31,\nOctober 31,\nContract Assets\nOther current assets\n$\n15,752\n$\n9,859\nContract Liabilities\nAccrued liabilities\n$\n18,872\n$\n14,717\nOther liabilities\n4,989\n5,197\n$\n23,861\n$\n19,914\nThe following table presents revenue recognized from contract liabilities that existed at the beginning of the reporting periods.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nRevenue recognized from beginning liability\n$\n8,934\n$\n5,300\n$\n2,823\nOur invoice terms generally range from net thirty to ninety days, depending on both the geographic market in which the transaction occurs and our payment agreements with specific customers. In the event that our evaluation of a customers business prospects and financial condition indicate that the customer presents a collectability risk, we modify terms of sale, which may require payment in advance of performance. At the time of adoption, we elected the practical expedient allowed under ASC Topic 606 Revenue from Contracts with Customers (Topic 606) that permits us not to adjust a contracts promised amount of consideration to reflect a financing component when the period between when we transfer control of goods or services to customers and when we are paid is one year or less.\nIn instances when we are paid in advance of our performance, we record a contract liability and, as allowed under the practical expedient in Topic 606, recognize interest expense only if the period between when we receive payment from the customer and the date when we expect to be entitled to the payment is greater than one year. Historically, advance payments weve received from customers have generally not preceded the completion of our performance obligations by more than one year.\nContract Costs\nWe pay commissions to third-party sales agents for certain sales that they procure on our behalf. However, the bases of the commissions are the transaction prices of the sales, which are completed in less than one year; thus, no relationship is established with a customer that will result in future business. Therefore, we would not recognize any portion of these sales commissions as costs of obtaining a contract, nor do we currently foresee other circumstances under which we would recognize such assets.\nRemaining Performance Obligations\nAs we are typically required to fulfill customer orders within a short time period, our backlog of orders is generally not in excess of one to two weeks for IC photomasks and two to three weeks for FPD photomasks. However, the demand for some IC photomasks has expanded beyond the industrys capacity to supply them within the traditional time period; thus the backlog, in some individual cases, can expand to as long as two to three months. As allowed under Topic 606, we have elected not to disclose our remaining performance obligations, which represent the costs associated with the completion of the manufacturing process of in-process photomasks related to contracts that have an original duration of one year or less.\nProduct Warranties\nOur photomasks are sold under warranties that generally range from one to twenty-four months. We warrant that our photomasks conform to customer specifications, and we will typically repair, replace, or issue a refund for any photomasks that fail to do so. The warranties do not represent separate performance obligations in our revenue contracts. Historically, customer claims under warranties have been immaterial.\nLeases\nOur involvement in lease arrangements has typically been as a lessee. We determine if an agreement is, or contains, a lease on the earlier of the date of the agreement or the date on which we commit to entering the agreement. An arrangement is determined to be a lease when it conveys to us the right to control the use of an identified asset for a period of time in exchange for consideration. Our having the right to control an identified asset is determined by whether we are entitled to substantially all of its economic benefits and can direct its use. We recognize leases on our consolidated balance sheet when a lessor makes an asset underlying a lease having a term in excess of twelve months available for our use. As allowed under ASC Topic 842 - Leases (Topic 842), we have elected to 1) not to apply the recognition requirements to leases that, at their commencement dates, have lease terms of twelve months or less and do not include options to purchase their underlying assets that we are reasonably certain to exercise and 2) for all classes of assets, the practical expedient to not separate lease components of a contract from nonlease components of a contract.\nIf an arrangement is determined to be, or include, a lease, we then apply the classification criteria in Topic 842 to determine whether the lease is a finance lease or an operating lease. For both types of leases, at their commencement dates (which are the dates on which a lessor makes an underlying asset available for our use), we recognize ROU assets, which represent our rights to use the underlying assets, and lease liabilities which represent our obligation to make payments for such rights. The present value of lease payments over the term of the lease provides the basis for the initial measurement of ROU assets and their related lease liabilities. Variable lease payments, other than those that are dependent on an index or on a rate (at which they are measured on their commencement dates), are not included in the measurement of ROU assets and their related lease liabilities. Lease terms include extension periods if the lease agreement includes an option to extend the lease that we are reasonably certain to exercise.\nThe initial measurement process for finance leases and operating leases is the same, except that, for operating leases, we generally apply our incremental borrowing rates for collateralized borrowings over terms similar to those of the leases to determine the lease liability while, for finance leases, we use the interest rates implicit in the leases. The initial measurement of ROU assets may require further adjustments for lease prepayments and initial direct costs we incur.\nOperating leases are expensed on a straight-line basis over the terms of the leases, and are included in the consolidated statement of income in Cost of goods sold, Selling,\ngeneral and administrative, or Research and development expense in accordance with the use of the underlying asset. Finance lease ROU assets are amortized over the estimated useful life of the underlying asset; the expenses are included in the consolidated statement of income in Cost of goods sold. Finance lease liabilities are subsequently remeasured by increasing the liability to reflect interest accrued during a period and decreasing the liability to reflect payments made during the period. Interest expense incurred on finance leases is included in Interest expense on the consolidated statements of income.\nCash paid for operating leases and interest paid for finance leases are included in the consolidated statement of cash flows as operating activities in Accounts payable, accrued liabilities and other; cash paid for finance lease principal is included in Repayments of debt in the financing activities section of the consolidated statement of cash flows.\nShare-Based Compensation\nWe recognize share-based compensation expense over the service period during which the awards are expected to vest. Share-based compensation expense includes the estimated effects of forfeitures, which are adjusted over the requisite service period to the extent actual forfeitures differ, or are expected to differ, from such estimates. Changes in estimated forfeitures are recognized in the period of change and will impact the amount of expense to be recognized in future periods. Determining the appropriate option pricing model, calculating the grant date fair value of share-based awards, and estimating forfeiture rates requires considerable judgment, including estimations of stock price volatility and the expected term of options granted.\nWe use the Black-Scholes option pricing model to value employee stock options. We estimate stock price volatility based on daily averages of our common stocks historical volatility over a term approximately equal to the estimated time period the grant will remain outstanding. The expected term of options and forfeiture rate assumptions are derived from historical data.\nResearch and Development\nResearch and development costs are expensed as incurred and consist primarily of development efforts related to high-end process technologies for advanced subwavelength reticle solutions for IC and FPD photomask technologies.\nForeign Currency Translation\nOur non-U.S. subsidiaries maintain their accounts in their respective local currencies, which are their functional currencies. Assets and liabilities of such subsidiaries are translated to U.S. dollars at year-end exchange rates. Income and expenses are translated at average rates of exchange prevailing during the year. Foreign currency translation adjustments are accumulated and reported in Accumulated other comprehensive (loss) income, a component of equity on our consolidated balance sheets.\nGovernment Grants\nWe account for funds we receive from government grants by reducing the costs of the assets or expenses to which we apply the funds. Funds we receive that cannot be attributed to specific assets or expenses would be recognized as other income, and included in Interest income and other income (expense), net in the consolidated statements of income. Funds we receive from government grants are classified in our consolidated statements of cash flows as either cash flows from operating activities or cash flows from investing activities, in accordance with how we expend the funds.\nIncome Taxes\nThe income tax provision is computed on the basis of the income or loss before income taxes for each entity in its respective tax jurisdiction. Deferred income taxes reflect the tax effects of differences between the carrying amounts of assets and liabilities for financial reporting purposes and their amounts used for income tax purposes, as well as the tax effects of net operating losses and tax credit carryforwards. We employ judgment and make assumptions when establishing valuation allowances for deferred income tax assets, if their realization is not deemed to be more likely than not, by considering future market growth, operating forecasts, future taxable income, and the mix of earnings among the tax jurisdictions in which we operate. Accordingly, income taxes charged against earnings may have been impacted by changes in the valuation allowances. We are eligible for investment tax credits in U.S. and non-U.S. tax jurisdictions. We account for investment tax credits under the flow-through method of accounting. As permitted in ASC 740 Income Taxes, under the flow-through method of accounting, the tax benefit from an investment tax credit is recorded as a reduction of income taxes in the period in which the credit is generated.\nWe consider income taxes in each of the tax jurisdictions in which we operate in order to determine our effective income tax rate. Our current income tax expense is thus identified, and temporary differences resulting from differing treatments of items for tax and financial reporting purposes are assessed. These differences result in deferred tax assets, which are presented on our consolidated balance sheets, and deferred tax liabilities, which are included in Other liabilities on our consolidated balance sheets.\nWe account for uncertain tax positions by recording a liability for unrecognized tax benefits resulting from uncertain tax positions taken, or expected to be taken, in our tax returns. We include any applicable interest and penalties related to uncertain tax positions in our income tax provision.\nEarnings Per Share\nBasic earnings per share (EPS) is based on the weighted-average number of common shares outstanding for the period, excluding any dilutive common share equivalents. Diluted EPS reflects the potential dilution that could occur if certain share-based payment awards were exercised or earned.\nVariable Interest Entities\nWe account for the investments we make in certain legal entities in which equity investors do not have: 1) sufficient equity at risk for the legal entity to finance its activities without additional subordinated financial support or, 2) as a group, the holders of the equity investment at risk do not have either the power, through voting or similar rights, to direct the activities of the legal entity that most significantly impact the entitys economic performance or, 3) the obligation to absorb the expected losses of the legal entity or the right to receive expected residual returns of the legal entity as variable interest entities, or VIEs.\nWe consolidate the results of any such entity in which we have determined that we have a controlling financial interest. We would have a controlling financial interest (and thus be considered the primary beneficiary of the entity) in such an entity when we have both the power to direct the activities that most significantly affect the VIEs economic performance and the obligation to absorb the losses of, or right to receive the benefits from, the VIE that could be potentially significant to the VIE. On a quarterly basis, we reassess whether we have a controlling financial interest in any investments we have in these entities.\nWe account for investments we make in VIEs in which we have determined that we do not have a controlling financial interest but have a significant influence over, and hold at least a twenty percent ownership interest in, using the equity method. An investment not meeting the parameters to be accounted for under the equity method would be accounted for using the cost method, unless the investment had a readily determinable fair value, at which value it would then be reported.\nNOTE 2 - OTHER CURRENT ASSETS\nPresented below are the components of Other\ncurrent assets at the balance sheet dates.\nOctober 31,\nOctober 31,\nContract assets\n$\n15,752\n$\n9,859\nPrepaid and refundable income taxes\n9,709\n1,550\nPrepaid expenses\n8,263\n7,999\nRecoverable value added taxes\n2,714\n24,213\nOther\n$\n37,252\n$\n44,250\nNOTE 3 - PROPERTY, PLANT AND EQUIPMENT, NET\nPresented below are the components of Property, plant and equipment, net at the balance sheet dates.\nOctober 31,\nOctober 31,\nLand\n$\n11,134\n$\n12,442\nBuildings and improvements\n168,024\n181,922\nMachinery and equipment\n1,769,478\n1,961,474\nLeasehold improvements\n18,802\n21,751\nFurniture, fixtures and office equipment\n14,355\n15,534\nConstruction in progress\n90,846\n35,009\n2,072,639\n2,228,132\nAccumulated depreciation and amortization\n(1,428,766\n)\n(1,531,579\n)\n$\n643,873\n$\n696,553\nInformation on ROU assets resulting from finance leases, at the balance sheet dates, is presented below.\nOctober 31,\nOctober 31,\nMachinery and equipment\n$\n42,760\n$\n42,760\nAccumulated amortization\n(4,784\n)\n(1,933\n)\n$\n37,976\n$\n40,827\nThe following table presents depreciation expense (including the amortization of ROU assets) related to property, plant and equipment incurred during the reporting periods.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nDepreciation expense\n$ 79,971\n$ 87,535\n$ 89,171\nIn the third quarter of 2021, we recorded a $3.5 million gain on the trade-in of a lithography tool with a tool vendor as partial compensation for a more advanced tool.\nNOTE 4 - PDMCX JOINT VENTURE\nIn January 2018, Photronics, Inc. through its wholly owned Singapore subsidiary (hereinafter, within this Note we, Photronics, us, or our), and DNP, through its wholly owned subsidiary DNP Asia Pacific PTE, Ltd. entered into a joint venture under which DNP obtained a 49.99% interest in our IC business in Xiamen, China. The joint venture, which we refer to as PDMCX, was established to develop and manufacture photomasks for semiconductors. We entered into this joint venture to enable us to compete more effectively for the merchant photomask business in China, and to benefit from the additional resources and investment that DNP provides to enable us to offer advanced-process technology to our customers.\nIn 2020, in combination with local financing obtained by PDMCX, Photronics and DNP fulfilled their investment obligations under the PDMCX operating agreement (the Agreement). As discussed in Note 6, liens were granted to the local financing entity on property, plant and equipment with an October 31, 2022, and October 31, 2021, total carrying value of $70.7 and $90.1 million, respectively, as collateral for the loans.\nUnder the Agreement, DNP is afforded, under certain circumstances, the right to put its interest in PDMCX to Photronics. These circumstances include disputes regarding the strategic direction of PDMCX that may arise after the initial two-year term of the Agreement that cannot be resolved between the two parties. As of the date of issuance of these financial statements, DNP had not indicated its intention to exercise this right. In addition, both Photronics and DNP have the option to purchase, or put, their interest from, or to, the other party, should their ownership interest fall below twenty percent for a period of more than six consecutive months. Under all such circumstances, the sales of ownership interests would be at the exiting partys ownership percentage of the joint ventures net book value, with closing to take place within three business days of obtaining required approvals and clearance.\nThe following table presents net income or loss we recorded from the operations of PDMCX during the reporting periods.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nNet income (loss) from PDMCX\n$\n16,714\n$\n6,425\n$\n(4,684\n)\nAs required by the guidance in ASC Topic 810 - Consolidation, we evaluated our involvement in PDMCX for the purpose of determining whether we should consolidate its results in our financial statements. The initial step of our evaluation was to determine whether PDMCX was a VIE. Due to its lack of sufficient equity at risk to finance its activities without additional subordinated financial support, we determined that it is a VIE. Having made this determination, we then assessed whether we were the primary beneficiary of the VIE, and concluded that we were the primary beneficiary during the current and prior years reporting periods; thus, as required, the PDMCX financial results have been consolidated with Photronics. Our conclusion was based on the fact that we held a controlling financial interest in PDMCX (which resulted from our having the power to direct the activities that most significantly impacted its economic performance) and had both the obligation to absorb losses and the right to receive benefits that could potentially be significant to PDMCX. Our conclusions that we had the power to direct the activities that most significantly affected the economic performance of PDMCX during the current and prior year periods were based on our right to appoint the majority of its board of directors, which has, among others, the powers to manage the business (through its rights to appoint and evaluate PDMCXs management), incur indebtedness, enter into agreements and commitments, and acquire and dispose of PDMCXs assets. In addition, as a result of the 50.01% variable interest we held during the current and prior year periods, we had the obligation to absorb losses, and the right to receive benefits, that could potentially be significant to PDMCX.\nThe following table presents the carrying amounts of PDMCX assets and liabilities included in our consolidated balance sheets. General creditors of PDMCX do not have recourse to the assets of Photronics (other than the net assets of PDMCX); therefore, our maximum exposure to loss from PDMCX is our interest in the carrying amount of the net assets of the joint venture.\nOctober 31, 2022\nOctober 31, 2021\nClassification\nCarrying\nAmount\nPhotronics\nInterest\nCarrying\nAmount\nPhotronics\nInterest\nCurrent assets\n$\n127,542\n$\n63,784\n$\n59,745\n$\n29,879\nNoncurrent assets\n119,392\n59,708\n137,799\n68,913\nTotal assets\n246,934\n123,492\n197,544\n98,792\nCurrent liabilities\n51,274\n25,643\n26,559\n13,282\nNoncurrent liabilities\n9,161\n4,581\n42,917\n21,463\nTotal liabilities\n60,435\n30,224\n69,476\n34,745\nNet assets\n$\n186,499\n$\n93,268\n$\n128,068\n$\n64,047\nNOTE 5 - ACCRUED LIABILITIES\nPresented below are the components of Accrued liabilities at the balance sheet dates.\nOctober 31,\nOctober 31,\nCompensation related expenses\n$\n33,061\n$\n22,632\nIncome taxes\n37,595\n15,596\nContract liabilities\n18,872\n14,717\nProperty, plant, and equipment\n2,989\n3,331\nValue added and other taxes\n2,923\n2,540\nOperating leases\n1,354\n2,273\nTelecommunications and utilities\n1,111\n1,067\nOther\n6,302\n10,210\nAccrued liabilities\n$\n104,207\n$\n72,366\nNOTE 6 - DEBT\nThe tables below provide information on our long-term debt.\nAs of October 31, 2022\nXiamen Project\nLoans\nXiamen Working\nCapital Loans\nHefei Equipment\nLoan\nFinance\nLeases\nTotal\nPrincipal due:\nNext 12 months\n$\n-\n$\n3,512\n$\n-\n$\n6,512\n$\n10,024\nMonths 13 - 24\n$\n-\n$\n-\n$\n-\n$\n6,610\n$\n6,610\nMonths 25 - 36\n1,098\n-\n-\n17,961\n19,059\nMonths 37 - 48\n6,641\n-\n-\n-\n6,641\nLong-term debt\n$\n7,739\n$\n-\n$\n-\n$\n24,571\n$\n32,310\nInterest rate at balance sheet date\n4.30% - 4.45 %\n4.46\n%\nN/A\n(2)\nBasis spread on interest rates\n0.00\n76.00\nN/A\nN/A\nInterest rate reset\nQuarterly\nMonthly/Annually\nN/A\nN/A\nMaturity date\nDecember 2025\nJuly 2023\nPaid July 2022\n(2)\nPeriodic payment amount\nVaries as loans mature(1)\nIncreases as loans mature\nN/A\n(2)\nPeriodic payment frequency\nSemiannual, on individual loans\nSemiannual, on individual loans\nN/A\nMonthly\nLoan collateral (carrying amount)\n$\n70,705\nN/A\nN/A\n$ 37,976\n(3)\n(1)\nDuring the three month period ended October 31, 2022, we repaid 81,000,000 RMB (approximately $11.5 million) that had contractual maturity dates ranging from December 2023 through June 2025.\n(2)\nSee Note 8 for interest rates on lease liabilities, maturity dates, and periodic payment amounts.\n(3)\nRepresents the carrying amount at the balance sheet date of the related ROU assets, in which the lessors have secured interests.\nAs of October 31, 2021\nXiamen Project\nLoans\nXiamen Working\nCapital Loans\nHefei Equipment\nLoan\nFinance\nLeases\nTotal\nPrincipal due:\nNext 12 months\n$\n2,068\n$\n8,197\n$\n4,694\n$\n7,289\n$\n22,248\nMonths 13 - 24\n$\n10,071\n$\n4,005\n$\n4,693\n$\n6,512\n$\n25,281\nMonths 25 - 36\n10,278\n-\n6,257\n6,610\n23,145\nMonths 37 - 48\n9,902\n-\n5,585\n17,961\n33,448\nMonths 49 - 60\n7,572\n-\n-\n-\n7,572\nLong-term debt\n$\n37,823\n$\n4,005\n$\n16,535\n$\n31,083\n$\n89,446\nInterest rate at balance sheet date\n4.65 %\n4.53% - 4.61\n%\n4.20\n%\n(3)\nBasis spread on interest rates\n0.00\n67.75 - 76.00\n(45.00\n)\nN/A\nInterest rate reset\nQuarterly\nMonthly/Annually\nAnnually\nN/A\nMaturity date\nDecember 2025\nJuly 2023\nSeptember 2025\n(3)\nPeriodic payment amount\nVaries as loans mature\nIncreases as loans mature\nVaries(1)\n(3)\nPeriodic payment frequency\nSemiannual, on individual loans\nSemiannual, on individual loans\nSemiannual(2)\nMonthly\nLoan collateral (carrying amount)\n$\n90,096\nN/A\n86,487\n$ 40,826\n(4)\n(1)\nFirst five loan repayments were scheduled to be for 7.5 percent of the approved 200 million RMB loan principal; last five installments were scheduled to be for 12.5 percent of the approved loan principal.\n(2)\nSemiannual repayments commence in March 2022; remaining outstanding amount paid in July 2022.\n(3)\nSee Note 8 for interest rates on lease liabilities, maturity dates, and periodic payment amounts.\n(4)\nRepresents the carrying amount at the balance sheet date of the related ROU assets, in which the lessors have secured interests.\nXiamen Project Loans\nIn November 2018, PDMCX obtained approval to borrow 345 million RMB from the Industrial and Commercial Bank of China. From November 2018 through July 2020, PDMCX entered into separate loan agreements (the Project Loans) for the entire approved amount and, as of October 31, 2022, 56.4 million RMB ($7.7 million) remained outstanding. The Project Loans were used to finance certain capital expenditures at the PDMCX facility, and are collateralized by liens granted on the land use right, building, and certain equipment located at the facility. The interest rates on the Project Loans are variable (based on the RMB Loan Prime Rate of the National Interbank Funding Center), and interest incurred on the loans was eligible for reimbursement through incentives provided by the Xiamen Torch Hi-Tech Industrial Development Zone, which afforded for such reimbursements up to a prescribed limit and duration. The Project Loans are subject to covenants and provisions, certain of which relate to the assets pledged as security for the loan, all of which we were in compliance with at October 31, 2022.\nXiamen Working Capital Loans\nIn November 2018, PDMCX obtained approval for revolving, unsecured credit of the equivalent of $25.0 million, pursuant to which PDMCX may enter into separate loan agreements with varying terms to maturity. This facility is subject to annual reviews and extension. Unless extended, this facility will expire in November 2023. As of October 31, 2022, PDMCX had 25.6 million RMB ($3.5 million) outstanding against the approval. The interest rates are variable, based on the RMB Loan Prime Rate of the National Interbank Funding Center. Interest incurred on the loans is eligible for reimbursement through incentives provided by the Xiamen Torch Hi-Tech Industrial Development Zone, which provide for such reimbursements up to a prescribed limit and duration.\nHefei Equipment Loan\nIn October 2020, our Hefei, China, facility was approved to borrow 200 million RMB from the China Construction Bank Corporation. In July 2022, we repaid our entire outstanding balance of 120.7 million RMB ($18.0 million). This credit facility was subject to annual reviews and extension; the most recent extension expired in August 2022 and we did not apply for an extension. The loan proceeds were used to fund purchases of two lithography tools at the Hefei facility. The interest rate on the loan was variable and based on the RMB Loan Prime Rate of the National Interbank Funding Center. The borrowings were secured by the Hefei facility, its related land use right, and certain manufacturing equipment. The Hefei Equipment Loan was subject to covenants and provisions, certain of which relate to the assets pledged as security for the loan, including covenants for the ratio of total liabilities to total assets and the ratio of current assets to current liabilities, all of which we were in compliance with at the time of repayment.\nFinance Leases\nIn February 2021, under an MLA which we entered into effective October 2020, we entered into a five-year $7.2 million finance lease for a high-end inspection tool and, in December 2020, under an MLA which we entered into effective July 2019, we entered into a $35.5 million lease for a high-end lithography tool. See Note 8 for additional information on these leases.\nCorporate Credit Agreement\nIn September 2018, we entered into a five-year amended and restated credit agreement (the Credit Agreement), which has a $50 million borrowing limit, with an expansion capacity to $100 million. The Credit Agreement is secured by substantially all of our assets located in the United States and certain of the common stock we own in certain foreign subsidiaries. The Credit Agreement includes covenants around minimum interest coverage ratio, total leverage ratio, and minimum unrestricted cash balance (all of which we were in compliance with at October 31, 2022), and limits the amount of cash dividends, distributions, and redemptions we can pay on our common stock to an aggregate annual amount of $50 million. We had no outstanding borrowings against the Credit Agreement at October 31, 2022. The interest rate on the Credit Agreement (4.75% at October 31, 2022) is based on our total leverage ratio at LIBOR plus a spread, as defined in the Credit Agreement.\nInterest Paid for Debt\nInterest payments, including capitalized interest of $0.1 million in both 2021 and 2020, were $2.8 million in 2022, $3.8 million in 2021, and $2.6 million in 2020.\nNOTE 7 - REVENUE\nThe following tables present our revenue for the years ended October 31, 2022, October 31, 2021, and October 31, 2020, disaggregated by product type, geographic origin, and timing of recognition.\nYear Ended\nRevenue by Product Type\nOctober 31, 2022\nOctober 31, 2021\nOctober 31, 2020\nIC\nHigh-end\n$\n195,332\n$\n162,973\n$ 156,129\nMainstream\n397,694\n297,198\n262,281\nTotal IC\n$\n593,026\n$\n460,171\n$ 418,410\nFPD\nHigh-end\n$\n186,988\n$\n155,670\n$ 139,558\nMainstream\n44,535\n47,920\n51,723\nTotal FPD\n$\n231,523\n$\n203,590\n$\n191,281\n$\n824,549\n$\n663,761\n$ 609,691\nYear Ended\nRevenue by Geographic Origin*\nOctober 31, 2022\nOctober 31, 2021\nOctober 31, 2020\nTaiwan\n$\n291,342\n$\n248,597\n$ 239,101\nChina\n212,598\n115,732\n79,374\nKorea\n156,139\n156,391\n153,052\nUnited States\n126,205\n105,023\n104,949\nEurope\n36,402\n36,242\n31,501\nOther\n1,863\n1,776\n1,714\n$\n824,549\n$\n663,761\n$ 609,691\n* This table disaggregates revenue by the location in which it was earned.\nRevenue by Timing of Recognition\nOver time\n$\n758,359\n$\n606,332\n$ 535,071\nAt a point in time\n66,190\n57,429\n74,620\n$\n824,549\n$\n663,761\n$ 609,691\nNOTE 8 - LEASES\nIn February 2021, we entered into a five-year $7.2 million finance lease for a high-end inspection tool. Monthly payments on the lease, which commenced in February 2021, are $0.1 million per month. Upon the payment of the fiftieth monthly payment and prior to payment of the fifty-first monthly payment, we may exercise an early buyout option to purchase the tool for $2.4 million. If we do not exercise the early buyout option, then at the end of the five-year lease term, the lease shall continue to renew on a month-to-month basis at the same rental terms; at our option, after the original term or any renewal periods, we may return the tool, elect to extend the lease, or purchase the tool at its fair market value. Since we are reasonably certain that we will exercise the early buyout option, our lease liability reflects such exercise and we have classified the lease as a finance lease. The interest rate implicit in the lease is 1.08%.\nIn December 2020, we entered into a five-year $35.5 million finance lease for a high-end lithography tool. Monthly payments on the lease, which commenced in January 2021, increased from $0.04 million during the first three months to $0.6 million for the following nine months, followed by forty-eight monthly payments of $0.5 million. As of the due date of the forty-eighth monthly payment, we may exercise an early buyout option to purchase the tool for $14.1 million. If we do not exercise the early buyout option, then at the end of the five-year lease term, at our option, we may return the tool, elect to extend the lease term for a period and a lease payment to be agreed with lessor at the time, or purchase the tool for its then-fair market value as determined by the lessor. Since we are reasonably certain that we will exercise the early buyout option, our lease liability reflects such exercise and we have classified the lease as a finance lease. The interest rate implicit in the lease is 1.58%. The lease agreement incorporates the covenants included in our Corporate Credit Agreement, which are detailed in Note 6, and includes a cross-default provision for any agreement or instrument with an outstanding, committed balance greater than $5.0 million in which we are the indebted party.\nThe following table provides information on operating and finance leases included in our consolidated balance sheets.\nClassification\nOctober 31,\nOctober 31,\nROU Assets - Operating Leases\nOther assets\n$\n3,341\n$\n5,581\nROU Assets - Finance Leases\nProperty, plant and equipment, net\n$\n37,976\n$\n40,827\nLease Liabilities - Operating Leases\nAccrued liabilities\n$\n1,354\n$\n2,273\nOther liabilities\n1,928\n3,246\n$\n3,282\n$\n5,519\nLease Liabilities - Finance Leases\nCurrent portion of long-term debt\n$\n6,512\n$\n7,289\nLong-term debt\n24,571\n31,083\n$\n31,083\n$\n38,372\nThe\nfollowing table presents future lease payments under noncancelable operating and finance leases as of October 31, 2022. Imputed interest represents the difference between undiscounted cash flows and discounted cash flows.\nFiscal Year\nOperating Leases\nFinance Leases\n$\n1,398\n$\n6,938\n6,938\n18,013\n-\n-\nTotal lease payments\n3,403\n31,889\nImputed interest\n(121\n)\n(806\n)\nLease liabilities\n$\n3,282\n$\n31,083\nThe following table presents lease costs for 2022, 2021, and 2020.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nOperating lease costs\n$\n2,253\n$\n2,904\n$\n3,076\nShort-term lease costs\n$\n$\n$\nVariable lease costs\n$\n$\n$\nInterest on finance lease\n$\n$\n$ -\nAmortization of ROU assets\n$\n2,917\n$\n1,867\n$ -\nThe\nfollowing table presents statistical information related to our operating and finance leases. The information presented is as of the balance sheet dates.\nOctober 31, 2022\nOctober 31, 2021\nClassification\nWeighted-average\nremaining lease\nterm (in years)\nWeighted-average\ndiscount rate\nWeighted-average\nremaining lease\nterm (in years)\nWeighted-average\ndiscount rate\nOperating leases\n3.1\n2.3\n%\n3.5\n2.4\n%\nFinance leases\n2.2\n1.5\n%\n3.3\n1.5\n%\nThe following table presents the effects of leases on our 2022, 2021, and 2020 consolidated statements of cash flows, and provides leases-related non-cash information for those years.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nOperating cash flows used for operating leases\n$\n2,259\n$\n2,442\n$\n3,584\nOperating cash flows used for finance leases\n$\n$\n$ -\nFinancing cash flows used for finance leases\n$\n7,289\n$\n4,323\n$ -\nROU assets obtained in exchange for operating lease obligations\n$\n$\n$ 2,681\nROU assets obtained in exchange for finance lease obligations\n$\n-\n$\n42,672\n$ -\nNOTE 9 - SHARE-BASED COMPENSATION\nIn March 2016, shareholders approved our current equity incentive compensation plan (the Plan), under which incentive stock options, non-qualified stock options, stock grants, stock-based awards, restricted stock, restricted stock units, stock appreciation rights, performance units, performance stock, and other stock or cash awards may be granted. Shares to be issued under the Plan may be authorized and unissued shares, issued shares that have been reacquired by us (in the open market or in private transactions), or a combination thereof. The maximum number of shares of common stock approved that may be issued under the Plan is four million shares. Awards may be granted to officers, employees, directors, consultants, advisors, and independent contractors of Photronics or its subsidiaries. In the event of a change in control (as defined in the Plan), the vesting of awards may be accelerated. The Plan, aspects of which are more fully described below, prohibits further awards from being issued under prior plans. The table below presents information on our share-based compensation expenses for the three most recent fiscal years.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nExpense reported in:\nCost of goods sold\n$\n$\n$\nSelling, general and administrative\n4,803\n4,446\n4,590\nResearch and development\n-\nTotal expense incurred\n$\n6,308\n$\n5,348\n$\n4,927\nExpense by award type:\nRestricted stock awards\n$\n5,800\n$\n4,920\n$\n4,140\nStock options\nEmployee stock purchase plan\nTotal expense incurred\n$\n6,308\n$\n5,348\n$\n4,927\nIncome tax benefits of share-based compensation\n$\n$\n$\nShare-based compensation cost capitalized\n$\n-\n$\n-\n$\n-\nRestricted Stock Awards\nWe periodically grant restricted stock awards, the restrictions on which typically lapse over a service period of one to four years. The fair values of the awards are determined on the date of grant, based on the closing stock price of our common stock. A summary of restricted stock award activity during 2022 and the status of our restricted stock awards as of October 31, 2022, is presented below.\nRestricted Stock\nShares\nWeighted-Average\nFair Value at\nGrant Date\nOutstanding at October 31, 2021\n929,147\n$\n12.08\nGranted\n654,224\n$\n18.73\nVested\n(407,716\n)\n$\n12.78\nCancelled\n(281,951\n)\n$\n15.27\nOutstanding at October 31, 2022\n893,704\n$\n15.62\nExpected to vest as of October 31,\n814,294\n$\n15.52\nThe table below presents additional information on our restricted stock awards for the three most recent fiscal years.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nNumber of shares granted\n654,224\n564,800\n538,000\nWeighted-average grant-date fair value of awards (in dollars per share)\n$\n18.73\n$\n11.20\n$\n15.08\nCompensation costs not yet recognized\n$\n8,949\n$\n7,300\n$\n6,933\nWeighted-average amortization period (in years)\n2.7\n2.6\n2.8\nFair value of awards for which restrictions lapsed\n$\n5,212\n$\n4,491\n$\n2,957\nShares outstanding at balance sheet date\n893,704\n929,147\n812,316\nStock Options\nOption awards generally vest in one to four years and have a ten-year contractual term. All incentive and non-qualified stock option grants must have an exercise price no less than the market value of the underlying common stock on the date of grant. The grant-date fair values of options are based on closing prices of our common stock on the dates of grant and are calculated using the Black-Scholes option pricing model. Expected volatility is based on the historical volatility of our common stock. We use historical option exercise behavior and employee termination data to estimate expected term, which represents the period of time that options granted are expected to remain outstanding. The risk-free rate of return for the estimated term of an option is based on the U.S. Treasury yield curve in effect at the date of grant.\nThe table below presents a summary of stock options activity during 2022 and information on stock options outstanding at October 31, 2022.\nShares\nWeighted-Average\nExercise Price\nWeighted-Average\nRemaining\nContractual Life\nAggregate\nIntrinsic Value\nOutstanding\nat October 31, 2021\n1,173,103\n$\n9.49\nGranted\n-\n$\n-\nExercised\n(571,514\n)\n$\n9.23\nCancellations,\nforfeitures, and adjustments\n12,412\n$\n9.74\nOutstanding\nat October 31, 2022\n614,001\n$\n9.74\n3.3 years\n$\n3,980\nExercisable\nat October 31, 2022\n590,275\n$\n9.74\n3.2 years\n$\n3,827\nExpected to vest as of October 31, 2022\n23,559\n$\n9.78\n6.2 years\n$\nThe table below presents additional information on stock option awards for the three most recent fiscal years.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nNumber of options granted in period\n-\n-\n-\nTotal intrinsic value of options exercised\n$\n5,108\n$\n1,910\n$\n3,184\nCash received from option exercises\n$\n5,275\n$\n3,441\n$\n3,746\nCompensation cost not yet recognized\n$\n$\n$\nWeighted-average amortization period for cost not yet recognized (in years)\n0.2\n1.1\n1.7\nEmployee Stock Purchase Plan\nOur Employee Stock Purchase Plan (ESPP) permits employees to purchase Photronics, Inc. common shares at 85% of the lower of the closing market price at the commencement or ending date of the Plan year (which is approximately one year from the commencement date). We recognize the ESPP expense over that same period. As of October 31, 2022, the maximum number of shares of common stock approved by our shareholders to be purchased under the ESPP was 1.85 million shares, of which approximately 1.6 million shares had been issued through October 31, 2022. As of October 31, 2022, less than 0.1 million shares, with unrecognized compensation cost of less than $0.1 million (all of which will be recognized in fiscal 2023) were subject to outstanding subscriptions.\nNOTE 10 - EMPLOYEE RETIREMENT PLANS\nWe maintain a 401(k) Savings and Profit-Sharing Plan (401(k) Plan) which covers all full and certain part-time U.S. employees who have completed three months of service and are 18 years of age or older. Under the terms of the 401(k) Plan, employees may contribute up to 50% of their salary, subject to certain maximum amounts, which will be matched by the Company at 50% of the employees contributions that are not in excess of 4% of the employees compensation. Employee and employer contributions vest immediately upon contribution. The total employer contributions for all of our defined contribution plans were $0.7 million, $0.8 million and $0.7 million in 2022, 2021, and 2020, respectively.\nNOTE 11 - INCOME TAXES\nIncome before the income tax provisions consists of the following:\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nUnited States\n$\n1,813\n$\n(19,447\n)\n$\n(10,672\n)\nForeign\n237,220\n121,453\n72,273\n$\n239,033\n$\n102,006\n$\n61,601\nIncome Tax Provision\nThe components of our income tax provisions are presented below.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nCurrent:\nFederal\n$\n-\n$\n-\n$\n-\nState\nForeign\n58,981\n25,296\n21,698\n58,982\n25,300\n21,702\nDeferred:\nFederal\n-\n-\n-\nState\nForeign\n(2,213\n)\n(452\n)\n(2,110 )\n(444 )\nTotal\n$\n59,791\n$\n23,190\n$\n21,258\nThe table below presents a reconciliation of income taxes calculated by applying the statutory U.S. federal income tax rate to our income tax provisions of the reporting periods.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nU.S. federal income tax at statutory rate\n$\n50,197\n$\n21,421\n$\n12,936\nChanges in valuation allowances\n(1,462\n)\n6,942\nForeign tax rate differentials\n7,941\n3,244\n1,718\nTax credits\n(1,368\n)\n(3,942\n)\n(1,562\n)\nUncertain tax positions, including reserves, settlements and resolutions\n3,214\n1,037\n1,637\nIncome tax holiday\n-\n-\n(318\n)\nOther, net\n1,269\n1,066\n(95\n)\nIncome tax provision\n$\n59,791\n$\n23,190\n$\n21,258\nReporting Period\nU.S. Statutory\nTax Rates\nPhotronics Effective Tax Rates\nPrimary Reasons for Differences\n21.0\n%\n25.0\n%\nNon-U.S. pre-tax income being taxed at higher statutory rates in non-U.S. jurisdictions; and the establishment of uncertain tax positions in non-U.S. jurisdiction.\n21.0\n%\n22.7\n%\nLoss jurisdiction pre-tax losses not being benefited due to valuation allowances, non-U.S. pre-tax income being taxed at higher statutory rates in the non-U.S. jurisdictions, and investment credits in foreign jurisdictions.\n21.0\n%\n34.5\n%\nLoss jurisdiction pre-tax losses not being benefited due to valuation allowances, non-U.S. pre-tax income being taxed at higher statutory rates in the non-U.S. jurisdictions (partially offset by the benefits of a tax holiday), and investment credits in foreign jurisdictions.\nDeferred Income Tax Assets and Liabilities\nThe net deferred income tax assets consist of the following:\nAs of\nOctober 31,\nOctober 31,\nDeferred income tax assets\nNet operating losses\n$\n29,410\n$\n31,657\nReserves not currently deductible\n8,528\n8,201\nTax credit carryforwards\n9,660\n9,877\nShare-based compensation\n1,560\n1,500\nProperty, plant and equipment\n6,591\n7,566\nLease liabilities\n7,367\n9,134\nOther\n-\n63,116\n68,092\nValuation allowances\n(32,895\n)\n(34,337\n)\n30,221\n33,755\nDeferred income tax liabilities\nROU assets\n(8,930\n)\n(9,698\n)\nOther\n(1,722 )\n-\n(10,652\n)\n(9,698\n)\nNet deferred income tax assets\n$\n19,569\n$\n24,057\nClassification\nDeferred income tax assets\n$\n19,816\n$\n24,353\nOther liabilities\n(247\n)\n(296\n)\n$\n19,569\n$\n24,057\nWe have established a valuation allowance for a portion of our deferred tax assets because we believe, based on the weight of all available evidence, that it is more likely than not that a portion of our deferred tax assets will expire prior to utilization. In 2022 the valuation allowance decreased as a result of managements determination that tax benefits on deferred tax assets would more likely than not be realized and, therefore, decreased the valuation allowance to include these deferred tax assets.\nDue to the Tax Cuts and Jobs Act, which was signed into law in December 2017, as of fiscal year end 2018, U.S. deferred taxes were no longer provided on the undistributed earnings of non-U.S. subsidiaries. Our policy to indefinitely reinvest these earnings in non-U.S. operations remains unchanged for the purpose of determining deferred tax liabilities for U.S. state and foreign withholding taxes. Therefore, should we elect in the future to repatriate the remaining foreign earnings deemed to be indefinitely reinvested, we may incur additional state and foreign withholding tax expense on those earnings, the amount of which is not practicable to compute.\nTax Credits and Carryforwards\nThe following tables present our available operating loss and credit carryforwards as of October 31, 2022, and their related expiration periods.\nOperating Loss Carryforwards\nAmount\nExpiration\nPeriod\nFederal\n$\n95,822\n2029-Indefinite\nState\n$\n170,198\n2023-Indefinite\nForeign\n$\n2024-2032\nTax Credit Carryforwards\nAmount\nExpiration\nPeriod\nFederal research and development\n$\n5,576\n2024-2042\nState\n$\n5,169\n2023-2036\nUncertain Tax Positions\nWe include unrecognized tax benefits in Other liabilities, and we include any applicable interest and penalties related to uncertain tax positions in our income tax provision.\nA reconciliation of the beginning and ending amounts of unrecognized tax benefits is presented below. The amounts in the table include settlements of non-U.S. audits.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nBalance at beginning of year before interest and penalties\n$\n3,534\n$\n2,550\n$\n1,758\n(Reductions) additions of tax positions in prior years\n(355\n)\nAdditions based on current year tax positions\n2,892\n1,313\n1,576\nSettlements\n(848\n)\n(489\n)\n(992\n)\nLapses of statutes of limitations\n(19\n)\n(21\n)\n(19\n)\nBalance at end of year before interest and penalties\n5,204\n3,534\n2,550\nInterest and penalties\nBalance at end of year including interest and penalties\n$ 5,599\n$ 3,757\n$ 2,681\nThe following table presents additional information on our uncertain tax positions, as of the balance sheet dates.\nOctober 31,\nOctober 31,\nUnrecognized tax benefits that, if recognized, would impact the effective tax rate\n$\n5,599\n$\n3,757\nAccrued interest and penalties related to uncertain tax positions\n$\n$\nAlthough the timing of the reversal of uncertain tax positions may be uncertain, as they can be dependent upon the settlement of tax audits or expirations of statutes of limitations, the Company believes that the amount of uncertain tax positions (including accrued interest and penalties, and net of tax benefits) that may be resolved over the next twelve months is $0.4 million. Resolution of these uncertain tax positions may result from either or both the lapses of statutes of limitations and tax settlements. The Company is no longer subject to tax authority examinations in the U.S., major foreign, or state tax jurisdictions for years prior to fiscal year 2017.\nIncome Tax Payments and Refunds\nThe table below presents income taxes paid and refunds of income taxes received during the reporting periods.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nIncome taxes paid\n$\n37,770\n$\n22,684\n$\n22,954\nIncome tax refunds received\n$\n$\n$\n4,258\nNOTE 12 - EARNINGS PER SHARE\nThe calculation of basic and diluted earnings per share is presented below.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nNet income attributable to Photronics, Inc. shareholders\n$\n118,786\n$\n55,449\n$\n33,820\nEffect of dilutive securities\n-\n-\n-\nEarnings used for diluted earnings per share\n$\n118,786\n$\n55,449\n$\n33,820\nWeighted-average common shares computations:\nWeighted-average common shares used for basic earnings per share\n60,559\n61,407\n64,866\nEffect of dilutive securities:\nShare-based payment awards\nPotentially dilutive common shares\nWeighted-average common shares used for diluted earnings per share\n61,189\n61,999\n65,470\nBasic earnings per share\n$\n1.96\n$\n0.90\n$\n0.52\nDiluted earnings per share\n$\n1.94\n$\n0.89\n$\n0.52\nThe table below sets forth the outstanding weighted-average share-based payment awards that were excluded from the calculation of diluted earnings per share because their exercise price exceeded the average market value of the common shares for the period or, under application of the treasury stock method, they were otherwise determined to be antidilutive.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nShare based payment awards\nTotal potentially dilutive shares excluded\nNOTE 13 - COMMITMENTS AND CONTINGENCIES\nPresented below are our unrecognized commitments, as of October 31, 2022. Included in these amounts are commitments of $148 million for the purchase of capital equipment. The amounts below do not include our commitments under our debt and lease arrangements, which are presented in Notes 6 and 8, respectively.\nFiscal Year\nUnrecognized\nCommitments\n$\n124,653\n44,434\n22,640\n-\n-\nThereafter\n-\nTotal\n$\n191,727\nWe are subject to various claims that arise in the ordinary course of business. We believe that our potential liability under such claims, individually and in the aggregate, will not have a material effect on our consolidated financial statements. As of October 31, 2022, and October 31, 2021, we were not involved in environmental litigation to which a government was a party.\nNOTE 14 - CHANGES IN ACCUMULATED OTHER COMPREHENSIVE (LOSS) INCOME BY COMPONENT\nThe following tables set forth the changes in our accumulated other comprehensive (loss) income by component (net of tax of $0) for the years ended October 31, 2022, and October 31, 2021.\nYear Ended October 31, 2022\nForeign Currency\nTranslation\nAdjustments\nOther\nTotal\nBalance at October 31, 2021\n$\n21,476\n$\n(905\n)\n$\n20,571\nOther comprehensive (loss) income\n(151,209\n)\n(150,786\n)\nOther comprehensive loss (income) attributable to noncontrolling interests\n31,943\n(184\n)\n31,759\nBalance at October 31, 2022\n$\n(97,790\n)\n$\n(666\n)\n$\n(98,456\n)\nYear Ended October 31, 2021\nForeign Currency\nTranslation\nAdjustments\nOther\nTotal\nBalance at October 31, 2020\n$\n18,828\n$\n(870\n)\n$\n17,958\nOther comprehensive income (loss)\n8,478\n(69\n)\n8,409\nOther comprehensive (income) loss attributable to noncontrolling interests\n(5,830\n)\n(5,796\n)\nBalance at October 31, 2021\n$\n21,476\n$\n(905\n)\n$\n20,571\nNOTE 15 - RISKS AND CONCENTRATIONS\nFinancial instruments that potentially subject us to credit risk principally consist of trade accounts receivable and short-term cash investments. We sell our products primarily to semiconductor and FPD manufacturers in Asia, North America, and Europe. We believe that the concentration of credit risk in our trade receivables is substantially mitigated by our ongoing credit evaluation process and relatively short collection terms. We do not generally require collateral from customers. We establish an allowance for credit losses based upon factors surrounding the credit risk of specific customers, historical trends, and other information.\nOur cash and cash equivalents are deposited in several financial institutions, including institutions located within all of the countries in which we manufacture photomasks. Portions of deposits in some of these institutions may exceed the amount of insurance available for such deposits at these institutions. As these deposits are generally redeemable upon demand and are held by high quality, reputable institutions, we consider them to bear minimal credit risk. We further mitigate credit risks related to our cash and cash equivalents by spreading such risk among a number of institutions.\nThe following table presents the percentages of our net accounts receivable attributable to customers that accounted for more than ten percent of the total balance as of the balance sheet dates.\nOctober 31,\nOctober 31,\nCustomer A\n%\n%\nCustomer B\n%\n%\nThe following table presents the percentages of our revenue attributable to customers that accounted for more than ten percent of the total revenue during the reporting periods.\nYear Ended\nOctober 31,\nOctober 31,\nOctober 31,\nCustomer A\n%\n%\n%\nCustomer B\n%\n%\n%\nWe operate as a single operating segment as a manufacturer of photomasks, which are high precision quartz or glass plates containing microscopic images of electronic circuits for use in the fabrication of ICs and FPDs.\nAs of the balance sheet dates, our long-lived assets and net assets were, by geographic area, as presented below.\nOctober 31, 2022\nOctober 31, 2021\nLong-lived Assets\nNet Assets\nLong-lived Assets\nNet Assets\nChina\n$\n242,712\n$\n257,855\n$\n297,633\n$\n210,437\nTaiwan\n155,690\n393,795\n134,174\n341,291\nUnited States\n132,915\n183,909\n137,640\n173,062\nKorea\n109,892\n229,501\n140,485\n254,357\nEurope and Other\n6,758\n(2,971\n)\n5,627\n21,415\n$\n647,967\n$\n1,062,089\n$\n715,559\n$\n1,000,562\nNOTE 16 - RELATED PARTY TRANSACTIONS\nOur chief executive officer is related to an individual in a position of authority at one of our largest customers. We recorded revenue from this customer of $119.0 million, $111.0 million and $96.4 million, in 2022, 2021, and 2020, respectively. As of October 31, 2022, and October 31, 2021, we had accounts receivable of $32.4 million and $34.5 million, respectively, from this customer.\nWe believe that the terms of the transaction described above was negotiated at arms length and were no less favorable to us than terms we could have obtained from unrelated third parties.\nNOTE 17 - FAIR VALUE MEASUREMENTS\nThe accounting framework for determining fair value includes a hierarchy for ranking the quality and reliability of the information used to measure fair value, which enables the reader of the financial statements to assess the inputs used to develop those measurements. The fair value hierarchy consists of three tiers, as follows: Level 1, defined as quoted market prices (unadjusted) in active markets for identical securities; Level 2, defined as inputs other than Level 1 that are observable, either directly or indirectly; and Level 3, defined as unobservable inputs that are not corroborated by market data.\nThe fair values of our cash and certain cash equivalents (Level 1 measurements), accounts receivable, accounts payable, and certain other current assets and current liabilities (Level 2 measurements) approximate their carrying values due to their short-term maturities. The fair values of our Short-term\ninvestments are Level 1 measurements. (Please refer to Investments within Note 1 for additional fair value information on our Short-term investments.)\nThe fair values of certain cash equivalents are Level 2 measurements that are provided by independent third-party pricing services or other independent entities, which may use matrix pricing, valuation models, or other methods which utilize observable market data. The fair values of our variable-rate debt instruments are Level 2 measurements and approximate their carrying values due to the variable nature of their underlying interest rates. Other than our Short-term investments, we did not have any assets or liabilities measured at fair value, on a recurring or a nonrecurring basis, at October 31, 2022, or October 31, 2021.\nNOTE 18 - SHARE REPURCHASE PROGRAMS\nIn September 2020, the Companys board of directors authorized the repurchase of up to $100 million of its common stock, pursuant to a repurchase plan under Rule 10b5-1 of the Securities Act. The company commenced repurchasing shares under this authorization on September 16, 2020.\nIn August 2019, the Companys board of directors authorized the repurchase of up to $100 million of its common stock, pursuant to a repurchase plan under Rule 10b5-1 of the Securities Act. The share repurchase program commenced on September 25, 2019, and was terminated on March 20, 2020.\nAll of the shares purchased under the above repurchase programs were retired prior to the end of the fiscal year in which they were purchased. As of October 31, 2022, $31.7 million was available under this authorization for the purchase of additional shares. The table below presents information on the repurchase programs for the three most recent fiscal years.\nPurchases\nPurchases\nPurchases\nNumber of shares repurchased\n3,919\n3,194\nCost of shares repurchased\n$\n2,522\n$\n48,249\n$\n34,394\nAverage price paid per share\n$\n13.43\n$\n12.31\n$\n10.77\nNOTE 19 - SUBSIDIARY DIVIDENDS\nIn 2021 and 2020, PDMC, the Companys majority owned subsidiary in Taiwan, paid dividends of which 49.99%, or approximately $9.6 million and $16.2 million, respectively, were paid to noncontrolling interests.\nNOTE 20 - RECENT ACCOUNTING PRONOUNCEMENTS\nAccounting Standards Updates Adopted\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes, which simplifies the accounting for income taxes by removing certain exceptions to the general principles in ASC 740, Income Taxes. The amendments also improve consistent application of and simplify US GAAP for other areas of ASC 740 by clarifying and amending existing guidance. We adopted ASU 2019-12 on November 1, 2021; the adoption of this guidance did not have a material impact on our consolidated financial statements and accompanying disclosures.\nAccounting Standards Updates to be Adopted\nIn April 2022, the FASB issued ASU 2022-02, Financial Instruments - Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures, which requires: 1) an entity to measure and record the lifetime expected credit losses of an asset that is within the scope of the Update upon origination or acquisition; as a result, credit losses from loans modified as troubled debt restructurings are to be incorporated into the allowance for credit losses and, 2) public business entities to disclose current-period gross writeoffs by year of origination for financing receivables and net investments in leases within the scope of Subtopic 326-20, Financial Instruments-Credit Losses-Measured at Amortized Cost. The guidance in this Update will be effective for Photronics in its first quarter of fiscal 2024. The amendments are to be applied prospectively, with the exception of the transition method related to the recognition and measurement of troubled debt restructurings for which an entity has the option to apply a modified retrospective transition method. We are currently evaluating the effect the adoption of this ASU may have on our disclosures.\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance, to increase the transparency of government assistance including the disclosure of the types of assistance an entity receives, an entitys method of accounting for government assistance, and the effect of the assistance on an entitys financial statements. The guidance in this Update will be effective for Photronics in its fiscal year 2023 Form 10-K, with early application of the amendments allowed. The amendments are to be applied prospectively to all transactions within the scope of the amendments that are reflected in financial statements at the date of initial application and new transactions that are entered into after the date of initial application or, retrospectively to those transactions. We are currently evaluating the effect the adoption of this ASU may have on our disclosures.\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting, which provides optional expedients and exceptions to applying the guidance on contract modifications, hedge accounting, and other transactions, to simplify the accounting for transitioning from LIBOR, and other interbank offered rates expected to be discontinued, to alternative reference rates. The guidance in this Update was effective upon its issuance; if elected, it is to be applied prospectively from December 31, 2022. We do not expect the impact of this ASU to be material to our consolidated financial statements. ITEM 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of October 31, 2022. We have established and currently maintain disclosure controls and procedures, as such term is defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act, designed to provide reasonable assurance that information required to be disclosed in our reports filed under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and that such information is accumulated and communicated to management, including our chief executive officer and chief financial officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost- benefit relationship of possible controls and procedures. Based on an evaluation of our disclosure controls and procedures as of October 31, 2022, our Chief Executive Officer and Chief Financial Officer concluded that, as of such date, our disclosure controls and procedures were effective at a reasonable assurance level.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, the Company conducted an evaluation of the effectiveness of the internal control over financial reporting based on criteria established in the Internal Control Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of our internal control over financial reporting as of October 31, 2022, based on the criteria set forth by the COSO. Management, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, concluded that our internal control over financial reporting was effective as of October 31, 2022.\nThe Companys independent registered public accounting firm, Deloitte & Touche LLP, has audited the effectiveness of the Companys internal control over financial reporting as of October 31, 2022, as stated in their report on page 68 of this Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere were no changes to our internal control over financial reporting during 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of Photronics, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Photronics, Inc. (the Company) as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended October 31, 2022, of the Company, and our report dated December 23, 2022, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nBoston, Massachusetts\nDecember 23, 2022 ITEM 9B.\nOTHER INFORMATION\nNone.\nITEM 9C.\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTION\nNot applicable.\nPART III ITEM 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information as to Directors required by Items 401, 405 and 407(c)(3)(d)(4) and (d)(5) of Regulation S-K is set forth in our 2023 Definitive Proxy Statement which will be filed with the Securities and Exchange Commission pursuant to Regulation 14A of the Exchange Act within 120 days after the end of the fiscal year covered by this Form 10-K under the caption PROPOSAL 1 - ELECTION OF DIRECTORS, DELINQUENT SECTION 16(A) REPORTS and in the third paragraph under the caption MEETINGS AND COMMITTEES OF THE BOARD, and is incorporated in this report by reference. The information as to Executive Officers is included in our 2023 Definitive Proxy Statement under the caption EXECUTIVE OFFICERS and is incorporated in this report by reference.\nWe have adopted a code of ethics that applies to our principal executive officer, chief financial officer or principal financial officer and principal accounting officer. A copy of the code of ethics may be obtained, free of charge, by writing to the executive vice president, general counsel of Photronics, Inc. at 15 Secor Road, Brookfield, Connecticut 06804. ITEM 11.\nEXECUTIVE COMPENSATION\nThe information required by Item 402 of Regulation S-K and paragraph (e)(4) and (e)(5) of Item 407 is set forth in our 2023 Definitive Proxy Statement under the captions EXECUTIVE COMPENSATION, CERTAIN AGREEMENTS, DIRECTORS COMPENSATION, COMPENSATION COMMITTEE INTERLOCKS AND INSIDER PARTICIPATION and COMPENSATION COMMITTEE REPORT ON EXECUTIVE COMPENSATION, respectively, and is incorporated in this report by reference. ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by Item 201(d) of Regulation S-K is set forth in our 2023 Definitive Proxy Statement under the caption EQUITY COMPENSATION PLAN INFORMATION and is incorporated in this report by reference. The information required by Item 403 of Regulation S-K is set forth in our 2023 Definitive Proxy Statement under the caption OWNERSHIP OF COMMON STOCK BY DIRECTORS, OFFICERS AND CERTAIN BENEFICIAL OWNERS, and is incorporated in this report by reference. ITEM 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Items 404 and Item 407(a) of Regulation S-K is set forth in our 2023 Definitive Proxy Statement under the captions MEETINGS AND COMMITTEES OF THE BOARD and RELATED PARTY TRANSACTIONS, respectively, and is incorporated in this report by reference. ITEM 14.\nPRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by Item 9(e) of Rule 14a-101 of the Exchange Act is set forth in our 2023 Definitive Proxy Statement under the captions Independent Registered Public Accounting Firm Fees and AUDIT COMMITTEE REPORT, and is incorporated in this report by reference.\nPART IV ITEM 15.\nEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nThe following documents are filed as part of this report:\nPage\nNo.\n1.\nFinancial Statements: See INDEX TO CONSOLIDATED FINANCIAL STATEMENTS in Part II, Item 8 of this Form 10-K for a list of financial statements filed as part of this report.\n2.\nFinancial Statement Schedules\nAll schedules are omitted because they are immaterial or not applicable.\n3.\nExhibit Index\nEXHIBIT INDEX\nIncorporated by Reference\nFiled or\nFurnished\nHerewith\nExhibit\nNumber\nDescription\nForm\nExhibit\nFiling\nDate\n3.1\nCertificate of Incorporation as amended July 9, 1986, April 9, 1990, March 16, 1995, November 13, 1997, April 15, 2002 and June 20, 2005\n10-K\n3.1\n12/23/2019\n3.2\nAmended and Restated By-laws of the Company dated as of September 7, 2016\n8-K\n3.2\n9/13/2016\n4.1\nDescription of Securities of the Company\n10-K\n4.1\n12/23/2019\n4.2\nCertificate of Amendment with Respect to Series A Preferred Stock, dated September 24, 2019\n8-K\n3.1\n9/24/2019\n10.1\nThe Companys 1992 Employee Stock Purchase Plan\n10-K\n10.1\n12/20/2017\n10.2\nAmendment to the Employee Stock Purchase Plan as of March 24, 2004+\n10-K\n10.2\n1/6/2017\n10.3\nAmendment to the Employee Stock Purchase Plan as of April 8, 2010+\n10-K\n10.4\n1/7/2016\n10.4\nAmendment to the Employee Stock Purchase Plan as of March 28, 2012+\n10-K\n10.4\n12/21/2018\n10.5\nAmendment to the Employee Stock Plan as of December 18, 2019+\n10-K\n10.5\n12/23/2019\n10.6\n2016 Equity Incentive Compensation Plan+\nDEF 14A\n2/29/2016\n10.7\nThe Companys 2007 Long-Term Equity Incentive Plan+\nDEF 14A\n2/23/2007\n10.8\nAmendment to the 2007 Long-Term Equity Incentive Plan as of April 8, 2010+\n10-K\n10.7\n1/7/2016\n10.9\nAmendment to the 2007 Long Term Equity Incentive Plan as of April 11, 2014+\n10-K\n10.7\n12/23/2019\n10.10\n2011 Executive Incentive Compensation Plan effective as of November 1, 2010+\n10-K\n10.9\n1/6/2015\n10.11\nJoint Venture Framework Agreement dated November 20, 2013, between the Company and Dai Nippon Printing Co., Ltd.#\n10-K/A\n10.19\n7/8/2015\n10.12\nJoint Venture Operating Agreement dated November 20, 2013, between the Company and Dai Nippon Printing Co., Ltd.#\n10-K/A\n10.20\n7/8/2015\n10.13\nOutsourcing Agreement dated November 20, 2013, among the Company, Dai Nippon Printing Co., Ltd and Photronics Semiconductor Mask Corporation#\n10-K/A\n10.21\n7/8/2015\n10.14\nLicense Agreement dated November 20, 2013, between the Company and Photronics Semiconductor Mask Corporation#\n10-K/A\n10.22\n7/8/2015\n10.15\nLicense Agreement dated November 20, 2013, between Dai Nippon Printing Co., Ltd and Photronics Semiconductor Mask Corporation#\n10-K/A\n10.23\n7/8/2015\n10.16\nMargin Agreement dated November 20, 2013, among the Company, Dai Nippon Printing Co., Ltd and Photronics Semiconductor Mask Corporation#\n10-K/A\n10.24\n7/8/2015\n10.17\nMerger Agreement dated November 20, 2013, between Photronics Semiconductor Mask Corporation and DNP Photomask Technology Taiwan Co., Ltd.#\n10-K/A\n10.25\n7/8/2015\n10.18\nExecutive Employment Agreement between the Company and Christopher J. Progler, Vice President, Chief Technology Officer dated September 10, 2007+\n10-K\n10.18\n12/23/2019\n10.19\nExecutive Employment Agreement between the Company and Richelle E. Burr dated May 21, 2010+\n10-K\n10.30\n1/7/2016\n10.20\nExecutive Employment Agreement between the Company and John P. Jordan dated September 5, 2017+\n10-K\n10.31\n12/20/2017\n10.21\nEmployment Agreement dated March 9, 2020, between Photronics Dai Nippon Mask Corporation, Photronics and Frank Lee\n10-Q\n10.36\n3/11/2020\n10.22\nForm of Amendment to Executive Employment Agreement dated March 16, 2012+\n10-K\n10.23\n12/23/2019\n10.23\nFourth Amended and Restated Credit Agreement dated as of September 27, 2018, among Photronics, Inc. the Foreign Subsidiary Borrower Party Thereto, the Lender Party Thereto, JPMorgan Chase Bank, N.A. as Administrative and Collateral Agent and Bank of America, N.A. as syndication agent\n10-K\n10.24\n12/21/2018\n10.24\nThird Amended and Restated Security Agreement entered into as of September 27, 2018, by and among Photronics, Inc., the subsidiaries of the Company and JPMorgan Chase Bank N.A\n10-K\n10.25\n12/21/2018\n10.25\nFixed Asset Loan Agreement between Photronics DNP Mask Corporation Xiamen and Industrial and Commercial Bank China Limited Xiamen Xiangan Branch\n10-K\n10.26\n12/21/2018\n10.26\nWorking Capital Loan Agreement between Industrial and Commercial Bureau China Limited Xiamen Xiangan Branch and Photronics DNP Mask Corporation Xiamen effective as of November 7, 2018\n10-K\n10.27\n12/21/2018\n10.27\nInvestment Agreement between Xiamen Torch Hi-Tech Industrial Development Zone Management Committee and Photronics Singapore Pte. Ltd.\n10-Q\n10.35\n9/2/2016\n10.28\nAmendment No. 1 to the Investment Agreement between Xiamen Torch Hi-Tech Industrial Development Zone Management Committee and Photronics Singapore Pte, Ltd. #\n10-K\n10.29\n12/23/2019\n10.29\nAmendment No. 2 to the Investment Agreement between Xiamen Torch Hi-Tech Industrial Development Zone, Peoples Government of Xiangan Xiamen, Photronics Singapore Pte. Ltd., DNP Asia Pacific Pte and Xiamen American Japan Photronics Mask Co., Ltd. #\n10-Q\n10.41\n3/10/2022\n10.30\nAmendment No. 3 to the Investment Agreement between Xiamen Torch Hi-Tech Industrial Development Zone, Peoples Government of Xiangan Xiamen, Photronics Singapore Pte. Ltd., DNP Asia Pacific Pte and Xiamen American Japan Photronics Mask Co., Ltd. #\n10-Q\n10.42\n3/10/2022\n10.31\nContribution Agreement dated May 16, 2017 among Dai Nippon Printing Co., Ltd. (DNP), DNP Asia Pacific Pte. Ltd. (DNP Asia Pacific), Photronics, Inc. (Photronics), Photronics Singapore Pte. Ltd., (Photronics Singapore), and Xiamen American Japan Photronics Mask Co., Ltd. (PDMCX)#\n10-Q/A\n10.26\n12/19/2017\n10.32\nJoint Venture Operating Agreement dated May 16, 2017, among Photronics, Photronics Singapore, DNP, and DNP Asia Pacific#\n10-Q/A\n10.27\n12/19/2017\n10.33\nOutsourcing Agreement dated May 16, 2017, among Photronics, DNP, Photronics DNP Photomask Corporation (PDMC) and PDMCX#\n10-Q/A\n10.28\n12/19/2017\n10.34\nAmended and Restated License Agreement dated May 16, 2017 between DNP and PDMC#\n10-Q/A\n10.29\n12/19/2017\n10.35\nInvestment Cooperation Agreement between Hefei State Hi-tech Industry Development Zone and Photronics UK, Ltd.\n10-K\n10.42\n12/20/2017\n10.36\nMaster Lease Agreement dated October 12, 2020, between TD Equipment Finance and the Company\n10-K\n10.38\n1/15/2021\n10.37\nMaster Lease Agreement Dated September 5, 2019 between Bank of America and the Company\n10-Q\n10.28\n9/5/2019\n10.38\nFixed Asset Loan Contract dated October 1, 2020, between Hefei Photronics Mask Corporation and China Construction Bank Corporation\n10-K\n10.39\n1/15/2021\n10.39\nMaximum Mortgage Contract dated October 1, 2020 between Photronics Mask Corporation Hefei and China Construction Bank Corporation Hefei Shusshan Branch\n10-K\n10.40\n1/15/2021\nList of Subsidiaries of the Company\n10-K\nX\n23.1\nConsent of Deloitte & Touche LLP, Independent Registered Public Accounting Firm\n10-K\n23.1\nX\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a)/15d-14(a) of the Exchange Act, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n10-K\n31.1\nX\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a)/15d-14(a) of the Exchange Act, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n10-K\n32.2\nX\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n10-K\n32.1\nX\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n10-K\n32.2\nX\n101.INS\nInline XBRL Instance Document (the instance document does\nnot appear in the Interactive Data File because its XBRL tags\nare embedded within the Inline XBRL document)\n10-K\n101.INS\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n10-K\n101.SCH\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n10-K\n101.CAL\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n10-K\n101.DEF\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n10-K\n101.LAB\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n10-K\n101.PRE\nX\nCover Page Interactive Data File (formatted as inline XBRL and contained in, Exhibit 101)\nX\n+\nRepresents a management contract or compensatory plan or arrangement.\n#\nPortions of this exhibit have been omitted pursuant to a request for confidential treatment filed with the Securities and Exchange Commission.\nThe Company will provide a copy of any exhibit upon receipt of a written request for the particular exhibit or exhibits desired. All requests should be addressed to the Companys general counsel at the address of the Companys principal executive offices.\nITEM 16.\nFORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPHOTRONICS, INC.\n(Registrant)\nBy\n/s/ John P. Jordan\nBy\n/s/ Eric Rivera\nJohn P. Jordan\nExecutive Vice President, Chief Financial Officer\n(Principal Financial Officer)\nEric Rivera\nVice President, Corporate Controller\n(Principal Accounting Officer)\nDecember 23, 2022\nDecember 23, 2022\nPursuant to the requirements of the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy\n/s/ Frank Lee\nFrank Lee\nChief Executive Officer\nDirector\n(Principal Executive Officer)\nDecember 23, 2022\nBy\n/s/ John P. Jordan\nJohn P. Jordan\nExecutive Vice President, Chief Financial Officer\n(Principal Financial Officer)\nDecember 23, 2022\nBy\n/s/ Eric Rivera\nEric Rivera\nVice President, Corporate Controller\n(Principal Accounting Officer)\nDecember 23, 2022\nBy\n/s/ Constantine S. Macricostas\nConstantine S. Macricostas\nChairman of the Board\nDecember 23, 2022\nBy\n/s/ Walter M. Fiederowicz\nWalter M. Fiederowicz\nDirector\nDecember 23, 2022\nBy\n/s/ Adam Lewis\nAdam Lewis\nDirector\nDecember 23, 2022\nBy\n/s/ Daniel Liao\nDaniel Liao\nDirector\nDecember 23, 2022\nBy\n/s/ George Macricostas\nGeorge Macricostas\nDirector\nDecember 23, 2022\nBy\n/s/ Mary Paladino\nMary Paladino\nDirector\nDecember 23, 2022\nBy\n/s/ Mitchell G. Tyson\nMitchell G. Tyson\nDirector\nDecember 23, 2022"
}