{
    "cik": "825324",
    "company": "Good Times Restaurants Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-15",
    "period_of_report": "2022-09-27",
    "sic": "5812",
    "state_of_inc": "NV",
    "state_location": "CO",
    "fiscal_year_end": "0927",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/825324/0001214659-22-014979-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/825324/000121465922014979/gt112322010k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/825324/0001214659-22-014979.txt",
    "filename": "825324_10K_2022_0001214659-22-014979.htm",
    "content": "ITEM 1. BUSINESS\nOur Company\nGood Times Restaurants Inc., a Nevada corporation formed on October 6, 1996, operates Bad Daddys Burger Bar restaurants ( Bad Daddys) and Good Times Burgers & Frozen Custard ( Good Times) restaurants. Bad Daddys and Good Times are two distinctly different, restaurant concepts. Each is positioned as a unique brand within its respective segment of the industry. Bad Daddys operates in the full-service dining segment as a specialty burger bar concept and Good Times operates in the quick-service restaurant segment as a drive-thru focused concept focused on all-natural burgers, fries, frozen custard.\nThrough our subsidiaries, as of December 14, 2022, we own and operate, or license a total of forty-one Bad Daddys restaurants in seven states. We own and operate fourteen Bad Daddys restaurants in North Carolina, twelve traditional Bad Daddys restaurants in Colorado, five in Georgia, four in South Carolina, two in Alabama, two in Tennessee and one in Oklahoma. Of these restaurants, five restaurants are operated through limited partnership arrangements where we are the operating partner and own between approximately 23% and 75% interest in the partnership entities. We license the Bad Daddys brand for the Bad Daddys restaurant located in the Charlotte Douglas International Airport which is owned and operated by a third-party licensee.\nWe currently own and operate or franchise thirty-one total Good Times restaurants. Of these restaurants, twenty-nine are in Colorado. Two of the restaurants are in Wyoming and are dual brand concept restaurants operated by a franchisee of both Good Times and Taco Johns.\nThe terms we, us, our, the Company, Good Times and similar terms refer to Good Times Restaurants Inc., a Nevada corporation, and its wholly-owned consolidated subsidiaries, including Bad Daddys Franchise Development, LLC; Bad Daddys International, LLC (BDI); Good Times Drive-Thru Inc. (Drive Thru); and BD of Colorado, LLC. (BD of Colo) Unless otherwise indicated or the context otherwise requires, financial and operating data in this 10-K report reflect the consolidated business and operations of Good Times Restaurants Inc. and its subsidiaries.\nThe Companys fiscal year is a 52/53-week year ending on the last Tuesday of September. In a 52-week fiscal year, each of the Companys quarterly periods comprise 13 weeks. The additional week in a 53-week fiscal year is added to the first quarter, making such quarter consist of 14 weeks. Our discussion for fiscal years 2022 and 2021, which ended on September 27, 2022 (‘fiscal 2022) and September 28, 2021 (fiscal 2021), respectively, each cover periods of 52 full calendar weeks.\nFiscal 2022 Financial & Brand Highlights\n● Our net revenues for fiscal 2022 increased by $14,247,000 (11.5%) to $138,200,000 from $123,953,000 in fiscal 2021, primarily due to double-digit same store sales for Bad Daddys and positive same store sales for Good Times, and the purchase of one previously-franchised Bad Daddys restaurant during fiscal 2022.\n● The Bad Daddys brand had a 11.2% increase in same store sales for fiscal 2022.\n● The Good Times brand had a 1.1% increase in same store sales for fiscal 2022.\n● We acquired one previously-franchised Bad Daddys restaurant in Greenville, South Carolina during fiscal 2022.\n● One company-owned Good Times restaurant closed during fiscal 2022.\n● We ended fiscal 2022 with $8.9 million in cash and no long-term debt.\nSame store sales for each brand represents the comparison of restaurant sales in the current year, to the same comparable weeks in the immediately preceding fiscal year for those stores open for at least 18 months.\nRecent Developments\nMacro Economic Factors and Operating Environment\nThe global crisis resulting from the spread of coronavirus (COVID-19) impacted our restaurant operations for the fiscal years ended September 27, 2022 and September 28, 2021, though in fiscal 2022 the impact was more modest than in the prior year. During fiscal 2022, all restaurants remained open. We expect local conditions to continue to dictate limitations on restaurant operations, capacity, and hours of operation. COVID-19 has also contributed to labor challenges, which have increased hourly wages and management salaries at both concepts, and in limited cases have resulted in reduced operating hours at certain restaurants. Supply chain constraints have affected both of our concepts, resulting in higher food and beverage cost associated with general increases in input price levels as well as increased product substitutions, elevated freight costs, and increased variability in product quality, primarily in produce items. In addition, during fiscal 2022 and extending into fiscal 2023, high rates of inflation have been seen globally which have also resulted in increases in commodity, labor and energy costs for both concepts. Further significant increases in inflation could affect the global and U.S. economies, which could have an adverse impact on our business and results of operations if we and our franchisees are not able to adjust prices sufficiently to offset the effect of cost increases without negatively impacting consumer demand.\nAlthough we conduct all of our restaurant operations within the USA, worldwide product supply chains have been impacted by the war in Ukraine. Specifically sunflower oil and wheat, which are fungible commodities, are used as ingredients in our raw materials and purchased by our suppliers, have significant supplies that typically originate in Ukraine. The lack of availability of supplies of such products may impact the availability and supplier pricing for products purchased by us for use in our business, which could result in higher food and packaging costs or reduced revenues.\nWe currently have a meaningful cash balance and generated significant cash flow from operations during fiscal 2022. We used a portion of this cash balance to repurchase Company stock by means of the Stock Repurchase Program during fiscal 2022 as described below.\nShare Repurchase\nOn February 7, 2022, the Companys board of directors approved a program to purchase shares of its common stock at an aggregate amount of up to $5.0 million dollars. As of September 27, 2022, a total of 316,447 shares have been repurchased under the plan at an aggregate cost of approximately $1,065,000.\nDebt\nThe Company maintains a credit agreement with Cadence Bank (Cadence) pursuant to which, as amended, Cadence has agreed to loan the Company up to $8,000,000 with a maturity date of January 31, 2023 (as amended, the Cadence Credit Facility). As amended by the various amendments, the Cadence Credit Facility accrues commitment fees on the daily unused balance of the facility at a rate of 0.25%. As of the date of filing of this report, any borrowings under the Cadence Credit Facility, as amended, bear interest at a variable rate based upon the Companys election of (i) 2.5% plus the base rate, which is the highest of the (a) Federal Funds Rate plus 0.5%, (b) the Cadence Bank publicly announced prime rate, and (c) LIBOR plus 1.0%, or (ii) LIBOR, with a 0.250% floor, plus 3.5%. Interest is due at the end of each calendar quarter if the Company elects to pay interest based on the base rate and at the end of each LIBOR period if it elects to pay interest based on LIBOR. The Cadence Credit Facility includes provisions for the Administrative Agent of the facility to amend the facility to replace LIBOR with an alternate benchmark rate, which may be (but is not required to be) SOFR, at such point in time when appliable LIBOR rates are no longer available or no longer reliable. The exact timing of any transition of LIBOR to an alternate benchmark rate is not currently known. The Company is currently reviewing its future credit facility needs and intends to negotiate an amendment to the existing credit agreement or enter into a new credit agreement prior to January 31, 2023.\nAs of the date of filing of this report, the Cadence Credit Facility contains certain affirmative and negative covenants and events of default that the Company considers customary for an agreement of this type, including financial covenants setting a maximum leverage ratio of 5.15:1, a minimum pre-distribution fixed charge coverage ratio of 1.25:1, a minimum post-distribution fixed charge coverage ratio of 1.10:1 and minimum liquidity of $2.0 million. As of the date of filing of this report, the Company was in compliance with all of these financial covenants under the Cadence Credit Facility.\nAs a result of entering into the Cadence Credit Facility and the various amendments, the Company paid loan origination costs including professional fees of approximately $308,500 and is amortizing these costs over the term of the credit agreement. As of September 27, 2022 the unamortized balance of these fees is $20,000.\nThe obligations under the Cadence Credit Facility are collateralized by a first-priority lien on substantially all of the Companys assets.\nAs of the date of filing of this report, there were no outstanding borrowings against the facility. Availability of the Cadence Credit Facility for borrowings is reduced by the outstanding face value of any letters of credit issued under the facility. As of the date of filing of this report, there were no outstanding letters of credit issued under the facility.\nOn May 7, 2020, Good Times and three of its wholly-owned subsidiaries, BDI, Drive Thru, and BD of Colo (each a Borrower), entered into unsecured loans in the aggregate principal amount of $11,645,000 (the Loans) with Cadence Bank, N.A. (the Lender) pursuant to the Paycheck Protection Program.\nIn June 2021, the SBA approved forgiveness in full of the Loans, including accrued interest, in the aggregate amount of $11,778,226, which was recognized as gain on debt extinguishment in the fiscal year ended September 28, 2021. The principal and accrued interest balance on each of these Loans is now zero, as of the forgiveness date specific to each of the Companys and its subsidiaries Loans.\nTotal interest expense on notes payable was $20,000 and $269,000 for fiscal 2022 and fiscal 2021, respectively.\nConcepts\nBad Daddys Burger Bar\nBad Daddys Burger Bar is a full-service, casual dining small box better burger concept. Bad Daddys currently operates all of its company-owned restaurants under a table service / full-bar service model.\nThere are three primary elements of the concept that we believe differentiates us from our competition:\n1. Scratch Cooking. The menu consists of chef-inspired burgers, sandwiches, main-course salads, and appetizers carefully crafted in-house with high-quality ingredients to deliver bold flavor profiles along with portion sizes and presentations that are uncommon in the casual dining segment of the industry. Beyond simply assembling finished ingredients on a plate, many of our sauces, dressings, and even our housemade American cheese are prepared from scratch in our restaurant kitchens. We offer our guests an extensive ability to customize their burgers and salads, including Create Your Own Burgers and Salads, restricted only by the ingredients available in the kitchen, which include a variety of different protein options including bison, turkey, chicken, salmon, and plant-based protein.\n2. A Bad Ass Bar. The food menu is complemented by a full bar that focuses on local and craft beers and proprietary, handcrafted cocktails. Two specialties are our Bad Daddys Amber Ale, available only at Bad Daddys, and our Bad Ass Margarita. System-wide, total alcoholic beverages have historically accounted for approximately 15% of sales in our Bad Daddys restaurants. As off-premises sales have increased resulting from the COVID-19 pandemic, alcoholic beverage sales have declined to approximately 12.6% of restaurant sales. We focus on making our bar a place where both newcomers and regular guests can comfortably relax and enjoy a beverage at happy hour, with their meal, or at any other time of day.\n3. Genuine Hospitality. The restaurants have a high-energy yet family friendly environment with iconic pop culture design elements and a personal, ultra-friendly and informal service platform with a legacy of southern hospitality. Bad Daddys menu, service and environment are designed around an irreverent brand personality, including unique menu items, iconic Farrah Fawcett and Paul Newman Cool Hand Luke posters in the mens and womens restrooms and our own playlist of classic rock and modern rock music that adds to the high energy atmosphere.\nWhile clearly available for on-premises customers, all three of these elements are available for our off-premises guests as well, as we (1) offer the same customization on our off-premises ordering platforms as we offer in-restaurant, (2) where allowable by state or local regulation, we also provide our alcoholic beverages in an off-premises format for those customers who are ordering their meal for carryout or delivery, and (3) we offer the same level of hospitality to our carry-out guests and tightly manage our delivery service providers to a similar expectation of over-the-top service.\nThis brand positioning results in transactions that generate average sales per transaction of approximately $35. The lunch daypart (open until 2pm) represents approximately 35% and the happy hour and dinner dayparts (2pm until close) represent approximately 65% of restaurant sales. Off-premise sales, including take-out, delivery and curbside pickup, accounted for approximately 27% of all system-wide sales in Fiscal 2022. Off-premise sales average $29 per transaction while on-premise sales average $36 per transaction.\nA typical Bad Daddys restaurant is approximately 3,500-4,000 square feet with an enclosed patio, smaller than most other chain casual dining restaurants. Fiscal 2022 average restaurant sales averaged $2.57 million per restaurant resulting in average sales per square foot of approximately $670. We believe this is a key metric indicating the strength and expansion potential of the concept.\nWhile sharing common design elements, each restaurant has unique features intended to represent the local trade area of each Bad Daddys and serves as a further point of differentiation from the larger casual dining chains. We believe Bad Daddys innovative menu and personalized service combined with a unique, fun restaurant design enhance our customers experience and differentiate Bad Daddys from its competitors.\nGood Times Burgers & Frozen Custard\nGood Times is a drive-thru, quick-service hamburger-focused restaurant concept offering fresh, 100% all-natural beef and chicken. We own and operate twenty-three Good Times restaurants, and franchise an additional eight, located primarily in the Denver market and along the front range of Colorado. We believe Good Times was the first quick-service chain in our region, and one of the first in the country, to offer a menu of fresh all-natural Angus beef and all-natural chicken from animals that are humanely raised and vegetarian fed without the use of added hormones, steroids, or antibiotics.\nWe compete primarily on the quality of our products, consistently prompt service, and order accuracy. We support our quality position by using only all-natural beef and chicken. Our all-natural frozen custard is made fresh throughout the day. These quality commitments help Good Times challenge quick-serve restaurant norms and match quality found at fast casual restaurants. Our focus on speed of service keeps our customers happy as most of our sales come from the drive thru. With menu innovation, we strive to create flavor profiles unique to Good Times. We have rotating limited time menu items and custard flavors. Our customers appreciate that we support local causes and do not take ourselves too seriously. Good Times makes use of various media but primarily communicate these advantages and promotions through the use of terrestrial radio and digital audio streaming.\nOur average per person check is approximately $14.17, which we believe is slightly lower than the average check at fast casual hamburger concepts such as Habit Burger, Five Guys, and Smashburger, but well above the typical quick-service restaurant average check such as McDonalds, Wendys and Burger King. We do not offer a low-priced value menu like most national quick-service chains, choosing to define our value proposition based on quality ingredients with a specific focus on all-natural beef and chicken and products spanning a range of price choices within each of our menu categories. We have shifted our focus to a blend of quality and speed while slightly reducing the number of items on the menu.\nGood Times is primarily a drive-thru concept, as all our restaurants have at least one drive-thru lane and generally have a walk-up window where customers may additionally place orders. Most of our restaurants have no indoor seating and consist of one drive-thru lane and outdoor patio seating. Speed of service in this segment is critical for success and we average less than three-minute transaction times, as measured from the time the customer places their order until they leave the drive-thru lane. Prior to the COVID-19 pandemic, even in our restaurants that feature dine-in seating, a majority of our sales were conducted through the drive-thru lane. Due to staffing constraints and customer preference for drive thru, our dining rooms remain closed.\nThe success of our strategy is evident in our long-term same-store sales growth (sales growth over the prior year period at restaurants open more than 18 months, also referred to as comparable sales). Same store sales increased 1.1% in fiscal 2022, and 10.5% in fiscal 2021, and five-year sales growth of 20.3%.\nOur Business Strengths\nOur Brands Are Complementary\nWhile operating in different segments of the restaurant industry, our two brands complement each other in both their similarities and differences:\nEach has a value proposition enhanced by superior quality ingredients and a focus on the specific elements of service relevant to the concept that deliver an exceptional experience to each guest. We believe Bad Daddys resonates with consumers by consistently executing high-quality, scratch-made menu items with bold flavors delivered in a high-energy environment with a slightly irreverent brand personality. The appeal of Bad Daddys is not solely based on a purely on-premise customer experience however, as the focus we place on bold, unique flavors; superior ingredients; and scratch cooking in each kitchen translates into significant off-premise adoption, both through traditional customer carry-out and delivery by third party delivery service providers.\nWe believe Good Times is the only drive-thru quick-service chain in our region with an all-natural platform. We do not offer a low-priced value menu as many national quick-service chains do, choosing to compete on a market position emphasizing quality with a specific focus on all-natural beef and chicken, and with a variety of price points across the menu with quick-service restaurant speed of service. The quick-service, and in particular, drive-thru format of our Good Times concept offers a balancing effect to business cycles that are common in the full-service segment of the restaurant industry.\nOur Brands Have a Common Culture and Operating Philosophy\nWhile each of our brands is led by separate operating teams, each shares a commitment to four core values and four dimensions of our business:\n● Core Values. Each brand focuses on developing behaviors and expectations around our core values, which are: Hospitality, Integrity, Respect, and Entrepreneurship.\n● Dimensions of the Business:\no Individual Fulfillment. Our first value speaks directly to people, whether that is fellow team members or our customers. Specific to our team members, we seek to hire people with aligned values and the appropriate knowledge and skills throughout the organization, provide them with comprehensive training programs, and provide a framework for self-directed, company-supported continuous development, as we believe that the individual fulfillment achieved from self-actualized team members with aligned values will deliver consistently superior products and service. We maintain incentive programs at all levels of management based on balanced metrics addressing performance related to people development and retention; consistent, strong operations; and superior economic value creation.\no Our Guests Emotional Connection. Rather than merely being a feeding trough for the masses, we strive to differentiate our concepts in a way that creates an emotional connection by the guest to each brand. This emotional connection drives loyalty and long-term strength in same-store-sales.\no Operational Excellence. We are content with neither mediocrity nor the status quo, even if it is good enough. Rather we strive for excellence in execution, whether that is within the operations of our restaurants, or the operations of our shared services capabilities. We: (1) do things the right way, (2) take pride in our work, (3) take pride in our facilities, and (4) take pride in our brand. The pride that is shared by all of us drives us towards excellence in all of our activities.\no Financial Discipline and Strength. While growth is important, it needs to be sensible and bounded by financial strength. We want to achieve both growth in unit volumes and growth in number of units, but at the same time maintain a low debt load.\nOur Brands Have Growth Potential\nWe believe both of our brands are well positioned to take advantage of consumers changing demands for restaurants, whether regarding the quality of the ingredients, the ability to customize their order exactly to their liking, or the ability to eat their food in a restaurant dining room, on a patio, in their car, or to either pick it up or have it delivered so they can eat it at their home or office. We believe Good Times and Bad Daddys are both well positioned to capitalize on those macro-trends.\nBoth of our brands currently operate with relatively small market penetration and overall development footprints, providing significant expansion potential. It is our goal to primarily grow our Bad Daddys brand and to do so relatively contiguously from our existing restaurants in order to maximize brand awareness and operating and distribution efficiencies.\nGood Times and Bad Daddys operate with a common point-of-purchase system and we have implemented a common back-office system for both brands. We are also continuing to invest in sophisticated digital training tools, making each brands restaurant level processes, systems, recipes and management tools available in one commonly accessible database.\nWe Have Assembled a Dedicated Senior Leadership Team with Significant Experience\nEach of the members of our senior leadership team have more than fifteen years of relevant experience in their field of expertise, and nearly all have more than fifteen years of industry experience, with some members having worked together for more than twenty years developing the Good Times concept. Our executive leadership team has significant experience in both full service and quick service restaurant concepts.\nEach brand is operated with distinct operations teams led by its own operations leader, while utilizing shared support capabilities in administration, finance, accounting, human resources, development, marketing and information technology, each capability led by its own qualified leader with many years of functional and leadership experience. We believe we have people with the right expertise as well as capable processes and systems in place to support both concepts and targeted future growth of the Bad Daddys concept.\nWe Have Maintained Operating Momentum\nSame-store sales at Good Times have increased ten of the past eleven years. Same-store sales increased for fiscal 2022 primarily due price increases throughout the fiscal year, partially offset by decreased foot traffic Our compound annual same-store sales growth rate was approximately 3.5% from fiscal 2015 to fiscal 2022. We believe this performance is largely the result of the evolution in our brand positioning, the re-imaging of several of our older restaurants, effective management of media mix, and consistent execution of the customer experience. We plan to continue to periodically re-image and remodel our restaurants, maintain a relevant menu with a laser focus on speed and accuracy in execution, in keeping with our brand strategy, and communicate our brand story to maintain our same-store sales growth.\nThe Bad Daddys concept was started in 2007 in Charlotte, North Carolina by a qualified chef and was initially expanded in partnership with a serial restaurant entrepreneur who remains a non-controlling partner in five of our Bad Daddys restaurants. Sales of the Bad Daddys restaurants which were open for at least 18 months averaged $2.6 million for fiscal 2022. We purchased one previously-franchised Bad Daddys during the second fiscal quarter of 2022. We opened two new Bad Daddys restaurants during fiscal 2021 The consistency of our sales growth following the reopening of our dining rooms gives us confidence in the strength of the Bad Daddys concept and the ability for us to deliver upon our pre-pandemic model in a post-pandemic world, such that we expect significant long-term expansion potential, both in our existing markets and in new markets, though we expect such expansion to be disciplined and financed primarily from operating cash flow from the Bad Daddys business.\nBusiness Strategies\nWe are focused on continuing to grow same store sales and improve the profitability of the Good Times concept while continuing targeted unit growth of the Bad Daddys Burger Bar concept in domestic markets. We believe that there are significant opportunities to develop new units, grow customer traffic and increase awareness of our brands. The following sets forth the key elements of our growth strategy:\n1. Organic sales growth in both brands. We intend to continue to focus on increasing our same-store sales. We plan to further strengthen our fresh, all-natural brand positioning at Good Times with targeted merchandising around each of our menu categories and a targeted focus on speed and accuracy in execution instead of deep discounts or exotic, limited-reach menu items. We also expect to continue various advertising programs, shifting the media mix periodically as we determine appropriate to maximize advertising effectiveness and efficiency. At Bad Daddys, as we emerge from the restrictions and limitations posed on us, we intend to continue to highlight our ease of access to our concept whether the dining occasion is an on-premise or off-premise format, through continued partnerships with delivery service providers, and identifying innovative ways to better reach all potential customers. We further intend to increase Bad Daddys same store sales through ongoing menu engineering around bold flavors and unique, concept-appropriate menu items that we believe drive increased customer visits as well as elevated per person average check. Bad Daddys advertising has traditionally targeted individual trade areas, community involvement and in-store, four-wall marketing activities that focus on optimizing the guests food, bar and service experience. We have enhanced those efforts by leveraging third parties who specialize in social and digital media advertising design.\n2. Improve operational capabilities. We continue to focus on managing our expenses in the operation of our restaurants, with a particular focus on cost of sales, labor and operating expense controls and efficiencies while not adversely impacting our overall quality and service proposition. Macroeconomic, state legislative increases to wages and other external factors have resulted in upward trends in certain of these operating costs. We continue to implement programs to mitigate the impact of these external factors and continue to explore other opportunities to improve efficiency of general and administrative costs. We placed an elevated level of focus in managing overhead costs and gaining further efficiencies in supervision and support services costs and believe that those costs will be relatively stable, though we expect to invest in modern human resource and financial planning systems that will provide improved abilities for our restaurant leaders and support capability leaders to best create value for the business.\n3. Pursue disciplined unit growth of Company-operated Bad Daddys Burger Bar restaurants. We own the Bad Daddys Burger Bar brand, including all associated intellectual property. We have identified potential new restaurant locations in the southeast U.S. market which are in various stages of negotiation. We continue to assess our development strategies and intend to follow a disciplined strategy of unit growth that may include both company-owned and franchisee-owned units. Consistent with our business dimension of Financial Discipline and Strength, we expect that growth in company-owned restaurants will remain more modest than it has been in the past and will stem from operating cash flow rather than through the use of significant debt financing to drive more rapid growth.\nExpansion strategy and site selection\nBad Daddys Burger Bar\nOur development of the Bad Daddys Burger Bar concept in company-owned restaurants has focused on urban and suburban upper income demographic areas with median household incomes over $70,000, with a high concentration of daytime employment, specialty retail and entertainment venues. We use specialized software to create a sales forecast for each site and have continued to update the data in that site forecasting software even as we had limited growth during 2022. We expect to utilize this software as one component of decision making in the selection of sites for future Bad Daddys restaurant locations.\nBad Daddys Burger Bar locations are primarily end-cap locations in new and existing shopping center developments using approximately 3,500 to 4,000 square feet. While our Good Times restaurants are free standing and require extensive site development and entitlement processes, Bad Daddys Burger Bar restaurants can be developed much more quickly due to the requirement for only a building permit, signage approvals and liquor license without the need for extensive on-site and off-site development or land and zoning submittals and modifications. We estimate that it will take approximately 120 to 150 days to develop a Bad Daddys Burger Bar from the time a building permit is issued. We expect that the majority of the Companys unit growth will be through the development of additional Bad Daddys Burger Bar locations.\nGood Times Burgers & Frozen Custard\nWe do not have explicit plans to develop additional Good Times restaurants, as we continue to refine the economic model of our primarily drive-thru business. However, we expect that any opportunistic development in Good Times locations would be through a lens of growth in Colorado and potentially surrounding states, which would preserve operating and marketing efficiencies created by the geographic concentration of our existing base of restaurants. Any development of new Good Times restaurants would involve a new prototype restaurant design focused primarily on drive-thru with an outside patio but without any enclosed dining room.\nWe currently lease either the land or the land and building for all of our Good Times restaurants. If we were to develop additional sites, a lease/buy decision would be based upon the economics of the property and our long-term point of view on the underlying real estate and do not have an explicit preference for leasing in the case of future Good Times restaurants. Our primary site objective is to secure a suitable site, with the decision to buy or lease as a secondary objective. Our site selection process includes evaluating several criteria, including a mix of substantial daily traffic, density of at least 30,000 people within a three-mile radius, strong daytime population and employment base, retail and entertainment traffic generators, good visibility and easy access.\nRestaurant locations\nAs of December 14, 2022, we own and operate or license a total of forty-one Bad Daddys Burger Bar locations. The location in the Charlotte Douglas International Airport is operated pursuant to a License Agreement. We purchased one Bad Daddys restaurant from a franchisee during fiscal 2022. We opened two company-owned Bad Daddys restaurants during fiscal 2021. We additionally had one non-traditional location in which we operated the kitchen of a local craft brewers taproom under the brand name Bad Daddys at Tivoli. This location opened in August 2021 and closed in August 2022.\nAdditionally, we own and operate or franchise a total of thirty-one Good Times restaurants. One company-owned Good Times restaurant closed due to the landlords purchase of the companys remaining lease term for the purpose of redevelopment. Additionally, one company-owned Good Times restaurant closed, and the property was subleased during fiscal 2021.\nCompany-Owned/Co-Developed/Joint-Venture\nBad Daddys\nBurger Bar Good Times Burgers\n& Frozen Custard Total\n2021\nAlabama - -\nColorado 24\nGeorgia - -\nNorth Carolina - -\nOklahoma - -\nSouth Carolina - -\nTennessee - -\nTotal 24\nFranchise/License\nBad Daddys\nBurger Bar Good Times Burgers\n& Frozen Custard Total\n2021\nColorado - - 6\nNorth Carolina - -\nSouth Carolina - - - -\nWyoming - - 2\nTotal 8\nMenu\nBad Daddys Burger Bar\nThe Bad Daddys Burger Bar menu offers our guests a culinary-driven menu consisting of our own unique blend of high quality and handcrafted Angus beef burgers with creative, scratch-made toppings including buttermilk-fried bacon, housemade American cheese, creamy ale queso made in-house with our Bad Daddys Amber Ale, and our specialty signature Bad Daddys sauce. The customizable menu options also include a variety of proteins including black bean, salmon, turkey, bison and chicken. Additionally, we offer giant chopped salads, a full gluten-friendly menu, appetizers including hand-cut fries and housemade potato chips, hand-spun ice cream milk shakes and our scratch-made southern-style banana pudding. We feature a variety of craft beers from local breweries and a full bar serving spirits, innovative cocktails, and wines including our signature Red and White pours.\nOur signature recipes include the Bad Ass Burger; Sam I Am Burger and Emilios Chicken Sandwich. Signature Chopped Salads include the Texican Chicken Salad and the Stellas Greek Salad. However, the true differentiator for the brand is our customers ability to build their meal exactly the way they would like. The Bad Daddys Create Your Own menu allows full customization of burgers and salads offering over sixty topping options. Weve partnered with Tivoli Brewing, a premier craft brewer in Denver, and Breckenridge Brewing, to make our Bad Daddys draft brews including Bad Daddys Amber, IPA, and Light brews. Our creative cocktail menu uses fresh-squeezed housemade sours and fresh garnishes in our signature Bad Ass Margaritas and features creative and timeless options including the Daddys Dragonberry and spiked milkshakes.\nBad Daddys Burger Bar strives to provide proprietary flavors and recipes available nowhere else with fresh, handcrafted quality throughout the menu paired with genuine and warm hospitality. We also commit to making occasional changes to keep our menu fresh for our guests while still maintaining the spirited flavor profiles that distinguish us from others. In addition, we have rotating chef specials with flavor profiles unique to Bad Daddys. At times we also feature a burger with local ingredients with a giveback to a local charity.\nGood Times Burgers & Frozen Custard\nThe menu of each Good Times restaurant is focused primarily on hamburgers, cheeseburgers, chicken sandwiches and chicken tenders that are fresh, never frozen, and using only all-natural beef and chicken. This menu is supplemented by side selections including two types of french fries, green chile potato poppers, and onion rings. Beverages include typical soft drinks and fresh lemonades, with a selection of frozen custard products. We have a limited breakfast menu consisting of breakfast burritos, orange juice and coffee and a kids meal menu featuring a choice of main item, side, drink, and a wooden nickel that can be redeemed for a free kids cup or cone of custard.\nOur hamburger patties are made with Meyer all-natural, all-Angus beef. Our chicken products are sourced from Springer Mountain Farms, which provides all-natural, antibiotic free, humanely-raised chicken. All-natural Angus beef and chicken are raised without the use of any hormones, antibiotics or animal byproducts that are normally used in the open market. We believe that all-natural beef and chicken deliver a better tasting product and, because of the rigorous protocols and testing that are a part of the Meyer all-natural, all-Angus Beef and Springer Mountain Farms Chicken processes, may also minimize the risk of any food-borne bacteria-related illnesses. We also believe that the use of premium, all-natural beef and chicken products help us to differentiate our concept in a crowded quick-service segment of the restaurant industry.\nOur fresh frozen custard is a premium ice cream with a proprietary vanilla blend that is prepared from highly specialized equipment that minimizes the amount of air that is added to the mix and that creates smaller ice crystals than other frozen dairy desserts. The resulting product is smoother, creamier and thicker than typical soft serve or hard-packed ice cream products. We serve the frozen custard as vanilla and a flavor of the month in cups and cones and Spoonbenders, a mix of custard and toppings. Additionally, we offer eight flavors of shakes.\nThe breakfast menu is centered around Hatch Valley Green Chile Burritos made with our own proprietary green chile recipe using roasted green chiles sourced exclusively from Hatch Valley, New Mexico, eggs, potatoes, and cheese offered with the choice of bacon, sausage or chorizo. We also offer a premium coffee made by Daz Bog, a Colorado-based coffee roaster, and pure 100% orange juice.\nMarketing & Advertising\nBad Daddys Burger Bar\nOur marketing strategy for Bad Daddys Burger Bar focuses on iconic, in-store merchandising materials and local store marketing to the surrounding trade area around each restaurant, including public relations and community-based events. We generally do not focus on large media buys or traditional advertising, but on the in-store customer experience, building word-of-mouth reputation and recommendations and local public relations based on prior and recent awards and recognitions received by Bad Daddys. We have recently supplemented this with additional investments in social and digital media using third party resources who specialize in highly targeted advertisements on social media and digital platforms. We also use public relations, and trade area specific direct mail materials, particularly in support of new restaurant openings, to drive trial and initial awareness.\nGood Times Burgers & Frozen Custard\nOur marketing strategy for Good Times focuses on: 1) driving same store restaurant sales through attracting new customers and increasing the frequency of visits by current customers; 2) communicating specific product news and attributes to build strong points of difference from competitors; and 3) communicating a unique, strong and consistent brand personality.\nMedia is an important component of building our brand awareness and distinctiveness. We spent most of our broadcast advertising dollars on radio advertising during fiscal 2022 and fiscal 2021. We augment our broadcast advertising with a social media presence that affords us a higher level of engagement with current customers and an increased level of product giveaways to support high sales opportunity products. As with Bad Daddys, we have recently supplemented our legacy advertising approach with additional investments in social and digital media using third party resources who specialize in highly targeted advertisements on social media and digital platforms.\nOperations\nWe maintain separate operating teams for each of our concepts and have extensive operating, training and quality control systems in place.\nRestaurant Management\nBad Daddys Burger Bar was developed as a chef-driven concept and utilizes a team of three or four managers in our operations at most restaurants. Managers are cross-trained in back of the house skills (prep, kitchen positions and line management), front of the house service positions (host, server and bar) and all management functions, however each manager is assigned one or more specific areas of responsibility over which they have ownership and direct accountability for results. Our managers at each restaurant participate in a bonus pool for each restaurant based on a combination of restaurant sales, income, and specific financial and operational objectives. As a full-service concept, our operating leadership structure for Bad Daddys Burger Bar operations is distinct and separate, including a separate operations leader, from our Good Times operations team as the experience, qualifications and compensation of team members are significantly different between the quick service and full-service segments of the industry. Although this is the case, we have combined recruiting into a single shared services capability and believe that long-term our training capabilities for the brands will similarly be combined into single shared services capability.\nEach Good Times restaurant employs a general manager, generally between one and three hourly assistant managers, up to four hourly shift managers and approximately 10 to 20 non-management team members, most of whom work part-time during three shifts. Most of our shift managers, assistant managers, and general managers are internally promoted from team member positions, and in order to become a shift manager, an eight- to ten-week program over which the team member becomes fully capable on all phases of the operation, is used to train a new shift manager. Ongoing training and development is provided as necessary. We believe that incentive compensation of our restaurant managers is essential to the success of our business. Accordingly, our general managers and assistant managers in each restaurant participate in a bonus program based upon meeting financial, customer service and quality performance objectives tied to a monthly scorecard of measures.\nOperational and Management Systems and Processes\nWe have implemented highly-effective operating systems and processes relative to those in the industry for both of our concepts. Detailed processes have been developed for all responsibilities that drive consistency across our system of restaurants and performance against our standards within different day parts. We utilize a combination of industry-leading labor programs and proprietary algorithms to determine optimal staffing needs of each restaurant based on its actual customer flow and demand. We also employ several additional operational tools to continuously monitor and improve speed of service, food waste, food quality, sanitation, financial performance and employee development. The order system at each Good Times restaurant is equipped with an internal timing device that displays and records the time each order takes to prepare and deliver.\nWe use several sources of customer feedback to evaluate each restaurants service and quality performance, including an extensive secret shopper program, telephone surveys, website comments and a customer feedback tool that aggregates all social media comments as well as store-by-store surveys each week for each restaurant. We believe that information will assist us in evaluating opportunities for improved execution of the customer experience.\nTraining\nWe strive to maintain quality and consistency in each of our restaurants for both Good Times and Bad Daddys through the careful training and supervision of our restaurant leadership team members and the establishment of, and adherence to, high standards relating to personnel performance, food and beverage preparation and maintenance of our restaurants. Each manager must complete an eight- to ten-week training program, be certified on several core processes and is then closely supervised to show both comprehension and capability before they are allowed to manage autonomously. We have a defined weekly and monthly goal-setting process around service, employee development, financial management and store maintenance goals for every restaurant. Additionally, we have a library of video training tools to drive training efficiencies and consistency at both brands.\nPrior to opening a new restaurant, a training and opening team travels to the new restaurant location to prepare for an intensive training program for all team members hired for the new restaurant opening. Part of the training team remains on-site for a period after the opening of the restaurant while an additional team provides several weeks of support following opening.\nRecruiting and Retention\nAt Bad Daddys we seek to hire experienced restaurant managers and operating partners. We support employees by offering competitive wages and benefits, including a matching 401(k) plan, medical insurance, and incentive plans at every level of management that are tied to performance against key goals and objectives. We motivate and prepare our employees by providing them with opportunities for increased responsibilities and advancement. We also provide various other incentives, including paid time off, communication allowances, incentive performance bonuses and referral bonuses. We have implemented an online screening and hiring tool that has proven to reduce hourly employee turnover.\nFranchising\nFor Bad Daddys Burger Bar, we have prepared forms of area rights and franchise agreements. We anticipate that a franchisee will typically pay a royalty of 4% to 5% of net sales and will participate in an advertising fund and local advertising by contributing up to 2% of net sales. Initial development and franchise fees are projected to be $35,000 per restaurant. We estimate that it will cost a Bad Daddys Burger Bar franchisee $590,000 to $1,382,000 to open a 3,500 to 4,000 square foot restaurant in an in-line or end-cap retail center, based on our knowledge of the development costs of the existing Bad Daddys Burger Bar restaurants. We are not currently actively soliciting new franchisees but are assessing potential future growth through the development of franchised Bad Daddys restaurants.\nFor Good Times, we have previously prepared forms of area rights and franchise agreements and advertising material to be utilized in soliciting prospective franchisees. We have historically sought to attract franchisees that are experienced restaurant operators, are well capitalized and have demonstrated the ability to develop one to five restaurants. We review sites selected for franchises and monitor performance of franchise units. Currently, we are not actively soliciting new franchisees but are assessing potential future growth through the development of franchised Good Times restaurants.\nWe currently have one license agreement for a Bad Daddys location in the Charlotte Douglas International Airport. We currently have six Good Times restaurants operating under franchise agreements in the greater Denver metropolitan area and two dual-branded franchised restaurants operate in Wyoming. In addition, seven joint-venture restaurants are operating in the Denver metropolitan area media market.\nWe actively work with and monitor our franchisees to ensure successful franchise operations as well as compliance with our systems and procedures. We advise the franchisee on menu, management training and marketing. On an ongoing basis we conduct standards reviews of all franchise restaurants in key areas including product quality, service standards, restaurant cleanliness and sanitation and food safety.\nManagement Information Systems\nThe systems in our restaurants are designed in a manner to minimize the amount of time our managers spend on administrative tasks. We utilize up-to-date versions of a leading point-of-sale system in each of our company-owned restaurants that captures transaction-level data required to support information about sales, product mix, and average check. Configuration of restaurant point-of-sales systems is performed by our technology share service capability.\nWe use a cloud-based back-office solution across both brands that collects sales, labor and cash data from the restaurant point-of-sale system in near real-time and is the primary source of capture for inventory and supply chain management information. This back-office solution interfaces with our primary financial accounting systems and provides all levels of management with relevant daily, weekly and monthly reports across substantially all store-level income and expense categories.\nFood Preparation, Quality Control & Purchasing\nWe believe that we have excellent food quality standards relative to the industry. Our systems are designed to protect our food supply throughout the preparation process. We inspect specific qualified manufacturers and work together with those manufacturers to provide specifications and quality controls. Our operations management teams are trained in a nationally recognized comprehensive safety and sanitation course specific to food service. Minimum cook temperature requirements, periodic line checks throughout the day, and daily facilities checklists ensure the safety and quality of both burgers and other items we use in our restaurants.\nWe currently purchase 100% of the food and paper supplies for our Good Times restaurants and the majority of the food and paper supplies for our Bad Daddys restaurants from US Foods. In addition, we maintain multiple approved suppliers for all key components of our menu to mitigate risk and ensure supply. Suppliers are chosen based upon their ability to provide (i) a continuous supply of product that meets all safety and quality specifications, (ii) logistics expertise and freight management, (iii) product innovation and differentiation, (iv) customer service, (v) transparency of business relationships and (vi) competitive pricing. Specified products are distributed to all restaurants through US Foods under negotiated contracts directly to our restaurants two to four times per week depending on restaurant requirements. We do not believe that the current reliance on these distributors will have any long-term material adverse effect since we believe that there are a sufficient number of other suppliers from which food and paper supplies could be purchased with little or no interruption in service. We do not anticipate any difficulty in continuing to obtain an adequate quantity of food and paper supplies of acceptable quality and at acceptable prices. We monitor the primary commodities we purchase and extend contract positions when applicable in order to minimize the impact of fluctuations in price and availability. However, certain commodities, primarily ground beef, remain subject to market price fluctuations.\nEmployees\nAt September 27, 2022, we had approximately 2,411 active employees of which 2,194 are hourly team members and 217 are salaried managers or professional staff working full time. Our set of values includes Respect and Care for people, including all of our employees, and one of the dimensions of our business is Individual Fulfillment. We strive to provide competitive salary and benefits, strong development opportunities, and a meaningful job or career for all of our employees and believe that this has translated into good employee relations. None of our employees are covered by a collective bargaining agreement.\nCompetition\nThe restaurant industry, including both limited service and full-service segments, is highly competitive. Bad Daddys Burger Bar competes with both local, regional, and national gourmet, better burger concepts as well as more legacy grill and bar concepts. As such, Bad Daddys competes with both full-service and limited-service better burger restaurants. There are other burger-centric fast casual concepts that operate at a lower average customer check than Bad Daddys Burger Bar and others in both fast casual and full-service formats that operate with a higher average customer check. We believe that we offer sufficient price choice to be able to compete effectively in the full range of such concepts. We believe that Bad Daddys Burger Bar has an advantage in the premium quality of our ingredients, unparalleled ability for guests to customize their order, distinctiveness of its atmosphere and the bold, unique flavors of our scratch-made, chef-inspired menu offerings. Nevertheless, Bad Daddys Burger Bar may be at a competitive disadvantage to other restaurant chains with greater name recognition and operating mass.\nGood Times competes with many other hamburger-oriented quick-service restaurants in the areas in which it operates. Many of these restaurants are owned and operated by regional and national restaurant chains, many of which have greater financial resources and experience than we do. In-N-Out, a California-based, burger-focused quick-service restaurant concept, has expanded into the Colorado market and Whataburger, a Texas-based burger-focused quick-service restaurant concept has announced its intent to expand into the Colorado market. Double drive-thru restaurant chains such as Rallys Hamburgers and Checkers Drive-In Restaurants, which currently operate double drive-thru restaurants in various markets in the United States, are not currently operating in Colorado. We are aware of only two significant quick-service competitors offering frozen custard as a primary menu item operating in the Colorado market and both have a significant presence in Midwestern markets that may be targeted for expansion. Additional fast casual hamburger restaurants are being developed in the Colorado market; however, these generally do not have drive-thru service and generate an average per person check that is meaningfully higher than the average check at a Good Times restaurant.\nWe believe that Good Times may have a competitive advantage in terms of quality of product compared to traditional quick-service hamburger chains. Early development of our double drive-thru concept in Colorado has given us an advantage over other drive-thru chains that may seek to expand into Colorado because of our brand awareness and present restaurant locations. Nevertheless, we may be at a competitive disadvantage to other restaurant chains with greater name recognition and marketing capability. Furthermore, most of our competitors in the fast-food business operate more restaurants, have been established longer, and have greater financial resources and name recognition than we do. There is also active competition for management personnel, as well as for attractive commercial real estate sites suitable for restaurants.\nIntellectual Property\nWe have registered our marks Bad Daddys Burger Bar and Good Times with the United States Patent and Trademark Office. We received approval of our federal registration of Bad Daddys Burger Bar in 2011 and Good Times in 2003. Additionally, we own trademarks or service marks that have been registered with the United States Patent and Trademark Office including, but not limited to, Bad Daddys Burger Bar EST. 2007, Big Daddy Bacon Cheeseburger, Spoonbender, and Happiness Made To Order. The registration for our Bad Daddys Burger Bar mark will be renewed prior to September 2031. The registration for our Good Times marks will be renewed prior to December 2023 and March 2032 respectively. We intend to maintain our marks and renew registrations on a timely basis.\nGovernment Regulation\nEach of our restaurants is subject to the regulations of various health, sanitation, safety and fire agencies in the jurisdiction in which the restaurant is located. Difficulties or failures in obtaining the required licenses or approvals could delay or prevent the opening of a new restaurant. Federal and state environmental regulations have not had a material effect on our operations. More stringent and varied requirements of local governmental bodies with respect to zoning, land use and environmental factors could delay or prevent development of new restaurants in particular locations. We are subject to the Fair Labor Standards Act, which governs such matters as minimum wages, overtime, and other working conditions. In addition, we are subject to the Americans with Disabilities Act, which requires restaurants and other facilities open to the public to provide for access and use of facilities by the handicapped. Management believes that we are in compliance with the Americans with Disabilities Act. Beginning in 2015, we became subject to the Affordable Care Act which requires us to have the required health insurance benefits for eligible employees.\nWe are also subject to federal and state laws regulating franchise operations, which vary from registration and disclosure requirements in the offer and sale of franchises to the application of statutory standards regulating franchise relationships. Many state franchise laws impose restrictions on the franchise agreements, including limitations on non-competition provisions and the termination or non-renewal of a franchise. Some states require that franchise materials be registered before franchises can be offered or sold in that state.\nIn addition, each Bad Daddys Burger Bar restaurant requires a liquor license and adherence to the attendant laws and requirements regulating the serving and consumption of alcohol. Alcoholic beverage control regulations govern various aspects of these restaurants daily operations, including the minimum age of patrons and employees, hours of operation, advertising, wholesale purchasing and inventory control, handling and storage. Typically, licenses to sell alcoholic beverages require annual renewal and may be suspended or revoked at any time for cause, the definition of which varies by locality.\nSegment Reporting\nWe operate as two reportable business segments: Good Times Burgers and Frozen Custard restaurants and Bad Daddys Burger Bar restaurants. Refer to Note 10, Segment Reporting, in the notes to our consolidated financial statements for more information.\nAvailable Information\nOur Internet website address is goodtimesburgers.com. We make available free of charge through our websites investor relations information section our Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed with or furnished to the Securities and Exchange Commission (SEC) under applicable securities laws as soon as reasonably practical after we electronically file such material with, or furnish it to, the SEC. Our website information is not part of or incorporated by reference into this Annual Report on Form 10-K.\nSpecial Note About Forward-Looking Statements\nThis Form 10-K may include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the Securities Act), and Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act), and such statements are subject to the safe harbors created thereby. A forward-looking statement is neither a prediction nor a guarantee of future events. We try, whenever possible, to identify these forward-looking statements by using words such as \"anticipate,\" \"assume,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"plan,\" \"project,\" \"may,\" \"will,\" \"would,\" and similar expressions. Certain forward-looking statements are included in this Form 10-K, principally in the sections captioned \"Business,\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\" Forward-looking statements are related to, among other things:\n● our expectations as to the ongoing impact of the COVID-19 pandemic on our business;\n● the sufficiency of the supply of commodities and labor pool to carry on our business;\n● anticipated price increases and the impact of inflation\n● business objectives and strategic plans;\n● operating strategies;\n● our ability to open and operate additional restaurants profitably and the timing of such openings;\n● expectations that most, if not all, of the Companys unit growth will be through the development of additional Bad Daddys Burger Bar locations;\n● restaurant and franchise acquisitions;\n● expected future revenues and earnings, comparable and non-comparable restaurant sales, results of operations, and future restaurant growth (both company-owned and franchised);\n● estimated costs of opening and operating new restaurants, including general and administrative, marketing, franchise development and restaurant operating costs;\n● anticipated selling, general and administrative expenses and restaurant operating costs, including commodity prices, labor and energy costs;\n● future capital expenditures;\n● our expectation that we will have adequate cash from operations and credit facility borrowings to meet all future debt service, capital expenditure and working capital requirements in fiscal 2023;\n● success of advertising and marketing activities;\n● the absence of any material adverse impact arising out of any current litigation in which we are involved;\n● impact of the adoption of new accounting standards and our financial and accounting systems and analysis programs;\n● expectations regarding competition and our competitive advantages;\n● impact of our trademarks, service marks, and other proprietary rights; and\n● effectiveness of our internal control over financial reporting.\nAlthough we believe that the expectations reflected in our forward-looking statements are based on reasonable assumptions, such expectations may prove to be materially incorrect due to known and unknown risks and uncertainties.\nIn some cases, information regarding certain important factors that could cause actual results to differ materially from any forward-looking statements appears together with such statement. In addition, the factors described under Critical Accounting Policies and Estimates in Part II, Item 7, and Risk Factors in Part I, Item 1A, as well as other possible factors not listed, could cause actual results to differ materially from those expressed in forward-looking statements, including, without limitation, the following: concentration of restaurants in certain markets and lack of market awareness in new markets; changes in disposable income; consumer spending trends and habits; increased competition in the quick-service restaurant market; costs and availability of food and beverage inventory; the increasing inflationary environment, supply chain constraints; our ability to attract qualified managers, employees, and franchisees; changes in the availability of capital or credit facility borrowings; costs and other effects of legal claims by employees, franchisees, customers, vendors, shareholders and others, including settlement of those claims; effectiveness of management strategies and decisions; weather conditions and related events in regions where our restaurants are operated; and changes in accounting standards, policies and practices or related interpretations by auditors or regulatory entities. Additionally, in the context of the ongoing global COVID-19 pandemic, future facts and circumstances could change and impact assumptions relied upon in our forward-looking statements.\nAll forward-looking statements speak only as of the date made. All subsequent written and oral forward-looking statements attributable to us, or persons acting on our behalf, are expressly qualified in their entirety by the cautionary statements. Except as required by law, we undertake no obligation to update any forward-looking statement to reflect events or circumstances after the date on which it is made or to reflect the occurrence of anticipated or unanticipated events or circumstances. ITEM 1A. RISK FACTORS\nYou should consider carefully the following risk factors before making an investment decision with respect to our securities. You are cautioned that the risk factors discussed below are not exhaustive.\nRisks Related to Our Business\nThe outbreak of, and local, state and federal governmental responses to, the COVID-19 or future pandemics have previously significantly disrupted and could disrupt our business again in the future, which has and could materially affect our financial condition and operating results.\nThe global crisis resulting from the spread of COVID-19 had a substantial impact on our restaurant operations for the fiscal years ended September 28, 2021 and to a lesser extent September 27, 2022 in the way of dining room closures, customer preference, supply chain interruptions, and employee behaviors. Recurrence of COVID-19, new variants, or pandemics arising from novel pathogens could substantially impact our business in a negative manner.\nWe have accumulated losses and cannot guarantee future profits.\nWe have incurred losses in 29 of our 34 years since inception. As of September 27, 2022, we had an accumulated deficit of $30,335,000 and reported a loss for fiscal 2022 of $2,655,000. In light of the uncertainty of the lingering impacts of COVID-19, increasing inflation and other factors affecting our supply chain and employee markets, we cannot provide assurance that we will produce income again or generate a loss for the fiscal year ending September 26, 2023.\nIf we are unable to continue to increase same store sales at existing restaurants, our ability to attain profitability may be adversely affected.\nWe have increased same-store sales for ten of the past eleven years at Good Times. We have operated Bad Daddys for a shorter period of time and have had negative same store sales for that concept in two of the past three fiscal years. Same-store sales increases will depend in part on the success of our advertising and promotion of new and existing menu items and consumer acceptance and could be greatly impacted by future effects of the COVID-19 pandemic. We cannot assure that our advertising and promotional efforts will in fact be successful, nor that sales volumes will be fully restored after COVID-19 subsides. If our same-store sales decrease, and our operating costs increase, our ability to attain profitability will be adversely affected.\nNew restaurants, when and if opened, may not be profitable, if at all, for several months.\nWe anticipate that our new restaurants, when and if opened, will generally take several months to reach normalized operating levels due to inefficiencies typically associated with new restaurants, including lack of market awareness, the need to hire and train a sufficient number of employees, operating costs which are often materially greater during the first several months of operation than thereafter, preopening costs and other factors. In addition, restaurants opened in new markets may open at lower average weekly sales volumes than restaurants opened in existing markets and may have higher restaurant level operating expense ratios than in existing markets. Sales at restaurants opened in new markets may take longer to reach average annual company-owned restaurant sales, if at all, thereby affecting the profitability of these restaurants.\nOur operations are susceptible to the cost of and changes in food availability which could adversely affect our operating results.\nOur profitability depends in part on our ability to anticipate and react to changes in food costs. Various factors beyond our control, including adverse weather conditions, governmental regulation, production, availability, recalls of food products, seasonality and COVID-19-related factors may affect our food costs or cause a disruption in our supply chain. We enter into annual contracts with our chicken and other miscellaneous suppliers. Our Good Times contracts for chicken are fixed price contracts. Our Bad Daddys contracts for chicken and all contracts for beef are generally based on current market prices plus a processing fee. Changes in the price or availability of our all-natural chicken or beef supply or other commodities could materially adversely affect our profitability. We cannot predict whether we will be able to anticipate and react to changing food costs by adjusting our purchasing practices and menu prices, and a failure to do so could adversely affect our operating results. In addition, we may not be able to pass along higher costs through price increases to our customers.\nMacroeconomic conditions and inflation could affect our operating results.\nGeneral economic conditions, including economic downturns related to the COVID-19 pandemic, have adversely affected our results of operations and may continue to do so. Similarly, significant inflation has negatively affected our labor and product input costs and could continue to do so. If the economy experiences a more significant economic downturn or there are uncertainties regarding continued economic prosperity, declines in stock market indices, or other negative macroeconomic occurrences, consumer spending and the unemployment rate may be affected, which may adversely affect our sales in the future. A proliferation of heavy discounting or highly competitive pricing by our major competitors may also negatively affect our sales and operating results.\nPrice increases may impact customer visits.\nWe may make price increases on selected menu items in order to offset increased operating expenses we believe will be recurring. Although we have not experienced significant consumer resistance to our past price increases, future price increases may deter customers from visiting our restaurants or affect their purchasing decisions.\nThe hamburger restaurant market is highly competitive.\nThe hamburger restaurant market is highly competitive. Our competitors in the quick-service restaurant segment include many recognized national and regional fast-food hamburger restaurant chains, such as McDonalds, Burger King, Wendys, Carls Jr., Sonic, Jack in the Box, Freddys and Culvers. In-N-Out has expanded into the state of Colorado, the primary state in which we operate, and is continuing to expand in the market, and Whataburger has announced its intention to expand into the state of Colorado. We also compete with small regional and local hamburger and other fast-food restaurants, many of which feature drive-thru service. Most of our competitors have greater financial resources, marketing programs and name recognition than we do. Discounting by our quick-service restaurant competitors may adversely affect the revenues and profitability of our restaurants.\nWhile Bad Daddys Burger Bar operates in the better burger restaurant segment, it offers a relatively broad menu and competes with other full-service restaurants in the bar and grill segment. Additionally, customers of both our Good Times restaurants and Bad Daddys Burger Bar restaurants are also customers of fast casual hamburger restaurants. Further, changes in customer taste preferences, dietary trends, and preference for delivery and/or carry-out options often affect the restaurant business. If we are unable to continue to compete effectively with other restaurant concepts, our traffic, sales, and restaurant-level profitability could be negatively affected.\nSites for new restaurants may be difficult to acquire.\nLocating our restaurants in high-traffic and readily accessible areas is an important factor for our success. We intend to continue to locate Bad Daddys Burger Bar restaurants in leased in-line and end-cap retail locations. Since suitable locations are in great demand, in the future we may not be able to obtain optimal sites for either of our restaurant concepts at a reasonable cost or at all. In addition, we cannot assure you that the sites we do obtain will be successful.\nOur franchisees could take actions that could harm our business.\nFranchisees are independent contractors and are not our employees. We provide training and support to franchisees; however, franchisees operate their restaurants as independent businesses. Consequently, the quality of franchised restaurant operations may be diminished by any number of factors beyond our control. Moreover, franchisees may not successfully operate restaurants in a manner consistent with our standards and requirements or may not hire and train qualified managers and other restaurant personnel. Our image and reputation, and the image and reputation of other franchisees, may suffer materially, and system-wide sales could significantly decline, if our franchisees do not operate successfully.\nWe depend on key management employees.\nWe believe our current operations and future success depend largely on the continued services of our management employees, in particular Ryan Zink, our President and Chief Executive Officer, Matthew Karnes, our Senior Vice President of Finance, Don Stack, our Senior Vice President of Operations for Good Times, and James Abbott, our Vice President of Operations for Bad Daddys. Although we have entered into an employment agreement with Mr. Zink, he may voluntarily terminate his employment with us at any time. In addition, we do not currently maintain key-person insurance on the lives of Messrs. Zink, Karnes, Abbott or Stack. We have not entered into an employment agreement with Messrs. Karnes, Abbott or Stack. The loss of services by Messrs. Zink, Karnes, Abbott, or Stack, or those of other key management personnel, could have a material adverse effect on our financial condition and results of operations.\nLabor shortages could slow our growth or harm our business.\nOur success depends in part upon our ability to attract, motivate and retain a sufficient number of qualified, high-energy employees. Qualified individuals needed to fill these positions are in short supply in some areas, and in fiscal 2022 we have seen an extreme shortage of qualified workers by historical standards as has been reported in various news outlets. The inability to recruit and retain these individuals may delay the planned openings of new restaurants or result in high employee turnover in existing restaurants, which could harm our business. Additionally, competition for qualified employees has required us to pay meaningfully higher wages to attract enough employees than has historically been the case, and continued tightness in labor markets could result in continued escalation of labor costs. Most of our employees are paid market wages on an hourly basis that are influenced by applicable minimum wage regulations. Accordingly, any increase in the minimum wage, whether state or federal, could have a material adverse impact on our business.\nIncreasingly competitive labor markets and our need to provide additional incentives to remain competitive in our hiring and retention efforts may continue to negatively impact our margins and, if we are unable to staff and retain qualified restaurant management and operating personnel, we may be unable to effectively operate and grow our business and revenues, which could materially adversely affect our financial performance.\nOur ongoing success requires us to attract, motivate and retain a sufficient number of qualified, high-energy employees, including both restaurant managers and crew. However, qualified individuals needed to fill these positions are in short supply in many areas, and we and other companies in our industry have experienced high turnover. Many individuals have left the restaurant industry altogether due to difficult pandemic-related operating demands and, in some cases, current unemployment subsidies. These conditions have resulted in aggressive competition for talent, wage inflation and pressure to improve benefits and workplace conditions to remain competitive and attract talent, which in turn has led to higher labor costs and margin compression. If this trend continues, it will negatively impact our ability to effectively operate and grow our business and revenues and materially adversely affect our financial performance.\nIf we fail to appropriately plan and sustain our workforce and proactively respond to employee dissatisfaction, it could adversely impact guest satisfaction and operational efficiency, lead to increased litigation and unionization efforts and negatively impact restaurant profitability. Our restaurants could be short staffed, we may be forced to incur overtime expenses, and our ability to operate and expand our concepts effectively and meet customer demand could be limited. Difficulties recruiting and retaining new restaurant crew members in a timely manner also negatively impacts our ability to grow sales at existing restaurants and open new restaurants. Any or all of these factors any could materially adversely affect our financial performance.\nSecurity breaches of confidential customer information in connection with our electronic processing of credit and debit card transactions may adversely affect our business.\nThe majority of our restaurant sales are by credit or debit cards. Other restaurants and retailers have experienced security breaches in which credit and debit card information of their customers has been stolen. We may in the future become subject to lawsuits or other proceedings for purportedly fraudulent transactions arising out of the actual or alleged theft of our customers credit or debit card information. In addition, most states have enacted legislation requiring notification of security breaches involving personal information, including credit and debit card information. Any such claim, proceeding, or mandatory notification could cause us to incur significant unplanned expenses, which could have an adverse impact on our financial condition and results of operations. Further, adverse publicity resulting from these allegations may have a material adverse effect on us and our restaurants.\nWe are subject to extensive government regulation that may adversely hinder or impact our ability to govern various aspects of our business including our ability to expand and develop our restaurants.\nThe restaurant industry is subject to various federal, state and local government regulations, including those relating to the sale of food. Our failure to maintain necessary governmental licenses, permits and approvals, including food licenses, could adversely affect our operating results. Difficulties or failures in obtaining the required licenses and approvals could delay, or result in our decision to cancel, the opening of new restaurants. Local authorities may suspend or deny renewal of our food licenses if they determine that our conduct does not meet applicable standards or if there are changes in regulations. In addition, any adverse food safety event could result in regulatory and other investigations, and/or fines and penalties, any of which could disrupt our operations, increase our costs, require us to respond to findings from regulatory agencies that may divert resources and assets, and result in potential fines and penalties as well as other legal action, any of which could materially adversely affect our financial performance.\nVarious federal, state and labor laws govern our relationship with our employees and affect operating costs. These laws govern minimum wage requirements, overtime pay, meal and rest breaks, unemployment tax rates, workers compensation rates, citizenship or residency requirements, child labor regulations and sales taxes. Additional government-imposed increases in minimum wages, overtime pay, paid leaves of absence and mandated health benefits may increase our operating costs. Several states and cities, including the city of Denver and the state of Colorado, where many of our restaurants are located, have legislation passed which provides for annual increases in their respective minimum wage. Additional states may raise their respective minimum wage in the future. This could impact the profitability of existing restaurants as well as impact development opportunities in those states.\nThe federal Americans with Disabilities Act prohibits discrimination on the basis of disability in public accommodations and employment. Although our restaurants are designed to be accessible to the disabled, we could be required to make modifications to our restaurants to provide service to, or make reasonable accommodations for, disabled persons.\nWe are also subject to federal and state laws that regulate the offer and sale of franchises and aspects of the licensor-licensee relationship. Many state franchise laws impose restrictions on the franchise agreement, including limitations on non-competition provisions and the termination or non-renewal of a franchise. Some states require that franchise materials be registered before franchises can be offered or sold in the state.\nOur Bad Daddys Burger Bar restaurants are also subject to state and local laws that regulate the sale of alcoholic beverages. Alcoholic beverage control regulations govern various aspects of these restaurants daily operations, including the minimum age of patrons and employees, hours of operation, advertising, wholesale purchasing and inventory control, handling and storage. Typically, licenses to sell alcoholic beverages require annual renewal and may be suspended or revoked at any time for cause, the definition of which varies by locality. The failure of any of our Bad Daddys Burger Bar restaurants to timely obtain and maintain any required licenses, permits or approvals to serve alcoholic beverages could delay or prevent the opening of a new restaurant or prevent regular day-to-day operations, including the sale of alcoholic beverages, at a restaurant that is already operating, any of which would adversely affect our business.\nThe recently-released Emergency Temporary Standard (ETS) from OSHA provides guidance surrounding requirements related to vaccination against COVID-19 among our employees. Although the ETS provides for the alternative of weekly testing for the virus and also allows employers to shift the cost burden of this testing to employees, labor markets, competitive forces, and practical application may dictate that we would shoulder the cost of such testing, which could result in meaningful costs that have not been incurred to-date. Additionally, beliefs, perceptions, and behaviors among employees relative to either vaccination or testing, could result in employees choosing not to work for us, or other companies bound by the ETS, and further limit the supply of labor.\nConcerns relating to food safety, food-borne illness, pandemics and other diseases could reduce customer traffic to our restaurants, or cause us to be the target of litigation, which could materially adversely affect our financial performance.\nWe face food safety risks, including the risk of food-borne illness and food contamination (including allergen cross contamination), which are common both in the restaurant industry and the food supply chain. While we dedicate substantial resources and provide training to ensure the safety and quality of the food we serve, these risks cannot be completely eliminated. Additionally, we rely on our network of suppliers to properly handle, store and transport our ingredients for delivery to our restaurants. Any failure by our suppliers, or their suppliers, could cause our ingredients to be contaminated, which could be difficult to detect and put the safety of our food in jeopardy.\nIn addition to the novel coronavirus that causes COVID-19, consumer preferences could be affected by health concerns about outbreaks of other viruses, including various strains of influenza; the consumption of beef, the key ingredient in many of our menu items; or negative publicity concerning food quality, illness and injury generally, such as negative publicity concerning E. coli, mad cow or foot-and-mouth disease, publication of government or industry findings concerning food products served by us, or other health concerns or operating issues stemming from one restaurant or a limited number of restaurants. This negative publicity may adversely affect demand for our food and could result in a decrease in customer traffic to our restaurants. If we react to the negative publicity by changing our concept or our menu, we may lose customers who do not prefer the new concept or menu, and we may not be able to attract a sufficient new customer base to produce the revenue needed to make our restaurants profitable. In addition, we may have different or additional competitors for our intended customers as a result of a concept change and may not be able to compete successfully against those competitors. A decrease in customer traffic to our restaurants as a result of these health concerns or negative publicity or as a result of a change in our menu or concept could materially harm our business. Additionally, if our customers or staff members become infected with a pathogen which was actually or claimed to be contracted at our restaurants, customers may avoid our restaurants and/or it may become difficult to adequately staff our restaurants. Any adverse food safety occurrence may result in litigation against us. The negative publicity associated with such an event could damage our reputation and materially adversely affect our financial performance.\nIf we are unable to protect our reputation, the value of our brands and sales at our restaurants may be negatively impacted, which may materially adversely affect our financial performance.\nOne of our largest assets is the value of our brands, which is directly linked to our reputation. We must protect our reputation in order to continue to be successful and to grow the value of our brands. Negative publicity directed at any of our brands, regardless of factual basis, such as, relating to food quality, restaurant facilities, customer complaints or litigation alleging injury or food-borne illnesses, food tampering or contamination or poor health inspection scores, sanitary or other issues with respect to food processing by us or our suppliers, the condition of our restaurants, labor relations, any failure to comply with applicable regulations or standards, allegations of harassment, or other negative publicity, could damage our reputation. Negative publicity about us could harm our reputation and damage the value of our brands, which could materially and adversely affect our financial performance.\nOur ability to succeed with the Bad Daddys Burger Bar restaurant concept will require significant capital expenditures and management attention.\nWe believe that new openings of Bad Daddys Burger Bar restaurants are likely to serve as the primary contributor of our new unit growth and increased profitability over the longer term based on the unit economics of that concept. Our ability to succeed with this concept will require significant capital expenditures and management attention and is subject to certain risks in addition to those of opening a new Good Times restaurant, including customer acceptance of and competition with the Bad Daddys Burger Bar concept. If the ramp-up period for new Bad Daddys Burger Bar restaurants does not meet our expectations, our operating results may be adversely affected. There can be no assurance that we will be able to successfully develop and grow the Bad Daddys Burger Bar concept to a point where it will become profitable or generate positive cash flow. We may not be able to attract enough customers to meet targeted levels of performance at new Bad Daddys Burger Bar restaurants because potential customers may be unfamiliar with the concept, or the atmosphere or menu might not be appealing to them. If we cannot successfully execute our growth strategies for Bad Daddys Burger Bar, our business and results of operations may be adversely affected.\nOur growth, including the development of Bad Daddys Burger Bar restaurants, may strain our management and infrastructure.\nAny growth of our business would increase our operating complexity and place increased demands on our management and infrastructure, including our current restaurant management systems, financial and management controls, and information systems. If our infrastructure is insufficient to support our growth, our ability to open new restaurants, including the development of the Bad Daddys Burger Bar concept, would be adversely affected.\nBad Daddys Burger Bar is subject to all of the risks of a relatively new business, including competition, and there is no guarantee of a return on our capital investment.\nThe Bad Daddys Burger Bar concept has been in existence for approximately fifteen years and the average age for all Bad Daddys restaurants is 6.2 years. Existing restaurants are currently located in Alabama, Colorado, Georgia, North Carolina, Oklahoma, South Carolina, and Tennessee. Because of the small number of existing Bad Daddys Burger Bar restaurants and the relatively short period of time that they have been in operation, there is substantial uncertainty that additional restaurants in other locations will be successful. There is no guarantee that we will be successful in offering Bad Daddys Burger Bar franchises throughout the U.S. or that, if and when, such franchises are granted, the restaurants developed by franchisees will be successful. There is also substantial uncertainty that the franchising business will be successful in view of the facts that we have sold only two Bad Daddys Burger Bar restaurant franchises to date and that the restaurant franchising business is very competitive.\nCosts associated with our employee health care programs continue to escalate and we may not be able to fully pass along those costs increases to employees.\nWe maintain various health care programs, including coverage for medical claims, to employees who select such programs. All of our salaried managers are eligible to participate in these programs and those of our hourly employees who meet the service requirements under the Affordable Care Act are also eligible. We maintain insurance coverage for claims in excess of a certain threshold on a per-member basis but do not maintain insurance coverage for aggregate claims. We have a limited number of participants in our plans and should a significant number of participants report claims in a given year, the actual claims under the plan may meaningfully exceed our expected claims, and any such costs would be borne by us and not by the participants in the plan (our Employees).\nRisks Related to the Ownership of Our Common Stock\nOur business could be negatively affected as a result of significant shareholders or potential shareholders attempting to effect changes or acquire control over our company, which could cause us to incur significant expense, hinder execution of our business strategy and impact the trading value of our securities.\nShareholders may from time-to-time attempt to effect changes, engage in proxy solicitations or advance shareholder proposals. Responding to proxy contests and other actions by activist shareholders can be costly and time-consuming, disrupting our operations and diverting the attention of our board of directors and senior management from the pursuit of business strategies. Any of these impacts could materially and adversely affect our business and operating results. Further, the market price of our common stock could be subject to significant fluctuation or otherwise be adversely affected by the events, risks and uncertainties described above.\nFuture changes in financial accounting standards may cause adverse unexpected operating results and affect our reported results of operations.\nChanges in accounting standards can have a significant effect on our reported results and may affect our reporting of transactions completed before the change is effective. See Note 1 to our Consolidated Financial Statements for further discussion. New pronouncements and varying interpretations of pronouncements have occurred and may occur in the future. Changes to existing rules or differing interpretations with respect to our current practices may adversely affect our reported financial results.\nBecause we currently qualify as a smaller reporting company, our disclosures of non-financial and financial information are less than is required by non-smaller reporting companies.\nCurrently we qualify as a smaller reporting company under SEC rules. A smaller reporting company prepares and files SEC reports and registration statements using the same forms as other SEC reporting companies, though the information required to be disclosed may differ and be less comprehensive.\nWe cannot predict whether investors will find our common stock less attractive because of our reliance on any of the reduced disclosure requirements available to smaller reporting companies. If some investors find our common stock less attractive as a result, there may be a less active trading market for our common stock and our stock price may be more volatile.\nThe price of our common stock may fluctuate significantly.\nThe trading price of our shares of common stock has from time-to-time fluctuated widely and, in the future may be subject to similar fluctuations. This volatility may affect the price at which you could sell your common stock. The market price of our common stock is likely to continue to be volatile and may fluctuate significantly in response to many factors, including:\n● the impact of the ongoing COVID-19 pandemic on our business;\n● operating results that vary from the expectations of management, securities analysts and investors;\n● developments in our business;\n● the operating and securities price performance of companies that investors consider to be comparable to us;\n● announcements of implementation of strategic transactions or developments and other material events by us or our competitors;\n● negative economic conditions that adversely affect the economy, commodity prices, the job market and other factors that may affect the markets in which we operate;\n● publication of research reports about us or the sectors in which we operate generally;\n● changes in market valuations of similar companies;\n● additions or departures of key management personnel;\n● actions by institutional shareholders;\n● speculation in the press or investment community; and\n● the realization of any of the other risk factors included in this Annual Report on Form 10-K.\nHolders of our common stock will be subject to the risk of volatile and depressed market prices of our common stock. In addition, many of the factors listed above are beyond our control. These factors may cause the market price of our common stock to decline, regardless of our financial condition, results of operations, business or prospects. It is impossible to assure investors in our common stock that the market price of our common stock will not fall in the future.\nSales of a substantial number of shares of our common stock in the public market by our existing Shareholders could cause our stock price to fall.\nSales of a substantial number of shares of our common stock in the public market, or the perception that these sales might occur, could depress the market price of our common stock and could impair our ability to raise adequate capital through the sale of additional equity securities. We are unable to predict the effect that sales may have on the prevailing market price of our common stock.\nThere may be future sales or other dilution of our equity, which may adversely affect the market price of the shares of our common stock and/or dilute the value of shares of our common stock.\nWe are not restricted from issuing, and shareholder approval is not required in order to issue, additional shares of common stock, including securities that are convertible into or exchangeable for, or that represent the right to receive, shares of common stock, except any shareholder approval required by The NASDAQ Capital Markets. We have in the past, and may in the future, sell such equity and equity-linked securities. Sales of a substantial number of shares of our common stock or other equity-related securities in the public market could depress the market price of our shares of common stock. We cannot predict the effect that future sales of our common stock or other equity-related securities would have on the market price of our shares of common stock. The market price of our common stock may be adversely affected if we issue additional shares of our common stock.\nProvisions in our articles of incorporation and bylaws and provisions of Nevada law may prevent or delay an acquisition of our company, which could decrease the trading price of our common stock.\nWe are subject to anti-takeover laws for Nevada corporations. These anti-takeover laws prevent a Nevada corporation from engaging in a business combination with any shareholder, including all affiliates and associates of the shareholder, who is the beneficial owner of 10% or more of the corporations outstanding voting stock, for two years following the date that the shareholder first became the beneficial owner of 10% or more of the corporations voting stock, unless specified conditions are met. If those conditions are not met, then after the expiration of the two-year period the corporation may not engage in a business combination with such shareholder unless certain other conditions are met.\nOur articles of incorporation and our bylaws contain several provisions that may deter or impede takeovers or changes of control or management. These provisions:\n● authorize our board of directors to establish one or more series of preferred stock the terms of which can be determined by the board of directors at the time of issuance;\n● do not allow for cumulative voting in the election of directors unless required by applicable law. Under cumulative voting a minority shareholder holding a sufficient percentage of a class of shares may be able to ensure the election of one or more directors;\n● state that special meetings of our shareholders may be called only by the chairman of the board of directors, the president or any two directors and must be called by the president upon the written request of the holders of 25% of the outstanding shares of capital stock entitled to vote at such special meeting; and\n● provide that the authorized number of directors is no more than five, as determined by our board of directors.\nThese provisions, alone or in combination with each other, may discourage transactions involving actual or potential changes of control, including transactions that otherwise could involve payment of a premium over prevailing market prices to shareholders for their common stock. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe currently lease approximately 7,650 square feet of space for our executive offices in Golden, Colorado for approximately $114,750 per year, under a lease agreement which expires in October 2027. Most of our existing Good Times restaurants are a combination of free-standing structures containing approximately 880 to 1,000 square feet for the double drive thru format and approximately 2,100 to 2,400 square feet for those locations with a 45 to 70 seat dining room. We do not own any of the land underlying these restaurants and either lease the land or the land and building. In addition, we have several restaurants that are conversions from other concepts in various sizes ranging from 1,700 square feet to 3,500 square feet. The buildings are situated on lots of approximately 18,000 to 50,000 square feet. Certain restaurants serve as collateral for the underlying debt financing arrangements as discussed in the Notes to Consolidated Financial Statements included in this report. Any future development is expected to be conducted through a combination of ground leases and land purchases.\nOur Bad Daddys restaurants are leased spaces of approximately 3,500 to 4,000 square feet in retail developments located in Alabama, Colorado, Georgia, North Carolina, Oklahoma, South Carolina, and Tennessee. We expect future development to be conducted through the leasing of end-cap spaces in retail developments, ground leases, and or land purchases upon which we would be able to build 3,000 - 4,000 square foot standalone building suitable for restaurants, or if the site characteristics otherwise met our criteria, larger sites where we would be able to construct multi-tenant buildings, where we would be able to occupy a portion of the space with a Bad Daddys restaurant and lease other portions of the building to restaurant or non-restaurant tenants.\nAll of the restaurants are regularly maintained by our repair and maintenance staff as well as by outside contractors, when necessary. We believe that all of our properties are in good condition and that there will be a need for periodic capital expenditures to maintain the operational and aesthetic integrity of our properties for the foreseeable future, including recurring maintenance and periodic capital improvements. All of our properties are covered up to replacement cost under our property and casualty insurance policies and in the opinion of management are adequately covered by insurance. ITEM 3. LEGAL PROCEEDINGS\nFor a discussion of material legal proceedings affecting the Company, see note 5 to the audited consolidated financial statements included in this report. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nShares of our Common Stock are listed for trading on the NASDAQ Capital Market under the symbol GTIM. As of December 14, 2022, there were approximately 46 holders of record of our common stock. Because many shares of our common stock are held by brokers and other institutions on behalf of shareholders, we are unable to estimate the total number of shareholders represented by these holders of record.\nDividend Policy\nWe have never paid dividends on our common stock and do not anticipate paying dividends in the foreseeable future. In addition, we have obtained financing under loan agreements that restrict the payment of dividends. Our ability to pay future dividends will necessarily depend on our earnings and financial condition. However, since restaurant development is capital intensive, we currently intend to retain any earnings for that purpose.\nRecent Sales of Unregistered Securities\nNone.\nIssuer Purchases of Equity Securities\nThe Company‘s Board of Directors authorized a $5.0 Million share repurchase program which became effective February 7, 2022. The authorization to repurchase will continue until the maximum value of shares is achieved or the Company terminates the program. The timing and actual number of shares repurchased will depend on a variety of factors, including price, general business and market conditions, and alternative investment opportunities. As of September 27, 2022, the Company has purchased approximately 316,000 shares of its common stock pursuant to the share repurchase plan leaving approximately $4,038,000 available for repurchases under the plan.\nPeriod Total number of\nshares (or units)\npurchased Average price\npaid per share\n(or unit) Total number of\nshares (or units)\npurchased as part\nof publicly\nannounced plans\nor programs Maximum dollar\nvalue of shares\nthat may yet be\npurchased under\nthe plans or\nprograms\n6/29/2022 - 7/26/2022 20.848 $ 3.11 20,848\n7/27/2022 - 8/23/2022 37,909 $ 3.38 37,909\n8/24/2022 - 9/27/2022 60,735 $ 3.03 60,735\nTotal 119,492\n119,492 $ 4,038,000\nIn addition, on September 23, 2022, outside of the publicly announced share repurchase program referred to above, the Board authorized the Company to purchase an aggregate of 27,307 shares from two non-executive employees for a purchase price of $3.75 per share. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the consolidated financial statements and notes thereto included elsewhere in this Annual Report on Form 10-K.\nOverview\nWe operate as two reportable business segments: Good Times Burgers and Frozen Custard restaurants (Good Times) and Bad Daddys Burger Bar restaurants (Bad Daddys). All of our Good Times restaurants compete in the quick service drive-thru segment of the restaurant industry while our Bad Daddys restaurants compete in the full-service casual dining segment of the restaurant industry. We believe that providing this additional financial information for each of our brands will provide a better understanding of our overall operating results. Refer to Note 10, Segment Reporting, in the notes to our consolidated financial statements for more information.\nThe Companys fiscal year is a 52/53-week year ending on the last Tuesday of September. In a 52-week fiscal year, each of the Companys quarterly periods comprises 13 weeks. The additional week in a 53-week fiscal year is added to the first quarter, making such quarter consist of 14 weeks. Our discussion for the fiscal years ending September 27, 2022 and September 28, 2021 each cover periods of 52 full calendar weeks.\nThe following tables present information about our reportable segments for the respective periods, all dollar values are represented in thousands:\nFiscal Year\n(52 Weeks)\n(52 Weeks)\nBad Daddys:\nRestaurant sales $ 103,216 99.7 % $ 88,595 99.7 %\nFranchise revenues 0.3 % 0.3 %\nRestaurant operating costs: (1)\nFood and packaging costs 33,155 32.1 % 26,123 29.5 %\nPayroll and employee benefit costs 35,085 34 % 30,058 33.9 %\nRestaurant occupancy and other costs 21,187 20.5 % 17,605 19.9 %\nDepreciation & amortization 3,234 3.1 % 3,095 3.5 %\nPreopening costs 0.0 % 0.9 %\nTotal restaurant operating costs $ 92,712 89.8 % $ 77,649 87.6 %\nGeneral & administrative costs (2) 7,127 6.9 % 7,055 7.9 %\nAdvertising costs 1,827 1.8 % 1.0 %\nAsset impairment costs 2,647 2.6 % - 0.0 %\nIncome (loss) from operations (811 ) (0.8 %) 3,274 3.7 %\nGood Times:\nRestaurant sales $ 34,034 98.1 % $ 34,463 98.2 %\nFranchise revenues 1.9 % 1.8 %\nRestaurant operating costs: (1)\nFood and packaging costs 10,722 31.5 % 10,041 29.1 %\nPayroll and employee benefit costs 11,430 33.6 % 10,991 31.9 %\nRestaurant occupancy and other costs 6,768 19.9 % 6,120 17.8 %\nDepreciation & amortization 1.9 % 2.2 %\nTotal restaurant operating costs $ 29,581 86.9 % $ 27,899 81.0 %\nGeneral & administrative costs (2) 3,379 9.7 % 2,382 6.8 %\nLitigation Contingencies 1.0 % - 0.00 %\nAdvertising costs 1,337 3.9 % 1,214 3.5 %\nFranchise costs 0.1 % 0.1 %\nAsset impairment costs 2.3 % - 0.0 %\nGain on restaurant asset sale (676 ) (1.9 %) (37 ) (0.1 %)\nIncome from operations $ (67 ) (0.2 %) $ 3,623 10.3 %\n(1) Restaurant operating costs are expressed as a percentage of restaurant sales.\n(2) Includes direct and allocated corporate general and administrative costs.\nBad Daddys Restaurants\nWe currently operate forty company-owned and joint-venture Bad Daddys restaurants. We also license one restaurant in North Carolina. We anticipate opening one new Bad Daddys restaurant during fiscal 2023. Due to the unusual rate of inflation of our raw products, we cannot, at this time, reasonably predict our expected price increases during fiscal 2023 at our Bad Daddys restaurants.\nGood Times Burgers & Frozen Custard Restaurants\nWe currently operate twenty-three company-owned and joint-venture Good Times restaurants all in the state of Colorado. In addition, we have eight Good Times franchise restaurants, six operating in Colorado and two in Wyoming.\nDue to the unusual rate of inflation of our raw products, we cannot at this time reasonably predict our expected price increases during fiscal 2023 at our Good Times restaurants.\nImpact of Inflation at Both Concepts\nCommodity prices, particularly for key proteins have recently been at near-record highs and have exhibited extreme volatility. During the fourth quarter of fiscal 2022 we experienced meaningful price inflation which has continued into our first quarter of 2023. We are experiencing price inflation in most goods, including paper and packaging, other restaurant supplies, and energy (utilities) costs.\nIn addition to food cost inflation, we have also experienced the need to meaningfully increase wages to attract workers in our restaurants. While we are hopeful that wage rate inflation moderates, the persistent shortage of qualified workers, rather than statutory wage rate increases, which have traditionally created rate pressure, is the primary factor creating upward pressure on wages, as demand for labor is currently significantly exceeding the supply of qualified workers.\nWe have historically used menu price increases to manage profitability in times of inflation, however the current unusually high rate of inflation, both of goods and labor, exceeds what we believe we can reasonably pass through to our customers without negatively affecting frequency and trial by our customers.\nSame Store Sales\nSame store sales for each brand represents the comparison of restaurant sales in the current year, to the same comparable weeks in the immediately preceding fiscal year for those stores open for at least 18 months. Same store sales is a commonly used metric in the restaurant industry and management believes it is an indicator of strength of a brand and its existing restaurant locations. Further, management believes that by excluding growth achieved through new unit development, same store sales provide a metric that measures organic growth within the Companys existing restaurants.\nResults of Operations for Fiscal 2022 Compared to Fiscal 2021\nNet Revenues: Net revenues for fiscal 2022 increased $14,247,000 (11.5%) to $138,200,000 from $123,953,000 for fiscal 2021. Bad Daddys concept revenues increased $14,657,000 while our Good Times concept revenues decreased $410,000.\nBad Daddys restaurant sales increased $14,621,000 to $103,216,000 in fiscal 2022 from $88,595,000 in fiscal 2021. This increase is primarily due to increased traffic, including strong off-premise sales, as well as menu price increases. Bad Daddys same store restaurant sales increased 11.2% during fiscal 2022 compared to fiscal 2021. Bad Daddys restaurants are included in same store sales after they have been open a full eighteen months. This increase is due to average menu price increases throughout the year as well as the continued strength of off-premise sales and strong demand for in-person dining. The average menu price increase was approximately 5.7 % in 2022 over 2021. There were thirty-eight restaurants included in the same store sales base at the end of the fiscal year. Additionally, net revenues for fiscal 2022 were increased by $36,000 in higher franchise royalties and license fees compared to the prior fiscal year, primarily related to the Charlotte Airport licensee. Fiscal 2022 and fiscal 2021 include franchise advertising contributions of $9,000 and $15,000, respectively.\nAdditional sales data related to Bad Daddys company-owned and joint-venture restaurants:\nFiscal Year\nTotal operating store weeks 2,054.0 1,942.6\nAverage sales per week $ 50,300 $ 45,575\nAnnualized net sales per square foot $ 670 $ 619\nGood Times restaurant sales decreased $429,000 to $34,034,000 in fiscal 2022 from $34,463,000 in fiscal 2021. This decrease is primarily due to the loss of sales associated with the closure of one restaurant in the second quarter of 2022, partially offset by menu price increases. Same store restaurant sales increased 1.1% during fiscal 2022 compared to fiscal 2021. This increase is primarily due to menu price increases, slightly offset by lower traffic. One restaurant closed during each of fiscal 2022 and 2021 and were excluded from same store sales. The average menu price increase in fiscal 2022 over fiscal 2021 was approximately 7.7%. Additionally, revenues for fiscal 2022 were increased by $19,000 in higher franchise revenues compared to fiscal 2021. Fiscal 2022 and fiscal 2021 include franchise advertising contributions of $273,000 and $263,000, respectively.\nAverage Good Times restaurant sales for company-owned and joint venture restaurants open the entire 2022 and 2021 fiscal years were as follows:\nFiscal Year\nAverage annual unit volume $ 1,455,000 $ 1,421,000\nDuring fiscal 2022, company-operated Good Times restaurants sales for restaurants that had been open a full eighteen months ranged from a low of $860,679 to a high of $2,411,766.\nFood and Packaging Costs: For fiscal 2022, food and packaging costs increased $7,713,000 to $43,877,000 (32.0% of restaurant sales) compared to the increase in fiscal 2021 to $36,164,000 (29.4% of restaurant sales).\nBad Daddys food and packaging costs were $33,155,000 (32.1% of restaurant sales) in fiscal 2022, up from $26,123,000 (29.5% of restaurant sales) in fiscal 2021. This increase is primarily attributable to higher restaurant sales during the current fiscal year versus prior fiscal year. The increase, as a percent of sales, is attributable to significant inflation with most of our food and packaging products seeing meaningful unit price increases, partially offset by the impact of a 5.7 % average annual increase in menu pricing.\nGood Times food and packaging costs were $10,722,000 (31.5% of restaurant sales) in fiscal 2022, up from $10,041,000 (29.1% of restaurant sales) in fiscal 2021. This increase is primarily attributable to the impact of higher purchase prices on food and paper goods, partially offset by the impact of a 7.7% increase in menu pricing.\nPayroll and Other Employee Benefit Costs: For fiscal 2022, payroll and other employee benefit costs increased $5,466,000 to $46,515,000 (33.9% of restaurant sales) compared to the increase in fiscal 2021 to $41,049,000 (33.4% of restaurant sales).\nBad Daddys payroll and other employee benefit costs were $35,085,000 (34.0% of restaurant sales) for fiscal 2022, up from 30,058,000 (33.9% of restaurant sales) in fiscal 2021. The $5,027,000 increase is primarily attributable to greater hours to support increased guests at restaurants during the current year versus the same prior year period, as well as higher average pay rates. As a percent of sales, payroll and employee benefits costs increased by 0.1% primarily attributable to higher average wage rates paid to attract qualified employees.\nGood Times payroll and other employee benefit costs were $11,430,000 (33.6% of restaurant sales) in fiscal 2022, up from $10,991,000 (31.9% of restaurant sales) in fiscal 2021. As a percent of sales, payroll and employee benefits costs increased by 1.7% in fiscal 2022 compared to fiscal 2021. This increase, both in nominal dollars and as measured as a percent of restaurant sales, was primarily attributable to higher average wage rates. These higher wages are in-part driven by a combination of the significant statutory wage increase in the City and County of Denver and the impact of the extremely competitive labor market for qualified restaurant employees in Colorado.\nOccupancy Costs: Occupancy costs include rent, real and personal property taxes, common area maintenance expenses, licenses and insurance expense. For fiscal 2022, occupancy costs increased $625,000 from $8,815,000 (8.3% of restaurant sales) in fiscal 2021 to $9,440,000 (6.9% of restaurant sales).\nBad Daddys occupancy costs were $6,668,000 (6.5% of restaurant sales) for fiscal 2022, up from $5,959,000 (6.7% of restaurant sales) in fiscal 2021. The $709,000 increase was primarily attributable to lease costs with newly opened restaurants and increased property tax assessments. The decrease as a percentage of sales was primarily due to the leveraging effect of higher restaurant sales.\nGood Times occupancy costs were $2,772,000 (8.1% of restaurant sales) in fiscal 2022, down from $2,856,000 (8.3% of restaurant sales) in fiscal 2021. The decrease, as a percentage of sales, was due to the closure of one restaurant in the second quarter of fiscal 2022, the leveraging effect of increased restaurant sales, decreases in property tax expense, end-of-term rent abatement, and associated with a lease termination agreement for one good times restaurant.\nOther Operating Costs: For fiscal 2022, other operating costs increased $3,604,000 from $14,911,000 (12.1% of restaurant sales) in fiscal 2021 to $18,515,000 (13.5% of restaurant sales).\nBad Daddys other operating costs were $14,519,000 (14.1% of restaurant sales) for fiscal 2022, up from $11,647,000 (13.1% of restaurant sales) in fiscal 2021. The $2,872,000 increase was attributable to higher overall sales. As a percent of sales, the increase is attributable to higher increased spending on restaurant technology, and higher repair and maintenance expenses.\nGood Times other operating costs were $3,996,000 (11.7% of restaurant sales) in fiscal 2022, up from $3,264,000 (9.5% of restaurant sales) in fiscal 2021. The increase was primarily attributable to general price inflation in operating supplies costs, increases in commissions paid to delivery service providers due to increases in overall delivery sales, and higher repair and higher preventive maintenance expenses.\nNew Store Preopening Costs: For fiscal 2022, we incurred $51,000 of preopening costs compared to $766,000 in fiscal 2021. All of the preopening costs are related to our Bad Daddys restaurants. The costs in the prior year were related to a Bad Daddys restaurant opened near the end of fiscal 2021.\nPreopening costs in the current fiscal year are attributable to one restaurant that was purchased from a franchisee in the second quarter of fiscal 2022. Preopening costs in the prior fiscal year were primarily attributable to two restaurants that opened during the third and fourth fiscal quarters of 2021. Preopening costs typically occur over a period of approximately five months and we typically spend approximately $275,000 to $350,000 per location.\nDepreciation and Amortization Costs: Depreciation and amortization includes depreciation on capital expenditures for restaurants and corporate assets as well as amortization of acquired franchise rights and leasehold interests. For fiscal 2022, depreciation and amortization costs increased $53,000 from to $3,842,000 in fiscal 2021to $3,895,000 in fiscal 2022.\nBad Daddys depreciation costs increased $139,000 from $3,095,000 in fiscal 2021 to $3,234,000 in fiscal 2022. This increase was primarily attributable to the two new restaurants opened in final quarter of fiscal 2021 as well as the acquisition of our franchise unit in the second quarter of 2022.\nGood Times depreciation costs decreased $86,000 from $747,000 in fiscal 2021 to $661,000 in fiscal 2022. This decrease is primarily attributable to assets reaching full amortization and the closure of a restaurant in fiscal 2022 associated with a landlord termination option.\nGeneral and Administrative Costs: General and administrative costs include all corporate and administrative functions. Components of this category include accounting and administrative costs, regional and franchise support salaries and benefits; professional and consulting fees; travel; corporate information systems; training; board of directors expenses; office rent; and legal expenses. For fiscal 2022, general and administrative costs increased $1,069,000 from $9,437,000 (7.6% of total revenue).in fiscal 2021 to $10,506,000 (7.6% of total revenue) in fiscal 2022.\nThe $1,069,000 increase in general and administrative expenses in fiscal 2022 is primarily attributable to:\n● Increase of $591,000 in legal and professional services fees\n● Increase of $327,000 in recruiting and training-related costs, including travel and temporary lodging for new managers during their training period, costs related to our annual general manager conference, and costs related to a training event for multi-unit managers from both brands\n● Increase of $124,000 related to a reduction of vendors fee income\n● Increase of $109,000 related to regional manager expenses\n● Increase of $155,000 related to increased home office payroll and benefit costs\n● Increase of $88,000 related to business insurance including D&O, EPL, and cyber coverage\n● Increase of $189,000 in technology-related expenses\n● Increase of $56,000 in general travel-related expenses\n● Increase of $31,000 in general office expenses\n● Decrease of $473,000 in to, reduced health insurance costs and underwriting losses\n● Decrease of $111,000 in incentive stock compensation\n● Net decreases in all other expenses of $17,000\nWe expect general and administrative costs to continue to increase slightly from fiscal 2022 to fiscal 2023 due to increased insurance and health costs, and as we make investments in new human resource and financial management systems.\nAdvertising Costs: For fiscal 2022, advertising costs increased $1,082,000 from $2,082,000 (1.7% of total revenues) in fiscal 2021 to $3,164,000 (2.3% of total revenues) in fiscal 2022.\nBad Daddys advertising costs increased $959,000 from $868,000 (1.0% of total revenues) in fiscal 2021 to $1,827,000 (1.8% of total revenues) in fiscal 2022. The increase is primarily due to recognition of commission earned by third parties on gift cards sold through large-box retailers and a radio advertising campaign in Colorado. Bad Daddys advertising costs consist primarily of menu development, printing costs, local store marketing and social media. All restaurants contribute to an advertising materials fund based on a percentage of restaurant sales. The current and prior years include advertising costs of $9,000 and $15,000, respectively, associated with franchise advertising contributions.\nWe anticipate that in fiscal 2023, Bad Daddys advertising costs as a percentage of total revenues will remain consistent with fiscal 2022.\nGood Times advertising costs increased $123,000 from $1,214,000 (3.5% of total revenues) in fiscal 2021 to $1,337,000 (3.9% of total revenues) in fiscal 2022. The increase is primarily due to increased advertising expenditures. Good Times advertising costs consists primarily of contributions made to the advertising materials fund and a regional advertising cooperative based on a percentage of restaurant sales which are used to provide radio advertising, social media, on-site and point-of-purchase materials. The percentage contribution paid to the regional advertising cooperative was reduced at the start of the current fiscal year associated with a change in expected media mix. Advertising costs are presented gross, with franchisee contributions to the fund being recognized as a component of franchise revenues.\nWe anticipate that in fiscal 2023 Good Times advertising costs as a percentage of net revenues will remain relatively stable, between approximately 3.0% and 3.5%.\nFranchise Costs: For fiscal 2022, franchise costs decreased $5,000 from $27,000 in fiscal 2021 to $22,000 in fiscal 2022. The costs are primarily related to the Good Times franchised restaurants. We currently have minimal direct costs associated with maintaining our franchise systems as those employees overseeing franchisee relations primarily perform responsibilities associated with company operations.\nGain or Loss on Restaurant Asset Disposals: For fiscal 2022, the gain on restaurant asset disposals was $676,000 compared to a gain of $37,000 in fiscal 2021. The gain in both fiscal 2022 and 2021 is primarily comprised of a deferred gain on previous sale lease-back transactions related to two Good Times restaurants, as well as the termination of a lease of a good times restaurant.\nLong-lived Asset Impairment Charges: For fiscal 2022, the asset impairment charge was $3,437,000 compared to no impairment charge being recorded in fiscal 2021. We review long-lived assets and intangibles subject to amortization for impairment when there are factors that indicate the carrying value of such assets may not be recoverable. We recorded non-cash charges of $790,000 related to 3 Good Times restaurants located in Colorado. We recorded non-cash charges of $2,647,000 related to 2 Bad Daddys locations\nGoodwill Impairment Charges: We review goodwill for impairment on an annual basis or whenever indications of impairment arise. During fiscal 2022 and 2021, no goodwill impairment charges were deemed necessary.\nLitigation Contingencies: The Company recorded a contingent loss of $332,000 in fiscal 2022 related to in-process litigation. No similar losses were recorded during Fiscal 2021.\n(Loss) Income from Operations: Loss from operations was $878,000 in fiscal 2022 compared to income of $6,897,000 in fiscal 2021.\nThe change from fiscal 2021 to fiscal 2022 was primarily attributable to the increase in net revenues, offset by an increase in asset impairment costs, an increase in food and packaging and payroll and other employee benefit costs, as well as other changes discussed in the \"Occupancy Costs\", :Other Operating Costs, New Store Preopening Costs, Depreciation and Amortization, \"General and Administrative Costs\", Advertising Costs, Franchise Costs, and Gain on Restaurant Asset Disposals sections above.\nGain on Debt Extinguishment: There was no gain on debt extinguishment in fiscal 2022.\nGain on debt extinguishment in fiscal 2021 was $11,778,000. This gain was related to the forgiveness of the Companys PPP loans. The breakdown of the forgiveness amount by operating segment is as follows:\nBad Daddys $ 9,509\nGood Times 2,269\n$ 11,778\nNet (Loss) Income: Net loss for fiscal 2022 was $932,000 compared to net income of $18,406,000 in fiscal 2021. The change from fiscal 2021 to fiscal 2022 was primarily attributable to the matters discussed in the \"Net Revenues\", \"Food and Packaging Costs\", Payroll and Other Employee Benefits Costs, \"General and Administrative Costs\", \"Long-lived Asset Impairment Charges sections above.\nIncome Attributable to Non-Controlling Interests: For fiscal 2022, the income attributable to non-controlling interests was $1,714,000 compared to $1,613,000 in fiscal 2021. The non-controlling interest represents the limited partners share of income in the Good Times and Bad Daddys joint-venture restaurants. $1,185,000 of the current year income is attributable to the Bad Daddys joint-venture restaurants, compared to $822,000 in the prior year. $529,000 of the current year income is attributable to the Good Times joint-venture restaurants, compared to $791,000 in the prior year.\nAdjusted EBITDA\nEBITDA is defined as net income (loss) before interest, income taxes and depreciation and amortization.\nAdjusted EBITDA is defined as EBITDA, adjusted for non-cash stock-based compensation expense, preopening expense, non-recurring acquisition costs, U.S. Generally Accepted Accounting Principles (GAAP) rent in excess of cash rent, non-cash disposal of assets and non-cash asset impairment charges. Adjusted EBITDA is intended as a supplemental measure of our performance that is not required by or presented in accordance with GAAP. We believe that EBITDA and Adjusted EBITDA provide useful information to management and investors regarding certain financial and business trends relating to our financial condition and operating results. Our management uses EBITDA and Adjusted EBITDA (i) as a factor in evaluating management's performance when determining incentive compensation and (ii) to evaluate the effectiveness of our business strategies.\nWe believe that the use of EBITDA and Adjusted EBITDA provides an additional tool for investors to use in evaluating ongoing operating results and trends and in comparing the Company's financial measures with other restaurants, which may present similar non-GAAP financial measures to investors. In addition, you should be aware when evaluating EBITDA and Adjusted EBITDA that in the future we may incur expenses similar to those excluded when calculating these measures. Our presentation of these measures should not be construed as an inference that our future results will be unaffected by unusual or non-recurring items. Our computation of Adjusted EBITDA may not be comparable to other similarly titled measures computed by other companies, because all companies do not calculate Adjusted EBITDA in the same fashion.\nOur management does not consider EBITDA or Adjusted EBITDA in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitation of EBITDA and Adjusted EBITDA is that they exclude significant expenses and income that are required by GAAP to be recorded in the Company's financial statements. Some of these limitations are:\n● Adjusted EBITDA does not reflect our cash expenditures, or future requirements, for capital expenditures or contractual commitments;\n● Adjusted EBITDA does not reflect changes in, or cash requirements for, our working capital needs;\n● Adjusted EBITDA does not reflect the interest expense, or the cash requirements necessary to service interest or principal payments, on our debts;\n● Although depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and Adjusted EBITDA does not reflect any cash requirements for such replacements;\n● Stock based compensation expense is and will remain a key element of our overall long-term incentive compensation package, although we exclude it as an expense when evaluating our ongoing performance for a particular period;\n● Adjusted EBITDA does not reflect the impact of certain cash charges resulting from matters we consider not to be indicative of our ongoing operations; and\n● Other companies in our industry may calculate Adjusted EBITDA differently than we do, limiting its usefulness as a comparative measure.\nBecause of these limitations, Adjusted EBITDA should not be considered in isolation or as a substitute for performance measures calculated in accordance with GAAP. We compensate for these limitations by relying primarily on our GAAP results and using Adjusted EBITDA only as a supplementary measure. You should review the reconciliation of net income (loss) to EBITDA and Adjusted EBITDA below and not rely on any single financial measure to evaluate our business.\nThe following table reconciles net income (loss) to EBITDA and Adjusted EBITDA (in thousands):\nFiscal Year\nNet (loss) income, as reported $ (2,641 ) $ 16,787\nDepreciation and amortization (a) 3,796 3,770\nProvision for income taxes (5 )\nInterest expense, net\nEBITDA 1,204 20,832\nPreopening expense (a) (1)\nNon-cash stock-based compensation (2)\nGAAP rent - cash rent difference (3) (403 ) (508 )\nGain on disposal of assets (4) (538 ) (37 )\nGain on debt extinguishment - (11,778 )\nOne-time special allocation to Bad Daddys partnerships -\nLitigation Contingencies -\nAsset impairment charges (5) 3,437 -\nAdjusted EBITDA $ 4,849 $ 9,637\n(a) Depreciation and amortization expenses are presented net of the share attributable to the non-controlling interest.\n(1) Represents expenses directly associated with the opening of new restaurants, including preopening rent.\n(2) Represents non-cash stock-based compensation as described in Note 8 to the financial statements.\n(3) Represents the excess of cash rent incurred over the amount of GAAP rent recorded in the financial statements.\n(4) Primarily related to deferred gains on previous sale-leaseback transactions on two Good Times restaurants.\n(5) Represents costs recognized in connection the asset impairment charges as described in Note 1 to the financial statements.\nDepreciation and amortization, preopening expense, and asset impairment charge have been reduced by any amounts attributable to non-controlling interests.\nLiquidity and Capital Resources\nCash and Working Capital: As of September 27, 2022, we had a working capital deficit of $1,036,000. Our working capital position benefits from the fact that we generally collect cash from sales to customers the same day, or in the case of credit or debit card transactions, within a few days of the related sale. Although we have two to four weeks to pay many of our vendors, we currently are paying our primary foodservice vendors on 1-3 day payment terms to take advantage of early pay discounts. Our current working capital deficit is largely caused by the recognition of short-term lease liabilities, as we lease substantially all of our real estate and have both current- and long-term obligations to our landlords. We believe that we will have sufficient capital to meet our working capital, and recurring capital expenditure needs in fiscal 2023. As of September 27, 2022, the Company had approximately $204,000 in outstanding construction commitments related to signage upgrades at some of our currently operating Good Times restaurants. We anticipate any commitments in fiscal 2023 will be funded out of existing cash or future borrowings against the Cadence Credit Facility.\nFinancing\nCadence Credit Facility:\nThe Company maintains a credit agreement with Cadence Bank (Cadence) pursuant to which, as amended, Cadence has agreed to loan the Company up to $8,000,000 with a maturity date of January 31, 2023 (as amended, the Cadence Credit Facility). As amended by the various amendments, the Cadence Credit Facility accrues commitment fees on the daily unused balance of the facility at a rate of 0.25%. As of the date of filing of this report, any borrowings under the Cadence Credit Facility, as amended, bear interest at a variable rate based upon the Companys election of (i) 2.5% plus the base rate, which is the highest of the (a) Federal Funds Rate plus 0.5%, (b) the Cadence Bank publicly announced prime rate, and (c) LIBOR plus 1.0%, or (ii) LIBOR, with a 0.250% floor, plus 3.5%. Interest is due at the end of each calendar quarter if the Company elects to pay interest based on the base rate and at the end of each LIBOR period if it elects to pay interest based on LIBOR. The Cadence Credit Facility includes provisions for the Administrative Agent of the facility to amend the facility to replace LIBOR with an alternate benchmark rate, which may be (but is not required to be) SOFR, at such point in time when appliable LIBOR rates are no longer available or no longer reliable. The exact timing of any transition of LIBOR to an alternate benchmark rate is not currently known. The Company is currently reviewing its future credit facility needs and intends to negotiate an amendment to the existing credit agreement or enter into a new credit agreement prior to January 31, 2023.\nAs of the date of filing this report, the Cadence Credit Facility contains certain affirmative and negative covenants and events of default that the Company considers customary for an agreement of this type, including financial covenants setting a maximum leverage ratio of 5.15:1, a minimum pre-distribution fixed charge coverage ratio of 1.25:1, a minimum post-distribution fixed charge coverage ratio of 1.10:1 and minimum liquidity of $2.0 million. As of the date of filing this report, the Company was in compliance with all of these financial covenants under the Cadence Credit Facility.\nAs a result of entering into the Cadence Credit Facility and the various amendments, the Company paid loan origination costs including professional fees of approximately $308,500 and is amortizing these costs over the term of the credit agreement.\nThe obligations under the Cadence Credit Facility are collateralized by a first-priority lien on substantially all of the Companys assets.\nAs of the date of filing this report, there were no outstanding borrowings against the facility. Availability of the Cadence Credit Facility for borrowings is reduced by the outstanding face value of any letters of credit issued under the facility. As of the date of filing this report, there were no outstanding letters of credit issued under the facility.\nOn May 7, 2020, Good Times and three of its wholly-owned subsidiaries, BDI, Drive Thru, and BD of Colo (each a Borrower), entered into unsecured loans in the aggregate principal amount of $11,645,000 (the Loans) with Cadence Bank, N.A. (the Lender) pursuant to the Paycheck Protection Program.\nIn June 2021, the SBA approved forgiveness in full of the Loans, including accrued interest, in the aggregate amount of $11,778,226, which was recognized as gain on debt extinguishment in the fiscal year ended September 28, 2021. The principal and accrued interest balance on each of these Loans is now zero, as of the forgiveness date specific to each of the Companys and its subsidiaries Loans.\nTotal interest expense on notes payable and capital leases was $20,000 and $269,000 for fiscal 2022 and fiscal 2021, respectively.\nPaycheck Protection Program Loans: On May 7, 2020, Good Times and three of its wholly-owned subsidiaries, BDI, Drive Thru, and BD of Colo (each a Borrower), entered into unsecured loans in the aggregate principal amount of $11,645,000 (the Loans) with Cadence Bank, N.A. (the Lender) pursuant to the PPP.\nIn June 2021, the SBA approved forgiveness in full of the Loans, including accrued interest, in the aggregate amount of $11,778,226, which was recognized as gain on debt extinguishment in the fiscal year ended September 28, 2021. The principal and accrued interest balance on each of these Loans is now zero, as of the forgiveness date specific to each of the Companys and its subsidiaries Loans.\nTotal interest expense on notes payable and capital leases was $269,000 and $755,000 for fiscal 2021 and fiscal 2020, respectively.\nAs of the date of filing this report, there was no gain on debt extinguishment.\nCash Flows: Net cash provided by operating activities was $5,291,000 for fiscal 2022 compared to net cash provided by operating activities of $9,145,000 in fiscal 2021. The net cash provided by operating activities for fiscal 2022 was the result of net loss of $941,000 offset by non-cash reconciling items totaling $6,232,000. These reconciling items are comprised of 1) depreciation and amortization of general assets of $4,057,000, 2) amortization of operating lease assets of $3,849,000, 3) Decrease of ROU assets of $219,000, 4) Decrease in the recognition of deferred gain on sale of buildings of $34,000, 5) Gain on lease termination of $642,000, 6) Impairment of long-lived assets of $3,437,000, 7)stock-based compensation expense of $250,000, 4) 5) an increase in receivables and other assets of $278,000, 6) an increase in deferred liabilities and accrued expenses of $515,000, 7) a decrease in accounts payable of $654,000 and 8) a net decrease in amounts related to our operating leases of $4,496,000, 9) and a provision for income taxes of $9,000.\nNet cash used in investing activities in fiscal 2022 was $2,624,000 compared to net cash used in investing activities of $3,185,000 in fiscal 2021. Fiscal 2022 activity primarily reflects the purchases of property and equipment of $2,641,000. Purchases of property and equipment were comprised of the following:\n● $1,510,000 for miscellaneous capital expenditures related to our Bad Daddys restaurants, including cash and non-cash portions of the acquisition of one previously franchised location;\n● $601,000 for miscellaneous capital expenditures related to our Good Times restaurants;\n● $220,000 for miscellaneous capital expenditures related to our restaurant support center;\n● $310,000 for construction in progress work primarily for Good Times signage work in progress and various Bad Daddys and Good Times equipment purchases for work in progress at the end of fiscal 2022, carrying into fiscal 2023.\nNet cash used in financing activities in fiscal 2022 was $2,617,000 compared to net cash provided by financing activities of $8,558,000 in fiscal 2021. The fiscal 2022 activity is comprised of the purchase of treasury stock equal to $1,026,000, proceeds from the exercise of stock options equal to $156,000, and net distributions to non-controlling interests of $1,747,000.\nContingencies and Off-Balance Sheet Arrangements: We remain contingently liable on various leases underlying restaurants that were previously sold to franchisees. We have never experienced any losses related to these contingent lease liabilities, however if a franchisee defaults on the payments under the leases, we would be liable for the lease payments as the assignor or sub-lessor of the lease. Currently we have not been notified nor are we aware of any leases in default by the franchisees, however there can be no assurance that there will not be in the future which could have a material effect on our future operating results.\nCritical Accounting Policies and Estimates: Our consolidated financial statements and accompanying notes are prepared in accordance with GAAP. Preparing consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses. These estimates and assumptions are affected by the application of our accounting policies. Our significant accounting policies are described in Note 1 to our Consolidated Financial Statements. Critical accounting estimates are those that require application of managements most difficult, subjective or complex judgments, often as a result of matters that are inherently uncertain and may change in subsequent periods. While we apply our judgment based on assumptions believed to be reasonable under the circumstances, actual results could vary from these assumptions. Additionally, in the context of the ongoing global COVID-19 pandemic, future facts and circumstances could change and impact our estimates and assumptions. It is possible that materially different amounts would be reported using different assumptions. The following is a description of what we consider to be our most significant accounting policies.\nLeases: The Company determines if a contract contains a lease at inception. The Company's material long-term operating lease agreements are for the land and buildings for our restaurants as well as our corporate office. The initial lease terms range from 10 years to 20 years, most of which include renewal options of 10 to 15 years. The lease term is generally the minimum of the noncancelable period or the lease term including renewal options which are reasonably certain of being exercised up to a term of approximately 20 years.\nOperating lease assets and liabilities are recognized at the lease commencement date for material leases with a term of greater than 12 months. Operating lease liabilities represent the present value of future minimum lease payments. Since our leases do not provide an implicit rate, our operating lease liabilities are calculated using our estimated incremental borrowing rate based on a collateralized borrowing over the term of each individual lease. Minimum lease payments include only fixed lease components of the agreement, as well as variable rate payments that depend on an index, initially measured using the index at the lease commencement date.\nOperating lease assets represent our right to use an underlying asset and are based upon the operating lease liabilities adjusted for prepaid or accrued lease payments, initial direct costs and lease incentives. Lease incentives are recognized when earned and reduce our operating lease asset related to the lease. They are amortized through the operating lease assets as reductions of rent expense over the lease term.\nOperating lease expense is recognized on a straight-line basis over the lease term. Certain of the Companys operating leases contain clauses that provide for contingent rent based on a percentage of sales greater than certain specified target amounts. Variable lease payments that do not depend on a rate or index, escalation in the index subsequent to the initial measurement, payments associated with non-lease components such as common area maintenance, real estate taxes and insurance, and short-term lease payments (leases with a term with 12 months or less) are expensed as incurred or when the achievement of the specified target that triggers the contingent rent is considered probable. During the fiscal year ended September 27, 2022 the Company incurred $136,000 of contingent rent.\nSome of the leases provide for base rent, plus additional rent based on gross sales, as defined in each lease agreement. The Company is also generally obligated to pay certain real estate taxes, insurance and common area maintenance charges, and various other expenses related to properties, which are expensed as incurred.\nEmployee Medical Plans: We sponsor health and welfare plans that provides medical insurance benefits to certain of our employees. We partially self-insure against claims made by participants in this plan and maintain coverage above a certain threshold for claims against individual claimants within a plan year (the stop loss limit). Prior to each plan year, we underwrite the plans based upon their then-current membership and estimate aggregate claims costs for the next plan year for each plan on a per-member average basis. Estimated costs (net of any employee contribution) are recognized as part of restaurant labor for restaurant employees. Estimated costs (net of any employee contribution) for non-restaurant employees are recognized as part of General and Administrative expenses. During the year, we periodically review claims costs against estimates made prior to the inception of the plan year. Significant differences between actual and estimated claims activity (underwriting losses or underwriting gains) are recognized as part of General and Administrative expenses. Due to the relatively small number of members in the plans, should we have a significant number of members with high-cost claims in any given year, we may experience significant underwriting losses.\nNon-controlling Interests: Non-controlling interests are presented as a separate item in the equity section of the consolidated balance sheet. Consolidated net income or loss attributable to non-controlling interests are presented on the face of the consolidated statement of operations. Additionally, changes in a parents ownership interest in a subsidiary that do not result in deconsolidation are equity transactions, and that deconsolidation of a subsidiary is recorded as a gain or loss based on the fair value on the deconsolidation date.\nIncome Taxes: We account for income taxes under the liability method whereby deferred tax asset and liability account balances are determined based on differences between the financial reporting and tax bases of assets and liabilities and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. We provide a valuation allowance, if necessary, to reduce deferred tax assets to their estimated realizable value. We continually review the realizability of our deferred tax assets, including an analysis of factors such as future taxable income, reversal of existing taxable temporary differences, and tax planning strategies. We assessed whether a valuation allowance should be recorded against our deferred tax assets based on consideration of all available evidence, using a more likely than not standard. In assessing the need for a valuation allowance, we considered both positive and negative evidence related to the likelihood of realization of deferred tax assets. In making such assessment, more weight was given to evidence that could be objectively verified, including recent cumulative losses. Future sources of taxable income were also considered in determining the amount of the recorded valuation allowance. Based on our review of this evidence, we determined that a full valuation allowance against all of our deferred tax assets was appropriate. As we increase earnings and utilize deferred tax assets in the future, it is possible the valuation allowance could be reduced or eliminated.\nThe Company is subject to U.S. federal income tax and income tax in multiple U.S. state jurisdictions. The Company continues to remain subject to examination by federal authorities and state jurisdictions generally for fiscal years after 2017. The Company believes that its income tax filings positions and deductions will be sustained on audit and does not anticipate any adjustments that will result in a material adverse effect on the Companys financial condition, results of operations, or cash flows. Therefore, no reserves for uncertain income tax positions have been recorded. The Companys practice is to recognize interest and/or penalties related to income tax matters in income tax expense. We have accrued $0 for interest and penalties as of September 27, 2022.\nVariable Interest Entities: Once an entity is determined to be a Variable Interest Entity (VIE), the party with the controlling financial interest, the primary beneficiary, is required to consolidate it. We previously had three franchisees with notes payable and after analysis we had determined that, while the franchisees were VIEs, we are not the primary beneficiary of the entities, and therefore they are not required to be consolidated. We no longer have any notes receivable from any of our franchisees.\nRecent Accounting Pronouncements\nThe information contained in Note 1 to our consolidated financial statements included in this report concerning a description of recent accounting pronouncements, including our expected dates of adoption and the estimated effects on our results of operations and financial condition, is incorporated by reference herein. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe report of the independent registered public accounting firm and financial statements listed in the accompanying index are included in Item 15 of this report. See index to the consolidated financial statements on page of this Annual Report on Form 10-K. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable. ITEM 9A. CONTROLS AND PROCEDURES\nConclusion Regarding the Effectiveness of Disclosure Controls and Procedures: Based on an evaluation of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Exchange Act), the Companys Chief Executive Officer (its principal executive officer) and Senior Vice President of Finance (its principal financial officer) has concluded that the Companys disclosure controls and procedures were effective as of the end of the period covered by this report.\nManagements Report on Internal Control Over Financial Reporting: Our management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act). We maintain a system of internal controls that is designed to provide reasonable assurance in a cost-effective manner as to the fair and reliable preparation and presentation of the consolidated financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nOur management conducted an evaluation of the effectiveness of our internal control over financial reporting as of September 27, 2022. In making this evaluation, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). This evaluation included a review of the documentation of controls, evaluation of the design effectiveness of controls and a conclusion on this evaluation. Based on this assessment, our management concluded that, as of September 27, 2022, the Companys internal control over financial reporting was effective based on these criteria.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to rules of the SEC that permit us to provide only managements report in this Annual Report.\nChanges in Internal Control over Financial Reporting: There have been no significant changes in the Companys internal control over financial reporting that occurred during the Companys fiscal year ended September 27, 2022 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNothing to report.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nWe will file a definitive proxy statement for our 2023 Annual Meeting of Shareholders with the SEC, pursuant to Regulation 14A, not later than 120 days after the end of our fiscal year. Accordingly, those sections of our definitive Proxy Statement that specifically address the items set forth herein are incorporated by reference. Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by Item 10 is hereby incorporated by reference from our definitive proxy statement relating to our 2023 Annual Meeting of Shareholders, to be filed with the SEC within 120 days following the end of our fiscal year covered by this Form 10-K.\nBoard Diversity\nUnder Nasdaq Rule 5605(f) Nasdaq-listed companies are required, subject to certain exceptions, (1) to have at least one director who self-identifies as a female, and (2) to have at least one director who self-identifies as Black or African American, Hispanic or Latinx, Asian, Native American or Alaska Native, Native Hawaiian or Pacific Islander, two or more races or ethnicities, or as LGBTQ+, or (3) to explain why the reporting company does not have at least two directors on its board who self-identify in the categories listed above. Under Nasdaq Rule 5605(f)(2)(D), boards of directors composed of five or fewer members must have one director who is Diverse as defined by the Rule and are not subject to the requirements of subparagraphs (A), (B), and (C) of Rule 5605(f)(2) until and unless they expand the board beyond five members.\nIn addition, Nasdaq Rule 5606 (Board Diversity Disclosure) requires each Nasdaq-listed company, again subject to certain exceptions, to provide statistical information about such companys Board of Directors, in a specified format, related to each directors self-identified gender, race, and self-identification as LGBTQ+. This matrix is presented below. The Company believes it is in compliance with the diversity requirements imposed by the Nasdaq listing rules.\nBoard Diversity Matrix (as of December 15, 2022):\nBoard Size:\nTotal Number of Directors\nGender:\nMale Female Non-\nBinary Gender\nUndisclosed\nNumber of directors based on gender identity 0\nNumber of directors who identify in any of the categories below:\nAfrican American or Black 0\nAlaskan Native or American Indian 0\nAsian 0\nHispanic or Latinx 0\nNative Hawaiian or Pacific Islander 0\nWhite 0\nTwo or More Races or Ethnicities 0\nLGBTQ+\nUndisclosed Item 11. EXECUTIVE COMPENSATION\nThe information required by Item 11 is hereby incorporated by reference from our definitive proxy statement relating to our 2023 Annual Meeting of Shareholders, to be filed with the SEC within 120 days following the end of our fiscal year covered by this Form 10-K. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nThe information required by Item 12 is hereby incorporated by reference from our definitive proxy statement relating to our 2023 Annual Meeting of Shareholders, to be filed with the SEC within 120 days following the end of our fiscal year covered by this Form 10-K. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by Item 13 is hereby incorporated by reference from our definitive proxy statement relating to our 2023 Annual Meeting of Shareholders, to be filed with the SEC within 120 days following the end of our fiscal year covered by this Form 10-K. Item 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by Item 14 is hereby incorporated by reference from our definitive proxy statement relating to our 2023 Annual Meeting of Shareholders, to be filed with the SEC within 120 days following the end of our fiscal year covered by this Form 10-K.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\na) The following documents have been filed as part of this report or, where noted, incorporated by reference:\n1) Financial Statements\nThe Companys consolidated financial statements are included beginning on page.\n2) Financial Statement Schedules\nAll schedules have been omitted because the matter or conditions are not present, or the information required to be set forth therein is included in the Companys consolidated financial statements and related notes thereto.\n3) Exhibits\nThe following exhibits are furnished as part of this report:\nExhibit\nDescription\n2.1\nMembership Interest Purchase Agreement, dated April 24, 2015, among Good Times Restaurants Inc., FS-BDI Holdings, LLC, Thompson Family Associates, LLC, Keeper Investments, LLC, James C. Verney and Fenner Restaurant Group, LLC (previously filed as Exhibit 2.1 to the registrants Current Report on Form 8-K filed April 28, 2015 (File No. 000-18590) and incorporated herein by reference)\n3.1(P)\nArticles of Incorporation of Good Times Restaurants Inc. (previously filed on November 30, 1988 as Exhibit 3.1 to the registrants Registration Statement on Form S-18 (File No. 33-25810-LA) and incorporated herein by reference)\n3.2(P)\nAmendment to Articles of Incorporation of Good Times Restaurants Inc. dated January 23, 1990 (previously filed on January 18, 1990 as Exhibit 3.1 to the registrants Current Report on Form 8-K (File No. 000-18590) and incorporated herein by reference)\n3.3\nAmendment to Articles of Incorporation of Good Times Restaurants Inc. dated June 15, 1994 (previously filed as Exhibit 3.3 to the registrants Amendment No. 1 to Registration Statement on Form S-1 filed June 7, 2013 (File No. 333-188183) and incorporated herein by reference)\n3.4\nAmendment to Articles of Incorporation of Good Times Restaurants Inc. dated September 23, 1996 (previously filed as Exhibit 3.5 to the registrants Annual Report on Form 10-KSB for the fiscal year ended September 30, 1996 (File No. 000-18590) and incorporated herein by reference)\n3.5\nCertificate of Designations, Preferences, and Rights of Series B Convertible Preference Stock of Good Times Restaurants Inc. (previously filed as Exhibit 1 to the Amendment No. 6 to Schedule 13D filed by The Erie County Investment Co., The Bailey Company, LLLP and Paul T. Bailey (File No. 005-42729) on February 14, 2005 and incorporated herein by reference)\n3.6\nCertificate of Change of Good Times Restaurants Inc. (previously filed as Exhibit 3.1 to the registrants Current Report on Form 8-K filed January 12, 2011 (File No. 000-18590) and incorporated herein by reference)\n3.7\nCertificate of Designations, Preferences, and Rights of Series C Convertible Preferred Stock of Good Times Restaurants Inc. (previously filed as Exhibit 3.1 to the registrants Current Report on Form 8-K filed September 20, 2012 (File No. 000-18590) and incorporated herein by reference)\n3.8\nRestated Bylaws of Good Times Restaurants Inc. dated November 7, 1997 (previously filed as Exhibit 3.6 to the registrants Annual Report on Form 10-KSB for the fiscal year ended September 30, 1997 (File No. 000-18590) and incorporated herein by reference)\n3.9\nAmendment to Restated Bylaws of Good Times Restaurants Inc. dated August 14, 2007 (previously filed as Exhibit 3.1 to the registrant's Current Report on Form 8-K filed December 31, 2007 (File No. 000-18590) and incorporated herein by reference)\n3.10\nAmendment to Restated Bylaws of Good Times Restaurants Inc. dated August 30, 2013 (previously filed as Exhibit 3.1 to the registrants Current Report on Form 8-K filed September 6, 2013 (File No. 000-18590) and incorporated herein by reference)\n3.11\nAmendment to Restated Bylaws of Good Times Restaurants Inc. dated May 2, 2014 (previously filed as Exhibit 10.3 to the registrants Current Report on Form 8-K filed May 7, 2014 (File No. 000-18590) and incorporated herein by reference)\n3.12\nAmendment to Restated Bylaws of Good Times Restaurants Inc. dated December 18, 2014 (previously filed as Exhibit 3.1 to the registrants Current Report on Form 8-K filed December 22, 2014 (File No. 000-18590) and incorporated herein by reference)\n3.13\nAmendment to Restated Bylaws of Good Times Restaurants Inc. dated November 16, 2017 (previously filed as Exhibit 3.1 to the registrants Current Report on Form 8-K filed November 22, 2017 (File No. 000-18590) and incorporated herein by reference)\n3.14\nAmendment to Restated Bylaws of Good Times Restaurants Inc. dated April 13, 2018 (previously filed as Exhibit 3.2 to the registrants Current Report on Form 8-K filed April 17, 2018 (File No. 000-18590) and incorporated herein by reference)\n4.1\nSpecimen Common Stock Certificate (previously filed as Exhibit 4.1 to the registrants Amendment No. 1 to Registration Statement on Form S-1 filed June 7, 2013 (File No. 333-188183) and incorporated herein by reference)\n4.2*\nDescription of Securities\n10.1+\nGood Times Restaurants Inc. 2008 Omnibus Equity Incentive Compensation Plan (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed January 30, 2008 (File No. 000-18590) and incorporated herein by reference)\n10.2+\nAmendment to the Good Times Restaurants Inc. 2008 Omnibus Equity Incentive Compensation Plan dated September 14, 2012 (previously filed as Exhibit 10.10 to the registrants Registration Statement on Form S-1 filed April 26, 2013 (File No. 333-188183) and incorporated herein by reference)\n10.3+\nAmendment to the Good Times Restaurants Inc. 2008 Omnibus Equity Incentive Compensation Plan (previously filed as Annex B to the registrants Proxy Statement on Schedule 14A filed April 25, 2018 (File No. 000-18590) and incorporated herein by reference)\n10.4+\nGood Times Restaurants Inc. 2018 Omnibus Equity Incentive Compensation Plan (previously filed as Annex A to the registrants Proxy Statement on Schedule 14A filed April 25, 2018 (File No. 000-18590) and incorporated herein by reference)\n10.5+\nAmendment to the Good Times Restaurants Inc. 2018 Omnibus Equity Incentive Compensation Plan (previously filed as Annex A to the registrants Proxy Statement on Schedule 14A filed December 18, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.6+\nSecond Amendment to the Good Times Restaurants Inc. 2018 Omnibus Equity Incentive Plan (previously filed as Annex A to the registrants Proxy Statement on Schedule 14A filed on December 16, 2021 (File No. 000-18590) and incorporated herein by reference\n10.7\nSupplemental Agreement dated September 28, 2012 between Good Times Restaurants Inc. and Small Island Investments Limited (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed October 1, 2012 (File No. 000-18590) and incorporated herein by reference)\n10.8\nAmendment to Supplemental Agreement dated October 16, 2012 between Good Times Restaurants Inc. and Small Island Investments Limited (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed October 16, 2012 (File No. 000-18590) and incorporated herein by reference)\n10.9\nSecurities Purchase Agreement, dated May 2, 2014, among Hoak Public Equities, L.P., Rest Redux LLC, and Small Island Investments Limited (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed May 7, 2014 (File No. 000-18590) and incorporated herein by reference)\n10.10+\nEmployment Agreement, effective September 27, 2016, by and between Good Times Restaurants Inc. and Scott G. LeFever (previously filed as Exhibit 10.3 to the registrants Current Report on Form 8-K filed September 30, 2016 (File No. 000-18590) and incorporated herein by reference)\n10.11+\nEmployment Agreement, effective September 27, 2016, by and between Good Times Restaurants Inc. and Susan M. Knutson (previously filed as Exhibit 10.4 to the registrants Current Report on Form 8-K filed September 30, 2016 (File No. 000-18590) and incorporated herein by reference)\n10.11+\nEmployment Agreement, effective August 1, 2017, by and between Good Times Restaurants Inc. and Ryan M. Zink (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed July 19, 2017 (File No. 000-18590) and incorporated herein by reference)\n10.12+\nAmended Employment Agreement, effective August 5, 2019, by and between Good Times Restaurants Inc. and Ryan M. Zink (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed August 8, 2019 (File No. 000-18590) and incorporated herein by reference)\n10.13+\nAmended and Restated Employment Agreement, dated April 6, 2020, between Ryan M. Zink and Good Times Restaurants Inc. (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed April 10, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.14+\nSecond Amended and Restated Employment Agreement, dated December 24, 2020, between Ryan M. Zink and Good Times Restaurants Inc. (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed December 28, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.15+\nFirst Amendment to Second Amended and Restated Employment Agreement, dated September 28, 2022, between Ryan M. Zink and Good Times Restaurants Inc. (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed September 30, 2022 (File No. 000-18590) and incorporated herein by reference)\n10.16+\nSeverance Agreement, dated October 8, 2019 between Good Times Restaurants Inc. and Boyd E. Hoback (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed on October 8, 2019 (File No. 000-18590) and incorporated herein by reference)\n10.17+\nRepurchase Option Agreement, dated October 8, 2019 between Good Times Restaurants Inc. and Boyd E. Hoback (previously filed as Exhibit 10.2 to the registrants Current Report on Form 8-K filed on October 8, 2019 (File No. 000-18590) and incorporated herein by reference)\n10.18\nCadence Bank Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed September 13, 2016 (File No. 000-18590) and incorporated herein by reference)\n10.19\nCadence Bank Security and Pledge Agreement (previously filed as Exhibit 10.2 to the registrants Current Report on Form 8-K filed September 13, 2016 (File No. 000-18590) and incorporated herein by reference)\n10.20\nCadence Bank First Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed September 12, 2017 (File No. 000-18590) and incorporated herein by reference)\n10.21\nCadence Bank Second Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed November 2, 2018 (File No. 000-18590) and incorporated herein by reference)\n10.22\nCadence Bank Third Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 10-Q filed May 10, 2019 (File No. 000-18590) and incorporated herein by reference)\n10.23\nCadence Bank Fourth Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed December 13, 2019 (File No. 000-18590) and incorporated herein by reference)\n10.24\nCadence Bank Fifth Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed January 14, 2021 (File No. 000-18590) and incorporated herein by reference)\n10.25\nCadence Bank Sixth Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed August 16, 2021 (File No. 000-18590) and incorporated herein by reference)\n10.26\nCadence Bank Seventh Amendment to Credit Agreement (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed February 3, 2022 (File No. 000-18590) and incorporated herein by reference)\n10.27\nConsent and Forbearance Agreement, dated as of April 14, 2020 but effective March 31, 2020 by and among Good Times Restaurants Inc., each of its wholly-owned subsidiaries and Cadence Bank, N.A. (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed April 20, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.28\nPromissory Note, dated as of May 7, 2020, by Good Times Restaurants, Inc. in favor of Cadence Bank, NA (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed May 12, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.29\nPromissory Note, dated as of May 7, 2020, by Bad Daddys International, LLC. in favor of Cadence Bank, NA (previously filed as Exhibit 10.2 to the registrants Current Report on Form 8-K filed May 12, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.30\nPromissory Note, dated as of May 7, 2020, by Good Times Drive-Thru Inc.in favor of Cadence Bank, NA (previously filed as Exhibit 10.3 to the registrants Current Report on Form 8-K filed May 12, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.31\nPromissory Note, dated as of May 7, 2020, by BD of Colorado, LLC. in favor of Cadence Bank, NA (previously filed as Exhibit 10.4 to the registrants Current Report on Form 8-K filed May 12, 2020 (File No. 000-18590) and incorporated herein by reference)\n10.32\nAgreement, dated March 12, 2018, between Good Times Restaurants Inc. and Robert J. Stetson and where applicable his controlled affiliates, and Charles Jobson and where applicable his controlled affiliates (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed March 13, 2018 (File No. 000-18590) and incorporated herein by reference)\n10.33\nAmendment to Agreement, dated April 13, 2018, between Good Times Restaurants Inc. and Robert J. Stetson and where applicable his controlled affiliates, and Charles Jobson and where applicable his controlled affiliates (previously filed as Exhibit 10.1 to the registrants Current Report on Form 8-K filed April 17, 2018 (File No. 000-18590) and incorporated herein by reference)\n10.34+\nStock Option Award Agreement between the Company and Mathew Karnes dated March 7, 2022 (previously filed as Exhibit 10.1 to the Registrants 8-K filed on March 8, 2022 (File No. 000-18590)\n21.1*\nSubsidiaries of the Company\n23.1*\nConsent of Moss Adams LLP, Independent Registered Public Accounting Firm\n31.1*\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a)/15d-14(a)\n31.2*\nCertification of Principal Financial Officer pursuant to Rule 13a-14(a)/15d-14(a)\n32.1*\nCertification of Chief Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File - the cover page interactive data file does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n* Filed herewith\n+ Indicates management compensatory plan, contract, or arrangement.\n(P) Paper exhibit.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nGOOD TIMES RESTAURANTS INC.\nDecember 15, 2022\nRyan M. Zink\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Ryan M. Zink\nRyan M. Zink, Principal Executive Officer and Director\n(Principal Executive Officer)\nDecember 15, 2022\n/s/ Matthew Karnes\nMatthew Karnes, Senior Vice President of Finance\n(Principal Financial Officer and Principal Accounting Officer)\nDecember 15, 2022\n/s/ Geoffrey R. Bailey\nGeoffrey R. Bailey, Chairman of the Board\nDecember 15, 2022\n/s/ Charles Jobson\nCharles Jobson, Director\nDecember 15, 2022\n/s/ Jason S. Maceda\nJason S. Maceda, Director\nDecember 15, 2022\n/s/ Jennifer C. Stetson\nJennifer C. Stetson, Director\nDecember 15, 2022\nITEM 8 FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nPAGE\nReport of Independent Registered Public Accounting Firm\n(PCAOB ID 659)\nConsolidated Balance Sheets - September 27, 2022 and September 28, 2021\nConsolidated Statements of Operations - For the Periods Ended September 27, 2022 and September 28, 2021\nConsolidated Statements of Shareholders Equity - For the Period from September 29, 2020 through September 27, 2022\nConsolidated Statements of Cash Flows - For the Periods Ended September 27, 2022 and September 28, 2021\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of\nGood Times Restaurants Inc. and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Good Times Restaurants Inc. and Subsidiaries (the Company) as of September 27, 2022, and September 28, 2021, the related consolidated statements of operations, shareholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of September 27, 2022, and September 28, 2021, and the consolidated results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures to respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Moss Adams LLP\nDenver, Colorado\nDecember 15, 2022\nWe have served as the Companys auditor since 2017.\nGood Times Restaurants Inc. and Subsidiaries Consolidated Balance Sheets\n(In thousands, except share and per share data)\nSeptember 27,\nSeptember 28,\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents $ 8,906 $ 8,856\nReceivables\nPrepaid expenses and other\nInventories 1,387 1,303\nTotal current assets 11,875 11,444\nPROPERTY AND EQUIPMENT\nLand and building 4,670 4,704\nLeasehold improvements 35,906 35,089\nFixtures and equipment 30,664 30,286\n71,240 70,079\nLess accumulated depreciation and amortization (48,989 ) (42,852 )\nTotal net property and equipment 22,251 27,227\nOTHER ASSETS:\nOperating lease right-of-use assets, net 42,463 45,737\nDeposits and other assets\nTrademarks 3,900 3,900\nOther intangibles, net\nGoodwill 5,713 5,150\n52,262 55,010\nTOTAL ASSETS $ 86,388 $ 93,681\nLIABILITIES AND SHAREHOLDERS EQUITY\nCURRENT LIABILITIES:\nAccounts payable $ 628 $ 1,496\nDeferred income\nOperating lease liabilities, current 5,430 4,935\nOther accrued liabilities 6,791\n6,394\nTotal current liabilities 12,897\n12,886\nLONG-TERM LIABILITIES:\nOperating lease liabilities, net of current portion 45,544 49,723\nDeferred and other liabilities\nTotal long-term liabilities 45,703 49,925\nCOMMITMENTS AND CONTINGENCIES (Note 5)\nSHAREHOLDERS EQUITY:\nGood Times Restaurants Inc. shareholders equity:\nPreferred stock, $.01 par value; 5,000,000 shares authorized, 0 shares issued and outstanding as of September 27, 2022 and September 28, 2021, respectively -\n-\nCommon stock, $.001 par value; 50,000,000 shares authorized 12,274,351 and 12,512,072 shares issued and outstanding as of September 27, 2022 and September 28, 2021, respectively\nCapital contributed in excess of par value 59,427 59,021\nTreasury stock, at cost 692,798 and 376,351 shares as of September 27, 2022 and September 28, 2021, respectively (2,634 ) (1,608 )\nAccumulated deficit (30,321 ) (27,680 )\nTotal Good Times Restaurants Inc. shareholders' equity 26,485 29,746\nNon-controlling interests 1,303 1,124\nTotal shareholders equity 27,788\n30,870\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY $ 86,388 $ 93,681\nSee accompanying notes to consolidated financial statements\nGood Times Restaurants Inc. and Subsidiaries Consolidated Statements of Operations\n(In thousands, except share and per share data)\nFiscal Year\n(52 Weeks) (52 Weeks)\nNET REVENUES:\nRestaurant sales $ 137,250 $ 123,058\nFranchise revenues\nTotal net revenues 138,200 123,953\nRESTAURANT OPERATING COSTS:\nFood and packaging costs 43,877 36,164\nPayroll and other employee benefit costs 46,515 41,049\nRestaurant occupancy costs 9,440 8,815\nOther restaurant operating costs 18,515 14,911\nPreopening costs\nDepreciation and amortization 3,895 3,842\nTotal restaurant operating costs 122,293 105,547\nGeneral and administrative costs 10,506 9,437\nAdvertising costs 3,164 2,082\nFranchise costs\nImpairment of long-lived assets 3,437 -\nGain on restaurant asset sale (676 ) (37 )\nLitigation Contingencies -\nINCOME (LOSS) FROM OPERATIONS (878 ) 6,897\nOTHER INCOME (EXPENSES):\nInterest expense (54 ) (269 )\nGain on debt extinguishment -\n11,778\nTotal other income (expense), net (54 ) 11,509\nNET INCOME (LOSS) BEFORE INCOME TAXES $ (932 ) $ 18,406\nProvision for income taxes $ 5 $ (6 )\nNET INCOME (LOSS) $ (927 ) $ 18,400\nIncome attributable to non-controlling interests $ (1,714 ) $ (1,613 )\nNET INCOME (LOSS) ATTRIBUTABLE TO COMMON SHAREHOLDERS $ (2,641 ) $ 16,787\nNET INCOME (LOSS) PER SHARE, ATTRIBUTABLE TO COMMON SHAREHOLDERS:\nBasic $ (0.21 ) $ 1.32\nDiluted $ (0.21 ) $ 1.31\nWEIGHTED AVERAGE COMMON SHARES OUTSTANDING\nBasic 12,464,408 12,677,652\nDiluted 12,464,408 12,828,180\nSee accompanying notes to consolidated financial statements\nGood Times Restaurants Inc. and Subsidiaries\nConsolidated Statements of Shareholders Equity\nFor the Period from September 29, 2020 thru September 27, 2022\n(In thousands, except share and per share data)\nTreasury Stock,\nat cost Common Stock Capital\nContributed Non-\nControllling\nShares Amount Issued\nShares Par\nValue in Excess of Par\nValue Interest In\nPartnerships Accumulated\nDeficit Total\nBALANCES, September 29, 2020 43,110 $ (75 ) 12,612,852 $ 13 $ 58,219 $ 1,293 $ (44,467 ) $ 14,983\nStock-based compensation cost - -\n- -\n-\n-\nRestricted stock unit vesting -\n-\n47,779 -\n-\n-\n-\n-\nStock option exercise -\n-\n184,682 -\n-\n-\nTreasury shares purchased 333,241 (1,533 ) (333,241 ) -\n-\n-\n-\n(1,533 )\nIncome attributable to non-controlling\ninterests - -\n- -\n-\n1,613 -\n1,613\nDistributions to unrelated limited partners - -\n- -\n-\n(1,802 ) -\n(1,802 )\nContributions from unrelated limited\npartners - -\n- -\n-\n-\nNet income attributable to Good Times\nRestaurants Inc and comprehensive income - -\n- -\n-\n-\n16,787 16,787\nBALANCES, September 28, 2021 376,351 $ (1,608 ) 12,512,072 $ 13 $ 59,021 $ 1,124 $ (27,680 ) $ 30,870\nStock-based compensation cost - -\n- -\n-\n-\nShares issued through common stock grants and RSU vesting -\n- 22,622 - - - - -\nStock option exercise -\n-\n56,104 -\n-\n-\nTreasury shares purchased 316,447 (1,026 ) (316,447 ) -\n-\n-\n-\n(1,026 )\nIncome attributable to non-controlling\ninterests - -\n- -\n-\n1,714 -\n1,714\nDistributions to unrelated limited\npartners - -\n- -\n-\n(1,568 ) -\n(1,568 )\nContributions from unrelated limited\npartners - -\n- -\n-\n-\nNet loss attributable to Good Times\nRestaurants Inc and comprehensive\nloss - -\n- -\n-\n-\n(2,641 ) (2,641 )\nBALANCES, September 27, 2022 692,798 $ (2,634 ) 12,274,351 $ 13 $ 59,427 $ 1,303 $ (30,321 ) $ 27,788\nSee accompanying notes to consolidated financial statements\nGood Times Restaurants Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\n(In thousands)\nFiscal Year\n(52 Weeks) (52 Weeks)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet Income (loss) $ (927 ) $ 18,400\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation and amortization 4,057 3,992\nAmortization of operating lease assets 3,849 3,515\nDecrease in ROU assets -\nRecognition of deferred gain on sale of restaurant building (34 ) (37 )\nGain on lease termination (642 ) -\nImpairment of long-lived assets 3,437 -\nStock based compensation expense\nGain on loan extinguishment -\n(11,778 )\nProvision for income taxes (5 )\nChanges in operating assets and liabilities:\n(Increase) decrease in:\nReceivables and prepaids (293 )\nInventories (64 ) (210 )\nDeposits and other assets (406 )\n(Decrease) increase in:\nAccounts payable (654 ) (1,389 )\nDeferred liabilities -\n(8 )\nOperating lease liabilities (4,496 ) (3,762 )\nAccrued and other liabilities\nNet cash provided by operating activities 5,291 9,145\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPayments for the purchase of property and equipment (2,641 ) (3,198 )\nAcquisition of restaurant from franchisee, net of cash acquired (728 ) -\nProceeds from lease termination -\nPayments received on loans to franchisees and to others -\nNet cash used in investing activities (2,624 ) (3,185 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nPrincipal payments on notes payable, capital leases, and long-term debt -\n(5,500 )\nPayment for the purchase of treasury stock (1,026 ) (1,533 )\nProceeds from stock option exercises\nContributions from non-controlling interests\nDistributions to non-controlling interests (1,780 ) (1,985 )\nNet cash used in provided by financing activities (2,617 ) (8,558 )\nINCREASE (DECREASE) IN CASH AND CASH EQUIVALENTS\n(2,598 )\nCASH AND CASH EQUIVALENTS, beginning of year 8,856 11,454\nCASH AND CASH EQUIVALENTS, end of year $ 8,906 $ 8,856\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION:\nCash paid for interest $ 20 $ 151\nNon-cash additions of property and equipment $ (214 ) $ 304\nSee accompanying notes to consolidated financial statements\nGood Times Restaurants Inc. and Subsidiaries\nNotes to Consolidated Financial statements\n(Tabular dollar amounts in thousands, except share and per share data)\n1. Organization and Summary of Significant Accounting Policies:\nOrganization - Good Times Restaurants Inc. (Good Times or the Company) is a Nevada corporation. The Company operates through its wholly owned subsidiaries Good Times Drive Thru, Inc. (Drive Thru), BD of Colorado, LLC (BD of Colo), Bad Daddys Franchise Development, LLC (BDFD), and Bad Daddys International, LLC (BDI).\nBD of Colo was formed by Good Times Restaurants Inc. in 2013 to develop Bad Daddys Burger Bar restaurants in the state of Colorado. Subsequently, BDI and BDFD were acquired by Good Times Restaurants Inc. on May 7, 2015. Combined, these entities compose our Bad Daddys operating segment, which as of September 27, 2022, operates thirty-five company-owned, five joint-venture, and one licensee full-service small-box casual dining restaurants under the name Bad Daddys Burger Bar, primarily located in the Southeast region of the United States and the state of Colorado and licenses the Bad Daddys brand for use at an airport Bad Daddys restaurant under third-party operations and ownership.\nDrive Thru commenced operations in 1986 and as of September 27, 2022, operates sixteen Company-owned and seven joint-venture drive-thru fast food hamburger restaurants under the name Good Times Burgers & Frozen Custard, all of which are located in Colorado. In addition, Drive Thru has eight franchisee-owned restaurants, with six operating in Colorado and two in Wyoming.\nWe follow accounting standards set by the Financial Accounting Standards Board, commonly referred to as the FASB. The FASB sets Generally Accepted Accounting Principles (GAAP) that we follow to ensure we consistently report our financial condition, results of operations, and cash flows.\nCOVID-19 Pandemic - The global crisis resulting from the spread of COVID-19 had a substantial impact on our restaurant operations for the fiscal year ended September 28, 2021 with much less impact on the fiscal year ended September 27, 2022.\nDuring portions of the month of November 2020 through early January 2021, all of the Companys Bad Daddys Burger Bar restaurants in Colorado were open only for limited outdoor dining, delivery and carry-out service, with indoor dining rooms once again closed by government orders. In early January 2021, we re-opened these dining rooms, with limited occupancy, as local regulations allowed. Our dining rooms in all other states in which Bad Daddys has operations were open at reduced capacity, during this time. Our dining rooms were open at full capacity for the full fiscal year ended September 27, 2022.\nWe obtained Paycheck Protection Program (the PPP) loans as made available under government COVID relief initiatives. We applied for full forgiveness of our PPP loans, including those of our subsidiaries, on April 30, 2020 and received confirmation of full forgiveness of all such loans during June 2021. We currently have a meaningful cash balance and generated significant cash flow from operations during the fiscal year ended September 27, 2022. We have used a portion of this cash balance to repurchase Company stock under the Companys Stock Repurchase Plan. On February 7, 2022, the Companys board of directors approved a program to purchase up to an aggregate amount of up to $5.0 million dollars worth of the companys common stock. As of September 27, 2022, a total of 316,447 shares have been repurchased under the plan, at an aggregate cost of approximately $1,065,000.\nOn August 13, 2021, the Company commenced a tender offer (the Tender Offer) to purchase up to 1,413,000 shares of its common stock at a price per share of $4.60. On September 10, 2021, at 11:59 pm, the offer expired, and the Company subsequently accepted for payment, at a purchase price of $4.60 per share, a total of 333,241 shares properly tendered and not properly withdrawn before the expiration date, at an aggregate cost of approximately $1,532,908, excluding fees and expenses relating to the Tender Offer.\nWhile we believe that we will continue to have adequate working capital to meet our current needs, should business decline significantly, we would not likely choose to, and we may not be able to, take some of the same actions as we took in prior years to increase our liquidity as they would negatively impact the long-term performance of the business.\nFiscal Year - The Companys fiscal year is a 52/53-week year ending on the last Tuesday of September. In a 52-week fiscal year, each of the Companys quarterly periods comprise 13 weeks. The additional week in a 53-week fiscal year is added to the first quarter, making such quarter consist of 14 weeks. Fiscal year 2022 began September 29, 2021 and ended September 27, 2022. Fiscal 2021 began September 30, 2020 and ended September 28, 2021.\nPrinciples of Consolidation - The consolidated financial statements include the accounts of Good Times, its subsidiaries, one limited partnership in which the Company exercises control as general partner, and five limited liability companies, in which the Company exercises control as managing member. The Company owns an approximate 54% interest in the Drive Thru limited partnership, is the sole general partner, and receives a management fee prior to any distributions to the limited partner. Because the Company owns an approximate 50% interest in the partnership and exercises complete management control over all decisions for the partnership, except for certain veto rights, the financial statements of the partnership are consolidated into the Companys consolidated financial statements. The Company owns an approximate 50% to 75% interest in four of the Bad Daddys limited liability companies and an approximate 23% interest in one. The Company is the managing member and receives royalty and management fees prior to any distributions to the other members. Because the Company exercises complete management control over all decisions for the five companies, except for certain veto rights, the financial statements of the limited liability companies are consolidated into the Companys financial statements. The equity interests of the unrelated limited partner and members are shown on the accompanying consolidated balance sheets in the shareholders equity section as a non-controlling interest and is adjusted each period to reflect the limited partners and members share of the net income or loss as well as any cash distributions to the limited partners and members for the period. The limited partners or members share of the net income or loss in the entities is shown as non-controlling interest income or expense in the accompanying consolidated statements of operations. All inter-company accounts and transactions are eliminated in consolidation.\nAdvertising Costs - We utilize Advertising Funds to administer certain advertising programs for both the Bad Daddys and Good Times brands that benefit both us and our franchisees. We and our franchisees are required to contribute a percentage of gross sales to the fund. As such the contributions to these funds are designated and segregated for advertising. We consolidate the Advertising Funds into our financial statements whereby contributions from franchisees, when received, are recorded and included as a component of franchise revenues. We intend to utilize all of the advertising contributions towards advertising expenditures; however, the timing of those expenditures may not occur in the year in which the advertising funds were collected. Historically we have returned to our franchisees excess advertising funds collected from them, however beginning in the current year have retained those funds to be used in future years and to better manage the cash flow of the advertising fund and recognized as a reduction of advertising expenses. Contributions to the Advertising Funds from our franchisees $273,000 and $278,000 for the fiscal years ended September 27, 2022 and September 28, 2021, respectively.\nAccounting Estimates - The preparation of consolidated financial statements in conformity with GAAP requires management to make estimates of and assumptions related to the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the consolidated financial statements, and the reported amounts of revenues and expenses during the reporting period. Examples include valuation of reporting units for purposes of assessing goodwill and other indefinite-lived intangible assets for impairment, valuation of asset groups for impairment testing, accruals for employee benefits, and certain contingencies. We base our estimates on historical experience, market participant fair value considerations, projected future cash flows, and various other factors that are believed to be reasonable under the circumstances. Actual results could differ from those estimates.\nCash and Cash Equivalents - The Company considers all highly liquid debt instruments purchased with an initial maturity of three months or less to be cash equivalents. The Company maintains cash and cash equivalents at financial institutions with balances that generally exceed the Federal Deposit Insurance Corporation (FDIC) insured limits of up to $250,000. The Company has not experienced any losses related to such accounts and management believes that the Company is not exposed to any significant risks on these accounts. Certain of the Companys accounts exceeded the FDIC insured limits as of September 27, 2022 and September 28, 2021.\nAccounts Receivable - Accounts receivable include uncollateralized receivables from our franchisees, due in the normal course of business, generally requiring payment within thirty days of the invoice date. Additionally, accounts receivable includes payments due from third-party delivery aggregators, and certain rebates from our key food and beverage vendors. It also includes payments due from property landlords related to tenant improvement allowances, none of which were owed in in the fiscal year ended September 27, 2022. On a periodic basis the Company monitors all accounts for delinquency and provides for estimated losses of uncollectible accounts. There were no allowances for unrecoverable accounts receivable at September 27, 2022 and September 28, 2021.\nInventories - Inventories are stated at the lower of cost or net realizable value, determined by the first-in first-out method, and consist of restaurant food items and related packaging supplies.\nProperty and Equipment - Property and equipment are stated at cost and are depreciated using the straight-line method over the estimated useful lives of the related assets, generally three to eight years. Leasehold improvements are amortized using the straight-line method over the shorter of the term of the lease or the estimated useful life of the asset.\nMaintenance and repairs are charged to expense as incurred, and expenditures for major improvements are capitalized. When assets are retired, or otherwise disposed of, the property accounts are relieved of costs and accumulated depreciation with any resulting gain or loss credited or charged to income.\nTrademarks - Trademarks have been determined to have an indefinite life. We evaluate our trademarks for impairment annually and on an interim basis as events and circumstances warrant by comparing the fair value of the trademarks with their carrying amount. No trademark impairment charges were recognized during the fiscal years ended September 27, 2022 or September 28, 2021.\nGoodwill - Goodwill represents the excess of cost over fair value of the assets of businesses the Company acquired. Goodwill is not amortized; but rather, the Company is required to test goodwill for impairment on an annual basis or whenever indications of impairment arise. The Company considers its operations to be comprised of two reporting units: (1) Good Times restaurants and (2) Bad Daddys restaurants.\nThe following table presents goodwill associated with each reporting unit as of September 27, 2022 and September 28, 2021 (in thousands):\nSeptember 27, 2022 September 28, 2021\nGood Times $ 96 $ 96\nBad Daddys 5,617 5,054\nTotal $ 5,713 $ 5,150\nGoodwill for the year ended September 27, 2022 increased $563,000 due to the purchase of a previously franchised Bad Daddys location in March 2022.\nImpairment of Long-Lived Assets - We review our long-lived assets including land, property and equipment for impairment when there are factors that indicate that the carrying amount of an asset may not be recoverable. We assess recovery of assets at the individual restaurant level and typically include an analysis of historical cash flows, future operating plans, and cash flow projections in assessing whether there are indicators of impairment. Recoverability of assets to be held and used is measured by comparing the net book value of the assets of an individual restaurant to the fair value of those assets. This impairment process involves judgment in the use of estimates and assumptions pertaining to future projections and operating results.\nGiven the results of our analyses throughout the fiscal year ended September 27, 2022, we identified five restaurants where the expected future cash flows would not be sufficient to recover the carrying value of the associated assets, resulting in non-cash charges of $3,437,000. Of this amount, $790,000 related to three Good Times restaurants and $2,647,000 related to two Bad Daddys restaurants.\nThere were no impairments in the fiscal year ended September 28, 2021.\nLeases - The Company accounts for leases consistent with Accounting Standards Update (ASU) 2016-02, Leases (Topic 842).\nThe Company determines if a contract contains a lease at inception. The Company currently has leases that are classified as operating leases. The Companys material long-term operating lease agreements are for the land and buildings for our restaurants as well as our corporate office. The lease term begins on the date that the Company takes possession under the lease, including the pre-opening period during construction, when in most cases the Company is not making rent payments.\nOperating lease assets and liabilities are recognized at the lease commencement date for material leases with a term of greater than 12 months. Operating lease liabilities represent the present value of future minimum lease payments. Since our leases do not provide an implicit rate, our operating lease liabilities are calculated using our estimated incremental borrowing rate based on a collateralized borrowing over the term of each individual lease. Minimum lease payments include only fixed lease components of the agreement, as well as variable rate payments that depend on an index, initially measured using the index at the lease commencement date.\nOperating lease assets represent our right to use an underlying asset and are based upon the operating lease liabilities adjusted for prepaid or accrued lease payments, initial direct costs and lease incentives. Lease incentives are recognized when earned and reduce our operating lease asset related to the lease. They are amortized through the operating lease assets as reductions of rent expense over the lease term.\nOperating lease expense is recognized on a straight-line basis over the lease term. In certain situations, lease contracts are amended or otherwise changed. Based upon an analysis of those changes, specifically whether additional rights have been conveyed and additional lease payments are required, the Company will assess whether the original lease is remeasured, or whether an additional lease has been created. Certain of the Companys operating leases contain clauses that provide for contingent rent based on a percentage of sales greater than certain specified target amounts. Variable lease payments that do not depend on a rate or index, escalation in the index subsequent to the initial measurement, payments associated with non-lease components such as common area maintenance, real estate taxes and insurance, and short-term lease payments (leases with a term with 12 months or less) are expensed as incurred or when the achievement of the specified target that triggers the contingent rent is considered probable. The Company has four subleases in which the sublessee generally pays the master landlord directly. We disclose details of sublease income and its impact on operating lease expense in Note 6.\nDeferred Liabilities - Deferred Liabilities consist primarily of long-term deferred income in the form of sale leaseback transactions and vendor signing incentives.\nRevenue Recognition - Revenues consist primarily of sales from restaurant operations and franchise revenue, which includes franchisee royalties and contributions to advertising funds. Revenues associated with gift card breakage are immaterial to our financials. The Company recognizes revenue, pursuant to ASU 2014-09, Revenue from Contracts with Customers (Topic 606), when it satisfies a performance obligation by transferring control over a product or service to a customer, typically a restaurant customer or a franchisee/licensee.\nThe Company recognizes revenues in the form of restaurant sales at the time of the sale when payment is made by the customer, as the Company has completed its performance obligation, namely the provision of food and beverage, and the accompanying customer service, during the customers visit to the restaurant. The Company sells gift cards to customers and recognizes revenue from the gift card when it is redeemed and the performance obligation is completed, primarily in the form of restaurant revenue. Gift card breakage, which is recognized when the likelihood of a gift card being redeemed is remote, is determined based upon the Companys historic redemption patterns, and is immaterial to our overall financial statements.\nRevenues we receive from our franchise and license agreements include sales-based royalties, and from our franchise agreements also may include advertising fund contributions, area development fees, and franchisee fees. We recognize sales-based royalties from franchisees and licensees as the underlying sales occur. We similarly recognize advertising fund contributions from franchisees as the underlying sales occur. The Company also provides its franchisees with services associated with opening new restaurants and operating them under franchise and development agreements in exchange for area development and franchise fees. The Company would capitalize these fees upon receipt from the franchisee and then would amortize those over the contracted franchise term as the services comprising the performance obligations are satisfied. We have not received material development or franchise fees in the years presented, and the primary performance obligations under existing franchise and development agreements have been satisfied prior to the earliest period presented in our financial statements.\nPreopening Costs - Restaurant preopening costs are expensed as incurred.\nIncome Taxes - We account for income taxes using the liability method, whereby deferred tax asset and liability account balances are determined based on differences between the financial reporting and tax bases of assets and liabilities and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. The Company provides a valuation allowance, if necessary, to reduce deferred tax assets to their estimated realizable value. The deferred tax assets are reviewed periodically for recoverability and valuation allowances are adjusted as necessary.\nThe Company has significant net operating loss carryforwards from prior years and incurred additional net operating losses during the fiscal year ended September 27, 2022. Full valuation allowances were made to reduce any deferred tax assets incurred to zero; therefore, no income tax provision or benefit was recognized for the fiscal years ended September 27, 2022 and September 28, 2021 resulting in an effective income tax rate of 0% for both periods.\nThe Company is subject to taxation in various jurisdictions within the U.S. The Company continues to remain subject to examination by U.S. federal authorities for the years 2019 through 2022. The Company believes that its income tax filing positions and deductions will be sustained on audit and does not anticipate any adjustments that will result in a material adverse effect on the Companys financial condition, results of operations, or cash flows. Therefore, no reserves for uncertain income tax positions have been recorded. The Companys practice is to recognize interest and/or penalties related to income tax matters in income tax expense. No accrual for interest and penalties was considered necessary as of September 27, 2022.\nNet Income (Loss) Per Common Share - Our basic earnings per share calculation is computed based on the weighted-average number of common shares outstanding. Our diluted earnings per share calculation is computed based on the weighted-average number of common shares outstanding adjusted by the number of additional shares that would have been outstanding had the potentially dilutive common shares been issued. Potentially dilutive securities for this calculation consist of in-the-money outstanding stock options, restricted stock units and warrants (which were assumed to have been exercised at the average market price of the common shares during the reporting period). The treasury stock method is used to measure the dilutive impact of in-the-money stock options.\nThe following table reconciles basic weighted-average shares outstanding to diluted weighted-average shares outstanding:\nSeptember 27,\nSeptember 28,\nWeighted-average shares outstanding basic 12,464,408 12,677,652\nEffect of potentially dilutive securities:\nStock options -\n88,576\nRestricted stock units -\n61,952\nWeighted-average shares outstanding diluted 12,464,408 12,828,180\nExcluded from diluted weighted-average shares outstanding:\nAntidilutive 237,128 75,641\nFinancial Instruments and Concentrations of Credit Risk - Credit risk represents the accounting loss that would be recognized at the reporting date if counterparties failed completely to perform as contracted. Concentrations of credit risk (whether on- or off-balance sheet) that arise from financial instruments exist for groups of customers or counterparties when they have similar economic characteristics that would cause their ability to meet contractual obligations to be similarly affected by changes in economic or other conditions. Financial instruments with off-balance-sheet risk to the Company include lease liabilities whereby the Company is contingently liable as a guarantor of certain leases that were assigned to third parties in connection with various sales of restaurants to franchisees.\nFinancial instruments potentially subjecting the Company to concentrations of credit risk consist principally of receivables. At September 27, 2022 and September 28, 2021, notes receivable totaled $0 and $13,000 respectively. Additionally, the Company has other current receivables totaling $694,000 as of September 27, 2022. This includes $104,000 of franchise receivables, $229,000 of 3rd party delivery receivables, $127,000 of rebate receivables from our food and beverage vendors, and $234,000 of other miscellaneous receivables.\nThe Company purchases most of its restaurant food and paper through a single distribution company. The Company believes a sufficient number of other distributors exist from which food and paper could be purchased to prevent any long-term, adverse consequences.\nThe Company operates in two industry segments, quick service restaurants and casual dining restaurants. A geographic concentration exists because the Companys customers are generally located in Colorado and the Southeast region of the U.S., most significantly in North Carolina.\nStock-Based Compensation - Stock-based compensation is measured at the grant date, based on the calculated fair value of the award, and is recognized as an expense over the requisite service period (generally the vesting period of the grant). See Note 8 for additional information.\nVariable Interest Entities - Once an entity is determined to be a variable interest entity (VIE), the party with the controlling financial interest, the primary beneficiary, is required to consolidate it. The Company previously had three franchisees with notes payable to the Company. These franchisees were VIEs; however, the owners of the franchise operations are the primary beneficiaries of the entities, not the Company. Therefore, they are not required to be consolidated. We no longer have notes receivables from any of our franchisees.\nFair Value of Financial Instruments -Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Valuation techniques used to measure fair value maximize the use of observable inputs and minimize the use of unobservable inputs.\nThe following three levels of inputs may be used to measure fair value and require that the assets or liabilities carried at fair value are disclosed by the input level under which they were valued.\nLevel 1:\nQuoted market prices in active markets for identical assets and liabilities.\nLevel 2:\nObservable inputs other than defined in Level 1, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3:\nUnobservable inputs that are not corroborated by observable market data.\nNon-controlling Interests - The equity interests of unrelated limited partners and members are shown on the accompanying consolidated balance sheets in the shareholders equity section as non-controlling interests and are adjusted each period to reflect the limited partners and members share of the net income or loss as well as any cash distributions or contributions to the limited partners and members for the period. The limited partners and members share of the net income or loss in the partnership is shown as non-controlling interest income or expense in the accompanying consolidated statements of operations. All inter-company accounts and transactions are eliminated.\nOur non-controlling interests currently consist of one joint venture partnership involving six Good Times restaurants and five joint venture partnerships involving five Bad Daddys restaurants.\nRecent Accounting Pronouncements - In the fiscal year ended September 27, 2022 the Company adopted ASU No. 2019-12, Simplifying the Accounting for Income Taxes, which removes certain exceptions for recognizing deferred taxes for investments, performing intra-period allocation and calculating income taxes in interim periods. The ASU also adds guidance to reduce complexity in certain areas, including recognizing deferred taxes for tax goodwill and allocating taxes to members of a consolidated group. The adoption of this guidance did not have a material impact on our Consolidated Financial Statements.\nThe company has adopted Accounting Standards Update (ASU) No. 2015-17, Income Tax (Topic 740): Balance Sheet Classification of Deferred Taxes, which requires that all deferred tax assets and liabilities, along with any related valuation allowance, be classified as noncurrent on the balance sheet. The Company will apply this ASU retrospectively to all periods presented.\nThe Company reviewed all other recently issued accounting pronouncements and concluded that they were either not applicable or not expected to have a significant impact on the Companys consolidated financial statements.\n2. Goodwill and Intangible Assets:\nThe following table presents goodwill and intangible assets as of September 27, 2022 and September 28, 2021 (in thousands):\nSeptember 27, 2022 September 28, 2021\nGross\nCarrying\nAmount Accumulated\nAmortization Net\nCarrying\nAmount Gross\nCarrying\nAmount Accumulated\nAmortization Net\nCarrying\nAmount\nIntangible assets subject to amortization:\nNon-compete agreements $ 25 $ (5 ) $ 20 $ 50 $ (46 ) $ 4\n$ 25 $ (5 ) $ 20 $ 50 $ (46 ) $ 4\nIndefinite-lived intangible assets:\nTrademarks $ 3,900 $ -\n$ 3,900 $ 3,900 $ -\n$ 3,900\nIntangible assets, net $ 3,925 $ (5 ) $ 3,920 $ 3,950 $ (46 ) $ 3,904\nGoodwill $ 5,713 $ -\n$ 5,713 $ 5,150 $ -\n$ 5,150\nAs previously discussed in Note 1, the Company recorded a $10,000,000 impairment to goodwill in the second fiscal quarter of 2020 related to goodwill attributable to its Bad Daddys reporting unit.\nThere were no impairments to intangible assets during the fiscal year ended September 27, 2022. The aggregate amortization expense related to these intangible assets subject to amortization was $5,000 for the fiscal year ended September 27, 2022.\n3. Notes Payable and Long-Term Debt:\nCadence Credit Facility\nThe Company maintains a credit agreement with Cadence Bank (Cadence) pursuant to which, as amended, Cadence has agreed to loan the Company up to $8,000,000 with a maturity date of January 31, 2023 (as amended, the Cadence Credit Facility). As amended by the various amendments, the Cadence Credit Facility accrues commitment fees on the daily unused balance of the facility at a rate of 0.25%. As of September 27, 2022, any borrowings under the Cadence Credit Facility, as amended, bear interest at a variable rate based upon the Companys election of (i) 2.5% plus the base rate, which is the highest of the (a) Federal Funds Rate plus 0.5%, (b) the Cadence Bank publicly announced prime rate, and (c) LIBOR plus 1.0%, or (ii) LIBOR, with a 0.250% floor, plus 3.5%. Interest is due at the end of each calendar quarter if the Company elects to pay interest based on the base rate and at the end of each LIBOR period if it elects to pay interest based on LIBOR. The Cadence Credit Facility includes provisions for the Administrative Agent of the facility to amend the facility to replace LIBOR with an alternate benchmark rate, which may be (but is not required to be) SOFR, at such point in time when appliable LIBOR rates are no longer available or no longer reliable. The exact timing of any transition of LIBOR to an alternate benchmark rate is not currently known. The Company is currently reviewing its future credit facility needs and intends to complete any potential transaction prior to January 31, 2023.\nAs of September 27, 2022, the Cadence Credit Facility contains certain affirmative and negative covenants and events of default that the Company considers customary for an agreement of this type, including financial covenants setting a maximum leverage ratio of 5.15:1, a minimum pre-distribution fixed charge coverage ratio of 1.25:1, a minimum post-distribution fixed charge coverage ratio of 1.10:1 and minimum liquidity of $2.0 million. As of September 27, 2022, the Company was in compliance with all of these financial covenants under the Cadence Credit Facility.\nAs a result of entering into the Cadence Credit Facility and the various amendments, the Company paid loan origination costs including professional fees of approximately $308,500 and is amortizing these costs over the term of the credit agreement. As of September 27, 2022 the unamortized balance of these fees is $20,000\nThe obligations under the Cadence Credit Facility are collateralized by a first-priority lien on substantially all of the Companys assets.\nAs of September 27, 2022, there were no outstanding borrowings against the facility. Availability of the Cadence Credit Facility for borrowings is reduced by the outstanding face value of any letters of credit issued under the facility. As of September 27, 2022, there were no outstanding letters of credit issued under the facility.\nIn May 2020, Good Times and three of its wholly-owned subsidiaries, BDI, Drive Thru, and BDC (each a Borrower), entered into unsecured loans in the aggregate principal amount of $11,645,000 (the Loans) with Cadence Bank, N.A. (the Lender) pursuant to the Paycheck Protection Program.\nIn June 2021, the SBA approved forgiveness in full of the Loans, including accrued interest, in the aggregate amount of $11,778,226, which was recognized as gain on debt extinguishment in the fiscal year ended September 28, 2021. The principal and accrued interest balance on each of these Loans is now zero, as of the forgiveness date specific to each of the Companys and its subsidiaries Loans.\nTotal interest expense on notes payable was $20,000 and $269,000 for the fiscal years ended September 27, 2022 and September 28, 2021, respectively.\nPaycheck Protection Program Loans\nIn May 2020, Good Times and three of its wholly-owned subsidiaries, BDI, Drive Thru, and BDC (each a Borrower), entered into unsecured loans in the aggregate principal amount of $11,645,000 (the Loans) with Cadence Bank, N.A. (the Lender) pursuant to the PPP.\nIn June 2021, the SBA approved forgiveness in full of the Companys Loan as well as the Loans of the Companys subsidiaries, including accrued interest, in the aggregate amount of $11,778,226, which was recognized as gain on debt extinguishment in the fiscal year ended September 28, 2021. The principal and accrued interest balance on each of these Loans is now zero, as of the forgiveness date specific to each of the Companys and its subsidiaries Loans.\nTotal interest expense was $54,000 and $269,000 for the fiscal years ended September 27, 2022 and September 28, 2021, respectively.\n4. Other Accrued Liabilities:\nOther accrued liabilities consist of the following (in thousands):\nSeptember 27, 2022 September 28, 2021\nWages and other employee benefits $ 2,773 $ 3,282\nTaxes, other than income tax 1,181 1,334\nGift card liability, net of breakage\nGeneral expense accrual and other 1,866 1,403\nTotal $ 6,805 $ 6,394\n5. Commitments and Contingencies:\nAs of September 27, 2022, the Company had approximately $204,000 in outstanding commitments related to the manufacturing and installation of new signage related to certain existing Good Times restaurants.\nThere may be various claims in process, matters in litigation, and other contingencies brought against the company by employees, vendors, customers, franchisees, or other parties. Evaluating these contingencies is a complex process that may involve substantial judgment on the potential outcome of such matters, and the ultimate outcome of such contingencies may differ from our current analysis. We regularly review the adequacy of accruals and disclosures related to such contingent liabilities in consultation with legal counsel. While it is not possible to predict the outcome of these claims with certainty, it is managements opinion that any reasonably possible losses associated with such contingencies would be immaterial to our financial statements.\nThe Company is the defendant in a lawsuit styled as White Winston Select Asset Funds, LLC and GT Acquisition Group, Inc. v. Good Times Restaurants, Inc., arising from the failed negotiations between plaintiffs and the Company for the sale of the Good Times Drive Thru subsidiary to plaintiffs. The lawsuit was initially filed on September 24, 2019 in Delaware Chancery Court, and Company removed the case to federal court in the US District Court for the District of Delaware on November 5, 2019. On July 30, 2021, the plaintiffs moved the Court for leave to amend their complaint and add new causes of action and a claim for $18 million in damages. On April 11, 2022, the Court heard the parties respective motions for summary judgment on the plaintiffs claims. The Court verbally ruled that it was dismissing all of the plaintiffs claims except for their claim for breach of an express and implied obligation to negotiate in good faith under the parties letter of intent. On May 5, 2022, the Court issued a written order confirming this ruling. On May 25, 2022, the Court issued an order that the plaintiffs are only entitled to reliance damages should they prevail on their claim for breaches of the express and implied obligations to negotiate in good faith. The parties conducted a bench trial on the plaintiffs claims. The parties concluded post-judgment briefing on October 24, 2022. The Courts judgment on the plaintiffs claims is forthcoming.\nWhile the Courts rulings have significantly limited plaintiffs opportunity for recovery in the case, in light of the ruling and the Courts order, the inherent uncertainties of trial and the Companys posture in respect of settlement, among other things, the Company has determined that some loss in respect of the lawsuit is probable and accordingly recorded an accrual in the amount of $332,000 during the quarter ended March 28, 2022 of the current fiscal year. This amount represents the Companys best estimate of the likely amount of plaintiffs damage recovery assuming a finding of liability in their favor at trial and their ability to satisfy the legal standard for proving damages in such amount, based upon the Companys retained expert and a report he made in response to the plaintiffs claims for damages. The accrual is an estimate and is based on current information, the judgment of management and advice of counsel. The Company will continue to evaluate this matter based on new information as it becomes available. The outcome of the case could result in losses less than or in excess of amounts accrued. Any additional liability in excess of the accrual could have a material impact on the Companys results of operations, liquidity or financial condition for the annual or interim period during which any such additional liability is accrued. The Company will continue to vigorously pursue a full defense of this matter on the merits.\n6. Leases:\nThe Companys office space and the land and buildings related to the Drive Thru and Bad Daddys restaurant facilities are classified as operating leases and expire at various dates over the next 16 years. Some leases contain escalation clauses over the lives of the leases. Most of the leases contain one to three five-year renewal options at the end of the initial term. Certain leases include provisions for additional contingent rent payments if sales volumes exceed specified levels. The Company paid 136,000 and $71,000 in contingent rentals for the fiscal years ended September 27, 2022 and September 28, 2021, respectively.\nThe Company determines if a contract contains a lease at inception. The Company's material long-term operating lease agreements are for the land and buildings for our restaurants as well as our corporate office. The initial lease terms for our restaurants range from 10 years to 20 years, most of which at lease inception included renewal options of 10 to 15 years. The lease term is generally the minimum of the noncancelable period or the lease term including renewal options which are reasonably certain of being exercised up to a term of approximately 20 years.\nSome of the leases provide for base rent, plus additional rent based on gross sales, as defined in each lease agreement. The Company is also generally obligated to pay certain real estate taxes, insurance and common area maintenance charges, and various other expenses related to properties, which are expensed as incurred.\nComponents of operating lease costs in the consolidated statements of operations for the fiscal years ended September 27, 2022 and September 28, 2021 are as follows (in thousands):\nClassification Fiscal 2022 Fiscal 2021\nOperating lease cost Occupancy, Other restaurant operating costs, preopening costs and General and administrative expenses, net $ 7,328 $ 6,982\nVariable lease cost Occupancy\nSublease income Occupancy (536 ) (535 )\nTotal lease expense\n$ 6,928 $ 6,518\nComponents of lease assets and liabilities on the consolidated balance sheets as of September 27, 2022 and September 28, 2021 are as follows (in thousands):\nClassification September 27,\nSeptember 28,\nRight-of-use assets Operating lease assets $ 42,463 $ 45,737\nCurrent lease liabilities Operating lease liability $ 5,430 $ 4,935\nNon-current lease liabilities Operating lease liability, less current portion 45,544 49,723\nTotal lease liabilities\n$ 50,974 $ 54,658\nSupplemental cash flow disclosures for the fiscal years ended September 27, 2022 and September 28, 2021 (in thousands):\nFiscal 2022 Fiscal 2021\nCash paid for operating lease liabilities $ 7,235 $ 7,028\nNon-cash operating lease assets obtained in exchange for operating lease liabilities $ 571 $ 324\nWeighted average lease term and discount rate are as follows:\nSeptember 27,\nSeptember 28,\nWeighted average remaining lease term (in years) 8.6 9.5\nWeighted average discount rate 5.0 % 5.0 %\nFuture minimum rent payments for our operating leases for each of the next five years as of September 27, 2022 are as follows (in thousands):\nFiscal year ending: Total\n7,848\n7,748\n7,830\n7,269\n6,917\nThereafter 25,642\nTotal minimum lease payments 63,253\nLess: imputed interest (12,280 )\nPresent value of lease liabilities $ 50,974\nThe above future minimum rental amounts exclude the amortization of deferred lease incentives, renewal options that are not reasonably assured of renewal, and contingent rent. The Company generally has escalating rents over the term of the leases and records rent expense on a straight-line basis.\n7. Income Taxes:\nDeferred tax assets (liabilities) are comprised of the following at the period end (in thousands):\nSeptember 27, 2022\nLong Term September 28, 2021\nLong Term\nDeferred income tax assets (liabilities):\nTax effect of net operating loss carry-forward $ 3,942 $ 4,061\nGeneral business credits 5,225 4,353\nDeferred revenue\nIntangibles basis differences\nLong-term lease liability 11,113 11,782\nOther future benefits\nDeferred tax assets 21,394 20,944\nLess valuation allowance (10,535 ) (9,371 )\nDeferred tax assets, net of valuation allowance 10,859 11,573\nPartnership/joint venture basis differences (30 ) (5 )\nProperty and Equipment basis differences (1,424 ) (1,764 )\nROU asset (9,225 ) (9,804 )\nOther future expense (180 ) -\nDeferred tax liabilities (10,859 ) (11,573 )\nNet deferred tax asset (liabilities) $ -\n$ -\nThe Company has net operating loss carry-forwards available for future periods, as discussed below, of approximately $11,840,000 from 2019, $2,554,000 from 2018, and $1,686,000 from 2017 and prior for income tax purposes. The net operating loss carry-forwards from periods prior to 2019 expire between 2025 and 2038. Based on the change in control, which occurred in 2011, the utilization of the loss carry-forwards incurred for periods prior to 2017 is limited to approximately $727,000 per year. The Company has general business tax credits of $5,225,000 from 2014 through 2022 which expire from 2034 through 2041.\nThe Company continually reviews the realizability of its deferred tax assets, including an analysis of factors such as future taxable income, reversal of existing taxable temporary differences, and tax planning strategies. The Company assessed whether a valuation allowance should be recorded against its deferred tax assets based on consideration of all available evidence using a \"more likely than not\" standard. In assessing the need for a valuation allowance, the company considered both positive and negative evidence related to the likelihood of realization of deferred tax assets. In making such assessment, more weight was given to evidence that could be objectively verified, including recent cumulative losses. Future sources of taxable income were also considered in determining the amount of the recorded valuation allowance. Based on the Company's review of this evidence, management determined that a full valuation allowance against all of the Company's deferred tax assets was appropriate.\nThe following table summarizes the components of the provision for income taxes (in thousands):\nFiscal 2022 Fiscal 2021\nCurrent income tax expense (benefit) $ (5 ) $ 6\nDeferred income tax expense (benefit) -\n-\nTotal income tax expense (benefit) $ (5 ) $ 6\nTotal income tax expense for the years ended September 28, 2021 and September 29, 2020 differed from the amounts computed by applying the U.S. Federal statutory tax rate to pre-tax income as follows (in thousands):\nFiscal 2022 Fiscal 2021\nTotal expense (benefit) computed by applying statutory federal rate $ (556 ) $ 3,527\nState income tax, net of federal tax benefit (56 )\nFICA/WOTC tax credits (694 ) (587 )\nEffect of change in tax law - (2,875 )\nEffect of change in valuation allowance 1,164 1,967\nPermanent differences (2,338 )\nOther\nProvision for income taxes $ (5 ) $ 6\n8. Shareholders Equity:\nPreferred Stock\nThe Company has the authority to issue 5,000,000 shares of preferred stock. The Board of Directors has the authority to issue such preferred shares in series and determine the rights and preferences of the shares as may be determined by the Board of Directors.\nCommon Stock\nThe Company has the authority to issue 50,000,000 shares of common stock with a par value of $.001. As of September 27, 2022 and September 28, 2021 there were 12,274,351 and 12,512,072 shares outstanding, respectively.\nStock Plans\nThe Company has traditionally maintained incentive compensation plans that include provision for the issuance of equity-based awards. The Company established the 2008 Omnibus Equity Incentive Compensation Plan in 2008 (the 2008 Plan) and has outstanding awards that were issued under the 2008 Plan. Subsequently, the 2008 Plan expired in 2018 and the Company established a new plan, the 2018 Omnibus Equity Incentive Plan (the 2018 Plan) during the third fiscal quarter of 2018, pursuant to shareholder approval. Future awards will be issued under the 2018 plan.\nStock-based compensation is measured at the grant date, based on the calculated fair value of the award, and is recognized as an expense over the requisite service period (generally the vesting period of the grant). The Company recognizes the impact of forfeitures as forfeitures occur.\nThe Company recorded $250,000 and $362,000 in total stock option and restricted stock compensation expense during the fiscal years ended September 27, 2022 and September 28, 2021, respectively, that was classified as general and administrative costs.\nStock Option Awards\nThe Company measures the compensation cost associated with stock option awards by estimating the fair value of the award as of the grant date using the Black-Scholes pricing model. The Company believes that the valuation technique and the approach utilized to develop the underlying assumptions are appropriate in calculating the fair values of the Companys stock options and stock awards granted during the fiscal years ended September 27, 2022 and September 28, 2021. Estimates of fair value are not intended to predict actual future events or the value ultimately realized by the employees who receive equity awards.\nDuring the fiscal year ended September 27, 2022, the Company granted inducement equity awards to Mr. Karnes, in connection with his appointment as the Senior Vice President of Finance, in the form of (a) a stock option to purchase 25,000 shares of the Companys common stock granted on Mr. Karnes first day of employment (the Initial Options); and (b) an additional stock option to purchase 25,000 shares of common stock to be granted on the one year anniversary date of Mr. Karnes employment (the Additional Options, and, together with the Initial Options, the Options). The Options were granted outside of the Companys 2018 Omnibus Equity Incentive Plan as an inducement material to Mr. Karnes acceptance of employment with the Company. The Initial Options have a ten-year term, vest 1/3 each year over a three-year vesting period, subject to Mr. Karnes continuous employment with the Company, and will have an exercise price equal to the Companys closing market price on the day of grant. The Additional Options will have a ten-year term, an exercise price equal to the greater of market price on the date of grant or $5.00 and will vest upon the achievement the Companys common stock reaching a market price of $7.50 per share, calculated based upon a trailing 60-day volume weighted average price.\nOn September 30, 2021, Mr. Zink was granted 80,000 Incentive Stock Options on September 29, 2021. The shares awarded include a vesting condition whereby the vesting shall occur on the date on which the price of the Companys common stock (as traded on the Nasdaq Capital Market) is $6, as measured based on the trailing 60-day calendar day volume-weighted average price (VWAP) of Company common stock.\nIn addition to the exercise and grant date prices of the stock option awards, certain weighted average assumptions that were used to estimate the fair value of stock option grants are listed in the following table:\nIncentive and Non-Statutory Stock Options\nFiscal 2022\nExpected term (years) 4.5 - 6.5\nExpected volatility 61.25% - 61.31%\nRisk-free interest rate 0.90% - 1.76%\nExpected dividends -\nWe estimate expected volatility based on historical weekly price changes of our common stock for a period equal to the current expected term of the options. The risk-free interest rate is based on the United States treasury yields in effect at the time of grant corresponding with the expected term of the options. The expected option term is the number of years we estimate that options will be outstanding prior to exercise considering vesting schedules and our historical exercise patterns.\nThe following table summarizes stock option activity for the fiscal year ended September 27, 2022 under all plans:\nShares Weighted\nAverage\nExercise Price Weighted Average\nRemaining\nContractual Life (Yrs.)\nOutstanding at beginning of year 443,815 $ 3.63\nOptions granted 105,000 $ 4.90\nOptions exercised (56,104 ) $ 2.76\nForfeited (22,550 ) $ 4.52\nExpired -\n-\nOutstanding Sept 27, 2022 470,161 $ 3.97 5.8\nExercisable Sept 27, 2022 324,044 $ 3.61 5.0\nAs of September 27, 2022 and September 28, 2021, the aggregate intrinsic value of the outstanding and exercisable options was $459,277 and $634,000, respectively. Only options whose exercise price is below the current market price of the underlying stock are included in the intrinsic value calculation.\nAs of September 27, 2022, the total remaining unrecognized compensation cost related to non-vested stock options was $200,000 and is expected to be recognized over a weighted average period of approximately 1.9 years.\nThere were 56,104 stock options exercised during the fiscal year ended September 27, 2022 with proceeds of approximately $156,000.\nThere were 187,291 stock options exercised during the fiscal year ended September 28, 2021 with proceeds of approximately $440,000.\nCommon Stock and Performance Share Grants\nDuring the fiscal year ended September 27, 2022, the Company granted its directors a discretionary grant of common stock totaling 9,256 shares. These shares had a grant date fair value of $4.35 per share which is equal to the closing price of the stock on the date of grant and resulted in the recognition of $40,000 of stock-based compensation expense.\nDuring the fiscal year ended September 28, 2021, the Company granted its directors 12,948 shares of common stock and its Chief Executive Officer 10,000 performance shares from available shares under its 2018 Plan. The shares were issued with a grant date fair market value of $2.78 and $2.77, respectively, which is equal to the closing price of the stock on the date of grants. The performance shares granted to the Chief Executive Officer became fully vested on April 6, 2021 pursuant to the vesting provisions set forth in the grant notice.\nRestricted Stock Units\nThere were 28,000 restricted stock units granted during the fiscal year ended September 27, 2022. No restricted stock units were granted during the fiscal year ended September 28, 2021.\nA summary of the status of non-vested restricted stock units as of September 27, 2022 is presented below.\nShares Grant Date Fair\nValue Per Share\nNon-vested shares at beginning of year 61,952 $1.54 to $3.95\nGranted 28,000 $4.50\nExercised (15,616 ) $3.95\nForfeited (1,000 ) $4.50\nNon-vested shares at September 27, 2022 73,336 $1.54 to $4.50\nAs of September 27, 2022, there was $100,000 of total unrecognized compensation cost related to non-vested restricted stock units. This cost is expected to be recognized over a weighted average period of approximately 2.3 years.\nNon-controlling Interests\nNon-controlling interests are presented as a separate item in the shareholders equity section of the consolidated balance sheets. The amount of consolidated net income or loss attributable to non-controlling interests is presented on the face of the consolidated statements of operations. Changes in a parents ownership interest in a subsidiary that do not result in deconsolidation are equity transactions, while changes in ownership interest that do result in deconsolidation of a subsidiary require gain or loss recognition based on the fair value on the deconsolidation date.\nThe equity interests of the unrelated limited partners and members are shown on the accompanying consolidated balance sheets in the shareholders equity section as a non-controlling interest and is adjusted each period to reflect the limited partners and members share of the net income or loss as well as any cash contributions or distributions to or from the limited partners and members for the period. The limited partners and members share of the net income or loss in the subsidiary is shown as non-controlling interest income or expense in the accompanying consolidated statements of operations. All inter-company accounts and transactions are eliminated.\nThe following table summarizes the activity in non-controlling interests during the year ended September 27, 2022 (in thousands):\nBad Daddys Good Times Total\nBalance at September 28, 2021 $ 915 $ 209 $ 1,124\nIncome attributable to non-controlling interests $ 1,186 $ 528 $ 1,714\nContributions from unrelated limited partners $ 33 -\n$ 33\nDistributions to unrelated limited partners $ (1,093 ) $ (475 ) $ (1,568 )\nBalance at September 27, 2022 $ 1,041 $ 263 1,303\nOur non-controlling interests consist of one joint venture partnership involving Good Times restaurants and five joint venture partnerships involving five Bad Daddys restaurants.\n9. Retirement Plan:\nThe Company sponsors a qualified defined contribution 401(k) plan for employees meeting certain eligibility requirements. Under the plan, employees are entitled to make contributions on both a pre-tax basis or after-tax basis (Roth Contributions). In fiscal 2015 the Company modified the plan to include a provision to make a Safe Harbor Matching Contribution to all participating employees. The Company will match, on a dollar-for-dollar basis, the first 3% of eligible pay contributed by employees. The Company will also match 50% of each dollar contributed between 3% and 5% of eligible pay contributed by employees. The Company may, at its discretion, make additional contributions to the Plan or change the matching percentage. The Companys matching contribution expense in the fiscal years ended September 27, 2022 and September 28, 2021 was $207,000 and $216,000, respectively. The matching contribution has historically been contributed to the plan in the fiscal year following the year in which the expense is recognized. During the current year, the Company changed the method in which the matching contribution is made, such that the match is made at the same time employee contributions are made, with a true-up contribution made in the fiscal year following the year in which any respective expense would be recognized.\n10. Segment Reporting:\nAll of our Good Times Burgers and Frozen Custard restaurants (Good Times) compete in the quick-service drive-thru dining industry while our Bad Daddys Burger Bar restaurants (Bad Daddys) compete in the full-service upscale casual dining industry. We believe that providing this additional financial information for each of our brands will provide a better understanding of our overall operating results. Income (loss) from operations represents revenues less restaurant operating costs and expenses, directly allocable general and administrative expenses, and other restaurant-level expenses directly associated with each brand including depreciation and amortization, pre-opening costs and losses or gains on disposal of property and equipment. Unallocated corporate capital expenditures are presented below as reconciling items to the amounts presented in the consolidated financial statements.\nThe following tables present information about our reportable segments for the respective periods (in thousands):\nFiscal Year\nRevenues\nBad Daddys $ 103,502 $ 88,844\nGood Times 34,698 35,109\nTotal $ 138,200 $ 123,953\nIncome (loss) from operations\nBad Daddys $ (811 ) $ 3,274\nGood Times (67 ) 3,623\nTotal $ (878 ) $ 6,897\nCapital Expenditures\nBad Daddys $ 1,909 $ 2,867\nGood Times\nTotal $ 2,678 $ 3,198\nProperty & Equipment, net\nBad Daddys $ 19,575 $ 23,747\nGood Times 2,676 3,480\nTotal $ 22,251 $ 27,227\n11. Subsequent Events:\nNone.\nfalse FY Good Times Restaurants Inc.\n2021-09-29 2022-09-27\n2022-03-31\n2022-12-09\n2022-09-27\n2021-09-28\ngtim:RestaurantSalesMember\n2021-09-29 2022-09-27\ngtim:RestaurantSalesMember\n2020-09-29 2021-09-28\ngtim:FranchiseRevenuesMember\n2021-09-29 2022-09-27\ngtim:FranchiseRevenuesMember\n2020-09-29 2021-09-28\n2020-09-29 2021-09-28\nus-gaap:TreasuryStockMember\n2020-09-28\nus-gaap:CommonStockMember\n2020-09-28\nus-gaap:AdditionalPaidInCapitalMember\n2020-09-28\nus-gaap:NoncontrollingInterestMember\n2020-09-28\nus-gaap:RetainedEarningsMember\n2020-09-28\n2020-09-28\nus-gaap:TreasuryStockMember\n2020-09-29 2021-09-28\nus-gaap:CommonStockMember\n2020-09-29 2021-09-28\nus-gaap:AdditionalPaidInCapitalMember\n2020-09-29 2021-09-28\nus-gaap:NoncontrollingInterestMember\n2020-09-29 2021-09-28\nus-gaap:RetainedEarningsMember\n2020-09-29 2021-09-28\nus-gaap:TreasuryStockMember\n2021-09-28\nus-gaap:CommonStockMember\n2021-09-28\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-28\nus-gaap:NoncontrollingInterestMember\n2021-09-28\nus-gaap:RetainedEarningsMember\n2021-09-28\nus-gaap:TreasuryStockMember\n2021-09-29 2022-09-27\nus-gaap:CommonStockMember\n2021-09-29 2022-09-27\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-29 2022-09-27\nus-gaap:NoncontrollingInterestMember\n2021-09-29 2022-09-27\nus-gaap:RetainedEarningsMember\n2021-09-29 2022-09-27\nus-gaap:TreasuryStockMember\n2022-09-27\nus-gaap:CommonStockMember\n2022-09-27\nus-gaap:AdditionalPaidInCapitalMember\n2022-09-27\nus-gaap:NoncontrollingInterestMember\n2022-09-27\nus-gaap:RetainedEarningsMember\n2022-09-27\nus-gaap:CommonStockMember\n2022-02-01 2022-02-07\n2021-08-13\n2021-09-01 2021-09-10\ngtim:FourOfBadDaddysLimitedLiabilityCompaniesMember\n2022-09-27\nsrt:MinimumMember gtim:FourOfBadDaddysLimitedLiabilityCompaniesMember\n2022-09-27\nsrt:MaximumMember gtim:FourOfBadDaddysLimitedLiabilityCompaniesMember\n2022-09-27\ngtim:OneOfBadDaddysLimitedLiabilityCompaniesMember\n2022-09-27\nsrt:MinimumMember\n2021-09-29 2022-09-27\nsrt:MaximumMember\n2021-09-29 2022-09-27\ngtim:BadDaddysInternationalLlcMember\n2022-09-27\ngtim:ThreeGoodTimesRestaurantsMember\n2021-09-29 2022-09-27\ngtim:TwoBadDaddysRestaurantsMember\n2021-09-29 2022-09-27\nus-gaap:DeferredIncomeTaxChargesMember\n2022-09-27\nus-gaap:DeferredIncomeTaxChargesMember\n2021-09-28\ngtim:ThirdPartyDeliveryMember\n2022-09-27\ngtim:GoodTimesMember\n2022-09-27\ngtim:GoodTimesMember\n2021-09-28\ngtim:BadDaddysMember\n2022-09-27\ngtim:BadDaddysMember\n2021-09-28\nus-gaap:NoncompeteAgreementsMember\n2022-09-27\nus-gaap:NoncompeteAgreementsMember\n2021-09-28\nus-gaap:TrademarksMember\n2022-09-27\nus-gaap:TrademarksMember\n2021-09-28\ngtim:CadenceCreditFacilityMember\n2021-09-29 2022-09-27\ngtim:CadenceCreditFacilityMember\n2022-09-27\ngtim:CadenceCreditFacilityMember\n2020-05-31\ngtim:CadenceCreditFacilityMember\n2021-06-01 2021-06-30\ngtim:CadenceCreditFacilityMember\n2021-09-29 2022-09-27\ngtim:CadenceCreditFacilityMember\n2020-09-29 2021-09-28\ngtim:PaycheckProtectionProgramLoansMember\n2020-05-31\ngtim:PaycheckProtectionProgramLoansMember\n2020-06-01 2020-06-30\ngtim:PaycheckProtectionProgramLoansMember\n2021-09-29 2022-09-27\ngtim:PaycheckProtectionProgramLoansMember\n2020-09-29 2021-09-28\n2021-07-01 2021-07-30\ngtim:DriveThruMember gtim:BadDaddysFranchiseDevelopmentLlcMember\n2021-09-29 2022-09-27\nsrt:MinimumMember\n2022-09-27\nsrt:MaximumMember\n2022-09-27\n2019-09-24\n2018-09-25\n2011-09-25\nsrt:MinimumMember\n2018-09-24 2019-09-25\nsrt:MaximumMember\n2018-09-24 2019-09-25\n2012-09-30\n2020-09-28 2021-09-27\n2016-10-01 2017-09-30\n2015-10-01 2016-09-30\n2014-10-01 2015-09-30\n2019-09-28 2020-09-27\n2018-09-28 2019-09-27\n2017-09-28 2018-09-27\ngtim:MrKarnesMember\n2021-09-29 2022-09-27\ngtim:MrZinkMember\n2021-09-30 2021-09-30\ngtim:MrZinkMember\n2021-09-30\nus-gaap:PerformanceSharesMember\n2021-09-29 2022-09-27\nsrt:DirectorMember gtim:Plan2018Member\n2020-09-29 2021-09-28\nsrt:ChiefExecutiveOfficerMember us-gaap:PerformanceSharesMember\n2020-09-29 2021-09-28\nus-gaap:RestrictedStockMember\n2021-09-29 2022-09-27\nus-gaap:RestrictedStockMember\n2022-09-27\nus-gaap:RestrictedStockMember\n2020-09-29 2021-09-28\nsrt:MinimumMember\n2021-09-28\nsrt:MaximumMember\n2021-09-28\ngtim:BadDaddysMember\n2021-09-28\ngtim:GoodTimesMember\n2021-09-28\ngtim:BadDaddysMember\n2021-09-29 2022-09-27\ngtim:GoodTimesMember\n2021-09-29 2022-09-27\ngtim:BadDaddysMember\n2022-09-27\ngtim:GoodTimesMember\n2022-09-27\nsrt:MinimumMember\n2020-09-29 2021-09-28\nsrt:MaximumMember\n2020-09-29 2021-09-28\ngtim:BadDaddysMember\n2021-09-29 2022-09-27\ngtim:BadDaddysMember\n2020-09-29 2021-09-28\ngtim:GoodTimesMember\n2021-09-29 2022-09-27\ngtim:GoodTimesMember\n2020-09-29 2021-09-28\ngtim:BadDaddysMember\n2022-09-27\ngtim:BadDaddysMember\n2021-09-28\ngtim:GoodTimesMember\n2022-09-27\ngtim:GoodTimesMember\n2021-09-28\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}