{
    "cik": "830524",
    "company": "CHASE CORP",
    "filing_type": "10-K",
    "filing_date": "2022-11-10",
    "period_of_report": "2022-08-31",
    "sic": "3640",
    "state_of_inc": "MA",
    "state_location": "MA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/830524/0001558370-22-017454-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/830524/000155837022017454/ccf-20220831x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/830524/0001558370-22-017454.txt",
    "filename": "830524_10K_2022_0001558370-22-017454.htm",
    "content": "Item 1 - Business\nPrimary Operating Divisions and Facilities and Industry Segments\nChase Corporation (the Company, Chase, we, or us), a global specialty chemicals company founded in 1946, is a leading manufacturer of protective materials for high-reliability applications across diverse market sectors. Our strategy is to maximize the performance of our core businesses and brands while seeking future opportunities through strategic acquisitions. Through investments in facilities, systems and organizational consolidation we seek to improve performance and gain economies of scale.\nWe are organized into three reportable operating segments: an Adhesives, Sealants and Additives segment, an Industrial Tapes segment and a Corrosion Protection and Waterproofing segment. The segments are distinguished by the nature of the products manufactured and how they are delivered to their respective markets.\nThe Adhesives, Sealants and Additives segment offers innovative and specialized product offerings consisting of both end-use products and intermediates that are generally used in, or integrated into, another companys product. Demand for the segments product offerings is typically dependent upon general economic conditions. The Adhesives, Sealants and Additives segment leverages the core specialty chemical competencies of the Company and serves diverse markets and applications. The segment sells predominantly into the transportation, appliances, medical, general industrial and environmental market verticals. The segments products include moisture protective coatings and cleaners, and customized sealant and adhesive systems for electronics, polymeric microspheres, polyurethane dispersions and superabsorbent polymers. Beginning September 1, 2020 (the first day of our fiscal year 2021), the Adhesives, Sealants and Additives segment includes the acquired operations of ABchimie, within the electronic and industrial coatings product line and beginning February 5, 2021, the acquired operations of Emerging Technologies, Inc (ETi), within the functional additives product line. Beginning September 1, 2022 (the first day of our fiscal year 2023), this segment will include the acquired operations of NuCera Solutions within the functional additives product line.\nThe Industrial Tapes segment features wire and cable materials, specialty tapes and other laminated and coated products. The segment derives its competitive advantage through its proven chemistries, its diverse specialty offerings and the reliability its supply chain offers to end customers. These products are generally used in the assembly of other manufacturers products, with demand typically dependent upon general economic conditions. The Industrial Tapes segment sells mostly to established markets, with some exposure to growth opportunities through further development of existing products. Markets served include cable manufacturing, utilities and telecommunications, and electronics packaging. The segments offerings include insulating and conducting materials for wire and cable manufacturers, laminated durable papers, laminates for the packaging and industrial laminate markets, custom manufacturing services, pulling and detection tapes used in the installation, measurement and location of fiber optic cables and water and natural gas lines and cover tapes essential to delivering semiconductor components via tape-and-reel packaging.\nThe Corrosion Protection and Waterproofing segment is principally composed of project-oriented product offerings that are primarily sold and used as Chase branded products. End markets include new and existing infrastructure projects on oil, gas, water and wastewater pipelines, highways and bridge decks, water and wastewater containment systems, and commercial buildings. The segments products include protective coatings for pipeline applications, coating and lining systems for waterproofing and liquid storage applications, adhesives and sealants used in architectural and building envelope waterproofing applications, high-performance polymeric asphalt additives, and expansion joint systems for waterproofing applications in transportation and architectural markets. With sales generally dependent on outdoor project work, the segment experiences highly seasonal sales patterns.\nOur manufacturing facilities are distinct to their respective segments apart from our OHara Township, PA, Blawnox, PA and Hickory, NC facilities, which produce products related to a combination of operating segments.\nA summary of our operating structure as of August 31, 2022 is as follows:\nADHESIVES, SEALANTS AND ADDITIVES SEGMENT\nPrimary\nOperating\nKey Products\nLocations\nBackground/History\nProtective conformal coatings under the brand name HumiSeal®, moisture protective electronic coatings sold to the electronics industry including circuitry used in automobiles, industrial controls and home appliances.\nO'Hara Township, PA\nThe HumiSeal business and product lines were acquired in the early 1970s. In the third quarter of 2021, we began relocating the electronic and industrial coatings manufacturing line from our Woburn, MA, location to our OHara Township, PA location. This relocation is expected to be completed in the first quarter of fiscal 2023.\nAdvanced adhesives, sealants, and coatings for automotive and industrial applications that require specialized bonding, encapsulating, environmental protection, or thermal management functionality.\nWoburn, MA\nHickory, NC\nIn September 2016, we acquired certain assets and the operations of Resin Designs, LLC. In the second quarter of 2021, we began relocating the sealants system manufacturing process from our Newark, CA, location to our Hickory, NC location. In the third quarter of 2021, we began relocating the electronic and industrial coatings manufacturing line from our Woburn, MA, location to our OHara Township, PA location. This relocation is expected to be completed in the first quarter of fiscal 2023.\nProtective conformal coatings under the brand name HumiSeal®, moisture protective electronic coatings sold to the electronics industry including circuitry used in automobiles, industrial controls and home appliances.\nWinnersh, Wokingham, England\nParis, France\nPune, India\nIn October 2005, we acquired all of the capital stock of Concoat Holdings Ltd. and its subsidiaries. In 2006, Concoat was renamed HumiSeal Europe.\nIn March 2007, we expanded our international presence with the formation of HumiSeal Europe SARL in France. HumiSeal Europe SARL operates a sales/technical service office and warehouse near Paris, France. This business works closely with the HumiSeal operation in Winnersh, Wokingham, England, allowing direct sales and service to the French market.\nIn June 2016, we further expanded our international presence through the purchase of Spray Products (India) Private Limited, located in Pune, India. This business enhances the Companys ability to provide technical, sales, manufacturing, chemical handling and packaging services in the region and works closely with our HumiSeal manufacturing operation in Winnersh, Wokingham, England. In December 2016, the business was renamed HumiSeal India Private Limited.\nSolutions provider for the cleaning and protection of electronic assemblies under the brand name ABchimie.\nCorbelin, France\nIn September 2020, we acquired all the capital stock of ABchimie.\nPolymeric microspheres, sold under the Dualite® brand, which are utilized for weight and density reduction and sound dampening across varied industries.\nPolyurethane dispersions utilized for various coating products.\nGreenville, SC\nIn January 2015, we acquired two product lines from Henkel Corporation. They, along with the Superabsorbents business acquired in December 2017, comprise our functional additives product line.\nThe Company currently contracts with manufacturing partners to produce its polyurethane dispersions.\nSuperabsorbent polymers, sold through our Zappa Stewart and Emerging Technologies, Inc. divisions, which are utilized for water and liquid management, remediation and protection in diverse markets including wire and cable, medical, environmental, infrastructure, energy and consumer products.\nHickory, NC\nGreensboro, NC\nIn December 2017, we acquired Stewart Superabsorbents, LLC and its Zappa-Tec business (collectively Zappa Stewart).\nIn February 2021, we acquired the assets and operations of Emerging Technologies, Inc. (ETi).\nINDUSTRIAL TAPES SEGMENT\nPrimary\nOperating\nKey Products\nLocations\nBackground/History\nSpecialty tapes and related products for the electronic and telecommunications industries using the brand name Chase & Sons®.\nInsulating and conducting materials for the manufacture of electrical and telephone wire and cable, electrical splicing, and terminating and repair tapes, which are marketed to wire and cable manufacturers selling into energy-oriented and communication markets, and to public utilities.\nPaperTyger®, a trademark for laminated durable papers sold to the envelope converting and commercial printing industries.\nOxford, MA\nIn August 2011, we relocated our manufacturing processes that had been previously conducted at our Webster, MA facility to this location.\nIn December 2012, we relocated the majority of our manufacturing processes that had been previously conducted at our Randolph, MA facility to this location. Our Randolph facility was one of our first operating facilities, and had been producing products for the wire and cable industry for more than fifty years.\nIn the fourth quarter of 2018, we moved the wire and cable material manufacturing process that had been conducted at our Pawtucket, RI facility to our Lenoir, NC and Oxford, MA locations.\nWe acquired the Paper Tyger, LLC assets in 2003.\nChase BLH2OCK®, a water-blocking compound sold to the wire and cable industry.\nBlawnox, PA\nIn September 2012, we relocated our Chase BLH2OCK® manufacturing processes that had been previously conducted at our Randolph, MA facility to this location.\nLaminated film foils for the electronics and cable industries and cover tapes essential to delivering semiconductor components via tape and reel packaging.\nPulling and detection tapes used in the installation, measurement and location of fiber optic cable, and water and natural gas lines.\nLenoir, NC\nSuzhou, China\nHickory, NC\nIn June 2012, we acquired all of the capital stock of NEPTCO Incorporated, which operated facilities in Rhode Island, North Carolina and China.\nIn October 2013, we moved the manufacturing processes that had been conducted at our Taylorsville, NC facility to our Lenoir, NC location.\nIn the fourth quarter of 2018, we moved the wire and cable material manufacturing process that had been conducted at our Pawtucket, RI facility to our Lenoir, NC and Oxford, MA locations.\nIn the third quarter of 2019, we began relocating the pulling and detection tapes manufacturing process from our Granite Falls, NC location to our Hickory, NC location. This relocation was completed in the second quarter of fiscal 2020.\nCORROSION PROTECTION AND WATERPROOFING SEGMENT\nPrimary\nOperating\nKey Products\nLocations\nBackground/History\nProtective pipe-coating tapes and other protectants for valves, regulators, casings, joints, metals, and concrete, which are sold under the brand name Royston®, to oil companies, gas utilities and pipeline companies.\nRosphalt50® is a polymer additive that provides long-term cost-effective solutions in many applications such as waterproofing of bridge decks and approaches, ramps, racetracks, airport runways and taxiways and specialty road applications.\nWaterproofing membranes for highway bridge deck metal-supported surfaces.\nBlawnox, PA\nThe Royston business was acquired in the early 1970s.\nWaterproofing sealants, expansion joints and accessories for the transportation, industrial and architectural markets.\nO'Hara Township, PA\nIn April 2005, we acquired certain assets of E-Poxy Engineered Materials. Additionally, in September 2006, we acquired all of the capital stock of Capital Services Joint Systems. Both of these acquisitions were combined to form the expansion joints business.\nTechnologically advanced products, including the brand Tapecoat®, for demanding anti-corrosion applications in the gas, oil and marine pipeline market segments, as well as tapes and membranes for roofing and other construction-related applications.\nEvanston, IL\nIn November 2001, we acquired substantially all the assets of Tapecoat, previously a division of T.C. Manufacturing Inc.\nSpecialized high-performance coating and lining systems used worldwide in liquid storage and containment applications.\nHouston, TX\nIn September 2009, we acquired all the outstanding capital stock of C.I.M. Industries Inc. (CIM).\nWaterproofing and corrosion protection systems for oil, gas and water pipelines, and a supplier to Europe, the Middle East and Southeast Asia.\nThe ServiWrap® brand pipeline protection tapes and products, which offer long-term corrosion protection for buried pipelines in the most challenging natural environments.\nRye, East Sussex, England\nIn September 2007, we purchased certain product lines and a related manufacturing facility in Rye, East Sussex, England through our wholly-owned subsidiary, Chase Protective Coatings Ltd. This facility joins Chase's North American-based Tapecoat® and Royston® brands to broaden the protective pipeline coatings product line and better address global demand.\nIn December 2009, we acquired the full range of ServiWrap® pipeline protection products (ServiWrap) from Grace Construction Products Limited, a U.K.-based unit of W.R. Grace & Co. ServiWrap products complement our portfolio of pipeline protection tapes, coatings and accessories and extend our global customer base.\nOther Business Developments\nOn September 1, 2022 (the first day of fiscal 2023), the Company completed its acquisition of NuCera Solutions, a recognized global leader in the production and development of highly differentiated specialty polymers and polymerization technologies serving demanding applications, offering products critical to enabling end-product functionality, performance and reliability. The Company acquired all of the capital stock of NuCera for a purchase price of $250,000,000, net of debt, accrued income taxes and cash at closing, and pending any working capital adjustments. Chase will continue to market under the NuCera brands and the business will be integrated into Chases Adhesives, Sealants and Additives reporting unit. See Note 23 to the consolidated financial statements for additional information related to our subsequent event.\nThe Company completed the relocation of its corporate headquarters to another location within Westwood, MA during the fiscal year ending August 31, 2022. The move, part of the Companys ongoing consolidation and optimization initiative, capitalizes on the hybrid work model utilized by many of Chases corporate and administrative employees and is expected to provide future operational cost savings. The new facility also consolidates and houses research and\ndevelopment operations previously conducted at the previous Westwood, MA and Woburn, MA locations. Operations optimization costs related to the Westwood move of $232,000 were expensed in fiscal 2022. No future costs related to the move are anticipated.\nDuring the third quarter of fiscal 2021, Chase announced to the employees at its Woburn, MA location that its adhesives systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, would be consolidating into the Companys existing O'Hara Township, PA location. This rationalization and consolidation initiative aligns with the announcement in the second quarter of fiscal 2021 of the Companys plan to move its sealant systems production from Newark, CA to Hickory, NC, described in more detail below. Chase Corporation obtained both the adhesive and sealants systems as part of its fiscal 2017 acquisition of the operations of Resin Designs. The Company expensed $463,000 and $0 in fiscal 2022 and 2021, related to the move, and future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nDuring the second quarter of fiscal 2021, Chase began moving the sealant systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, from its Newark, CA location to its Hickory, NC facility. This is in line with the Companys ongoing initiative to consolidate its manufacturing plants and streamline its existing processes. The sealant systems operations and Newark, CA location came to Chase Corporation as part of the fiscal 2017 acquisition of the operations of Resin Designs, and the Companys lease there terminated in fiscal 2021. The Company recognized $147,000 in expense related to the move during fiscal year ended August 31, 2022 and $977,000 in the fiscal year ended August 31, 2021. The project is now substantially completed and any future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nProducts and Markets\nOur principal products are specialty tapes, laminates, adhesives, sealants, coatings and chemical intermediates which are sold by our salespeople, manufacturers' representatives and distributors.\nIn our Adhesives, Sealants and Additives segment, these products consist of:\n(i) moisture protective coatings and cleaning solutions, which are sold to the electronics industry for circuitry manufacturing, including circuitry used in automobiles, industrial controls and home appliances;\n(ii) advanced adhesives, sealants, and coatings for automotive and industrial applications that require specialized bonding, encapsulating, environmental protection, or thermal management functionality;\n(iii) polymeric microspheres utilized by various industries to allow for weight and density reduction and sound dampening;\n(iv) polyurethane dispersions utilized for various coating products; and\n(v) superabsorbent polymers utilized for water and liquid management, remediation and protection in diverse markets including wire and cable, medical, environmental, infrastructure, energy and consumer products.\nIn our Industrial Tapes segment, these products consist of:\n(i) insulating and conducting materials for the manufacture of electrical and telephone wire and cable, electrical splicing, and terminating and repair tapes, which are marketed to wire and cable manufacturers;\n(ii) laminated film foils, including EMI/RFI shielding tapes used in communication and local area network (LAN) cable;\n(iii) industrial coated or laminate products and custom manufacturing services sold into medical, consumer, automotive, packaging, energy, telecommunications and other specialized markets;\n(iv) laminated durable papers, including laminated paper with an inner security barrier used in personal and mail-stream privacy protection, which are sold primarily to the envelope converting and commercial printing industries;\n(v) pulling and detection tapes used in the installation, measurement and location of fiber optic cable, water and natural gas lines, and power, data, and video cable for commercial buildings; and\n(vi) cover tapes with reliable adhesive and anti-static properties essential to delivering semiconductor components via tape and reel packaging.\nIn our Corrosion Protection and Waterproofing segment, these products consist of:\n(i) protective coatings, tapes and protectants for pipelines, valves, casings and other metals, which are sold to oil companies, gas companies and water/wastewater utilities for use in both the construction and maintenance of oil, gas, water and wastewater pipelines;\n(ii) fluid-applied coating and lining systems for use in the water and wastewater industry;\n(iii) waterproofing tapes and coatings used in waterproofing of the exterior of both commercial and industrial structures;\n(iv) waterproofing membranes for highway bridge deck metal-supported surfaces, and high-performance polymeric asphalt additives, which are sold to municipal transportation authorities; and\n(v) expansion and control joint systems designed for roads, bridges, stadiums and airport runways.\nThere is some seasonality in selling products into the construction market, which most acutely effects our Corrosion Protection and Waterproofing segment. Higher demand is often experienced when temperatures are warmer in most of North America (April through October), with lower demand occurring when temperatures are colder (typically our second fiscal quarter).\nHuman Capital Management\nChase Corporations success derives from its dedicated employees worldwide, who are responsible for the operations, innovation and ethics core to our business and its future. In fiscal 2022, our employees continued to navigate the challenges of COVID-19, and, with an overarching commitment to health and safety, maintained a commitment to our customers, including providing products to critical industries such as healthcare, utilities, infrastructure and telecommunications.\nAs of August 31, 2022, we employed approximately 683 people (including union employees). Of these, 80% were U.S. based and 20% international. 26% of our employees worked in administrative, selling and research and development functions, while 74% worked in the manufacture of our products at our facilities. Given macrotrends faced worldwide, Chase currently operates in an increasingly competitive landscape in hiring and retaining a manufacturing labor force. We consider our employee relations to be good. In the U.S., we offer our employees a wide array of company-paid benefits, which we believe are competitive relative to others in our industry. In our operations outside the U.S., we offer benefits that may vary from those offered to our U.S. employees due to customary local practices and statutory requirements.\nWe have policies in place designed to provide a safe and healthy workplace and comply with applicable safety and health regulations and our own internal requirements. We work to provide and maintain a safe, healthy and productive workplace, in consultation with our employees, by addressing and remediating identified risks of accidents, injury and health impacts.\nWe strive to maintain workplace environments that are free from discrimination or harassment on the basis of race, sex, color, national or social origin, ethnicity, religion, age, disability, sexual orientation, gender identification or expression, political opinion, or any other status protected by applicable law. The qualities and characteristics we seek for recruitment, hiring, placement, development, training, compensation, and advancement at the Company are job qualifications, performance, skills, and experience.\nRespect for human rights is a fundamental value of the Company. Chase strives to respect and promote human rights in accordance with the United Nations Guiding Principles on Business and Human Rights in our relationships with our employees, customers, suppliers, and vendors. Our aim is to further advance human rights within the communities in which we operate. The Chase Corporation Human Rights and Supplier Code of Conduct policies and statements on Safety Performance, Environmental Impact and Energy and Resources are available on our website (www.chasecorp.com).\nBacklog, Customers and Competition\nAs of August 31, 2022, the backlog of customer orders believed to be firm was approximately $40,600,000. This compared with a backlog of approximately $30,400,000 as of August 31, 2021. The increase in backlog from the prior year amount was primarily due to raw material supply and logistics challenges broadly seen worldwide increasing the balance for the current year. We continue to work with our customers, vendors and supply chain partners to prioritize the flow of goods. During fiscal 2022 and 2021, no customer accounted for more than 10% of sales. No material portion of our business is subject to renegotiation or termination of profits or contracts at the election of the United States Federal Government.\nThere are other companies that manufacture or sell products and services similar to those made and sold by us. Many of those companies are larger and have greater financial resources than we have. We compete principally on the basis of technical performance, service reliability, quality and price.\nRaw Materials\nWe obtain raw materials from a wide variety of suppliers, with alternative sources of most essential materials available within reasonable lead times.\nPatents, Trademarks, Licenses, Franchises and Concessions\nAs of August 31, 2022, we owned the following trademarks that we believe were of material importance to our business: Chase Corporation®, C-Spray (Logo), a trademark used in conjunction with most of the Companys business segment and product line marketing material and communications; HumiSeal®, a trademark for moisture protective coatings sold to the electronics industry; Chase & Sons®, a trademark for barrier and insulating tapes sold to the wire and cable industry; Chase BLH2OCK®, a trademark for a water-blocking compound sold to the wire and cable industry; Rosphalt50®, a trademark for an asphalt additive used predominantly on bridge decks for waterproofing protection; PaperTyger®, a trademark for laminated durable papers sold to the envelope converting and commercial printing industries; DuraDocument®, a trademark for durable, laminated papers sold to the digital print industry; Defender® a trademarked RFID protective material sold to the personal accessories and paper industries; Tapecoat®, a trademark for corrosion preventive surface coatings and primers; Maflowrap®, a trademark for anti-corrosive tapes incorporating self-adhesive mastic or rubber-backed strips, made of plastic materials; Royston®, a trademark for a corrosion-inhibiting coating composition for use on pipes; Ceva®, a trademark for epoxy pastes/gels/mortars and elastomeric concrete used in the construction industry; CIM® trademarks for fluid-applied coating and lining systems used in the water and wastewater industry; ServiWrap® trademarks for pipeline protection tapes, coatings and accessories; NEPTCO®, a trademark used in conjunction with most of NEPTCOs products marketing material and communications; NEPTAPE®, a trademark for coated shielding and insulation materials used in the wire and cable industry; Muletape®, a trademark for pulling and installation tapes sold to the telecommunications industry; Trace-Safe®, a trademark for detection tapes sold to the telecommunications and water and gas utilities industries; Dualite®, a trademark for polymeric microspheres utilized for density and weight reduction and sound dampening by various industries; 4EvaSeal®, a trademark for adhesive-backed tape utilized in various industries; Resin Designs®, a trademark for adhesives and sealants sold into the microelectronics and semiconductor industries; SlickTape®, a trademark for a lubricated shielding tape sold to the wire and cable industry; HighDraw®, a trademark for a highly extensible shielding tape sold to the wire and cable industry; ZapZorb®, a trademark for environmental solidification products that are designed to meet the specific challenges posed by a wide range of liquid-bearing waste streams; ZapLoc®, a trademark for medical waste solidifier products packaged in bottles or larger packages; ZapPak®, a trademark for medical waste solidifier products packaged in dissolvable film; and ABchimie®, a trademark used in conjunction with most of ABchimies products marketing material and communications.\nWe do not have any other material trademarks, licenses, franchises, or concessions. While we do hold various patents, as well as other trademarks, we do not believe that they are material to the success of our business.\nResearch and Development\nWe expensed approximately $4,415,000, $4,056,000 and $4,007,000 for Company-sponsored research and development during fiscal 2022, 2021 and 2020, respectively, which was recorded within Research and Product Development Costs on the Consolidated Statement of Operations. Research and development costs have stayed relatively consistent from fiscal 2020 through fiscal 2022 as the Company continued focused development work on strategic product lines.\nAvailable Information\nChase maintains a website at http://www.chasecorp.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to such reports filed or furnished pursuant to section 13(a) or 15(d) of the Securities Exchange Act of 1934, as well as section 16 reports on Form 3, 4, or 5, are available free of charge on this site as soon as is reasonably practicable after they are filed or furnished with the SEC. Our Code of Conduct and Ethics and the charters for the Audit Committee, the Nominating and Governance Committee and the Compensation and Management Development Committee of our Board of Directors are also available on our internet website. The Code of Conduct and Ethics and charters are also available in print to any shareholder upon request. Requests for such documents should be directed to Shareholder and Investor Relations Department, at 375 University Avenue, Westwood, Massachusetts 02090. Our internet website and the information contained on it or connected to it are not part of nor incorporated by reference into this Form 10-K. Our filings with the SEC are also available on the SECs website at http://www.sec.gov.\nFinancial Information regarding Segment and Geographic Areas\nPlease see Notes 11 and 12 to the Companys Consolidated Financial Statements for financial information about the Companys operating segments and domestic and foreign operations for each of the last three fiscal years. Item 1A - Risk Factors\nThe following risk factors should be read carefully in connection with evaluating our business and the forward-looking information contained in this Annual Report on Form 10-K. We feel that any of the following risks could materially adversely affect our business, operations, industry, financial position or our future financial performance. While we believe that we have identified and discussed below the key risk factors affecting our business, there may be additional risks and uncertainties that are not presently known or that are not currently believed to be significant that may adversely affect our business, operations, industry, financial position and financial performance in the future.\nOperational and Competitive Risks\nWe currently operate in mature markets where increases or decreases in market share could be significant.\nOur sales and net income are largely dependent on sales from a consistent and well-established customer base. We have used and will continue to use strategic acquisitions as a means to build and grow the business. In this business environment, increases or decreases in market share could have a material effect on our business condition or results of operation. We face intense competition from a diverse range of competitors, including operating divisions of companies much larger and with far greater resources than we have. If we are unable to maintain our market share, our business could suffer.\nFluctuations in the supply and prices of raw materials may negatively impact our financial results.\nWe obtain raw materials needed to manufacture our products from a number of suppliers. Many of these raw materials are petroleum-based derivatives. Under normal market conditions, these materials are generally available on the open market and from a variety of producers. From time to time, however, the prices and availability of these raw materials fluctuate (as was experienced in the second half of fiscal 2021 and in the fiscal 2022 period), which could impair our ability to procure necessary materials, or increase the cost of manufacturing our products. If the prices of raw materials increase, and we are unable to pass these increases on to our customers, we could experience reduced profit margins.\nIf our products fail to perform as expected, or if we experience product recalls, we could incur significant and unexpected costs and lose existing and future business.\nOur products are complex and could have defects or errors presently unknown to us, which may give rise to claims against us, diminish our brands or divert our resources from other purposes. Despite testing, new and existing products could contain defects and errors and may in the future contain manufacturing or design defects, errors or performance problems when first introduced, or even after these products have been used by our customers for a period of time. These problems could result in expensive and time-consuming design modifications or warranty charges, changes to our manufacturing processes, product recalls, significant increases in our maintenance costs, or exposure to liability for damages, any of which may result in substantial and unexpected expenditures, require significant management attention, damage our reputation and customer relationships, and adversely affect our business, our operating results and our cash flow.\nThe Companys results of operations have been adversely affected and could in the future be materially adversely impacted by the coronavirus disease 2019 (COVID-19) pandemic.\nThe global spread of the coronavirus disease 2019 (COVID-19) pandemic has created significant volatility, uncertainty and economic disruption. The Company experienced lower sales as a result of the economic disruption (most acutely in the second half of fiscal 2020 and the first half of fiscal 2021), and initiated cost-saving measures, including a targeted workforce reduction in 2020, in response to the uncertainties associated with the scope and duration of the pandemic. The extent to which the COVID-19 pandemic impacts the Companys business, operations and financial results in future periods will depend on numerous evolving factors that it may not be able to accurately predict, including: the duration and scope of the pandemic; future domestic and international waves and variants of COVID-19 and current vaccines effectiveness against such variants; governmental, business and individuals actions that have been and continue to be taken in response to the pandemic; the impact of the pandemic on economic activity and actions taken in response; the\neffect on its customers demand for its goods and services and its vendors ability to supply it with raw materials; its ability to sell and provide goods and services, including as a result of travel restrictions and people working from home; the ability of its customers to pay for goods and services; and any closures of its customers offices and facilities. Customers may also slow down decision-making, delay planned work or seek to terminate existing agreements.\nFurther, the effects of the pandemic may also increase the Companys cost of capital or make additional capital more difficult or available only on terms less favorable to it. A sustained downturn may also result in the carrying value of the Companys goodwill or other intangible assets exceeding their fair value, which may require it to recognize an impairment to those assets. A sustained downturn in the financial markets and asset values may have the effect of increasing the Companys pension funding obligations in order to ensure that its qualified pension plan continues to be adequately funded, which may divert cash flow from other uses.\nWe may experience difficulties in the redesign and consolidation of our manufacturing facilities which could impact shipments to customers, product quality, and our ability to realize cost savings.\nWe currently have several ongoing projects to streamline our manufacturing operations, which include the redesign and consolidation of certain manufacturing facilities in order to reduce overhead costs. Despite our planning, we may be unable to effectively leverage assets, personnel, and business processes in the transition of production among manufacturing facilities. Uncertainty is inherent within the facility redesign and consolidation process, and unforeseen circumstances could offset the anticipated benefits of these streamlining projects, disrupt service to customers, and impact product quality.\nStrategic Risks\nOur business strategy includes the pursuit of strategic acquisitions, which may not be successful if they happen at all.\nFrom time to time, we engage in discussions with potential target companies concerning potential acquisitions. In executing our acquisition strategy, we may be unable to identify suitable acquisition candidates. In addition, we may face competition from other companies for acquisition candidates, making it more difficult to acquire suitable companies on favorable terms. We have historically financed larger acquisitions with additional borrowings under our bank credit agreements. Our credit agreement places certain restrictions on our ability to acquire other businesses, and imposes certain financial covenants on us that may limit our ability to borrow. If we incur additional indebtedness in order to finance an acquisition, that indebtedness may reduce the availability of our cash flow to fund future working capital, capital expenditures, and other general corporate purposes, may increase our vulnerability to adverse economic conditions, and may expose us to the risk of increased interest rates. If we finance an acquisition through the issuance of equity securities, the ownership interest of our existing shareholders would be proportionately diluted.\nEven if we do identify a suitable acquisition target and are able to negotiate and close a transaction (as we did in fiscal 2021 for both ABchimie and the operations of Emerging Technologies, Inc. (ETI), and at the beginning of fiscal 2023 for NuCera), the integration of an acquired business into our operations involves numerous risks, including potential difficulties in integrating an acquired companys product line with ours; the diversion of our resources and managements attention from other business concerns; the potential loss of key employees; limitations imposed by antitrust or merger control laws in the United States or other jurisdictions; risks associated with entering a new geographical or product market; and the day-to-day management of a larger and more diverse combined company.\nWe may not realize the synergies, operating efficiencies, market position or revenue growth we anticipate from acquisitions, and our failure to effectively manage the above risks could have a material adverse effect on our business, growth prospects and financial performance.\nInternational Risks\nIf we cannot successfully manage the unique challenges presented by international markets, we may not be successful in expanding our international operations.\nOur strategy includes expansion of our operations in existing and new international markets by selective acquisitions and strategic alliances. Our ability to successfully execute our strategy in international markets is affected by many of the same operational risks we face in expanding our U.S. operations. In addition, our international expansion may be adversely affected by our ability to identify and gain access to local suppliers as well as by local laws and customs, legal and regulatory constraints, political and economic conditions and currency regulations of the countries or regions in which we currently operate or intend to operate in the future. Risks inherent in our international operations also include, among others, the costs and difficulties of managing international operations, adverse tax consequences, domestic and international tariffs and trade policies and greater difficulty in enforcing intellectual property rights. Additionally, foreign currency exchange rates and fluctuations may have an impact on future costs or on future cash flows from our international operations.\nCurrent and threatened tariffs on goods from China and other countries could result in lower revenue, profits and cash flows.\nThe Company imports raw materials from China, makes sales of finished goods into China and has manufacturing operations in China. The Company works to lower the potential negative effects of the tariffs through seeking alternative sources for our raw materials, when available and pragmatic, and, in certain cases, through altering our manufacturing logistics by utilizing non-U.S. manufacturing where tariffs do not apply. While we also attempt to pass on these additional costs to our customers, competitive factors (including competitors who import from other countries not subject to such tariffs) may limit our ability to sustain price increases and, as a result, may adversely impact our revenue, profits and cash flows. In addition, the imposition of tariffs may influence the sourcing habits of certain end users of our products which, in turn, could have a direct impact on the requirements of our direct customers for our products. Such an impact could adversely affect our revenue, profits and cash flows.\nIndustry Risks\nOur results of operations could be adversely affected by uncertain economic and political conditions and the effects of these conditions on our customers businesses and levels of business activity.\nGlobal economic and political conditions can affect the businesses of our customers and the markets they serve. A severe or prolonged economic downturn or a negative or uncertain political climate could adversely affect, among others, the automotive, housing, construction, pipeline, energy, transportation, infrastructure or electronics industries. This may reduce demand for our products or depress pricing of those products, either of which may have a material adverse effect on our results of operations. Changes in global economic conditions or foreign and domestic trade policy could also shift demand to products for which we do not have competitive advantages, and this could negatively affect the amount of business that we are able to obtain. In addition, if we are unable to successfully anticipate changing economic and political conditions, we may be unable to effectively plan for and respond to those changes and our business could be negatively affected.\nGeneral economic factors, domestically and internationally, may also adversely affect our financial performance through increased raw material costs or other expenses and by making access to capital more difficult.\nThe cumulative effect of higher interest rates, energy costs, inflation, levels of unemployment, healthcare costs, unsettled financial markets, and other economic factors (including changes in foreign currency exchange rates and changes to federal, state, local and international tax laws or the application or enforcement practices of such laws) could adversely affect our financial condition by increasing our manufacturing costs and other expenses at the same time that our customers may be scaling back demand for our products. Prices of certain commodity products, including oil and petroleum-based products, are historically volatile and are subject to fluctuations arising from changes in domestic and international supply and demand, labor costs, competition, weather events and climate change, regional and global public\nhealth crises, market speculation, government regulations and periodic delays in delivery. Rapid and significant changes in commodity prices may affect our sales and profit margins. These factors can increase our cost of products and services sold and/or selling, general and administrative expenses, and otherwise adversely affect our operating results. Disruptions in the credit markets may limit our ability to access debt capital for use in acquisitions or other purposes on advantageous terms or at all. If we are unable to manage our expenses in response to general economic conditions and margin pressures, or if we are unable to obtain capital for strategic acquisitions or other needs, then our results of operations would be negatively affected.\nOther Risks\nWe are dependent on key personnel.\nWe depend significantly on our executive officers including our President and Chief Executive Officer, Adam P. Chase, and on other key employees. The loss of the services of any of these key employees could have a material impact on our business and results of operations. In addition, our acquisition strategy will require that we attract, motivate and retain additional skilled and experienced personnel. We have experienced in the past, and may continue to experience, an increasingly competitive landscape relating to obtaining and retaining a manufacturing labor force. The inability to satisfy such requirements could have a negative impact on our ability to remain competitive in the future.\nFinancial market performance may have a material adverse effect on our pension plan assets and require additional funding requirements.\nSignificant and sustained declines in the financial markets may have a material adverse effect on the fair market value of the assets of our qualified pension plan. While these pension plan assets are considered non-financial assets since they are not carried on our balance sheet (i.e. the balance sheet reflects only the net of plan assets and obligations), the fair market valuation of these assets could impact our funding requirements, funded status or net periodic pension cost. Any significant and sustained declines in the fair market value of these pension assets could require us to increase our funding requirements, which would have an impact on our cash flow, and could also lead to additional pension expense.\nIf we fail to maintain effective internal control over financial reporting, this may adversely affect investor confidence in our company and, as a result, the value of our common stock.\nWe are required under Section 404 of the Sarbanes-Oxley Act to furnish a report by management on the effectiveness of our internal control over financial reporting and to include a report by our independent auditors attesting to such effectiveness. Any failure by us to maintain effective internal control over financial reporting could adversely affect our ability to report accurately our financial condition or results of operations.\nIf we are unable to maintain effective internal control over financial reporting, or if our independent auditors determine that we have a material weakness in our internal control over financial reporting, we could lose investor confidence in the accuracy and completeness of our financial reports, the market price of our common stock could decline, and we could be subject to sanctions or investigations by the SEC or other regulatory authorities. Failure to remedy any material weakness in our internal control over financial reporting, or to implement or maintain other effective control systems required of public companies, also could restrict our future access to the capital markets.\nFailure or compromise of security with respect to an operating or information system or portable electronic device could adversely affect our results of operations and financial condition or the effectiveness of our internal controls over operations and financial reporting.\nWe are highly dependent on automated systems to record and process our daily transactions and certain other components of our financial statements. Notwithstanding efforts to ensure the integrity of our automated systems, we could experience a failure of one or more of these systems, or a compromise of our security due to technical system flaws, data input or recordkeeping errors, or tampering or manipulation of our systems by employees or unauthorized third parties. Information security risks also exist with respect to the use of portable electronic devices, such as laptops and smartphones, which are particularly vulnerable to loss and theft.\nWe could be subject to disruptions of any of these systems arising from events that are wholly or partially beyond our control (for example, natural disasters, acts of terrorism, epidemics, pandemics, computer viruses, cyber-attacks, malware, ransomware, and electrical/telecommunications outages). All of these risks are also applicable wherever we rely on outside vendors to provide services. Operating system failures, disruptions, or the compromise of security with respect to operating systems or portable electronic devices (with information technology security threats increasing in frequency and sophistication) could subject us to liability claims, harm our reputation, interrupt our operations, or adversely affect our business, results from operations, financial condition, cash flow or internal control over financial reporting. Item 1B - Unresolved Staff Comments\nNot applicable. Item 2 - Properties\nThe principal properties of the Company as of August 31, 2022 are situated at the following locations and have the following characteristics:\nSquare\nOwned /\nLocation\nFeet\nLeased\nPrincipal Use\nWestwood, MA\n10,000\nLeased\nCorporate headquarters, executive office and global operations center, including research and development, sales and administrative services\nBlawnox, PA\n44,000\nOwned\nManufacture and sale of protective coatings and tape products\nCorbelin, France\n9,600\nLeased\nManufacture and sale of protective electronic coatings, as well as research and development\nEvanston, IL\n100,000\nOwned\nManufacture and sale of protective coatings and tape products\nGranite Falls, NC\n108,000\nOwned\nThe building is currently being leased to a third party\nGreenville, SC\n34,600\nLeased\nManufacture and sale of polymeric microspheres, as well as research and development\nGreensboro, NC\n16,000\nLeased\nFormulation and sale of superabsorbent polymer products\nHickory, NC\n180,000\nLeased\nManufacture and sale of superabsorbent polymer products, pulling and detection tapes and sealant systems, as well as research and development\nHouston, TX\n45,000\nOwned\nManufacture of coating and lining systems for use in liquid storage and containment applications\nLenoir, NC\n110,000\nOwned\nManufacture and sale of laminated film foils and cover tapes\nMississauga, Canada\n2,500\nLeased\nDistribution center\nOHara Township, PA\n109,000\nOwned\nManufacture and sale of protective electronic coatings, expansion joints and accessories\nOxford, MA\n73,600\nOwned\nManufacture of tape and related products for the electronic and telecommunications industries, as well as laminated durable papers\nParis, France\n1,900\nLeased\nSales/technical service office and warehouse allowing direct sales and service to the French market\nPune, India\n4,650\nLeased\nManufacture, packaging and sale of protective electronic coatings\nRotterdam, Netherlands\n2,500\nLeased\nDistribution center\nRye, East Sussex, England\n36,600\nOwned\nManufacture and sale of protective coatings and tape products\nSuzhou, China\n48,000\nLeased\nManufacture of packaging tape products for the electronics industries\nWinnersh, Wokingham, England\n18,800\nLeased\nManufacture and sale of protective electronic coatings, as well as research and development\nWoburn, MA\n34,000\nLeased\nManufacture and sale of adhesive systems, as well as research and development\nThe above facilities vary in age, are in good condition and, in the opinion of management, are adequate and suitable for present operations. We also own equipment and machinery that is in good repair and, in the opinion of management, adequate and suitable for present operations. We believe that we could significantly add to our capacity by increasing shift operations. Availability of machine hours through additional shifts would provide expansion of current production volume without significant additional capital investment. Item 3 - Legal Proceedings\nThe Company is involved from time to time in litigation incidental to the conduct of its business. Although the Company does not expect that the outcome in any of these matters, individually or collectively, will have a material adverse effect on its financial condition, results of operations or cash flows, litigation is inherently unpredictable. Therefore, judgments could be rendered, or settlements agreed to, that could adversely affect the Companys operating results or cash flows in a particular period. The Company routinely assesses all its litigation and threatened litigation as to the probability of ultimately incurring a liability and records its best estimate of the ultimate loss in situations where it assesses the likelihood of loss as probable. item 4 - mine safety disclosures\nNot applicable.\nItem 4a - INFORMATION ABOUT OUR Executive OfficerS\nThe following table sets forth information concerning our Executive Officers as of October 31, 2022. Each of our Executive Officers is selected by our Board of Directors and holds office until his successor is elected and qualified.\nName\nAge\nOffices Held and Business Experience during the Past Five Years\nAdam P. Chase\nPresident of the Company since January 2008, Chief Executive Officer of the Company since February 2015. Adam Chase was the Chief Operating Officer of the Company from February 2007 to February 2015.\nPeter R. Chase\nChairman of the Board of the Company since February 2007, and Executive Chairman of the Company since February 2015. Peter Chase was the Chief Executive Officer of the Company from September 1993 to February 2015. Peter Chase is the father of Adam Chase.\nMichael J. Bourque\nChief Financial Officer of the Company since February 2021. Previously, Chief Financial Officer of Keystone Dental, Inc., since April 2019. Prior to that, Mr. Bourque was employed at Analogic Corporation since 2014, most recently as Senior Vice President, Chief Financial Officer and Treasurer.\nJeffery D. Haigh\nVice President, General Counsel and Corporate Secretary since February 2021. Previously, Vice President, General Counsel since joining Chase in July 2020. Prior to that, Mr. Haigh worked in private practice from 2018 to 2020, having worked at Clean Harbors, Inc. from 2008 to 2018, most recently as Senior Counsel.\nPART II Item 5 - Market for the Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is traded on the NYSE American under the symbol CCF. As of October 31, 2022, there were 247 shareholders of record of our Common Stock and we believe there were approximately 11,064 beneficial owners who held shares through brokers or other nominees. On that date, the closing price of our common stock was $94.21 per share as reported by the NYSE American.\nSingle annual cash dividend payments were declared and scheduled to be paid subsequent to each year ended August 31, 2022, 2021 and 2020 in the amounts of $1.00, $1.00 and $0.80 per common share, respectively. Our revolving credit facility contains financial covenants which may have the effect of limiting the amount of dividends that we can pay.\nComparative Stock Performance\nThe following line graph compares the yearly percentage change in our cumulative total shareholder return on the Common Stock for the last five fiscal years with the cumulative total return on the Standard & Poor's 500 Stock Index (the S&P 500 Index), and a composite old and new peer index that is weighted by market equity capitalization (the Peer Group Index).\nThe Company realigned its composite peer group index in fiscal 2022 to account for acquisitions that occurred for some members of our old peer group and to better align our peer group with our industry and market capitalization. The companies included in the old Peer Group Index are Henkel AG & Co KGaA, H.B. Fuller Company, Intertape Polymer Group, Rogers Corporation and RPM International, Inc. The companies included in our new Peer Group Index are Henkel AG & Co KGaA, H.B. Fuller Company, CSW Industrials, Inc., Element Solutions, Inc., Quaker Chemical Corporation, and RPM International, Inc.\nCumulative total returns are calculated assuming that $100 was invested on August 31, 2017 in each of the Common Stock, the S&P 500 Index and the Peer Group Index, and that all dividends were reinvested.\nChase Corp\n$\n$\n$\n$\n$\n$\nS&P 500 Index\n$\n$\n$\n$\n$\n$\nNew Peer Group Index\n$\n$\n$\n$\n$\n$\nOld Peer Group Index\n$\n$\n$\n$\n$\n$\nThe information under the caption Comparative Stock Performance above is not deemed to be filed as part of this Annual Report, and is not subject to the liability provisions of Section 18 of the Securities Exchange Act of 1934. Such information will not be deemed to be incorporated by reference into any filing we make under the Securities Act of 1933 unless we explicitly incorporate it into such a filing at the time. Item 6 - Reserved\nNot required. Item 7 - Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion provides an analysis of our financial condition and results of operations. This material should be read in conjunction with the Consolidated Financial Statements and notes thereto included in Item 8 of this Annual Report on Form 10-K.\nThe discussion of the comparison of our fiscal 2021 and fiscal 2020 results was previously presented in the Managements Discussion & Analysis in Part II, Item 7 of the Companys Annual Report on Form 10-K filed with the SEC on November 15, 2021, and has been omitted from this section pursuant to Instruction 1 to Item 303(a) of Regulation S-K.\nSelected Relationships within the Consolidated Statements of Operations\nYears Ended August 31,\n(Dollars in thousands)\nRevenue\n$\n325,660\n$\n293,336\n$\n261,162\nNet income\n$\n44,671\n$\n44,920\n$\n34,157\nIncrease (decrease) in revenue from prior year\nAmount\n$\n32,324\n$\n32,174\n$\n(20,189)\nPercentage\n%\n%\n(7)\n%\nIncrease (decrease) in net income from prior year\nAmount\n$\n(249)\n$\n10,763\n$\n1,446\nPercentage\n(1)\n%\n%\n%\nPercentage of revenue:\nRevenue\n%\n%\n%\nCost of products and services sold\nSelling, general and administrative expenses\nResearch and Product Development Costs\nOther (income) expense, net\n*\nIncome before income taxes\n%\n%\n%\nIncome taxes\nNet income\n%\n%\n%\n* denotes less than one percent\nNote: Some percentage of revenue amounts may not sum due to rounding\nOverview\nGeneral\nThe Companys revenue increased in fiscal 2022, with all three of its reportable operating segments surpassing sales achieved in fiscal 2021. Despite the ongoing challenges of the global operating environment detailed below, the Company improved its gross margin percentage from the first half of fiscal 2022 to the second half, to end the year at 37.8%.\nDespite the Companys sales growth in fiscal 2022, and continued recovery of our gross margin percentage from the first half of the fiscal year, the Company continued to have a less favorable gross margin percentage in fiscal 2022 compared to the prior year. Higher operating costs seen in the fiscal year resulted in decreased operating income over the prior year. Chases relative gross margin in fiscal 2022 was negatively impacted by both: a.) increased input costs caused by continued global raw material inflationary pressures, increased logistics costs and a more competitive labor market; and b.) a less favorable sales mix, with sales price and demand-driven volume increase in its lower margin Industrial Tapes segment outpacing revenue gains seen in its higher margin Adhesives, Sealants and Additives, and Corrosion Protection and Waterproofing segments. Further, the Adhesives, Sealants and Additives segment also experienced a less favorable sales mix within the segment itself due to historically less favorable margin products constituting a comparatively larger part of total segment sales compared to the prior year.\nThe Company continues to work with our customers and suppliers in an effort to counteract margin compression. However, given the delay experienced due to notification period requirements with certain customers and the continuation of upward inflationary pressures on input costs, fiscal 2022 results reflect a lag (in the first half of the year) in the realization of the full benefits of these efforts.\nRevenue by Segment\nThe Company has three reportable operating segments summarized below:\nSegment\nProduct Lines\nManufacturing Focus and Products\nAdhesives, Sealants and Additives\nElectronic and Industrial Coatings\nFunctional Additives\nProtective coatings, including moisture protective coatings and cleaning solutions, and customized sealant and adhesive systems for electronics; polyurethane dispersions, polymeric microspheres and superabsorbent polymers.\nIndustrial Tapes\nCable Materials\nSpecialty Products\nPulling and Detection\nElectronic Materials\nProtective tape and coating products and services, including insulating and conducting materials for wire and cable manufacturers; laminated durable papers, packaging and industrial laminate products and custom manufacturing services; pulling and detection tapes used in the installation, measurement and location of fiber optic cable and water and natural gas lines; and cover tapes essential to delivering semiconductor components via tape and reel packaging.\nCorrosion Protection and Waterproofing\nCoating and Lining Systems\nPipeline Coatings\nBuilding Envelope\nBridge and Highway\nProtective coatings and tape products, including coating and lining systems for use in liquid storage and containment applications; protective coatings for pipeline and general construction applications; adhesives and sealants used in architectural and building envelope waterproofing applications; high-performance polymeric asphalt additives and expansion and control joint systems for use in the transportation and architectural markets.\nRevenue from our Adhesives, Sealants and Additives segment increased in fiscal 2022 compared to fiscal 2021 primarily due to sales price increases to counteract margin compression for our North American-focused functional additives product line. Revenue gains also reflect inorganic growth from our Emerging Technologies, Inc. (ETi) business acquired in the last month of the second quarter of fiscal 2021. Partially offsetting this increase in revenue was our reduction in sales volume from our worldwide-focused electronic and industrial coatings product line due to reduced demand acutely seen with sales within the automotive industry during the fiscal period.\nRevenue from our Industrial Tapes segment surpassed the COVID-19 impacted prior year due to sales price increase and demand-driven growth in our wire and cable, specialty products, and pulling and detection product lines. Tempering the\nincrease in revenue sales was a decrease from our electronic materials product line, due to decreased demand in the Asian-end market.\nRevenue from our Corrosion Protection and Waterproofing segment showed modest increases in fiscal 2022 compared to fiscal 2021, primarily due to sales price increases to counteract margin compression from its coating and lining, building envelope and bridge and highway product lines. Partially offsetting these increases in revenue was a decrease in net sales volume from the pipeline coatings product line, due to COVID-19 overhang delays in products sold into Middle East and Asian markets outpacing North American sales gains in oil and gas pipeline repair and construction markets\nBalance Sheet and Cash Flow\nChase Corporations balance sheet remained strong as of August 31, 2022, with cash on hand of $315,495,000 (or a net of $135,495,000 when excluding the $180,000,000 cash used to fund the NuCera acquisition on September 1, 2022 (the first day of fiscal 2023) and a current ratio of 12.4. The Companys cash position remained healthy, as did cash flow from operations. The increase in cash balance (at the end of the fiscal year) was attributed to the $180,000,000 of cash drawn from its revolving credit facility to fund the acquisition of NuCera which closed on September 1, 2022 (the first day of fiscal 2023). See note 23 of the consolidated financial statements relating to this subsequent event.\nCash provided by operating activities of $34,859,000 for fiscal year 2022 was impacted by the Companys strategic inventory build during the fiscal period, undertaken to help ensure our ability to satisfy customers demands and to address our elevated backlog caused in part by supply chain challenges. In addition, during the second fiscal quarter Chase Corporation paid out our largest ever annual cash dividend of $9,460,000 on December 9, 2021.\nThe Company had a $180,000,000 outstanding balance on its $200,000,000 revolving credit facility as of August 31, 2022 in order to fund the NuCera acquisition as noted above. The revolving credit facility, which was amended and restated in July 2021 (fourth quarter of fiscal 2021) to increase its capacity from $150,000,000 to $200,000,000, allows for the Company to pay down debt with excess cash, while retaining access to immediate liquidity to fund future accretive activities, including mergers and acquisitions, as they are identified. The new facility also gives Chase the ability to request an increase in this amount by an additional $100,000,000 ($300,000,000 in total borrowing capacity) at the individual or collective option of any of the lenders. The facility matures in July 2026.\nResults of Operations\nRevenue and Income Before Income Taxes by Segment are as follows:\nIncome Before\n% of\nRevenue\nIncome Taxes\nRevenue\n(Dollars in thousands)\nFiscal 2022\nAdhesives, Sealants and Additives\n$\n135,770\n$\n37,657\n(a)\n%\nIndustrial Tapes\n143,954\n41,387\n%\nCorrosion Protection and Waterproofing\n45,936\n17,415\n%\n$\n325,660\n96,459\n%\nLess corporate and common costs\n(37,861)\n(b)\nIncome before income taxes\n$\n58,598\nFiscal 2021\nAdhesives, Sealants and Additives\n$\n126,864\n$\n36,520\n(c)\n%\nIndustrial Tapes\n120,873\n37,407\n%\nCorrosion Protection and Waterproofing\n45,599\n15,913\n(d)\n%\n$\n293,336\n89,840\n%\nLess corporate and common costs\n(31,246)\n(e)\nIncome before income taxes\n$\n58,594\nFiscal 2020\nAdhesives, Sealants and Additives\n$\n96,208\n$\n25,953\n%\nIndustrial Tapes\n118,960\n31,237\n(f)\n%\nCorrosion Protection and Waterproofing\n45,994\n16,638\n(g)\n%\n$\n261,162\n73,828\n%\nLess corporate and common costs\n(28,508)\n(h)\nIncome before income taxes\n$\n45,320\n(a) Includes a $432 loss on the upward adjustment of the performance-based earn-out contingent consideration associated with the September 2020 acquisition of ABchimie, $463 in operation optimization costs related to the move from Woburn, MA to OHara Township, PA and $147 of operations optimization costs related to the move from Newark, CA to Hickory, NC\n(b) Includes $232 of operations optimization costs related to the Companys move to the new corporate headquarters within Westwood, MA, and $4,000 of acquisition-related expenses attributable to NuCera\n(c) Includes $1,664 in loss on the upward adjustment of the performance-based earn out contingent consideration associated with the September 2020 acquisition of ABchimie and $977 in exit costs related to the movement of the sealants system business out of the Newark, CA location and into the Hickory, NC location during fiscal 2021\n(d) Includes expense of $100 for the write-down of certain assets under construction\n(e) Includes $128 in acquisition-related expense attributable to the February 2021 acquisition of the operations of ETi\n(f) Includes $559 in exit costs related to the movement of the pulling and detection business out of the Granite Falls, NC location and into the Hickory, NC location during the first six months of fiscal 2020\n(g) Includes $170 gain on the refund of a payment made in fiscal 2019 related to engineering studies performed to assess potential operational changes and further plant rationalization and consolidation and an expense of $405 for the write-down of certain assets under construction\n(h) Includes $150 of expense related to exploratory IT work performed to assess potential future upgrades to the Companys companywide ERP system, a $760 gain related to the April 2020 sale of the Companys Pawtucket, RI location, a $1,791 gain related to the August 2020 sale of the Companys Randolph, MA property, $183 in severance expense related to the May 2020 reduction in force, $85 in expenses related to the final transition out of the Pawtucket, RI facility, $155 of pension-related settlement costs due to the timing of lump-sum distribution and $274 in acquisition-related costs attributable to the September 2020 (fiscal 2021) acquisition of ABchimie\nTotal Revenue\nTotal revenue in fiscal 2022 increased $32,324,000 or 11% to $325,660,000 from $293,336,000 in the prior year.\nRevenue in the Companys Adhesives, Sealants and Additives segment increased $8,906,000 or 7% to $135,770,000 for the year ended August 31, 2022 compared to $126,864,000 in fiscal 2021. Positively impacting sales for the segment was increased revenue of $11,463,000 from its North American-focused functional additives product line, which includes inorganic growth attributable to the ETi business acquired in the last month of the second quarter of fiscal 2021. Additionally, the increase in revenue from its North American-focused functional additives was primarily attributed to sales price increases to counteract margin compression. Negatively impacting the segments sales were volume-driven decreases from its worldwide-focused electronic and industrial coatings line totaling $2,557,000 in fiscal 2022, with logistics and raw material supply constraints affecting demand in automotive verticals.\nRevenue in the Companys Industrial Tapes segment increased $23,081,000 or 19% to $143,954,000 for the year ended August 31, 2022 compared to $120,873,000 in fiscal 2021. Positively impacting sales for the segment were sales price and volume-driven increases of $23,538,000 due to its wire and cable, specialty products, and pulling and detection product lines, over the COVID-19 impacted prior year period. Negatively impacting the segments sales was a decrease in revenue from its electronic materials product line totaling $457,000 in fiscal 2022, due to decreased demand in the Asian end-market.\nRevenue in the Companys Corrosion Protection and Waterproofing segment increased $337,000 or 1% to $45,936,000 for the year ended August 31, 2022 compared to $45,599,000 for fiscal 2021. Positively impacting the segment sales for the fiscal year were sales price-driven increases to counteract margin compression in the Companys coatings and lining, building envelope and bridge and highway product lines totaling $1,053,000. Negatively impacting the segments sales was a decrease in revenue from its pipeline coatings product line totaling $716,000, due to COVID-19 overhang delays in products sold into Middle East and Asian markets outpacing North American sales gains in oil and gas pipeline repair and construction markets.\nRoyalties and commissions in the Adhesive, Sealants and Additives segment totaled $3,198,000 and $3,534,000 for the years ended August 31, 2022 and 2021, respectively. The decrease in royalties and commissions in fiscal 2022 compared to fiscal 2021 was primarily due to decreased sales of electronic and industrial coatings products by our licensed manufacturer in Asia.\nExport sales from domestic operations to unaffiliated third parties was $36,305,000 and $33,439,000 for the years ended August 31, 2022 and 2021, respectively. The increase in export sales from fiscal 2021 to fiscal 2022 is reflective of the company-wide year-over-year increase in revenue attributed to a combination of sales price and demand-driven increases.\nCost of Products and Services Sold\nCost of products and services sold increased $28,048,000 or 16% to $202,708,000 for the fiscal year ended August 31, 2022 compared to $174,660,000 in fiscal 2021.\nThe following table summarizes the relative percentages of cost of products and services sold to revenue for our three operating segments:\nFiscal Years Ended August 31,\nCost of products and services sold\nAdhesives, Sealants and Additives\n%\n%\n%\nIndustrial Tapes\n%\n%\n%\nCorrosion Protection and Waterproofing\n%\n%\n%\nTotal Company\n%\n%\n%\nCost of products and services sold in our Adhesives, Sealants and Additives segment was $80,619,000 for the fiscal year ended August 31, 2022 compared to $71,805,000 in fiscal 2021. Cost of products and services sold in the Industrial Tapes segment was $96,132,000 for the fiscal year ended August 31, 2022 compared to $77,013,000 in fiscal 2021. Cost of products sold in the Corrosion Protection and Waterproofing segment was $25,957,000 for the fiscal year ended August 31, 2022 compared to $25,842,000 in fiscal 2021.\nAs a percentage of revenue, cost of products and services increased for the Adhesives, Sealants and Additives and Industrial Tapes segments in fiscal 2022. As a percentage of revenue, cost of products and services sold for the Corrosion Protection and Waterproofing segment remained flat in fiscal 2022. The decrease in the relative gross margin for the Adhesives, Sealants and Additives and Industrial Tapes segments for the most recent fiscal year were due to continued global raw material inflationary pressures, increased logistics and freight costs and a more competitive labor market. Additionally, the Companys overall relative margin was affected by a less favorable sales mix with sales price increases realized in our lower margin Industrial Tapes segment that outpaced sales price increase realized in our Adhesive, Sealants and Additives and Corrosion Protection and Waterproofing segments. The Adhesives, Sealants and Additives segment also experienced a less favorable sales mix within the segment itself, with historically less favorable margin products constituting a comparatively larger part of total segment sales. The Company has implemented and continues to implement customer price adjustments and continues to work with our customers and suppliers in an effort to counteract margin compression, but with a lag reflected in the first half of the fiscal year results.\nWith the composition of our finished goods and the markets we serve, the costs of certain commodities (including petroleum-based solvents, films, yarns, polymers and nonwovens, aluminum and copper foils, specialty papers, and various resins, adhesives and inks) both directly and indirectly affect the purchase price of our raw materials and the market demand for our product offerings. The Company diligently monitors raw material and commodities pricing across all its product lines in its efforts to preserve margins.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses increased $2,338,000 or 5% to $54,438,000 during fiscal 2022 compared to $52,100,000 in fiscal 2021. The increase in activity is attributed to total increased selling and sales activity in the most recent fiscal year. As a percentage of revenue, selling, general and administrative expenses were 17% and 18% of total revenue in fiscal 2022 and 2021, respectively. The Company continues to closely monitor spending with an emphasis on controlling costs and leveraging existing resources.\nResearch and Product Development Costs\nResearch and Product Development Costs increased $359,000 or 9% to $4,415,000 during fiscal 2022, compared to $4,056,000 in fiscal 2021. Research and development costs increased from fiscal 2021 to 2022 as the Company continued focused development work on strategic product lines.\nOperations Optimization Costs\nThe Company completed the relocation of its corporate headquarters to another location within Westwood, MA during the year ended August 31, 2022. The move, part of the Companys ongoing consolidation and optimization initiative, capitalizes on the hybrid work model utilized by many of Chases corporate and administrative employees and is expected to provide future operational cost savings. The new facility also consolidates and houses research and development operations previously conducted at the previous Westwood, MA and Woburn, MA locations. Operations optimization costs related to the Westwood move of $232,000 were expensed in the year. No future costs related to the move are anticipated.\nDuring the third quarter of fiscal 2021, Chase announced to the employees at its Woburn, MA location that its adhesives systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, would be consolidating into the Companys existing O'Hara Township, PA location. This rationalization and consolidation initiative-related announcement aligns with the second quarter announcement of the Companys plan to move its sealant systems production from Newark, CA to Hickory, NC, described in more detail below. Chase Corporation obtained both the adhesive and sealants systems as part of its fiscal 2017 acquisition of the operations of\nResin Designs. The Company expensed $463,000 and $0 in fiscal 2022 and 2021, related to the move, and future costs related to its move are not anticipated to be significant to the consolidated financial statements.\nDuring the second quarter of fiscal 2021, Chase began moving the sealant systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, from its Newark, CA location to its Hickory, NC facility. This is in line with the Companys ongoing initiative to consolidate its manufacturing plants and streamline its existing processes. The sealant systems operations and Newark, CA location came to Chase Corporation as part of the fiscal 2017 acquisition of the operations of Resin Designs, and the Companys lease there terminated in the current fiscal year. The Company recognized $147,000 and $977,000 in operations costs related to the move during fiscal 2022 and fiscal 2021, respectively. This project is now substantially completed and any future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nDuring the third fiscal quarter of 2020, the Company implemented changes in its cost structure designed to address market changes brought on, in part, by COVID-19. These changes included a targeted reduction of approximately 4.5% of the Companys global workforce. This reduction, which was contemplated pre-pandemic but catalyzed by COVID-19, resulted in the recognition of $183,000 in severance costs during the third quarter of fiscal 2020. The reduction in force, which impacted operations in the Blawnox, PA, Hickory, NC, Lenoir, NC, Evanston, IL, Oxford, MA and Westwood, MA facilities, was effective May 2020.\nDuring the first quarter of fiscal 2020, the Company commissioned third party led studies regarding the potential upgrading of the Companys current worldwide ERP system. Chase Corporation reviewed the data and recommendations provided by the study and has made the decision to upgrade (beginning in fiscal 2023) from our current Oracle Legacy ERP System to the Oracle Fusion Cloud Platform. This upgrade will position us with a more advanced system to support business expansion, access to upgrades in functionality and a more modern system for operations, all within the Oracle Ecosystem. Additionally, the upgrade will be a multi-year, phased in approach that will mitigate any disruptions to our business. The Company recognized $150,000 in third party studies in fiscal 2020 and no costs were recognized in fiscal 2022 and 2021.\nDuring the third quarter of fiscal 2019, Chase began moving the pulling and detection operations housed in its Granite Falls, NC location to its Hickory, NC facility. This is in line with the Companys ongoing initiative to consolidate its manufacturing plants and streamline its existing processes. At the time, the pulling and detection operations were the only Chase-owned production operations in Granite Falls, NC, with the remaining portions of the building being either utilized for research and development or leased to a third party. The process of moving, including moving internal research and development capabilities, was substantially completed during the second quarter of fiscal 2020. The Company recognized $559,000 in expense related to the move in the first half of fiscal 2020. This project is substantively completed. No costs were recorded after the first half of fiscal 2020, and any future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nDuring the fourth quarter of fiscal 2019, Chase commissioned engineering studies of certain legacy operations, machinery and locations related to the Companys ongoing facility rationalization and consolidation initiative. Chase completed its review of the data and recommendations provided by the study in the fourth quarter of fiscal 2020. The Company recognized a gain of $170,000 in fiscal 2020, as certain amounts expensed in fiscal 2019 were refunded. Chase may utilize third party engineering, IT and other professional services firms in the future for similar optimization-related work. Given the ongoing nature of the facility rationalization and consolidation initiative, an estimate of future costs cannot currently be determined.\nDuring the fourth quarter of 2018, the Company announced to its employees the planned closing of its Pawtucket, RI manufacturing facility effective August 31, 2018. The manufacture of products previously produced in the Pawtucket, RI facility was substantially moved to Company facilities in Oxford, MA and Lenoir, NC during a two-month transition period. The Company completed the sale of its Pawtucket, RI location to a third-party in April 2020, for net proceeds totaling $1,810,000. This transaction resulted in a gain of $760,000 which was recorded during the third quarter of fiscal 2020. Also, during the third quarter of fiscal 2020, the Company recognized $85,000 in final Pawtucket, RI transition and exit costs, with no further costs related to this initiative anticipated in future periods.\nAcquisition-Related Costs\nIn the fourth quarter of fiscal 2022, the Company incurred $4,000,000 of acquisition-related costs related to our acquisition of NuCera Solutions (NuCera) on September 1, 2022 (first day of fiscal 2023). See Note 23 to the consolidated financial statements for additional information related to our subsequent event.\nIn the second quarter of fiscal 2021, the Company incurred $128,000 of acquisition-related costs related to our acquisition of Emerging Technologies, Inc (ETi) on February 5, 2021. This acquisition was accounted for as a business combination in accordance with applicable accounting standards, and all related professional service fees (including legal, accounting and actuarial fees) were expensed as incurred within the second quarter of fiscal 2021.\nIn fiscal 2020, the Company incurred $274,000 of costs related to our acquisition of ABchimie. This acquisition was accounted for as a business combination in accordance with applicable accounting standards, and all related professional service fees (including banking, legal, accounting and actuarial fees) were expensed as incurred within the second, third and fourth quarters of fiscal 2020. The transaction was consummated at the beginning of fiscal 2021.\nGain on Sale of Real Estate\nIn August 2020, the Company finalized the sale of its Randolph, MA property for net proceeds of $1,805,000. This transaction resulted in a gain of $1,791,000 which was recorded during the quarter ended August 31, 2020 (fiscal 2020).\nIn April 2020, the Company finalized the sale of its Pawtucket, RI location for net proceeds of $1,810,000. This transaction resulted in a gain of $760,000 which was recorded during the quarter ended May 31, 2020 (fiscal 2020).\nWrite-down of certain assets under construction\nIn the fourth quarter of fiscal 2021, the Company wrote down the value of certain non-operating production assets related to the pipeline coatings product line, within the Corrosion Protection and Waterproofing segment. Given the nature and prospects of the equipment, the Company determined its then carrying value exceeded its fair value and recognized an expense of $100,000 related to the machinery.\nIn the fourth quarter of fiscal 2020, given the results and recommendations of a commissioned engineering study, the Company wrote down the value of certain non-operating production assets related to the pipeline coatings product line, within the Corrosion Protection and Waterproofing segment. Given the nature and prospects of the equipment, the Company determined its then carrying value exceeded its fair value and recognized an expense of $405,000 related to the machinery.\nLoss on Contingent Consideration\nAs a component of the September 1, 2020 acquisition of ABchimie, the Company incurred a performance-based earn out liability potentially worth an additional €7,000,000 (approximately $8,330,000 at the time of the transaction) in consideration. Following its initial recording of an accrual for $928,000 at the acquisition date, $432,000 and $1,664,000 in expense related to upward adjustments to the performance-based earn out accrual were recorded to the consolidated statement of operations for the years ended August 31, 2022 and 2021, respectively.\nInterest Expense\nInterest expense increased $128,000 or 43% to $425,000 in fiscal 2022 compared to $297,000 in fiscal 2021. The increase in interest expense is related primarily to two days of interest expense recorded from long-term debt and unused commitment fee from our new revolving debt facility that commenced in the fourth quarter of fiscal 2021.\nOther Income (Expense)\nOther income (expense) was income of $198,000 in fiscal 2022 compared to an expense of $760,000 in fiscal 2021, an increase of $958,000. Other income (expense) primarily includes foreign exchange gains (losses) caused by changes in exchange rates on transactions or balances denominated in currencies other than the functional currency of our subsidiaries, non-service cost components of periodic pension expense (including pension-related settlement costs due to the timing of lump-sum distributions), interest income, rental income and other non-trade/non-royalty/non-commission receipts. The increase in total other income in fiscal 2022 compared to fiscal 2021 was largely due to the recognition of a foreign exchange gain in fiscal 2022 as compared to fiscal 2021.\nIncome Taxes\nOur effective tax rate for fiscal 2022 was 23.8% as compared to 23.3% in fiscal 2021.\nFor fiscal 2022 and 2021, the Company utilized the 21% Federal tax rate enacted by the Tax Cuts and Jobs Act (the Act) passed in December 2017. Please see Note 7 - Income Taxes to the Consolidated Financial Statements for further discussion of the effects of the Tax Act.\nNet Income\nNet income decreased $249,000 or less than 1% to $44,671,000 compared to $44,920,000 in fiscal 2021. The decrease in net income in the fiscal year was primarily due to a.) increased input costs caused by continued global raw material inflationary pressures, increased logistics costs and a more competitive labor market; and b.) a less favorable sales mix, with sales price and volume-driven increases in its lower margin Industrial Tapes segment outpacing sales price revenue gains seen in its higher margin Adhesive, Sealants and Additives and Corrosion Protection and Waterproofing segments.\nLiquidity and Sources of Capital\nOur cash balance increased $196,066,000 to $315,495,000 (or to $135,495,000 when excluding the $180,000,000 cash used to fund the NuCera acquisition on September 1, 2022 (the first day of fiscal 2023)) from $119,429,000 at August 31, 2021. The increase in cash balance (at the end of the fiscal year) was attributed to the $180,000,000 of cash drawn from its revolving credit facility to fund the acquisition of NuCera which closed on September 1, 2022 (the first day of fiscal 2023), cash provided by operations of $34,859,000 offset by the $9,460,000 annual dividend in the second quarter of fiscal 2022 and the strategic inventory build in fiscal 2022. Of the above-noted amounts, $28,951,000 and $26,309,000 were held outside the U.S. by Chase Corporation and our foreign subsidiaries as of August 31, 2022 and 2021, respectively. Given our cash position and borrowing capability in the United States and the potential for increased investment and acquisitions in foreign jurisdictions, prior to the second quarter of fiscal 2018, we did not have a history of repatriating a significant portion of our foreign cash. With the passage of the Tax Cuts and Jobs Act (the Tax Act) in the second fiscal quarter of 2018, significant changes in the Internal Revenue Code were enacted, changing the U.S. taxable nature of previously unrepatriated foreign earnings. Following the passage of the Tax Act, the Company repatriated $10,499,000 in U.K. foreign earnings in fiscal 2018 and $17,230,000 in fiscal 2019. No additional amounts were repatriated in fiscal year 2020, 2021 or 2022. Please see Note 7 - Income Taxes to the Consolidated Financial Statements for further discussion of the effects of the Tax Act.\nCash provided by operations was $34,859,000 for the year ended August 31, 2022 compared to $61,217,000 in fiscal 2021. Cash provided by operations during the current period was primarily related to operating income. Negatively impacting the cash flow from operations in fiscal 2022 was our continued strategic inventory build, undertaken to help ensure our ability to satisfy our customers demands and to address our elevated backlog caused in part by macroeconomic supply chain challenges\nThe ratio of current assets to current liabilities was 12.4 (or 7.3 excluding the $180,000,000 cash used to fund the NuCera acquisition) as of August 31, 2022 compared to 6.5 as of August 31, 2021. The increase in our current ratio in fiscal 2022 was primarily attributable to increased cash funding from our revolving credit facility to fund the acquisition of NuCera and increase in inventory. See Note 23 of the consolidated financial statements for additional information related to our subsequent event.\nCash used in investing activities was $4,427,000 for the year ended August 31, 2022 compared to $33,927,000 in cash used in investing activities in fiscal 2021. During fiscal 2021, cash used in investing activities was largely due to the cash on hand purchases of both ABchimie and ETi and cash spent on capital purchases of machinery and equipment.\nCash provided in financing activities was $169,845,000 for the year ended August 31, 2022 compared to $8,248,000 of cash used in financing activities in fiscal 2021. Cash provided in financing activities in fiscal 2022 was primarily attributed to an increase of $180,000,000 from our existing credit facility to fund the NuCera acquisition, offset by the annual dividends of $9,460,000. Cash used in financing activities in fiscal 2021 was primarily attributed to our annual dividend payment of $7,557,000.\nOn November 10, 2022, Chase announced a cash dividend of $1.00 per share (totaling approximately $9,494,000) to shareholders of record on November 30, 2022 and payable on December 9, 2022.\nOn November 15, 2021, Chase announced a cash dividend of $1.00 per share (totaling $9,460,000) to shareholders of record on November 30, 2021 and payable on December 9, 2021.\nOn July 27, 2021 (the fourth quarter of fiscal 2021), the Company entered into the Second Amended and Restated Credit Agreement (the Credit Agreement) by and among the Company and NEPTCO Incorporated (NEPTCO), each as borrowers, the guarantor subsidiaries party thereto, the financial institutions party thereto as Lenders, and Bank of America, N.A., as administrative agent, with participation from Wells Fargo Bank, N.A., PNC Bank, N.A. and JPMorgan Chase Bank, N.A. The Credit Agreement was entered into to amend, restate and extend the Companys preexisting credit agreement (the Prior Credit Agreement), which had a maturity date of December 15, 2021, and to provide for additional liquidity to finance acquisitions, working capital and capital expenditures, and for other general corporate purposes. Under the Credit Agreement, Chase obtained an increased revolving credit loan (the Revolving Facility), with borrowing capabilities not to exceed $200,000,000 at any time, with the ability to request an increase in this amount by an additional $100,000,000 at the individual or collective option of any of the Lenders. The applicable interest rate for the Revolving Facility and Term Loan (defined below) is based on the effective London Interbank Offered Rate (LIBOR) plus a range of 1.00% to 1.75%, depending on the consolidated net leverage ratio of Chase and its subsidiaries. As of August 31, 2022, the Company had $180,000,000 in long-term debt attributed to the acquisition of NuCera Solutions that closed on September 1, 2022. The long-term debt has an applicable interest rate of 5.5%.\nThe Credit Agreement has a five-year term with interest payments due at the end of the applicable LIBOR period (but in no event less frequently than the three-month anniversary of the commencement of such LIBOR period) and principal payment due at the expiration of the agreement, July 27, 2026. The Credit Agreement contains provisions that may replace LIBOR as the benchmark index under certain circumstances. In addition, the Company may elect a base rate option for all or a portion of the Revolving Facility, in which case interest payments shall be due with respect to such portion of the Revolving Facility on the last business day of each quarter. Subject to certain conditions set forth in the Credit Agreement, the Company may elect to convert all or a portion of the outstanding Revolving Facility into a new term loan twice during the term of the Revolving Facility (each, a Term Loan, and collectively with the Revolving Facility, the Credit Facility), which Term Loan shall be payable quarterly in equal installments sufficient to amortize the original principal amount of such Term Loan on a ten year amortization schedule.\nThe outstanding balance on the Credit Facility is guaranteed by all of Chases direct and indirect domestic subsidiaries, which collectively had a carrying value of approximately $314,662,000 at August 31, 2022. The Credit Facility is subject to restrictive covenants under the Credit Agreement, and financial covenants that require Chase and its subsidiaries to maintain certain financial ratios on a consolidated basis, including a consolidated net leverage ratio of 3.25 to 1.00 and a consolidated interest coverage ratio of 3.50 to 1.00 (both defined in the Credit Agreement). Chase Corporation was in compliance with the debt covenants as of August 31, 2022. The Credit Agreement also places certain Lender-approval requirements as to the size of permitted acquisitions which may be entered into by the Company and its subsidiaries, and allows for a temporary step-up in the allowed consolidated leverage ratio for the four fiscal quarters ending after certain designated acquisitions. Prepayment is allowed by the Credit Agreement at any time during the term of the agreement, subject to customary notice requirements and the payment of customary LIBOR breakage fees.\nThe Prior Credit Agreement was an all-revolving credit facility with a borrowing capacity of $150,000,000, which could be increased by an additional $50,000,000 at the request of the Company and the individual or collective option of any of the lenders, and with an interest rate based on the effective LIBOR plus an additional amount in the range of 1.00% to 1.75%, depending on our consolidated net leverage ratio or, at the Companys option, at the banks base lending rate. It was substantially available at July 27, 2021, the time of its amendment and restatement.\nThe Company has several ongoing capital projects, including upgrading the Companys ERP system, as well as its facility rationalization and consolidation initiative, which are important to its long-term strategic goals. Machinery and equipment may be added as needed to increase capacity or enhance operating efficiencies in the Companys production facilities.\nWe may acquire companies or other assets in future periods which are complementary to our business. The acquisition of ABchimie included a potential earnout based on performance of up to an additional €7,000,000 (approximately $8,330,000 at the time of the transaction), which the Company expects to pay with cash on hand if the applicable conditions are met. The acquisition of ETi included a $1,000,000 withholding, which was paid out by the Company on August 4, 2022 (eighteen months after the acquisition). The Company believes that its existing resources, including cash on hand and the Credit Agreement, together with cash generated from operations and additional bank borrowings, will be sufficient to fund its cash flow requirements through at least the next twelve months. However, there can be no assurance that additional financing, if needed, will be available on favorable terms, if at all.\nTo the extent that interest rates increase in future periods, we will assess the impact of these higher interest rates on the financial and cash flow projections of our potential acquisitions.\nWe have no material off-balance sheet arrangements.\nContractual Cash Obligations\nThe following table summarizes our contractual cash obligations at August 31, 2022 under operating leases and the effect such obligations are expected to have on our liquidity and cash flow in future periods (dollars in thousands):\nPayments Due\nContractual Obligations\nTotal\n2028 and thereafter\nOperating leases\n$\n8,808\n$\n1,651\n$\n1,576\n$\n1,418\n$\n1,173\n$\n$\n2,199\nTotal\n$\n8,808\n$\n1,651\n$\n1,576\n$\n1,418\n$\n1,173\n$\n$\n2,199\nWe may be required to make payments related to our unrecognized tax benefits. Due to the uncertainty of the timing of future cash flows associated with these unrecognized tax benefits, we are unable to make reasonably reliable estimates of the period of cash settlement, if any, with the respective taxing authorities. The Companys unrecognized tax benefits was $1,820,000 as of August 31, 2022. See Note 7 - Income Taxes to the Consolidated Financial Statements for further information.\nWe also expect to make payments as needed to satisfy our funding obligations for our obligations for pension and other post-retirement benefit plans. As of August 31, 2022, we had recognized an accrued benefit plan liability of $8,996,000 representing the unfunded obligations of the pension benefit plans. See Note 9 - Benefits and Pension Plans to the Consolidated Financial Statements for further information, including expected pension benefit payments for the next 10 years.\nThe Company does not have significant agreements for the purchase of raw materials or other goods specifying minimum quantities or set prices that exceed expected requirements or extend beyond one year.\nRecently Issued Accounting Standards\nFor discussion of the newly issued accounting pronouncements see Recently Adopted Accounting Standards in Note 1 - Summary of Significant Accounting Policies to the Consolidated Financial Statements included in this Report.\nCritical Accounting Policies, Judgments, and Estimates\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the U.S. requires management to make judgments, assumptions and estimates that affect the amounts reported in the consolidated financial statements and accompanying notes. Our significant accounting policies are described in Note 1 - Summary of Significant Accounting Policies to the Consolidated Financial Statements included in this Report.\nThe U.S. Securities and Exchange Commission (SEC) requires companies to provide additional disclosure and commentary on their most critical accounting policies and estimates. The SEC has defined critical accounting policies as the ones that are most important to the portrayal of a companys financial condition and operating results, and require management to make its most significant estimates and judgments in the preparation of its Consolidated Financial Statements. The SEC has defined critical accounting estimates as those estimates made in accordance with generally accepted accounting principles that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on the financial condition or results of operations of a company.\nJudgments, assumptions, and estimates are used for, but not limited to, the allowances for accounts receivable; inventory allowances; business combinations, goodwill, intangible assets, and other long-lived assets; revenue; income tax reserves; deferred income taxes; stock-based compensation; as well as discount and return rates used to calculate pension obligations. The accounting policies described below are significantly affected by critical accounting estimates.\nBusiness Combinations\nWe assign the value of the consideration transferred to acquire a business to the tangible assets and identifiable intangible assets acquired, and liabilities assumed on the basis of their fair values at the date of acquisition. The Company assesses the fair value of assets, including intangible assets, using a variety of methods, and each asset is measured at fair value from the perspective of a market participant. The method used to estimate the fair values of intangible assets incorporates significant assumptions regarding the estimates a market participant would make in order to evaluate an asset, including a market participants use of the asset and the appropriate discount rates for a market participant. Assets recorded from the perspective of a market participant that are determined to not have economic use for the Company are expensed immediately. Any excess purchase price over the fair value of the net tangible and intangible assets acquired is allocated to goodwill. Transaction costs and restructuring costs associated with a transaction to acquire a business are expensed as incurred.\nImpact of Inflation\nThe Companys relative gross margin and sales mix was negatively impacted by continued global raw material inflationary pressures during fiscal 2022. Chase continues to work with our customers and suppliers in an effort to counteract margin compression in the form of sales price increases. In the event of significant inflation over an extended period of time, our continued efforts to recover cost increases could be hampered as a result of the competitive nature of the industries in which we operate. Future volatility of general price inflation or deflation and raw material cost and availability could adversely affect our financial results. Item 7a - Quantitative and Qualitative Disclosures about Market Risk\nWe limit the amount of credit exposure to any one issuer. At August 31, 2022, other than our restricted investments (which are restricted for use in a non-qualified retirement savings plans for certain key employees and members of the Board of Directors), all of our funds were either in demand deposit accounts or investment instruments that meet high credit quality standards such as money market funds, government securities, or commercial paper.\nOur domestic operations have limited currency exposure since substantially all transactions are denominated in U.S. dollars. However, our European and Asian operations are subject to currency exchange fluctuations. We continue to review our policies and procedures to control this exposure while maintaining the benefit from these operations and sales not denominated in U.S. dollars. The effect of an immediate hypothetical 10% change in the exchange rate between the British pound or euro and the U.S. dollar would not have a material effect on the Companys overall liquidity. As of August 31, 2022, the Company had cash balances in the following foreign currencies (with USD equivalents in thousands):\nCurrency Code\nCurrency Name\nUSD Equivalent at August 31, 2022\nGBP\nBritish Pound\n$\n16,782\nEUR\nEuro\n$\n6,645\nCAD\nCanadian Dollar\n$\n2,616\nCNY\nChinese Yuan\n$\nINR\nIndian Rupee\n$\nThe Company will continue to review its current cash balances denominated in foreign currency considering current tax guidelines, including the impact of the Tax Act to the U.S. Internal Revenue Code, working capital requirements, infrastructure improvements and potential acquisitions.\nThe Company recognized a foreign currency translation loss for the year ended August 31, 2022 in the amount of $9,582,000 related to our European and Indian operations, which is recorded in accumulated other comprehensive income (loss) within our consolidated statement of equity. The functional currency for all our other operations is the U.S. Dollar. We do not have or utilize any derivative financial instruments.\nWe pay interest on our outstanding long-term debt at interest rates that fluctuate based upon changes in various base interest rates. There were $180,000,000 and $0 outstanding balances of long-term debt at August 31, 2022 and 2021, respectively. See Item 7 - Managements Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Sources of Capital, Note 6 - Long-Term Debt and Note 16 - Fair Value Measurements to the Consolidated Financial Statements for additional information regarding our outstanding long-term debt. The effect of an immediate hypothetical 10% change in variable interest rates would not have a material effect on our Consolidated Financial Statements. Item 8 - Financial Statements and Supplementary Data\nThe following Consolidated Financial Statements of Chase Corporation are filed as part of this Annual Report on Form 10-K:\nIndex to Consolidated Financial Statements:\nPage No.\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 248)\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Operations for each of the three fiscal years in the period ended August 31, 2022\nConsolidated Statements of Comprehensive Income for each of the three fiscal years in the period ended August 31, 2022\nConsolidated Statements of Equity for each of the three fiscal years in the period ended August 31, 2022\nConsolidated Statements of Cash Flows for each of the three fiscal years in the period ended August 31, 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nChase Corporation\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of Chase Corporation (a Massachusetts corporation) and subsidiaries (the Company) as of August 31, 2022 and 2021, the related consolidated statements of operations, comprehensive income, equity, and cash flows for each of the three years in the period ended August 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended August 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of August 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated November 10, 2022 expressed an unqualified opinion.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2019\nBoston, Massachusetts\nNovember 10, 2022\nCHASE CORPORATION\nCONSOLIDATED BALANCE SHEETS\nIn thousands, except share and per share amounts\nAugust 31,\nAugust 31,\nASSETS\nCurrent Assets\nCash and cash equivalents\n$\n315,495\n$\n119,429\nAccounts receivable, less allowances of $610 and $451\n51,540\n46,212\nInventory\n63,039\n41,217\nPrepaid expenses and other current assets\n4,374\n2,851\nPrepaid income taxes and refunds due\n2,329\n3,255\nTotal current assets\n436,777\n212,964\nProperty, plant and equipment, less accumulated depreciation of $52,503 and $50,666\n24,248\n24,267\nOther Assets\nGoodwill\n95,160\n97,866\nIntangible assets, less accumulated amortization of $101,237 and $91,484\n33,661\n46,954\nCash surrender value of life insurance\n4,450\n4,450\nRestricted investments\n2,367\n2,260\nDeferred income taxes\n5,763\n5,265\nOperating lease right-of-use assets\n8,596\n9,312\nOther assets\nTotal assets\n$\n611,580\n$\n404,159\nLIABILITIES AND EQUITY\nCurrent Liabilities\nAccounts payable\n$\n20,122\n$\n19,575\nAccrued payroll and other compensation\n6,381\n7,179\nIncome taxes payable\nAccrued expenses\n8,271\n5,407\nTotal current liabilities\n35,328\n32,922\nLong-term debt\n180,000\n-\nOperating lease long-term liabilities\n6,618\n7,202\nDeferred compensation\n2,375\n2,267\nAccumulated pension obligation\n7,431\n9,416\nOther liabilities\n2,897\n2,537\nDeferred income taxes\n2,282\n3,301\nAccrued income taxes\n1,820\n2,190\nTotal liabilities\n$\n238,751\n$\n59,835\nCommitments and contingencies (Note 21)\nEquity\nFirst Serial Preferred Stock, $1.00 par value: Authorized 100,000 shares; none issued\n-\n-\nCommon stock, $.10 par value: Authorized 20,000,000 shares; 9,462,765 shares at August 31, 2022 and 9,447,905 shares at August 31, 2021 issued and outstanding\nAdditional paid-in capital\n21,409\n18,959\nAccumulated other comprehensive loss\n(20,367)\n(11,210)\nRetained earnings\n370,840\n335,629\nTotal equity\n372,829\n344,324\nTotal liabilities and equity\n$\n611,580\n$\n404,159\nSee accompanying notes to the Consolidated Financial Statements.\nCHASE CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\nIn thousands, except share and per share amounts\nYears Ended August 31,\nRevenue\nSales\n$\n322,462\n$\n289,802\n$\n257,742\nRoyalties and commissions\n3,198\n3,534\n3,420\n325,660\n293,336\n261,162\nCosts and Expenses\nCost of products and services sold\n202,708\n174,660\n161,615\nSelling, general and administrative expenses\n54,438\n52,100\n49,364\nResearch and product development costs\n4,415\n4,056\n4,007\nOperations optimization costs (Note 20)\nAcquisition-related costs (Note 14)\n4,000\nGain on sale of real estate (Note 19)\n-\n-\n(2,551)\nWrite-down of certain assets under construction (Note 20)\n-\nLoss on contingent consideration (Note 14)\n1,664\n-\nOperating income\n58,825\n59,651\n47,241\nInterest expense\n(425)\n(297)\n(246)\nOther income (expense)\n(760)\n(1,675)\nIncome before income taxes\n58,598\n58,594\n45,320\nIncome taxes (Note 7)\n13,927\n13,674\n11,163\nNet income\n$\n44,671\n$\n44,920\n$\n34,157\nNet income available to common shareholders, per common and common equivalent share (Note 17)\nBasic\n$\n4.72\n$\n4.75\n$\n3.62\nDiluted\n$\n4.70\n$\n4.73\n$\n3.59\nWeighted average shares outstanding\nBasic\n9,399,085\n9,383,085\n9,359,940\nDiluted\n9,434,341\n9,428,416\n9,439,750\nAnnual cash dividends declared per share\n$\n1.00\n$\n0.80\n$\n0.80\nSee accompanying notes to the Consolidated Financial Statements.\nCHASE CORPORATION\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nIn thousands, except share and per share amounts\nYears Ended August 31,\nNet income\n$\n44,671\n$\n44,920\n$\n34,157\nOther comprehensive income (loss):\nNet unrealized (loss) gain on restricted investments, net of tax\n(354)\nChange in funded status of pension plans, net of tax\n(658)\nForeign currency translation adjustment\n(9,582)\n1,295\n3,163\nTotal other comprehensive income (loss)\n(9,157)\n1,882\n2,620\nComprehensive income\n$\n35,514\n$\n46,802\n$\n36,777\nSee accompanying notes to the Consolidated Financial Statements.\nCHASE CORPORATION\nCONSOLIDATED STATEMENTS OF EQUITY\nIn thousands, except share and per share amounts\nAdditional\nAccumulated Other\nTotal\nCommon Stock\nPaid-In\nComprehensive\nRetained\nStockholders'\nShares\nAmount\nCapital\nIncome (Loss)\nEarnings\nEquity\nBalance at August 31, 2019\n9,400,748\n$\n$\n14,351\n$\n(14,324)\n$\n270,260\n$\n271,227\nRestricted stock grants, net of forfeitures\n45,621\n(5)\n-\nAmortization of restricted stock grants\n2,290\n2,290\nAmortization of stock option grants\nExercise of stock options\n3,618\n-\nCommon stock received for payment of stock option exercises\n(1,057)\n-\n(123)\n(123)\nCommon stock retained to pay statutory minimum withholding taxes on common stock\n(9,848)\n(1)\n(880)\n(881)\nCash dividend paid, $0.80 per share\n(7,539)\n(7,539)\nChange in funded status of pension plans, net of tax ($215)\n(658)\n(658)\nForeign currency translation adjustment\n3,163\n3,163\nNet unrealized gain on restricted investments, net of tax $40\nAdoption of ASU 2018-02 (Note 1)\n(1,388)\n1,388\n-\nNet income\n34,157\n34,157\nBalance at August 31, 2020\n9,439,082\n$\n$\n16,674\n$\n(13,092)\n$\n298,266\n$\n302,792\nRestricted stock grants, net of forfeitures\n10,245\n(2)\n-\nAmortization of restricted stock grants\n2,351\n2,351\nAmortization of stock option grants\nExercise of stock options\n7,546\nCommon stock received for payment of stock option exercises\n(1,809)\n-\n(206)\n(206)\nCommon stock retained to pay statutory minimum withholding taxes on common stock\n(7,159)\n(1)\n(777)\n(778)\nCash dividend paid, $0.80 per share\n(7,557)\n(7,557)\nChange in funded status of pension plans, net of tax $585\nForeign currency translation adjustment\n1,295\n1,295\nNet unrealized gain on restricted investments, net of tax $75\nNet income\n44,920\n44,920\nBalance at August 31, 2021\n9,447,905\n$\n$\n18,959\n$\n(11,210)\n$\n335,629\n$\n344,324\nRestricted stock grants, net of forfeitures\n20,615\n(2)\n-\nAmortization of restricted stock grants\n2,255\n2,255\nAmortization of stock option grants\nExercise of stock options\n2,533\n-\nCommon stock received for payment of stock option exercises\n(435)\n-\n(40)\n(40)\nCommon stock retained to pay statutory minimum withholding taxes on common stock\n(7,853)\n(1)\n(695)\n(696)\nCash dividend on common stock, $1.00 per share\n(9,460)\n(9,460)\nChange in funded status of pension plans, net of tax $255\nForeign currency translation adjustment\n(9,582)\n(9,582)\nNet unrealized gain (loss) on restricted investments, net of tax $116\n(354)\n(354)\nNet income\n44,671\n44,671\nBalance at August 31, 2022\n9,462,765\n$\n$\n21,409\n$\n(20,367)\n$\n370,840\n$\n372,829\nSee accompanying notes to the Consolidated Financial Statements.\nCHASE CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nIn thousands\nYears Ended August 31,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet income\n$\n44,671\n$\n44,920\n$\n34,157\nAdjustments to reconcile net income to net cash provided by operating activities\nGain on sale of real estate\n-\n-\n(2,551)\nWrite-down of certain assets under construction\n-\nLoss on contingent consideration\n1,664\n-\nDepreciation\n3,547\n3,946\n4,015\nAmortization\n11,751\n12,858\n11,576\nProvision for allowance for doubtful accounts\n(307)\nStock-based compensation\n3,147\n2,978\n3,208\nRealized gain on restricted investments\n(96)\n(65)\n(37)\nPension curtailment and settlement loss\n-\n-\nDeferred taxes\n(1,023)\n(908)\n(769)\nIncrease (decrease) from changes in assets and liabilities\nAccounts receivable\n(6,580)\n(7,921)\n3,092\nInventory\n(22,645)\n(910)\n3,562\nPrepaid expenses and other assets\n(1,395)\n(490)\nAccounts payable\n6,164\nAccrued compensation and other expenses\n1,506\n(1,865)\nAccrued income taxes\n(2,084)\nNet cash provided by operating activities\n34,859\n61,217\n55,734\nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchases of property, plant and equipment\n(3,938)\n(2,441)\n(1,371)\nPayments for acquisitions\n-\n(31,238)\n-\nProceeds from sale of real estate\n-\n-\n3,615\nChanges in restricted investments\n(489)\n(248)\n(167)\nNet cash (used) provided in investing activities\n(4,427)\n(33,927)\n2,077\nCASH FLOWS FROM FINANCING ACTIVITIES\nBorrowings on debt\n180,000\n-\n-\nDividend paid\n(9,460)\n(7,557)\n(7,539)\nProceeds from exercise of common stock options\n-\n-\nPayments of taxes on stock options and restricted stock\n(695)\n(778)\n(881)\nNet cash provided (used) in financing activities\n169,845\n(8,248)\n(8,420)\nINCREASE IN CASH & CASH EQUIVALENTS\n200,277\n19,042\n49,391\nEffect of foreign exchange rates on cash\n(4,211)\n1,319\n1,906\nCASH AND CASH EQUIVALENTS, BEGINNING OF PERIOD\n119,429\n99,068\n47,771\nCASH AND CASH EQUIVALENTS, END OF PERIOD\n$\n315,495\n$\n119,429\n$\n99,068\nSee Note 13 for supplemental cash flow information including non-cash financing and investing activities\nSee accompanying notes to the Consolidated Financial Statements.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 1-Summary of Significant Accounting Policies\nThe principal accounting policies of Chase Corporation (the Company) and its subsidiaries are as follows:\nProducts and Markets\nOur principal products are specialty tapes, laminates, adhesives, sealants, coatings and chemical intermediates that are sold by our salespeople, manufacturers' representatives and distributors.\nIn our Adhesives, Sealants and Additives segment, these products consist of:\n(i) moisture protective coatings and cleaning solutions, which are sold to the electronics industry for circuitry manufacturing, including circuitry used in automobiles, industrial controls and home appliances;\n(ii) advanced adhesives, sealants, and coatings for automotive and industrial applications that require specialized bonding, encapsulating, environmental protection, or thermal management functionality;\n(iii) polymeric microspheres utilized by various industries to allow for weight and density reduction and sound dampening;\n(iv) polyurethane dispersions utilized for various coating products; and\n(v) superabsorbent polymers utilized for water and liquid management, remediation and protection in diverse markets including wire and cable, medical, environmental, infrastructure, energy and consumer products.\nIn our Industrial Tapes segment, these products consist of:\n(i)\ninsulating and conducting materials for the manufacture of electrical and telephone wire and cable, electrical splicing, and terminating and repair tapes, which are marketed to wire and cable manufacturers;\n(ii)\nlaminated film foils, including EMI/RFI shielding tapes, used in communication and local area network (LAN) cable;\n(iii) industrial coated or laminate products and custom manufacturing services sold into medical, consumer, automotive, packaging, energy, telecommunications and other specialized markets;\n(iv) laminated durable papers, including laminated paper with an inner security barrier used in personal and mail-stream privacy protection, which are sold primarily to the envelope converting and commercial printing industries;\n(v) pulling and detection tapes used in the installation, measurement and location of fiber optic cable, water and natural gas lines, and power, data and video cable for commercial buildings; and\n(vi) cover tapes with reliable adhesive and anti-static properties essential to delivering semiconductor components via tape and reel packaging.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nIn our Corrosion Protection and Waterproofing segment, these products consist of:\n(i) protective coatings, tapes and protectants for pipelines, valves, casings and other metals, which are sold to oil companies, gas companies and water/wastewater utilities for use in both the construction and maintenance of oil, gas, water and wastewater pipelines;\n(ii) fluid applied coating and lining systems for use in the water and wastewater industry;\n(iii) waterproofing tapes and coatings used in waterproofing of the exterior of both commercial and industrial structures;\n(iv) waterproofing membranes for highway bridge deck metal supported surfaces, which are sold to municipal transportation authorities, and high-performance polymeric asphalt additives; and\n(v) expansion and control joint systems designed for roads, bridges, stadiums and airport runways.\nBasis of Presentation\nThe financial statements include the accounts of the Company and its wholly-owned subsidiaries. All intercompany transactions and balances have been eliminated in consolidation. The Company uses the U.S. dollar as the functional currency for financial reporting. Certain reclassifications have been made to the prior year amounts to conform to the current years presentation.\nOther Business Developments\nOn September 1, 2022, the Company completed its acquisition of NuCera Solutions, a recognized global leader in the production and development of highly differentiated specialty polymers and polymerization technologies serving demanding applications, offering products critical to enabling end-product functionality, performance and reliability. The aggregate purchase price was $250,000, pending any working capital adjustments and excluding acquisition-related costs. Chase will continue to market under the NuCera brands and the business will be integrated into Chases Adhesives, Sealants and Additives reporting unit.\nThe Company completed the relocation of its corporate headquarters to another location within Westwood, MA during the fiscal year ending August 31, 2022. The move, part of the Companys ongoing consolidation and optimization initiative, capitalizes on the hybrid work model utilized by many of Chases corporate and administrative employees and is expected to provide future operational cost savings. The new facility also consolidates and houses research and development operations previously conducted at the previous Westwood, MA and Woburn, MA locations. Operations optimization costs related to the Westwood move of $232 were expensed in fiscal 2022. No future costs related to the move are anticipated.\nDuring the third quarter of fiscal 2021, Chase announced to the employees at its Woburn, MA location that its adhesives systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, would be consolidating into the Companys existing O'Hara Township, PA location. This rationalization and consolidation initiative aligns with the announcement in the second quarter of fiscal 2021 of the Companys plan to move its sealant systems production from Newark, CA to Hickory, NC, described in more detail below. Chase Corporation obtained both the adhesive and sealants systems as part of its fiscal 2017 acquisition of the operations of Resin Designs. The Company expensed $463 and $0 in fiscal 2022 and 2021, related to the move, and future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nDuring the second quarter of fiscal 2021, Chase began moving the sealant systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, from its Newark, CA location to its Hickory, NC facility. This is in line with the Companys ongoing initiative to consolidate its manufacturing plants and streamline its existing processes. The sealant systems operations and Newark, CA location came to Chase Corporation as part of the fiscal 2017 acquisition of the operations of Resin Designs, and the Companys lease there terminated in fiscal 2021. The Company recognized $977 in expense related to the move during the fiscal year ended August 31, 2021 and $147 in expense during the fiscal year ended August 31, 2022. The project is now substantially completed and any future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nOn February 5, 2021, the Company acquired certain assets of Emerging Technologies, Inc. (ETi), a superabsorbent polymers solutions provider, located in Greensboro, NC. The business was acquired for a purchase price of $9,997, comprising $8,997 paid on February 5, 2021 and an accrual of $1,000 to be paid out up to eighteen months after purchase, subsequent to final working capital adjustments, and excluding acquisition-related costs. As part of this transaction, Chase acquired substantially all working capital and fixed assets of the business and entered a multi-year lease at ETis existing location. The Company expensed $128 of acquisition-related costs associated with this acquisition. The purchase was funded with available cash on hand. ETi is a solutions provider and formulator of absorbent polymers for use in the packaging, recreational, consumer, and sanitation markets. The acquisition broadens the Companys superabsorbent polymers product offerings and formulation capabilities while expanding its market reach. The Company finalized purchase accounting, regarding a final allocation of the purchase price to tangible and identifiable intangible assets assumed, and anticipates completion within the first quarter of fiscal 2022. Since the effective date of the acquisition, the financial results of ETis acquired operations have been included in the Companys financial statements within the functional additives product line, contained within the Adhesives, Sealants and Additives operating segment.\nOn September 1, 2020 (the first day of fiscal 2021), the Company acquired all the capital stock of ABchimie for €18,654 (approximately $22,241 at the time of the transaction) net of cash acquired, subsequent to final working capital adjustment, excluding acquisition-related costs totaling $274 recognized in fiscal 2020 and with a potential earn out based on performance potentially worth an additional €7,000 (approximately $8,330 at the time of the transaction). ABchimie is a Corbelin, France headquartered solutions provider for the cleaning and protection of electronic assemblies, with ‎further formulation, production, and research and development capabilities‎. The transaction was funded with cash on hand. The financial results of the business were included in the Company's fiscal 2021 financial statements within the Adhesives, Sealants and Additives operating segment in the electronic and industrial coatings product line. The Company finalized purchase accounting during the fourth quarter of fiscal 2021, with no significant change to amounts initially recorded.\nFiscal 2020 saw the beginning of the global spread of the coronavirus pandemic (COVID-19), which grew to create significant volatility, uncertainty and global economic disruption. During the third fiscal quarter of 2020, the Company implemented changes to its cost structure designed to address market changes brought on by COVID-19 and demonstrate its commitment to fiscal prudence: (a) the Company made a targeted reduction in its global workforce, contemplated pre-pandemic but catalyzed by COVID-19, which resulted in the recognition of $183 in severance costs during the period; and (b) the Company also instituted a temporary 20% reduction in the base salaries of its named executive officers and select members of senior management, as well as the cash compensation of the non-employee members of its Board of Directors. The reduction in force, which impacted operations in the Companys U.S. facilities, and the adjustments in compensation, were both effective May 2020. The executive officers and Board of Directors temporary compensation reductions were lifted on December 1, 2020, retroactive to September 1, 2020.\nDuring the first quarter of fiscal 2020, the Company commissioned third party led studies regarding the potential upgrading of the Companys current worldwide ERP system. Chase Corporation reviewed the data and recommendations provided by the study and has made the decision upgrade (beginning in fiscal 2023) from our current\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nOracle Legacy ERP System with to Oracle Fusion Cloud Platform. This upgrade will position us with a more advanced system to support business expansion, access to upgrades in functionality, and a more modern system for operations, all within the Oracle Ecosystem. Additionally, the upgrade will be a multi-year, phased in approach that will mitigate any disruptions to our business. The Company recognized $150 in third party studies in fiscal 2020 and no costs were recognized in fiscal 2022 and 2021.\nDuring the third quarter of fiscal 2019, the Company began moving the pulling and detection operations housed in its Granite Falls, NC location to its Hickory, NC facility. This is in line with the Companys ongoing initiative to consolidate its manufacturing plants and streamline its existing processes. At the time, the pulling and detection operations were the only Chase-owned production operations in Granite Falls, NC, with the remaining portions of the building being either utilized for research and development or leased to a third party. The process of moving, including moving internal research and development capabilities, was substantially completed during the second quarter of fiscal 2020. The Company recognized $559 in expense related to the first half of fiscal 2020, having recognized $526 in expense during the second half of fiscal 2019. No costs were recognized in the second half of 2020 or during fiscal 2021, and future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nDuring the fourth quarter of fiscal 2019, Chase Corporation commissioned engineering studies of certain legacy operations, machinery and locations related to the Companys ongoing facility rationalization and consolidation initiative. Chase completed its review of the data and recommendations provided by the study in the fourth quarter of fiscal 2020. The Company recognized $200 in expense related to these services in fiscal 2019, and a gain of $170 in fiscal 2020, as certain amounts expensed in fiscal 2019 were refunded. Also in the fourth quarter of fiscal 2020 and related to the recommendations of the commissioned engineering studies, the Company wrote down the value of certain non-operating production assets related to the pipeline coatings product line, within the Corrosion Protection and Waterproofing segment. Given the nature and prospects of the equipment, the Company determined its then carrying value exceeded its fair value and recognized an expense of $405 related to the machinery. The Company recognized an additional $100 in the fourth quarter of fiscal 2021, to fully write-down the equipments value. Chase may utilize third party engineering, IT and other professional services firms in the future for similar optimization-related work. Given the ongoing nature of the facility rationalization and consolidation initiative, an estimate of future costs cannot currently be determined.\nOn June 25, 2018, the Company announced to its employees the planned closing of its Pawtucket, RI manufacturing facility effective August 31, 2018. This is in line with the Companys ongoing efforts to consolidate its manufacturing plants and streamline its existing processes. The manufacture of products previously produced in the Pawtucket, RI facility was substantially moved to Company facilities in Oxford, MA and Lenoir, NC during a two-month transition period. In the fourth quarter of fiscal 2018, the Company expensed $1,272 related to the closure. The Company also recognized $260 in expense related to the move in the three-month period ended November 30, 2018, with no additional expense recognized in the remainder of fiscal 2019. The Company completed the sale of its Pawtucket, RI location to a third party in the third quarter of fiscal 2020 for net proceeds totaling $1,810, recognizing a gain on sale of real estate of $760. Also, during the third quarter of fiscal 2020, the Company recognized $85 in final Pawtucket, RI transition and exit costs, with no further costs related to this initiative anticipated in future periods.\nThe Company has evaluated events and transactions subsequent to the balance sheet date. Based on this evaluation, and other than the cash dividend announced on November 10, 2022 of $1.00 per share to shareholders of record on November 30, 2022 and payable on December 9, 2022, the Company is not aware of any other events or transactions that occurred subsequent to the balance sheet date, but prior to filing, that would require recognition or disclosure in its consolidated financial statements.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nCash and cash equivalents consist primarily of demand deposit accounts or investment instruments that meet high credit quality standards such as money market funds, government securities, or commercial paper. The Company considers all highly liquid debt instruments purchased with an original maturity of three months or less from the date of purchase to be cash equivalents.\nCredit risk related to cash and cash equivalents is limited based on the creditworthiness of the financial institutions at which these funds are held. We maintain cash balances in multiple banks. Accounts located in the United States are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250. Certain of our account balances exceed the FDIC limit. Cash balances held outside the United States totaled $28,951 as of August 31, 2022.\nAccounts Receivable\nAs a result of the adoption of ASU 2016-13, the Company has updated its critical accounting policy related to trade accounts receivable and allowances for credit losses effective September 1, 2020 as follows:\nAll trade accounts receivable are reported net of allowances for credit losses. The allowances for credit losses represent managements best estimate of the credit losses expected from our trade accounts receivable over the life of the underlying assets. Assets with similar risk characteristics are pooled together for determination of their current expected credit losses. The Company regularly performs detailed reviews of our pooled assets to evaluate the collectability of receivables based on a combination of past, current, and future financial and qualitative factors that may affect customers ability to pay. In circumstances where the Company is aware of a specific customers inability to meet its financial obligations, a specific reserve is recorded against amounts due to reduce the recognized receivable to the amount reasonably expected to be collected. Receivables are written off against these reserves in the period they are determined to be uncollectable.\nPrior to September 1, 2020, the Company evaluated the collectability of accounts receivable balances based on a combination of factors. In cases where the Company was aware of circumstances that may have impaired a specific customers ability to meet its financial obligations to it, a specific allowance against amounts due to the Company was recorded, and thereby reduced the net recognized receivable to the amount the Company reasonably believed would be collected. For all other customers, the Company recognized allowances for doubtful accounts based on the length of time the receivables were past due, industry and geographic factors, the current business environment and its historical experience.\nInventory\nThe Company values inventory at the lower of cost or net realizable value using the first in, first out (FIFO) method. Management assesses the recoverability of inventory based on types and levels of inventory held, forecasted demand and changes in technology. These assessments require management judgments and estimates, and valuation adjustments for excess and obsolete inventory may be recorded based on these assessments. We estimate excess and obsolescence exposures based upon assumptions about future demand, product transitions, and market conditions, and\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nrecord adjustments to reduce inventories to their estimated net realizable value. The failure to accurately forecast demand may lead to additional excess and obsolete inventory and future charges.\nGoodwill\nThe Company accounts for goodwill in accordance with ASC Topic 350, Intangibles - Goodwill and Other. The Company performs impairment reviews annually each fourth quarter and whenever events or circumstances indicate the carrying value of goodwill may not be recoverable.\nThe Company has adopted Accounting Standards Update (ASU) No. 2017-04 Intangibles - Goodwill and Other Topics (Topic 350): Simplifying the Test for Goodwill Impairment. When evaluating the potential impairment of goodwill, Chase first assesses a range of qualitative factors, including but not limited to, industry conditions, the competitive environment, changes in the market for our products and services, entity-specific factors such as strategy and changes in key personnel, and the overall financial performance for each of our reporting units relative to historical or projected future operating results. If after completing this assessment, it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, we then assess goodwill for impairment by comparing the fair value of the reporting unit to its carrying amount. If the fair value of a reporting unit is less than its carrying value, an impairment loss, limited to the amount of goodwill allocated to that reporting unit, is recorded. Fair values for reporting units are determined based on the income approach (discounted cash flow method).\nFor the annual fiscal 2022 fourth quarter review, no goodwill impairment, nor at-risk reporting units, was indicated as of August 31, 2022. For the annual fiscal 2022 goodwill impairment test, we performed a qualitative assessment of goodwill impairment and concluded that it was more likely than not that our reporting units' fair values exceeded their carrying values (i.e. indicated no impairment of goodwill). Accordingly, it was not necessary for us to perform the quantitative analysis.\nIntangible Assets\nIntangible assets consist of patents, formulas, trade names, customer relationships and trademarks. The Company capitalizes costs related to patent applications and technology agreements. The costs of these assets are amortized over the lesser of the useful life of the asset or its statutory life. Capitalized costs are periodically reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of the asset may not be recoverable.\nProperty, Plant and Equipment\nProperty, plant and equipment are stated at cost and depreciated using the straight-line method over the assets estimated useful lives. Expenditures for maintenance repairs and minor renewals are charged to expense as incurred. Betterments and major renewals are capitalized. Upon retirement or other disposition of assets, related allowances for depreciation and amortization are eliminated from the accounts and any resulting gain or loss is included in the determination of income or loss. The estimated useful lives of property, plant and equipment are as follows:\nBuildings and improvements\nto\nyears\nMachinery and equipment\nto\nyears\nLeasehold improvements are depreciated over the lesser of the useful life or the term of the lease.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nRestricted Investments and Deferred Compensation\nThe Company has a non-qualified deferred savings plan that covers its Board of Directors and a separate plan covering selected employees. Participants may elect to defer a portion of their compensation for payment in a future tax year. The plans are funded by trusteed assets that are restricted to the payment of deferred compensation or satisfaction of the Companys general creditors. The Companys restricted investments under the plans were $2,367 and $2,260 at August 31, 2022 and 2021, respectively, and corresponding deferred compensation liabilities were $2,375 and $2,267 at August 31, 2022 and 2021, respectively. The Company accounts for the restricted investments as available for sale by recording net unrealized gains or losses in other comprehensive income as a component of stockholders equity.\nRevenue\nThe Company accounts for revenue using ASC Topic 606 Revenue from Contracts with Customers. The Company accounts for revenue when: (a) there is approval and commitment from both parties; (b) the rights of the parties are identified; (c) payment terms are identified; (d) the contract has commercial substance; and (e) collectability of consideration is probable. Revenue is primarily derived from customer purchase orders, master sales agreements, and negotiated contracts, all of which represent contracts with customers. See Note 15 to the consolidated financial statements for more information on our accounting for revenue.\nResearch and Product Development Costs\nResearch and product development costs are expensed as incurred and include primarily engineering salaries, overhead and materials used in connection with research and development projects. Research and development expense amounted to $4,415, $4,056 and $4,007 for the years ended August 31, 2022, 2021 and 2020, respectively, and was recorded within Research and product development costs on the consolidated statements of operations.\nPension Plans\nThe Company accounts for its pension plans following the requirements of ASC Topic 715, Compensation -Retirement Benefits (ASC 715). ASC 715 requires an employer to: (a) recognize in its statement of financial position the funded status of a benefit plan; (b) measure defined benefit plan assets and obligations as of the end of the employers fiscal year (with limited exceptions); and (c) recognize as a component of other comprehensive income, net of tax, the gains or losses and prior service costs or credits that arise but are not recognized as components of net periodic benefit costs pursuant to prior existing guidance.\nStock-Based Compensation\nIn accordance with the accounting for stock-based compensation guidance, ASC Topic 718 Compensation - Stock Compensation (ASC 718), the Company measures and recognizes compensation expense for all share-based payment awards made to employees, directors and consultants based on estimated fair values. This includes restricted stock, restricted stock units and stock options. The guidance allows for the continued use of the simplified method as the Company has concluded that its historical share option exercise experience does not provide a reasonable basis for estimating expected term.\nStock-based compensation expense recognized in fiscal years 2022, 2021 and 2020 was $3,147, $2,978 and $3,208, respectively.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe fair value of options granted was estimated on the date of grant using the Black-Scholes option pricing model with the following weighted average assumptions for the years ending August 31, 2022, 2021 and 2020:\nExpected dividend yield\n0.8\n%\n0.7\n%\n0.7\n%\nExpected life\n6.3\nyears\n6.0\nyears\n6.0\nyears\nExpected volatility\n38.7\n%\n39.5\n%\n31.0\n%\nRisk-free interest rate\n1.3\n%\n0.4\n%\n1.4\n%\nExpected volatility is determined by looking at a combination of historical volatility over the past six years as well as implied future volatility.\nTranslation of Foreign Currency\nThe financial position and results of operations of the Companys HumiSeal Europe Ltd and Chase Protective Coatings Ltd businesses are measured using the British pound as the functional currency. The financial position and results of operations of the Companys HumiSeal Europe SARL and ABchimie businesses in France are measured using euros as the functional currency. The financial position and results of the Companys HumiSeal India Private Limited business in India are measured using the Indian rupee as the functional currency. The functional currency for all our other operations is the U.S. dollar. Revenue and expenses of these international businesses have been translated at average exchange rates. Foreign currency translation gains and losses are determined using current exchange rates for monetary items and historical exchange rates for other balance sheet items, and are recorded as a change in other comprehensive income (a component of stockholders equity). Transaction gains and losses generated from the remeasurement of assets and liabilities denominated in currencies other than the functional currency of these international operations are included in other income (expense) on the consolidated statements of operations and were gains (losses) of $442, ($512) and ($911) for the fiscal years ended August 31, 2022, 2021 and 2020, respectively.\nIncome Taxes\nThe Company accounts for income taxes under the asset and liability method. Under this method, a deferred tax asset or liability is determined based upon the differences between the financial statement and tax bases of assets and liabilities as measured by the enacted tax rates that will be in effect when these differences reverse. Tax credits are recorded as a reduction in income taxes. Valuation allowances are provided if, based upon the weight of available evidence, it is more likely than not that some or all of the deferred tax assets will not be realized.\nThe Company estimates contingent income tax liabilities based on the guidance for accounting for uncertain tax positions as prescribed in ASC Topic 740, Income Taxes. See Note 7 for more information on the Companys income taxes, including information on the effects of the Tax Cuts and Jobs Act of 2017 (the Tax Act) on our financial position and results of operations.\nNet Income Per Share\nThe Company has unvested share-based payment awards with a right to receive nonforfeitable dividends, which are considered participating securities under ASC Topic 260, Earnings Per Share (ASC 260). The Company allocates earnings to participating securities and computes earnings per share using the two-class method.\nComprehensive Income\nComprehensive income is defined as the change in equity of a business enterprise during a period from transactions and other events and circumstances from non-owner sources, including foreign currency translation\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nadjustments, unrealized gains and losses on marketable securities and adjustments related to the change in the funded status of the pension plans.\nSegments\nASC Topic 280 Segment Reporting of the Financial Accounting Standards Board (FASB) codification establishes standards for reporting information about operating segments. The Company is organized into three reportable operating segments: Adhesives, Sealants and Additives; Industrial Tapes; and Corrosion Protection and Waterproofing. The segments are distinguished by the nature of the products manufactured and how they are delivered to their respective markets.\nThe Adhesives, Sealants and Additives segment offers innovative and specialized product offerings consisting of both end-use products and intermediates that are generally used in, or integrated into, another companys products. Demand for the segments product offerings is typically dependent upon general economic conditions. The Adhesives, Sealants and Additives segment leverages the core specialty chemical competencies of the Company, and serves diverse markets and applications. The segment sells predominantly into the transportation, appliances, medical, general industrial and environmental market verticals. The segments products include moisture protective coatings and cleaners and customized sealant and adhesive systems for electronics, polymeric microspheres, polyurethane dispersions and superabsorbent polymers. Beginning September 1, 2020 (first day of fiscal 2021), the Adhesives, Sealants and Additives segment includes the acquired operations of ABchimie, within the electronic and industrial coatings product line and beginning February 5, 2021, the acquired operations of Emerging Technologies, Inc. (ETi), within the functional additives product line.\nThe Industrial Tapes segment features wire and cable materials, specialty tapes, and other laminated and coated products. The segment derives its competitive advantage through its proven chemistries, diverse specialty offerings and the reliability its supply chain offers to end customers. These products are generally used in the assembly of other manufacturers products, with demand typically dependent upon general economic conditions. The Industrial Tapes segment sells mostly to established markets, with some exposure to growth opportunities through further development of existing products. Markets served include cable manufacturing, utilities and telecommunications, and electronics packaging. The segments offerings include insulating and conducting materials for wire and cable manufacturers, laminated durable papers, laminates for the packaging and industrial laminate markets, custom manufacturing services, pulling and detection tapes used in the installation, measurement and location of fiber optic cable and water and natural gas lines, and cover tapes essential to delivering semiconductor components via tape and reel packaging.\nThe Corrosion Protection and Waterproofing segment is principally composed of project-oriented product offerings that are primarily sold and used as Chase branded products. End markets include new and existing infrastructure projects on oil, gas, water and wastewater pipelines, highways and bridge decks, water and wastewater containment systems, and commercial buildings. The segments products include protective coatings for pipeline applications, coating and lining systems for waterproofing and liquid storage applications, adhesives and sealants used in architectural and building envelope waterproofing applications, high-performance polymeric asphalt additives, and expansion joint systems for waterproofing applications in transportation and architectural markets. With sales generally dependent on outdoor project work, the segment experiences highly seasonal sales patterns.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nContingent Consideration\nIn connection with accounting for the ABchimie acquisition on September 1, 2020, the Company recorded a contingent consideration liability included within Other liabilities on the consolidated balance sheet. The contingent consideration liability was valued using a Monte Carlo simulation model in an option pricing framework based on key inputs requiring significant judgments and estimates to be made by the Company, including forecasts of future earnings over the multiyear period encompassed by the earnout, and that are not all observable in the market, which represents a Level 3 measurement within the fair value hierarchy. The Company assesses the fair value of the contingent consideration liability at each reporting period. Any subsequent changes in the estimated fair value of the liability are reflected in Loss on contingent consideration on the consolidated statement of operations until the liability is settled. If fully realized, the contingent consideration due would total €7,000 (approximately $8,330 at the time of the initial transaction)\nRecently Adopted Accounting Standards\nFiscal 2022\nIn October 2021, the FASB issued ASU No. 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which amends the accounting for contract assets and contract liabilities from revenue contracts with customers in a business combination. The amendment requires that an entity acquiring the contract assets and contract liabilities in a business combination be recognized in accordance with ASU 2014-09, Revenue from Contracts with Customers (Topic 606). The ASU is effective for all public entities for fiscal years beginning after December 15, 2022, and interim periods therein. The Company early adopted ASU 2021-08 on February 28, 2022 and any impact on the consolidated financial statements will be dependent on the magnitude and nature of future acquired entities.\nFiscal 2021\nIn March 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting. The ASU applies to all entities that have contracts, hedging relationships, and other transactions that reference LIBOR or another reference rate expected to be discontinued because of reference rate reform. The ASU provides optional expedients and exceptions for applying generally accepted accounting principles (GAAP) to contracts, hedging relationships, and other transactions affected by reference rate reform if certain criteria are met. The expedients and exceptions provided by the ASU do not apply to contract modifications made and hedging relationships entered into or evaluated after December 31, 2022, except for hedging relationships existing as of December 31, 2022 for which an entity has elected certain optional expedients and that are retained through the end of the hedging relationship. The ASU is effective for all entities as of March 12, 2020 through December 31, 2022. ASU 2020-04 has not had, and the Company does not expect it to have in future periods, a material impact on the Company's consolidated financial statements and disclosures.\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which modifies the measurement approach for credit losses on financial assets measured on an amortized cost basis from an 'incurred loss' method to an 'expected loss' method. In November 2019, the FASB issued ASU 2019-11, Codification Improvements to Topic 326, Financial Instruments - Credit Losses. ASU 2019-11 is an accounting pronouncement that amends ASU 2016-13. This amendment provides clarity and improves the codification to ASU 2016-13. The pronouncements are concurrently effective for fiscal years beginning after December 15, 2019 and interim periods therein. The Company adopted ASU 2016-13 on September 1, 2020, using the modified retrospective transition method which resulted in no material impact on the consolidated financial statements.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nAs a result of the adoption of ASU 2016-13, the Company has updated its critical accounting policy related to trade accounts receivable and allowances for credit losses effective September 1, 2020 from the critical accounting policies previously disclosed in our audited financial statements for the year ended August 31, 2020 as follows:\nAll trade accounts receivable are reported net of allowances for credit losses. The allowances for credit losses represent managements best estimate of the credit losses expected from our trade accounts receivable over the life of the underlying assets. Assets with similar risk characteristics are pooled together for determination of their current expected credit losses. The Company regularly performs detailed reviews of our pooled assets to evaluate the collectability of receivables based on a combination of past, current, and future financial and qualitative factors that may affect customers ability to pay. In circumstances where the Company is aware of a specific customers inability to meet its financial obligations, a specific reserve is recorded against amounts due to reduce the recognized receivable to the amount reasonably expected to be collected.\nFiscal 2020\nIn February 2016, the FASB issued ASU No. 2016-02, Leases (Topic 842). Under the new guidance, lessees are required to recognize the following for all leases (with the exception of short-term leases) at the commencement date: (a) a lease liability, which is a lessees obligation to make lease payments arising from a lease, measured on a discounted basis; and (b) a right-of-use asset, which represents the lessees right to use, or control the use of, a specified asset for the lease term. In July 2018, the FASB issued ASU 2018-11, Leases (Topic 842) Targeted Improvements. The updated guidance provided an optional transition method, which allows for the application of the standard as of the adoption date with no restatement of prior period amounts. The Company adopted the standard on September 1, 2019 (start of fiscal 2020) under the optional transition method described above.\nThe new standard provides several optional practical expedients in transition. The Company has elected to apply the package of practical expedients which allows it to not reassess i) whether existing or expired arrangements contain a lease, ii) the lease classification of existing or expired leases, or iii) whether previous initial direct costs would qualify for capitalization under the new lease standard. In preparation for adoption of the standard, the Company enhanced its internal controls to enable the preparation of financial information including the assessment of the impact of the standard. The initial adoption of the ASU resulted in the recognition of additional lease liabilities of $9,644 ($2,071 short-term and $7,573 long-term) and right-of-use assets of $10,200 as of September 1, 2019 on the consolidated balance sheet as it relates to the Companys operating leases. The new standard did not have a material impact on the Companys consolidated statement of operations or cash flows.\nIn February 2018, the FASB issued ASU 2018-02, Income Statement - Reporting Comprehensive Income (Topic 220) - Reclassification of Certain Tax Effects from Accumulated Other Comprehensive Income. This ASU was issued to address a narrow-scope financial reporting issue that arose as a result of the enactment of the Tax Cuts and Jobs Act (Tax Reform) on December 22, 2017. The objective of ASU 2018-02 is to address the tax effects of items within accumulated other comprehensive income (referred to as stranded tax effects) that do not reflect the appropriate tax rate enacted in the Tax Reform. As a result, the ASU 2018-02 allows a reclassification from accumulated other comprehensive income to retained earnings for stranded tax effects resulting from the newly enacted federal corporate income tax rate. The amount of the reclassification would be the difference between the historical corporate income tax rate of 35 percent and the current enacted corporate income tax rate of 21 percent. ASU 2018-02 is effective for fiscal years beginning after December 15, 2018, with early adoption permitted, including adoption in an interim period. The amendments in this ASU may be applied retrospectively to each period in which the effect of the change in the U.S. Federal corporate income tax rate in the Tax Reform is recognized. Therefore, the Company adopted ASU 2018-02 in the first quarter of the year ending August 31, 2020, and has elected to reclassify the income tax effects of the Tax Reform related to its pension funding from accumulated other comprehensive loss to retained earnings.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 2-Inventory\nInventory consisted of the following as of August 31, 2022 and 2021:\nAugust 31,\nAugust 31,\nRaw materials\n$\n37,909\n$\n24,055\nWork in process\n9,569\n5,928\nFinished goods\n15,561\n11,234\nTotal Inventory\n$\n63,039\n$\n41,217\nNote 3-Property, Plant and Equipment\nProperty, plant and equipment consisted of the following as of August 31, 2022 and 2021:\nAugust 31,\nAugust 31,\nLand and improvements\n$\n4,994\n$\n5,020\nBuildings\n16,771\n16,904\nMachinery and equipment\n49,458\n49,505\nLeasehold improvements\n4,774\n2,891\nConstruction in progress\n76,751\n74,933\nAccumulated depreciation\n(52,503)\n(50,666)\nProperty, plant and equipment, net\n$\n24,248\n$\n24,267\nNote 4-Goodwill and Intangible Assets\nThe changes in the carrying value of goodwill, by operating segment, were as follows:\nAdhesives, Sealants and Additives\nIndustrial Tapes\nCorrosion Protection and Waterproofing\nConsolidated\nBalance at August 31, 2020\n$\n50,487\n$\n21,215\n$\n10,700\n$\n82,402\nAcquisition of ABchimie\n13,055\n-\n-\n13,055\nAcquisition of Emerging Technologies, Inc.\n2,451\n-\n-\n2,451\nForeign currency translation adjustment\n(48)\n-\n(42)\nBalance at August 31, 2021\n$\n65,945\n$\n21,215\n$\n10,706\n$\n97,866\nForeign currency translation adjustment\n(2,673)\n-\n(33)\n(2,706)\nBalance at August 31, 2022\n$\n63,272\n$\n21,215\n$\n10,673\n$\n95,160\nThe Companys goodwill is allocated to each reporting unit based on the nature of the products manufactured by the respective business combinations that originally created the goodwill. The Company has identified a total of three reporting units, corresponding to its three reportable operating segments that are used to evaluate the possible impairment of goodwill. Goodwill impairment exists when the carrying amount of goodwill exceeds its fair value. Assessments of possible impairment of goodwill are made when events or changes in circumstances indicate that the\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\ncarrying value of the asset may not be recoverable through future operations. Additionally, testing for possible impairment of recorded goodwill and certain intangible asset balances is required annually. The amount and timing of any impairment charges based on these assessments require the estimation of future cash flows and the fair market value of the related assets based on managements best estimates of certain key factors, including future selling prices and volumes; operating, raw material and energy costs; and various other projected operating and economic factors, including the on-going impact of the coronavirus disease 2019 (COVID-19) pandemic. When testing, fair values of the reporting units and the related implied fair values of their respective goodwill are established using discounted cash flows.\nThe Company adopted Accounting Standards Update (ASU) No. 2017-04 Intangibles - Goodwill and Other Topics (Topic 350): Simplifying the Test for Goodwill Impairment. When evaluating the potential impairment of goodwill, we first assess a range of qualitative factors, including but not limited to, industry conditions, the competitive environment, changes in the market for our products and services, entity-specific factors such as strategy and changes in key personnel, and the overall financial performance for each of our reporting units relative to historical or projected future operating results. If after completing this assessment, it is determined that it is more likely than not that the fair value of a reporting unit is less than its carrying value, we then assess goodwill for impairment by comparing the fair value of the reporting unit to its carrying amount. If the fair value of a reporting unit is less than its carrying value, an impairment loss, limited to the amount of goodwill allocated to that reporting unit, is recorded. Fair values for reporting units are determined based on the income approach (discounted cash flow method).\nThe Company performs impairment reviews annually each fourth quarter and whenever events or circumstances indicate the carrying value of goodwill may not be recoverable. For the annual fiscal 2022 goodwill impairment test, we performed a qualitative assessment of goodwill impairment and concluded that it was more likely than not that our reporting units' fair values exceeded their carrying values (i.e. indicated no impairment of goodwill). Accordingly, it was not necessary for us to perform the quantitative analysis.\nAs of August 31, 2022 and 2021, the Company had a total goodwill balance of $95,160 and $97,866, respectively, related to its acquisitions, of which $27,472 and $30,697 respectively, remained deductible for income taxes.\nIntangible assets subject to amortization consisted of the following as of August 31, 2022 and 2021:\nWeighted Average\nGross Carrying\nAccumulated\nNet Carrying\nAmortization Period\nValue\nAmortization\nValue\nAugust 31, 2022\nPatents and agreements\n14.6\nyears\n$\n1,760\n$\n1,724\n$\nFormulas and technology\n7.8\nyears\n10,730\n9,961\nTrade names\n5.9\nyears\n8,673\n8,407\nCustomer lists and relationships\n9.1\nyears\n113,735\n81,145\n32,590\n$\n134,898\n$\n101,237\n$\n33,661\nAugust 31, 2021\nPatents and agreements\n14.6\nyears\n$\n1,760\n$\n1,715\n$\nFormulas and technology\n7.9\nyears\n10,987\n9,769\n1,218\nTrade names\n5.9\nyears\n8,836\n8,285\nCustomer lists and relationships\n9.2\nyears\n116,855\n71,715\n45,140\n$\n138,438\n$\n91,484\n$\n46,954\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nAggregate amortization expense related to intangible assets for the years ended August 31, 2022, 2021 and 2020 was $11,751, $12,858, and $11,576, respectively. As of August 31, 2022 estimated amortization expense for the next five fiscal years is as follows:\nYears ending August 31,\n8,542\n7,334\n5,734\n4,937\n2,389\nNote 5-Cash Surrender Value of Life Insurance\nThe Company recognized cash surrender value of a life insurance policy with the following carrier as of August 31, 2022 and 2021:\nJohn Hancock\n$\n4,450\n$\n4,450\nCash surrender value of life insurance policies\n$\n4,450\n$\n4,450\nThe policy is subject to periodic review. The Company currently intends to maintain the policy through the life or retirement of the insured, and records at the premium paid balance.\nNote 6-Long-Term Debt\nLong-term debt consisted of the following at August 31, 2022 and 2021:\nAll-revolving credit facility with a borrowing capacity of $200,000\n180,000\n-\nLong-term debt\n$\n180,000\n$\n-\nOn July 27, 2021 (the fourth quarter of fiscal 2021), the Company entered into the Second Amended and Restated Credit Agreement (the Credit Agreement) by and among the Company and NEPTCO Incorporated (NEPTCO), each as borrowers, the guarantor subsidiaries party thereto, the financial institutions party thereto as Lenders, and Bank of America, N.A., as administrative agent, with participation from Wells Fargo Bank, N.A., PNC Bank, N.A. and JPMorgan Chase Bank, N.A. The Credit Agreement was entered into to amend, restate and extend the Companys preexisting Amended and Restated Credit Agreement (the Prior Credit Agreement), which had a maturity date of December 15, 2021, and to provide for additional liquidity to finance acquisitions, working capital and capital expenditures, and for other general corporate purposes. Under the Credit Agreement, Chase obtained an increased revolving credit loan (the Revolving Facility), with borrowing capabilities not to exceed $200,000 at any time, with the ability to request an increase in this amount by an additional $100,000 at the individual or collective option of any of the Lenders. The applicable interest rate for the Revolving Facility and Term Loan (defined below) is based on the effective London Interbank Offered Rate (LIBOR) plus a range of 1.00% to 1.75%, depending on the consolidated net leverage ratio of Chase and its subsidiaries. As of August 31, 2022, the Company had $180,000 in long-term debt attributed to the acquisition of NuCera Solutions that closed on September 1, 2022. The long-term debt has an applicable interest rate of 5.5%.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe Credit Agreement has a five-year term with interest payments due at the end of the applicable LIBOR period (but in no event less frequently than the three-month anniversary of the commencement of such LIBOR period) and principal payment due at the expiration of the agreement, July 27, 2026. The Credit Agreement contains provisions that may replace LIBOR as the benchmark index under certain circumstances. In addition, the Company may elect a base rate option for all or a portion of the Revolving Facility, in which case interest payments shall be due with respect to such portion of the Revolving Facility on the last business day of each quarter. Subject to certain conditions set forth in the Credit Agreement, the Company may elect to convert all or a portion of the outstanding Revolving Facility into a new term loan twice during the term of the Revolving Facility (each, a Term Loan, and collectively with the Revolving Facility, the Credit Facility), which Term Loan shall be payable quarterly in equal installments sufficient to amortize the original principal amount of such Term Loan on a ten year amortization schedule.\nThe outstanding balance on the Credit Facility is guaranteed by all of Chases direct and indirect domestic subsidiaries, which collectively had a carrying value of approximately $314,662 at August 31, 2022. The Credit Facility is subject to restrictive covenants under the Credit Agreement, and financial covenants that require Chase and its subsidiaries to maintain certain financial ratios on a consolidated basis, including a consolidated net leverage ratio of 3.25 to 1.00 and a consolidated interest coverage ratio of 3.50 to 1.00 (both defined in the Credit Agreement). Chase Corporation was in compliance with the debt covenants as of August 31, 2022. The Credit Agreement also places certain Lender-approval requirements as to the size of permitted acquisitions which may be entered into by the Company and its subsidiaries, and allows for a temporary step-up in the allowed consolidated leverage ratio for the four fiscal quarters ending after certain designated acquisitions. Prepayment is allowed by the Credit Agreement at any time during the term of the agreement, subject to customary notice requirements and the payment of customary LIBOR breakage fees.\nThe Prior Credit Agreement was an all-revolving credit facility with a borrowing capacity of $150,000, which could be increased by an additional $50,000 at the request of the Company and the individual or collective option of any of the lenders, and with an interest rate based on the effective LIBOR plus an additional amount in the range of 1.00% to 1.75%, depending on our consolidated net leverage ratio or, at the Companys option, at the banks base lending rate. It was substantially available at July 27, 2021, the time of its amendment and restatement.\nNote 7-Income Taxes\nThe Company has applied the U.S. statutory Federal rate of 21%, enacted as part of the Tax Cuts and Jobs Act (the Tax Act) in December 2017, for fiscal years end August 31, 2022, 2021 and 2020.\nIn fiscal 2019, the Company began recognizing an additional component of total Federal tax expense, the tax on Global Intangible Low-Taxed Income (GILTI) provision of the Tax Act, which became applicable to the Company in fiscal 2019. The Company elected to account for GILTI as a period cost, and therefore included GILTI expense in the effective tax rate calculation. This provision did not have a material effect on the effective tax rate for the years ended August 31, 2022, 2021 and 2020.\nThe Company concluded that the Base Erosion and Anti Abuse Tax (BEAT) provision of the Tax Act, which also became applicable to the Company in fiscal 2019, had no effect on our effective tax rate for fiscal 2022, 2021 or 2020.\nOn March 27, 2020, the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) was enacted in response to the COVID-19 pandemic. The CARES Act, among other things, included a technical correction to the Tax Act which will allow accelerated deductions for qualified improvement property. The Company is currently evaluating the impact of the CARES Act, but at present does not expect that the qualified improvement property correction nor other provisions of the CARES Act would result in a material tax benefit to us in future periods. The CARES Act had no material effect on the effective tax rate for fiscal 2022, 2021 and 2020.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nIn July 2020, the United States Internal Revenue Service (IRS) released final regulations (TD 9901) that ease documentation standards and provide greater flexibility for taxpayers claiming the deduction for Foreign-Derived Intangible Income (FDII). During fiscal 2022, the Companys effective tax rate included a FDII deduction benefit of $728. In addition, during fiscal 2022, the Company recognized $307 of tax benefit due to the expiration of statute of limitations.\nThe Inflation Reduction Act (\"IRA\") was enacted into law on August 16, 2022. Included in the IRA was a provision to implement a 15% corporate alternative minimum tax on adjusted financial statement income for applicable corporations and a 1% excise tax on repurchases of stock. These provisions are effective for tax years beginning after December 31, 2022. We are in the process of evaluating the provisions of the IRA, but we do not currently believe the IRA will have a material impact on our reported results, cash flows or financial position when it becomes effective.\nDomestic and foreign pre-tax income for the years ended August 31, 2022, 2021 and 2020 was:\nYear Ended August 31,\nUnited States\n$\n49,015\n$\n52,182\n$\n42,027\nForeign\n9,583\n6,412\n3,293\n$\n58,598\n$\n58,594\n$\n45,320\nThe provision (benefit) for income taxes for the years ended August 31, 2022, 2021 and 2020 was:\nYear Ended August 31,\nCurrent:\nFederal\n$\n10,346\n$\n11,677\n$\n9,157\nState\n2,589\n1,813\nForeign\n2,015\n2,123\nTotal current income tax provision\n14,950\n14,582\n11,932\nDeferred:\nFederal\n(775)\n(832)\n(520)\nState\n(124)\n(184)\nForeign\n(295)\n(65)\nTotal deferred income tax benefit\n(1,023)\n(908)\n(769)\nTotal income tax provision\n$\n13,927\n$\n13,674\n$\n11,163\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe provision (benefit) for income taxes differs from the amount computed by applying the Federal statutory income tax rate to income before income taxes. The Companys combined federal, state and foreign effective tax rate as a percentage of income before taxes for fiscal 2022, 2021 and 2020, net of offsets generated by federal, state and foreign tax benefits, was 23.8%, 23.3% and 24.6%, respectively. The following is a reconciliation of the effective income tax rate with the U.S. Federal statutory income tax rate for the years ended August 31, 2022, 2021 and 2020:\nYear Ended August 31,\nFederal statutory rates\n21.0\n%\n21.0\n%\n21.0\n%\nAdjustment resulting from the tax effect of:\nState and local taxes, net of federal benefit\n2.3\n%\n2.3\n%\n3.0\n%\nForeign tax rate differential\n(0.3)\n%\n(0.3)\n%\n0.0\n%\nAdjustment to uncertain tax position\n(0.5)\n%\n0.1\n%\n(1.1)\n%\nTransaction costs not deductible\n0.8\n%\n0.0\n%\n0.5\n%\nResearch credit generated\n(0.1)\n%\n(0.1)\n%\n(0.1)\n%\nStock Compensation\n0.0\n%\n(0.3)\n%\n(0.3)\n%\nPermanent items\n2.2\n%\n1.1\n%\n0.9\n%\nGILTI and Subpart F, net of foreign tax credit\n0.2\n%\n0.3\n%\n0.3\n%\nOther\n(0.3)\n%\n(0.4)\n%\n0.4\n%\nDeferred income tax remeasurement\n(0.5)\n%\n0.1\n%\n0.0\n%\nForeign Derived Intangible Income\n(1.2)\n%\n(1.1)\n%\n0.0\n%\nPerformance-based earnout contingency\n0.2\n%\n0.6\n%\n0.0\n%\nEffective income tax rate\n23.8\n%\n23.3\n%\n24.6\n%\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe following table summarizes the tax effects of temporary differences that give rise to significant portions of the deferred tax assets and liabilities:\nAs of August 31,\nDeferred tax assets:\nAllowance for doubtful accounts\n$\n$\nInventories\nAccruals\nWarranty reserve\nPension accrual\n1,872\n2,386\nDeferred compensation\nForeign currency loss on previously taxed income\nLoan finance costs\n-\nRestricted stock grants\nNon-qualified stock options\nLease liability\n2,208\n2,328\nForeign net operating loss, net of valuation allowance\n-\nOther\n7,361\n8,077\nDeferred tax liabilities:\nPrepaid liabilities\n(38)\n(18)\nForeign intangibles\n(2,099)\n(3,156)\nRight-of-use asset\n(2,154)\n(2,280)\nDepreciation and amortization\n(659)\n(3,880)\n(6,113)\nNet deferred tax assets (liabilities)\n$\n3,481\n$\n1,964\nIn fiscal 2021, the Company included $599 of net operating loss carry forwards which offset future taxable income. The entire $599 of net operating loss carry forwards was utilized in fiscal 2022 and the operating loss for the year was $0.\nChase Corporation is required to apply a valuation allowance to reduce the deferred tax assets reported if based on the weight of the evidence it is more likely than not that some portion or all of the deferred tax assets will not be realized. As of August 31, 2022, the Company determined that a valuation allowance was not needed.\nConsistent with the Companys practice prior to the passage of the Tax Act, we do not currently take the position that undistributed foreign subsidiaries earnings are considered to be permanently reinvested.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nA summary of the Companys adjustments to its uncertain tax positions, included within long-term accrued income taxes on the consolidated balance sheet, in fiscal years ended August 31, 2022, 2021 and 2020 are as follows:\nBalance, at beginning of the year\n$\n2,190\n$\n1,941\n$\n2,324\nIncrease for tax positions related to the current year\n-\nDecreases for currency translation adjustments\n(71)\n-\n-\nIncrease (decrease) for tax positions related to prior years\n-\n1,180\n(609)\nDecreases for settlement of uncertain tax positions\n-\n(705)\n-\nIncrease for interest and penalties\nDecrease for lapses of statute of limitations\n(495)\n(434)\n-\nBalance, at end of year\n$\n1,820\n$\n2,190\n$\n1,941\nThe unrecognized tax benefits mentioned above include an aggregate of $584 of accrued interest and penalty balances related to uncertain tax positions. The Company recognizes interest and penalties related to uncertain tax positions in income tax expense. An increase in accrued interest and penalty charges of approximately $398, net of Federal tax expense, was recorded as a tax expense during the current fiscal year. The Company anticipates that its accrual for uncertain tax positions could change by approximately $330 over the next twelve-month period due to statute of limitations expiration.\nThe Company is subject to U.S. Federal income tax, as well as to income tax of multiple state, local and foreign tax jurisdictions. The statute of limitations for all material U.S. Federal, state, and local tax filings remains open for fiscal years subsequent to 2018. For foreign jurisdictions, the statute of limitations remains open in the U.K and France for fiscal years subsequent to 2018.\nNote 8-Leases\nThe Company accounts for Leases using ASC Topic 842. At the inception of an arrangement, the Company determines whether the arrangement is or contains a lease based on the unique facts and circumstances present in the arrangement. Leases with a term greater than one year are recognized on the balance sheet as right-of-use (ROU) assets and short-term and long-term lease liabilities, as applicable. The Company does not have any financing leases that are material in nature.\nOperating lease liabilities and their corresponding right-of-use assets are initially recorded based on the present value of lease payments over the expected remaining lease term. The interest rate implicit in lease contracts is typically not readily determinable. As a result, the Company utilizes its incremental borrowing rate to discount lease payments, which reflects the fixed rate at which the Company believes it could borrow on a collateralized basis the amount of the lease payments in the same currency, for a similar term, in a similar economic environment.\nThe Company has elected not to recognize leases with an original term of one year or less on the balance sheet. The Company typically only includes an initial lease term in its assessment of a lease arrangement. Options to renew a lease are not included in the Companys assessment unless there is reasonable certainty that the Company will renew.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe following table presents the right-of-use asset and short-term and long-term lease liabilities amounts recorded on the consolidated balance sheet as of August 31, 2022 and 2021:\nAugust 31,\nAugust 31,\nAssets\nOperating lease right-of-use assets\n$\n8,596\n$\n9,312\nLiabilities\nCurrent (accrued expenses)\n$\n1,448\n$\n1,515\nOperating lease long-term liabilities\n6,618\n7,202\nTotal lease liability\n$\n8,066\n$\n8,717\nLease cost\nThe components of lease costs for the years ended August 31, 2022, 2021, and 2020 are as follows:\nYear Ended August 31,\nOperating lease cost (a)\n$\n3,332\n$\n3,772\n$\n3,783\n(a)Includes short-term leases and variable lease costs (e.g. common area maintenance), which are immaterial.\nMaturity of lease liability\nThe maturity of the Company's lease liabilities on August 31, 2022 was as follows:\nFuture Operating\nYear ending August 31,\nLease Payments\n1,651\n1,576\n1,418\n1,173\n2028 and thereafter\n2,199\nLess: Interest\n(743)\nPresent value of lease liabilities\n$\n8,066\nThe weighted average remaining lease term and discount rates are as follows:\nAugust 31,\nAugust 31,\nLease Term and Discount Rate\nWeighted average remaining lease term (years)\nOperating leases\n6.5\n6.8\nWeighted average discount rate (percentage)\nOperating leases\n2.8\n%\n3.1\n%\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nOther Information\nSupplemental cash flow information related to leases is as follows:\nYear Ended August 31,\nOperating cash outflows from operating leases\n$\n1,725\n$\n2,266\nTotal cash paid for amounts included in the measurement of lease liabilities\n$\n1,725\n$\n2,266\nTotal rental expense for all operating leases amounted to $3,332, $3,772 and $3,783 for the years ended August 31, 2022, 2021 and 2020, respectively.\nNote 9-Benefits and Pension Plans\n401(k) Plans\nThe Company has a defined contribution plan adopted pursuant to section 401(k) of the Internal Revenue Code of 1986 (the Chase 401(k) Plan). Any qualified employee who has attained age 21 and has been employed by the Company for at least three months may contribute a portion of his or her salary to the plan and the Company will match 100% of the first one percent of salary contributed and 50% thereafter, up to an amount equal to three and one-half percent of such employees annual salary.\nThe Companys contribution expense for all 401(k) plans was $942, $844 and $852 for the years ended August 31, 2022, 2021 and 2020, respectively.\nNon-Qualified Deferred Savings Plans\nThe Company has a non-qualified deferred savings plan covering the Board of Directors and a separate plan covering selected employees. Participants may elect to defer a portion of their compensation for future payment. The plans are funded by trusteed assets that are restricted to the payment of deferred compensation or satisfaction of the Companys general creditors. The Companys liability under the plans was $2,375 and $2,267 on August 31, 2022 and 2021, respectively.\nPension Plans\nThe Company has noncontributory defined benefit pension plans covering employees of certain divisions of the Company. The Company has a funded, qualified plan (Qualified Plan) and an unfunded supplemental plan (Supplemental Plan) designed to maintain benefits for certain employees at the plan formula level. The plans provide for pension benefits determined by a participants years of service and final average compensation. The Qualified Plan assets consist of separate pooled investment accounts with a trust company. The measurement date for the plans is August 31, 2022.\nEffective December 1, 2008, a soft freeze in the Qualified Plan was adopted whereby no new employees hired would be admitted to the Qualified Plan, with the exception of employees who were members of the International Association of Machinists and Aerospace Workers Union whose contract was amended in June 2012 to include a soft freeze with an effective date of July 15, 2012. All eligible participants who were admitted to the plan prior to the applicable soft freeze dates continue to accrue benefits as detailed in the plan agreements.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThrough our wholly-owned subsidiary NEPTCO, the Company had a third defined benefit pension plan (NEPTCO Pension Plan) covering our union employees at our Pawtucket facility. This plan was frozen effective October 31, 2006, and as a result, no new participants could enter the plan and the benefits of current participants were frozen as of that date. The benefits were based on years of service and the employees average compensation during the earlier of five years before retirement, or October 31, 2006. The NEPTCO Pension Plan assets consisted of separate pooled investment accounts with a trust company. The measurement date for the NEPTCO Pension Plan was historically the same as the Companys fiscal year end.\nIn August 2019, the Board of Directors approved a plan to terminate the NEPTCO Pension Plan. The Company established November 15, 2019 as the plan termination date and during fiscal 2020 performed the administrative actions required to carry out the termination. No balance related to the NEPTCO defined benefit plan was carried on the Companys consolidated balance sheet as of August 31, 2022 or 2021.\nThe following tables reflect the status of the Companys pension plans for the years ended August 31, 2022 2021 and 2020:\nYear Ended August 31,\nChange in benefit obligation\nProjected benefit obligation at beginning of year\n$\n20,261\n$\n20,663\n$\n20,087\nService cost\nInterest cost\nActuarial (gain) loss\n(2,202)\n2,253\nBenefits paid\n(2,027)\n(1,754)\n(2,423)\nProjected benefit obligation at end of year\n$\n16,798\n$\n20,261\n$\n20,663\nChange in plan assets\nFair value of plan assets at beginning of year\n$\n9,280\n$\n8,168\n$\n7,859\nActual return on plan assets\n(1,369)\n1,301\nEmployer contribution\n1,917\n1,565\n1,864\nBenefits paid\n(2,026)\n(1,754)\n(2,423)\nFair value of plan assets at end of year\n$\n7,802\n$\n9,280\n$\n8,168\nFunded status at end of year\n$\n(8,996)\n$\n(10,981)\n$\n(12,495)\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nYear Ended August 31,\nAmounts recognized in consolidated balance sheets\nNoncurrent assets\n$\n-\n$\n-\n$\n-\nCurrent liabilities\n(1,565)\n(1,565)\n(1,565)\nNoncurrent liabilities\n(7,431)\n(9,416)\n(10,930)\nNet amount recognized in consolidated balance sheets\n$\n(8,996)\n$\n(10,981)\n$\n(12,495)\nActuarial present value of benefit obligation and funded status\nAccumulated benefit obligations\n$\n15,093\n$\n17,898\n$\n18,307\nProjected benefit obligations\n$\n16,798\n$\n20,261\n$\n20,663\nPlan assets at fair value\n$\n7,802\n$\n9,280\n$\n8,168\nAmounts recognized in accumulated other comprehensive income\nPrior service cost\n$\n$\n$\nNet actuarial loss\n8,659\n9,674\n10,595\nAdjustment to pre-tax accumulated other comprehensive income\n$\n8,696\n$\n9,714\n$\n10,639\nYear Ended August 31,\nOther changes in plan assets and benefit obligations recognized in other comprehensive income\nNet (gain)/loss\n$\n(439)\n$\n(884)\n$\nAmortization of loss\n(593)\n(656)\n(664)\nSupplemental plan assumption change\n1,065\nAmortization of prior service cost\n(3)\n(3)\n(3)\nEffect of settlement on accumulated other comprehensive income\n-\n-\n(155)\nTotal recognized in other comprehensive income\n(1,018)\n(924)\nNet periodic pension cost\n1,178\nTotal recognized in net periodic pension cost and other comprehensive income\n$\n(67)\n$\n$\n2,132\nEstimated amounts that will be amortized from accumulated comprehensive income over the next fiscal year\nPrior service cost\n$\n$\n$\nNet actuarial loss\nPrior service cost arose from the amendment of the plans benefit schedules to comply with the Tax Reform Act of 1986 and adoption of the unfunded supplemental pension plan.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nComponents of net periodic pension cost for the fiscal years ended August 31, 2022, 2021 and 2020 included the following:\nComponents of net periodic benefit cost\nService cost\n$\n$\n$\nInterest cost\nExpected return on plan assets\n(411)\n(391)\n(390)\nAmortization of prior service cost\nAmortization of accumulated loss\nCurtailment and settlement loss\n-\n-\nNet periodic benefit cost\n$\n$\n$\n1,178\nWeighted average assumptions used to determine benefit obligations as of August 31, 2022, 2021 and 2020 are as follows:\nDiscount rate\nQualified plan\n4.21\n%\n2.15\n%\n1.92\n%\nSupplemental plan\n4.36\n%\n1.95\n%\n1.65\n%\nNEPTCO plan\n-\n%\n-\n%\n-\n%\nRate of compensation increase\nQualified and Supplemental plan\n3.50\n%\n3.50\n%\n3.50\n%\nNEPTCO plan\n-\n%\n-\n%\n-\n%\nWeighted average assumptions used to determine net periodic benefit cost for the years ended August 31, 2022, 2021 and 2020 are as follows:\nDiscount rate\nQualified plan\n2.15\n%\n1.92\n%\n2.58\n%\nSupplemental plan\n1.95\n%\n1.65\n%\n2.37\n%\nNEPTCO plan\n-\n%\n-\n%\n2.29\n%\nExpected long-term return on plan assets\nQualified plan\n4.85\n%\n5.25\n%\n5.60\n%\nSupplemental plan\n-\n%\n-\n%\n-\n%\nNEPTCO plan\n-\n%\n-\n%\n5.60\n%\nRate of compensation increase\nQualified and Supplemental plan\n3.50\n%\n3.50\n%\n3.50\n%\nNEPTCO plan\n-\n%\n-\n%\n-\n%\nIt is the Companys policy to evaluate, on an annual basis, the discount rate used to determine the projected benefit obligation to approximate rates on high quality, long-term obligations. The Moodys Corporate Aa Bond index has generally been used as a benchmark for this purpose, with adjustments made if the duration of the index differed from that of the plan. The discount rate is determined by matching the expected payouts from the respective plans to the spot rates inherent in the FTSE Pension Discount Curve (formerly Citigroup Pension Discount Curve). A single rate is then developed, that when applied to the expected cash flows, results in the same present value as determined using the various spot rates. The Company believes that this approach produces the most appropriate approximation of the plan liability.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe Company estimates that each 100-basis point reduction in the discount rate would result in additional (decreased) net periodic pension cost, the Companys primary pension obligation, of approximately $37 for the Qualified Plan and ($35) for the Supplemental Plan. The expected return on plan assets is derived from a periodic study of long-term historical rates of return on the various asset classes included in the Companys targeted pension plan asset allocation. The Company estimates that each 100-basis point reduction in the expected return on plan assets would result in additional net periodic pension cost of approximately $85 for the Qualified Plan. No rate of return is assumed for the Supplemental Plan since that plan is currently not funded. The rate of compensation increase is also evaluated and is adjusted by the Company, if necessary, periodically.\nQualified Plan Assets\nThe investment policy for the Qualified Plan is based on ERISA standards for prudent investing. The fundamental goal underlying the investment policy is to ensure that the assets of the plans are invested in a prudent manner to meet the obligations of the plans as these obligations come due. The primary investment objectives include providing a total return which will promote the goal of benefit security by attaining an appropriate ratio of plan assets to plan obligations, to provide for real asset growth while also tracking plan obligations, to diversify investments across and within asset classes, to reduce the impact of losses in single investments, and to follow investment practices that comply with applicable laws and regulations.\nThe primary policy objectives will be met by investing assets to achieve a reasonable tradeoff between return and risk relative to the plans obligations. This includes investing a portion of the assets in funds selected in part to hedge the interest rate sensitivity to plan obligations.\nThe Qualified Plan assets are invested in a diversified mix of both domestic and foreign equity investments and fixed income securities. Asset manager performance is reviewed at least annually and benchmarked against the peer universe for the given investment style. The Companys expected return for the Qualified Plan is 5.55%. To determine the expected long-term rate of return on the assets for the Qualified Plan, the Company considered the historical and expected return on the plan assets, as well as the current and expected allocation of the plan assets.\nAsset allocation is monitored on an ongoing basis relative to the established asset class targets. The interaction between plan assets and benefit obligations is periodically studied to assist in the establishment of strategic asset allocation targets. The investment policy permits variances from the targets within certain parameters. Asset rebalancing occurs when the underlying asset class allocations move outside these parameters, at which time the asset allocation is rebalanced back to the policy target weight.\nThe Qualified Plan has the following target allocation and weighted average asset allocations as of August 31, 2022, 2021 and 2020:\nTarget\nAllocation\nPercentage of Plan Assets as of August 31,\nAsset Category\nRange\nEquity securities\n10-80\n%\n%\n%\n%\nDebt securities\n20-75\n%\n%\n%\n%\nOther\n0-100\n%\n-\n%\n-\n%\n-\n%\nTotal\n%\n%\n%\n%\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNEPTCO Pension Plan\nThe NEPTCO Pension Plan terminated in fiscal 2020. Given the plans termination and full payout in fiscal 2020, the plan no longer holds assets as of August 31, 2020.\nFair Market Value of Pension Plan Assets\nThe Company is required to categorize pension plan assets using a three-tier fair value hierarchy, which classifies the inputs used in measuring fair values. These tiers include: Level 1, defined as observable inputs such as quoted prices for identical instruments in active markets; Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nThe following table presents the Companys pension plan assets at August 31, 2022 and 2021 by asset category:\nFair value measurements at\nFair value measurements at\nAugust 31, 2022\nAugust 31, 2021\nSignificant\nSignificant\nQuoted prices\nother\nSignificant\nQuoted prices\nother\nSignificant\nin active\nobservable\nunobservable\nin active\nobservable\nunobservable\nAugust 31,\nmarkets\ninputs\ninputs\nAugust 31,\nmarkets\ninputs\ninputs\n(Level 1)\n(Level 2)\n(Level 3)\n(Level 1)\n(Level 2)\n(Level 3)\nAsset Category\nEquity securities\n$\n3,667\n$\n3,667\n$\n-\n$\n-\n$\n4,241\n$\n4,241\n$\n-\n$\n-\nDebt securities\n4,135\n4,135\n-\n-\n5,039\n5,039\n-\n-\nTotal\n$\n7,802\n$\n7,802\n$\n-\n$\n-\n$\n9,280\n$\n9,280\n$\n-\n$\n-\nLevel 1 Assets: The fair values of the common stocks, corporate bonds and U.S. Government securities included in this tier are based on the closing price reported on the active market where the individual securities are traded.\nEstimated Future Benefit Payments\nThe following pension benefit payments (which include expected future service) are assumed to be paid in each of the following fiscal years based on the participants normal retirement age, and giving consideration to the termination of the NEPTCO Pension plan:\nYear ending August 31,\nPension Benefits\n$\n3,413\n2,004\n1,830\n1,802\n1,322\n2028-2032\n$\n4,221\nThe Company contributed $1,917, $1,565 and $1,864 to fund its obligations under the pension plans for the years ended August 31, 2022, 2021 and 2020, respectively, including final cash outlays related to the termination of the NEPTCO plan in fiscal 2020. The Company plans to make the necessary contributions during fiscal 2023 to ensure its pension plans continue to be adequately funded given the current market conditions and does not anticipate a material change from amounts contributed during the current fiscal year.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 10-Stockholders Equity\nAmended and Restated 2013 Equity Incentive Plan\nIn December 2021, the Company adopted an amendment and restatement of the Chase Corporation 2013 Equity Incentive Plan (the Amended 2013 Plan). The Amended 2013 Plan was approved by stockholders in February 2022. The Amended 2013 Plan permits the grant of restricted stock, stock options, deferred stock, stock payments or other awards to employees, participating officers, directors, consultants and advisors who are linked directly to increases in shareholder value. The aggregate number of shares available for grant under the 2013 Equity Incentive Plan was initially 1,200,000. No additional shares were included as a result of the December 2021 amendments. Additional shares may become available in connection with share splits, share dividends or similar transactions. As of August 31, 2022, 912,638 shares remained available for future grant under the Amended 2013 Plan.\n2005 Incentive Plan\nIn November 2005, the Company adopted, and the stockholders subsequently approved, the 2005 Incentive Plan (the 2005 Plan). The 2005 Plan permitted the grant of restricted stock, stock options, deferred stock, stock payments or other awards to employees, participating officers, directors, consultants and advisors who are linked directly to increases in shareholder value. The aggregate number of shares available for grant under the 2005 Plan was initially 1,000,000. The Company is no longer granting equity awards under the 2005 Plan. Options to purchase 31,543 shares of common stock remained outstanding under the 2005 Plan as of August 31, 2022.\nRestricted Stock\nEmployees and Executive Management\nDuring the first quarter of fiscal 2016, a grant of 5,000 restricted shares was made to a non-executive member of management with a vesting date of October 20, 2020. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2016, the Board of Directors of the Company approved the fiscal year 2017 LTIP for the executive officers and other members of management. The 2017 LTIP was an equity-based plan with a grant date of September 1, 2016. In addition to the stock option component described below, the plan contained the following restricted stock components: (a) a performance and service-based restricted stock grant of 5,399 shares in the aggregate, subject to adjustment based on fiscal 2017 results, with a vesting date of August 31, 2019, for which compensation expense was recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 5,367 shares in the aggregate, with a vesting date of August 31, 2019, for which compensation expense was recognized on a ratable basis over the vesting period.\nBased on the fiscal year 2017 financial results, 5,399 additional shares of restricted stock (total of 10,798 shares) were earned and granted subsequent to the end of fiscal year 2017 in accordance with the performance measurement criteria. No further performance-based measurements apply to this award.\nIn August 2016, the Board of Directors of the Company also approved equity retention agreements with certain executive officers. The equity-based retention agreements had a grant date of September 1, 2016. In addition to the stock option component described below, the equity retention agreements contained a time-based restricted stock grant of 16,312 shares in the aggregate, with 7,768 shares having a vesting date of August 31, 2019, and 8,544 shares initially having a vesting date of August 31, 2021. The latter award was amended in August 2017 to vest in five equal annual installments over the five-year period following the grant date. Compensation expense was recognized on a ratable basis over the vesting period.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nDuring the first quarter of fiscal 2017, additional grants totaling 8,805 shares of restricted stock were issued to non-executive members of management with a vesting date of August 31, 2021. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2017, the Board of Directors of the Company approved the fiscal year 2018 LTIP for the executive officers and other members of management. The 2018 LTIP was an equity-based plan with a grant date of September 1, 2017. In addition to the stock option component described below, the plan contained the following restricted stock components: (a) a performance and service-based restricted stock grant of 4,249 shares in the aggregate, subject to adjustment based on fiscal 2018 results, with a vesting date of August 31, 2020, for which compensation expense was recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 3,473 shares in the aggregate, with a vesting date of August 31, 2020, for which compensation expense was recognized on a ratable basis over the vesting period.\nBased on the fiscal year 2018 financial results, 572 additional shares of restricted stock (total of 4,821 shares) were earned and granted subsequent to the end of fiscal year 2018 in accordance with the performance measurement criteria. No further performance-based measurements apply to this award.\nDuring the third quarter of fiscal 2018, an additional grant totaling 192 shares of restricted stock was issued to a non-executive member of management with a vesting date of August 31, 2020. Compensation expense was recognized on a ratable basis over the vesting period.\nDuring the fourth quarter of fiscal 2018, an additional grant totaling 609 shares of restricted stock was issued to an executive member of management with a vesting date of August 20, 2019. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2018, the Board of Directors of the Company approved the fiscal year 2019 LTIP for the executive officers and other members of management. The 2019 LTIP was an equity-based plan with a grant date of September 1, 2018. In addition to the stock option component described below, the plan contained the following restricted stock components: (a) a performance and service-based restricted stock grant of 3,541 shares in the aggregate, subject to adjustment based on fiscal 2019 results, with a vesting date of August 31, 2021, for which compensation expense was recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 3,068 shares in the aggregate, with a vesting date of August 31, 2021, for which compensation expense was recognized on a ratable basis over the vesting period.\nIn September 2018, restricted stock in the amount of 2,472 shares related to a first quarter of fiscal 2017 grant was forfeited in conjunction with the termination of employment of a non-executive member of management of the Company.\nDuring the fourth quarter of fiscal 2019, an additional grant of restricted stock was made related to the 2019 LTIP grant in conjunction with an amendment to the equity compensation program for a promoted employee. The additional grant contained the following restricted stock components: (a) a performance and service-based restricted stock grant of 211 shares in the aggregate, subject to adjustment based on fiscal 2019 results, with a vesting date of August 31, 2021, for which compensation expense was recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 132 shares in the aggregate, with a vesting date of August 31, 2021, for which compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2019, restricted stock in the amount of 833 shares related to the 2019 LTIP grant was forfeited in conjunction with an amendment in the equity compensation agreement of an employee.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nBased on the fiscal year 2019 financial results, 2,694 shares of restricted stock already granted under the 2019 LTIP were forfeited subsequent to the end of fiscal year 2019 in accordance with the performance measurement criteria of the awards. No further performance-based measurements apply to this award. Compensation expense relating to the remaining portion was recognized on a ratable basis over the vesting period.\nIn August 2019, the Board of Directors of the Company approved the fiscal year 2020 LTIP for the executive officers and other members of management. The 2020 LTIP is an equity-based plan with a grant date of September 1, 2019 and contains the following equity components: (a) a performance and service-based restricted stock grant of 3,697 shares in the aggregate, subject to adjustment based on fiscal 2020 results, with a vesting date of August 31, 2022, for which compensation expense was recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 3,689 shares in the aggregate, with a vesting date of August 31, 2022, for which compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2019, the Board of Directors of the Company approved equity retention agreements with certain executive officers. The equity-based retention agreements have a grant date of September 1, 2019 and contained time-based restricted stock grants of 15,945 shares in the aggregate, and have a vesting date of August 31, 2022. Compensation expense was recognized on a ratable basis over the vesting period.\nDuring the second quarter of fiscal 2020, additional grants of 432,616 and 18,720 shares of restricted stock (total of 19,768) were issued to non-executive members of management with vesting dates of December 31, 2021, 2022 and 2024, respectively. Compensation expense is being recognized on a ratable basis over the vesting period.\nIn May 2020, restricted stock in the amount of 432 shares related to a second quarter of fiscal 2020 grant was forfeited in conjunction with the termination of employment of a non-executive member of management of the Company.\nDuring the fourth quarter of fiscal 2020, two additional grants totaling 481 shares and 261 shares of restricted stock were issued to two non-executive members of management, with vesting dates of July 27, 2021 and June 15, 2021, respectively. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2020, the Board of Directors of the Company approved the fiscal year 2021 LTIP for the executive officers and other members of management. The 2021 LTIP is an equity-based plan with a grant date of September 1, 2020 and contains the following equity components: (a) a performance and service-based restricted stock grant of 3,798 shares in the aggregate, subject to adjustment based on fiscal 2021 results, with a vesting date of August 31, 2023, for which compensation expense is recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 4,919 shares in the aggregate, with a vesting date of August 31, 2023, for which compensation expense is recognized on a ratable basis over the vesting period.\nIn the first quarter of 2021, restricted stock in the amount of 952 shares related to the second quarter of fiscal 2020 grant was forfeited in conjunction with the termination of employment of non-executive members of management of the Company.\nIn January 2021, restricted stock in the amount of 4,409 shares of common stock was forfeited in conjunction with the termination without cause of a now former executive of the Company.\nIn February 2021, a performance and service-based restricted stock grant totaling 521 shares, and a time-vesting restricted stock grant in the amount of 261 shares, was granted in conjunction with the appointment of a new executive\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nof the Company. The restricted shares vest on the same terms as those granted under the 2021 LTIP in September 2020. Compensation expense is being recognized over the period of the award consistent with the vesting terms.\nIn the fourth quarter of 2021, restricted stock in the amount of 447 shares related to the second quarter of fiscal 2020 grant was forfeited in conjunction with the termination of employment of non-executive members of management of the Company.\nIn August 2021, the Board of Directors of the Company approved the fiscal year 2022 LTIP for the executive officers and other members of management. The 2022 LTIP is an equity-based plan with a grant date of September 1, 2021 and contains the following equity components: (a) a performance and service-based stock grant of 3,304 shares in the aggregate, subject to adjustment based on fiscal 2022 results, with a vesting date of August 31, 2024, for which compensation expense is recognized on a ratable basis over the vesting period based on quarterly probability assessments; and (b) a time-based restricted stock grant of 6,280 shares in the aggregate, with a vesting date of August 31, 2024, for which compensation expense is recognized on a ratable basis over the vesting period.\nIn the first and second quarters of fiscal 2022, restricted stock in the amount of 437 and 570 shares, respectively, related to the fiscal 2020 grant was forfeited in conjunction with the termination of employment of non-executive members of management of the Company.\nIn February 2022 (the second quarter of fiscal 2022), the Board of Directors of the Company approved an equity retention agreement with the Companys Treasurer and Chief Financial Officer that included a restricted stock award in the amount of 5,332 shares with a vesting date of January 31, 2025. Compensation expense is recognized over the period of the award consistent with the vesting terms.\nIn the second and third quarters of fiscal 2022, restricted stock in the amount of 559 and 298 shares, respectively, related to the fiscal 2022 grant was forfeited in conjunction with the termination of employment of non-executive members of management of the Company.\nDuring the fourth quarter of fiscal 2021, one additional grant totaling 641 shares of restricted stock was issued to a non-executive member of management, with vesting dates of July 27, 2022. Compensation expense was recognized on a ratable basis over the vesting period.\nIn the fourth quarter of fiscal 2022, restricted stock in the amount of 299, 461, and 407 shares related to the fiscal 2019, 2020, and 2021 grant, respectively, was forfeited in conjunction with the termination of employment of non-executive members of management of the Company.\nNon-employee Consultants and Advisors\nIn February 2021, restricted stock in the amount of 2,306 shares was granted to a consultant of the Company, with a two-year vesting term including continued service requirements. Compensation expense is being recognized over the period of the award consistent with the vesting terms.\nNon-employee Board of Directors\nIn February 2019, as part of their standard compensation for board service, non-employee members of the Board received a total grant of 4,599 shares of restricted stock for service for the period from January 31, 2019 through January 31, 2020. The shares of restricted stock vested at the conclusion of this service period. Compensation was recognized on a ratable basis over the twelve-month vesting period.\nIn February 2020, as part of their standard compensation for board service, non-employee members of the Board received a total grant of 4,906 shares of restricted stock for service for the period from January 31, 2020 through\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nJanuary 31, 2021. The shares of restricted stock vested at the conclusion of this service period. Compensation was recognized on a ratable basis over the twelve-month vesting period.\nIn December 2020, restricted stock in the amount of 110 shares were granted to certain non-employee members of the board of directors in relation to their service on the board. These shares vested during the second fiscal quarter of 2021.\nIn February 2021, as part of their standard compensation for board service, non-employee members of the Board received a total grant of 4,525 shares of restricted stock for service for the period from January 31, 2021 through January 31, 2022. The shares of restricted stock will vest at the conclusion of this service period. Compensation is being recognized on a ratable basis over the twelve-month vesting period.\nIn February 2022, as part of their standard compensation for board service, non-employee members of the Board received a total grant of 5,000 shares of restricted stock for service for the period from January 31, 2022 through January 31, 2023. The shares of restricted stock will vest at the conclusion of this service period. Compensation is being recognized on a ratable basis over the twelve-month vesting period.\nIn July 2022, as part of the standard compensation for board service, a non-employee member of the Board received a grant of 456 shares of restricted stock for service on the board. These shares of restricted stock will vest on January 31, 2023. Compensation is being recognized on a ratable basis over the twelve-month vesting period.\nA summary of the transactions of the Companys restricted stock plans for the years ended August 31, 2022, 2021 and 2020 is presented below:\nNon Employee\nDirectors\nWeighted Average\nGrant Date\nFair Value\nNon Employee\nConsultants and Advisors\nWeighted Average\nGrant Date\nFair Value\nOfficers\nand\nEmployees\nWeighted Average\nGrant Date\nFair Value\nUnvested restricted stock at August 31, 2019\n4,599\n$\n101.92\n-\n-\n44,355\n$\n67.18\nGranted\n4,906\n95.59\n-\n-\n43,841\n108.47\nVested\n(4,599)\n101.92\n-\n-\n(25,195)\n61.51\nForfeited or cancelled\n-\n-\n-\n-\n(3,126)\n123.19\nUnvested restricted stock at August 31, 2020\n4,906\n95.59\n-\n-\n59,875\n97.72\nGranted\n4,635\n104.09\n2,306\n$\n108.42\n9,499\n98.10\nVested\n(5,016)\n95.59\n-\n-\n(19,978)\n80.13\nForfeited or cancelled\n-\n-\n-\n-\n(6,195)\n103.86\nUnvested restricted stock at August 31, 2021\n4,525\n104.09\n2,306\n108.42\n43,201\n107.31\nGranted\n5,456\n93.48\n-\n-\n18,190\n105.16\nVested\n(4,525)\n104.04\n-\n-\n(16,804)\n100.22\nForfeited or cancelled\n-\n-\n-\n-\n(3,031)\n111.84\nUnvested restricted stock at August 31, 2022\n5,456\n93.48\n2,306\n108.42\n41,556\n109.02\nStock Options\nIn August 2017, the Board of Directors of the Company approved the fiscal year 2018 LTIP for the executive officers and other members of management. The 2018 LTIP is an equity-based plan with a grant date of September 1, 2017 and included options to purchase 9,622 shares of common stock in the aggregate with an exercise price of $93.50 per share. The options vested in three equal annual installments ending on August 31, 2020. Of the options granted,\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\n4,591 options will expire on August 31, 2027, and 5,031 options will expire on September 1, 2027. Compensation expense was recognized over the period of the award consistent with the vesting terms.\nDuring the third quarter of fiscal 2018, an additional grant of options to purchase 606 shares of common stock with an exercise price of $104.00 was issued to a non-executive member of management. The options vested in three equal annual installments ending on August 31, 2020 and will expire on March 1, 2028. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2018, the Board of Directors of the Company approved the fiscal year 2019 LTIP for the executive officers and other members of management. The 2019 LTIP was an equity-based plan with a grant date of September 1, 2018 and included options to purchase 8,603 shares of common stock in the aggregate with an exercise price of $123.95 per share. The options vested in three equal annual installments ending on August 31, 2021. Of the options granted, 3,927 options will expire on August 31, 2028, and 4,676 options will expire on September 1, 2028. Compensation expense was recognized over the period of the award consistent with the vesting terms.\nDuring the fourth quarter of fiscal 2019, an additional grant of 483 options to purchase shares of common stock with an exercise price of $99.38 per share was made related to the 2019 LTIP grant and in conjunction with an amendment to the equity compensation program for a promotion of an employee. The options vested in three equal installments on August 31, 2019, 2020 and 2021, and will expire on August 31, 2028. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2019, the Board of Directors of the Company approved the fiscal year 2020 LTIP for the executive officers and other members of management. The 2020 LTIP was an equity-based plan with a grant date of September 1, 2019 and included options to purchase 13,418 shares of common stock in the aggregate with an exercise price of $100.22 per share. The options vest in three equal annual installments ending on August 31, 2022. Of the options granted, 6,218 options will expire on August 31, 2029, and 7,200 options will expire on September 1, 2029. Compensation expense is being recognized over the period of the award consistent with the vesting terms.\nIn August 2019, the Board of Directors of the Company also approved equity retention agreements with certain executive officers. The equity-based retention agreements have a grant date of September 1, 2019 and contain stock options to purchase 53,642 shares of common stock in the aggregate with an exercise price of $100.22 per share. The options vested on August 31, 2022 and will expire on August 31, 2029. Compensation expense was recognized on a ratable basis over the vesting period.\nIn August 2020, the Board of Directors of the Company approved the fiscal year 2021 LTIP for the executive officers and other members of management. The 2021 LTIP is an equity-based plan with a grant date of September 1, 2020 and included options to purchase 14,845 shares of common stock in the aggregate with an exercise price of $97.57 per share. The options vest in three equal annual installments ending on August 31, 2023. Of the options granted, 6,730 options will expire on August 31, 2030, and 8,115 options will expire on September 1, 2030. Compensation expense is being recognized over the period of the award consistent with the vesting terms.\nIn January 2021, options to purchase 18,129 shares of common stock were forfeited in conjunction with the termination without cause of a now former executive of the Company. Options to purchase an additional 306 shares of common stock were forfeited in April 2021 related to this same termination.\nIn February 2021, options to purchase 749 shares of common stock with an exercise price of $104.04 per share were granted in conjunction with the appointment of a new executive of the Company. The stock options vest on the same terms as those granted in September 2020 under the 2021 LTIP. Compensation expense is being recognized over the period of the award consistent with the vesting terms.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nIn August 2021, the Board of Directors of the Company approved the fiscal year 2022 LTIP for the executive officers and other members of management. The 2022 LTIP is an equity-based plan with a grant date of September 1, 2021 and included options to purchase 12,942 shares of common stock in the aggregate with an exercise price of $114.50 per share. The options vest in three equal installments ending on August 31, 2024. Of the options granted, 5,804 options will expire on August 31, 2031, and 7,138 options will expire on September 1, 2031. Compensation expense is being recognized over the period of the award consistent with the vesting terms.\nIn February 2022, the Board of Directors of the Company also approved an equity retention agreement with the Treasurer and Chief Financial Officer. The agreement included an award to purchase 14,480 shares of common stock with a grant date of February 1, 2022 and an exercise price of $94.88 per share. The options will vest on January 31, 2025 and will expire on February 1, 2032. Compensation expense is being recognized on a ratable basis over the vesting period.\nIn April 2022, options to purchase, 836 shares of common stock were forfeited in conjunction with the termination without cause of a now former employee of the Company.\nIn July 2022, options to purchase, 2,351 shares of common stock were forfeited in conjunction with the termination without cause of a now former employee of the Company.\nThe following table summarizes information about stock options outstanding as of August 31, 2022:\nOptions Outstanding\nOptions Exercisable\nExercise Prices\nNumber\nOutstanding\nWeighted Avg.\nRemaining\nContractual\nLife\nWeighted\nAverage\nExercise Price\nAggregate\nIntrinsic\nValue\nNumber\nExercisable\nWeighted\nAverage\nExercise Price\nAggregate\nIntrinsic\nValue\n$\n29.72\n10,925\n1.0\n$\n29.72\n$\n10,925\n$\n29.72\n$\n$\n35.50\n13,372\n2.0\n$\n35.50\n$\n13,372\n$\n35.50\n$\n$\n39.50\n12,753\n3.0\n$\n39.50\n$\n12,753\n$\n39.50\n$\n$\n64.37\n32,920\n4.0\n$\n64.37\n$\n32,920\n$\n64.37\n$\n$\n93.50\n8,704\n5.0\n$\n93.50\n$\n-\n8,704\n$\n93.50\n$\n-\n$\n94.88\n14,480\n9.4\n$\n94.88\n$\n-\n-\n$\n94.88\n$\n-\n$\n97.57\n12,705\n8.0\n$\n97.57\n$\n-\n8,615\n$\n97.57\n$\n-\n$\n100.22\n49,689\n7.0\n$\n100.22\n$\n-\n49,689\n$\n100.22\n$\n-\n$\n104.00\n5.5\n$\n104.00\n$\n-\n$\n104.00\n$\n-\n$\n104.04\n8.0\n$\n104.04\n$\n-\n$\n104.04\n$\n-\n$\n114.50\n10,964\n9.0\n$\n114.50\n$\n-\n3,655\n$\n114.50\n$\n-\n$\n123.95\n8,144\n6.0\n$\n123.95\n$\n-\n8,144\n$\n123.95\n$\n-\n176,011\n5.7\n$\n80.88\n$\n2,746\n149,882\n$\n77.39\n$\n2,746\nOptions are granted with an exercise price that is equal to the closing market value of the Companys common stock on the day preceding the grant date, which is determined not to be materially different from the opening market value on the date of grant.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nA summary of the transactions of the Companys stock option plans for the years ended August 31, 2022, 2021 and 2020 is presented below:\nOfficers\nand\nEmployees\nWeighted\nAverage\nExercise Price\nOptions outstanding at August 31, 2019\n101,254\n$\n57.18\nGranted\n67,060\n$\n100.22\nExercised\n(3,618)\n$\n34.21\nForfeited or cancelled\n-\n$\n-\nOptions outstanding at August 31, 2020\n164,696\n$\n75.21\nGranted\n15,594\n$\n97.88\nExercised\n(7,546)\n$\n38.79\nForfeited or cancelled\n(18,435)\n$\n100.62\nOptions outstanding at August 31, 2021\n154,309\n$\n76.24\nGranted\n27,422\n$\n104.14\nExercised\n(2,533)\n$\n16.00\nForfeited or cancelled\n(3,187)\n108.36\nOptions outstanding at August 31, 2022\n176,011\n$\n80.88\nOptions exercisable at August 31, 2022\n149,882\n$\n77.39\nThe weighted average grant date fair value of options granted in the years ended August 31, 2022, 2021 and 2020 was $37.71, $34.45 and $29.79 per share, respectively.\nThe total pretax intrinsic value of stock options exercised was $195, $558 and $311 for the years ended August 31, 2022, 2021, and 2020, respectively.\nExcluding the effects of common stock reserved for issuance upon exercise of the 176,011 outstanding options, there were 924,767 shares of common stock available for future issuance under the Companys Amended and Restated 2013 Equity Incentive Plan on August 31, 2022. Based on historic experience, management estimates all outstanding stock options will vest.\nThe income tax benefit realized from stock options exercised, vesting of restricted stock and issuance of stock pursuant to grants of restricted stock units was $20, $114 and $149 for the years ended August 31, 2022, 2021 and 2020, respectively.\nAs of August 31, 2022, unrecognized expense related to all stock-based compensation described above was $3,200 (including $2,568 for restricted stock and $632 for stock options), which will be recognized over the next four fiscal years.\nNote 11-Segment Data\nThe Company is organized into three reportable operating segments: Adhesives, Sealants and Additives; Industrial Tapes; and Corrosion Protection and Waterproofing. The segments are distinguished by the nature of the products manufactured and how they are delivered to their respective markets.\nThe Adhesives, Sealants and Additives segment offers innovative and specialized product offerings consisting of both end-use products and intermediates that are generally used in, or integrated into, another companys products. Demand for the segments product offerings is typically dependent upon general economic conditions. This segment\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nleverages the core specialty chemical competencies of the Company, and serves diverse markets and applications. The segment sells predominantly into the transportation, appliances, medical, general industrial and environmental market verticals. The segments products include moisture protective coatings and customized sealant and adhesive systems for electronics, polymeric microspheres, polyurethane dispersions and superabsorbent polymers. Beginning September 1, 2020, the Adhesives, Sealants and Additives segment includes the acquired operations of ABchimie, within the electronic and industrial coatings product line and beginning February 5, 2021, the acquired operations of ETi, within the functional additives product line.\nThe Industrial Tapes segment features wire and cable materials, specialty tapes, and other laminated and coated products. The segment derives its competitive advantage through its proven chemistries, diverse specialty offerings and the reliability its supply chain offers to end customers. These products are generally used in the assembly of other manufacturers products, with demand typically dependent upon general economic conditions. This segment sells mostly to established markets, with some exposure to growth opportunities through further development of existing products. Markets served include cable manufacturing, utilities and telecommunications, and electronics packaging. The segments offerings include insulating and conducting materials for wire and cable manufacturers, laminated durable papers, laminates for the packaging and industrial laminate markets, custom manufacturing services, pulling and detection tapes used in the installation, measurement and location of fiber optic cable and water and natural gas lines, and cover tapes essential to delivering semiconductor components via tape and reel packaging.\nThe Corrosion Protection and Waterproofing segment is principally composed of project-oriented product offerings that are primarily sold and used as Chase branded products. End markets include new and existing infrastructure projects on oil, gas, water and wastewater pipelines, highways and bridge decks, water and wastewater containment systems, and commercial buildings. The segments products include protective coatings for pipeline applications, coating and lining systems for waterproofing and liquid storage applications, adhesives and sealants used in architectural and building envelope waterproofing applications, high-performance polymeric asphalt additives, and expansion joint systems for waterproofing applications in transportation and architectural markets. With sales generally dependent on outdoor project work, the segment experiences highly seasonal sales patterns.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe following tables summarize information about the Companys segments:\nYears Ended August 31,\nRevenue\nAdhesives, Sealants and Additives\n$\n135,770\n$\n126,864\n$\n96,208\nIndustrial Tapes\n143,954\n120,873\n118,960\nCorrosion Protection and Waterproofing\n45,936\n45,599\n45,994\nTotal\n$\n325,660\n$\n293,336\n$\n261,162\nIncome before income taxes\nAdhesives, Sealants and Additives\n$\n37,657\n(a)\n$\n36,520\n(c)\n$\n25,953\nIndustrial Tapes\n41,387\n37,407\n31,237\n(f)\nCorrosion Protection and Waterproofing\n17,415\n15,913\n(d)\n16,638\n(g)\nTotal for reportable segments\n96,459\n89,840\n73,828\nCorporate and common costs\n(37,861)\n(b)\n(31,246)\n(e)\n(28,508)\n(h)\nTotal\n$\n58,598\n$\n58,594\n$\n45,320\nIncludes the following costs by segment:\nAdhesives, Sealants and Additives\nInterest\n$\n$\n$\nDepreciation\n1,065\nAmortization\n10,466\n10,685\n9,313\nIndustrial Tapes\nInterest\n$\n$\n$\nDepreciation\n1,568\n1,718\n1,746\nAmortization\n1,280\n1,537\n1,800\nCorrosion Protection and Waterproofing\nInterest\n$\n$\n$\nDepreciation\nAmortization\n(a) Includes a $432 loss on the upward adjustment of the performance-based earn-out contingent consideration associated with the September 2020 acquisition of ABchimie, $463 in operation optimization costs related to the move from Woburn, MA to OHara Township, PA and $147 of operations optimization costs related to the move from Newark, CA to Hickory, NC,\n(b) Includes $232 of operations optimization costs related to the Companys move to the new corporate headquarters within Westwood, MA and $4,000 of acquisition-related expense attributable to NuCera\n(c) Includes $1,664 in loss on the upward adjustment of the performance-based earn out contingent consideration associated with the September 2020 acquisition of ABchimie and $977 in exit costs related to the movement of the sealants system business out of the Newark, CA location and into the Hickory, NC location during fiscal 2021\n(d) Includes expense of $100 for the write-down of certain assets under construction\n(e) Includes $128 in acquisition-related expense attributable to the February 2021 acquisition of the operations of ETi\n(f) Includes $559 in exit costs related to the movement of the pulling and detection business out of the Granite Falls, NC location and into the Hickory, NC location during the first six months of fiscal 2020\n(g) Includes $170 gain on the refund of a payment made in fiscal 2019 related to engineering studies performed to assess potential operational changes and further plant rationalization and consolidation and an expense of $405 for the write-down of certain assets under construction\n(h) Includes $150 of expense related to exploratory IT work performed to assess potential future upgrades to the Companys companywide ERP system, a $760 gain related to the April 2020 sale of the Companys Pawtucket, RI location, a $1,791 gain related to the August 2020 sale of the Companys Randolph, MA property, $183 in severance expense related to the May 2020 reduction in force, $85 in expenses related to the final transition out of the Pawtucket, RI facility, $155 of pension-related settlement costs due to the timing of lump-sum distribution and $274 in acquisition-related costs attributable to the September 2020 (fiscal 2021) acquisition of ABchimie\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nAugust 31,\nAugust 31,\nTotal Assets\nAdhesives, Sealants and Additives\n$\n153,784\n$\n161,968\nIndustrial Tapes\n87,751\n72,301\nCorrosion Protection and Waterproofing\n33,037\n31,067\nTotal for reportable segments\n274,572\n265,336\nCorporate and common assets\n337,008\n138,823\nTotal\n$\n611,580\n$\n404,159\nNote 12-Export Sales and Foreign Operations\nExport sales from continuing domestic operations to unaffiliated third parties were $36,305, $33,439 and $30,067 for the years ended August 31, 2022, 2021 and 2020, respectively. The increase in export sales from fiscal 2022 to fiscal 2021 is reflective of the company-wide year-over-year increase in revenue attributed to a combination of sales price and demand-driven increases.\nThe Companys products are sold worldwide. Revenue for the years ended August 31, 2022, 2021 and 2020, are attributed to operations located in the following countries:\nYears Ended August 31,\nRevenue\nUnited States\n$\n281,754\n$\n245,476\n$\n226,690\nUnited Kingdom\n22,295\n24,846\n20,543\nAll other foreign (1)\n21,611\n23,014\n13,929\nTotal\n$\n325,660\n$\n293,336\n$\n261,162\n(1) Inclusive of sales originated from the Companys French locations (including ABchimie for fiscal 2021), royalty revenue attributable to our licensed manufacturer in Asia, and Chase foreign manufacturing operations.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nAs of August 31, 2022 and 2021, the Company had long-lived assets (defined as tangible assets providing the Company with a future economic benefit beyond the current year or operating period, including buildings, equipment and leasehold improvements) and goodwill and intangible assets, less accumulated amortization in the following countries:\nAugust 31,\nAugust 31,\nLong-Lived Assets\nUnited States\nProperty, plant and equipment, net\n$\n21,300\n$\n20,990\nGoodwill and Intangible assets, less accumulated amortization\n105,216\n115,936\nUnited Kingdom\nProperty, plant and equipment, net\n1,832\n2,174\nGoodwill and Intangible assets, less accumulated amortization\n3,318\n3,905\nAll other foreign\nProperty, plant and equipment, net\n1,116\n1,103\nGoodwill and Intangible assets, less accumulated amortization\n20,287\n24,979\nTotal\nProperty, plant and equipment, net\n$\n24,248\n$\n24,267\nGoodwill and Intangible assets, less accumulated amortization\n$\n128,821\n$\n144,820\nNote 13-Supplemental Cash Flow Data\nSupplemental cash flow information for the years ended August 31, 2022, 2021 and 2020 is as follows:\nIncome taxes paid\n$\n15,017\n$\n17,074\n$\n11,186\nInterest paid\n$\n$\n$\nNoncash Investing and Financing Activities\nCommon stock received for payment of stock option exercises\n$\n$\n$\nProperty, plant and equipment additions included in accounts payable\n$\n$\n$\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nSupplemental cash flow information as related to acquisitions and divestitures for the years ended August 31, 2022, 2021 and 2020 is as follows:\nAcquisition of Emerging Technologies, Inc (ETi)\nAccounts receivable\n$\nInventory\nPrepaids and other current assets\nProperty, plant & equipment\nGoodwill\n2,451\nIntangible assets\n6,650\nAccounts payable and accrued liabilities\n(519)\nOther liabilities (due to sellers)\n(1,000)\nPayments for acquisitions\n(8,997)\nAcquisition of ABchimie\nAccounts receivable\n$\nInventory\nPrepaids and other current assets\nProperty, plant & equipment\nGoodwill\n13,055\nIntangible assets\n12,055\nOperating lease right-of-use asset\nDeferred tax liability\n(3,387)\nAccounts payable and accrued liabilities\n(431)\nOperating lease liabilities (inclusive of short- and long-term)\n(473)\nOther liabilities (due to sellers)\n(928)\nPayments for acquisitions, net of cash received\n(22,241)\nSale of Randolph, MA Property\nAsset held for sale\n$\n(14)\nGain on sale of real estate\n(1,791)\nCash received from sale of real estate, net\n1,805\nSale of Pawtucket, RI Location\nAsset held for sale\n$\n(1,050)\nGain on sale of real estate\n(760)\nCash received from sale of real estate, net\n1,810\nNote 14-Acquisitions\nFiscal 2022\nDefinitive Agreement to acquire NuCera Solutions\nOn July 15, 2022, the Company entered into a Stock Purchase Agreement by and among Chase, NuCera Holdings Inc., and NuCera Solutions Holdco LP, to acquire NuCera Solutions (NuCera). NuCera is a recognized global leader in the production and development of highly differentiated specialty polymers and polymerization technologies serving demanding applications, offering products critical to enabling end-product functionality,\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nperformance and reliability. The transaction closed on September 1, 2022 (first day of fiscal 2023). Given the timing of this acquisition, the Company is in the process of completing the purchase price accounting. See Note 23 to the consolidated financial statement for additional information related to this subsequent event.\nFiscal 2021\nAcquisition of Emerging Technologies, Inc. (ETi)\nOn February 5, 2021, the Company acquired certain assets of Emerging Technologies, Inc. (ETi), a superabsorbent polymers solutions provider, located in Greensboro, NC. The business was acquired for a purchase price of $9,997, comprising $8,997 paid on February 5, 2021 and $1,000 paid on August 4, 2022 (eighteen months after the purchase), subsequent to final working capital adjustments, and excluding acquisition-related costs. As part of this transaction, Chase acquired substantially all working capital and fixed assets of the business and entered a multi-year lease at ETis existing location. The Company expensed $128 of acquisition-related costs in fiscal 2021 associated with this acquisition. The purchase was funded with available cash on hand. ETi is a solutions provider and formulator of absorbent polymers for use in the packaging, recreational, consumer, and sanitation markets. The acquisition broadens the Companys superabsorbent polymers product offerings and formulation capabilities while expanding its market reach. The Company finalized purchase accounting during the first quarter of fiscal 2022, with no significant change to amounts initially recorded. Since the effective date of the acquisition, the financial results of ETis acquired operations have been included in the Companys financial statements within the functional additives product line, contained within the Adhesives, Sealants and Additives operating segment. The ETi acquisition does not represent a significant business combination so pro forma financial information is not provided.\nThe excess of the purchase price over the net tangible and intangible assets acquired resulted in preliminary goodwill of $2,451 that is largely attributable to the synergies and economies of scale from combining the operations, technologies and research and development capabilities of ETi and Chase, particularly as they pertain to the expansion of the Company's product and service offerings, the established workforce and marketing efforts. This goodwill is deductible for income tax purposes.\nAcquisition of ABchimie\nOn September 1, 2020 (first day of fiscal 2021), the Company acquired all the capital stock of ABchimie for €18,654 (approximately $22,241 at the time of the transaction) net of cash acquired, subsequent to final working capital adjustments, excluding acquisition-related costs totaling $274 recognized in fiscal 2020 and with a performance-based earn out (measured over four years post-acquisition) potentially worth an additional €7,000 (approximately $8,330 at the time of the transaction). The Company accrued $2,584 at August 31, 2022 within Other liabilities on the consolidated balance sheet related to its current estimate of the earn out. Following its initial recording at the acquisition date, a $432 and $1,664 increase in the performance-based earn out accrual was recorded within Loss on contingent consideration in the consolidated statement of operations for the year ended August 31, 2022 and August 31, 2021, respectively. See Note 16 to the consolidated financial statements for additional information on the estimate of contingent consideration payable.\nABchimie is a Corbelin, France headquartered solutions provider for the cleaning and protection of electronic assemblies, with ‎further formulation, production, and research and development capabilities‎. The transaction was funded with available cash on hand. The financial results of the business are included in the Company's fiscal 2021 financial statements within the Adhesives, Sealants and Additives operating segment in the electronic and industrial coatings product line. The Company finalized purchase accounting during the fourth quarter of fiscal 2021, with no significant change to amounts initially recorded. The ABchimie acquisition does not represent a significant business combination so pro forma financial information is not provided.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nThe excess of the purchase price over the net tangible and intangible assets acquired resulted in goodwill preliminarily measured at $13,055 that is largely attributable to the synergies and economies of scale from combining the operations, technologies and research and development capabilities of ABchimie and Chase, particularly as they pertain to the expansion of the Company's product and service offerings, the established workforce and marketing efforts. A portion of this goodwill is deductible in the U.S. for calculation of GILTI period costs but is nondeductible for French income tax purposes.\nNote 15-Revenue from Contracts with Customers\nThe Company accounts for revenue in accordance with ASC 606, Revenue from Contracts with Customers. This revenue is generated from the manufacture of specialty chemical products including coatings, linings, adhesives, sealants, specialty tapes, polymers and laminates. Certain of these manufactured products can incorporate customer-owned materials. The Company also recognizes, to a lesser extent, revenue through royalties and commissions from licensed manufacturers and from providing custom manufacturing-related services. The Companys revenue recognition policies require the Company to make significant judgments and estimates. In applying the Companys revenue recognition policy, determinations must be made as to when control of products passes to the Companys customers, which can be either at a point in time or over time based on contractual terms with customers. Revenue is generally recognized at a point in time when control passes upon either shipment to or receipt by the customer of the Companys products, while revenue is generally recognized over time when control of the Companys products transfers to customers during the manufacturing process. The Company analyzes several factors, including but not limited to, the nature of the products being sold and contractual terms and conditions in contracts with customers to help the Company make such judgments about revenue recognition.\nContract Balances\nThe Companys contract assets primarily relate to unbilled revenue for products currently in production at the Companys facilities and which incorporate customer-owned material. Revenue is recognized in advance of billing to the customer in these specific circumstances, whereas billing is typically performed at the time of shipment to or receipt by the customer. Contract assets are included in prepaid expenses and other current assets on the Companys consolidated balance sheet. The following table presents contract assets by reportable operating segment as of August 31, 2022 and 2021:\nAugust 31,\nAugust 31,\nContract Assets\nAdhesives, Sealants and Additives\n$\n$\nIndustrial Tapes\nCorrosion Protection and Waterproofing\nTotal\n$\n$\nThe Company did not have any contract liabilities as of August 31, 2022 and 2021.\nDisaggregated Revenue\nThe Company disaggregates revenue from customers by geographic region, as it believes this disclosure best depicts how the nature, amount, timing and uncertainty of the Company's revenue and cash flows are affected by\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\neconomic factors. Disaggregated revenue by geographical region for the years ended August 31, 2022, 2021 and 2020 was as follows:\nYear Ended August 31, 2022\nAdhesives, Sealants\nIndustrial\nCorrosion Protection\nConsolidated\nand Additives\nTapes\nand Waterproofing\nRevenue\nRevenue\nNorth America\n$\n87,249\n$\n127,988\n$\n40,282\n$\n255,519\nAsia\\Middle East\n25,917\n7,430\n3,022\n36,369\nEurope\n21,910\n6,168\n2,511\n30,589\nAll other foreign\n2,368\n3,183\nTotal Revenue\n$\n135,770\n$\n143,954\n$\n45,936\n$\n325,660\nYear Ended August 31, 2021\nAdhesives, Sealants\nIndustrial\nCorrosion Protection\nConsolidated\nand Additives\nTapes\nand Waterproofing\nRevenue\nRevenue\nNorth America\n$\n76,388\n$\n106,084\n$\n37,879\n$\n220,351\nAsia\\Middle East\n28,033\n7,903\n4,933\n40,869\nEurope\n21,846\n4,657\n2,591\n29,094\nAll other foreign\n2,229\n3,022\nTotal Revenue\n$\n126,864\n$\n120,873\n$\n45,599\n$\n293,336\nYear Ended August 31, 2020\nAdhesives, Sealants\nIndustrial\nCorrosion Protection\nConsolidated\nand Additives\nTapes\nand Waterproofing\nRevenue\nRevenue\nNorth America\n$\n64,711\n$\n105,911\n$\n36,252\n$\n206,874\nAsia\n17,877\n7,150\n6,361\n31,388\nEurope\n13,201\n3,286\n3,047\n19,534\nAll other foreign\n2,613\n3,366\nTotal Revenue\n$\n96,208\n$\n118,960\n$\n45,994\n$\n261,162\nPractical Expedients and Policy Elections\nShipping and Handling Policy Election - the Company has made an accounting policy election to record shipping and handling activities occurring after control has passed to the customer to be treated as a fulfillment cost rather than as a distinct performance obligation. Shipping and handling expenses consist primarily of costs incurred to deliver products to customers and internal costs related to preparing products for shipment and are recorded within cost of products and services sold. Amounts billed to customers as shipping and handling are classified as revenue when services are performed.\nConsidering Existence of a Significant Financing Component - as a practical expedient, an entity need not adjust the promised amount of consideration for the effects of a significant financing component if the entity expects, at contract inception, that the period between when the entity transfers a promised good or service to the customer and when the customer pays for that good or service will be one year or less. Given the time between the Company transferring a promised good or service to the customer and the customer paying for that good or service is less than one year based on the terms of arrangements with customers, the Company does not adjust the promised amount of consideration for effects of a significant financing component.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 16-Fair Value Measurements\nThe Company defines fair value as the price that would be received to sell an asset or paid to transfer a liability (exit price) in an orderly transaction between market participants at the measurement date. The Company uses a three-tier fair value hierarchy, which classifies the inputs used in measuring fair values. These tiers are: Level 1, defined as observable inputs such as quoted prices for identical instruments in active markets; Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and Level 3, defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nThe Company utilizes the best available information in measuring fair value. Financial assets and liabilities are classified based on the lowest level of input that is significant to the fair value measurement. The financial assets classified as Level 1 and Level 2 as of August 31, 2022 and 2021 represent investments that are restricted for use in nonqualified retirement savings plans for certain key employees and directors.\nThe following table sets forth the Companys financial assets that were accounted for at fair value on a recurring basis as of August 31, 2022 and 2021:\nFair value measurement category\nQuoted prices\nSignificant other\nSignificant\nFair value\nin active markets\nobservable inputs\nunobservable inputs\nmeasurement date\nTotal\n(Level 1)\n(Level 2)\n(Level 3)\nAssets:\nRestricted investments\nAugust 31, 2022\n$\n2,367\n$\n2,125\n$\n$\n-\nRestricted investments\nAugust 31, 2021\n$\n2,260\n$\n2,016\n$\n$\n-\nThe following table presents the fair value of the Companys liabilities that are accounted for at fair value on a recurring basis as of August 31, 2022 and 2021:\nFair value measurement category\nQuoted prices\nSignificant other\nSignificant\nFair value\nin active markets\nobservable inputs\nunobservable inputs\nmeasurement date\nTotal\n(Level 1)\n(Level 2)\n(Level 3)\nLiabilities:\nLong-term debt\nAugust 31, 2022\n$\n180,000\n$\n-\n$\n180,000\n$\n-\nContingent consideration\nAugust 31, 2022\n$\n2,584\n$\n-\n$\n-\n$\n2,584\nLong-term debt\nAugust 31, 2021\n$\n-\n$\n-\n$\n-\n$\n-\nContingent consideration\nAugust 31, 2021\n$\n2,537\n$\n-\n$\n-\n$\n2,537\nThe long-term debt (including any current portion of long-term debt) had a $180,000 and $0 balance as of August 31, 2022 and 2021, respectively. The carrying value of the long-term debt approximates its fair value and has an interest rate of 5.5%. The interest rate is set based on the movement of the underlying market rates. See Note 6 to the consolidated financial statements for additional information on long-term debt.\nIn connection with accounting for the ABchimie acquisition on September 1, 2020, the Company recorded a contingent consideration liability included within Other liabilities on the consolidated balance sheet of €780 (approximately $928) on the acquisition date, representing the then fair value of contingent consideration payable upon the achievement of a performance-based target. The contingent consideration liability was valued using a Monte Carlo simulation model in an option pricing framework based on key inputs that are not all observable in the market, which\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nrepresents a Level 3 measurement within the fair value hierarchy. The Company assesses the fair value of the contingent consideration liability at each reporting period. Any subsequent changes in the estimated fair value of the liability are reflected in Loss on contingent consideration on the consolidated statement of operations until the liability is settled. As of August 31, 2022, the liability increased to $2,584 predominantly due to changes in non-market data assumptions as well as a shorter period to the payment date. See Note 14 to the consolidated financial statements for additional information on the acquisition of ABchimie.\nNote 17-Net Income Per Share\nThe determination of earnings per share under the two-class method is as follows:\nYears Ended August 31,\nNet income\n$\n44,671\n$\n44,920\n$\n34,157\nLess: Allocated to participating securities\nAvailable to common shareholders\n$\n44,374\n$\n44,611\n$\n33,884\nBasic weighted average shares outstanding\n9,399,085\n9,383,085\n9,359,940\nAdditional dilutive common stock equivalents\n35,256\n45,331\n79,810\nDiluted weighted average shares outstanding\n9,434,341\n9,428,416\n9,439,750\nNet income available to common shareholders, per common and common equivalent share\nBasic\n$\n4.72\n$\n4.75\n$\n3.62\nDiluted\n$\n4.70\n$\n4.73\n$\n3.59\nFor the years ended August 31, 2022, 2021 and 2020, stock options to purchase 96,912, 59,508 and 11,183 shares of common stock were outstanding but were not included in the calculation of diluted net income per share because their inclusion would be antidilutive. Included in the calculation of dilutive common stock equivalents are the unvested portion of restricted stock and stock options.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 18-Accumulated Other Comprehensive Income\nThe changes in accumulated other comprehensive income (loss), net of tax, were as follows:\nChange in Funded\nForeign Currency\nRestricted\nStatus of\nTranslation\nInvestments\nPension Plans\nAdjustment\nTotal\nBalance at August 31, 2020\n$\n$\n(8,317)\n$\n(5,044)\n$\n(13,092)\nOther comprehensive gains (losses) before reclassifications\n(159)\n1,295\n1,433\nReclassifications to net income of previously deferred (gains) losses\n(48)\n-\nOther comprehensive income (loss)\n1,295\n1,882\nBalance at August 31, 2021\n$\n$\n(7,979)\n$\n(3,749)\n$\n(11,210)\nBalance at August 31, 2021\n$\n$\n(7,979)\n$\n(3,749)\n$\n(11,210)\nOther comprehensive gains (losses) before reclassifications\n(282)\n(9,582)\n(9,534)\nReclassifications to net income of previously deferred (gains) losses\n(72)\n-\nOther comprehensive income (loss)\n(354)\n(9,582)\n(9,157)\nBalance at August 31, 2022\n$\n$\n(7,200)\n$\n(13,331)\n$\n(20,367)\nThe following table summarizes the reclassifications from accumulated other comprehensive income (loss) to the consolidated statements of income:\nAmount of Gain (Loss)\nReclassified from\nLocation of Gain (Loss)\nAccumulated Other\nReclassified from\nComprehensive Income\nAccumulated\n(Loss) into Income\nOther Comprehensive\nYear Ended\nYear Ended\nIncome (Loss)\nAugust 31, 2022\nAugust 31, 2021\ninto Income\nGains on Restricted Investments:\nRealized loss (gain) on sale of restricted investments\n$\n(96)\n$\n(65)\nSelling, general and administrative expenses\nTax expense (benefit)\nGain net of tax\n$\n(72)\n$\n(48)\nLoss on Funded Pension Plan adjustments:\nAmortization of prior pension service costs and unrecognized losses\n$\n$\nOther income (expense)\nSettlement and curtailment loss\n-\n-\nOther income (expense)\nTax expense (benefit)\n(147)\n(162)\nLoss net of tax\n$\n$\nTotal net loss reclassified for the period\n$\n$\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 19-Sale of Real Estate\nSale of Randolph, MA Property\nIn August 2020, the Company finalized the sale of its Randolph, MA property for net proceeds of $1,805. This transaction resulted in a gain of $1,791, which was recorded during the fourth quarter of fiscal 2020.\nSale of Pawtucket, RI Location\nIn April 2020, the Company finalized the sale of its Pawtucket, RI location for net proceeds of $1,810. This transaction resulted in a gain of $760, which was recorded during the third quarter of fiscal 2020.\nNote 20-Operations Optimization Costs\nRelocation of Chase Corporate Headquarters\nThe Company completed the relocation of its corporate headquarters to another location within Westwood, MA during the year ended August 31, 2022. The move, part of the Companys ongoing consolidation and optimization initiative, capitalizes on the hybrid work model utilized by many of Chases corporate and administrative employees and is expected to provide future operational cost savings. The new facility also consolidates and houses research and development operations previously conducted at the previous Westwood, MA and Woburn, MA locations. Operations optimization costs related to the Westwood move of $232 were expensed in fiscal 2022. No future costs related to the move are anticipated.\nRelocation of Adhesives Systems Manufacturing to O'Hara Township, PA\nDuring the third quarter of fiscal 2021, Chase announced to the employees at its Woburn, MA location that its adhesives systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, would be consolidating into the Companys existing O'Hara Township, PA location. This rationalization and consolidation initiative-related announcement aligns with the second quarter announcement of the Companys plan to move its sealant systems production from Newark, CA to Hickory, NC, described in more detail below. Chase Corporation obtained both the adhesive and sealants systems as part of its fiscal 2017 acquisition of the operations of Resin Designs. The Company expensed $463 and $0 in fiscal 2022 and 2021, related to the move, and future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nRelocation of Sealants Systems Manufacturing to Hickory, NC\nDuring the second quarter of fiscal 2021, Chase began moving the sealant systems operations, part of the Adhesives, Sealants and Additives segments electronic and industrial coatings product line, from its Newark, CA location to its Hickory, NC facility. This is in line with the Companys ongoing initiative to consolidate its manufacturing plants and streamline its existing processes. The sealant systems operations and Newark, CA location came to Chase Corporation as part of the fiscal 2017 acquisition of the operations of Resin Designs, and the Companys lease in Newark, CA terminated in fiscal 2021. The Company recognized $977 in expense related to the move in the year ended August 31, 2021 and $147 in expense during the year ended August 31, 2022. The project is now substantially completed and any future costs related to this move are not anticipated to be significant to the consolidated financial statements.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nStrategic Actions Taken Related to COVID-19\nFiscal 2020 saw the global spread of the coronavirus pandemic (COVID-19), which grew to create significant volatility, uncertainty and global economic disruption. During the third fiscal quarter of 2020, the Company implemented changes to its cost structure designed to address market changes brought on by COVID-19 and demonstrate its commitment to fiscal prudence: (a) the Company made a targeted reduction in its global workforce, contemplated pre-pandemic but catalyzed by COVID-19, which resulted in the recognition of $183 in severance costs during the period; and (b) the Company also instituted a temporary 20% reduction in the base salaries of its named executive officers and select members of senior management, as well as the cash compensation of the non-employee members of its Board of Directors. The reduction in force, which impacted operations in the Companys U.S. facilities, and the adjustments in compensation, were both effective May 2020. The temporary executive and Board of Director compensation reductions were lifted on December 1, 2020, retroactive to September 1, 2020.\nERP System Upgrade\nDuring the first quarter of fiscal 2020, the Company commissioned third party led studies regarding the potential upgrading of the Companys current worldwide ERP system. Chase Corporation reviewed the data and recommendations provided by the study and has made the decision to upgrade (beginning in fiscal 2023) from our current Oracle Legacy ERP System to the Oracle Fusion Cloud Platform. This upgrade will position us with a more advanced system to support business expansion, access to upgrades in functionality, and a more modern system for operations, all within the Oracle Ecosystem. Additionally, the upgrade will be a multi-year, phased in approach that will mitigate any disruptions to our business. The Company recognized $150 in third party studies in fiscal 2020 and no costs were recognized in fiscal 2022 and 2021.\nEngineering Studies Related to Facility Consolidation and Rationalization Initiative\nDuring the fourth quarter of fiscal 2019, the Company commissioned engineering studies of certain legacy operations, machinery and locations related to the Companys facility rationalization and consolidation initiative. Chase Corporation completed its review of the data and recommendations provided by the study in the fourth quarter of fiscal 2020. The Company recognized a gain of $170 in fiscal 2020, as certain amounts expensed in fiscal 2019 were refunded. Also in the fourth quarter of fiscal 2020 and related to the recommendations of the commissioned engineering studies, the Company wrote down the value of certain non-operating production assets related to the pipeline coatings product line, within the Corrosion Protection and Waterproofing segment. Given the nature and prospects of the equipment, the Company determined its then carrying value exceeded its fair value and recognized an expense of $405 related to the machinery. The Company recognized an additional $100 in the fourth quarter of fiscal 2021, to fully write-down the equipments value. The Company may utilize third party engineering, IT and other professional services firms in the future for similar optimization-related work. Given the ongoing nature of the facility rationalization and consolidation initiative, an estimate of future costs cannot currently be determined.\nNote 21-Commitments and Contingencies\nThe Company is involved from time to time in litigation incidental to the conduct of its business. Although the Company does not expect that the outcome in any of these matters, individually or collectively, will have a material adverse effect on its financial condition, results of operations or cash flows, litigation is inherently unpredictable. Therefore, judgments could be rendered, or settlements agreed to that could adversely affect the Companys operating results or cash flows in a particular period. The Company routinely assesses all its litigation and threatened litigation as to the probability of ultimately incurring a liability and records its best estimate of the ultimate loss in situations where we assess the likelihood of loss as probable.\nCHASE CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn thousands, except share and per share amounts\nNote 22-Valuation and Qualifying Accounts\nThe following table sets forth activity in the Companys accounts receivable and sales return reserve:\nYear ended\nBalance at\nBeginning of\nYear\nCharges to\nOperations\nDeductions to\nReserves\nBalance at\nEnd of Year\nAugust 31, 2022\n$\n$\n$\n(794)\n$\nAugust 31, 2021\n$\n$\n$\n(738)\n$\nAugust 31, 2020\n$\n$\n$\n(1,222)\n$\nThe following table sets forth activity in the Companys warranty reserve (the warranty reserve is included within accrued expenses on the consolidated balance sheet):\nYear ended\nBalance at\nBeginning of\nYear\nCharges to\nOperations\nDeductions to\nReserves\nBalance at\nEnd of Year\nAugust 31, 2022\n$\n-\n$\n-\n$\n-\n$\n-\nAugust 31, 2021\n$\n-\n$\n-\n$\n-\n$\n-\nAugust 31, 2020\n$\n$\n-\n$\n(37)\n$\n-\nNote 23 - Subsequent Events\nAcquisition of NuCera\nOn July 15, 2022, the Company signed a Stock Purchase Agreement by and among Chase, NuCera Holdings Inc., and NuCera Solutions Holdco LP, to acquire NuCera Solutions (NuCera). This transaction closed on September 1, 2022 (first day of fiscal 2023).\nThe Company acquired all of the capital stock of NuCera for a purchase price of $250,000, net of debt, accrued income taxes, cash at closing, and pending any working capital adjustments. The purchase was funded by utilizing $180,000 from the Companys existing revolving credit facility and the remaining $70,000 from available cash on hand. The Company recorded transaction costs of $4,000 in 2022 related to this acquisition which are excluded from the purchase price.\nNuCera is a recognized global leader in the production and development of highly differentiated specialty polymers and polymerization technologies serving demanding applications, offering products critical to enabling end-product functionality, performance and reliability. Chase will continue to market under NuCera brands and the business will be integrated into Chases Adhesives, Sealants and Additives reporting unit.\nDividend\nOn November 10, 2022, Chase announced a cash dividend of $1.00 per share (totaling approximately $9,494) to shareholders of record on November 30, 2022 and payable on December 9, 2022. Item 9 - Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9a - Controls and Procedures\nDisclosure Controls and Procedures\nThe Company maintains disclosure controls and procedures that are designed to provide reasonable assurance that information required to be disclosed in the Companys reports under the Securities Exchange Act of 1934, as amended (the Exchange Act), is recorded, processed, summarized and reported within the time periods specified in the Commissions rules and forms and that such information is accumulated and communicated to the Companys management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nThe Company carries out a variety of ongoing procedures, under the supervision and with the participation of the Companys management, including the Companys Chief Executive Officer and Chief Financial Officer, to evaluate the effectiveness of the design and operation of the Companys disclosure controls and procedures. Based on the foregoing, the Company's Chief Executive Officer and Chief Financial Officer concluded that the Company's disclosure controls and procedures were effective at a reasonable assurance level as of the end of the period covered by this report.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, our principal executive and principal financial officers, or persons performing similar functions, and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nUnder the supervision and with the participation of management, including the Chief Executive Officer and Chief Financial Officer, the Company conducted an evaluation of the effectiveness of the Companys internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, our management concluded that our internal control over financial reporting was effective as of August 31, 2022. Grant Thornton LLP, an independent registered public accounting firm, audited the effectiveness of our internal control over financial reporting as of August 31, 2022.\nChanges in Internal Control Over Financial Reporting\nThere have not been any changes in the Companys internal control over financial reporting during the quarter ended August 31, 2022 that have materially affected, or are reasonably likely to materially affect, its internal control over financial reporting.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nChase Corporation\nOpinion on internal control over financial reporting\nWe have audited the internal control over financial reporting of Chase Corporation (a Massachusetts Corporation) and subsidiaries (the Company) as of August 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of August 31, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements of the Company as of and for the year ended August 31, 2022, and our report dated November 10, 2022 expressed an unqualified opinion on those financial statements.\nBasis for opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Controls over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and limitations of internal control over financial reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ GRANT THORNTON LLP\nBoston, Massachusetts\nNovember 10, 2022 Item 9b - Other Information\nNot applicable.\nItem 9C - DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III Item 10 - Directors, Executive Officers and Corporate Governance\nThe information required by Item 10 of Form 10-K, relating to Directors of the Company, compliance with the reporting obligations under Section 16(a) of the Exchange Act, the Companys code of ethics applicable to senior management, procedures for shareholder nominations to the Companys Board of Directors, and the Companys Audit Committee is incorporated by reference from the information contained in the Definitive Proxy Statement for the Annual Meeting of Stockholders, which is expected to be filed within 120 days after the Companys fiscal year ended August 31, 2022. Information regarding the Companys executive officers found in the section captioned Information About Our Executive Officers in Item 4A of Part I hereof is also incorporated by reference into this Item 10. Item 11 - Executive Compensation\nThe information required by Item 11 of Form 10-K, relating to executive and director compensation and certain matters relating to the Companys Compensation and Management Development Committee, is incorporated by reference from the information contained in the Definitive Proxy Statement for the Annual Meeting of Stockholders, which is expected to be filed within 120 days after the Companys fiscal year ended August 31, 2022. Item 12 - Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by Item 12 of Form 10-K, relating to the stock ownership of certain beneficial owners and management, is incorporated by reference from the information contained in the Definitive Proxy Statement for the Annual Meeting of Stockholders, which is expected to be filed within 120 days after the Companys fiscal year ended August 31, 2022.\nThe following table summarizes the Companys equity compensation plans as of August 31, 2022. Further details on the Companys equity compensation plans are discussed in the notes to the Consolidated Financial Statements. The adoption of each of the Companys equity compensation plans was approved by its shareholders.\nNumber of shares of\nWeighted\nChase common\naverage exercise\nNumber of shares of\nstock to be issued\nprice of\nChase common stock\nupon the exercise of\noutstanding\nremaining available for\noutstanding options\noptions\nfuture issuance\n2005 Incentive Plan\n31,543\n$\n34.42\n-\nAmended and Restated 2013 Equity Incentive Plan\n144,468\n91.02\n912,638\nTotal\n176,011\n$\n80.88\n912,638 Item 13 - Certain Relationships and Related Transactions, and director independence\nThe information required by Item 13 of Form 10-K, relating to transactions with related persons and the independence of members of the Companys Board of Directors, is incorporated by reference from the information contained in the Definitive Proxy Statement for the Annual Meeting of Stockholders, which is expected to be filed within 120 days after the Companys fiscal year ended August 31, 2022. Item 14 - Principal Accountant Fees and Services\nThe information required by Item 14 of Form 10-K, relating to fees paid to the Companys independent registered public accounting firm and pre-approval policies of the Companys Audit Committee, is incorporated by reference from the\ninformation contained in the Definitive Proxy Statement for the Annual Meeting of Stockholders, which is expected to be filed within 120 days after the Companys fiscal year ended August 31, 2022.\nPART IV Item 15 - Exhibits and Financial Statement Schedules\n(a)(1) and (2)Financial Statements and Schedules:\nThe financial statements are set forth under Item 8 of this Annual Report on Form 10-K. Financial statement schedules have been omitted since they are either not required, not applicable, or the information is otherwise included.\n(a)(3)Exhibit Index:\nExhibit\nNumber\nDescription\n3.1.1\nArticles of Organization of Chase Corporation (incorporated by reference from Exhibit 3.1 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2004, filed on November 24, 2004 (the 2004 Form 10-K)).\n3.1.2\nArticles of Amendment to Articles of Organization of Chase Corporation (incorporated by reference from Exhibit 3.1 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended February 29, 2008, filed on April 9, 2008).\n3.2\nAmended and Restated By-Laws (incorporated by reference from Exhibit 3.1 to the Companys current report on Form 8-K filed on April 12, 2016).\n4.1\nDescription of the Companys Capital Stock (incorporated by reference from Exhibit 4.1 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2019, filed on November 13, 2019).\n10.1\nAmended and Restated Stock Agreement dated as of August 31, 2004, between the Company and Peter R. Chase (incorporated by reference to Exhibit 10 to the Companys current report on Form 8-K filed on September 2, 2004).*\n10.2\nChase Corporation Employees Supplemental Pension Plan effective January 1, 2008 (incorporated by reference from Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended May 31, 2008, filed on July 10, 2008). *\n10.3.1\nChase Corporation Employees Supplemental Savings Plan, as Amended and Restated Effective December 31, 2016 (incorporated by reference from Exhibit 10.3.1 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2021, filed on November 12, 2020).*\n10.3.2\nAmendment No. 1 to the Amended and Restated Chase Corporation Employees Supplemental Savings Plan, dated July 15, 2020 (incorporated by reference from Exhibit 10.3.2 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2021, filed on November 12, 2020).*\n10.3.3\nAmendment No. 2 to the Chase Corporation Employees Supplemental Savings Plan, dated April 6, 2021 (incorporated by reference to Exhibit 10.3.3 to the Companys Quarterly Report on Form 10Q for the quarter ended May 31, 2021, filed on July 12, 2021).*\n10.4\nChase Corporation Non-Qualified Retirement Savings Plan for the Board of Directors, amended and restated effective January 1, 2009 (incorporated by reference from Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended February 28, 2009, filed on April 9, 2009). *\n10.5\nSeverance Agreement between the Company and Peter R. Chase dated July 10, 2006 (incorporated by reference from Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the quarter ended May 31, 2006, filed on July 17, 2006).*\n10.6\nAmended and Restated Severance Agreement between the Company and Adam P. Chase dated January 2, 2018 (incorporated by reference from Exhibit 10.1 to the Companys current report on Form 8-K on January 8, 2018). *\n10.7.1\nOffer letter dated January 28, 2021 by and between the Company and Michael J. Bourque (incorporated by reference from Exhibit 10.1 to the Companys current report on Form 8-K filed on February 3, 2021). *\n10.7.2\nSeverance Agreement between the Company and Michael J. Bourque dated January 27, 2021 (incorporated by reference from Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the period ended May 31, 2021, filed on July 12, 2021).*\n10.8.1\nOffer letter dated July 6, 2020 by and between the Company and Jeffrey D. Haigh (incorporated by reference from Exhibit 10.8.3 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2021, filed on November 15, 2021). *\n10.8.2\nSeverance Agreement between the Company and Jeffery D. Haigh dated November 11, 2021 (incorporated by reference from Exhibit 10.8.4 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2021, filed on November 15, 2021).*\n10.9.1\n2005 Equity Incentive Plan of Chase Corporation (incorporated by reference from Exhibit 10.1 to the Company's current report on Form 8-K filed on February 9, 2006).*\n10.9.2\nAmended and Restated 2013 Equity Incentive Plan (incorporated by reference from Appendix A to the Companys 2022 Proxy Statement filed on December 22, 2021).*\n10.9.3\nForm of restricted stock unit award issued for non-executive members of the Board of Directors (incorporated by reference from Exhibit 10.4 to the Companys Quarterly Report on Form 10-Q for the period ended February 28, 2007, filed on April 16, 2007).*\n10.9.4\nForm of restricted stock unit award issued for members of Executive Management (incorporated by reference from Exhibit 10.5 to the Companys Quarterly Report on Form 10-Q for the period ended February 28, 2007, filed on April 16, 2007).*\n10.9.5\nForm of restricted stock agreement issued for 2013 Equity Incentive Plan (incorporated by reference from Exhibit 10.9.5 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2019, filed on November 13, 2019).*\n10.9.6\nForm of stock option award issued (incorporated by reference from Exhibit 10.11.6 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2009, filed on November 16, 2009). *\n10.9.7\nForm of stock option award issued to employees for Amended and Restated 2013 Incentive Plan.*\n10.9.8\nForm of restricted stock agreement for non-employee members of the Board of Directors for Amended and Restated 2013 Incentive Plan.*\n10.9.9\nForm of restricted stock agreement for employees or consultants for Amended and Restated 2013 Incentive Plan.*\n10.10.10\nForm of performance based restricted stock agreement of Executive Management for Amended and Restated 2013 Incentive Plan.*\n10.10.1\nSplit Dollar Agreement between Chase Corporation and Peter R. Chase dated January 10, 2005 (incorporated by reference from Exhibit 10.2 to the Companys current report on Form 8-K filed on January 14, 2005).*\n10.10.2\nSplit Dollar Endorsement dated January 10, 2005 (incorporated by reference from Exhibit 10.3 to the Companys current report on Form 8-K filed on January 14, 2005).*\n10.11.1\nFY 2022 Chase Corporation Annual Incentive Plan (incorporated by reference from Exhibit 10.11.3 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2022, filed November 15, 2021).*\n10.11.2\nFY 2022 Chase Corporation Long Term Incentive Plan (incorporated by reference from Exhibit 10.11.4 to the Company's Annual Report on Form 10-K for the fiscal year ended August 31, 2021).*\n10.11.3\nFY 2023 Chase Corporation Annual Incentive Plan (incorporated by reference from Exhibit 99.1 to the Companys current report on Form 8-K filed September 1, 2022).*\n10.11.4\nFY 2023 Chase Corporation Long Term Incentive Plan (incorporated by reference to Exhibit 99.2 to the Companys current report on Form 8-K filed September 1, 2022).*\n10.12\nSecond Amended and Restated Credit Agreement, dated as of July 27, 2021 by and among Chase Corporation, NEPTCO Incorporated, the Guarantors, Bank of America, N.A., as administrative agent and Lenders party thereto (incorporated by reference from Exhibit 10.1 to the Companys current report on Form 8-K for filed on August 2, 2021).\n10.13\nStock Purchase Agreement dated July 15, 2022 by and among the Company, NuCera Solutions Holdco LP and NuCera Holdings Inc. (incorporated by reference from Exhibit 10.1 to the Companys current report on Form 8-K filed July 19, 2022).\nSubsidiaries of the Registrant\nConsent of Independent Registered Public Accounting Firm - Grant Thornton LLP\n31.1\nCertification of principal executive officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of principal financial officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of principal executive officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of principal financial officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nThe following materials from the Chase Corporation Annual Report on Form 10-K for the fiscal year ended August 31, 2022 formatted in Inline Extensible Business Reporting Language (iXBRL): (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Operations, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Statement of Stockholders Equity, (v) Consolidated Statements of Cash Flows, and (vi) Notes to Consolidated Financial Statements.\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)\n* Identifies management plan or compensatory plan or arrangement.\n(b) See (a)(3) above.\n(c) None.\nITEM 16 - FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nChase Corporation\nBy:\n/s/ Adam P. Chase\nAdam P. Chase\nPresident and Chief Executive Officer\nNovember 10, 2022\nBy:\n/s/ Michael J. Bourque\nMichael J. Bourque\nTreasurer and Chief Financial Officer\nNovember 10, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Peter R. Chase\nExecutive Chairman\nNovember 10, 2022\nPeter R. Chase\n/s/ Adam P. Chase\nDirector, President and Chief Executive Officer\n(Principal Executive Officer)\nNovember 10, 2022\nAdam P. Chase\n/s/ Michael J. Bourque\nTreasurer and Chief Financial Officer\n(Principal Financial Officer and Principal Accounting Officer)\nNovember 10, 2022\nMichael J. Bourque\n/s/ Mary Claire Chase\nDirector\nNovember 10, 2022\nMary Claire Chase\n/s/ Thomas DeByle\nDirector\nNovember 10, 2022\nThomas DeByle\n/s/ John H. Derby III\nDirector\nNovember 10, 2022\nJohn H. Derby III\n/s/ Chad A. McDaniel\nDirector\nNovember 10, 2022\nChad A. McDaniel\n/s/ Dana Mohler-Faria\nDirector\nNovember 10, 2022\nDana Mohler-Faria\n/s/ Ellen Rubin\nDirector\nNovember 10, 2022\nEllen Rubin\n/s/ Joan Wallace-Benjamin\nDirector\nNovember 10, 2022\nJoan Wallace-Benjamin\n/s/ Thomas Wroe, Jr\nDirector\nNovember 10, 2022\nThomas Wroe, Jr."
}