{
    "cik": "831489",
    "company": "SCORES HOLDING CO INC",
    "filing_type": "10-K",
    "filing_date": "2022-10-19",
    "period_of_report": "2020-12-31",
    "sic": "7900",
    "state_of_inc": "UT",
    "state_location": "NY",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/831489/0001104659-22-109919-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/831489/000110465922109919/tm2225279d1_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/831489/0001104659-22-109919.txt",
    "filename": "831489_10K_2020_0001104659-22-109919.htm",
    "content": "ITEM 1. BUSINESS.\nOverview\nScores Holding Company, Inc. was incorporated in Utah on September 21, 1981 under the name Adonis Energy, Inc. We adopted our current name in July 2002. Since 2003, we have been in the business of licensing the Scores trademarks and other intellectual property to fine gentlemens nightclubs with adult entertainment in the United States. As of August 15, 2022 there are six such clubs operating under the Scores name, in Chicago, Illinois; Tampa, Florida; Mooresville, North Carolina; Palm Springs, Florida; Las Vegas, Nevada and Huntsville, Alabama.\nOur trademarks and copyrights surrounding the Scores trade name are critical to the success and potential growth of our business. On December 9, 2013, the Company entered into a license agreement with its subsidiary, Scores Licensing Corp. (SLC), granting SLC the exclusive right to use certain trademarks, including the Scores stylized trademark, in connection with certain goods and services. The grant of license also includes the right to issue sublicenses to third parties, subject to the approval of the Company. Pursuant to the agreement, SLC shall pay to the Company a royalty, as determined by the Company, such as a percentage of net revenue or a flat fee, received in connection with the provision of services and/or sale of goods using the trademarks. SLC may also pay a percentage, as determined by the Company, of all royalties received by SLC under any sublicense agreements. SLC and any sublicensees are to adhere to quality standards as set by the Company, and the Company has the right to inspect all facilities and approve all promotional and marketing materials as well as any related packaging. The agreement has a one-year term with automatic one-year renewals, subject to either partys election to terminate the agreement at least thirty days prior to such renewal. The Company also has the right to terminate the agreement, with immediate effect, upon the occurrence of certain events. The license is subject to any pre-existing license agreements as of the date of the agreement. As of the date of this report, the license is still in full force and effect.\nHistory and Development of our Business\nOn March 31, 2003, pursuant to the Amended and Restated Master License Agreement (the MLA) by and between us and our former affiliate, Entertainment Management Services, Inc. (EMS), an entity owned by two of our former directors and employees, we granted EMS an exclusive, worldwide renewable 20-year license in our property to sublicense the Scores trade name to nightclubs (the Licensing Rights). Under the MLA, EMS was required to pay us 100% of the royalties EMS received from the formerly affiliated clubs (defined below) and 50% of the royalties received from non-affiliated clubs (the Royalty Rights). These clubs had license agreements with EMS pursuant to which they typically paid EMS approximately 4.99% of their gross revenues from operations, including the sale of merchandise. We depended on these royalties to operate our business and as our principal source of revenue.\nOn January 27, 2009 (as further discussed below under Nightclubs Currently Licensing our Scores Brand), we terminated the MLA with EMS and EMS transferred to us all of the Licensing Rights and Royalty Rights. Since termination of the MLA, our intellectual property is licensed through its subsidiary, SLC, to the three remaining clubs that previously had been sublicensing our intellectual property from EMS, and, thus, as of January 27, 2009, we are receiving 100% of the royalty payments made by these clubs rather than the 50% we were entitled to under the MLA.\nUntil January 27, 2009, we were under common control with two previously existing nightclubs in New York, New York (referenced herein as Scores East and Scores West) which were owned, respectively, by 333 East 60th Street, Inc. (333), and Go West Entertainment, Inc. (Go West). EMS is also owned by 333. Through EMS, we had sublicense agreements with each of Scores East and Scores West pursuant to which they were entitled to use the Scores intellectual property. Throughout this report, we refer to Scores East and Scores West as our formerly affiliated clubs.\nAs further discussed below under Change in our Ownership, on January 27, 2009, Mitchells East LLC, wholly owned by Robert M. Gans, acquired a majority interest in our outstanding capital stock. I.M. Operating LLC (IMO), which is partially owned by Robert M. Gans who is also our majority shareholder, has signed a licensing agreement with the Company and commenced operations in New York of a new club (the New York Club) under the Scores name in May 2009. Effective September 1, 2017, IMO no longer owned or operated the New York Club and terminated its licensing agreement with the Company. IMO sold the New York Club to Club Azure LLC (CA) which is owned by Mark Yackow, an unrelated party, and the sole owner (100%) of CA and former Chief Operating Officer of IMO.\nThroughout this report, we refer to each of Scores New York and Scores Atlantic City (as defined below) as our affiliated club because of the common ownership by Mr. Gans, our Chief Executive Officer and Director. All of our clubs, with the exception of Scores New York and Scores Atlantic City (see discussion below under Nightclubs Currently Licensing our Scores Brand), are referred to in this report as non-affiliated clubs or as licensees (or sublicensees, as applicable), a term that may include the formerly affiliated clubs or the New York Club or Scores Atlantic City when the context requires.\nChange in our Ownership\nOn January 27, 2009, pursuant to a stock purchase agreement (the SPA), Mitchells East LLC (Buyer), purchased an aggregate of 88,900,230 shares (the Owned Shares) of our common stock beneficially owned by Richard Goldring and Elliot Osher (collectively the Share Sellers), as well as any rights Harvey Osher (the Share Sellers and Harvey Osher, together, the Sellers) may have in 13,886,059 shares of our common stock (the Decedent Owned Shares) currently held of record by the estate of William Osher, deceased, and any rights the Sellers may have in an additional 2,400,001 shares of our common stock (the Expectancy Shares). Under the terms of the SPA, Harvey Osher is to deliver to the Buyer the Decedent Owned Shares that he may receive, and the Sellers are to deliver to the Buyer any shares of the Company underlying the Expectancy Shares that any such Seller may receive. Additionally, pursuant to the SPA, each of the Sellers granted to Buyer an irrevocable proxy enabling Buyer to act as his proxy with respect to any shares underlying the Decedent Owned Shares and the Expectancy Shares, as applicable.\nThe Owned Shares represent approximately fifty four percent (54%) of our outstanding capital stock and the Owned Shares together with the Decedent Owned Shares represent approximately sixty two percent (62%) of our outstanding capital stock.\nAs a result of the SPA, a change of control had occurred. Robert M. Gans, our Chief Executive Officer and director, is the sole owner of Mitchells East LLC, and currently beneficially owns 53.8% shares of our common stock.\nChanges in our Management\nOn August 6, 2010, we appointed Robert M. Gans as our President and Chief Executive Officer and as a member of our Board of Directors. Robert M. Gans and Martin Gans, one of our existing Board members, are brothers. Also on August 6, 2010, we appointed Howard Rosenbluth as our Treasurer and Chief Financial Officer. Mr. Rosenbluth is also a director.\nIn May 2009, Stephen J. Sabbeth became our director of acquisitions and licensing. He resigned as of August 5, 2021.\nNightclubs Currently Licensing our Scores Brand\nPursuant to the Assignment Agreement between us and EMS dated January 27, 2009, payments due to EMS under existing licenses with non-affiliated clubs were assigned to us. Since this Assignment Agreement, we have retained 100% of the royalty payments from each of these clubs.\nIn 2003, EMS licensed the use of the Scores Chicago name to Stone Park Entertainment, Inc. for its club in Chicago, Illinois. The license is for a term of five years, with five successive five year renewal terms. See Item 3. Legal Proceedings for information regarding our legal proceeding against this licensee. On January 21, 2022 the Company and Scores Chicago entered into a Settlement Agreement and Amendment to the Licensing Agreement agreeing to a one-time payment to settle arrears resulting from the Covid 19 pandemic and to change the monthly licensing fee to a flat rate. All other terms of the original agreement were to remain in effect.\nOn September 30, 2010, we entered into a licensing agreement with Tampa Food & Entertainment, Inc. for the use of the name Scores Tampa. Upon signing the contract, we received a non-refundable fee. The license is for a term of five years, with five successive five year renewal terms. See Item 3. Legal Proceedings for information regarding our legal proceeding against this licensee.\nOn February 10, 2014, we (through our subsidiary SLC) entered into a trademark license agreement with TWDDD, Inc., granting it an exclusive, non-transferable license for the use of certain Scores trademarks in its night club/restaurant in Mooresville, North Carolina. The license is for a term of five years, with five successive five year renewal terms. Pursuant to the written agreement, SLC also granted the licensee a non-exclusive, non-transferable license to sell certain licensed products bearing our trademarks. As discussed in our Notes to the Consolidated Financial Statements because of the tenuous nature of the gentlemens club industry in general and the resulting financial instability of this licensee in particular, the Company follows ASC 606 and only recognizes revenue when the collection of revenue is considered probable.\nEffective August 31, 2015, we (through our subsidiary Scores Licensing Corp.) entered into a trademark license agreement with Palm Springs Grill LLC, granting it an exclusive, non-transferable license for the use of certain Scores trademarks in its night club/restaurant in Palm Springs, Florida. The license is for a term of five years, with five successive five year renewal terms. See Item 3. Legal Proceedings for information regarding our legal proceeding against this licensee.\nEffective December 2, 2016, we (through our subsidiary Scores Licensing Corp.) entered into a trademark license agreement with Southern Highland Centerfolds Inc. granting it an exclusive, non-transferable license for the use of certain Scores trademarks in its night club/restaurant in Las Vegas, Nevada. The license is for a term of five years, with five successive five year renewal terms. On March 23, 2022 the Company and Scores Las Vegas entered into a First Amendment to the Scores Trademark Sublicense Agreement agreeing to a one-time payment to settle arrears resulting from the Covid 19 pandemic and to make a one-time payment for granting it an exclusive, non-transferable license for the use of certain Scores trademarks in its night club/restaurant for a period of twenty-five years. All other terms of the original agreement were to remain in effect.\nOn March 5, 2020, we (through our subsidiary SLC) entered into a trademark license agreement with Cheetah Club LLC, granting it an exclusive, non-transferable license for the use of certain Scores trademarks in its night club/restaurant in Huntsville, Alabama.. The license is for a term of five years, with five successive five year renewal terms. Pursuant to the written agreement, SLC also granted the licensee a non-exclusive, non-transferable license to sell certain licensed products bearing our trademarks. As discussed in our Notes to the Consolidated Financial Statements because of the tenuous nature of the gentlemens club industry in general and the resulting financial instability of this licensee in particular, the Company follows ASC 606 and only recognizes revenue when the collection of revenue is considered probable. See Item 3. Legal Proceedings for information regarding our legal proceeding against this licensee.\nRecent Events\nAs a result of the COVID-19 virus, during the first quarter of 2020 and ongoing, state and local governments have required all but certain essential businesses to close, including all clubs operating under the Scores name. The impact on such clubs' revenue was material in 2020 and resulted in a significant decline in our royalty revenues.\nUpon managements evaluation of relevant hospitality industry conditions and events known as of the date that these financial statements are issued it is their belief the financial effects of the Covid 19 pandemic will not have a substantial or long term effect on the financial viability of the adult entertainment industry. There will be operational changes to be certain but not a consequentially detrimental impact on the industry.\nThat said it should be noted all royalty paying licensees have reopened and are current. In addition, cash collections increased from $235,000 during 2020 to $249,000 and $794,000 during 2021 and 2022 respectively.\nAlthough there are fewer licensees and some of the licensing fees have been re-negotiated management believes the worst of the effects the Covid 19 pandemic are over. The lifting of many, if not all, gathering restrictions imposed by local government has vastly improved the appeal of adult entertainment oriented establishments. Consequently, the Company has seen a recent increase in the number of such establishments interested in utilizing the SCORES brand trademarks.\nCompetition\nThe adult nightclub entertainment business is highly competitive with respect to price, service, location and professionalism of its entertainment. Sublicensed clubs will compete with many locally-owned adult nightclubs. It is our belief, however, that only a few of these nightclubs have names that enjoy recognition and status equal to the Scores brand. Other localities where our Scores brand is licensed have similar competitive environments.\nWe believe the combination of our name recognition and our distinctive entertainment environment allows our licensees to effectively compete within the industry, although we cannot assure anyone that this will prove to be the case. The success of our licensees depends upon their ability to retain quality entertainers, employees and to provide customer service to their customers. The inability to sustain quality entertainers, employees and customer service could have a material or adverse impact on the ability of our licensees to compete within the industry.\nEmployees\nAs of December 31, 2020, we had zero full-time employees. We have no part time employees or independent contractors.\nOur employees were not represented by a labor organization or covered by a collective bargaining agreement. We believe that we maintain a good working relationship with our employees and to date, we have not experienced any significant labor disputes.\nIntellectual Property\nOur business is dependent on a combination of trademarks, domain names, trade names, trade secrets and other proprietary rights in order to protect our intellectual property rights. As of the date of this report, we have 15 registered trademarks in the United States.\nGovernment Regulation\nOur licensees are subject to a variety of governmental regulations depending upon the laws of the jurisdictions in which they operate. The most significant governmental regulations are described below.\nLiquor Licenses\nOur licensees are subject to state and local licensing regulation of the sale of alcoholic beverages. We expect licensees to obtain and maintain appropriate licenses allowing them to sell liquor, beer and wine. Obtaining a liquor license may be a time consuming procedure. In New York, for example, a licensee must make an application to the New York State Liquor Authority (the NYSLA) for a liquor license regarding its proposed nightclub. The NYSLA has the authority, in its discretion, to issue or deny such a license request. The NYSLA typically requires local community board approval in connection with such grants. Approval is usually granted or denied within 90-120 days from the initial application date, but can take longer in certain circumstances. Other jurisdictions have their own procedures.\nWe cannot offer any assurance that our licensees will obtain liquor licenses or that, once obtained, they will maintain their liquor licenses or be able to assign or transfer them if necessary. A license to sell alcoholic beverages in many cases requires annual renewal and may be revoked or suspended for cause, including any regulatory violation by the nightclub operating the license or its employees. Royalties for our business could decrease, if one or more of our licensees fails to maintain its liquor license.\nCabaret Licenses\nAlthough not a requirement, our licensees typically request a cabaret license in connection with the operation of their nightclubs. Cabaret licenses are not a requirement in all states; however, some states mandate that such licenses be obtained prior to the operation of an adult nightclub. For example, one of our formerly affiliated clubs was granted a cabaret license for a nightclub by the City of New Yorks Department of Consumer Affairs (the DCA). We believe our licensees comply with all regulatory laws regarding cabaret or an adult entertainment license; however, there is no assurance that any of their licenses will remain effective or that they could be assigned or transferred if necessary. If one or more of our licensees failed to maintain a required license, this could have a material or adverse effect on our cash flow and profitability.\nZoning Restrictions\nAdult entertainment establishments must comply with local zoning restrictions which can be stringent. For example, zoning regulations in the City of New York mandate that an adult entertainment business operate in an area zoned as residential, or in areas that are commercially zoned, and devotes more than either 40% or more of its space available to customers or 10,000 square feet for adult entertainment activities. Although we expect our licensees to operate within zoned areas, we cannot make any assurances that local zoning regulations will remain constant, or that if changed, our licensees will be able to continue operations under our Scores brand name trademark. If zoning regulations were to restrict the operations of one or more of our licensees, this could have a material or adverse effect on our cash flow and profitability.\nTrademarks\nWe hold trademark and/or service mark registrations in the United States. Such registrations were granted on various dates and are subject to renewal on various dates. Some of these trademarks are also registered in other jurisdictions outside of the United States. Applications have also been filed in the United States for other trademarks and/or service marks incorporating the SCORES word trademark, as well as others.\nOur trademarks and service marks provide significant value to us and are an important factor in our business. We believe that our trademarks and service marks do not infringe the intellectual property rights of any third parties.\nAvailable Information\nOur Internet website is www.scoresholding.com. Information on our website should not be considered incorporated by reference into our filings with the SEC. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to reports filed or furnished pursuant to Sections 13(a) and 15(d) of the Exchange Act are available, free of charge, under the SEC filings tab of our website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. Additionally, the SEC maintains a website located at www.sec.gov that contains the information we file or furnish electronically with the SEC. ITEM 1A. RISK FACTORS.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES.\nAs of July 1, 2008, West Side Realty (WSR), the owner of the West 27th Street Building, became the new lessor of our 700 square feet office occupancy at that location. Since April 1, 2009, the monthly rent, which includes overhead cost, has been $2,500. Robert M. Gans, the Companys President, Chief Executive Officer, and majority shareholder, is the majority owner (80%) of WSR. The Company owed WSR $30,000 and $7,500 in unpaid rents as of December 31, 2020 and December 31, 2019, respectively.\nEffective January 1, 2021, Metropolitan Lumber Hardware and Building Supplies, Inc.(Metropolitan) located at 617 11th Avenue, New York, N.Y. became the new lessor of our 500 square feet office occupancy at that location. The monthly rent, which includes overhead cost will remain at $2,500. Robert M. Gans, the Companys President, Chief Executive Officer, is the sole owner (100%) of Metropolitan.\nWe believe that our facilities are suitable and adequate for our present needs. ITEM 3. LEGAL PROCEEDINGS.\nOn April 3, 2016, 50 individuals purporting to be professional models and/or actresses collectively, the Plaintiffs) filed a civil suit in the United States District Court for the Southern District of New York against the Company, I.M. Operating, LLC, The Executive Club, LLC, and Robert M. Gans, collectively the (Defendants) alleging that images of Plaintiffs were used without their consent for commercial purposes on websites and social media outlets to promote gentlemens clubs operated by the Defendants or licensees of the Defendants (the Lawsuit). The Lawsuit further alleged that the unauthorized use of these images created, among other things, the false impression that these individuals either worked at, or endorsed, one or more of such clubs. The Lawsuit asserted causes of action under Section 43 of the Lanham Act, 28 U.S.C. § 1125(a)(1), premised on a theory of false endorsement and/or association; New York Civil Rights Law §§ 50-51; New Yorks Deceptive Trade Practices Act, New York General Business Law § 349; as well as various common law torts, namely defamation, negligence, conversion, unjust enrichment and quantum meruit. The Lawsuit sought unspecified compensatory damages, punitive damages, as well as attorneys fees and costs. The Lawsuit also sought an injunction permanently enjoining the use of the individuals images to promote, via any medium, any of the clubs. On April 20, 2017, as a result of the claims asserted in the Lawsuit, the Company filed a third-party complaint (the Third-Party Complaint) against certain licensees, namely CG Consulting, LLC; Anthony Quaranta; High Five Management Group, Inc.; Club 2000 Eastern Avenue, Inc.; SCMD, LLC; David Baucom; Manhattan Fashion L.L.C.; Stone Park Entertainment, Inc.; Silver Bourbon, Inc.; Tampa Food & Entertainment, Inc.; Fuun House Productions, L.L.C.; Norm A Properties, LLC; Southeast Show Clubs, LLC; Michael Tomkovich; Palm Spring Grill LLC; Houston KP LLC; and Star Light Events LLC (collectively, Third-Party Defendants) asserting causes of action for breach of contract, breach of warranty, contractual indemnification, common law indemnification, contribution and breach of contract for failure to procure insurance. The Company maintained in the Third-Party Complaint, among other things, that pursuant to the Third-Party Defendants respective license agreements, each of the Third-Party Defendants are expressly obligated to indemnify, defend and hold the Company harmless in connection with the conduct giving rise to the claims asserted by Plaintiffs in the Lawsuit. Third-Party Defendants Club 2000 Eastern Avenue, Inc., Fuun House Productions, L.L.C., and Norm A Properties, LLC (collectively the Defaulting Third-Party Defendants) failed to respond to the Third-Party Complaint.\nOn January 5, 2017, the Court issued an Order granting in part, and denying in part, Defendants motion to dismiss the Complaint. The Court dismissed Plaintiffs claims sounding in negligence, conversion, unjust enrichment and quantum meruit. The remaining claims were not dismissed at that time. On August 4, 2018, the Court dismissed Plaintiffs claims against Defendants, including the Company, with prejudice, at Plaintiffs request following settlement with Defendants. During 2018, the Company paid $1,310,000 to Plaintiffs in connection with the settlement. Between August 4, 2018 and October 9, 2018, the Court dismissed with prejudice the Companys claims against the Third-Party Defendants, other than the Defaulting Third-Party Defendants, at the Companys request following settlement with those Third-Party Defendants. The total amount of money paid to the Company by the settling Third-Party Defendants, and the Companys insurance carrier, is $505,660, paid thru September 30, 2019 and $90,000 received during the nine months ended September 30, 2019. Scores has obtained Default Orders against Fuun House Productions, L.L.C. and Norm A Properties, LLC. The value of the Companys claims against Fuun House Productions, L.L.C. and Norm A Properties, LLC are all that remain to be determined in the action. The Company became aware during the week of December 17, 2018 that Fuun House Productions, L.L.C. has filed for bankruptcy protection.\nOn January 3, 2017, the Company, together with its subsidiary SLC, filed an action against CJ NYC Inc. in the United States District Court for the Southern District of New York. Defendant utilizes the Scores name and trademark in connection with its ownership and operation of an adult entertainment club in Woodside, New York. In this action the Company sought damages for breach of contract in the amount of $85,000 and the issuance of a preliminary and permanent injunction prohibiting the defendant from using the Scores name and trademark with respect to the Woodside, New York club and all websites and social media sites controlled by Defendant. The defendant failed to appear and on February 27, 2017, the Company filed a motion for judgment by default. The court heard the Company motion on April 5, 2017, and on May 25, 2017, the court granted the Companys motion for a Judgment by default, granting a permanent injunction and awarding damages in the amount of $85,000 to SLC and $14,333 in damages and $530 in costs to the Company. All signage has been removed and the Company is attempting to collect on the default judgment, but it believes that Defendant no longer has any assets, leaving the Company unable to collect on the default judgment.\nOn January 31, 2017, the Company, together with its subsidiary SLC, filed an action against Funn House Productions LLC in the United States District Court for the Southern District of New York. Defendant utilizes the Scores name and trademark in connection with its ownership and operation of an adult entertainment club in New Haven, Connecticut. In this action the Company sought damages for breach of contract in the amount of $45,000 and the issuance of a preliminary and permanent injunction prohibiting the defendant from using the Scores name and trademark with respect to the New Haven, Connecticut club and all websites and social media sites controlled by Defendant. The Defendant failed to appear and on February 28, 2017, the Court granted Plaintiffs motion for a Judgment by default, granting a permanent injunction and awarding damages in the amount of $60,000. The parties negotiated a settlement agreement, which included a payment schedule, but then Defendant did not sign the proposed settlement agreement. The Company is attempting to collect on the default judgment, but it believes that Defendant no longer has any assets, leaving the Company unable to collect on the default judgment.\nOn July 25, 2017, plaintiff Dislenia Munoz, who formerly performed as an adult entertainer at Scores New York, owned in its entirety by I.M. Operating LLC, commenced a putative class action lawsuit against the Company, IMO, Robert Gans and Mark Yackow in the Supreme Court of the State of New York, County of New York. Plaintiff alleged that she and other similarly situated entertainers at Scores New York were misclassified as independent contractors, that they should have been classified as employees, and as a result, the Defendants violated, among other things, applicable state wage and hour laws. The Lawsuit sought unspecified compensatory damages, liquidated damages, as well as attorneys fees and costs. On September 22, 2018, Plaintiff (1) amended her complaint in the Lawsuit to excise her class allegations, and (2) discontinued the Lawsuit, without prejudice. Plaintiff has brought her claims in the Lawsuit in another forum against the Defendants, other than the Company, which is no longer a subject of Plaintiffs claims.\nOn October 8, 2018, the Company was served with a Summons and Complaint in the action entitled Luisa Santos de Oliveira v. Scores Holding Company, Inc.; Club Azure, LLC; Robert Gans; Mark S. Yackow; Howard Rosenbluth, Docket No. 1:18-cv-06769-GBD, in the United States District Court of the Southern District. Plaintiff claims that the Defendants violated the minimum wage and overtime provisions of the Fair Labor Standards Act (FLSA); violated the New York Minimum Wage Act and the overtime provisions of the New York State Labor Law (NYLL); violated the Spread of Hours Wage Order of the New York Commissioner of Labor; violated the Notice and Recordkeeping requirements of the NYLL; violated the wage statement provisions of the NYLL; recovery of equipment costs in violation of the FLSA and NYLL; and unlawful deductions from tips in violation of the NYLL. Plaintiff brought this action as a class action and seeks certification of this action as a collective action on behalf of herself and all other similarly situated employees and former employees of Defendants. The Company has submitted an Answer to Plaintiffs claims and the case is currently in the discovery phase. The Company, along with the Co-defendants, intends to vigorously defend itself against the claims asserted against it in this lawsuit. The likelihood of an unfavorable outcome is remote because the Companys records show, inter alia, that the Plaintiff never worked more than 25 hours per week. The case was assigned to a Magistrate Judge. There was a conference on March 2, 2021 and a Scheduling Order was entered. On March 26, 2021, a Stipulation of Discontinuance was so-ordered by the Federal Court, discontinuing all claims against the Company.\nOn October 10, 2018, the Company, filed an action against SCMD, LLC, in the Supreme Court of the State of New York, County of New York. Defendant utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in Baltimore, Maryland and paid royalty fees to the Company up through and including July of 2017 but did not abandon its use of the Scores name and trademarks until September of 2018. In this action, the Company sought damages for breach of contract in the amount of $160,000. On December 5, 2018, the case was removed to the United States District Court for the Southern District of New York. On February 19, 2019, an Amended Complaint was filed. On March 8, 2019, Defendants counsel requested permission from the Court to submit a motion to dismiss the Companys amended complaint. The Court finally granted Defendants request on November 6, 2019 and gave a briefing schedule. Defendants motion to dismiss was denied on August 14, 2020. In September of 2020, the parties settled this matter for $50,000, of which $5,000 remains due and outstanding. SCMD, LLC has since been dissolved. We are still trying to collect the remaining $5,000 that is due to the Company, but we are not confident that we will be successful given that SCMD, LLC has been dissolved. As a result, we have ceased all attempt to collect and have closed our file.\nOn September 14, 2018, the Company and its subsidiary Scores Licensing Corp. (SLC), filed an action against New 4125, LLC and Mike Taraska in the Supreme Court of the State of New York, County of New York. Defendants utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in Phoenix, Arizona. In this action, the Company sought damages for breach of contract in the amount of $47,500. Defendants filed an Answer to the Complaint but it was not submitted by an attorney notwithstanding the fact that corporations must be represented by counsel. A motion to vacate the Answer based on the fact that the corporate defendant is not represented by counsel is pending. We are currently pursuing both the corporation and the individual defendant.\nOn May 4, 2018, we together with our subsidiary SLC filed a civil action in Supreme Court of New York, New York County against Bonkers Space Coast Inc. and Ken Fees, the former licensee of the SCORES Green Bay, for unpaid royalties in the amount of $80,000. The Defendants have not appeared and Plaintiffs have filed a motion for judgment by default. A motion for default judgement was granted and judgement was entered on November 26, 2019. The Company has found real property owned by the Defendant and we are in the process of attaching same. We filed an exemplified copy of the default judgment with the State Court in Wisconsin, to collect licensing fees. A judgment was docketed on September 12, 2020 in Manitowoc County, WI for $82,330.34. The real property is valued at approximately $97,000 but the Wisconsin Homestead Act allows the debtor to exempt as much as $75,000 of equity. There is also a prior mortgage and tax lien totaling approximately $45,000. We have therefore ceased attempts to collect on the judgment because there is no remaining equity left in the real property.\nOn August 3, 2018, the Company and its subsidiary SLC, filed an action against Silver Bourbon, Inc. in the Supreme Court of the State of New York, County of New York. Defendant utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in New Orleans, Louisiana. In this action, the Company seeks damages for breach of contract in the amount of $145,500. The parties were in the process of negotiating a settlement but then the club permanently closed after it lost its lease and was forced to close in March of 2020 due to the global pandemic. We have therefore ceased all attempts to collect this debt.\nOn July 13, 2018, Company and its subsidiary SLC, filed an action against Manhattan Fashions, LLC in the Supreme Court of the State of New York, County of New York. Defendant utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in Harvey, Louisiana. In this action, the Company sought damages for breach of contract in the amount of $84,000. Defendant did not appear, and On February 6, 2019, the Court granted the Companys motion for default judgment. The parties were in the process of negotiating a settlement agreement but then ceased all attempts to settle this matter after the club was forced to permanently close in March of 2020 due to the global pandemic. We have therefore ceased\nOn September 5, 2019, the Company together with its subsidiary SLC filed a civil action in Supreme Court of New York, New York County against Scores Alabama. A cease and desist letter was sent. The Company finally entered into a license agreement as of March 5, 2020 with Cheetah Club, LLC for a club located in Huntsville, Alabama.\nThe Company had been in the process of negotiating a license agreement with an adult entertainment club that started using the Scores name and trademark in connection with an adult entertainment club located in Huntsville, Alabama without a proper licensing agreement in place.\nCharles G. Westlund personally guaranteed The Cheetah Clubs obligations under the license agreement. The Cheetah Club has since breached the license agreement by refusing to pay licensing fees. Notices to Cure were sent to both the Cheetah Club and Mr. Westlund, which were ignored. The license has since been terminated and they have been ordered to cease and desist all use of the Scores brand, but Scores Alabama continues to use the Scores brand without paying for the right to do so. As a result, we are in the process of commencing action against both The Cheetah Club and Mr. Westlund.\nIn July 2018, the Company entered into a confidential settlement agreement (the Settlement Agreement) in the Voronina litigation, and in August 2018, the Court entered an order dismissing the plaintiffs claims against the Defendants with prejudice. Metropolitan, loaned the Company an aggregate of $770,000 to enable the Company to make the payments called for by the Agreement.\nAs previously reported, in February 2017, the Company entered into settlement agreements (each, a Royalty Settlement Agreement) with Star Light, Swan, IMO and Robert M. Gans. Robert M. Gans is the owner of a majority of the equity of each of aforementioned Licensees. Pursuant to the Royalty Settlement Agreements, the Company forgave the repayment of a certain portion of unpaid, past-due royalties in return for the respective Licensees agreements to pay the remainder (the Royalty Settlement Amount) of the unpaid royalties, plus interest, to the Company. The Royalty Settlement Amount for each Licensee was represented by a promissory note, and Robert M. Gans guaranteed the payment of each Licensees obligations under the Settlement Agreement.\nThe Licensees did not remain current with respect to their obligations under the Royalty Settlement Agreements, and the Company did not call upon Robert M. Gans to honor his guarantees. The past due amounts under the Royalty Settlement Agreements aggregated $382,259 (the Aggregate Royalty Amount) as of December 1, 2018. As of such date, the Company, the Licensees, Metropolitan and Robert M. Gans entered into a Settlement and Offset Agreement (the Offset Agreement) pursuant to which the Aggregate Royalty Amount was offset against the Voronina Amount, thereby reducing the amount owed by the Company to Metropolitan to $408,546 (the Net Voronina Amount). The Net Voronina Amount is payable pursuant to a promissory note (the Voronina Note), which bears simple interest at the rate of 4% per annum, in 86 consecutive monthly installments of $5,000, and a final installment of $1,370, with the initial installment due and payable on January 1, 2022 (or the first business day thereafter). The Company may prepay the Voronina Note at any time, in whole or in part without premium or penalty. The Offset Agreement also provides for the immediate termination of the Royalty Settlement Agreements and the related promissory notes and guarantees. This note was paid in its entirety on March 28, 2023.\nOn January 29, 2020, an individual referred to as Jane Doe, the Plaintiff, filed a civil suit in in the Circuit Court of the 13th Judicial Circuit, in the State of Florida, Hillsborough County, against the Company, its subsidiary, Scores Licensing Corp. (SLC), and several other defendants. Plaintiffs Complaint details the somber circumstances surround the illegal actions of a non-party, who pled guilty to certain crimes against Plaintiff that were committed at a club known as Scores Tampa. Plaintiff now seeks to hold the Company and its subsidiary, among other defendants, liable in connection with the non-partys illegal activity by asserting causes of action for negligence, vicarious liability and unjust enrichment. Initially, prior counsel moved to dismiss Plaintiffs Complaint in lieu of filing Answers. A motion to dismiss was submitted because the Court lacks personal jurisdiction under Floridas Long-Arm Statute and Due Process Requirements because neither the Company or its subsidiary had minimum contacts with Florida; nor was their a benefited conferred upon them.\nThe Court denied the motion to dismiss, and Scores Holding and Scores Licensing have filed Amended answers and Affirmative Defenses denying all allegations of the complaints against them asserting legal defenses to liability. The case is now in the deposition stages of discovery. Discovery deadline is October 14, 2022, except for expert disclosures, which are to be completed by December 27, 2022. The Deadline for dispositive motions is February 11, 2023. Deadline for a CME of Plaintiff is February 12, 2023. The deadline for completion of expert discovery is March 15, 2023. The mediation deadline is April 14, 2023. The trial is set for July 24, 2023, with pretrial conference set for July 18, 2023.\nOn July 15, 2019, plaintiff Jeremy Green, a former consultant to Swan Media Group, Inc (SMG), commenced an action in U.S. District Court, Southern District of New York against Scores Holding Co., Inc., Scores Media Group LLC, Scores Digital Gaming LLC (SDG) and individual defendants Robert Gans and Charilaos Yioves seeking to recover from all defendants under various theories of breach of contract, unjust enrichment, promissory estoppels, fraudulent inducement and breach of implied duty of good faith and fair dealing.\nOn October 6, 2022 to avoid expense, inconvenience, and uncertainty of further litigation, the Company has agreed to settle this matter for $10,000. Greene will receive the settlement sum in two payments of $5,000 each. The first settlement payment will be made upon execution of the settlement agreement and the second payment will be due thirty days after the first payment.\nOn April 17, 2021, in an action entitled Jessica Hall v. Scores Holding Company, Inc., et al, filed in Federal Court, Southern District, the Plaintiff claims that, while she worked at a gentlemens club located in New York, New York and commonly known as Scores NY, she was discriminated and retaliated against because of her race in violation of both Federal and State law. A motion for default judgment was denied, and Plaintiff was recently granted permission to file and serve an Amended Complaint. Accordingly on February 4, 2022 a First Amendment Complaint was filed. On March 4, 2022 an Answer to the First Amendment Complaint was filed On March 18, 2022 the Defendants filed A First Demand for Interrogatories Upon the Defendant. We have made demands for discovery from the Plaintiff and motioned for summary judgement seeking dismissal of all claims, which is pending. The likelihood of success on the merits is negligible because the Company, as simply the owner of the Scores brand and trademarks, did not own, operate or otherwise control Scores NY or employ, manage, or otherwise control Plaintiffs employment during the period October 23, 2009 until September 18, 2019. Towards that end, a motion for summary judgment was fully submitted on behalf of the Company on June 24, 2022. We await the Courts decision. In the meantime, discovery is ongoing.\nAs of the date of this report, there are no other material legal proceedings pending to which we or any of our property are subject, nor to our knowledge are any such proceedings threatened. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable. ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information.\nOur common stock has been quoted on OTC Pink, a marketplace under the OTC Markets Group (formerly known as Pink OTC Markets and Pink Sheets) under the symbol SCRH since 2004.\nCurrently we are a Pink No Information company and a stop sign was placed on our Company. The Company may not be making material information publicly available. Buying or selling a security on the basis of material nonpublic material information is prohibited under Section 10(b) of the Securities Exchange Act of 1934 and Rules 10b-5 and 10b5-1 thereunder. Violators may be subject to civil and criminal penalties.\nThe OTC Markets is a quotation service that displays real-time quotes, last-sale prices, and volume information in over-the-counter, or the OTC, equity securities, and may not necessarily represent actual transactions.\nOn October 14, 2022, the closing price per share of our Common Stock as quoted on the OTC Pink was $.001 per share. During September 2020, the Company was delisted as result of the inability to timely file required annual and quarterly reports.\nHolders\nAs of October 14, 2022, there were 578 record holders of our common stock.\nDividends\nWe have never declared any cash dividends with respect to our common stock. Future payment of dividends is within the discretion of our Board of Directors and will depend on our earnings, capital requirements, financial condition and other relevant factors. Although there are no material restrictions limiting, or that are likely to limit, our ability to pay dividends on our common stock, we presently intend to retain future earnings, if any, for use in our business and have no present intention to pay cash dividends on our common stock.\nRecent Sales of Unregistered Securities\nNone.\nSecurities Authorized For Issuance under Equity Compensation Plans\nThe following table sets forth information about our equity compensation plans as of December 31, 2020.\nPlan category Number of securities to\nbe issued upon\nexercise of outstanding\noptions, warrants\nand rights\n(a) Weighted-average\nexercise price of\noutstanding options,\nwarrants and rights\n(b) Number of securities\nremaining available for\nfuture issuance under equity\ncompensation plans (excluding\nsecurities reflected in column (a))\n(c)\nEquity compensation plans approved by security holders $ 0\nEquity compensation plans not approved by security holders $ 0\nTotal $ 0\nQuarter Ended\nHigh Bid\nLow Bid\nMarch 31, 2019\n$ .002\n$ .002\nJune 30, 2019\n$ .002\n$ .002\nSeptember 30, 2019\n$ .002\n$ .002\nDecember 31, 2019\n$ .008\n$ .002\nMarch 31, 2020\n$ .000\n$ .000\nJune 30, 2020\n$ .000\n$ .000\nSeptember 30, 2020\n$ .000\n$ .000\nDecember 31, 2020\n$ .000\n$ .000 ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThis discussion contains forward-looking statements within the meaning of Section 27A of the Securities Act and Section 21E of the Exchange Act. The words believe, expect, anticipate, intend, estimate, may, should, could, will, plan, future, continue, and other expressions that are predictions of or indicate future events and trends and that do not relate to historical matters identify forward-looking statements. These forward-looking statements are based largely on our expectations or forecasts of future events, can be affected by inaccurate assumptions, and are subject to various business risks and known and unknown uncertainties, a number of which are beyond our control. Therefore, actual results could differ materially from the forward-looking statements contained in this document, and readers are cautioned not to place undue reliance on such forward-looking statements.\nWe undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. A wide variety of factors could cause or contribute to such differences and could adversely impact revenues, profitability, cash flows and capital needs. There can be no assurance that the forward-looking statements contained in this document will, in fact, transpire or prove to be accurate.\nSummary of Critical Accounting Policies and Estimates\nThe following summary of our critical accounting policies is presented to assist in understanding our consolidated financial statements. The consolidated financial statements and notes are representations of our management, who are responsible for their integrity and objectivity. These accounting policies conform to accounting principles generally accepted in the United States of America and have been consistently applied in the preparation of the consolidated financial statements. Additional information about our accounting policies and estimates may be found in Note 2 to our consolidated financial statements included in this report.\nWe make certain estimates and assumptions that affect the reported amounts of assets and liabilities and the reported amounts of revenues and expenses. The accounting policies described below are those we consider critical in preparing our financial statements. Some of these policies include significant estimates made by management using information available at the time the estimates were made. However, these estimates could change materially if different information or assumptions were used.\nRevenue Recognition\nUnder ASC 606, revenue from the initiation fees are recognizable when at a point in time (first month of the contract) and royalty revenues are recognized over time for those contracts with probable collections.\nThe Company's license fee revenue is generated from royalties earned through intellectual property licensing agreements which permit the licensee to use the recognition and status of the Scores brand in order to promote their businesses. Under ASC 606, revenue is recognized throughout the life of the executed licensing agreement. The Company measures revenue based on consideration specified in a contract with a customer. Furthermore, the Company recognizes revenue when it satisfies a performance obligation by transferring control over the service to its customer.\nA performance obligation is a promise in a contract to transfer a distinct service to the customer. The transaction price of a contract is allocated to each distinct performance obligation and recognized as revenue when or as the customer receives the benefit of the performance obligation. The Company's customers typically receive the benefit of its services as they are performed. Substantially all customer contracts provide that the Company is compensated for services performed to date. Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by the Company from a customer, are excluded from revenue.\nNature of goods and services\nThe following is a description of the Company's products and services from which it generates revenue, as well as the nature, timing of satisfaction of performance obligations, and significant payment terms for each:\ni. Licensing Revenue\nLicensing fees represent the fees the Company receives from the licensing of the Company's Scores trademark. The terms of the royalties earned under these license agreements vary from a flat monthly fee to a percentage of the revenues of the licensee on a monthly basis. The licensing rights are transferred to the Company's customers over time, and the Company recognizes licensing revenue over time because the customer will simultaneously receive and consume the benefit from the license as the performance occurs.\nii. Stand-Ready for Consulting and Club Set-up Services\nThe Company offers an initial set-up and consultation to new clubs in order to aid in the opening and operation. The services are provided within the first month of any licensing agreements, and sometimes are not requested by the licensee and therefore never provided at all.\nInflation\nAlthough the effects of inflation vary by company the company believes there are two issues wherein inflationary trends may affect their accounting and financial reporting.\nBecause inflation is most likely driving up the costs of acquiring goods and services, as well as employee wages, the Company is looking for ways it can absorb or pass along those increased costs to its licensees.\nIn addition, Inflation may result in renegotiating long-term contracts, such as leases or long-term licensing agreements, which in turn may have potential accounting implications. For example, depending on the terms, a modification to a licensing agreement may be necessary for the Company to continue to honor the agreement. All the licensing agreements have good guy termination provisions that can be exercised as part of the renegotiating process.\nSeasonality\nSeasonality can be defined as periodic fluctuations and cycles in specific areas of a business following some pattern. It can be a calendar one like summer and spring or an economic one like the Christmas season.\nYou can use the concept of seasonality in the analysis of stock prices and market trends, or a company can use it to improve working capital management. As an example, if a company usually has lower sales in the second quarter of the year, it can decrease inventory purchases to avoid overstocking.\nUpon reviewing the Companys past financial performance there does not seem to be any seasonality to the licensing of their intellectual property rights and trademarks. Although its licensees may experience some seasonal fluctuations in their business due to fluctuations in the local climate where they are located the Companys revenue stream is unaffected by it.\nImpact of COVID-19\nAs a result of the COVID-19 virus, during the first and second quarter of 2020, state and local governments have required all but certain essential businesses to close, including all eight clubs operating under the Scores name. The impact on such clubs' revenue was material in 2020 and resulted in a significant decline in our royalty revenues.\nUpon managements evaluation of relevant hospitality industry conditions and events known as of the date that these financial statements are issued it is their belief the financial effects of the Covid 19 pandemic will not have a substantial or long term effect on the financial viability of the adult entertainment industry. There will be operational changes to be certain but not a consequentially detrimental impact on the industry.\nThat said it should be noted all royalty paying licensees have reopened and are current. In addition, cash collections increased from $235,000 during 2020 to $249,000 and $794,000 during 2021 and 2022 respectively.\nAlthough there are fewer licensees and some of the licensing fees have been re-negotiated management believes the worst of the effects the Covid 19 pandemic are over. The lifting of many, if not all, gathering restrictions imposed by local government has vastly improved the appeal of adult entertainment oriented establishments. Consequently, the Company has seen a recent increase in the number of such establishments interested in utilizing the SCORES brand trademarks.\nResults of Operations\nThe following is a discussion of the results of operations for the year ended December 31, 2020 compared to the year ended December 31, 2019.\nRevenues:\nRevenues decreased to $263,142 for the year ended December 31, 2020 from $583,530 for the year ended December 31, 2019.\nOur licenses are structured such that we receive royalty payments representing a percentage of revenues of the licensee, or structured with a flat monthly rate. The foregoing decrease is a direct result of a decline in royalty revenues and COVID-19. As a result of the COVID-19 virus, during the first and second quarter of 2020, state and local governments have required all but certain essential businesses to close, including all eight clubs operating under the Scores name.\nOther Income/(Expense)\nTotal other income decreased to $32,447 for the year ended December 31, 2020 from total other income of $73,559 for the year ended December 31, 2019. Total other income for the year ended December 31, 2020 was comprised of interest expense of $15,778 and other income of $48,225. Total other income for the year ended December 31, 2019 included a $90,000 recovery of the $1,300,000 Litigation Settlement payment paid to us by various licensees, and interest expense of $16,441.\nGeneral and Administrative Expenses:\nGeneral and administrative expenses for the years ended December 31, 2020 and 2019 were $387,254 and $662,891, respectively. Virtually all the decrease in operating expenses can be attributed to the decrease in salary, legal and other expenses. Legal expenses, which are reflected in general and administrative expenses, attributable to ongoing litigation amounted to $25,918 for 2020 and $111,609 for 2019.\nProvision for Income Taxes\nThe provision for income taxes relates primarily to the greater of average assets and capital taxable income. The average assets and capital are not impacted by net operating losses.\nNet Loss per share:\nOur net loss was $91,665 or ($.00) per share for the year ended December 31, 2020 as compared to our net loss was $5,802 or ($.00) per share for the year ended December 31, 2019. The increase in net loss for the year ended December 31, 2019, was primarily due to COVID-19.\nNet loss per share data for both the years ended 2020 and 2019 is based on net loss available to common shareholders divided by the weighted average of the number of common shares outstanding.\nLiquidity and Capital Resources\nAt December 31, 2020, we had $21,143 in cash and cash equivalents compared to $9,331 in cash and cash equivalents at December 31, 2019.\nVarious conditions such as the decrease in revenue, accumulated losses, significant debt, and the results of litigation raise substantial doubt about the Companys ability to continue as a going concern for a period of one year from the issuance of these consolidated financial statements. The Company raised and intends to raise additional working capital through the continued licensing of its brand with its current and new operators. There are no assurances that the Company will be able to achieve the level of revenues adequate to generate sufficient cash flow from operations to support the Companys working capital requirements. To the extent that funds generated from any future use of licensing are insufficient, the Company will have to raise additional working capital. No assurance can be given that additional financing will be available, or if available, will be on terms acceptable to the Company. If adequate working capital is not available, the Company may not continue its operations. The consolidated financial statements do not include any adjustments relating to the recoverability and classification of asset carrying amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nCash:\nAt December 31, 2020, we had $21,143 in cash and cash equivalents compared to $9,331 in cash and cash equivalents at December 31, 2019.\nOperating Activities:\nNet cash provided by operating activities for the years ended 2020 and 2019 was $11,812 and $56,528, respectively. The decrease in cash provided by operating activities is related to the increase in net loss and decrease in accrued expenses, directly related to COVID-19.\nFinancing Activities:\nNet cash used in financing activities for the 2020 year was $-0- and net cash used by financing activities for the 2019 year was $70,000.\nFuture Capital Requirements:\nWe have incurred significant losses since the inception of our business. Since our inception, we have been dependent on funding from private lenders and investors to conduct operations. As of December 31, 2020, we had an accumulated deficit of $(6,991,660).As of December 31, 2020, we had total current assets of $99,981 and total current liabilities of $273,646 or negative working capital of $173,665. As of December 31, 2019, we had an accumulated deficit of $(6,899,995). As of December 31, 2019, we had total current assets of $70,763 and total current liabilities of $221,644 or negative working capital of $150,881. The increase in the amount of negative working capital has been primarily attributable to the increase in payables.\nWe continued to collect licensing fees furing 2020 to 2022 to fund current operations.\nAs of December 31, 2020, we owed $30,000 in rent to our Westside Realty affiliate and $67,500 to our Metropolitan Lumber Hardware and Building Supplies, Inc. affiliate. As of December 31, 2019, we owed $7,500 in rent to our Westside Realty affiliate and $37,500 to our Metropolitan Lumber Hardware and Building Supplies, Inc. affiliate.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet debt, nor did we have any transactions, arrangements, obligations (including contingent obligations) or other relationships with any unconsolidated entities or other persons that may have a material current or future effect on financial conditions, changes in the financial conditions, results of operations, liquidity, capital expenditures, capital resources, or significant components of revenue or expenses. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nOur audited consolidated financial statements as of, and for the years ended, December 31, 2020 and 2019 are included beginning immediately following the signature page to this report. See Item 15 for a list of the financial statements included herein. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\n(a) Managements Report on Disclosure Controls and Procedures\nUnder the supervision and with the participation of our senior management, consisting of Robert M. Gans, our chief executive officer, and Howard Rosenbluth, our chief financial officer, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, as of the end of the period covered by this report (the Evaluation Date). Based on this evaluation, our chief executive officer and chief financial officer concluded, as of the Evaluation Date, that as a result of certain deficiencies in our internal over financial reporting identified below, our disclosure controls and procedures were not effective to ensure that the information relating to us required to be disclosed in our Securities and Exchange Commission (SEC) reports (i) is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (ii) is accumulated and communicated to our management, including our chief executive officer and chief financial officer and secretary, as appropriate, to allow timely decisions regarding required disclosure\n(b) Managements Annual Report on Internal Control over Financial Reporting.\nManagement of Scores Holding Company, Inc. is responsible for establishing and maintaining an adequate system of internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f)).\nOur internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes of accounting principles generally accepted in the United States. In evaluating the effectiveness of our internal control over financial reporting, management used the criteria set forth in the framework in Internal Control-Integrated Framework and the Internal Control over Financial Reporting - Guidance for Smaller Public Companies both issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBased on this evaluation, management concluded that, as of December 31, 2020 our internal controls over financial reporting were not effective for the following reasons:\n· We did not maintain effective controls to timely generate information for use in the financial reporting close process.\n· We did not maintain effective controls over the review of journal entries and account reconciliations to ensure that these entries and reconciliations were correct.\n· A deficiency in internal control over financial reporting exists when the design or operation of a control does not allow management or employees, in the normal course of performing their assigned functions, to prevent or detect misstatements on a timely basis. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the company's annual or interim financial statements will not be prevented or detected on a timely basis. Based on its evaluation of internal control over financial reporting management determined that the control deficiencies identified above should be considered material weaknesses in our internal control over financial reporting.\nOur management, including our chief executive officer and our chief financial officer, do not expect that our disclosure controls or our internal control over financial reporting will prevent or detect all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Controls can also be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the controls. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to rules of the SEC that permit us to provide only managements report in this annual report.\nAs set forth below, management has taken or will take steps to remediate the control deficiencies identified above. Notwithstanding the control deficiencies described above, we have performed additional analyses and other procedures to enable management to conclude that our consolidated financial statements included in this Form 10-K fairly present, in all material respects, our financial condition and results of operations as of and for the year ended December 31, 2020.\nManagement's Remediation Plan\nIn response to the deficiencies discussed above, we plan to continue efforts already underway to improve internal control over financial reporting, which include creating formal policies and procedures governing our financial statement close process, and control in the preparation, documentation, and review of journal entries and account reconciliations.\nManagement and our Board of Directors will continue to monitor these remedial measures and the effectiveness of our internal controls and procedures. Other than as described above, there were no changes in our internal control over financial reporting during the year ended December 31, 2020 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n(c) Changes in Internal Control over Financial Reporting.\nOther than as discussed above, there were no changes in our internal control over financial reporting (as defined in Rule 13a-15(f) of the Exchange Act) that occurred during the last fiscal quarter of the period covered by this report that have materially affected or are reasonably likely to materially affect our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTION.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nExecutive Officers and Directors\nThe following table sets forth certain information, as of October 14, 2022, with respect to our directors and executive officers.\nDirectors serve until the next annual meeting of the stockholders, until their successors are elected or appointed and qualified, or until their prior resignation or removal. Officers serve until the next annual meeting of the Board of Directors, until their successors are elected or appointed and qualified, or until their prior resignation or removal.\nName\nPositions Held\nAge\nDate of Election\nor Appointment as Director\nRobert M. Gans\nPresident, Chief Executive Officer and Director\nAugust 6,\nMartin Gans\nDirector\nJune 23,\nHoward Rosenbluth\nTreasurer, Chief Financial Officer, Secretary and Director\nApril 21,\nStephen J. Sabbeth\nDirector of Acquisitions and Licensing - Resigned effective 8/5/21\nMay 2009\nThe following is a brief account of the business experience during the past five years or more of our directors and executive officers.\nRobert M. Gans. Mr. Gans has been our President, Chief Executive Officer and director since August 6, 2010. For the past forty-three years Robert M. Gans has owned and operated companies in the building materials business, as well as gentlemens clubs, restaurants, and several commercial and residential real estate properties. Mr. Gans has either been the President, Managing Member, or sole owner of all the companies in which he has been involved, including The Executive Club LLC, a company operating in the Gentlemens Club industry. None of the companies was or is a public company. The Board concluded that Mr. Gans should serve as a director of the Company because of his extensive experience in the management and operation of gentlemens clubs.\nMartin Gans. Martin Gans, who became a director on June 23, 2009, has been retired since 2002. Prior to his retirement, Mr. Gans held managerial positions with The Nassau County Board of Elections, from 1994 to 2002, and with the Metropolitan New York hospitals, from 1990 to 1994. Mr. Gans has a MBA in Health Care Administration from George Washington University and a Bachelors degree in Economics from Hunter College. Mr. Gans served in the United States Army where he reached the rank of SP4. The Board concluded that Mr. Gans should serve as a director of the Company because of his managerial experience and the knowledge and experience he has attained through his service as a director of the Company.\nHoward Rosenbluth. Mr. Rosenbluth has been our Treasurer, Chief Financial Officer and Secretary since August 6, 2010, and our director since April 21, 2009. Over the past five years, Mr. Rosenbluth has been an executive officer overseeing the financial operations for Metropolitan Lumber Hardware and Building Supplies, Inc., and The Executive Club LLC, a company operating in the Gentlemens club industry. Mr. Rosenbluth received an MBA in Finance in 1975 from the University of Connecticut and has owned a consulting firm, a manufacturing company and a restaurant and has worked in public accounting and consulting for more than 35 years. The Board concluded that Mr. Rosenbluth should serve as a director of the Company because of his financial literacy and expertise, as well as his extensive experience in the management and operation of gentlemens clubs.\nStephen J. Sabbeth. (Resigned effective August 5, 2021.) Mr. Sabbeth has served as a consultant to us as our Director of Acquisitions and Licensing since May 2009. Mr. Sabbeth became an executive officer during 2015. His services to us includes leading the expansion of our licensing efforts throughout the U.S. and the Caribbean. As well, he assisted us in initiating and implementing gift card and guest loyalty systems for our licensees (which services he also provided to other entities in the hospitality industry). Over the past 9 years Mr. Sabbeth has provided management, marketing and administrative consulting services to various organizations requiring assistance from a seasoned and experienced professional. His clients principally have consisted of businesses involved in the restaurant, nightclub, adult entertainment, website, lumber and building supplies and intellectual property rights industries. Mr. Sabbeth has assisted his consulting clients with the creation and organization of Human Resource departments and ancillary employment related manuals and documentation. In addition, he has analyzed industry trends and customer preferences in the adult entertainment industry and assisted his clients in determining how best to allocate marketing and advertising resources. Mr. Sabbeth attended Hofstra University.\nFamily Relationships\nRobert M. Gans, our President, Chief Executive Officer and director, is the brother of Martin Gans, our director.\nExcept for above, there are no other family relationships between any of our directors or executive officers. There are no arrangements or understandings between our directors and directors and any other person pursuant to which they were appointed as an officer and director of the Company.\nBoard of Directors\nNone of our directors receives any remuneration for acting as such. Directors may, however, be reimbursed for their out-of-pocket expenses, if any, for attendance at meetings of the Board of Directors. Our Board of Directors may designate from among its members an executive committee and one or more other committees. No such committees have been established to date. Accordingly, we do not have an audit committee or an audit committee financial expert.\nGiven the small size of the Companys board of directors and the limited number of independent directors over the Companys history, the board has determined that it is appropriate for the entire board of directors to act as its audit committee, which has resulted in the directors who are also executive officers serving on its audit committee. Similarly, we do not have a nominating committee or a committee performing similar functions. We have not implemented procedures by which our security holders may recommend board nominees to us but expect to do so in the future.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our executive officers and directors and persons who own more than 10% of a registered class of our equity securities (Reporting Persons), to file with the SEC initial statements of beneficial ownership on Form 3, reports of changes in ownership on Form 4 and annual reports concerning their ownership on Form 5. Executive officers, directors and greater than 10% stockholders are required by the SEC regulations to furnish us with copies of all Section 16(a) reports they file.\nBased solely on our review of copies of such reports and representations from Reporting Persons, we believe that during the fiscal year ended December 31, 2020, the Reporting Persons timely filed all such reports.\nDirector Independence\nWe are not subject to listing requirements of any national securities exchange or inter-dealer quotation system which has requirements that a majority of the Board of Directors be independent and, as a result, we are not at this time required to have our Board of Directors comprised of a majority of Independent Directors.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years no current director, executive officer, promoter or control person of the Company has been involved in the following:\n(1) A petition under the Federal bankruptcy laws or any state insolvency law which was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n(2) Such person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3) Such person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\ni. Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii. Engaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4) Such person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n(5) Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6) Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7) Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni. Any Federal or State securities or commodities law or regulation; or\nii. Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8) Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCode of Ethics\nDue to the scope of our current operations, as of October 14, 2022, we have not adopted a code of ethics for financial executives, which include our Chief Executive Officer, Chief Financial Officer or persons performing similar functions. Our decision not to adopt such a code of ethics results from our having only a limited number of officers and directors operating as management. We believe that as a result of the limited interaction which occurs having such a small management structure eliminates the current need for such a code. ITEM 11. EXECUTIVE COMPENSATION.\nThe following table sets forth information concerning the total compensation paid or accrued by us during the two fiscal years ended December 31, 2020 and 2019 to (i) all individuals that served as our chief executive officer and our chief financial officer or acted in similar capacities for us at any time during the fiscal years ended December 31, 2020 and 2019 and (ii) all individuals that served as executive officers of ours at any time during the fiscal year ended December 31, 2020 and 2019 that received annual compensation during such fiscal years in excess of $100,000 (collectively, the named executive officers).\nSummary Compensation Table\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nRobert M. Gans,\nChief Executive Officer\nHoward Rosenbluth,\nChief Financial Officer\nStephen J. Sabbeth\n56,187\n56,187\nDirector of Acquisitions and Licensing\n130,000\n130,000\nWe have not issued any stock options or maintained any stock option or other incentive plans other than our 2010 Plan, which was adopted by our board but never approved by our shareholders. (See Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities - Securities Authorized for Issuance Under Equity Compensation Plans above.) We have no other plans in place and have never maintained any plans that provide for the payment of retirement benefits or benefits that will be paid primarily following retirement including, but not limited to, tax qualified deferred benefit plans, supplemental executive retirement plans, tax-qualified deferred contribution plans and nonqualified deferred contribution plans.\nSimilarly, we have no contracts, agreements, plans or arrangements, whether written or unwritten, that provide for payments to the named executive officers or any other persons following, or in connection with, the resignation, retirement or other termination of a named executive officer, or a change in control of the Company or a change in a named executive officers responsibilities following a change in control.\nEffective January 1, 2013, we entered into a management services agreement with Metropolitan Lumber, Hardware and Building Supplies, Inc., pursuant to which Metropolitan Lumber Hardware and Building Supplies, Inc. provides management and other services to us, including the services of Robert M. Gans and Howard Rosenbluth to act as executive officers of the Company. In consideration of the services, we pay Metropolitan Lumber Hardware and Building Supplies, Inc. a fee in the amount of $30,000 per year. The agreement may be terminated by either party upon ten days written notice. Mr. Gans is the sole owner of Metropolitan Lumber Hardware and Building Supplies, Inc. On May 5, 2015, we entered into an amendment, effective as of January 1, 2015, to our management services agreement with Metropolitan Lumber, Hardware and Building Supplies, Inc. Pursuant to the amendment, the fee we pay MLH for the management and other services it provides to us was increased from $30,000 per year to $90,000 per year, payable quarterly in arrears. In addition, the agreement as amended provides that MLH will be eligible for a discretionary cash bonus based on (i) MLHs performance throughout the relevant fiscal year (or portion thereof) of the Company; and (ii) the Companys performance throughout such fiscal year (or portion thereof). Effective January 1, 2017, the agreement was further amended to remove the requirement that the services of Robert M. Gans be provided under the agreement. The Board of Directors is responsible for establishing and implementing performance goals and a performance-based bonus plan, and the amount of the bonus, if any, will be determined by the Board in accordance with such plan. The agreement as amended does not guarantee MLH a bonus for any year (or portion thereof). As of the date of this report, the agreement as amended is still in full force and effect. As of December 31, 2020 and 2019, the Company owed Metropolitan Lumber Hardware and Building Supplies, Inc. $67,500 and $22,500 in unpaid management services, respectively.\nOutstanding Equity Awards at 2020 Fiscal Year-End\nFor the year ended December 31, 2020, there were no unexercised options, stock that has not vested or equity incentive plan awards held by any of the Companys named executive officers.\nCompensation of Directors\nNone of our directors receives any compensation for serving as such, for serving on committees of the Board of Directors or for special assignments. During the fiscal years ended December 31, 2020 and 2019 there were no other arrangements between us and our directors that resulted in our making payments to any of our directors for any services provided to us by them as directors. The following table shows compensation earned by each of our non-officer directors for the year ended December 31, 2020.\nName\nFees\nEarned\nor\nPaid in\nCash\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive\nPlan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nMartin Gans ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth information with respect to the beneficial ownership of our common stock known by us as of October 14, 2022 by (i) each person or entity known by us to be the beneficial owner of more than 5% of our common stock, (ii) each of our directors, (iii) each named executive officer and (iv) all of our directors and executive officers as a group.\nThe percentages in the table have been calculated on the basis of treating as outstanding for a particular person, all shares of our common stock outstanding on such date and all shares of our common stock issuable to such holder in the event of exercise of outstanding options, warrants, rights or conversion privileges owned by such person at said date which are exercisable within 60 days of such date. Except as otherwise indicated, the persons listed below have sole voting and investment power with respect to all shares of our common stock owned by them, except to the extent such power may be shared with a spouse. The addresses for our executive officers and directors are c/o Scores Holding Company, Inc., 533-535 West 27th Street, New York, NY 10001.\nName and Address\nof Beneficial Owner\nTitle of Class\nAmount and Nature\nof Beneficial\nOwnership\nPercent of\nClass (1)\nRobert M. Gans (2)\nCommon Stock\n88,900,230 (2)\n53.8 %\nHoward Rosenbluth\nCommon Stock\n0.0 %\nMartin Gans\nCommon Stock\n0.0 %\nStephen J. Sabbeth\nCommon Stock\n2,000 (3)\n*\nAll directors and executive officers as a group (4 persons)\nCommon Stock\n88,902,230 (2)\n53.8 %\nMitchells East LLC (2)\n617 Eleventh Avenue\nNew York, NY 10036\nCommon Stock\n88,900,230 (2)\n53.8 %\nEstate of William Osher (4)\n2955 Shell Road\nBrooklyn, NY\nCommon Stock\n13,886,059 (2)\n8.4 %\n*\nLess than 1%.\n(1) Based upon 165,186,144 shares of Common Stock issued and outstanding as at October 14, 2022.\n(2) Robert M. Gans is the sole owner of Mitchells East LLC. The principal business address of Mr. Gans is 617 Eleventh Avenue, New York, NY 10036. Does not include 13,886,059 shares of Common Stock currently held of record by William Osher, deceased, of which Harvey Osher (H. Osher) claims title and which H. Osher has agreed to transfer to Mitchells East LLC pursuant to the Stock Purchase Agreement whereby Mr. Gans purchased any rights of H. Osher to such shares.\n(3) Mr. Sabbeth owns these shares directly.\n(4) William Osher passed away in August, 2007. H. Osher claims all right and title to and interest in these shares of Common Stock and has agreed to transfer them to Mitchells East LLC pursuant to the Stock Purchase Agreement. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nOn January 24, 2006, the Company entered into a licensing agreement with AYA International, Inc. (AYA) granting AYA the right to use the Company's trademarks in connection with its online video chat website, Scoreslive.com. The agreement with AYA provides for royalty payments to be made directly to the Company at the rate of 4.99% of weekly gross revenues from all revenue sources within the AYA website. On December 21, 2009, AYA transferred all of its rights in Scoreslive.com and in its licensing agreement with the Company to Swan Media Group, Inc., (Swan) a newly formed New York corporation whose majority owner (80%) is Robert M. Gans, who is also the majority shareholder and chief executive officer of the Company. The Company is owed $0 and $0 in unpaid royalties and expenses as of December 31, 2020 and December 31, 2019, respectively.\nOn January 27, 2009, the Company entered into a licensing agreement with its affiliate through common ownership I.M. Operating LLC (IMO) for the use of the Scores brand name Scores New York. Robert M. Gans is the majority owner (72%) of IMO and is also the Companys majority shareholder, and Howard Rosenbluth, the Companys Treasurer and a Director, owns 2%. IMO owes the Company a royalty receivable of $0 and $0 as of December 31, 2020 and December 31, 2019 respectively.\nThe Company also leases office space directly from Westside Realty of New York, Inc. (WSR), the owner of the West 27th Street Building. The majority owner of WSR (80%) is Robert M. Gans. Since April 1, 2009, the monthly rent has been $2,500 per month including overhead costs. The Company owed WSR $30,000 and $7,500 in unpaid rents as of December 31, 2020 and December 31, 2019, respectively. The Company incurred rent expense of $30,000 and $30,000 as December 31, 2020 and December 31, 2019, respectively.\nEffective January 1, 2013, the Company entered into a management services agreement with Metropolitan Lumber Hardware and Building Supplies, Inc., pursuant to which Metropolitan Lumber Hardware and Building Supplies, Inc. provides management and other services to the Company, including the services of Robert M. Gans and Howard Rosenbluth to act as executive officers of the Company. In consideration of the services, the Company paid Metropolitan Lumber Hardware and Building Supplies, Inc. a fee in the amount of $30,000 per year. Effective May 5, 2015, the agreement was amended increasing the annual fee to $90,000. Effective January 1, 2017, the agreement was further amended to remove the requirement that the services of Robert M. Gans be provided under the agreement. In addition, Metropolitan Lumber Hardware and Building Supplies, Inc. shall be eligible for a discretionary cash bonus. The agreement may be terminated by either party upon ten days written notice. Mr. Gans is the sole owner of Metropolitan Lumber Hardware and Building Supplies, Inc. The Company owed $67,500 and $22,500 in unpaid management services as of December 31, 2020 and December 31, 2019, respectively. The Company incurred management service expenses of $90,000 and $90,000 as December 31, 2020 and December 31, 2019, respectively.\nThe Company has accrued expenses of $7,500 due to Metropolitan Lumber Hardware and Building Supplies, Inc. The Company owed $7,500 and $7,500 as of December 31, 2020 and December 31, 2019, respectively.\nEffective July 1, 2018, after being having been closed from August 15, 2016 to June 28, 2018, the Company terminated the previous licensing agreement and granted an exclusive, non-transferable license for the use of the Scores Atlantic City name to Star Light Events LLC (Star Light) for its gentlemens club in Atlantic City, New Jersey. Royalties under this license are payable at the rate of $5,000 per month, commencing in July 2018, and the license is for a term of five years, with five successive five-year renewal terms. Pursuant to the written agreement, the Company also granted Star Light a non-exclusive, non-transferable license to sell certain licensed products bearing the Company's trademarks. Starlight will purchase the licensed products from the Company or its affiliates at cost plus 25%. Robert M. Gans, the Company's President, Chief Executive Officer and a director, is the majority owner (92.165%) of Star Light Events LLC and Howard Rosenbluth, the Company's Secretary, Treasurer and a Director, owns 1%. Starlight owes the Company a royalty receivable of $0 and $0 as of December 31, 2020 and December 31, 2019, respectively. The Company recorded revenue of $0 and $0 as of December 31, 2020 and December 31, 2019, respectively.\nOn December 9, 2013, the Company entered into a license agreement with its subsidiary, SLC, granting SLC the exclusive right to use certain trademarks, including the Scores stylized trademark, in connection with certain goods and services. The grant of license also includes the right to issue sublicenses to third parties, subject to the approval of the Company. Pursuant to the agreement, SLC shall pay to the Company a royalty, as determined by the Company, such as a percentage of net revenue or a flat fee, received in connection with the provision of services and/or sale of goods using the trademarks. SLC may also pay a percentage, as determined by the Company, of all royalties received by SLC under any sublicense agreements. SLC and any sublicensees are to adhere to quality standards as set by the Company, and the Company has the right to inspect all facilities and approve all promotional and marketing materials as well as any related packaging. The agreement has a one-year term with automatic one-year renewals, subject to either partys election to terminate the agreement at least thirty days prior to such renewal. The Company also has the right to terminate the agreement, with immediate effect, upon the occurrence of certain events. The license is subject to any pre-existing license agreements as of the date of the agreement.\nEffective February 28, 2017 (the Effective Date), the Company entered into separate Settlement Agreements (each, a Settlement Agreement) with three licensees, IMO, Star Light and Swan, controlled by Robert M. Gans, the Company's President, Chief Executive Officer and a member of its Board of Directors.\nAs of the Effective Date, IMO owed the Company an aggregate of $255,406 in unpaid royalties and other fees. Under its Settlement Agreement, IMO has agreed to pay the entire amount owed to the Company, in full settlement of all claims the Company may have against it. The settlement amount is payable pursuant to a promissory note in 22 consecutive monthly installments commencing March 1, 2017 and bears simple interest at the rate of 4% per year. Included as an event of default under the note is a requirement that IMO remain current in its obligations to the Company under its license agreement from and after the Effective Date. This obligation was satisfied under the terms of the Offset Agreement as discussed further below.\nAs of the Effective Date, Starlight owed the Company an aggregate of $250,000 in unpaid royalties and other fees. Starlight is currently inactive and has no revenue. Under its Settlement Agreement, Starlight has agreed to pay the Company $75,000, in full settlement of all claims the Company may have against it. The settlement amount is payable pursuant to a promissory note in 10 consecutive monthly installments commencing March 1, 2017 and bears simple interest at the rate of 4% per year. This obligation was satisfied under the terms of the Offset Agreement as discussed further below.\nAs of the Effective Date, Swan owed the Company an aggregate of $166,000 in unpaid royalties and other fees. Swan is currently unprofitable. Under its Settlement Agreement, Swan has agreed to pay the Company $50,000, in full settlement of all claims the Company may have against it. The settlement amount is payable pursuant to a promissory note in 10 consecutive monthly installments commencing March 1, 2017 and bears simple interest at the rate of 4% per year. Included as an event of default under the note is a requirement that Swan remain current in its obligations to the Company under its license agreement from and after the Effective Date. This obligation was satisfied under the terms of the Offset Agreement as discussed further below.\nOn August 4, 2018, the Company settled the Plaintiffs claims in the Voronina matter for $1,310,000. See Note 7 for additional information. The Company had insufficient liquid resources to enable it to make a portion of the settlement payments called for by the Voronina Settlement Agreement. Metropolitan Lumber, Hardware and Building Supplies, Inc., a company wholly owned by Robert M. Gans, the Chief Executive Officer and a director of the Company, made loans to the Company in the aggregate amount of $770,000 to enable the Company to make the payments under the Voronina Settlement Agreement. In addition to the aforementioned loan and as discussed further in Note 7, the Company filed a third-party complaint against certain licensees. The amount of money paid to the Company by settling with Third-Party Defendants and the Companys insurance carrier was $505,660.\nThe Company previously entered into the 3 Royalty Settlement Agreements noted above where Robert M. Gans is a majority owner of the equity of each of the Licensees. Robert M. Gans guaranteed the payment of each Licensees obligations under each of the 3 Settlement Documents. The Licensees were not current with respect to their obligations under the Settlement Documents and the Company did not call upon Mr. Gans to honor his Guaranties.\nThe past due amounts under the Royalty Settlement Agreements were $382,259.68 as of December 1, 2018. On this date the Company entered into an agreement to offset the Royalty Amount against the Voronina Amount, thereby reducing the amount owed by the Company to Metropolitan to $399,139 pursuant to the terms of a certain Settlement and Offset Agreement made by and among the Company, Star Light, Swan, Metropolitan and Robert M. Gans.\nThe Licensees did not remain current with respect to their obligations under the Royalty Settlement Agreements, and the Company did not call upon Robert M. Gans to honor his guarantees. The past due amounts under the Royalty Settlement Agreements aggregated $382,259 (the Aggregate Royalty Amount) as of December 1, 2018. As of such date, the Company, the Licensees, Metropolitan and Robert M. Gans entered into a Settlement and Offset Agreement (the Offset Agreement) pursuant to which the Aggregate Royalty Amount was offset against the Voronina Amount, thereby reducing the amount owed by the Company to Metropolitan to $408,546 (the Net Voronina Amount). The Net Voronina Amount is payable pursuant to a promissory note (the Voronina Note), which bears simple interest at the rate of 4% per annum, in 86 consecutive monthly installments of $5,000, and a final installment of $1,370, with the initial installment due and payable on January 1, 2022 (or the first business day thereafter). The Company may prepay the Voronina Note at any time, in whole or in part without premium or penalty. The Offset Agreement also provides for the immediate termination of the Royalty Settlement Agreements and the related promissory notes and guarantees. The Company owed $359,692 and $345,611 as of December 31, 2020 December 31, 2019, respectively. The Company incurred interest expense of $14,081 and $15,141 as of December 31, 2020 and December 31, 2019, respectively.\nIt should be noted as of this date of this report that Club Azure and Starlight Events LLC have closed as of on March 16, 2020. Swan Media has ceased all operations as of December 31, 2020.\nThe total amounts due to the various related parties as of December 31, 2020 and December 31, 2019 was $464,692 and $383,111 respectively and the total amounts due to the Company from the various related parties as of December 31, 2020 and December 31, 2019 was $0 and $0 respectively.\nDirector Independence\nOur Board of Directors has considered the independence of its directors in reference to the definition of independent director established by the Nasdaq Marketplace Rule 5605(a)(2). In doing so, the Board has reviewed all commercial and other relationships of each director in making its determination as to the independence of its directors. After such review, the Board has determined that none of our directors qualifies as independent under the requirements of the Nasdaq listing standards. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nAudit Fees\nThe aggregate fees billed to us by RBSM LLP, our independent registered public accounting firm, for services rendered during the fiscal years ended December 31, 2020 and 2019 are set forth in the table below:\nFee Category\nFiscal year ended\nDecember 31, 2020\nFiscal year ended\nDecember 31, 2019\nAudit Fees (1)\n$ 55,000\n$ 40,000\nAudit-Related Fees (2)\n-\n-\nTax Fees (3)\n5,000\n5,000\nAll Other Fees (4)\n-\n-\nTotal Fees\n$ 60,000\n$ 45,000\n(1) Audit fees consists of fees incurred for professional services rendered for the audit of annual consolidated financial statements, for reviews of our interim consolidated financial statements included in our quarterly reports on Form 10-Q and for services that are normally provided in connection with statutory or regulatory filings or engagements.\n(2) Audit-related fees consist of fees billed for professional services that are reasonably related to the performance of the audit or review of our consolidated financial statements but are not reported under Audit fees.\n(3) Tax fees consist of fees billed for professional services relating to tax compliance, tax planning, and tax advice.\n(4) All other fees consist of fees billed for all other services.\nAudit Committees Pre-Approval Practice.\nInasmuch as we do not have an audit committee, our Board of Directors performs the functions of an audit committee. Section 10A(i) of the Exchange Act prohibits our auditors from performing audit services for us as well as any services not considered to be audit services unless such services are pre-approved by the Board of Directors (in lieu of the audit committee) or unless the services meet certain de-minimis standards.\nAll audit services were approved by our Board of Directors.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nFinancial Statement Schedules.\nThe consolidated financial statements of Scores Holding Company, Inc. are listed on the Index to Financial Statements on this annual report on Form 10-K beginning on page.\nAll financial statement schedules are omitted because they are not applicable, or the required information is shown in the financial statements or notes thereto.\nExhibits.\nThe following Exhibits are being filed with this Annual Report on Form 10-K:\nExhibit\nNo\nSEC Report\nReference\nNumber\nDescription\n3.1\n3(i)\nCertificate of Incorporation of Scores Holding Company, Inc. (1)\n3.2\n3(ii)\nBy-Laws of Scores Holding Company, Inc. (2)\n10.1\n10.38\nSublicense Agreement, dated January 24, 2006, between the Registrant and AYA Entertainment, Inc. (4)\n10.2\n10.47\nLicense Agreement, dated January 27, 2009, between the Registrant and I.M. Operating LLC (6)\n10.3\n10.4\nForm of Director and Officer Indemnification Agreement (7)\n10.4\n10.15\nStock Purchase Agreement, dated January 27, 2009, among Elliot Osher, Harvey Osher, Richard Goldring and Mitchells East LLC (1)\n10.5\n10.18\nManagement Services Agreement, effective January 1, 2013, between Scores Holding Company, Inc. and Metropolitan Lumber, Hardware and Building Supplies, Inc. (1)\n10.6\n10.4\nAmendment to Management Services Agreement, effective January 1, 2015, between Scores Holding Company, Inc. and Metropolitan Lumber, Hardware and Building Supplies, Inc. (9)\n10.7\n10.10.1\nSecond Amendment to Management Services Agreement, effective January 1, 2017, between Scores Holding Company, Inc. and Metropolitan Lumber, Hardware and Building Supplies, Inc. (10)\n10.8\n10.1\nLicense Agreement between Scores Holding Company, Inc. and Scores Licensing Corp. (8)\n10.9\n10.2\nTrademark License Agreement between Scores Licensing Corp. and Star Light Events LLC (8)\n10.10\n10.13\nSettlement Agreement, dated as of February 28, 2017, by and among Scores Holding Company, Inc., I.M. Operating LLC and Robert M. Gans (10)\nExhibit\nNo\nSEC Report\nReference\nNumber\nDescription\n10.11\n10.14\nSettlement Agreement, dated as of February 28, 2017, by and among Scores Holding Company, Inc., Swan Media Group, Inc. and Robert M. Gans (10)\n10.12\n10.15\nSettlement Agreement, dated as of February 28, 2017, by and among Scores Holding Company, Inc., Star Light Events LLC and Robert M. Gans (10)\n10.13\n10.16\nPromissory Note, dated February 28, 2017, from Star Light Events LLC to Scores Holding Company, Inc., with attached Personal Guaranty of Robert M. Gans (10)\n10.14\n10.17\nPromissory Note, dated February 28, 2017, from Swan Media Group, Inc. to Scores Holding Company, Inc., with attached Personal Guaranty of Robert M. Gans (10)\n10.15\n10.18\nPromissory Note, dated February 28, 2017, from I.M. Operating LLC to Scores Holding Company, Inc., with attached Personal Guaranty of Robert M. Gans (10)\n10.16\n10.1\nSettlement and Offset Agreement, effective as of December 1, 2018, by and among Scores Holding Company, Inc., Star Light Events LLC, Swan Media Group, Inc., I.M. Operating LLC, Metropolitan Lumber, Hardware and Building Supplies, Inc. and Robert M. Gans.(11)\nList of Subsidiaries (10)\n31.1\n*\nCertification of Principal Executive Officer pursuant to SEC Rules 13a-14(a) and 15d-14(a), adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\n*\nCertification of Principal Financial Officer, pursuant to SEC Rules 13a-14(a) and 15d-14(a), adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\n*\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\n*\nCertification of Chief Financial Officer, pursuant to 18 U.S.C. Section 1350, adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\n*\nXBRL INSTANCE DOCUMENT\n101.SCH\n*\nXBRL TAXONOMY EXTENSION SCHEMA DOCUMENT\n101.CAL\n*\nXBRL TAXONOMY EXTENSION CALCULATION LINKBASE DOCUMENT\n101.DEF\n*\nXBRL TAXONOMY EXTENSION DEFINITION LINKBASE DOCUMENT\n101.LAB\n*\nXBRL TAXONOMY EXTENSION LABEL LINKBASE DOCUMENT\n101.PRE\n*\nXBRL TAXONOMY EXTENSION PRESENTATION LINKBASE DOCUMENT\n* Filed herewith.\n(1) Filed with the Securities and Exchange Commission on November 14, 2013 as an exhibit, numbered as indicated above, to the Registrants Annual Report on Form 10-K for the year ended December 31, 2012, which exhibit is incorporated herein by reference.\n(2) Filed with the Securities and Exchange Commission on April 4, 1997 as an exhibit, numbered as indicated above, to the Registrants Annual Report on Form 10-KSB for the year ended November 30, 1996, which exhibit is incorporated herein by reference.\n(3) Filed with the Securities and Exchange Commission on April 23, 2003 as an exhibit, numbered as indicated above, to the Registrants Annual Report on Form 10-KSB for the year ended December 31, 2002, which exhibit is incorporated herein by reference.\n(4) Filed with the Securities and Exchange Commission on May 17, 2007 as an exhibit, numbered as indicated above, to the Registrants Annual Report on Form 10-KSB for the year ended December 31, 2006, which exhibit is incorporated herein by reference.\n(5) Filed with the Securities and Exchange Commission on February 2, 2009 as an exhibit, numbered as indicated above, to the Registrants Current Report on Form 8-K dated February 2, 2009, which exhibit is incorporated herein by reference.\n(6) Filed with the Securities and Exchange Commission on April 15, 2009 as an exhibit, numbered as indicated above, to the Registrants Annual Report on Form 10-K for the year ended December 31, 2009, which exhibit is incorporated herein by reference.\n(7) Filed with the Securities and Exchange Commission on August 13, 2010 as an exhibit, numbered as indicated above, to the Registrants Current Report on Form 8-K dated August 5, 2010, which exhibit is incorporated herein by reference.\n(8) Filed with the Securities and Exchange Commission on December 27, 2013 as an exhibit, numbered as indicated above, to the Registrants Quarterly Report on Form 10-Q for the quarter ended September 30, 2013, which exhibit is incorporated herein by reference.\n(9) Filed with the Securities and Exchange Commission on May 12, 2015 as an exhibit, numbered as indicated above, to the Registrants Quarterly Report on Form 10-Q for the quarter ended March 31, 2015, which exhibit is incorporated herein by reference.\n(10) Filed with the Securities and Exchange Commission on April 10, 2017 as an exhibit, numbered as indicated above, to the Registrants Annual Report on Form 10-K for the year ended December 31, 2016, which exhibit is incorporated herein by reference.\n(11) Filed with the Securities and Exchange Commission on May 2, 2019 as an exhibit, numbered as indicated above, to the Registrants Quarterly Report on Form 10-Q for the quarter ended March 31, 2018 which exhibit is incorporated herein by reference.\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: October 19, 2022 SCORES HOLDING COMPANY, INC.\nBy: /s/ Robert M. Gans\nRobert M. Gans\nChief Executive Officer\n(Principal Executive Officer)\nBy: /s/ Howard Rosenbluth\nHoward Rosenbluth\nChief Financial Officer\n(Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated .\nSIGNATURE\nTITLE\nDATE\n/s/ Robert M. Gans\nPresident, Chief Executive Officer (Principal Executive Officer), Director\nOctober 19, 2022\nRobert M. Gans\n/s/ Howard Rosenbluth\nChief Financial Officer (Principal Financial Officer), Director\nOctober 19, 2022\nHoward Rosenbluth\n/s/ Martin Gans\nDirector\nOctober 19, 2022\nMartin Gans\nReport of Independent Registered Public Accounting Firm\nScores Holding Company, Inc. and Subsidiary Consolidated Balance Sheets as of December 31, 2020 and 2019\nScores Holding Company, Inc. and Subsidiary Consolidated Statements of Operations For the Two Years Ended December 31,2020 and 2019\nScores Holding Company, Inc. and Subsidiary Consolidated Statements of Cash Flows For the Two Years Ended December 31, 2020 and 2019\nScores Holding Company, Inc. and Subsidiary Consolidated Statement of Changes in Stockholder's Deficit For the Two Years Ended December 31,2020 and 2019\nScores Holding Company, Inc. and Subsidiary Notes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nThe Stockholders and the Board of Directors of\nScores Holding Company, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Scores Holding Company, Inc. (the company) as of December 31, 2020 and 2019, and the related consolidated statements of operations, stockholders deficit, and cash flows for each of the years in the two year period ended December 31, 2020, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the company as of December 31, 2020 and 2019, and the results of its operations and its cash flows for each of the years in the two year period ended December 31, 2020, in conformity with U.S. generally accepted accounting principles.\nThe Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the company will continue as a going concern. As discussed in Note 2 to the consolidated financial statements, the company has suffered recurring losses from operations, will require additional capital to fund its current operating plan, and has stated that substantial doubt exists about the companys ability to continue as a going concern. Managements plans regarding these matters are also described in Note 2. The consolidated financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the companys management. Our responsibility is to express an opinion on the companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements, and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there were no critical audit matters.\n/s/ RBSM LLP\nWe have served as the companys auditor since 2012.\nNew York, NY\nOctober 19, 2022\nSCORES HOLDING COMPANY, INC. AND SUBSIDIARY\nCONSOLIDATED BALANCE SHEETS\nDecember 31,\nDecember 31,\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents\n$ 21,143\n$ 9,331\nTrade receivables, net of allowance of $0 and $0, respectively\n41,597\n44,913\nPrepaid expenses\n37,241\n16,519\nTotal Current Assets\n99,981\n70,763\nTOTAL ASSETS\n$ 99,981\n$ 70,763\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCURRENT LIABILITIES:\nAccounts payable and accrued expenses\n$ 168,646\n$ 184,144\nAccrued expenses, related party\n7,500\n7,500\nRelated party payable\n97,500\n30,000\nTotal Current Liabilities\n273,646\n221,644\nRelated party loan payable - long term\n359,692\n345,611\nContract liabilities\n235,000\n180,200\nTOTAL LIABILITIES\n868,338\n747,455\nCommitments and Contingencies (Note 7)\n-\n-\nSTOCKHOLDERS' DEFICIT\nPreferred stock, $.0001 par value, 10,000,000 shares authorized, -0- share issued and outstanding\n-\n-\nCommon stock, $.001 par value; 500,000,000 shares authorized, 165,186,144 shares issued and 165,186,144 shares outstanding, respectively\n165,186\n165,186\nAdditional paid-in capital\n6,058,117\n6,058,117\nAccumulated deficit\n(6,991,660 )\n(6,899,995 )\nTotal Stockholders' Deficit\n(768,357 )\n(676,692 )\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ 99,981\n$ 70,763\nSee notes to the consolidated financial statements.\nSCORES HOLDING COMPANY, INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears Ended\nDecember 31,\nREVENUES\nRoyalty Revenue\n$ 263,142\n$ 583,530\nTotal Revenue\n263,142\n583,530\nOPERATING EXPENSES\nGeneral and Administrative Expenses\n387,254\n662,891\nLOSS FROM OPERATIONS\n(124,112 )\n(79,361 )\nOTHER INCOME/(EXPENSE)\nLitigation Settlement, net\n-\n90,000\nOther income\n48,225\n-\nInterest Expense, net\n(15,778 )\n(16,441 )\nTOTAL OTHER INCOME\n32,447\n73,559\nNET LOSS BEFORE INCOME TAXES\n(91,665 )\n(5,802 )\nINCOME TAXES\n-\n-\nNET LOSS\n$ (91,665 )\n$ (5,802 )\nNET LOSS PER SHARE-Basic and Diluted\n$ (0.00 )\n$ (0.00 )\nWEIGHTED AVERAGE OF COMMON SHARES OUTSTANDING-Basic and Diluted\n165,186,144\n165,186,144\nSee notes to the consolidated financial statements.\nSCORES HOLDING COMPANY INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended\nDecember 31\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet Loss\n$ (91,665 )\n$ (5,802 )\nAdjustments to reconcile net loss to net cash provided by operating activities:\nRecovery of bad debts\n(13,750 )\n(43,800 )\nChanges in operating assets and liabilities:\nTrade receivable\n17,066\n50,904\nPrepaid expenses\n(20,722 )\n(2,622 )\nAccounts payable and accrued expenses\n(15,498 )\n46,597\nAccrued expenses, related party\n-\n(11,449 )\nAccrued interest, related party\n14,081\n15,141\nContract liabilities\n54,800\n67,700\nRelated party payables\n67,500\n(45,000 )\nNET CASH PROVIDED BY OPERATING ACTIVITIES\n11,812\n71,669\nCASH FLOW FROM INVESTING ACTIVITES:\n-\n-\nCASH FLOW FROM FINANCING ACTIVITIES:\nPayments to related party\n-\n(70,000 )\nNET CASH USED IN FINANCING ACTIVITIES\n-\n(70,000 )\nNET INCREASE IN CASH AND CASH EQUIVALENTS\n11,812\n1,669\nCash and cash equivalents - beginning of year\n9,331\n7,662\nCash and cash equivalents - end of year\n$ 21,143\n$ 9,331\nSupplemental disclosures of cash flow information:\nCash paid during the year for interest\n$ 1,349\n$ 1,300\nCash paid for income taxes\n$ -\n$ -\nSupplemental disclosure of cash flows from noncash investing and financing activities\n$ -\n$ -\nSee notes to the consolidated financial statements.\nSCORES HOLDING COMPANY INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDER'S DEFICIT\nYEARS ENDED DECEMBER 31, 2020 and 2019\nAdditional\nTotal\nCommon Stock\nPaid in\nAccumulated\nStockholders\nShares\nAmount\nCapital\nDeficit\nDeficit\nBalance as of December 31, 2018\n165,186,144\n$ 165,186\n$ 6,058,117\n$ (6,894,193 )\n$ (670,890 )\nNet Loss\n(5,802 )\n(5,802 )\nBalance as of December 31, 2019\n165,186,144\n$ 165,186\n$ 6,058,117\n$ (6,899,995 )\n$ (676,692 )\nNet Loss\n(91,665 )\n(91,665 )\nBalance as of December 31, 2020\n165,186,144\n$ 165,186\n$ 6,058,117\n$ (6,991,660 )\n$ (768,357 )\nSCORES HOLDING COMPANY INC. AND SUBSIDIARY\nNotes to Consolidated Fianncial Statements\nNote 1. Organization\nBASIS OF PRESENTATION\nScores Holding Company, Inc. (the Company) is a Utah corporation, formed in September 1981 and located in New York, NY. Originally incorporated as Adonis Energy, Inc., the Company adopted its current name in July 2002. The Company is a licensing company that utilizes the SCORES name and trademark for licensing options.\nThe consolidated financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States. The consolidated financial statements of the Company include the accounts of Scores Licensing Corp. (SLC).\nNote 2. Summary of Significant Accounting Principles\nGoing Concern\nAs of December 31, 2020, the Company has cumulative losses totaling $(6,991,660) and negative working capital of $173,665. The Company had net loss of $91,665 for the year ended December 31, 2020. Because of these conditions, the Company will require additional working capital to develop business operations. The Company raised and intends to raise additional working capital through the continued licensing of its brand with its current and new operators. There are no assurances that the Company will be able to achieve the level of revenues adequate to generate sufficient cash flow from operations to support the Companys working capital requirements. To the extent that funds generated from any future use of licensing are insufficient, the Company will have to raise additional working capital. No assurance can be given that additional financing will be available, or if available, will be on terms acceptable to the Company. If adequate working capital is not available, the Company may not continue its operations.\nThese conditions raise substantial doubt about the Companys ability to continue as a going concern for a period of one year from the issuance of these consolidated financial statements. The consolidated financial statements do not include any adjustments relating to the recoverability and classification of asset carrying amounts or the amount and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nPursuant to ASC 205-40 in preparing financial statements for each annual and interim reporting period, management must evaluate whether there are conditions and events that raise substantial doubt about an entitys ability to continue as a going concern within one year after the date the financial statements are issued.\nAs a result of the COVID-19 virus, during the first quarter of 2020 and ongoing, state and local governments have required all but certain essential businesses to close, including all clubs operating under the Scores name. The impact on such clubs' revenue was material in 2020 and resulted in a significant decline in our royalty revenues.\nUpon managements evaluation of relevant hospitality industry conditions and events known as of the date that these financial statements are issued it is their belief the financial effects of the Covid 19 pandemic will not have a substantial or long term effect on the financial viability of the adult entertainment industry. There will be operational changes to be certain but not a consequentially detrimental impact on the industry.\nThat said it should be noted all royalty paying licensees have reopened and are current. In addition, cash collections increased from $235,000 during 2020 to $249,000 and $794,000 during 2021 and 2022 respectively.\nAlthough there are fewer licensees and some of the licensing fees have been re-negotiated management believes the worst of the effects the Covid 19 pandemic are over. The lifting of many, if not all, gathering restrictions imposed by local government has vastly improved the appeal of adult entertainment oriented establishments. Consequently, the Company has seen a recent increase in the number of such establishments interested in utilizing the SCORES brand trademarks.\nPrinciples of consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiary. Inter-company items and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of the accompanying consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reported period. Significant areas requiring the use of management estimates include, but are not limited to, the allowance for doubtful accounts and valuation allowance on deferred taxes. Actual results could differ materially from such estimates under different assumptions or circumstances.\nReclassifications\nThe Company has made certain reclassifications to prior period amounts to conform with the current years presentation. These reclassifications have no impacy on the reported results.\nCash and cash equivalents\nThe Company considers all highly liquid temporary cash investments, with a maturity of three months or less when purchased, to be cash equivalents. There are times when cash may exceed $250,000, the FDIC insured limit. At December 31, 2020 and 2019, the uninsured balance amounted to $-0- and $-0-, respectively.\nFair Value of Financial Instruments\nThe carrying value of cash and accrued expenses, if applicable, approximate their fair values based on the short-term maturity of these instruments. The carrying amounts of debt were also estimated to approximate fair value.\nThe Company utilizes the methods of fair value measurement as described in ASC 820 to value its financial assets and liabilities. As defined in ASC 820, fair value is based on the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. In order to increase consistency and comparability in fair value measurements, ASC 820 establishes a fair value hierarchy that prioritizes observable and unobservable inputs used to measure fair value into three broad levels, which are described below:\nLevel 1: Quoted prices (unadjusted) in active markets that are accessible at the measurement date for assets or liabilities. The fair value hierarchy gives the highest priority to Level 1 inputs.\nLevel 2: Observable prices that are based on inputs not quoted on active markets but corroborated by market data.\nLevel 3: Unobservable inputs are used when little or no market data is available. The fair value hierarchy gives the lowest priority to Level 3 inputs.\nAccounts receivable and reserves\nAccounts deemed uncollectible are applied against the allowance for doubtful accounts. Allowance for doubtful accounts as of December 31, 2020 and 2019 were $0 and $0 respectively. In reviewing any delinquent royalty receivable, the Company considers many factors in estimating its reserve, including historical data, experience, customer types, credit worthiness, financial distress and economic trends. From time to time, the Company may adjust its assumptions for anticipated changes in any of above or other factors expected to affect collectability.\nIncome per Share\nUnder ASC 260-10-45, Earnings Per Share, basic income (loss) per common share is computed by dividing the income (loss) applicable to common stockholders by the weighted average number of common shares assumed to be outstanding during the period of computation. Diluted income (loss) per common share is computed using the weighted average number of common shares and, if dilutive, potential common shares outstanding during the period. As of December 31, 2020 and 2019, there were no common stock equivalents. Accordingly, the weighted average number of common shares outstanding for the periods ended December 31, 2020 and 2019, respectively, is the same for purposes of computing both basic and diluted net income per share for such years.\nRevenue Recognition\nUnder ASC 606, revenue from the initiation fees are recognizable when at a point in time (first month of the contract) and royalty revenues are recognized over time for those contracts with probable collections.\nThe Company's license fee revenue is generated from royalties earned through intellectual property licensing agreements which permit the licensee to use the recognition and status of the Scores brand in order to promote their businesses. Under ASC 606, revenue is recognized throughout the life of the executed licensing agreement. The Company measures revenue based on consideration specified in a contract with a customer. Furthermore, the Company recognizes revenue when it satisfies a performance obligation by transferring control over the service to its customer.\nA performance obligation is a promise in a contract to transfer a distinct service to the customer. The transaction price of a contract is allocated to each distinct performance obligation and recognized as revenue when or as the customer receives the benefit of the performance obligation. The Company's customers typically receive the benefit of its services as they are performed. Substantially all customer contracts provide that the Company is compensated for services performed to date. Taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction, that are collected by the Company from a customer, are excluded from revenue.\nNature of goods and services\nThe following is a description of the Company's products and services from which it generates revenue, as well as the nature, timing of satisfaction of performance obligations, and significant payment terms for each:\ni. Licensing Revenue\nLicensing fees represent the fees the Company receives from the licensing of the Company's Scores trademark. The terms of the royalties earned under these license agreements vary from a flat monthly fee to a percentage of the revenues of the licensee on a monthly basis. The licensing rights are transferred to the Company's customers over time, and the Company recognizes licensing revenue over time because the customer will simultaneously receive and consume the benefit from the license as the performance occurs.\nii. Stand-Ready for Consulting and Club Set-up Services\nThe Company offers an initial set-up and consultation to new clubs in order to aid in the opening and operation. The services are provided within the first month of any licensing agreements, and sometimes are not requested by the licensee and therefore never provided at all.\nPractical Expedients and Exemptions\nThe Company did not apply any practical expedients during the adoption of ASC 606.\nConcentration of Credit Risk\nThe Company received royalty revenues from 7 licensees during the year eneded December 31, 2020.\nWith regards to December 31, 2020, concentrations of sales from 4 licensees range from 16% to 29%, totaling 86%. There are receivables from 1 licensee, totaling 100%. There are no sales or receivables from these licensees that are considered related parties.\nWith regards to December 31, 2019, concentrations of sales from 4 licensees range from 11% to 30%, totaling 82%. There are receivables from 2 licensees ranging from 22% to 73%, totaling 95%. There are no sales or receivables from these licensees that are considered related parties.\nCommitments and Contingencies\nSee Note 9 for commitments and contingencies.\nRelated Party Transactions\nParties are considered to be related to the Company if the parties that, directly or indirectly, through one or more intermediaries, control, are controlled by, or are under common control with the Company. Related parties also include principal owners of the Company, its management, members of the immediate families of principal owners of the Company and its management and other parties with which the Company may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests. See Note 4 for related party transactions.\nRecently Issued Accounting Standards Update\nLeases\nIn March 2019, the FASB issued ASU No. 2019-01, Leases (Topic 842): Codification Improvements. ASU 2019-01 aligns the guidance for fair value of the underlying asset by lessors with existing guidance in Topic 842. The ASU requires that the fair value of the underlying asset at lease commencement is its cost reflecting in volume or trade discounts that may apply. However, if there has been a significant lapse of time between the date the asset was acquired and the lease commencement date, the definition of fair value as outlined in Topic 820 should be applied. In addition, the ASU exempts both lessees and lessors from having to provide certain interim disclosures in the fiscal year in which a company adopts the new leases standard. The update is effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2019. We have evaluated the impact of this ASU on the Companys consolidated financial statements and there is no effect.\nCredit loss\nIn September 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments and subsequent amendment to the initial guidance: ASU 2018-19 (collectively, Topic 326). ASU 2016-13 amends the impairment model by requiring entities to use a forward-looking approach based on expected losses to estimate credit losses on certain types of financial instruments, including trade receivables. ASU 2016-13 is effective for fiscal years beginning after December 15, 2022, with early adoption permitted. The Company is currently evaluating the impact on the Companys consolidated financial statements.\nAll new accounting pronouncements issued but not yet effective or adopted have been deemed not to be relevant to us, hence are not expected to have any impact once adopted.\nNote 3. Disaggregation of Revenue\nIn the following table, revenue is disaggregated by major products/service lines, and timing of revenue recognition:\nFor the Years Ended\nDecember 31,\nMajor products/service lines\nLicensing fees - royalty revenue\n$ 263,142\n$ 583,530\nInitiation fees\nTotal Revenue\n$ 263,142\n$ 583,530\nTiming of revenue recognition\nProducts transferred at a point in time\n$\n$\nProducts and services transferred over time\n263,142\n583,530\n$ 263,142\n$ 583,530\nContract balances\nThe following table provides information about receivables, assets, and liabilities from contracts with customers:\nDecember 31,\nDecember 31,\nAssets\nTrade receivables, net\n$ 41,597\n$ 44,913\nLiabilities\nContracted liabilities\n$\n$\nContracted liabilities - long term\n$ 235,000\n$ 180,200\nDecember 31,\nDecember 31,\nContract liabilities\nOpening $ 180,200 $ 112,500\nAddditions 79,000 120,200\nTransfer to revenue (24,200 ) 52,500\nEnding $ 235,000 $ 180,200\nContract receivables are recorded at the invoiced amount and do not bear interest. Credit is extended based on the evaluation of a customers financial condition and collateral is not required.\nThe contract liabilities primarily relate to deferred revenue.\nNote 4. Related-Party Transactions\nTransactions with Common ownership affiliates:\nOn January 24, 2006, the Company entered into a licensing agreement with AYA International, Inc. (AYA) granting AYA the right to use the Company's trademarks in connection with its online video chat website, Scoreslive.com. The agreement with AYA provides for royalty payments to be made directly to the Company at the rate of 4.99% of weekly gross revenues from all revenue sources within the AYA website. On December 21, 2009, AYA transferred all of its rights in Scoreslive.com and in its licensing agreement with the Company to Swan Media Group, Inc., (Swan) a newly formed New York corporation whose majority owner (80%) is Robert M. Gans, who is also the majority shareholder and chief executive officer of the Company. The Company is owed $0 and $0 in unpaid royalties and expenses as of December 31, 2020 and December 31, 2019, respectively.\nOn January 27, 2009, the Company entered into a licensing agreement with its affiliate through common ownership I.M. Operating LLC (IMO) for the use of the Scores brand name Scores New York. Robert M. Gans is the majority owner (72%) of IMO and is also the Companys majority shareholder, and Howard Rosenbluth, the Companys Treasurer and a Director, owns 2%. IMO owes the Company a royalty receivable of $0 and $0 as of December 31, 2020 and December 31, 2019 respectively.\nOn August 31, 2017, IMO entered into an agreement to sell all of its assets to Club Azure LLC (CA). Effective September 1, 2017, IMO no longer operated Scores New York and terminated its licensing agreement with the Company. Mark Yackow is the sole owner (100%) of CA and former Chief Operating Officer of IMO. Effective September 1, 2017, the Company granted an exclusive, non-transferable license for the use of the Scores New York to CA for its gentlemens club in New York City. On March 16th 2020 New York City Mayor Bill De Blasio ordered the closure of all New York City nightclubs, theaters, restaurants and concert venues in an effort to slow down the spread of Covid 19 and to protect ourselves against it. As a result of this closure order and effective March 17th 2020 the above business entity closed and has been closed since.\nThe Company also leases office space directly from Westside Realty of New York, Inc. (WSR), the owner of the West 27th Street Building. The majority owner of WSR (80%) is Robert M. Gans. Since April 1, 2009, the monthly rent has been $2,500 per month including overhead costs. The Company owed WSR $22,500 and $7,500 in unpaid rents as of December 31, 2020 and December 31, 2019, respectively. The Company incurred rent expense of $30,000 amd $30,000 as December 31, 2020 and December 31, 2019, respectively.\nEffective January 1, 2013, the Company entered into a management services agreement with Metropolitan Lumber Hardware and Building Supplies, Inc., pursuant to which Metropolitan Lumber Hardware and Building Supplies, Inc. provides management and other services to the Company, including the services of Robert M. Gans and Howard Rosenbluth to act as executive officers of the Company. In consideration of the services, the Company paid Metropolitan Lumber Hardware and Building Supplies, Inc. a fee in the amount of $30,000 per year. Effective May 5, 2015, the agreement was amended increasing the annual fee to $90,000. Effective January 1, 2017, the agreement was further amended to remove the requirement that the services of Robert M. Gans be provided under the agreement. In addition, Metropolitan Lumber Hardware and Building Supplies, Inc. shall be eligible for a discretionary cash bonus. The agreement may be terminated by either party upon ten days written notice. Mr. Gans is the sole owner of Metropolitan Lumber Hardware and Building Supplies, Inc. The Company owed $67,500 and $22,500 in unpaid management services as of December 31, 2020 and December 31, 2019, respectively. The Company incurred management service expenses of $90,000 and $90,000 as December 31, 2020 and December 31, 2019, respectively.\nThe Company has accrued expenses of $7,500 due to Metropolitan Lumber Hardware and Building Supplies, Inc. The Company owed $7,500 and $7,500 as of December 31, 2020 and December 31, 2019, respectively.\nEffective July 1, 2018, after being having been closed from August 15, 2016 to June 28, 2018, the Company terminated the previous licensing agreement and granted an exclusive, non-transferable license for the use of the Scores Atlantic City name to Star Light Events LLC (Star Light) for its gentlemens club in Atlantic City, New Jersey. Royalties under this license are payable at the rate of $5,000 per month, commencing in July 2018, and the license is for a term of five years, with five successive five-year renewal terms. Pursuant to the written agreement, the Company also granted Star Light a non-exclusive, non-transferable license to sell certain licensed products bearing the Company's trademarks. Starlight will purchase the licensed products from the Company or its affiliates at cost plus 25%. Robert M. Gans, the Company's President, Chief Executive Officer and a director, is the majority owner (92.165%) of Star Light Events LLC and Howard Rosenbluth, the Company's Secretary, Treasurer and a Director, owns 1%. Starlight owes the Company a royalty receivable of $0 and $0 as of December 31, 2020 and December 31, 2019, respectively. The Company recorded revenue of $0 and $0 as of December 31, 2020 and December 31, 2019, respectively.\nOn December 9, 2013, the Company entered into a license agreement with its subsidiary, SLC, granting SLC the exclusive right to use certain trademarks, including the Scores stylized trademark, in connection with certain goods and services. The grant of license also includes the right to issue sublicenses to third parties, subject to the approval of the Company. Pursuant to the agreement, SLC shall pay to the Company a royalty, as determined by the Company, such as a percentage of net revenue or a flat fee, received in connection with the provision of services and/or sale of goods using the trademarks. SLC may also pay a percentage, as determined by the Company, of all royalties received by SLC under any sublicense agreements. SLC and any sublicensees are to adhere to quality standards as set by the Company, and the Company has the right to inspect all facilities and approve all promotional and marketing materials as well as any related packaging. The agreement has a one-year term with automatic one-year renewals, subject to either partys election to terminate the agreement at least thirty days prior to such renewal. The Company also has the right to terminate the agreement, with immediate effect, upon the occurrence of certain events. The license is subject to any pre-existing license agreements as of the date of the agreement.\nEffective February 28, 2017 (the Effective Date), the Company entered into separate Settlement Agreements (each, a Settlement Agreement) with three licensees, IMO, Star Light and Swan, controlled by Robert M. Gans, the Company's President, Chief Executive Officer and a member of its Board of Directors.\nAs of the Effective Date, IMO owed the Company an aggregate of $255,406 in unpaid royalties and other fees. Under its Settlement Agreement, IMO has agreed to pay the entire amount owed to the Company, in full settlement of all claims the Company may have against it. The settlement amount is payable pursuant to a promissory note in 22 consecutive monthly installments commencing March 1, 2017, and bears simple interest at the rate of 4% per year. Included as an event of default under the note is a requirement that IMO remain current in its obligations to the Company under its license agreement from and after the Effective Date. This obligation was satisfied under the terms of the Offset Agreement as discussed further below.\nAs of the Effective Date, Starlight owed the Company an aggregate of $250,000 in unpaid royalties and other fees. Starlight is currently inactive and has no revenue. Under its Settlement Agreement, Starlight has agreed to pay the Company $75,000, in full settlement of all claims the Company may have against it. The settlement amount is payable pursuant to a promissory note in 10 consecutive monthly installments commencing March 1, 2017, and bears simple interest at the rate of 4% per year. This obligation was satisfied under the terms of the Offset Agreement as discussed further below.\nAs of the Effective Date, Swan owed the Company an aggregate of $166,000 in unpaid royalties and other fees. Swan is currently unprofitable. Under its Settlement Agreement, Swan has agreed to pay the Company $50,000, in full settlement of all claims the Company may have against it. The settlement amount is payable pursuant to a promissory note in 10 consecutive monthly installments commencing March 1, 2017, and bears simple interest at the rate of 4% per year. Included as an event of default under the note is a requirement that Swan remain current in its obligations to the Company under its license agreement from and after the Effective Date. This obligation was satisfied under the terms of the Offset Agreement as discussed further below.\nOn August 4, 2018, the Company settled the Plaintiffs claims in the Voronina matter for $1,310,000. See Note 7 for additional information. The Company had insufficient liquid resources to enable it to make a portion of the settlement payments called for by the Voronina Settlement Agreement. Metropolitan Lumber, Hardware and Building Supplies, Inc., a company wholly-owned by Robert M. Gans, the Chief Executive Officer and a director of the Company, made loans to the Company in the aggregate amount of $770,000 to enable the Company to make the payments under the Voronina Settlement Agreement. In addition to the aforementioned loan and as discussed further in Note 7, the Company filed a third party complaint against certain licensees. The amount of money paid to the Company by settling with Third-Party Defendants and the Companys insurance carrier was $505,660.\nThe Company previously entered into the 3 Royalty Settlement Agreements noted above where Robert M. Gans is a majority owner of the equity of each of the Licensees. Robert M. Gans guaranteed the payment of each Licensees obligations under each of the 3 Settlement Documents. The Licensees were not current with respect to their obligations under the Settlement Documents and the Company did not call upon Mr. Gans to honor his guaranties.\nThe past due amounts under the Royalty Settlement Agreements aggregated $382,259 (the Aggregate Royalty Amount) as of December 1, 2018. As of such date, the Company, the Licensees, Metropolitan and Robert M. Gans entered into a Settlement and Offset Agreement (the Offset Agreement) pursuant to which the Aggregate Royalty Amount was offset against the Voronina Amount, thereby reducing the amount owed by the Company to Metropolitan to $408,546 (the Net Voronina Amount). The Net Voronina Amount is payable pursuant to a promissory note (the Voronina Note), which bears simple interest at the rate of 4% per annum, in 86 consecutive monthly installments of $5,000, and a final installment of $1,370, with the initial installment due and payable on January 1, 2022 (or the first business day thereafter). The Company may prepay the Voronina Note at any time, in whole or in part without premium or penalty. The Offset Agreement also provides for the immediate termination of the Royalty Settlement Agreements and the related promissory notes and guarantees. The Company owed $359,692 and $345,611 as of December 31, 2020 and December 31, 2019, respectively. The Company incurred interest expense of $14,081 and $15,141 as of December 31, 2020 and December 31, 2019, respectively.\nThe total amounts due to the various related parties as of December 31, 2020 and December 31, 2019 was $464,692 and $383,111 respectively and the total amounts due to the Company from the various related parties as of December 31, 2020 and December 31, 2019 was $0 and $0 respectively.\nNote 5. Income Taxes\nThe Company accounts for income taxes in accordance with ASC 740-10-25, Accounting for Income Taxes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating loss and tax credit carry forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nThe Company has net operating loss carryforwards of approximately $7,087,000 which expire in the years 2021 through 2040 Management has determined that it is more likely than not that the net operating loss carryforward will not be fully utilized therefore a full valuation allowance has been provided. The Companys net operating loss carryforwards have been limited, pursuant to the Internal Revenue Code Section 382, as to the utilization of such net operating loss carryforwards due to changes in ownership of the Company over the years. We have determined the Company has lost cumulatively $1,413,000 of deferred tax assets attributed to net operating loss carryforwards due to the change in ownership in 2008. The remaining $215,000 of deferred tax assets can only be utilized up to $21,500 per year (relating to the IRC382, limitation) through 2028.\nDeferred tax assets:\nNet operating loss carryforward\n$ 543,000\n$ 505,000\nRevenue recognition\n66,000\nLess valuation allowance\n(543,000 )\n(571,000 )\nNet deferred tax asset\n$ -\n$ -\nThe reconciliation of the Companys effective tax rate differs from the Federal income tax rate of 21% and 21% for the years ended December 31, 2020 and 2019, respectively as a result of the following:\nTax (benefit) at statutory rate $ (30,000 ) $ 1,500\nState and local taxes, net of federal benefit (15,000 )\nPermanent differences - -\nChange in valuation allowance 45,000 (2,000 )\nTax due $ 0 $ 0\nFederal and State/Local tax years remain open by statute, generally three years. There are no open Statutory Federal or State/Local audits at December 31, 2020.\nNote 6. Licensees\nThe Company has 10 license agreements which were obtained between 2003 and 2020.\nOn March 18, 2016, the Company (through its subsidiary Scores Licensing Corp.) entered into a Trademark License (the Trademark License) with Michael Blutrich. The Trademark License grants Mr. Blutrich the non-exclusive use of the Companys registered trademarks, related logos and other intellectual property in connection with the development, production and distribution of a potential scripted television series, mini-series or movie of the week (the Series). Under the Trademark License, the Company will receive three percent of all fees, contingent compensation and other consideration that Mr. Blutrich receives in connection with the Series. Mr. Blutrich is permitted to assign the Trademark License without consideration to third-parties. The term of the Trademark License is for one year, which term may and has been extended. Effective March 18, 2016, the Company and Mr. Blutrich entered into an addendum to the Trademark License, extending the license to a book about Scores.\nSee Note 9 for litigation relating to a few of the Companys license agreements.\nIMOs members are the Company's majority shareholder, Robert M. Gans (72%), and Secretary and Director, Howard Rosenbluth (2%) hence making IMO a related party. The building occupied by IMO is owned by Westside Realty of New York Inc., of which the majority owner is Robert M. Gans (80%). The club accounted for 0% and 0% of the Company's royalty revenues for the years ended December 31, 2020 and 2019, respectively. Mr. Gans is also the majority owner (80%) of Swan, which accounted for 0% and 0% of the Company royalty revenues for the years ended December 31, 2020 and 2019, respectively. Mr. Gans is also the majority owner (92.165%) of Starlight, which accounted for 0% and 0% of the Company's royalty revenues for the years ended December 31, 2020 and 2019, respectively.\nNote 7. Contract Liabilities\nLicense agreements sometimes include Initiation/Inception Fees. Please see Note 3 for a detailed discussion of this matter.\nNote 8. Accounts Payable and Accrued Expenses\nAccounts payable and accrued expenses as of December 31, 2020 is comprised of professional fees of $100,000, legal fees of $8,749, insurance of $24,234, filing fees of $17,472 marketing fees and expenses of $15,320 and miscellaneous accruals and payables of $2,871. Accounts payable and accrued expenses as of December 31, 2019 is comprised of professional fees of $62,547, accrued payroll and taxes of $139, legal fees of $96,633, insurance of $3,679, filing fees of $15,421 marketing fees and expenses of $5,000 and miscellaneous accruals and payables of $725.\nNote 9. Commitments and Contingencies\nThe Company records $7,500 a month as rent, overhead, and services due to Metropolitan Lumber Hardware Building Supplies, Inc. for services rendered by the management of the Company. Mr. Gans is the sole owner of Metropolitan Lumber Hardware Building Supplies, Inc. The Company incurred management service expenses of $90,000 and $90,000 as December 31, 2020 and December 31, 2019, respectively.\nThe Company currently leases office space from the Westside Realty of New York which is owned and operated by Robert Gans the Company's majority shareholder, for $2,500 a month. The Company incurred rent expense of $30,000 and $30,000 as December 31, 2020 and December 31, 2019, respectively.\nOn April 3, 2016, 50 individuals purporting to be professional models and/or actresses collectively, the Plaintiffs) filed a civil suit in the United States District Court for the Southern District of New York against the Company, I.M. Operating, LLC, The Executive Club, LLC, and Robert M. Gans, collectively the (Defendants) alleging that images of Plaintiffs were used without their consent for commercial purposes on websites and social media outlets to promote gentlemens clubs operated by the Defendants or licensees of the Defendants (the Lawsuit). The Lawsuit further alleged that the unauthorized use of these images created, among other things, the false impression that these individuals either worked at, or endorsed, one or more of such clubs. The Lawsuit asserted causes of action under Section 43 of the Lanham Act, 28 U.S.C. § 1125(a)(1), premised on a theory of false endorsement and/or association; New York Civil Rights Law §§ 50-51; New Yorks Deceptive Trade Practices Act, New York General Business Law § 349; as well as various common law torts, namely defamation, negligence, conversion, unjust enrichment and quantum meruit. The Lawsuit sought unspecified compensatory damages, punitive damages, as well as attorneys fees and costs. The Lawsuit also sought an injunction permanently enjoining the use of the individuals images to promote, via any medium, any of the clubs. On April 20, 2017, as a result of the claims asserted in the Lawsuit, the Company filed a third-party complaint (the Third-Party Complaint) against certain licensees, namely CG Consulting, LLC; Anthony Quaranta; High Five Management Group, Inc.; Club 2000 Eastern Avenue, Inc.; SCMD, LLC; David Baucom; Manhattan Fashion L.L.C.; Stone Park Entertainment, Inc.; Silver Bourbon, Inc.; Tampa Food & Entertainment, Inc.; Fuun House Productions, L.L.C.; Norm A Properties, LLC; Southeast Show Clubs, LLC; Michael Tomkovich; Palm Spring Grill LLC; Houston KP LLC; and Star Light Events LLC (collectively, Third-Party Defendants) asserting causes of action for breach of contract, breach of warranty, contractual indemnification, common law indemnification, contribution and breach of contract for failure to procure insurance. The Company maintained in the Third-Party Complaint, among other things, that pursuant to the Third-Party Defendants respective license agreements, each of the Third-Party Defendants are expressly obligated to indemnify, defend and hold the Company harmless in connection with the conduct giving rise to the claims asserted by Plaintiffs in the Lawsuit. Third-Party Defendants Club 2000 Eastern Avenue, Inc., Fuun House Productions, L.L.C., and Norm A Properties, LLC (collectively the Defaulting Third-Party Defendants) failed to respond to the Third-Party Complaint.\nOn January 5, 2017, the Court issued an Order granting in part, and denying in part, Defendants motion to dismiss the Complaint. The Court dismissed Plaintiffs claims sounding in negligence, conversion, unjust enrichment and quantum meruit. The remaining claims were not dismissed at that time. On August 4, 2018, the Court dismissed Plaintiffs claims against Defendants, including the Company, with prejudice, at Plaintiffs request following settlement with Defendants. During 2018, the Company paid $1,310,000 to Plaintiffs in connection with the settlement. Between August 4, 2018 and October 9, 2018, the Court dismissed with prejudice the Companys claims against the Third-Party Defendants, other than the Defaulting Third-Party Defendants, at the Companys request following settlement with those Third-Party Defendants. The total amount of money paid to the Company by the settling Third-Party Defendants, and the Companys insurance carrier, is $505,660, paid thru September 30, 2019 and $90,000 received during the nine months ended September 30, 2019. Scores has obtained Default Orders against Fuun House Productions, L.L.C. and Norm A Properties, LLC. The value of the Companys claims against Fuun House Productions, L.L.C. and Norm A Properties, LLC are all that remain to be determined in the action. The Company became aware during the week of December 17, 2018 that Fuun House Productions, L.L.C. has filed for bankruptcy protection.\nOn January 3, 2017, the Company, together with its subsidiary SLC, filed an action against CJ NYC Inc. in the United States District Court for the Southern District of New York. Defendant utilizes the Scores name and trademark in connection with its ownership and operation of an adult entertainment club in Woodside, New York. In this action the Company sought damages for breach of contract in the amount of $85,000 and the issuance of a preliminary and permanent injunction prohibiting the defendant from using the Scores name and trademark with respect to the Woodside, New York club and all websites and social media sites controlled by Defendant. The defendant failed to appear and on February 27, 2017, the Company filed a motion for judgment by default. The court heard the Company motion on April 5, 2017, and on May 25, 2017, the court granted the Company's motion for a Judgment by default, granting a permanent injunction and awarding damages in the amount of $85,000 to SLC and $14,333 in damages and $530 in costs to the Company. All signage has been removed and the Company is attempting to collect on the default judgment, but it believes that Defendant no longer has any assets, leaving the Company unable to collect on the default judgment.\nOn January 31, 2017, the Company, together with its subsidiary SLC, filed an action against Funn House Productions LLC in the United States District Court for the Southern District of New York. Defendant utilizes the Scores name and trademark in connection with its ownership and operation of an adult entertainment club in New Haven, Connecticut. In this action the Company sought damages for breach of contract in the amount of $45,000 and the issuance of a preliminary and permanent injunction prohibiting the defendant from using the Scores name and trademark with respect to the New Haven, Connecticut club and all websites and social media sites controlled by Defendant. The Defendant failed to appear and on February 28, 2017, the Court granted Plaintiffs motion for a Judgment by default, granting a permanent injunction and awarding damages in the amount of $60,000. The parties negotiated a settlement agreement, which included a payment schedule, but then Defendant did not sign the proposed settlement agreement. The Company is attempting to collect on the default judgment, but it believes that Defendant no longer has any assets, leaving the Company unable to collect on the default judgment.\nOn July 25, 2017, plaintiff Dislenia Munoz, who formerly performed as an adult entertainer at Scores New York, owned in its entirety by I.M. Operating LLC, commenced a putative class action lawsuit against the Company, IMO, Robert Gans and Mark Yackow in the Supreme Court of the State of New York, County of New York. Plaintiff alleged that she and other similarly situated entertainers at Scores New York were misclassified as independent contractors, that they should have been classified as employees, and as a result, the Defendants violated, among other things, applicable state wage and hour laws. The Lawsuit sought unspecified compensatory damages, liquidated damages, as well as attorneys fees and costs. On September 22, 2018, Plaintiff (1) amended her complaint in the Lawsuit to excise her class allegations, and (2) discontinued the Lawsuit, without prejudice. Plaintiff has brought her claims in the Lawsuit in another forum against the Defendants, other than the Company, which is no longer a subject of Plaintiffs claims.\nOn October 8, 2018, the Company was served with a Summons and Complaint in the action entitled Luisa Santos de Oliveira v. Scores Holding Company, Inc.; Club Azure, LLC; Robert Gans; Mark S. Yackow; Howard Rosenbluth, Docket No. 1:18-cv-06769-GBD, in the United States District Court of the Southern District. Plaintiff claims that the Defendants violated the minimum wage and overtime provisions of the Fair Labor Standards Act (FLSA); violated the New York Minimum Wage Act and the overtime provisions of the New York State Labor Law (NYLL); violated the Spread of Hours Wage Order of the New York Commissioner of Labor; violated the Notice and Recordkeeping requirements of the NYLL; violated the wage statement provisions of the NYLL; recovery of equipment costs in violation of the FLSA and NYLL; and unlawful deductions from tips in violation of the NYLL. Plaintiff brought this action as a class action and seeks certification of this action as a collective action on behalf of herself and all other similarly situated employees and former employees of Defendants. The Company has submitted an Answer to Plaintiffs claims and the case is currently in the discovery phase. The Company, along with the Co-defendants, intends to vigorously defend itself against the claims asserted against it in this lawsuit. The likelihood of an unfavorable outcome is remote because the Companys records show, inter alia, that the Plaintiff never worked more than 25 hours per week. The case was assigned to a Magistrate Judge. There was a conference on March 2, 2021 and a Scheduling Order was entered. On March 26, 2021, a Stipulation of Discontinuance was so-ordered by the Federal Court, discontinuing all claims against the Company.\nOn October 10, 2018, the Company, filed an action against SCMD, LLC, in the Supreme Court of the State of New York, County of New York. Defendant utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in Baltimore, Maryland and paid royalty fees to the Company up through and including July of 2017 but did not abandon its use of the Scores name and trademarks until September of 2018. In this action, the Company sought damages for breach of contract in the amount of $160,000. On December 5, 2018, the case was removed to the United States District Court for the Southern District of New York. On February 19, 2019, an Amended Complaint was filed. On March 8, 2019, Defendants counsel requested permission from the Court to submit a motion to dismiss the Companys amended complaint. The Court finally granted Defendants request on November 6, 2019 and gave a briefing schedule. Defendants motion to dismiss was denied on August 14, 2020. In September of 2020, the parties settled this matter for $50,000, of which $5,000 remains due and outstanding. SCMD, LLC has since been dissolved. We are still trying to collect the remaining $5,000 that is due to the Company, but we are not confident that we will be successful given that SCMD, LLC has been dissolved. As a result, we have ceased all attempt to collect and have closed our file.\nOn September 14, 2018, the Company and its subsidiary Scores Licensing Corp. (SLC), filed an action against New 4125, LLC and Mike Taraska in the Supreme Court of the State of New York, County of New York. Defendants utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in Phoenix, Arizona. In this action, the Company sought damages for breach of contract in the amount of $47,500. Defendants filed an Answer to the Complaint but it was not submitted by an attorney notwithstanding the fact that corporations must be represented by counsel. A motion to vacate the Answer based on the fact that the corporate defendant is not represented by counsel is pending. We are currently pursuing both the corporation and the individual defendant.\nOn May 4, 2018, we together with our subsidiary SLC filed a civil action in Supreme Court of New York, New York County against Bonkers Space Coast Inc. and Ken Fees, the former licensee of the SCORES Green Bay, for unpaid royalties in the amount of $80,000. The Defendants have not appeared and Plaintiffs have filed a motion for judgment by default. A motion for default judgement was granted and judgement was entered on November 26, 2019. The Company has found real property owned by the Defendant and we are in the process of attaching same. We filed an exemplified copy of the default judgment with the State Court in Wisconsin, to collect licensing fees. A judgment was docketed on September 12, 2020 in Manitowoc County, WI for $82,330.34. The real property is valued at approximately $97,000 but the Wisconsin Homestead Act allows the debtor to exempt as much as $75,000 of equity. There is also a prior mortgage and tax lien totaling approximately $45,000. We have therefore ceased attempts to collect on the judgment because there is no remaining equity left in the real property.\nOn August 3, 2018, the Company and its subsidiary SLC, filed an action against Silver Bourbon, Inc. in the Supreme Court of the State of New York, County of New York. Defendant utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in New Orleans, Louisiana. In this action, the Company seeks damages for breach of contract in the amount of $145,500. The parties were in the process of negotiating a settlement but then the club permanently closed after it lost its lease and was forced to close in March of 2020 due to the global pandemic. We have therefore ceased all attempts to collect this debt.\nOn July 13, 2018, Company and its subsidiary SLC, filed an action against Manhattan Fashions, LLC in the Supreme Court of the State of New York, County of New York. Defendant utilized the Scores name and trademark in connection with its ownership and operation of an adult entertainment club located in Harvey, Louisiana. In this action, the Company sought damages for breach of contract in the amount of $84,000. Defendant did not appear, and On February 6, 2019, the Court granted the Companys motion for default judgment. The parties were in the process of negotiating a settlement agreement but then ceased all attempts to settle this matter after the club was forced to permanently close in March of 2020 due to the global pandemic. We have therefore ceased all attempts to collect this debt.\nOn September 5, 2019, the Company together with its subsidiary SLC filed a civil action in Supreme Court of New York, New York County against Scores Alabama. A cease and desist letter was sent. The Company finally entered into a license agreement as of March 5, 2020 with Cheetah Club, LLC for a club located in Huntsville, Alabama.\nThe Company had been in the process of negotiating a license agreement with an adult entertainment club that started using the Scores name and trademark in connection with an adult entertainment club located in Huntsville, Alabama without a proper licensing agreement in place.\nCharles G. Westlund personally guaranteed The Cheetah Clubs obligations under the license agreement. The Cheetah Club has since breached the license agreement by refusing to pay licensing fees. Notices to Cure were sent to both the Cheetah Club and Mr. Westlund, which were ignored. The license has since been terminated and they have been ordered to cease and desist all use of the Scores brand, but Scores Alabama continues to use the Scores brand without paying for the right to do so. As a result, we are in the process of commencing action against both The Cheetah Club and Mr. Westlund.\nIn July 2018, the Company entered into a confidential settlement agreement (the Settlement Agreement) in the Voronina litigation, and in August 2018, the Court entered an order dismissing the plaintiffs claims against the Defendants with prejudice. Metropolitan, loaned the Company an aggregate of $770,000 to enable the Company to make the payments called for by the Agreement.\nAs previously reported, in February 2017, the Company entered into settlement agreements (each, a Royalty Settlement Agreement) with Star Light, Swan, IMO and Robert M. Gans. Robert M. Gans is the owner of a majority of the equity of each of aforementioned Licensees. Pursuant to the Royalty Settlement Agreements, the Company forgave the repayment of a certain portion of unpaid, past-due royalties in return for the respective Licensees agreements to pay the remainder (the Royalty Settlement Amount) of the unpaid royalties, plus interest, to the Company. The Royalty Settlement Amount for each Licensee was represented by a promissory note, and Robert M. Gans guaranteed the payment of each Licensees obligations under the Settlement Agreement.\nThe Licensees did not remain current with respect to their obligations under the Royalty Settlement Agreements, and the Company did not call upon Robert M. Gans to honor his guarantees. The past due amounts under the Royalty Settlement Agreements aggregated $382,259 (the Aggregate Royalty Amount) as of December 1, 2018. As of such date, the Company, the Licensees, Metropolitan and Robert M. Gans entered into a Settlement and Offset Agreement (the Offset Agreement) pursuant to which the Aggregate Royalty Amount was offset against the Voronina Amount, thereby reducing the amount owed by the Company to Metropolitan to $408,546 (the Net Voronina Amount). The Net Voronina Amount is payable pursuant to a promissory note (the Voronina Note), which bears simple interest at the rate of 4% per annum, in 86 consecutive monthly installments of $5,000, and a final installment of $1,370, with the initial installment due and payable on January 1, 2022 (or the first business day thereafter). The Company may prepay the Voronina Note at any time, in whole or in part without premium or penalty. The Offset Agreement also provides for the immediate termination of the Royalty Settlement Agreements and the related promissory notes and guarantees.\nOn January 29, 2020, an individual referred to as Jane Doe, the Plaintiff, filed a civil suit in in the Circuit Court of the 13th Judicial Circuit, in the State of Florida, Hillsborough County, against the Company, its subsidiary, Scores Licensing Corp. (SLC), and several other defendants. Plaintiffs Complaint details the somber circumstances surround the illegal actions of a non-party, who pled guilty to certain crimes against Plaintiff that were committed at a club known as Scores Tampa. Plaintiff now seeks to hold the Company and its subsidiary, among other defendants, liable in connection with the non-partys illegal activity by asserting causes of action for negligence, vicarious liability and unjust enrichment. Initially, prior counsel moved to dismiss Plaintiffs Complaint in lieu of filing Answers. A motion to dismiss was submitted because the Court lacks personal jurisdiction under Floridas Long-Arm Statute and Due Process Requirements because neither the Company or its subsidiary had minimum contacts with Florida; nor was their a benefited conferred upon them.\nThe Court denied the motion to dismiss, and Scores Holding and Scores Licensing have filed Amended answers and Affirmative Defenses denying all allegations of the complaints against them asserting legal defenses to liability. The case is now in the deposition stages of discovery. Discovery deadline is October 14, 2022, except for expert disclosures, which are to be completed by December 27, 2022. The Deadline for dispositive motions is February 11, 2023. Deadline for a CME of Plaintiff is February 12, 2023. The deadline for completion of expert discovery is March 15, 2023. The mediation deadline is April 14, 2023. The trial is set for July 24, 2023, with pretrial conference set for July 18, 2023.\nOn July 15, 2019, plaintiff Jeremy Green, a former consultant to Swan Media Group, Inc (SMG), commenced an action in U.S. District Court, Southern District of New York against Scores Holding Co., Inc., Scores Media Group LLC, Scores Digital Gaming LLC (SDG) and individual defendants Robert Gans and Charilaos Yioves seeking to recover from all defendants under various theories of breach of contract, unjust enrichment, promissory estoppels, fraudulent inducement and breach of implied duty of good faith and fair dealing.\nOn October 6, 2022 to avoid expense, inconvenience, and uncertainty of further litigation, the Company has agreed to settle this matter for $10,000. Greene will receive the settlement sum in two payments of $5,000 each. The first settlement payment will be made upon execution of the settlement agreement and the second payment will be due thirty days after the first payment.\nOn April 17, 2021, in an action entitled Jessica Hall v. Scores Holding Company, Inc., et al, filed in Federal Court, Southern District, the Plaintiff claims that, while she worked at a gentlemens club located in New York, New York and commonly known as Scores NY, she was discriminated and retaliated against because of her race in violation of both Federal and State law. A motion for default judgment was denied, and Plaintiff was recently granted permission to file and serve an Amended Complaint. Accordingly on February 4, 2022 a First Amendment Complaint was filed. On March 4, 2022 an Answer to the First Amendment Complaint was filed On March 18, 2022 the Defendants filed A First Demand for Interrogatories Upon the Defendant. We have made demands for discovery from the Plaintiff and motioned for summary judgement seeking dismissal of all claims, which is pending. The likelihood of success on the merits is negligible because the Company, as simply the owner of the Scores brand and trademarks, did not own, operate or otherwise control Scores NY or employ, manage, or otherwise control Plaintiffs employment during the period October 23, 2009 until September 18, 2019. Towards that end, a motion for summary judgment was fully submitted on behalf of the Company on June 24, 2022. We await the Courts decision. In the meantime, discovery is ongoing.\nAs of the date of this report, there are no other material legal proceedings pending to which we or any of our property are subject, nor to our knowledge are any such proceedings threatened.\nNote 10. Subsequent Events\nPlease see Note 9 for events concerning legal matters.\nOn January 21, 2022 the Company and Scores Chicago entered into a Settlement Agreement and Amendment to the Licensing Agreement agreeing to a one-time payment to settle arrears resulting from the Covid 19 pandemic and to change the monthly licensing fee to a flat rate. All other terms of the original agreement were to remain in effect.\nOn March 23, 2022 the Company and Scores Las Vegas entered into a First Amendment to the Scores Trademark Sublicense Agreement agreeing to a one-time payment to settle arrears resulting from the Covid 19 pandemic and to make a one-time payment for granting it an exclusive, non-transferable license for the use of certain Scores trademarks in its night club/restaurant for a period of twenty-five years. All other terms of the original agreement were to remain in effect.\nEffective January 1, 2021, Metropolitan Lumber Hardware and Building Supplies, Inc.(Metropolitan) the located at 617 11th Avenue, New York, N.Y. became the new lessor of our 500 square feet office occupancy at that location. The monthly rent, which includes overhead cost will remain at $2,500. Robert M. Gans, the Companys President, Chief Executive Officer, is the sole owner (100%) of Metropolitan.\nManagement evaluated subsequent events through the date of this filing and determined that no additional events have occurred that would require adjustment to or disclosure in the consolidated financial statements."
}