{
    "cik": "836157",
    "company": "LINDSAY CORP",
    "filing_type": "10-K",
    "filing_date": "2023-10-19",
    "period_of_report": "2023-08-31",
    "sic": "3523",
    "state_of_inc": "DE",
    "state_location": "NE",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/836157/0000950170-23-054198-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/836157/000095017023054198/lnn-20230831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/836157/0000950170-23-054198.txt",
    "filename": "836157_10K_2023_0000950170-23-054198.htm",
    "content": "ITEM 1 - Business\nINTRODUCTION\nLindsay Corporation, along with its subsidiaries (collectively called Lindsay or the Company), is a global leader in providing a variety of proprietary water management and road infrastructure products and services. The Company has been involved in the manufacture and distribution of agricultural irrigation equipment since 1955 and has grown from a regional company to an international firm with worldwide sales, distribution and manufacturing operations. Lindsay, a Delaware corporation, maintains its corporate offices in Omaha, Nebraska. The Company has operations which are categorized into two major reporting segments, Irrigation and Infrastructure.\nIrrigation Segment - The Companys irrigation segment includes the manufacture and marketing of center pivot, lateral move, and hose reel irrigation systems which are used principally in the agricultural industry to increase or stabilize crop production while conserving water, energy and labor. The irrigation segment also manufactures and markets repair and replacement parts for its irrigation systems and controls and large diameter steel tubing. The Company continues to strengthen irrigation product offerings through innovative technology such as Global Positioning System (GPS) positioning and guidance, variable rate irrigation, wireless irrigation management, irrigation scheduling, Industrial Internet of Things (IIOT) technology solutions and mobile device applications. The Companys primary domestic irrigation manufacturing facilities are located in Lindsay, Nebraska; Olathe, Kansas; and Norfolk, Nebraska. Internationally, the Company has commercial and production operations in Brazil, France, China, Türkiye (formerly Turkey), and South Africa, as well as distribution and sales operations in the Netherlands, Egypt, Australia, and New Zealand. The Company also exports equipment from the U.S. and its global production facilities to other international markets.\nInfrastructure Segment - The Companys infrastructure segment includes the manufacture and marketing of moveable barriers, specialty barriers, crash cushions and end terminals, road marking and road safety equipment, and railroad signals and structures. The infrastructure segment also offers technology to monitor critical safety infrastructure on roadways. The principal infrastructure manufacturing facilities are located in Rio Vista, California; Milan, Italy; and Lindsay, Nebraska.\nPRODUCTS BY SEGMENT\nIRRIGATION SEGMENT\nProducts - The Company manufactures and markets its center pivot, lateral move irrigation systems, and irrigation controls in the U.S. and internationally under its Zimmatic® brand. The Company also manufactures and markets hose reel travelers under the Perrot™ brand. The Company also produces or markets chemical injection systems, variable rate irrigation systems, flow meters, weather stations, soil moisture sensors, and remote monitoring and control systems. In addition to whole systems, the Company manufactures and markets repair and replacement parts for its irrigation systems and controls and large diameter steel tubing. Furthermore, the Company designs and manufactures innovative IIOT technology solutions, data acquisition and management systems, and custom electronic equipment for critical applications under its Elecsys™ brand.\nThe Companys irrigation systems are primarily of the standard center pivot type, with a small portion of its products consisting of the lateral move type. Both are automatic move systems consisting of sprinklers mounted on a water carrying pipeline which is supported approximately 11 feet off the ground by a truss system suspended between moving towers.\nA standard center pivot in the U.S. is typically seven spans and approximately 1,300 feet long and is designed to circle within a quarter-section of land, which comprises 160 acres, wherein it irrigates approximately 125 to 130 acres. A center pivot or lateral move system can also be custom designed and can irrigate from 25 to 600+ acres.\nA center pivot system represents a significant investment to a farmer. In a dry land conversion to center pivot irrigation, approximately one-half of the investment is for the pivot itself, and the remainder is attributable to installation of additional equipment such as wells, pumps, underground water pipes, electrical supply, and a concrete pad upon which the pivot is anchored. The Companys center pivot and lateral move irrigation systems can be enhanced with a family of integrated proprietary products such as GPS monitoring and other automated controls.\nThe Company also manufactures and distributes hose reel travelers. Hose reel travelers are typically deployed in smaller or irregular fields and usually are easy to operate, easy to move from field to field, and a smaller investment than a standard center pivot.\nThe Company also markets proprietary remote monitoring and automation technology that works on any brand of electronic pivot and drip irrigation systems and is sold on a subscription basis under the brand names FieldNET® and FieldWise®. FieldNET® is commercialized exclusively through Zimmatic® dealers while FieldWise® is used primarily by non-Zimmatic® dealers and customers. These technologies enable growers to remotely monitor and operate irrigation equipment, saving time, and reducing water and energy consumption. The technology uses cellular or radio frequency communication systems to remotely acquire data relating to various conditions in an irrigated field, including operational status of the irrigation system, position of the irrigation system, water usage, weather and soil conditions, and similar data. The system can remotely control the irrigation system, altering the speed to vary water application amounts, and controlling pump station and diesel generator operation. Data management and control is achieved using applications running on various personal computer or mobile devices connected to the internet.\nThe Company also markets patented technology under the FieldNET Advisor® product name which delivers information that helps farmers decide precisely when, where and how much to irrigate. This technology combines crop and irrigation science and expertise accumulated since 1955 with FieldNETs cloud computing capabilities, remote sensing functionality and machine learning to provide farmers with field-specific and crop-specific irrigation recommendations.\nOther Types of Irrigation - Center pivot and lateral move irrigation systems compete with three other types of irrigation: flood, drip, and other mechanical devices such as hose reel travelers and solid set sprinklers. The majority of worldwide irrigation is accomplished by traditional flood irrigation. Flood irrigation is accomplished by either flooding an entire field, or by providing a water source (ditches or a pipe) along the side of a field, which is planed and slopes slightly away from the water source. The water is released to the crop rows through gates in the ditch or pipe, or through siphon tubes arching over the ditch wall into some of the crop rows. It runs down through the crop row until it reaches the far end of the row, at which time the water source is moved and another set of rows are flooded. Disadvantages or limitations of flood irrigation include that it cannot be used to irrigate uneven, hilly, or rolling terrain, it can be wasteful or inefficient and coverage can become inconsistently applied. In drip or low flow irrigation, perforated plastic pipe or tape is installed on the ground or buried underground at the root level. Several other types of mechanical devices, such as hose reel travelers, irrigate the remaining irrigated acres.\nCenter pivot, lateral move, and hose reel traveler irrigation offer significant advantages when compared with other types of irrigation. It requires less labor and monitoring; can be used on sandy ground, which, due to poor water retention ability, must have water applied frequently; can be used on uneven ground, thereby allowing previously unsuitable land to be brought into production; can be used for the application of fertilizers, insecticides, herbicides, or other chemicals (termed fertigation or chemigation); and conserves water and chemicals through precise control of the amount and timing of the application.\nMarkets - Water is an essential and critical requirement for crop production, and the extent, regularity, and frequency of water application can be a critical factor in crop quality and yield. The fundamental factors which govern the demand for center pivot and lateral move systems are essentially the same in both the U.S. and international markets. Demand for center pivot and lateral move systems is determined by whether the value of the increased crop production and cost savings attributable to center pivot or lateral move irrigation exceeds any increased costs associated with purchasing, installing, and operating the equipment. Thus, the decision to purchase a center pivot or lateral move system, in part, reflects the profitability of agricultural production, which is determined primarily by the prices of agricultural commodities and the costs of other farming inputs. In new or developing international markets, demand for irrigation systems can also be driven by food security concerns and the desire of some countries to become more self-sufficient in food production.\nThe current demand for center pivot systems has three sources: conversion to center pivot systems from less water-efficient, more labor-intensive types of irrigation; replacement of older center pivot systems, which are beyond their useful lives or are technologically obsolete; and conversion of dry land farming to irrigated farming. Demand for center pivots and lateral move irrigation equipment also depends upon the need for the particular operational characteristics and advantages of such systems in relation to alternative types of irrigation, primarily flood. More efficient use of the basic natural resources of land, water, and energy helps drive demand for center pivot and lateral move irrigation equipment. An increasing global population not only increases demand for agricultural output, but also places additional and competing demands on land, water, and energy. The Company expects demand for center\npivots and lateral move systems to continue to increase relative to other irrigation methods because center pivot and lateral move systems are preferred where the soil is sandy; the terrain is not flat; the land area to be irrigated is sizeable; there is a shortage of reliable labor; water supply is restricted and conservation is preferred or critical; and/or fertigation or chemigation will be utilized.\nUnited States Market - In the United States, the Company sells its branded irrigation systems, including Zimmatic®, to over 200 independent dealers, who resell to their customer, the farmer. Dealers assess their customers requirements, design the most efficient solution, assemble and erect the system in the field, and provide additional system components, primarily relating to water supply (wells, pumps, pipes) and electrical supply (on-site generation or hook-up to power lines). Lindsay dealers generally are established local agribusinesses, many of which also deal in related products, such as well drilling and water pump equipment, farm implements, grain handling and storage systems, and farm structures.\nInternational Market - The Company sells center pivot and lateral move irrigation systems throughout the world. International sales accounted for approximately 47 percent of the Companys total irrigation segment revenues in both fiscal year 2023 and 2022. The Company sells direct to consumers, as well as through an international dealer network, and has production and sales operations serving the key markets in South America, Western and Eastern Europe, China, Africa, Middle East, Australia, and New Zealand. The Company also exports irrigation equipment from its global production facilities to other international markets.\nThe Companys industry position is such that it believes that it will likely be considered as a potential supplier for most major international agricultural development projects utilizing center pivot or lateral move irrigation systems.\nCompetition - Four manufacturers control a substantial majority of the U.S. center pivot irrigation system market. The international irrigation market includes participation and competition by the leading U.S. manufacturers, as well as various regional manufacturers. The Company competes by continuously improving its products through ongoing research and development activities, channel improvement initiatives, and its operational strategies. The Company continues to strengthen irrigation product offerings through innovative technology such as GPS positioning and guidance, variable rate irrigation, wireless irrigation management, and mobile device applications, as well as through the acquisition of products and services that allow the Company to provide a more comprehensive solution to growers needs. Competition also occurs in areas of price and seasonal programs, product quality, durability, controls, product characteristics, retention and reputation of local dealers, customer service, and, at certain times of the year, the availability of systems and their delivery time. On balance, the Company believes it competes favorably with respect to these factors.\nINFRASTRUCTURE SEGMENT\nProducts - The Companys Quickchange® Moveable Barrier™ system, commonly known as the Road Zipper System®, is composed of three parts: 1) T-shaped concrete and steel barriers that are connected to form a continuous wall; 2) a Barrier Transfer Machine™ (BTM™) capable of moving the barrier laterally across the pavement; and 3) the variable length barriers necessary for accommodating curves. A barrier element is approximately 32 inches high, 12-24 inches wide, 3 feet long, and weighs 1,500 pounds. The barrier elements are interconnected by heavy duty steel hinges to form a continuous barrier. The BTM™ employs an inverted S-shaped conveyor mechanism that lifts the barrier, moves it laterally to the opposite side of the road, and sets it back down on the roadway surface.\nIn permanent applications, the Road Zipper System® increases capacity and reduces congestion by varying the number of directional traffic lanes to match the traffic demand and promotes safety by maintaining the physical separation of opposing lanes of traffic. Roadways with fixed medians have a set number of lanes in each direction and cannot be adjusted to traffic demands that may change over the course of a day, or to capacity reductions caused by traffic incidents or road repair and maintenance. Applications include high-volume highways where expansion may not be feasible due to lack of additional right-of-way, environmental concerns, or insufficient funding. The Road Zipper System® is particularly useful in busy commuter corridors and at choke points such as bridges and tunnels. Road Zipper Systems® can also be deployed at roadway or roadside construction sites to accelerate construction, improve traffic flow, and safeguard work crews, motorists, pedestrians, cyclists and others using the roadway by positively separating the work area and traffic. Examples of types of work completed with the help of a Road Zipper System® include highway reconstruction, paving and resurfacing, road widening, median and shoulder construction, and repairs to tunnels and bridges.\nThe Company offers a variety of equipment lease options for Road Zipper Systems® and BTM™ equipment used in construction applications. The leases extend for periods of one month or more for equipment already existing in the Companys lease fleet. Longer lease periods may be required for specialty equipment that must be built for specific projects.\nCrash Cushions - The Company offers a complete line of redirective and non-redirective crash cushions which are used to enhance highway safety at locations such as toll booths, freeway off-ramps, medians and roadside barrier ends, bridge supports, utility poles, and other fixed roadway hazards. The Companys primary crash cushion products cover a full range of lengths, widths, speed capacities, and application accessories and include the following brand names: TAU®; Universal TAU-II®; TAU-II-R™; TAU-B_NR™; ABSORB 350®; Walt™; TAU-M™; ABSORB-M™ and TAU-TUBE™. The crash cushions compete with other vendors in the world market. These systems are generally sold through a distribution channel that is domiciled in particular geographic areas.\nSpecialty Barriers - The Company also offers specialty barrier products such as the SAB™, ArmorGuard™, PaveGuard™, and DR46™ portable barrier and/or barrier gate systems. These products offer portability and flexibility in setting up and modifying barriers in work areas and provide quick-opening, high-containment gates for use in median or roadside barriers. The gates are generally used to create openings in barrier walls of various types for both construction and incident management purposes. The DR46™ is an energy-absorbing barrier that can help protect motorcyclists from impacting guardrail posts, which is an area of focus by departments of transportation and government regulators for reducing the amount and severity of injuries.\nRoad Marking and Road Safety Equipment - The Company also offers preformed tape and a line of road safety accessory products. The preformed tape is used primarily in temporary applications such as markings for work zones, street crossings, and road center lines or boundaries. The road safety equipment consists of mostly plastic and rubber products used for delineation, slowing traffic, and signaling. The Company also manages an ISO 17025 certified testing laboratory that performs full-scale impact testing of highway safety products in accordance with the National Cooperative Highway Research Program (NCHRP) Report 350, the Manual for Assessing Safety Hardware (MASH), and the European Norms (EN1317 Norms) for these types of products. The NCHRP Report 350 and MASH guidelines are procedures required by the U.S. Department of Transportation Federal Highway Administration (FHWA) for the safety performance evaluation of highway features. The EN1317 Norms are being used to qualify roadway safety products for the European markets.\nRail Products - The Company also designs, engineers and manufactures a line of products for the railroad industry. These products are designed to meet industry standards and include signals and lights, structures, foundations, junction boxes and signs.\nMarkets - The Companys primary infrastructure market includes moveable concrete barriers, delineation systems, crash cushions, and similar protective equipment. The U.S. roadway infrastructure market includes projects such as new roadway construction, bridges, tunnels, maintenance and resurfacing, and development of technologies for relief of roadway congestion. Much of the U.S. highway infrastructure market is driven by government (federal and state) spending programs. For example, the U.S. government funds highway and road improvements through the Federal Highway Trust Fund Program. This program provides funding to improve the nations roadway system. Matching funding from the various states may be required as a condition of federal funding. In the long term, the Company believes that the federal program provides a solid platform for growth in the U.S. market, as it is generally acknowledged that additional funding will be required for infrastructure development and maintenance in the future.\nThe global market for the Companys infrastructure products continues to be driven by population growth and the need for improved road safety. The international market differs from country to country. The standardization in performance requirements and acceptance criteria for highway safety devices adopted by the European Committee for Standardization has lead to greater uniformity and a larger installation program. Prevention programs put in place in various countries to lower highway traffic fatalities has also lead to greater demand. The Company distributes infrastructure products in Europe, South America, the Middle East, Australia and Asia. The Company expects to continue expanding in international markets as populations grow and markets become more established.\nCompetition - The Company competes in certain product lines with several manufacturers. The Company competes by striving to continuously improve its products through ongoing research and development activities. The Company competes with certain products and companies in its crash cushion business, but has limited competition in its moveable barrier line, as there is not another moveable barrier product today comparable to the Road Zipper System®. However, the Companys barrier product does compete with traditional safety-shaped concrete barriers and other safety barriers.\nDistribution Methods and Channels - The Company has dedicated production and sales operations in the United States, Italy and the Netherlands. Sales efforts consist of both direct sales and sales programs managed by the Companys network of distributors and third-party representatives. The sales teams have responsibility for new\nbusiness development and assisting distributors and dealers in soliciting large projects and new customers. The distributor and dealer networks have exclusive territories and are responsible for developing sales and providing service, including product maintenance, repair, and installation. The typical dealer sells an array of safety supplies, road signs, crash cushions, delineation equipment, and other highway products. Customers include departments of transportation, municipal transportation road agencies, roadway contractors, subcontractors, distributors, and dealers. Due to the project nature of the roadway construction and congestion management markets, the Companys customer base changes from year to year. Due to the limited life of projects, it is rare that a single customer will account for a significant amount of revenues in consecutive years. The customer base also varies depending on the type of product sold. The Companys moveable barrier products are typically sold to transportation agencies or the contractors or suppliers serving those agencies. In contrast, distributors account for a majority of crash cushion sales since those products have lower price points and tend to have shorter lead times.\nGENERAL\nCertain information generally applicable to both of the Companys reportable segments is set forth below.\nSEASONALITY\nIrrigation equipment sales are seasonal by nature. Farmers generally order systems to be delivered and installed before the growing season. Shipments to customers located in Northern Hemisphere countries usually peak during the Companys second and third fiscal quarters for the spring planting period. Sales of infrastructure products are traditionally higher during prime road construction seasons and lower in the winter. The primary construction season for Northern Hemisphere countries generally corresponds with the Companys third and fourth fiscal quarters.\nCUSTOMERS\nThe Company is not dependent upon a single customer or upon a limited number of customers for a material part of either segments business. The loss of any one customer would not have a material adverse effect on the Companys financial condition, results of operations, or cash flow.\nORDER BACKLOG\nAs of August 31, 2023, the Company had an order backlog of $78.7 million compared with $96.8 million at August 31, 2022. The Companys backlog can fluctuate from period to period due to the seasonality, cyclicality, timing, and execution of contracts. Backlog typically represents long-term projects as well as short lead-time orders; therefore, it is generally not a good indication of the revenues to be realized in succeeding quarters.\nRAW MATERIALS AND COMPONENTS\nRaw materials used by the Company include coil steel, angle steel, plate steel, zinc, tires, gearboxes, concrete, rebar, fasteners, and electrical and hydraulic components (motors, switches, cable, valves, hose, and stators). While the Company has, on occasion, faced shortages of certain such materials, the Company believes it currently has ready access from assorted domestic and foreign suppliers to adequate supplies of raw materials and components.\nCAPITAL EXPENDITURES\nCapital expenditures for fiscal 2023, 2022, and 2021 were $18.8 million, $15.6 million, and $26.5 million, respectively. Capital expenditures for fiscal 2024 are estimated to be between $35.0 million and $40.0 million, including equipment replacement, productivity improvements, new product development and commercial growth investments. An increase over recent levels of capital expenditures relates to modernization and productivity improvements planned at certain manufacturing facilities. The Companys management does maintain flexibility to modify the amount and timing of some of the planned expenditures in response to economic conditions.\nPATENTS, TRADEMARKS, AND LICENSES\nThe Company relies on a variety of intellectual property laws, confidentiality procedures, and contractual provisions to protect its proprietary offerings and its brand.\nThe Company owns and, from time to time, licenses patents for many of its irrigation and infrastructure solutions, as well as cellular communication techniques, cathodic protection measurement methods, and data compression and transmission. The Company follows a policy of applying for patents on all significant patentable inventions in markets deemed appropriate. Although the Company believes it is important to follow a patent protection policy, the Company's business is not dependent, to any material extent, on any single patent or group of patents.\nThe Companys Zimmatic®, Perrot™, Road Zipper®, The Road Zipper System®, Quickchange® Moveable Barrier™, ABSORB 350®, ABSORB-M™, FieldNET®, FieldNET Advisor®, FieldNET Crop Advisor®, FieldNET Irrigation\nAdvisor®, FieldNET VRI Advisor®, FieldNET Weather Advisor®, WatertrendSM, FieldWise®, Greenfield®, GrowSmart® Z-TRAX®, TAU®, Universal TAU-II®, TAU-II-R™, TAU-B_NR™, TAU-M™, TAU-TUBE™, CableGuard™, TESI™, SAB™, ArmorGuard™, PaveGuard™, DR46™, U-MAD™, Sabertooth®, RoadConnect™, ImpactAlert™, and other trademarks, service marks, domain names, and copyrights are registered or applied for in the major markets in which the Company sells its products.\nHUMAN CAPITAL RESOURCES\nThe Company and its wholly-owned subsidiaries have 1,209 employees as of August 31, 2023. None of the Companys United States based employees are represented by a union. Certain of the Companys non-U.S. employees are unionized due to local governmental regulations. Maintaining a sufficient number of skilled employees at its various manufacturing sites is a key focus of the Companys human capital efforts. The Company believes it maintains a sufficient number of skilled employees by offering competitive wages, benefits and training and development programs.\nWe believe our commitment to empowering and developing our human capital resources is essential to becoming the innovation and market leader in our core business. Empowering our people is one of our priority environmental, social and governance (ESG) focus topics, highlighting three areas in particular: (1) workplace culture, (2) diversity, equity and inclusion, and (3) employee health and safety.\nWorkplace Culture\nWe have built our culture on the foundation of the core values of leadership, integrity, collaboration, accountability, and respect for others. Additionally, we have an annual evaluation process to measure and assess organizational health and employee engagement. This focus on organizational health and employee engagement aims to create and sustain employee empowerment, team collaboration, and support and service to the greater community.\nDiversity, Equity and Inclusion\nWe are guided by our global Anti-Discrimination and Equal Employment Policy which delineates our commitment to preventing any form of unlawful employee discrimination or harassment and our dedication to providing a workplace where all employees, customers, partners and investors are treated with courtesy, respect, and dignity. We are committed to building a diverse and inclusive workplace, guided by our core value of respect for others, and reinforced in our Code of Business Conduct and Ethics.\nEmployee Health and Safety\nThe health and safety of our employees is an integral part of everything we do. We hold each other accountable to actively promote a safe and healthy workplace, and report any situations that may pose a health, safety or security risk. In Fiscal 2021 we implemented the Lindsay Safety System that we use to guide and develop our culture focused on safety. The Lindsay Safety System is comprised of eight core elements:\nHazard ID / Assessment\nTraining\nAudits\nPolicy/Procedures\nIncident Investigation\nInspections\nMetrics\nRecognition\nWe approach safety by looking at cultural change and engineering developments simultaneously. We conduct job safety assessments, training and incident investigations. We also recognize and instill best practices in employee behavior, wherever practicable. In addition, we create policies and make sure the appropriate infrastructure is in place and maintained. Our audit and inspection processes validate best-in-class performance.\nEFFECT OF GOVERNMENTAL REGULATION\nThe Company is subject to numerous laws and government regulations, including those that govern environmental and occupational health and safety matters. The Company believes that its operations are substantially in compliance with all applicable laws and regulations, and that it holds all necessary permits to operate its business in each jurisdiction in which its facilities are located. Laws and government regulations are subject to change and interpretation. In some cases, compliance with applicable laws and regulations may require the Company to make additional capital and operational expenditures. The Company, however, is not currently aware of any material expenditures required to comply with applicable laws or government regulations, other than the capital expenditures relating to environmental remediation activities at its Lindsay, Nebraska plant that are more fully described in Note 15, Commitments and Contingencies, to the Companys consolidated financial statements. The Company accrues for the anticipated cost associated with compliance with laws and governmental regulations applicable to its business, including investigation and remediation costs at its Lindsay, Nebraska site, when its obligation to incur those costs is probable and can be reasonably estimated. Any revisions to these estimates could be material to the operating results of any fiscal quarter or fiscal year, however the Company does not expect future capital expenses relating to compliance with government regulations, including those for remediation of its Lindsay, Nebraska site, to have a material adverse effect on its earnings, liquidity, financial condition or competitive position.\nFINANCIAL INFORMATION ABOUT FOREIGN AND U.S. OPERATIONS\nThe Companys primary production facilities are located in the United States. The Company has smaller production and sales operations in Brazil, France, Italy, China, Türkiye (formerly Turkey), and South Africa, as well as distribution and sales operations in the Netherlands, Egypt, Australia, and New Zealand. Where the Company exports products from the United States to international markets, the Company generally ships against prepayment, an irrevocable letter of credit confirmed by a U.S. bank or another secured means of payment, or with credit insurance from a third party. For sales within both U.S. and foreign jurisdictions, prepayments or other forms of security may be required before credit is granted, however most local sales are made based on payment terms after a full credit review has been performed. Most of the Companys financial transactions are in U.S. dollars, although some export sales and sales from the Companys foreign subsidiaries are conducted in other currencies. Approximately 38 and 37 percent of total consolidated Company revenues were conducted in currencies other than the U.S. dollar in fiscal 2023 and 2022, respectively. To reduce the uncertainty of foreign currency exchange rate movements on these sales and purchase commitments conducted in local currencies, the Company monitors its risk of foreign currency fluctuations and, at times, may enter into forward exchange or option contracts for transactions denominated in a currency other than U.S. dollars.\nIn addition to the transactional foreign currency exposures mentioned above, the Company also has translation exposure resulting from translating the financial statements of its international subsidiaries into U.S. dollars. In order to reduce this translation exposure, the Company, at times, utilizes foreign currency forward contracts to hedge its net investment exposure in its foreign operations. For information on the Companys foreign currency risks, see Item 7A of Part II of this report.\nINFORMATION AVAILABLE ON THE LINDSAY WEBSITE\nThe Company makes available free of charge on its website homepage, under the tab Investor Relations - SEC Filings, its Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after the Company electronically files such material with, or furnishes it to, the Securities and Exchange Commission. Additionally, the Company's annual sustainability report is available on the website under the tab \"Investor Relations - Sustainability Report.\" The Companys internet address is http://www.lindsay.com; however, information posted on its website is not part of this Annual Report on Form 10-K. The following documents are also posted on the Companys website homepage, under the tabs Investor Relations - Committees and Investor Relations - Ethics:\nAudit Committee Charter\nCorporate Governance and Nominating Committee Charter\nCode of Business Conduct and Ethics\nCorporate Governance Principles\nCode of Ethical Conduct\nHuman Rights Policy\nEmployee Complaint Procedures for Accounting and Auditing Matters\nHuman Resources and Compensation Committee Charter\nSupplier Code of Conduct\nSpecial Toll-Free Hotline Number and E-mail Address for Making Confidential or Anonymous Complaints\nThese documents are also available in print to any stockholder upon request, by sending a letter addressed to the Secretary of the Company.\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nAll executive officers of the Company are appointed by the Board of Directors annually and have employment agreements. There are no family relationships between any director or executive officer. There are no arrangements or understandings between any executive officer and any other person pursuant to which they were selected as an officer. The following table lists the Companys executive officers and other key employees and each of their ages, and positions as of October 19, 2023.\nAge\nPosition\nRandy A. Wood\nPresident and Chief Executive Officer\nBrian L. Ketcham\nSenior Vice President and Chief Financial Officer\nJ. Scott Marion\nPresident - Infrastructure\nGustavo E. Oberto\nPresident - Irrigation\nBrian J. Magnusson*\nSenior Vice President - Strategy and Business Development\nEric R. Arneson*\nSenior Vice President - General Counsel and Secretary\nKelly M. Staup*\nSenior Vice President - Human Resources and Chief Diversity Officer\nLori L. Zarkowski*\nChief Accounting Officer\nMelissa G. Moreno*\nSenior Vice President and Chief Information Officer\nRichard A. Harold*\nSenior Vice President - Global Operations\n*\tThe employee is not an executive officer of the Registrant.\nMr. Randy A. Wood is the President and Chief Executive Officer of the Company, a position he has held since January 2021. Mr. Wood has also been a director of the Company since January 2021 and he is the only executive officer of the Company serving on the Board of Directors. Between September 2020 and January 2021, Mr. Wood served as the Chief Operating Officer of the Company. Between May 2016 and September 2020, Mr. Wood served as President - Irrigation of the Company. Between October 2013 and May 2016, Mr. Wood served as President - International Irrigation of the Company. Between February 2012 and October 2013, Mr. Wood served as Vice President - Americas / ANZ Sales and Marketing. Previously he was Vice President - North America Irrigation Sales of the Company and held such position from March 2008, when he joined the Company. Prior to March 2008, Mr. Wood spent 11 years with Case Corporation / CNH Global including roles as the Senior Director of Marketing, Case IH Tractors, and Senior Director of Sales and Marketing, Parts and Service.\nMr. Brian L. Ketcham is the Senior Vice President and Chief Financial Officer of the Company, and has held such positions since April 2016. Prior to joining the Company and since 2001, Mr. Ketcham served in various finance roles at Valmont Industries, Inc., a company that provides irrigation and infrastructure equipment, most recently as Vice President and Group Controller of the Engineered Support Structures segment. Prior to joining Valmont, Mr. Ketcham held various positions with Consolidated Container Company LLC and KPMG LLP.\nMr. J. Scott Marion is the President - Infrastructure Division, a position he has held with the Company since May 2016. Between April 2011 and May 2016, Mr. Marion served as Vice President and General Manager - Americas and APAC (Infrastructure) of the Company. From January 2005 to April 2011, Mr. Marion served in several management positions at Pentair. Prior to 2005, Mr. Marion spent 14 years with General Electric in a variety of sales and managerial capacities.\nMr. Gustavo E. Oberto is the President - Irrigation Division, a position he has held since September 2020. Between September 2019 and August 2020, Mr. Oberto served as President - Elecsys International, LLC, which provides IIOT\nsolutions and is a subsidiary of the Company. Prior to joining the Company, Mr. Oberto served in various management roles at Conductix-Wampfler Group, an industrial equipment supplier and a division of Delachaux S.A, most recently as Managing Director of Global Sales & Markets from March 2016 to September 2019. During his 20-year career at Conductix-Wampfler Group, Mr. Oberto held a series of leadership positions in international business development. Prior to joining Conductix-Wampfler Group, Mr. Oberto worked for Travelex Global Payments and also worked as International Liaison to Former Nebraska Governor Ben Nelson where he advised Midwestern companies on how to penetrate the Latin America agriculture market. Mr. Oberto is currently a member of the U.S. Commercial Service District Export Council.\nMr. Brian J. Magnusson is the Companys Senior Vice President - Strategy and Business Development and has held such position since January 2023. Between May 2019 and January 2023, Mr. Magnusson served as the Companys Vice President, The Americas and held responsibility for the Companys irrigation business in North and South America. Between June 2018 and May 2019, Mr. Magnusson served as the Companys Vice President, Technology and Innovation. Previous to that role, Mr. Magnusson served as the Companys Vice President, Technology, a position he held starting with his arrival to the Company in 2015. Prior to joining the Company, Mr. Magnusson served as Global Director, Tractor Portfolio Management at CNH Industrial for three years and spent the preceding four years at Bain & Company advising executive teams at Fortune 500 corporations on strategic growth challenges.\nMr. Eric R. Arneson is the Senior Vice President - General Counsel and Secretary of the Company and has held such positions since April 2008, when he joined the Company. Prior to that time and since January 1999, Mr. Arneson practiced law with the law firm of Kutak Rock LLP, and was most recently a partner of the firm.\nMs. Kelly M. Staup is the Senior Vice President - Human Resources and Chief Diversity Officer, a position she has held with the Company since January 2018. From November 2016 to January 2018, Ms. Staup served as Director - Human Resources of the Company. From June 2011 to November 2016, Ms. Staup served as the Companys Organization Development and Recruiting Manager. Prior to joining the Company, Ms. Staup was an Associate Vice President of SkillStorm from August 2008 to June 2011 and previously served in managerial roles at Ajilon and Digital People.\nMs. Lori L. Zarkowski is the Chief Accounting Officer of the Company and has held such position since August 2011. Ms. Zarkowski joined the Company in June 2007 as Corporate Reporting Manager and was promoted to Corporate Controller in April 2008. Prior to joining the Company and since 1997, Ms. Zarkowski was most recently an Audit Senior Manager with Deloitte & Touche LLP.\nDr. Melissa Moreno is the Senior Vice President and Chief Information Officer of the Company, a position she has held since March 2021, when she joined the Company. Prior to joining the Company, Dr. Moreno served in a variety of information technology roles with Gallup, a company that provides analytics and advisory services, from 2008 to 2021, most recently serving as Chief Information Officer, Cybersecurity and InfrastructureGallup from December 2018 to March 2021 and Executive Director, Cybersecurity and Infrastructure from February 2014 to December 2018. Prior to joining Gallup, Dr. Moreno managed information technology functions at ConAgra Foods and Arthur Andersen.\nMr. Richard A. Harold is the Senior Vice President - Global Operations of the Company, a position he has held since April of 2022. Prior to joining the Company, Mr. Harold served from 2018 to 2022 with Rogers Corporation, a company that provides specialty engineered materials, most recently as a Senior Director of Global Operations. Prior to that time, Mr. Harold served from 2015 to 2017 as Senior Vice President of Operations at Arizona Nutritional Supplements, and as Global Vice President of Legacy and Specialty Businesses at IDEX Corporation from 2013 to 2015. Prior to joining IDEX Corporation, Mr. Harold worked for Exterran Holdings, Inc. as Senior Manufacturing Manager from 2010 to 2013. ITEM 1A - Risk Factors\nThe following are certain of the more significant risks that may affect the Companys business, financial condition and results of operations.\nRisks Related to Business and Industry\nChanging worldwide demand for food and biofuels could have an effect on the price of agricultural commodities and consequently the demand for irrigation equipment. Changing worldwide demand for farm outputs to meet the worlds growing food and biofuel demands, driven in part by government policies and an expanding global population, are likely to result in fluctuating agricultural commodity prices, which affect demand for irrigation equipment. The primary benefit of many of the Companys irrigation products is to increase yields and the resulting revenue for farmers. As commodity prices decline, the breakeven point of incremental production is more difficult to achieve, reducing or eliminating the profit and return on investment from the purchase of the Companys products. As a result, changes in commodity prices can significantly affect the Companys sales levels.\nA decline in oil prices or the overall demand for motor fuels, or changes in government policies regarding biofuels could also negatively affect the biofuels market and/or reduce government revenues of oil-producing countries that purchase or subsidize the purchase of irrigation equipment. Biofuels production is a significant source of grain demand in the U.S. and certain international markets. While ethanol blending levels are currently mandated within the U.S., potential mandate changes or price declines for ethanol could reduce the demand for grains. In addition, a number of ethanol producers in the U.S. are cooperatives partially owned by farmers. Reduced profit of ethanol production could reduce income for farmers which could, in turn, reduce the demand for irrigation equipment.\nWhile climate change could shift global cropping practices and open new markets for irrigated agriculture, the changing short-term weather conditions or more prolonged climate change could adversely impact the Companys business and operations. The Companys irrigation revenues are highly dependent on the agricultural industry and weather conditions. Weather conditions, particularly leading up to the planting and early growing season, can significantly affect the purchasing decisions of consumers of irrigation equipment. An increased frequency or duration of extreme weather conditions, or other factors which may be the result of climate change, could adversely impact the Company's business and operations. For example, natural calamities such as regional floods, hurricanes or other storms, and droughts can have significant effects on seasonal irrigation demand. Drought conditions, which generally affect irrigation equipment demand positively over the long term, can adversely affect demand if water sources become unavailable or if governments impose water restriction policies to reduce overall water availability.\nThe Companys irrigation revenues are cyclical and highly dependent upon the need for irrigated agricultural crop production which, in turn, depends upon many factors, including total worldwide crop production, the profitability of agricultural crop production, agricultural commodity prices, net farm income, availability of financing for farmers, governmental policies regarding the agricultural sector, water and energy conservation policies, the regularity of rainfall, and regional climate conditions. As farm income decreases, farmers may postpone capital expenditures or seek less expensive irrigation alternatives.\nThe extent of the effects of climate change, including any related compliance requirements, are uncertain but may adversely impact the Companys operations through the availability and cost of raw materials, increased compliance costs, and increased costs to safeguard the Companys facilities and assets from disruptions or damage.\nThe Companys infrastructure revenues are highly dependent on government funding of transportation projects and subject to compliance with government regulations. The demand for the Companys infrastructure products depends to a large degree on the amount of government spending authorized to improve road and highway systems. For example, the U.S. government funds highway and road improvements through the Federal Highway Trust Fund Program and matching funding from states may be required as a condition of federal funding. If highway funding is reduced or delayed, it may reduce demand for the Companys infrastructure products.\nIn order to be eligible for government funding or reimbursement, the Companys infrastructure products are generally required to meet certain standards as outlined by the various governments worldwide. The Federal Highway Administration (FHWA) and state departments of transportation have implemented Manual for Assessing Safety Hardware (MASH) standards which update and supersede National Cooperative Highway Research Program (NCHRP) Report 350 standards for evaluating new road safety hardware devices. While infrastructure products previously accepted under NCHRP Report 350 criteria are not required to be retested under MASH standards, they generally are no longer eligible for federal reimbursement as the MASH standards have been implemented by FHWA and the states. The Company has incurred, and will continue to incur, research and development and testing expense to develop products to comply with MASH standards. Any reevaluation of the Companys infrastructure products compliance with applicable standards, the implementation of new standards, and/or any delay in the Companys development of additional infrastructure products that comply with new standards could have a significant adverse effect on the Companys competitive position and on sales and profitability from its infrastructure product line.\nCompliance with applicable environmental and health and safety regulations, standards, or expectations may require additional capital and operational expenditures. The Company is subject to numerous laws and government regulations, including those which govern environmental and occupational health and safety matters. The Company believes that its operations are substantially in compliance with all such applicable laws and regulations and that it holds all necessary permits to operate its business in each jurisdiction in which its facilities are located. Laws and government regulations applicable to the Company are subject to change and interpretation. The Company publishes an annual Sustainability Report, which includes information about the Companys environmental, social, and governance (ESG) activities and may result in increased investor, media, and employee attention to such initiatives. Compliance with applicable laws and regulations and the pursuit of other ESG-related objectives may require the Company to make additional capital and operational expenditures that may have a material adverse effect on its earnings, liquidity, financial condition or competitive position. In particular, the Company may incur costs in connection with the remediation of environmental contamination at its Lindsay, Nebraska site that exceed the amounts that the Company has accrued for this purpose as of the end of fiscal 2023, as more fully described in Note 15, Commitments and Contingencies, to the Companys consolidated financial statements.\nThe Companys international sales efforts and profit margins are affected by international trade barriers and subject the Company to additional compliance obligations. The Companys international sales efforts and profit margins are affected by international trade barriers, including governmental policies on tariffs, taxes, import or export licensing requirements and trade sanctions. In recent years, certain of the components required for the manufacture of the Company's products have been or may be impacted by tariffs. Other international trade disputes, changes to or termination of existing international trade agreements, treaties or policies (e.g. the United States-Mexico-Canada Agreement), or imposition of trade protection measures by certain countries in favor of their local producers or competing products could increase our costs, reduce our competitiveness, and have an adverse effect on the Companys business, financial condition and results of operations.\nIn addition, the Companys international sales efforts must also comply with anti-corruption laws like the U.S. Foreign Corrupt Practices Act. These anti-corruption laws generally prohibit companies and their intermediaries (including, in the Companys case, dealers and sales representatives) from making improper payments or providing anything of value to improperly influence government officials or certain private individuals for the purpose of obtaining or retaining a business advantage. As part of the Companys irrigation and infrastructure sales efforts, the Company promotes and sells products to governmental entities and state-owned or state-backed business enterprises, the employees and representatives of which may be considered government officials for purposes of the U.S. Foreign Corrupt Practices Act. Further, some of the countries in which the Company does business lack fully developed legal systems and are perceived to have elevated levels of corruption. Although the Company has compliance and training programs in place designed to reduce the likelihood of potential violations of such laws, violations of these laws or other compliance requirements could occur and result in criminal or civil sanctions and have an adverse effect on the Companys reputation, business, financial condition and results of operations.\nRisks Related to Legal Proceedings\nThe Company is exposed to risks from legal proceedings. From time to time, the Company may be involved in various legal proceedings and other various claims that arise in the ordinary course of its business, which may include commercial, employment, product liability, tort, and other litigation. Current and future litigation, governmental proceedings and investigations, audits, indemnification claims or other claims that the Company faces may result in substantial costs and expenses and significantly divert the attention of its management regardless of the outcome. In addition, these matters could lead to increased costs or interruptions of its normal business operations. Litigation, governmental proceedings and investigations, audits, indemnification claims or other claims involve uncertainties and the eventual outcome of any such matter could adversely affect the Companys business, results of operations or cash flows. For a summary of the Companys infrastructure products litigation, see Note 15, Commitments and Contingencies, to the Companys consolidated financial statements.\nThe frequency and magnitude of liability claims and the related expenses could lower profitability and increase business risk. The nature of the Companys business subjects the Company to potential liability for claims alleging property damage and personal injury or death arising from the use of or exposure to its products, especially infrastructure products that are installed along roadways. While the Company believes it maintains adequate insurance, an unusually large liability claim or a string of claims could potentially exceed the Companys available insurance coverage. In addition, the availability of, and the Companys ability to collect on, insurance coverage can be subject to factors beyond the Companys control. For example, any accident, incident, or lawsuit involving the Company, its products specifically, or the industries in which the Company operates generally, even if the Company is fully insured, contractually indemnified, or not held to be liable, could significantly affect the cost and availability of insurance to the Company in the future.\nIf any of the Companys third-party insurers fail, cancel, or refuse coverage, or otherwise are unable to provide the Company with adequate insurance coverage, then the Companys overall risk exposure and operational expenses would increase and the management of the Companys business operations would be disrupted.\nFurther, as insurance policies expire, increased premiums for renewed or new coverage, if such coverage can be secured, may increase the Companys insurance expense and/or require that the Company increase its self-insured retention or deductibles. The Company maintains primary coverage and excess coverage policies. If the number of claims or the dollar amounts of any such claims rise in any policy year, the Company could suffer additional costs associated with accessing its excess coverage policies. Also, an increase in the loss amounts attributable to such claims could expose the Company to uninsured damages if the Company was unable or elected not to insure against certain claims because of increased premiums or other reasons.\nThe Companys infrastructure products are installed along roadways in inherently dangerous applications. Accidents involving the Companys infrastructure products could reduce demand for such products and expose the Company to significant damages and reputational harm. The Company is currently defending a number of product liability lawsuits involving the Companys X-Lite® end terminal. In June 2019, the Company was informed by letter that the Department of Justice, Civil Division, and U.S. Attorneys Office for the Northern District of New York, with the assistance of the Department of Transportation, Office of Inspector General, are conducting an investigation of the Company relating to the Companys X-Lite end terminal and potential violations of the federal civil False Claims Act. While the Companys infrastructure products are designed to meet all applicable standards in effect in the markets in which such products are offered, the risk of product liability claims, demands for reimbursement or compensatory payments, and associated adverse publicity is inherent in the development, manufacturing, marketing, and sale of such products, including end terminals and crash cushions that are ultimately installed along roadways. In addition to this inherent risk, a sizable False Claims Act judgment against a competitor (which was reversed on appeal) brought significant attention to the infrastructure products industry and may be a factor leading to additional lawsuits, demands, and investigations being pursued against the Company and others in the industry.\nAn actual or perceived issue with the Companys infrastructure products can lead to a decline in demand for such products, the removal of such products from qualified products lists used by government customers in their purchasing decisions, the removal and replacement of such products from roadways by government customers and demands for reimbursement or compensatory payments for such actions, adverse publicity, claims or litigation, and/or the diversion of managements attention, which could materially and adversely affect the Companys reputation, business, financial condition, and results of operations. While infrastructure product selection, assembly, installation, operation, repair, and maintenance are the responsibilities of dealers, distributors, customers, and/or state departments of transportation,\nthe Company may nevertheless also be subjected to claims, litigation, or demands for reimbursement or compensatory payments in connection with a third partys alleged failure to satisfactorily discharge such responsibilities, including but not limited to claims associated with personal injuries, property damage, and death. Likewise, improper assembly, installation, operation, repair, or maintenance of the Companys infrastructure products may cause such infrastructure products to fail to meet certain performance standards, which could lead to similar consequences as an actual or perceived issue with the infrastructure products themselves.\nAlthough the Company currently maintains insurance against product-related claims or litigation, the Company could be exposed to significant losses arising from claims involving infrastructure products if the Companys insurance does not cover all associated liabilities or if coverage in the future becomes unobtainable on commercially reasonable terms.\nGeneral Risks\nEpidemics, pandemics, and other outbreaks (including the coronavirus (COVID-19) pandemic) can disrupt the Companys operations and adversely affect its business, results of operations, and cash flows. Epidemics, pandemics, and other outbreaks of an illness, disease, or virus (including COVID-19) have adversely affected, and could adversely affect in the future, workforces, customers, economies, and financial markets globally, potentially leading to economic downturns. The significance of the impact on the Companys operations of an epidemic, pandemic, or other outbreak depends on numerous factors that the Company may not be able to accurately predict or effectively respond to, including, without limitation: the duration and scope of the outbreak (including the extent of surges, mutations, or strains of the outbreak and the efficacy of vaccination and other efforts to contain the outbreak or treat its effects); actions taken by governments, businesses, and individuals in response to the outbreak; the effect on economic activity and actions taken in response; the effect on customers and their demand for the Companys products and services; the effect on the health, wellness, and productivity of the Companys employees; and the Companys ability to manufacture, sell, and service its products, including without limitation as a result of supply chain challenges, facility closures, social distancing, restrictions on travel, fear or anxiety by the populace, and shelter-in-place orders. These and other factors relating to or arising from an epidemic, pandemic, or other outbreak could have a material adverse effect on the Companys business, results of operations, and cash flows, as well as the trading price of the Companys securities. Please also see the discussion on the Companys response to COVID-19 in Item 7 of Part II of this report, Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe Companys profitability may be negatively affected by changes in the availability and price of certain parts, components, and raw materials. The Company requires access to various parts, components, and raw materials at competitive prices in order to manufacture its products. Changes in the availability and price of these parts, components, and raw materials (including steel and zinc), which have changed significantly and rapidly at times and are affected by factors like demand, tariffs, freight costs, and outbreaks, can significantly increase the costs of production. Due to price competition in the market for irrigation equipment and certain infrastructure products, the Company may not be able to recoup increases in these costs through price increases for its products, which would result in reduced profitability. Whether increased operating costs can be passed through to the customer depends on a number of factors, including farm income and the price of competing products. Further, the Company relies on a limited number of suppliers for certain raw materials, parts and components in the manufacturing process. Disruptions or delays in supply or significant price increases from these suppliers could adversely affect the Companys operations and profitability. Such disruptions, terminations or cost increases could result in cost inefficiencies, delayed sales or reduced sales. The aforementioned risks have been, and may continue to be, exacerbated by the impact of COVID-19.\nThe Companys international sales are highly dependent on foreign market conditions. International revenues are primarily generated from Australia, New Zealand, Canada, Western and Eastern Europe, Mexico, the Middle East, Africa, China, and Central and South America. In addition to risks relating to general economic and potential instability in these countries, a number of countries are particularly susceptible to disruption from changing socioeconomic conditions as well as terrorism, sanctions, war, outbreaks, and similar incidents. During fiscal 2022, sales to Russia and Belarus were paused indefinitely due to the Russian invasion of Ukraine. Sales with Russian, Ukrainian, and Belarusian customers have historically represented less than 5% of consolidated revenues. Commercial activities in Russia and Belarus remain on hold while hostile actions against Ukraine continue. The collectability of international receivables can also be difficult to estimate, particularly in areas of political instability or with governments with which the Company has limited experience or where there is a lack of transparency as to the current credit condition.\nThe Companys international sales and profit margins are subject to currency exchange risk. The Companys international sales involve some level of export from the U.S., either of components or completed products. Policies and geopolitical events affecting exchange rates could adversely affect the international flow of agricultural and other commodities, which can cause a corresponding downturn in the demand for agricultural equipment in many areas of the world. Further, any strengthening of the U.S. dollar or any other currency of a country in which the Company manufactures its products (e.g. the Euro, the Brazilian real, the South African rand, the Turkish lira, and the Chinese renminbi) and/or any weakening of local currencies can increase the cost of the Companys products in its foreign markets. Irrespective of any effect on the overall demand for agricultural equipment, the effect of these changes can make the Companys products less competitive relative to local producing competitors and, in extreme cases, can result in the Companys products not being cost-effective for customers. As a result, the Companys international sales and profit margins could decline.\nChanges in interest rates could reduce demand for the Companys products. Rising interest rates could have a dampening effect on overall economic activity and/or the financial condition of the Companys customers, either or both of which could negatively affect customer demand for the Companys products and customers ability to repay obligations to the Company. An increase in interest rates could also make it more difficult for customers to cost-effectively fund the purchase of new equipment, which could adversely affect the Companys sales.\nThe Companys consolidated financial results are reported in U.S. dollars while certain assets and other reported items are denominated in the currencies of other countries, creating currency translation risk. The reporting currency for the Companys consolidated financial statements is the U.S. dollar. Certain of the Companys assets, liabilities, expenses and revenues are denominated in other countries currencies. Those assets, liabilities, expenses and revenues are translated into U.S. dollars at the applicable exchange rates to prepare the Companys consolidated financial statements. Therefore, increases or decreases in exchange rates between the U.S. dollar and those other currencies affect the value of those items as reflected in the Companys consolidated financial statements. Substantial fluctuations in the value of the U.S. dollar compared to other currencies could have a significant effect on the Companys results.\nSecurity breaches and other disruptions to the Companys information technology infrastructure could interfere with its operations and could compromise the Companys and its customers and suppliers information, exposing the Company to liability that could cause its business and reputation to suffer. In the ordinary course of business, the Company relies upon information technology networks and systems to process, transmit and store electronic information, and to manage or support a variety of business functions, including supply chain, manufacturing, distribution, invoicing and collection of payments. The Company uses information technology systems to record, process and summarize financial information and results of operations for internal reporting purposes and to comply with regulatory financial reporting, legal and tax requirements. Additionally, the Company collects and stores sensitive data, including intellectual property, proprietary business information and the proprietary business information of customers and suppliers, as well as personally identifiable information of customers and employees, in data centers and on information technology networks. The secure operation of these networks and the processing and maintenance of this information is critical to the Companys business operations and strategy. Despite security measures and business continuity plans, the Companys information technology networks and infrastructure may be vulnerable to damage, disruptions or shutdowns due to, among other reasons, attacks by hackers or breaches due to employee error or malfeasance or other disruptions during the process of upgrading or replacing computer software or hardware, power outages, computer viruses, telecommunication or utility failures or natural disasters or other catastrophic events. The occurrence of any of these events could compromise the Companys networks, and the information stored there could be accessed, publicly disclosed, lost or stolen. Any such access, disclosure or other loss of information could result in legal claims or proceedings, liability or regulatory penalties under laws protecting the privacy of personal information, disrupt operations, and damage the Companys reputation, which could adversely affect the Companys business. ITEM 1B - Unresolved Staff Comments\nNone. ITEM 2 - Properties\nThe Companys facilities are well-maintained, in good operating condition, and suitable for present purposes. These facilities, together with both short-term and long-term planned capital expenditures, are expected to meet the Companys manufacturing needs in the foreseeable future. The Company does not anticipate any difficulty in retaining occupancy of any leased facilities, either by renewing leases prior to expiration or by replacing them with equivalent leased facilities. The following are the Companys significant properties.\nSegment\nGeographic location\nOwn/\nlease\nLease\nexpiration\nSquare\nfeet\nProperty description\nCorporate\nOmaha, Nebraska\nLease\n55,000\nCorporate headquarters\nIrrigation\nLindsay, Nebraska\nOwn\nN/A\n300,000\nPrincipal U.S. manufacturing plant consists of eight separate buildings located on 122 acres\nIrrigation\nCorlu, Türkiye\nOwn\nN/A\n283,000\nManufacturing plant for irrigation products\nIrrigation\nTianjin, China\nLease\n163,000\nManufacturing plant for irrigation products\nIrrigation\nLa Chapelle, France\nOwn\nN/A\n72,000\nManufacturing plant for irrigation products\nIrrigation\nBellville, South Africa\nLease\n71,000\nManufacturing plant for irrigation products\nIrrigation\nMogi Mirim, Sao Paulo, Brazil\nOwn\nN/A\n67,000\nManufacturing plant for irrigation products\nIrrigation\nOlathe, Kansas\nOwn\nN/A\n60,000\nManufacturing plant for machine-to-machine products\nIrrigation\nNorfolk, Nebraska\nOwn\nN/A\n13,400\nManufacturing plant for on-farm telemetry devices\nInfrastructure\nMilan, Italy\nOwn\nN/A\n45,000\nManufacturing plant for infrastructure products\nInfrastructure\nRio Vista, California\nOwn\nN/A\n30,000\nManufacturing plant for infrastructure products ITEM 3 - Legal Proceedings\nIn the ordinary course of its business operations, the Company is involved, from time to time, in commercial litigation, product liability litigation, tort litigation, employment disputes, administrative proceedings, business disputes, and other legal proceedings. No such current proceedings, individually or in the aggregate, are expected to have a material effect on the business or financial condition of the Company, other than the specific environmental remediation matters which are disclosed as part of Note 15, Commitments and Contingencies, to the Companys consolidated financial statements. Any revisions to the estimates accrued for environmental remediation could be material to the operating results of any fiscal quarter or fiscal year, however the Company does not expect such additional expenses would have a material adverse effect on its liquidity or financial condition.\nFor a summary of the Companys infrastructure products litigation, see Note 15, Commitments and Contingencies, to the Companys consolidated financial statements. ITEM 4 - Mine Safety Disclosures\nNot applicable.\nPART II ITEM 5 - Market for the Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nHolders\nLindsay Common Stock trades on the New York Stock Exchange, Inc. (NYSE) under the ticker symbol LNN. As of October 16, 2023, there were approximately 139 stockholders of record.\nPurchases of Equity Securities by the Issuer and Affiliated Purchases\nThe Companys Board of Directors authorized a share repurchase program of up to $250.0 million of common stock with no expiration date. Under the program, shares may be repurchased in privately negotiated and/or open market transactions as well as under formalized trading plans in accordance with the guidelines specified under Rule 10b5-1 of the Securities Exchange Act of 1934, as amended. There were no shares repurchased during the twelve months ended August 31, 2023, 2022, and 2021. The remaining amount available under the repurchase program was $63.7 million as of August 31, 2023.\nDividends\nThe Company paid a total of $15.1 million and $14.6 million in dividends during fiscal 2023 and 2022, respectively. The Company currently expects that cash dividends comparable to those paid historically will continue to be paid in the future, although there can be no assurance as to the payment of future dividends as such payment depends on results of operations, financial condition, business prospects, capital requirements, contractual restrictions, any potential indebtedness the Company may incur, restrictions imposed by applicable law, tax considerations, and other factors that the Board of Directors deems relevant.\nCompany Stock Performance\nThe following graph compares the cumulative five-year total return attained by stockholders on the Companys Common Stock relative to the cumulative total returns of the S&P SmallCap 600 Index and the S&P SmallCap 600 Construction, Farm Machinery and Heavy Truck Index for the five-year period ended August 31, 2023. An investment of $100 (with the reinvestment of all dividends) is assumed to have been made in the Companys Common Stock and in each of the indexes on August 31, 2018 and the graph shows its relative performance through August 31, 2023.\n8/18\n8/19\n8/20\n8/21\n8/22\n8/23\nLindsay Corporation\n100.00\n93.47\n107.22\n178.30\n175.17\n136.92\nS&P SmallCap 600 Index\n100.00\n84.94\n84.48\n130.07\n114.30\n120.62\nS&P 600 Construction Machinery & Heavy Trucks\n100.00\n78.70\n89.11\n113.56\n109.30\n149.76\nThe stock price performance included in this graph is not necessarily indicative of future stock price performance. ITEM 6 - [Reserved] ITEM 7 - Managements Discussion and Analysis of Financial Condition and Results of Operations\nConcerning Forward-Looking Statements\nThis Annual Report on Form 10-K, including Managements Discussion and Analysis of Financial Condition and Results of Operations, contains not only historical information, but also forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Statements that are not historical are forward-looking and reflect expectations for future Company performance. In addition, forward-looking statements may be made orally or in press releases, conferences, reports, on the Companys web site, or otherwise, in the future by or on behalf of the Company. When used by or on behalf of the Company, the words expect, anticipate, estimate, believe, intend, will, plan, predict, project, outlook, could, may, should, and similar expressions generally identify forward-looking statements. For these statements throughout the Annual Report on Form 10-K, the Company claims the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The entire sections entitled Financial Overview and Outlook and Risk Factors should be considered forward-looking statements.\nForward-looking statements involve a number of risks and uncertainties, including but not limited to those discussed in the Risk Factors section contained in Item 1A. Readers should not place undue reliance on any forward-looking statement and should recognize that the statements are predictions of future results or conditions, which may not occur as anticipated. Actual results or conditions could differ materially from those anticipated in the forward-looking statements and from historical results, due to the risks and uncertainties described herein, as well as others not now anticipated. The risks and uncertainties described herein are not exclusive and further information concerning the Company and its businesses, including factors that potentially could materially affect the Companys financial results, may emerge from time to time. Except as required by law, the Company assumes no obligation to update forward-looking statements to reflect actual results or changes in factors or assumptions affecting such forward-looking statements.\nCompany Overview\nThe Company manufactures and markets center pivot, lateral move, and hose reel irrigation systems. The Company also produces and markets irrigation controls, chemical injection systems, remote monitoring and irrigation scheduling systems. These products are used by farmers to increase or stabilize crop production while conserving water, energy, and labor. Through its acquisitions and third-party commercial arrangements, the Company has been able to enhance its capabilities in providing innovative, turn-key solutions to customers through the integration of designs, controls, and pump stations. The Company sells its irrigation products primarily to a world-wide independent dealer network, who resell to their customers, the farmers. The Companys irrigation production facilities are located in the United States, Brazil, Türkiye (formerly Turkey), France, China and South Africa, and also has distribution and sales operations in the Netherlands, Egypt, Australia, and New Zealand. The Company also manufactures and markets, through distributors and direct sales to customers, various infrastructure products, including moveable barrier systems for traffic lane management, crash cushions, preformed reflective pavement tapes, and other road safety devices, through its production facilities in the United States and Italy, and has produced road safety products in irrigation manufacturing facilities in China, Brazil and Türkiye (formerly Turkey). In addition, the Companys infrastructure segment produces railroad signals and structures.\nFor the business overall, the global, long-term drivers of population growth, water conservation and environmental sustainability, the need for increased food production, and the need for safer, more efficient transportation solutions remain positive. Key factors which impact demand for the Companys irrigation products include total worldwide agricultural crop production, the profitability of agricultural crop production, agricultural commodity prices, net farm income, availability of financing for farmers, governmental policies regarding the agricultural sector, water and energy conservation policies, the regularity of rainfall, regional climate conditions, food security concerns and foreign currency exchange rates. A key factor which impacts demand for the Companys infrastructure products is the amount of spending authorized by governments to improve road and highway systems. Much of the U.S. highway infrastructure market is driven by government spending programs. For example, the U.S. government funds highway and road improvements through the Federal Highway Trust Fund Program. This program provides funding to improve the nations roadway system. In November 2021, the Infrastructure Investment and Jobs Act was enacted and included a five-year reauthorization of the Fixing America's Surface Transportation (FAST) Act. This legislation also introduced $110 billion in incremental federal funding planned for roads, bridges, and other transportation projects, which the Company anticipates may translate into higher demand for its transportation safety products.\nThe Company continues to have an ongoing, structured, acquisition process that it expects to generate additional growth opportunities throughout the world and add to its irrigation and infrastructure capabilities. The Company is committed to achieving earnings growth by global market expansion, improvements in margins, and strategic acquisitions.\nNew Accounting Standards Issued\nSee Note 2, New Accounting Pronouncements, to the Companys consolidated financial statements for information regarding recently issued accounting pronouncements.\nCritical Accounting Estimates\nIn preparing the consolidated financial statements in conformity with U.S. generally accepted accounting principles (GAAP), management must make a variety of decisions which impact the reported amounts and the related disclosures. Such decisions include the selection of the appropriate accounting principles to be applied and the assumptions on which to base accounting estimates. In reaching such decisions, management applies judgment based on its understanding and analysis of the relevant facts and circumstances. Certain of the Companys accounting policies are critical, as these policies are most important to the presentation of the Companys consolidated results of operations and financial condition. They require the greatest use of judgments and estimates by management based on the Companys historical experience and managements knowledge and understanding of current facts and circumstances. Management periodically re-evaluates and adjusts the estimates that are used as circumstances change. Following is the accounting policy management considers critical to the Companys consolidated results of operations and financial condition:\nWarranties\nThe Companys accounting policy on accounting for its product warranties is critical because it includes significant judgments and estimates by management about the amount, nature, and timing of future product-related warranty costs.\nThe Company generally warrants its products against certain manufacturing and other defects. These product warranties are provided for specific periods and/or usage of the product. At the time a sale is recognized, the Company records the estimated future warranty costs. The Company generally determines its total future warranty liability by applying historical claims rate experience to the amount of equipment that has been sold and is still within the warranty period. In addition, the Company records provisions for known warranty claims.\nThe Company periodically reviews the assumptions used to determine the liabilities for product warranties and adjusts its assumptions based upon factors such as actual failure rates and cost experience. A number of factors could affect actual failure rates and cost experience, including the amount and timing of new product introductions, changes in manufacturing techniques or locations, components or suppliers used. If actual costs differ from the estimates, an adjustment may be made to the product warranty liability.\nFinancial Overview and Outlook\nOperating revenues in fiscal 2023 were $674.1 million, a 13 percent decrease compared to $770.7 million in the prior year. Irrigation segment revenues decreased 12 percent to $586.0 million and infrastructure segment revenues decreased 16 percent to $88.1 million. Net earnings for fiscal 2023 increased 11 percent to $72.4 million or $6.54 per diluted share compared with $65.5 million or $5.94 per diluted share in the prior year. Despite lower revenues, improved net earnings resulted from gross margin improvement primarily from improved price realization, lower inflationary impact on input costs and a more favorable margin mix of international revenues.\nThe global drivers for the Companys irrigation segment are population growth and the attendant need for expanded food production and efficient water use. The need for irrigated agricultural crop production, which depends upon many factors, include the following primary drivers:\nAgricultural commodity prices - During fiscal 2023, agricultural commodity prices remained volatile as they continued to be impacted by weather conditions in various regions of the world, China's fluctuating demand for U.S. exports, and the continued conflict between Ukraine and Russia. Corn prices in August 2023 were approximately 32 percent lower and soybean prices approximately 9 percent lower compared to August 2022.\nNet farm income - As of August 2023, the U.S. Department of Agriculture (the USDA) estimated U.S. 2023 net farm income to be $141.3 billion, a decrease of 22.8 percent from the USDAs final U.S. 2022 net farm income of $183.0 billion. The majority of this projected decrease is coming from a reduction in\ngovernment support payments while cash receipts for crops is projected to decrease by 4 percent. Following record net farm income in 2022, projected net farm income in 2023 remains at a relatively high level historically.\nWeather conditions - Demand for irrigation equipment is often positively affected by storm damage and prolonged periods of drought conditions as producers look for ways to reduce the risk of low crop production and crop failures. Conversely, demand for irrigation equipment can be negatively affected during periods of more predictable or abundant natural precipitation.\nGovernmental policies - A number of government laws and regulations can impact the Companys business, including:\noThe Agricultural Improvement Act of 2018 (the Farm Bill) was signed into law in December 2018 and provides a degree of certainty to growers, including funding for the Environmental Quality Incentives Program, which provides financial assistance to farmers to implement conservation practices, and is frequently used to assist in the purchase of center pivot irrigation systems. The Farm Bill will expire by the end of calendar 2023, when it is expected to be either extended or replaced by new legislation. However, there can be no assurance that the Farm Bill will be extended or renewed or that any such legislation will provide subsidies at the same levels as are currently provided under the Farm Bill.\noChanges to U.S. income tax laws enacted in December 2017 increased the benefit of certain tax incentives, such as the Section 179 income tax deduction and Section 168 bonus depreciation, which are intended to encourage equipment purchases by initially allowing 100 percent of the cost of equipment to be treated as an expense in the year of purchase rather than having it amortized over its useful life. This benefit is being phased out by 20 percent per year over a five-year period, beginning in 2023. For calendar 2023, the allowable deduction is 80 percent of the cost of equipment.\noBiofuel production continues to be a major demand driver for irrigated corn, sugar cane and soybeans as these crops are used in high volumes to produce ethanol and biodiesel. On June 21, 2023, the Environmental Protection Agency (\"EPA\") announced a final rule setting biofuel volume requirements for the Renewable Fuels Standard (RFS) program for 2023, 2024 and 2025. The final volume requirements reflect an increase in total gallons of renewable fuels in each successive year.\noMany international markets are affected by government policies such as subsidies and other agriculturally related incentives. While these policies can have a significant effect on individual markets, they typically do not have a material effect on the consolidated results of the Company.\nCurrency -The value of the U.S. dollar fluctuates in relation to the value of currencies in a number of countries to which the Company exports products and maintains local operations. The strengthening of the dollar increases the cost in the local currency of the products exported from the U.S. into these countries and, therefore, could negatively affect the Companys international sales and margins. In addition, the U.S. dollar value of sales made in any affected foreign currencies will decline as the value of the dollar rises in relation to these other currencies.\nDemand for irrigation equipment in the U.S. has declined over the prior year, as farmer sentiment has been negatively impacted by the projected decrease in net farm income, higher interest rates and concerns regarding inflation and general economic uncertainty. This has resulted in customers delaying capital investment decisions. The Company believes this may shift demand for irrigation equipment to later in the calendar year as customers become better-positioned to determine their level of profitability for the current crop year. During this period the Company has been able to maintain its pricing while inflationary pressure on raw material and logistics costs have moderated. The Company expects to continue to actively track these circumstances and will monitor its prices in connection with changes in raw material and other costs.\nThe most significant opportunities for growth in irrigation sales over the next several years continue to be in international markets where irrigation use is less developed and demand is driven not only by commodity prices and farm income, but also by food security, water scarcity and population growth. While international irrigation markets remain active with opportunities for further development and expansion, regional political and economic factors,\nincluding armed conflict, currency conditions and other factors can create a challenging environment. The Company continues to monitor the Ukraine and Russia conflict for both short and long-term implications and has suspended new business activity in Russia and Belarus since February 2022. Sales with Russian, Ukrainian, and Belarusian customers have historically represented less than 5% of consolidated revenues. Additionally, international results are heavily dependent upon project sales which tend to fluctuate and can be difficult to forecast accurately.\nThe infrastructure business continues to be driven by the Company's transportation safety products, the demand for which largely depends on government spending for road construction and improvements. The enactment of the Infrastructure Investment and Jobs Act in November 2021 marked the largest infusion of federal investment into infrastructure projects in more than a decade. This legislation introduced $110 billion in incremental federal funding, planned for roads, bridges, and other transportation projects, which the Company anticipates may translate into higher demand for its transportation safety products as funds are appropriated and states begin to implement projects. A limited positive impact was experienced in fiscal 2023 results and a more positive impact is expected in fiscal 2024 and beyond.\nAs of August 31, 2023, the Company had an order backlog of $78.7 million compared with $96.8 million at August 31, 2022. The irrigation and infrastructure backlogs are lower compared to the prior year. The Companys backlog can fluctuate from period to period due to the seasonality, cyclicality, timing, and execution of contracts. Backlog typically represents long-term projects as well as short lead-time orders; therefore, it is generally not a good indication of the revenues to be realized in succeeding quarters.\nResults of Operations\nThe following Fiscal 2023 Compared to Fiscal 2022 section presents an analysis of the Companys consolidated operating results displayed in the Consolidated Statements of Earnings and should be read together with the information in Note 18, Industry Segment Information, to the consolidated financial statements. A discussion regarding our financial condition and results of operations for fiscal 2022 compared to fiscal 2021 can be found in Managements Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of Part II of our Annual Report on Form 10-K for the fiscal year ended August 31, 2022, filed with the Securities and Exchange Commission (SEC) on October 20, 2022, which is available free of charge on the SECs website at www.sec.gov and the Companys website at www.lindsay.com under the tab Investor Relations - SEC Filings.\nFiscal 2023 Compared to Fiscal 2022\nThe following table provides highlights for fiscal 2023 compared with fiscal 2022:\nFor the years ended\nPercent\nAugust 31,\nincrease\n($ in thousands)\n(decrease)\nConsolidated\nOperating revenues\n$\n674,084\n$\n770,743\n(13%)\nCost of operating revenues\n$\n461,069\n$\n571,565\n(19%)\nGross profit\n$\n213,015\n$\n199,178\n7%\nGross margin\n31.6\n%\n25.8\n%\nOperating expenses (1)\n$\n110,831\n$\n104,535\n6%\nOperating income\n$\n102,184\n$\n94,643\n8%\nOperating margin\n15.2\n%\n12.3\n%\nOther expense\n$\n(1,809\n)\n$\n(6,775\n)\n(73%)\nIncome tax expense\n$\n27,996\n$\n22,399\n25%\nEffective income tax rate\n27.9\n%\n25.5\n%\nNet earnings\n$\n72,379\n$\n65,469\n11%\nIrrigation segment (2)\nOperating revenues\n$\n586,031\n$\n665,829\n(12%)\nOperating income\n$\n121,969\n$\n105,763\n15%\nOperating margin\n20.8\n%\n15.9\n%\nInfrastructure segment (2)\nOperating revenues\n$\n88,053\n$\n104,914\n(16%)\nOperating income\n$\n12,067\n$\n18,328\n(34%)\nOperating margin\n13.7\n%\n17.5\n%\n(1)Includes corporate general and administrative expenses of $31.8 million and $29.4 million for fiscal 2023 and 2022, respectively.\n(2)See Note 18 Industry Segment Information, to the consolidated financial statements, for further details regarding segments.\nRevenues\nOperating revenues in fiscal 2023 were $674.1 million, a decrease of 13 percent or $96.7 million, compared to $770.7 million in fiscal 2022. Irrigation segment revenues of $586.0 million, increased $79.8 million, or 12 percent, and infrastructure revenues increased $16.9 million, or 16 percent, compared to the prior fiscal year. The irrigation segment provided 87 percent of Company revenue in fiscal 2023 as compared to 86 percent in fiscal 2022.\nNorth America irrigation revenues in fiscal 2023 were $309.5 million a decrease of 13 percent or $46.1 million, from $355.7 million in fiscal 2022. The decrease resulted from lower unit sales volume which was partially offset by higher average selling prices compared to the prior year. Lower unit sales volume in the current year resulted primarily from farmers delaying capital investment decisions due to a number of factors, including a projected decrease in net farm income, higher interest rates and concerns regarding inflation, and general economic uncertainty, as well as a higher level of storm damage replacement demand in the prior year. Higher average selling prices compared to the prior year resulted from the pass through of higher raw material and other costs to customers.\nInternational irrigation revenues in fiscal 2023 were $276.5 million, a decrease of 11 percent or $33.7 million, from $310.1 million in fiscal 2022. The decrease resulted primarily from the completion of a large Egypt project in the prior year that did not repeat and from lower sales in Ukraine, Russia and Australia. This decrease was partially offset by higher sales in South America. The current year was also impacted by the unfavorable effects of foreign currency translation of approximately $3.9 million compared to the prior fiscal year.\nInfrastructure segment revenues in fiscal 2023 were $88.1 million a decrease of $16.9 million, or 16 percent, from $104.9 million in fiscal 2022. The decrease resulted primarily from lower Road Zipper System sales compared to the prior year as there were a number of projects in the prior year that did not repeat. This decrease was partially offset by an increase in Road Zipper System lease revenue and higher sales of road safety products compared to the prior year.\nGross Profit\nGross profit was $213.0 million for fiscal 2023, an increase of $13.8 million, or 7 percent, compared to $199.2 million in fiscal 2022. Gross margin was 31.6 percent of sales for fiscal 2023 compared to 25.8 percent of sales for fiscal 2022. Increased gross profit and gross margin in irrigation resulted primarily from improved price realization, lower inflationary impact on input costs and a more favorable margin mix of international revenues, which more than offset the impact of lower revenues compared to the prior year. Prior year irrigation gross margin was negatively impacted by higher raw material costs, which included approximately $7.8 million in additional expense resulting from the effect of the LIFO method of accounting for certain inventory, compared to a reduction of expense of approximately $2.0 million due to the use of LIFO in fiscal 2023. In addition, costs of approximately $1.8 million were incurred in the prior year related to non-recurring factory maintenance and outside consulting services that did not repeat. Decreased gross profit and gross margin in infrastructure resulted primarily from lower Road Zipper System sales compared to the prior year. This decrease was partially offset by improved price realization and lower inflationary impact on input costs compared to the prior year.\nOperating Expenses\nThe Companys operating expenses of $110.8 million for fiscal 2023 increased $6.3 million, or 6 percent, compared to fiscal 2022 operating expenses of $104.5 million. The increase resulted primarily from higher employee incentive expense attributable to improved business results, increased spending on new product development and increased personnel costs compared to the prior year.\nOther Expense, net\nOther expense of $1.8 million for fiscal 2023 decreased $5.0 million compared to $6.8 million in fiscal 2022. The decrease resulted from lower interest expense, higher interest income and a more favorable impact from foreign currency transaction changes compared to the prior year.\nIncome Taxes\nThe Company recorded income tax expense of $28.0 million and $22.4 million for fiscal 2023 and 2022, respectively. The effective tax rate was 27.9 percent and 25.5 percent for fiscal 2023 and 2022, respectively. The higher effective income tax rate in fiscal 2023 reflects an increased proportion of earnings in higher rate foreign jurisdictions, primarily Brazil, compared to the prior year.\nNet Earnings\nNet earnings for fiscal 2023 were $72.4 million, or $6.54 per diluted share, compared to $65.5 million, or $5.94 per diluted share, for fiscal 2022.\nLiquidity and Capital Resources\nThe Companys cash, cash equivalents, and marketable securities totaled $166.3 million at August 31, 2023 compared with $116.5 million at August 31, 2022. The increase resulted primarily from an increase in net earnings and a reduction in inventories, along with other changes in working capital. The Company requires cash for financing its receivables and inventories, paying operating expenses and capital expenditures, and for dividends and share repurchases. The Companys investments in marketable securities are primarily composed of United States government securities and investment grade corporate bonds. The Company meets its liquidity needs and finances its capital expenditures from its available cash and funds provided by operations along with borrowings under the credit arrangements that are described below. In the normal course of business, the Company enters into contracts and commitments which obligate the Company to make future payments. The Company does not have any additional off-balance sheet arrangements that have or are reasonably likely to have a material current or future effect on the Companys financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources. The Company believes its current cash resources, investments in marketable securities, projected operating cash flow, and remaining capacity under its continuing bank lines of credit are sufficient to cover all of its expected working capital needs, planned capital expenditures and dividends. The Company may require additional borrowings to fund potential acquisitions in the future.\nThe Companys total cash and cash equivalents held by foreign subsidiaries amounted to $64.6 million and $49.0 million as of August 31, 2023, and 2022, respectively. The Company considers earnings of foreign subsidiaries to be indefinitely reinvested, and would need to accrue and pay incremental state, local, and foreign taxes if such earnings were repatriated to the United States. The Company does not intend to repatriate the funds and does not expect these funds to have a significant impact on the Companys overall liquidity.\nNet working capital was $351.4 million at August 31, 2023 as compared with $316.2 million at August 31, 2022. Cash flows provided by operating activities totaled $119.7 million during the year ended August 31, 2023 compared to $3.0 million provided by operating activities during the prior fiscal year. An increase in cash flows provided by operating activities resulted from an increase in net earnings compared to the prior year, a reduction in inventories compared to an increase in the prior year, and other changes in assets and liabilities compared to the prior year.\nCash flows used in investing activities totaled $47.4 million during the year ended August 31, 2023 compared to $9.0 million during the prior fiscal year. The majority of the increase resulted from $30.8 million for the acquisition of a business in fiscal 2023. Capital spending was $18.8 million in fiscal 2023 compared to $15.6 million in fiscal 2022.\nCash flows used in financing activities totaled $17.3 million during the year ended August 31, 2023 compared to $12.7 million during the prior fiscal year. The change was primarily the result of lower proceeds from the exercise of stock options compared to the prior year. Cash flows used in financing activities consists primarily of dividend payments. Dividends paid in fiscal 2023 increased by $0.5 million over fiscal 2022.\nCapital Allocation Plan\nThe Companys capital allocation plan is to continue investing in revenue and earnings growth, combined with a defined process for enhancing returns to stockholders. Priorities for the use of cash under the Companys capital allocation plan include:\nInvestment in organic growth including capital expenditures and expansion of international markets,\nSynergistic acquisitions that provide attractive returns to stockholders,\nDividends to stockholders, along with expectations to increase dividends over time, and\nOpportunistic share repurchases taking into account cyclical and seasonal fluctuations.\nCapital Expenditures\nCapital expenditures for fiscal 2024 are expected to be between $35.0 million and $40.0 million, including equipment replacement, productivity improvements, new product development and commercial growth investments. An increase over recent levels of capital expenditures relates to modernization and productivity improvements planned at certain\nmanufacturing facilities. The Companys management does maintain flexibility to modify the amount and timing of some of the planned expenditures in response to economic conditions.\nDividends\nIn fiscal 2023, the Company paid cash dividends of $1.37 per common share or $15.1 million to stockholders as compared to $1.33 per common share or $14.6 million to stockholders in fiscal 2022.\nShare Repurchases\nThe Companys Board of Directors authorized a share repurchase program of up to $250.0 million of common stock with no expiration date. Under the program, shares may be repurchased in privately negotiated and/or open market transactions as well as under formalized trading plans in accordance with the guidelines specified under Rule 10b5-1 of the Securities Exchange Act of 1934, as amended. There were no shares repurchased during the years ended August 31, 2023, 2022 and 2021. The remaining amount available under the repurchase program was $63.7 million as of August 31, 2023.\nLong-Term Borrowing Facilities\nSenior Notes. The Company has outstanding $115.0 million in aggregate principal amount of unsecured Senior Notes, Series A (the Senior Notes). The entire principal of the Senior Notes is due and payable on February 19, 2030. Interest on the Senior Notes is payable semi-annually at a fixed annual rate of 3.82 percent. Borrowings under the Senior Notes are unsecured. The Company used the proceeds of the sale of the Senior Notes for general corporate purposes, including acquisitions and dividends.\nRevolving Credit Facility. The Company has outstanding a $50.0 million unsecured Amended and Restated Revolving Credit Facility (the Revolving Credit Facility) with Wells Fargo Bank, National Association (Wells Fargo) expiring August 26, 2026. The Company intends to use borrowings under the Revolving Credit Facility for working capital purposes and to fund future acquisitions. At August 31, 2023 and 2022, the Company had no outstanding borrowings under the Revolving Credit Facility. The amount of borrowings available at any time under the Revolving Credit Facility is reduced by the amount of standby letters of credit issued by Wells Fargo then outstanding. At August 31, 2023, the Company had the ability to borrow up to $50.0 million under the Revolving Credit Facility. The Revolving Credit Facility may be increased by up to an additional $50.0 million at any time, subject to additional commitment approval. The Revolving Credit Facility was amended to transition the benchmark rate from the London Interbank Offered Rate (LIBOR) to the Secured Overnight Financing Rate (SOFR). Borrowings under the Revolving Credit Facility bear interest at a variable rate equal to the SOFR plus a margin of between 100 and 210 basis points depending on the Companys leverage ratio then in effect (which resulted in a variable rate of 6.66 percent at August 31, 2023), subject to adjustment as set forth in the loan documents for the Revolving Credit Facility. Interest is paid on a monthly to quarterly basis depending on loan type. The Company currently pays an annual commitment fee on the unused portion of the Revolving Credit Facility. The fee is between 0.125 percent and 0.2 percent (0.125 percent at August 31, 2023) on the unused balance depending on the Companys leverage ratio then in effect.\nBorrowings under the Revolving Credit Facility have equal priority with borrowings under the Companys Senior Notes. Each of the credit arrangements described above include certain covenants relating primarily to the Companys financial condition. These financial covenants include a funded debt to EBITDA leverage ratio and an interest coverage ratio. In the event that the loan documents for the Revolving Credit Facility were to require the Company to comply with any financial covenant that is not already included or is more restrictive than what is already included in the arrangement governing the Senior Notes, then such covenant shall be deemed incorporated by reference into the Senior Notes for the benefit of the holders of the Senior Notes. Upon the occurrence of any event of default of these covenants, including a change in control of the Company, all amounts outstanding thereunder may be declared to be immediately due and payable. At August 31, 2023 and 2022, the Company was in compliance with all financial loan covenants contained in its credit arrangements in place as of each of those dates.\nInflation\nThe Company is subject to the effects of changing prices. During fiscal 2022, the Company experienced pricing volatility for purchases of certain commodities, in particular steel and zinc products used in the production of its products, in addition to the availability of labor and logistics. In fiscal 2023, the Company observed steel input cost stabilization and while the overall cost outlook for commodities used in the production of the Company's products is not certain, management believes it can manage these inflationary pressures by introducing appropriate sales price adjustments. However, competitive market pressures may affect the Companys ability to pass price adjustments along to its customers. ITEM 7A - Quantitative and Qualitative Disclosures about Market Risk\nThe Company uses certain financial derivatives to mitigate its exposure to volatility in interest rates and foreign currency exchange rates. The Company uses these derivative instruments to hedge exposures in the ordinary course of business and does not invest in derivative instruments for speculative purposes. The credit risk under these interest rate and foreign currency agreements is not considered to be significant. The Company attempts to manage market and credit risks associated with its derivative instruments by establishing and monitoring limits as to the types and degree of risk that may be undertaken, and by entering into transactions with counterparties that have investment grade credit ratings. As of August 31, 2023, the Companys derivative counterparty had an investment grade credit rating.\nThe Company has manufacturing operations in the United States, Brazil, France, Italy, China, Türkiye (formerly Turkey), and South Africa. The Company has sold products throughout the world and purchases certain of its components from third-party international suppliers. Export sales made from the United States are principally U.S. dollar denominated. At times, export sales may be denominated in a currency other than the U.S. dollar. A majority of the Companys revenue generated from operations outside the United States is denominated in local currency. Accordingly, these sales are not typically subject to significant foreign currency transaction risk. The Companys most significant transactional foreign currency exposures are the Euro, the Brazilian real, the South African rand, the Turkish lira, and the Chinese renminbi in relation to the U.S. dollar. Fluctuations in the value of foreign currencies create exposures, which can adversely affect the Companys results of operations. Based on the consolidated statement of earnings for the year ended August 31, 2023, the Company estimates the potential decrease in operating income from a ten percent adverse change in the underlying exchange rates, in U.S. dollar terms, would be approximately $5.8 million.\nIn order to reduce exposures related to changes in foreign currency exchange rates, the Company, at times, may enter into forward exchanges, option contracts, or cross currency swaps for transactions denominated in a currency other than the functional currency for certain of its operations. This activity primarily relates to economically hedging against foreign currency risk in purchasing inventory, sales of finished goods, intercompany transactions and future settlement of foreign denominated assets and liabilities. At August 31, 2023, the Company had an outstanding foreign currency forward contract to sell a notional amount of 225.3 million South African rand at fixed prices to settle during the next fiscal quarter. ITEM 8 - Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nLindsay Corporation:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Lindsay Corporation and subsidiaries (the Company) as of August 31, 2023 and August 31, 2022, the related consolidated statements of earnings, comprehensive income, shareholders equity, and cash flows for each of the years in the three-year period ended August 31, 2023, and the related notes and financial statement schedules (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023 and August 31, 2022, and the results of its operations and its cash flows for each of the years in the three-year period ended August 31, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated October 19, 2023 expressed an unqualified opinion on the effectiveness of the Companys internal control over financial reporting.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of product warranty accrual\nAs discussed in Notes 1 and 17 to the consolidated financial statements, the Companys product warranty accrual as of August 31, 2023 was $14.5 million. The Company warrants a portion of its products against certain manufacturing and other defects and estimates the amount of warranty accrual based on various factors, including historical warranty costs and sales.\nWe identified the evaluation of historical claim experience used to estimate the domestic product warranty accrual for the Irrigation segment as a critical audit matter. Subjective auditor judgment was required to\nevaluate the relevance of historical claim experience in the determination of the estimated product warranty accrual.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the product warranty accrual process, including controls related to the relevance and reliability of historical claim data and the review of significant assumptions used in developing the estimate. We assessed the estimated cost of future claims used in the estimation of product warranty liability by comparing them to the Companys underlying historical claims data that was assessed for relevance and reliability. To assess managements ability to estimate the product warranty accrual, we compared the Companys historical product warranty estimates to actual claim results.\n/s/ KPMG LLP\nWe have served as the Companys auditor since 2001.\nOmaha, Nebraska\nOctober 19, 2023\nLindsay Corporation and Subsidiaries\nCONSOLIDATED STATEMENTS OF EARNINGS\nYears ended August 31,\n($ and shares in thousands, except per share amounts)\nOperating revenues\n$\n674,084\n$\n770,743\n$\n567,646\nCost of operating revenues\n461,069\n571,565\n417,441\nGross profit\n213,015\n199,178\n150,205\nOperating expenses:\nSelling expense\n36,201\n33,920\n30,816\nGeneral and administrative expense\n56,412\n55,470\n51,923\nEngineering and research expense\n18,218\n15,145\n13,359\nTotal operating expenses\n110,831\n104,535\n96,098\nOperating income\n102,184\n94,643\n54,107\nOther (expense) income:\nInterest expense\n(3,788\n)\n(4,269\n)\n(4,751\n)\nInterest income\n2,783\n1,083\nOther expense, net\n(804\n)\n(3,128\n)\n(53\n)\nTotal other (expense) income\n(1,809\n)\n(6,775\n)\n(3,721\n)\nEarnings before income taxes\n100,375\n87,868\n50,386\nIncome tax expense\n27,996\n22,399\n7,814\nNet earnings\n$\n72,379\n$\n65,469\n$\n42,572\nEarnings per share:\nBasic\n$\n6.58\n$\n5.97\n$\n3.91\nDiluted\n$\n6.54\n$\n5.94\n$\n3.88\nShares used in computing earnings per share:\nBasic\n11,003\n10,965\n10,886\nDiluted\n11,062\n11,031\n10,985\nCash dividends declared per share\n$\n1.37\n$\n1.33\n$\n1.30\nSee accompanying notes to consolidated financial statements.\nLindsay Corporation and Subsidiaries\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\nYears ended August 31,\n($ in thousands)\nNet earnings\n$\n72,379\n$\n65,469\n$\n42,572\nOther comprehensive (loss) income:\nDefined benefit pension plan adjustment, net of tax\nForeign currency translation adjustment, net of\nhedging activities and tax\n(24\n)\n(3,839\n)\n2,345\nUnrealized gain (loss) on marketable securities, net of tax\n(267\n)\n(91\n)\nTotal other comprehensive income (loss), net of tax\n(benefit) expense of ($855), $1,399, and $409\n(3,540\n)\n2,639\nTotal comprehensive income\n$\n72,842\n$\n61,929\n$\n45,211\nSee accompanying notes to consolidated financial statements.\nLindsay Corporation and Subsidiaries\nCONSOLIDATED BALANCE SHEETS\nAugust 31,\nAugust 31,\n($ and shares in thousands, except par values)\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n160,755\n$\n105,048\nMarketable securities\n5,556\n11,460\nReceivables, net of allowance of $5,048 and $4,118, respectively\n144,774\n138,200\nInventories, net\n155,932\n193,776\nOther current assets\n20,467\n28,617\nTotal current assets\n487,484\n477,101\nProperty, plant, and equipment, net\n99,681\n94,472\nIntangible assets, net\n27,719\n18,208\nGoodwill\n83,121\n67,130\nOperating lease right-of-use assets\n17,036\n19,181\nDeferred income tax assets\n10,885\n9,313\nOther noncurrent assets\n19,734\n25,248\nTotal assets\n$\n745,660\n$\n710,653\nLIABILITIES AND SHAREHOLDERS' EQUITY\nCurrent liabilities:\nAccounts payable\n$\n44,278\n$\n60,036\nCurrent portion of long-term debt\nOther current liabilities\n91,604\n100,684\nTotal current liabilities\n136,108\n160,942\nPension benefits liabilities\n4,382\n4,892\nLong-term debt\n115,164\n115,341\nOperating lease liabilities\n17,689\n19,810\nDeferred income tax liabilities\n1,054\nOther noncurrent liabilities\n15,977\n15,256\nTotal liabilities\n290,009\n317,295\nShareholders' equity:\nPreferred stock of $1 par value - authorized 2,000 shares; no shares issued and outstanding\n-\n-\nCommon stock at $1 par value - authorized 25,000 shares; 19,094 and 19,063 shares issued at August 31, 2023 and 2022, respectively\n19,094\n19,063\nCapital in excess of stated value\n98,508\n94,006\nRetained earnings\n636,297\n579,000\nLess treasury stock - at cost, 8,083 shares\n(277,238\n)\n(277,238\n)\nAccumulated other comprehensive loss, net\n(21,010\n)\n(21,473\n)\nTotal shareholders' equity\n455,651\n393,358\nTotal liabilities and shareholders' equity\n$\n745,660\n$\n710,653\nSee accompanying notes to consolidated financial statements.\nLindsay Corporation and Subsidiaries\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n($ and shares in thousands, except per share amounts)\nShares of\ncommon\nstock\nShares of\ntreasury\nstock\nCommon\nstock\nCapital in\nexcess of\nstated\nvalue\nRetained\nearnings\nTreasury\nstock\nAccumulated\nother\ncomprehensive\nloss,\nnet\nTotal\nshareholders\nequity\nBalance at August 31, 2020\n18,918\n8,083\n$\n18,918\n$\n77,686\n$\n499,724\n$\n(277,238\n)\n$\n(20,572\n)\n$\n298,518\nComprehensive income:\nNet earnings\n42,572\n42,572\nOther comprehensive income\n2,639\n2,639\nTotal comprehensive income\n45,211\nCash dividends ($1.30) per share\n(14,166\n)\n(14,166\n)\nIssuance of common shares under share compensation plans, net\n2,623\n2,696\nShare-based compensation expense\n6,186\n6,186\nBalance at August 31, 2021\n18,991\n8,083\n$\n18,991\n$\n86,495\n$\n528,130\n$\n(277,238\n)\n$\n(17,933\n)\n$\n338,445\nComprehensive income:\nNet earnings\n65,469\n65,469\nOther comprehensive loss\n(3,540\n)\n(3,540\n)\nTotal comprehensive income\n61,929\nCash dividends ($1.33) per share\n(14,599\n)\n(14,599\n)\nIssuance of common shares under share compensation plans, net\n2,053\n2,125\nShare-based compensation expense\n5,458\n5,458\nBalance at August 31, 2022\n19,063\n8,083\n$\n19,063\n$\n94,006\n$\n579,000\n$\n(277,238\n)\n$\n(21,473\n)\n$\n393,358\nComprehensive income:\nNet earnings\n72,379\n72,379\nOther comprehensive loss\nTotal comprehensive income\n72,842\nCash dividends ($1.37) per share\n(15,082\n)\n(15,082\n)\nIssuance of common shares under share compensation plans, net\n(2,027\n)\n(1,996\n)\nShare-based compensation expense\n6,529\n6,529\nBalance at August 31, 2023\n19,094\n8,083\n$\n19,094\n$\n98,508\n$\n636,297\n$\n(277,238\n)\n$\n(21,010\n)\n$\n455,651\nSee accompanying notes to consolidated financial statements.\nLindsay Corporation and Subsidiaries\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears ended August 31,\n($ in thousands)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet earnings\n$\n72,379\n$\n65,469\n$\n42,572\nAdjustments to reconcile net earnings to net cash provided by operating activities:\nDepreciation and amortization\n19,282\n20,178\n19,177\nProvision for uncollectible accounts receivable\nDeferred income taxes\n-\n(2,063\n)\n1,911\nShare-based compensation expense\n6,529\n5,458\n6,186\nForeign currency transaction loss (gain)\n1,126\n2,274\n(1,934\n)\nOther, net\n1,569\n(828\n)\nChanges in assets and liabilities:\nReceivables\n(4,926\n)\n(47,514\n)\n(11,535\n)\nInventories\n40,954\n(53,803\n)\n(38,158\n)\nOther current assets\n4,693\n1,220\n(8,132\n)\nAccounts payable\n(15,274\n)\n13,832\n17,993\nOther current liabilities\n(9,135\n)\n18,433\nOther noncurrent assets and liabilities\n1,629\n(3,787\n)\n(2,488\n)\nNet cash provided by operating activities\n119,707\n3,048\n43,968\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of property, plant and equipment\n(18,775\n)\n(15,595\n)\n(26,511\n)\nPurchases of marketable securities available-for-sale\n(4,932\n)\n(18,468\n)\n(19,356\n)\nProceeds from maturities of marketable securities available-for-sale\n10,982\n25,968\n18,825\nAcquisition of business, net of cash acquired\n(30,842\n)\n-\n-\nOther investing activities, net\n(3,850\n)\n(855\n)\n(577\n)\nNet cash used in investing activities\n(47,417\n)\n(8,950\n)\n(27,619\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from exercise of stock options\n2,894\n3,965\nCommon stock withheld for payroll tax obligations\n(2,471\n)\n(1,181\n)\n(1,269\n)\nProceeds from employee stock purchase plan\n-\nPrincipal payments on long-term debt\n(222\n)\n(218\n)\n(195\n)\nDividends paid\n(15,082\n)\n(14,599\n)\n(14,166\n)\nNet cash used in financing activities\n(17,299\n)\n(12,692\n)\n(11,665\n)\nEffect of exchange rate changes on cash and cash equivalents\n(3,465\n)\n1,020\nNet change in cash and cash equivalents\n55,707\n(22,059\n)\n5,704\nCash and cash equivalents, beginning of period\n105,048\n127,107\n121,403\nCash and cash equivalents, end of period\n$\n160,755\n$\n105,048\n$\n127,107\nSUPPLEMENTAL CASH FLOW INFORMATION\nIncome taxes paid\n20,305\n15,738\n6,805\nInterest paid\n3,907\n3,811\n4,640\nNONCASH INVESTING ACTIVITIES\nIssuance of notes receivable from sale of business\n-\n-\n2,051\nSee accompanying notes to consolidated financial statements.\nLindsay Corporation and Subsidiaries\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Description of Business and Significant Accounting Policies\nLindsay Corporation, along with its subsidiaries (collectively called Lindsay or the Company), is a global leader in providing a variety of proprietary water management and road infrastructure products and services. The Company has been involved in the manufacture and distribution of agricultural irrigation equipment since 1955 and has grown from a regional company to an international water efficiency solutions and highway infrastructure firm with worldwide sales and distribution. Lindsay, a Delaware corporation, maintains its global headquarters in Omaha, Nebraska. The Company has operations which are categorized into two reporting segments.\nIrrigation Segment\nThe Companys irrigation segment includes the manufacture and marketing of center pivot, lateral move, and hose reel irrigation systems which are used principally in the agricultural industry to increase or stabilize crop production while conserving water, energy and labor. The irrigation segment also manufactures and markets repair and replacement parts for its irrigation systems and controls. The Company continues to strengthen irrigation product offerings through innovative technology such as Global Positioning System (GPS) positioning and guidance, variable rate irrigation, wireless irrigation management, machine-to-machine (M2M) communication technology solutions and mobile device applications. The Companys domestic irrigation manufacturing facilities are located in Lindsay, Nebraska and Olathe, Kansas. Internationally, the Company has production operations in Brazil, France, China, Türkiye (formerly Turkey) and South Africa as well as distribution and sales operations in the Netherlands, Egypt, Australia and New Zealand. The Company also exports equipment from the U.S. to other international markets.\nInfrastructure Segment\nThe Companys infrastructure segment includes the manufacture and marketing of moveable barriers, specialty barriers, crash cushions and end terminals, road marking and road safety equipment, and railroad signals and structures. The principal infrastructure manufacturing facilities are located in Rio Vista, California; Milan, Italy; and Lindsay, Nebraska.\nNotes to the consolidated financial statements describe various elements of the financial statements and the accounting policies, estimates, and assumptions applied by management. While actual results could differ from those estimated at the time of preparation of the consolidated financial statements, management believes that the accounting policies, assumptions, and estimates applied promote the representational faithfulness, verifiability, neutrality, and transparency of the accounting information included in the consolidated financial statements. The significant accounting policies of the Company are as follows:\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its subsidiaries. All intercompany balances and transactions are eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nRevenue Recognition\nThe Company recognizes revenue in a manner that depicts the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled for exchange of those goods or services. Refer to Note 3 for additional information regarding our revenue recognition policy under ASC 606.\nShare-Based Compensation\nThe Company recognizes compensation expense for all share-based payment awards made to employees and directors based on estimated fair values on the date of grant. The Company uses the straight-line amortization method over the vesting period of the awards and records forfeitures as they occur.. The Company has historically issued shares upon exercise of stock options or vesting of restricted stock units or performance stock units.\nThe value of the portion of the award that is ultimately expected to vest is recognized as expense in the Companys consolidated statement of earnings over the periods during which the employee or director is required to perform a service in exchange for the award.\nThe Company uses the Black-Scholes option-pricing model (Black-Scholes model) as its valuation method for stock option awards. Under the Black-Scholes model, the fair value of stock option awards on the date of grant is estimated using an option-pricing model that is affected by the Companys stock price as well as assumptions regarding a number of highly complex and subjective variables. These variables include, but are not limited to, the Companys expected stock price volatility over the term of the awards and actual and projected employee stock option exercise behaviors. Restricted stock, restricted stock units, and the performance-based portion of performance stock units issued under the 2015 Long-Term Incentive Plan will have a grant-date fair value equal to the fair market value of the underlying stock on the grant date less present value of expected dividends. The portion of performance stock units based on market-based metrics will have a grant-date fair value calculated through a Monte Carlo simulation model using a number of inputs. The inputs to the Companys Monte Carlo valuation model are summarized in Note 19 - Share-Based Compensation.\nWarranty Costs\nThe Companys provision for product warranty reflects managements best estimate of probable liability under its product warranties. At the time a sale is recognized, the Company records the estimated future warranty costs. The Company generally determines its total future warranty liability by applying historical claims rate experience to the amount of equipment that has been sold and is still within the warranty period. In addition, the Company records provisions for known warranty claims and adjusts for current trends, if applicable. This provision is periodically adjusted to reflect actual experience.\nCash and Cash Equivalents\nCash equivalents consist of highly liquid investments with original maturities of three months or less.\nMarketable Securities\nThe Company accounts for and classifies its marketable securities in accordance with the accounting guidance related to the accounting and classification of certain investments in marketable securities. The determination on appropriate classification is based primarily on managements ability and intent to sell the debt security.\nThe Companys investment in marketable securities consists of United States treasury bonds and investment grade corporate bonds. The marketable securities are classified as available-for-sale and are carried at fair value with the change in unrealized gains and losses reported as a separate component on the consolidated statements of comprehensive income until realized. The Company determines fair value using data points that are observable, such as quoted prices and interest rates. Investment income is recorded within interest income on the consolidated statements of earnings. As of August 31, 2023, approximately 96% of the Companys marketable securities investments mature within one year and 4% mature within one to two years.\nReceivables, net\nTrade receivables are reported on the balance sheet net of an allowance for expected credit losses. The allowance for expected credit losses is based on a number of factors, including the aging of outstanding receivables and historical losses. In addition, the Company incorporates current economic conditions and customer specific circumstances and details in its estimate for expected credit losses. Receivables are written off against the allowance when the receivable is deemed uncollectible and all collection efforts have been completed.\nThe Companys allowance for all expected credit losses related to outstanding receivables increased to $5.0 million at August 31, 2023 from $4.1 million at August 31, 2022. The Companys evaluation of the adequacy of the allowance for credit losses is based on facts and circumstances available to the Company at the date the consolidated financial statements are issued and considers any significant changes in circumstances occurring through the date that the financial statements are issued.\nInventories\nInventories are stated at the lower of cost or net realizable value. Cost is determined by the last-in, first-out (LIFO) method, the first-in, first-out (FIFO) method, or the weighted average cost method for inventory depending on the operations at each specific location. At all locations, the Company reserves for obsolete, slow moving, and excess inventory by estimating the net realizable value based on the potential future use of such inventory.\nProperty, Plant, and Equipment\nProperty, plant, equipment, and capitalized assets held for lease are stated at cost. The Company capitalizes major expenditures and charges to operating expenses the cost of current maintenance and repairs. Provisions for depreciation and amortization have been computed principally on the straight-line method for property, plant, and equipment. Rates used for depreciation are based principally on the following expected lives: buildings -- 15 to 40 years; equipment -- 3 to 7 years; computer hardware and software - 3 to 5 years; leased barrier transfer machines -- 8 to 10 years; leased barriers -- 12 years; other -- 2 to 20 years and leasehold improvements - shorter of the economic life or term of the lease. The Companys internally developed software is included in computer hardware and software. All of the Companys long-lived asset groups are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. If the sum of the expected future cash flows is less than the carrying amount of the asset group, an impairment loss is recognized based upon the difference between the fair value of the asset and its carrying value. No impairments were recorded during the fiscal years ended August 31, 2023, 2022, and 2021. The cost and accumulated depreciation relating to assets retired or otherwise disposed of are eliminated from the respective accounts at the time of disposition. The resulting gain or loss is included in operating income in the consolidated statements of earnings.\nValuation of Goodwill and Identifiable Intangible Assets\nGoodwill represents the excess of the purchase price over the fair value of net assets acquired in a business combination. Acquired intangible assets are recognized separately from goodwill. Goodwill and other intangible assets are tested for impairment at least annually and whenever triggering events or changes in circumstances indicate its carrying value may not be recoverable. Assessment of the potential impairment of goodwill and identifiable intangible assets is an integral part of the Companys normal ongoing review of operations. Testing for potential impairment of these assets is significantly dependent on numerous assumptions and reflects managements best estimates at a particular point in time. The dynamic economic environments in which the Companys businesses operate and key economic and business assumptions related to projected selling prices, market growth, inflation rates and operating expense ratios, can significantly affect the outcome of impairment tests. Estimates based on these assumptions may differ significantly from actual results. Changes in factors and assumptions used in assessing potential impairments can have a significant impact on the existence and magnitude of impairments, as well as the time in which such impairments are recognized.\nIn fiscal 2023, in conjunction with the Companys annual review for impairment, the Company performed a qualitative analysis of goodwill for each of the Companys reporting units, which are the same as its operating segments, and did not identify any potential impairment. The estimated fair value of all reporting units is substantially in excess of its carrying value. Also in fiscal 2023, the Company performed a qualitative analysis of other intangible assets and concluded there were no indicators of impairment.\nIncome Taxes\nIncome taxes are accounted for utilizing the asset and liability method. Deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying value of existing assets and liabilities and their respective tax bases. These expected future tax consequences are measured based on currently enacted tax rates. The effect of tax rate changes on deferred tax assets and liabilities is recognized in income during the period that includes the enactment date. In assessing the ability to realize deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax asset will not be realized. The Companys evaluation of the adequacy of any potential allowance is based on facts and circumstances available to the Company at the date the consolidated financial statements are issued and considers any significant changes in circumstances occurring through the date that the financial statements are issued.\nNet Earnings per Share\nBasic net earnings per share is computed using the weighted average number of common shares outstanding during the period. Diluted net earnings per share is computed using the weighted average number of common shares outstanding plus dilutive potential common shares outstanding during the period.\nEmployee stock options, non-vested shares and similar equity instruments granted by the Company are treated as potential common share equivalents outstanding in computing diluted net earnings per share. The Companys diluted common shares outstanding reported in each period includes the dilutive effect of restricted stock units, in-the-money options, and performance stock units for which threshold performance conditions have been satisfied and is calculated based on the average share price for each fiscal period using the treasury stock method. Under the treasury stock method, the amount the employee must pay for exercising stock options, and the amount of compensation cost for future service that the Company has not yet recognized, are assumed to be used to repurchase shares.\nDerivative Instruments and Hedging Activities\nThe Company uses certain financial derivatives to mitigate its exposure to volatility in interest rates and foreign currency exchange rates. All derivative instruments are recorded on the balance sheet at their respective fair values. The Company uses these derivative instruments only to hedge exposures in the ordinary course of business and does not invest in derivative instruments for speculative purposes. On the date a derivative contract is entered into, the Company may elect to designate the derivative as a fair value hedge, a cash flow hedge, or the hedge of a net investment in a foreign operation.\nThe Company also formally assesses, both at the hedges inception and on an ongoing basis, whether the derivative that is used in the hedging transaction is effective. Changes in fair value of derivative instruments that qualify as hedges of a net investment in foreign operations are recorded as a component of accumulated currency translation adjustment in accumulated other comprehensive income (AOCI), net of related income tax effects.\nThe Company discontinues hedge accounting prospectively when it is determined that the derivative is no longer effective in offsetting changes in the cash flows of the hedged item, the derivative expires or is sold, terminated, or exercised, or management determines that designation of the derivative as a hedging instrument is no longer appropriate. In situations in which the Company does not elect hedge accounting or hedge accounting is discontinued and the derivative is retained, the Company carries or continues to carry the derivative at its fair value on the balance sheet and recognizes any subsequent changes in its fair value through earnings. The Company manages market and credit risks associated with its derivative instruments by establishing and monitoring limits as to the types and degree of risk that may be undertaken, and by entering into transactions with high-quality counterparties. As of August 31, 2023, the Companys derivative counterparties had investment grade credit ratings.\nFair Value Measurements\nThe Companys disclosure of the fair value of assets and liabilities is based on a three-level hierarchy for fair value measurements based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date. Inputs refers broadly to the assumptions that market participants would use in pricing the asset or liability, including assumptions about risk. The categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement. Financial assets and liabilities carried at fair value will be classified and disclosed in one of the following three categories:\nLevel 1 - inputs to valuation techniques are quoted prices in active markets for identical assets or liabilities\nLevel 2 - inputs to the valuation techniques are other than quoted prices but are observable for the assets or liabilities, either directly or indirectly\nLevel 3 - inputs to the valuation techniques are unobservable for the assets or liabilities\nTreasury Stock\nWhen the Company repurchases its outstanding stock, it records the repurchased shares at cost as a reduction to shareholders equity. The weighted average cost method is utilized for share re-issuances. The difference between the cost and the re-issuance price is charged or credited to a capital in excess of stated value - treasury stock account to the extent that there is a sufficient balance to absorb the charge. If the treasury stock is sold for an amount less than its cost and there is not a sufficient balance in the capital in excess of stated value - treasury stock account, the excess is charged to retained earnings.\nContingencies\nThe Companys accounting for contingencies covers a variety of business activities including contingencies for legal exposures and environmental exposures. The Company accrues these contingencies when its assessments indicate that it is probable that a liability has been incurred and an amount can be reasonably estimated. The Companys estimates are based on currently available facts and its estimates of the ultimate outcome or resolution. Actual results may differ from the Companys estimates resulting in an impact, positive or negative, on earnings.\nEnvironmental Remediation Liabilities\nEnvironmental remediation liabilities include costs directly associated with site investigation and clean up, such as materials, external contractor costs and incremental internal costs directly related to the remedy. The Company accrues the anticipated cost of environmental remediation when the obligation is probable and can be reasonably estimated. Estimates used to record environmental remediation liabilities are based on the Companys best estimate of probable future costs based on site-specific facts and circumstances. Estimates of the cost for the likely remedy are\ndeveloped using internal resources or by third-party environmental engineers or other service providers. The Company records the environmental remediation liabilities that represent the points in the range of estimates that are most probable or the minimum amount when no amount within the range is a better estimate than any other amount. Portions of the long-term liability that are fixed and reliably determinable are discounted at a risk-free rate.\nTranslation of Foreign Currency\nThe Companys portion of the assets and liabilities related to foreign investments are translated into U.S. dollars at the exchange rates in effect at the balance sheet date. Revenue and expenses are translated at the average rates of exchange prevailing during the year. Unrealized gains or losses are reflected within common shareholders equity as accumulated other comprehensive income or loss.\nNote 2 - New Accounting Pronouncements\nRecent Accounting Guidance Adopted\nIn December 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2019-12, Simplifying the Accounting for Income Taxes, which simplifies the accounting and related disclosure requirements for income taxes. The Company adopted this standard in the first quarter of its fiscal 2022. The adoption of this ASU did not have a material impact on its consolidated financial statements.\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments - Credit Losses (Topic 326), Measurement of Credit Losses on Financial Instruments. The standard replaces the incurred loss impairment methodology in current U.S. GAAP with a methodology that reflects expected credit losses on instruments within its scope, including trade receivables. This update is intended to provide financial statement users with more decision-useful information about the expected credit losses. The Company adopted this in the first quarter of the Companys fiscal 2021. The adoption of this ASU did not have a material impact on its consolidated financial statements and related disclosures.\nIn January 2017, the FASB issued ASU No. 2017-04, Simplifying the Test for Goodwill Impairment, which eliminates the requirement to calculate the implied fair value of goodwill; rather, an entity will measure its goodwill impairment by the amount the carrying value exceeds the fair value of a reporting unit. The Company adopted this in the first quarter of the Companys fiscal 2021. The adoption of this ASU did not have a material impact on its consolidated financial statements and related disclosures.\nRecent Accounting Guidance Not Yet Adopted\nIn September 2022, the FASB issued ASU No. 2022-04, Liabilities - Supplier Finance Programs, which requires annual and interim disclosures for entities that finance its purchases with supplier finance programs. These amendments are effective for the Company beginning it its fiscal 2024, except for the amendment on rollforward information, which is effective for the Company beginning in its fiscal 2025. The adoption of this ASU is not expected to have a material impact on its consolidated financial statements.\nNote 3 - Revenue Recognition\nThe Company determines the appropriate revenue recognition for its contracts by analyzing the type, terms and conditions of each contract or arrangement with a customer. Revenue is recognized when the Company satisfies the performance obligation by transferring control over goods or services to a customer. The amount of revenue recognized is measured as the consideration the Company expects to receive in exchange for those goods or services pursuant to a contract with the customer. The Company does not recognize revenue in cases where collectability is not probable, and defers the recognition until collection is probable or payment is received. Sales taxes, value added taxes, and other taxes collected from its customers concurrent with its revenue activities are excluded from revenue.\nThe Company elected to use the practical expedient of treating shipping and handling costs associated with outbound freight as a fulfillment obligation instead of a separate performance obligation. Shipping and handling fees billed to the customer are reported as revenue and recorded in the same period as the associated fulfillment costs. Customer rebates, cash discounts and other sales incentives are recorded as a reduction of revenues in the period in which the sale is recognized.\nFor contracts with a length longer than twelve months, the unsatisfied performance obligations were $1.5 million and $2.0 million at August 31, 2023 and 2022, respectively.\nPerformance Obligations\nA performance obligation is a promise in a contract to transfer a distinct good or service to the customer and is the unit of account. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied.\nFor contracts with multiple performance obligations, the Company allocates the transaction price to each performance obligation using the stand-alone selling price of each distinct good or service in the contract. For most performance obligations, the stand-alone selling price is directly observable as these goods or services are also sold separately by the Company. For performance obligations where the stand-alone selling price is not directly observable, the Company uses the expected cost plus a margin approach, under which the expected costs of satisfying a performance obligation are forecasted and then an appropriate margin for that distinct good or service is added.\nThe Companys performance obligations are satisfied at either a point in time or over time depending on the measure of progress applied toward the complete satisfaction in the transfer of control of the related goods and services to the customer.\nRevenue recognized at a point in time is derived from the sale of equipment and related parts. Revenue recognition for equipment and parts is generally at a point in time upon transfer of control of the goods to the customer which generally happens upon shipment of goods to the customer.\nRevenue recognized over time is primarily derived from remote monitoring subscription services and custom and contract manufactured products. For fixed price agreements, the Company recognizes revenue on an inputs basis, using total costs incurred to date as a percentage of total costs expected to be incurred. For time and material arrangements, the Company utilizes an output method of resources consumed such as the expended hours times the hourly billing rate. For remote monitoring subscription services, customers are generally billed in advance and revenue is recognized ratably over the life of the agreement.\nFor custom and contract manufactured products, the transfer of control is continuous over the life of the agreement and products do not have an alternate use to the Company. When the customer agreements contain contractual termination clauses and right to payment for work performed to date, the revenue from these agreements is recognized over time as the products are produced.\nThe Company also leases certain infrastructure property to customers. Revenues from the leasing of infrastructure property are recognized on a straight-line basis over the lease term.\nA breakout by segment of revenue recognized over time versus point in time for twelve months ended August 31, 2023 and 2022, is as follows:\nYear ended August 31, 2023\n($ in thousands)\nIrrigation\nInfrastructure\nTotal\nPoint in time\n$\n559,826\n$\n69,540\n$\n629,366\nOver time\n26,205\n6,334\n32,539\nRevenue from the contracts with customers\n586,031\n75,874\n661,905\nLease revenue\n-\n12,179\n12,179\nTotal operating revenues\n$\n586,031\n$\n88,053\n$\n674,084\nYear ended August 31, 2022\n($ in thousands)\nIrrigation\nInfrastructure\nTotal\nPoint in time\n$\n643,169\n$\n88,681\n$\n731,850\nOver time\n22,660\n5,753\n28,413\nRevenue from the contracts with customers\n665,829\n94,434\n760,263\nLease revenue\n-\n10,480\n10,480\nTotal operating revenues\n$\n665,829\n$\n104,914\n$\n770,743\nFurther disaggregation of revenue is disclosed in the Note 18 - Industry Segment Information.\nContract Balances\nContract assets arise when recorded revenue for a contract exceeds the amounts billed under the terms of such contract. Contract liabilities arise when billed amounts exceed revenue recorded. Amounts are billable to customers upon various measures of performance, including achievement of certain milestones and completion of specified units of completion of the contract.\nContract assets primarily relate to the Companys rights to consideration for work completed but not billed at the reporting date. The contract liabilities primarily relate to the advance consideration received from customers for customer contracts, for which transfer of control of products or performance of service occurs in the future, and therefore revenue is recognized upon completion of the performance obligation. The Company has elected to recognize the incremental costs of obtaining a contract with a term of less than one year as a selling expense when incurred.\nAt August 31, 2023 and 2022, contract assets amounted to $1.3 million and $0.9 million, respectively. These amounts are included within other current assets on the consolidated balance sheet.\nAt August 31, 2023, and 2022, contract liabilities amounted to $20.5 million and $30.6 million, respectively. Contract liabilities are included within other current liabilities and noncurrent liabilities on the consolidated balance sheet. During the year ended August 31, 2023, the Company recognized $27.7 million of revenue that was included in the liability as of August 31, 2022. The revenue recognized was due to performance obligations being completed during the year. Amounts included here exclude deferred lease revenues that are also included within other current liabilities.\nNote 4 - Acquisitions and Divestitures\nFieldWise, LLC\nOn July 28, 2023 (\"the acquisition date\"), the Company completed the acquisition of the membership interests of FieldWise, LLC (\"FieldWise\"). FieldWise is a market leader in agricultural technology products with a focus on subscription-based, precision irrigation solutions. The purchase price of $32.6 million was financed through an all cash transaction from the Company's cash on hand.\nThe following table summarizes the preliminary purchase price allocation for FieldWise at the acquisition date. The Company expects the purchase price allocation to be finalized by the end of fiscal 2024.\n($ in thousands)\nTotal\nCash and cash equivalents\n$\n1,779\nAccounts receivable\nInventories\n2,651\nProperty and equipment\n2,443\nDeferred tax asset\nIntangible assets\n11,400\nGoodwill\n15,589\nAccounts payable and accrued liabilities\n(252\n)\nDeferred revenues\n(1,229\n)\nNon-current deferred revenues\n(230\n)\nTotal purchase price\n32,621\nThe acquired intangible assets include amortizable intangible assets of $10.7 million and indefinite-lived intangible assets of $0.7 million related to tradenames. The amortizable intangible assets have a weighted average useful life of approximately 13.1 years. The following table summarizes the identifiable intangible assets at fair value.\n($ in thousands)\nWeighted average useful life in years\nFair value of identifiable asset\nIntangible assets:\nCustomer relationships\n15.0\n$\n8,700\nDeveloped technology\n5.0\n2,000\nTradenames\nN/A\nTotal intangible assets\n13.1\n$\n11,400\nGoodwill related to the acquisition of FieldWise primarily relates to intangible assets that do not qualify for separate recognition, including the experience and knowledge of FieldWise management, its assembled workforce, and its intellectual capital and specialization with monitoring technology solutions, data acquisition and management systems. This goodwill is included in the irrigation reporting segment and is deductible for income tax purposes. Pro forma information related to this acquisition was not included because the impact on the Companys consolidated financial statements was not considered to be material.\nIRZ Consulting, LLC\nOn August 27, 2021, the Company completed the divestiture of ownership interests in IRZ Consulting, LLC (IRZ). Proceeds from the sale totaled $3.4 million, which consisted of (i) $1.3 million in cash and (ii) $2.1 million in short-term notes. A gain of $1.1 million was recorded in general and administrative expense on the consolidated statement of earnings in the year ended August 31, 2021.\nNote 5 - Net Earnings Per Share\nThe following table shows the computation of basic and diluted net earnings per share for fiscal 2023, 2022, and 2021:\nFor the years ended August 31,\n($ and shares in thousands, except per share amounts)\nNumerator:\nNet earnings\n$\n72,379\n$\n65,469\n$\n42,572\nDenominator:\nWeighted average shares outstanding\n11,003\n10,965\n10,886\nDiluted effect of stock equivalents\nWeighted average shares outstanding assuming dilution\n11,062\n11,031\n10,985\nBasic net earnings per share\n$\n6.58\n$\n5.97\n$\n3.91\nDiluted net earnings per share\n$\n6.54\n$\n5.94\n$\n3.88\nCertain stock options and restricted stock units were excluded from the computation of diluted net earnings per share because their effect would have been anti-dilutive. Performance stock units are excluded from the calculation of dilutive potential common shares until the threshold performance conditions have been satisfied. The number of securities excluded from the computation of earnings per share because their effect would have been anti-dilutive was not significant for fiscal 2023, 2022, and 2021.\nNote 6 - Accumulated Other Comprehensive Loss\nAccumulated other comprehensive loss is included in the accompanying consolidated balance sheets in the shareholders equity section, and consists of the following components:\nAugust 31,\n($ in thousands)\nAccumulated other comprehensive loss:\nDefined benefit pension plan, net of tax benefit of $620 and $716\n$\n(1,971\n)\n(2,277\n)\nForeign currency translation, net of hedging activities, net of tax\nexpense of $3,868 and $4,875\n(18,948\n)\n(18,924\n)\nUnrealized loss on marketable securities, net of tax benefit of $23 and $78\n(91\n)\n(272\n)\nTotal accumulated other comprehensive loss\n$\n(21,010\n)\n$\n(21,473\n)\nThe following is a roll-forward of the balances in accumulated other comprehensive loss, net of tax.\nUnrealized\nAccumulated\nDefined\nForeign\ngain (loss) on\nother\nbenefit\ncurrency\nmarketable\ncomprehensive\n($ in thousands)\npension plan\ntranslation\nsecurities\nloss\nBalance at August 31, 2021\n$\n(2,843\n)\n$\n(15,085\n)\n$\n(5\n)\n$\n(17,933\n)\nCurrent period change\n(3,839\n)\n(267\n)\n(3,540\n)\nBalance at August 31, 2022\n(2,277\n)\n(18,924\n)\n(272\n)\n(21,473\n)\nCurrent period change\n(24\n)\nBalance at August 31, 2023\n$\n(1,971\n)\n$\n(18,948\n)\n$\n(91\n)\n$\n(21,010\n)\nNote 7 - Income Taxes\nFor financial reporting purposes earnings before income taxes include the following components:\nFor the years ended August 31,\n($ in thousands)\nUnited States\n$\n40,066\n$\n34,465\n$\n28,605\nForeign\n60,309\n53,403\n21,781\n$\n100,375\n$\n87,868\n$\n50,386\nSignificant components of the income tax provision are as follows:\nFor the years ended August 31,\n($ in thousands)\nCurrent:\nFederal\n$\n8,119\n$\n5,678\n$\n2,432\nState\n1,690\n1,310\nForeign\n18,187\n17,474\n2,738\nTotal current\n27,996\n24,462\n5,903\nDeferred:\nFederal\n(684\n)\n2,251\nState\n(76\n)\nForeign\n(2,341\n)\n(621\n)\nTotal deferred\n-\n(2,063\n)\n1,911\nTotal income tax provision\n$\n27,996\n$\n22,399\n$\n7,814\nTotal income tax provision resulted in effective tax rates differing from that of the statutory United States federal income tax rates. The reasons for these differences are:\nFor the years ended August 31,\n($ in thousands)\nAmount\n%\nAmount\n%\nAmount\n%\nU.S. statutory rate\n$\n21,079\n21.0\n$\n18,452\n21.0\n$\n10,581\n21.0\nState and local taxes, net of federal tax benefit\n1,259\n1.3\n1,069\n1.2\n1.7\nForeign tax rate differences\n6,017\n6.0\n3,318\n3.8\n(390\n)\n(0.8\n)\nU.S. tax reform\n(103\n)\n(0.1\n)\n0.4\n0.7\nDeferred tax asset valuation allowance\n(610\n)\n(0.6\n)\n-\n-\n(2,169\n)\n(4.3\n)\nFederal credits\n(445\n)\n(0.4\n)\n(444\n)\n(0.6\n)\n(629\n)\n(1.2\n)\nUncertain tax benefits\n(84\n)\n(0.1\n)\n(369\n)\n(0.4\n)\n(622\n)\n(1.2\n)\nCapital gains\n0.5\n-\n-\n-\n-\nOther\n0.3\n0.1\n(155\n)\n(0.3\n)\nEffective rate\n$\n27,996\n27.9\n$\n22,399\n25.5\n$\n7,814\n15.5\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the Companys deferred tax assets and liabilities are as follows:\nAugust 31,\n($ in thousands)\nDeferred tax assets:\nAccrued expenses\n$\n11,467\n$\n12,569\nWarranty\n3,433\n3,336\nDefined benefit pension plan\n1,253\n1,391\nInventory\n2,749\n2,544\nShare-based compensation\n1,722\n1,474\nVacation\nNet operating loss and capital loss carry forwards\n1,208\nDeferred revenue\n1,379\n1,422\nAllowance for doubtful accounts\n1,338\n1,122\nLease liabilities\n3,656\n3,868\nCapitalized research and development expenditures\n2,009\n-\nOther\n1,490\nGross deferred tax assets\n31,620\n30,585\nValuation allowance\n(491\n)\n(1,203\n)\nNet deferred tax assets\n$\n31,129\n$\n29,382\nDeferred tax liabilities:\nIntangible assets\n$\n(5,085\n)\n$\n(5,389\n)\nProperty, plant, and equipment\n(12,718\n)\n(11,441\n)\nLease assets\n(2,844\n)\n(2,999\n)\nDerivative contract\n(286\n)\n(1,294\n)\nTotal deferred tax liabilities\n$\n(20,933\n)\n$\n(21,123\n)\nNet deferred tax assets\n$\n10,196\n$\n8,259\nIn assessing the ability to realize deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income, and tax planning strategies in making this assessment. The discrete items recorded in both fiscal 2023 and 2022 were not significant. As of August 31, 2023, the Company had a valuation allowance of $0.5 million related to deferred tax assets in a jurisdiction where the Company does not expect to realize the deferred benefit. The Company also had recorded a valuation allowance of $0.8 million as of August 31, 2022 related to capital losses from business divestitures where the Company believes it is more likely than not that the benefit from the capital loss will not be realized. The remaining valuation allowance related to deferred tax assets in a certain foreign tax jurisdiction not subject to tax due to a free trade zone exemption.\nThe Company does not intend to, and has not historically, repatriated earnings of its foreign subsidiaries. Thus, the Company has not provided a deferred income tax liability on these undistributed earnings that are indefinitely reinvested. The Company would recognize a deferred income tax liability if the Company were to determine that such earnings were no longer indefinitely reinvested. There are other taxes that may be incurred if the Company would repatriate earnings of its foreign subsidiaries. It is not practicable to estimate the amount of income taxes that would be incurred if the Company would repatriate earnings of its foreign subsidiaries.\nThe Company recognizes tax benefits only for tax positions that are more likely than not to be sustained upon examination by tax authorities. The amount recognized is measured as the largest amount of benefit that is greater than 50 percent likely to be realized upon settlement. Unrecognized tax benefits are tax benefits claimed in the Companys tax returns that do not meet these recognition and measurement standards.\nA reconciliation of changes in unrecognized tax benefits is as follows:\nAugust 31,\n($ in thousands)\nUnrecognized tax benefits at beginning of the year\n$\n$\nIncreases for positions taken in current year\nDecreases for positions taken in prior years\n(15\n)\n-\nReduction resulting from lapse of applicable\nstatute of limitations\n(144\n)\n(308\n)\nDecreases for settlements with tax authorities\n(48\n)\n-\nUnrecognized tax benefits at end of the year\n$\n$\nThe net amount of unrecognized tax benefits at August 31, 2023 and 2022 that, if recognized, would impact the Companys effective tax rate was $0.3 million and $0.5 million, respectively. The Company recognized $0.2 million and $0.4 million of interest and penalties recognized in the consolidated statement of earnings for the years ended August 31, 2023 and 2022, respectively. The Company recognizes accrued interest and penalties related to unrecognized tax benefits in income tax expense. Total accrued liabilities for interest and penalties included in the unrecognized tax benefits liability were $0.3 million and $0.4 million for each of the years ended August 31, 2023 and 2022, respectively.\nWhile it is expected that the amount of unrecognized tax benefits will change in the next twelve months as a result of the expiration of statutes of limitations, the Company does not expect this change to have a significant impact on its results of operations or financial position.\nThe Company files income tax returns in the United States and various state and foreign jurisdictions. The Company is no longer subject to income tax examination by US federal and most state tax authorities for tax years prior to fiscal 2020. Other major jurisdictions where we conduct business generally have statutes of limitations ranging from three to six years.\nNote 8 - Inventories\nAugust 31,\n($ in thousands)\nRaw materials and supplies\n$\n83,908\n$\n93,469\nWork in process\n7,820\n12,603\nFinished goods and purchased parts\n86,793\n110,022\nTotal inventory value before LIFO adjustment\n178,521\n216,094\nLess adjustment to LIFO value\n(22,589\n)\n(22,318\n)\nInventories, net\n$\n155,932\n$\n193,776\nOf the $178.5 million and $216.1 million of inventories at August 31, 2023, and 2022, respectively, $64.8 million and $77.8 million, respectively was valued on the last-in, first-out (\"LIFO\") basis, and $113.8 million and $138.3 million, respectively was valued on first-in, first-out (\"FIFO\") or average cost methods. In fiscal 2023, the Company recorded a $1.2 million decrease to its cost of goods sold, or $0.11 per diluted share, related to the liquidation of LIFO inventory quantities.\nNote 9 - Property, Plant, and Equipment\nAugust 31,\n($ in thousands)\nOperating property, plant, and equipment:\nLand\n$\n6,144\n$\n5,997\nBuildings\n57,606\n51,014\nMachinery and equipment\n99,466\n93,558\nFurniture and fixtures\n8,807\n7,994\nComputer hardware and software\n26,684\n25,948\nConstruction in progress\n8,238\n10,207\nTotal operating property, plant, and equipment\n206,945\n194,718\nAccumulated depreciation\n(130,923\n)\n(120,816\n)\nTotal operating property, plant, and equipment, net\n76,022\n73,902\nProperty held for lease:\nMachines\n16,398\n16,359\nBarriers\n34,398\n29,904\nTotal property held for lease\n50,796\n46,263\nAccumulated depreciation\n(27,137\n)\n(25,693\n)\nTotal property held for lease, net\n23,659\n20,570\nProperty, plant, and equipment, net\n$\n99,681\n$\n94,472\nDepreciation expense was $13.9 million, $13.5 million, and $12.7 million for fiscal 2023, 2022, and 2021, respectively.\nNote 10 - Goodwill and Other Intangible Assets\nThe carrying amount of goodwill by reportable segment for the year ended August 31, 2023 and August 31, 2022 is as follows:\n($ in thousands)\nIrrigation\nInfrastructure\nTotal\nBalance as of August 31, 2021\n$\n51,811\n$\n16,157\n$\n67,968\nForeign currency translation\n(64\n)\n(774\n)\n(838\n)\nBalance as of August 31, 2022\n51,747\n15,383\n67,130\nAcquisition of FieldWise\n15,589\n-\n15,589\nForeign currency translation\nBalance as of August 31, 2023\n$\n67,371\n$\n15,750\n$\n83,121\nThe components of the Companys identifiable intangible assets and their weighted average remaining life at August 31, 2023 and 2022 are included in the table below.\nAugust 31,\nWeighted\nGross\nWeighted\nGross\naverage\ncarrying\nAccumulated\naverage\ncarrying\nAccumulated\n($ in thousands)\nyears\namount\namortization\nyears\namount\namortization\nDefinite lived intangible assets:\nPatents and developed technology\n3.1\n$\n28,658\n$\n(24,402\n)\n3.3\n$\n26,329\n$\n(24,106\n)\nCustomer relationships\n6.8\n26,030\n(14,506\n)\n2.1\n17,401\n(12,578\n)\nIndefinite lived intangible assets:\nTradenames\nN/A\n11,939\n-\nN/A\n11,162\n-\nTotal\n5.7\n$\n66,627\n$\n(38,908\n)\n2.7\n$\n54,892\n$\n(36,684\n)\nAmortization expense for amortizable intangible assets was $2.0 million, $2.0 million, and $2.2 million for fiscal 2023, 2022, and 2021, respectively.\nFuture estimated amortization of intangible assets for the next five years is as follows:\nFiscal years\n$ in thousands\n$\n2,881\n2,089\n1,456\n1,456\n1,421\nThereafter\n6,477\n$\n15,780\nThe Company updated its impairment evaluation of goodwill and intangible assets with indefinite lives at August 31, 2023. No impairment losses were indicated as a result of the annual impairment testing for fiscal 2023, 2022 and 2021.\nNote 11 - Other Current Liabilities\nAugust 31,\n($ in thousands)\nOther current liabilities:\nCompensation and benefits\n$\n24,957\n$\n23,148\nContract liabilities\n18,800\n29,494\nWarranties\n14,535\n14,080\nDealer related liabilities\n9,629\n8,396\nTax related liabilities\n9,187\n7,820\nOperating lease liabilities\n3,028\n3,159\nDeferred revenue - lease\n2,830\n1,064\nAccrued environmental liabilities\n1,287\n4,179\nAccrued insurance\n1,163\n1,193\nOther\n6,188\n8,151\nTotal other current liabilities\n$\n91,604\n$\n100,684\nNote 12 - Credit Arrangements\nSenior Notes. The Company has outstanding $115.0 million in aggregate principal amount of unsecured Senior Notes, Series A (the Senior Notes). The entire principal of the Senior Notes is due and payable on February 19, 2030. Interest on the Senior Notes is payable semi-annually at a fixed annual rate of 3.82 percent and borrowings under the Senior Notes are unsecured. The Company used the proceeds of the sale of the Senior Notes for general corporate purposes, including acquisitions and dividends.\nRevolving Credit Facility. The Company has outstanding a $50.0 million unsecured Amended and Restated Revolving Credit Facility (the Revolving Credit Facility) with Wells Fargo Bank, National Association (Wells Fargo) expiring August 26, 2026. The Company intends to use borrowings under the Revolving Credit Facility for working capital purposes and to fund future acquisitions. At August 31, 2023 and 2022, the Company had no outstanding borrowings under the Revolving Credit Facility. The amount of borrowings available at any time under the Revolving Credit Facility is reduced by the amount of standby letters of credit issued by Wells Fargo then outstanding. At August 31, 2023, the Company had the ability to borrow up to $50.0 million under the Revolving Credit Facility. The Revolving Credit Facility may be increased by up to an additional $50.0 million at any time, subject to additional commitment approval. The Revolving Credit Facility was amended in 2021, which changed the benchmark rate from the London Interbank Offered Rate (LIBOR) to the Secured Overnight Financing Rate (SOFR). Borrowings under the Revolving Credit Facility bear interest at a variable rate equal to the SOFR plus a margin of between 100 and 210 basis points depending on the Companys leverage ratio then in effect (which resulted in a variable rate of 6.66 percent at August 31, 2023), subject to adjustment as set forth in the loan documents for the Revolving Credit Facility. Interest is paid on a monthly to quarterly basis depending on loan type. The Company currently pays an annual commitment fee on the unused portion of the Revolving Credit Facility. The fee is between 0.125 percent and 0.2 percent (0.125 percent at August 31, 2023) on the unused balance depending on the Companys leverage ratio then in effect.\nBorrowings under the Revolving Credit Facility have equal priority with borrowings under the Companys Senior Notes. Each of the credit arrangements described above include certain covenants relating primarily to the Companys financial condition. These financial covenants include a funded debt to EBITDA leverage ratio and an interest coverage ratio. In the event that the loan documents for the Revolving Credit Facility were to require the Company to comply with any financial covenant that is not already included or is more restrictive than what is already included in the arrangement governing the Senior Notes, then such covenant shall be deemed incorporated by reference into the Senior Notes for the benefit of the holders of the Senior Notes. Upon the occurrence of any event of default of these covenants, including a change in control of the Company, all amounts outstanding thereunder may be declared to be immediately due and payable. At August 31, 2023 and 2022, the Company was in compliance with all financial loan covenants contained in its credit arrangements in place as of each of those dates.\nSeries 2006A Bonds. Elecsys International, LLC, a wholly owned subsidiary of the Company, has outstanding $0.7 million in principal amount of industrial revenue bonds that were issued in 2006 (the Series 2006A Bonds). Principal and interest on the Series 2006A Bonds are payable monthly through maturity on September 1, 2026. The interest rate is adjustable every five years based on the yield of the 5-year United States Treasury Notes, plus 0.45 percent (1.72 percent as of August 31, 2023 through maturity). The obligations under the Series 2006A Bonds are secured by a first priority security interest in certain real estate.\nLong-term debt consists of the following:\nAugust 31,\n($ in thousands)\nSeries A Senior Notes\n$\n115,000\n$\n115,000\nElecsys Series 2006A Bonds\nTotal debt\n115,710\n115,931\nLess current portion\n(226\n)\n(222\n)\nLess debt issuance costs\n(320\n)\n(368\n)\nTotal long-term debt\n$\n115,164\n$\n115,341\nPrincipal payments due on the debt are as follows:\nDue within\n$ in thousands\n1 year\n$\n2 years\n3 years\n4 years\nThereafter\n115,000\n$\n115,710\nNote 13 - Leases\nThe Company, as lessee, has operating leases primarily for office space, manufacturing facilities, equipment, and vehicles. The Company determines if a contract is or contains a lease at the inception of the contract based on whether the contract conveys the right to control the use of an identified asset over a period of time in exchange for consideration. The Company considers disclosures related to its transactions as a lessor to not be material and has omitted such disclosures.\nThe Company elected, for all classes of underlying assets, to not separate lease and non-lease components and instead will treat the lease agreement as a single lease component for all asset classes.\nShort-term operating leases, which have an initial expected term of twelve months or less, are not recorded on the consolidated balance sheet. Such fixed lease payments are recognized within the consolidated statement of earnings on a straight-line basis over the lease term. Any variable payments associated with short-term operating leases are recognized within the consolidated statement of earnings as they are incurred. The Company did not recognize any expense for such leases during the twelve months ended August 31, 2023 and 2022.\nMany of the Companys leases contain renewal or extension options. The Company includes all renewal or extension periods that it is reasonably certain to exercise at lease commencement within the measurement of the ROU asset and lease liability.\nThe Companys lease portfolio consists of operating leases which are included in operating lease ROU assets and operating lease liabilities in the consolidated balance sheet. Operating lease ROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. To calculate the present value of future lease payments, the Company uses an incremental borrowing rate that estimates a collateralized rate based on the expected term of the lease.\nLease cost and other information related to the Companys operating leases are as follows:\nAugust 31,\n($ in thousands)\nOperating lease cost (cost resulting from lease payments)\n$\n4,114\n$\n5,573\nVariable lease cost (cost excluded from lease payments)\nTotal lease cost\n$\n4,650\n$\n6,125\nOperating cash outflows from operating leases\n$\n4,205\n$\n5,198\nWeighted average lease term - operating leases\n8.3 years\n9.0 years\nWeighted average discount rate - operating leases\n3.5\n%\n3.3\n%\nSupplemental balance sheet information related to operating leases are as follows:\nAugust 31,\n($ in thousands)\nClassification\nOperating lease ROU assets\nOperating lease right-of-use assets\n$\n17,036\n$\n19,181\nOperating lease short-term liabilities\nOther current liabilities\n3,028\n3,159\nOperating lease long-term liabilities\nOperating lease liabilities\n17,689\n19,810\nTotal lease liabilities\n$\n20,717\n$\n22,969\nThe minimum lease payments under operating leases expiring subsequent to August 31, 2023 are as follows:\nFiscal year ending\n$ in thousands\n$\n3,715\n3,395\n3,086\n2,660\n1,913\nThereafter\n9,397\nTotal lease payments\n24,166\nLess: interest\n3,449\nPresent value of lease liabilities\n$\n20,717\nNote 14 - Fair Value Measurements\nThe following table presents the Companys financial assets and liabilities measured at fair value, based upon the level within the fair value hierarchy in which the fair value measurements fall, as of August 31, 2023 and 2022, respectively:\nAugust 31, 2023\n($ in thousands)\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents\n$\n160,755\n$\n-\n$\n-\n$\n160,755\nMarketable securities:\nCorporate bonds\n-\n4,095\n-\n4,095\nU.S. treasury securities\n-\n1,461\n-\n1,461\nDerivative asset\n-\n1,672\n-\n1,672\nDerivative liability\n-\n(457\n)\n-\n(457\n)\nAugust 31, 2022\n($ in thousands)\nLevel 1\nLevel 2\nLevel 3\nTotal\nCash and cash equivalents\n$\n105,048\n$\n-\n$\n-\n$\n105,048\nMarketable securities:\nCorporate bonds\n-\n9,668\n-\n9,668\nU.S. treasury securities\n-\n1,792\n-\n1,792\nDerivative asset\n-\n5,505\n-\n5,505\nThe carrying value of long-term debt (including current portion) was $115.7 million and $115.9 million at August 31, 2023 and 2022, respectively. The fair value of this debt was estimated to be $102.0 million and $103.6 million as of August 31, 2023 and 2022, respectively, based on current market rates as of the respective year-ends.\nThe Company enters into derivative instrument agreements, to manage risk in connection with changes in foreign currency. The Company only enters into derivative instrument agreements with counterparties who have highly rated credit and does not enter into derivative instrument agreements for trading or speculative purposes. The fair values are based on inputs other than quoted prices that are observable for the asset or liability and are determined by standard calculations and models that use readily observable market parameters. These inputs include foreign currency exchange rates and interest rates. Industry standard data providers are the primary source for forward and spot rate information for both interest rates and foreign currency exchange rates.\nOn June 12, 2023, the Company entered into a fixed-to-fixed cross currency swap with a notional amount of $25.0 million, or €23.3 million, that is set to mature on June 12, 2026. The Company elected the spot method for designating this contract as a net investment hedge. The decrease in fair value of this contract during the period was $0.3 million, which is net of tax impact of $0.1 million, and is reported in accumulated other comprehensive loss on the condensed consolidated balance sheets. The fair value of this contract as of August 31, 2023, is disclosed in the table above, and is recorded within other noncurrent assets on the consolidated balance sheets.\nOn March 28, 2022, the Company entered into a fixed-to-fixed cross currency swap with a notional amount of $50.0 million, or €45.6 million, that is set to mature on March 30, 2027. The Company elected the spot method for designating this contract as a net investment hedge. The decrease in fair value of this contract during the period was $2.9 million, which is net of tax impact of $0.9 million, and is reported in accumulated other comprehensive loss on the consolidated balance sheets. The fair value of this contract as of August 31, 2023, is disclosed in the table above, and is recorded within other noncurrent assets on the consolidated balance sheets.\nDuring fiscal 2023, the Company settled foreign currency forward contracts resulting in a net loss of $0.1 million which were recorded in the consolidated statements of earnings. At August 31, 2023 the Company had an outstanding foreign currency forward contract to sell a notional amount of 225.3 million South African rand at fixed prices to settle during the next fiscal quarter. The Companys foreign currency forward contracts do not qualify as hedges of a net investment in foreign operations.\nNote 15 - Commitments and Contingencies\nIn the ordinary course of its business operations, the Company enters into arrangements that obligate it to make future payments under contracts such as lease agreements. Additionally, the Company is involved, from time to time, in commercial litigation, employment disputes, administrative proceedings, business disputes and other legal proceedings. The Company has established accruals for certain proceedings based on an assessment of probability of loss. The Company believes that any such currently-pending proceedings are either covered by insurance or would not have a material effect on the business or its consolidated financial statements if decided in a manner that is unfavorable to the Company. Such proceedings are exclusive of environmental remediation matters which are discussed separately below.\nInfrastructure Products Litigation\nThe Company is currently defending a number of product liability lawsuits arising out of vehicle collisions with highway barriers incorporating the Companys X-Lite® end terminal. Despite the September 2018 reversal of a sizable judgment against a competitor, the Company expects that the significant attention brought to the infrastructure products industry by the original judgment may lead to additional lawsuits being filed against the Company and others in the industry.\nThe Company, certain of its subsidiaries, and certain third parties which originally designed the X-Lite end terminal have also been named in a lawsuit filed on June 9, 2020 in the Circuit Court of Cole County, Missouri by Missouri Highways and Transportation Commission (MHTC). MHTC alleges, among other things, that the X-Lite end terminal was defectively designed and failed to perform as designed, intended, and advertised, leading to MHTCs removal and replacement of X-Lite end terminals from Missouris roadways. MHTC alleges strict liability (defective design and failure to warn), negligence, breach of express warranties, breach of implied warranties (merchantability and fitness for a particular purpose), fraud, and public nuisance. MHTC seeks compensatory damages, interest, attorneys fees, and punitive damages.\nThe Company believes it has meritorious factual and legal defenses to each of the lawsuits discussed above and is prepared to vigorously defend its interests. Based on the information currently available to the Company, the Company does not believe that a loss is probable in any of these lawsuits; therefore, no accrual has been included in the Companys consolidated financial statements. While it is reasonably possible that a loss may be incurred, the Company is unable to estimate a range of potential loss due to the complexity and current status of these lawsuits. However, the Company maintains insurance coverage to mitigate the impact of adverse exposures in these lawsuits and does not expect that these lawsuits will have a material adverse effect on its business or its consolidated financial statements.\nIn June 2019, the Company was informed by letter that the Department of Justice, Civil Division and U.S. Attorneys Office for the Northern District of New York, with the assistance of the Department of Transportation, Office of Inspector General, are conducting an investigation of the Company relating to the Companys X-Lite end terminal and potential violations of the federal civil False Claims Act. Depending on the outcome of this matter, there could be a material adverse effect on the Companys business or its consolidated financial statements. Given the current posture of the matter, the Company is unable to estimate a range of potential loss, if any, or to express an opinion regarding the ultimate outcome.\nEnvironmental Remediation\nIn previous years, the Company committed to a plan to remediate environmental contamination of the groundwater at and adjacent to its Lindsay, Nebraska facility (the site). The current estimated aggregate accrued cost of $11.5 million is based on consideration of remediation options which the Company believes could be successful in meeting the long-term regulatory requirements of the site. The Company submitted a revised remedial alternatives evaluation report to the Environmental Protection Agency (EPA) and the Nebraska Department of Environment and Energy (the NDEE) in August 2020 to review remediation alternatives and proposed plans for the site. While the proposed remediation plan is preliminary and has not been approved by the EPA or the NDEE, they have approved an in situ thermal remediation pilot study that was conducted by the Company at a specific location on the site. The Company commenced implementation of the pilot program in the second half of calendar 2022 and completed the pilot program in the fourth quarter of fiscal 2023. A final report is expected to be submitted to the EPA and NDEE by the end of calendar 2023. Of the total liability as of both August 31, 2023 and 2022, $8.1 million and $11.0 million, respectively, was calculated on a discounted basis using a discount rate of 1.2%, which represents a risk-free rate. This discounted\nportion of the liability amounts to $9.1 million and $12.4 million on an undiscounted basis at August 31, 2023 and 2022, respectively.\nThe Company accrues the anticipated cost of investigation and remediation when the obligation is probable and can be reasonably estimated. While the plan has not been formally approved by the EPA, the Company believes the current accrual is a good faith estimate of the long-term cost of remediation at this site; however, the estimate of costs and their timing could change as a result of a number of factors, including but not limited to (1) EPA input on the proposed remediation plan and any changes which the EPA may subsequently require, (2) refinement of cost estimates and length of time required to complete remediation and post-remediation operations and maintenance, (3) effectiveness of the technology chosen in remediation of the site as well as changes in technology that may be available in the future, and (4) unforeseen circumstances existing at the site. As a result of these factors, the actual amount of costs incurred by the Company in connection with the remediation of contamination of its Lindsay, Nebraska site could exceed the amounts accrued for this expense at this time. While any revisions could be material to the operating results of any fiscal quarter or fiscal year, the Company does not expect such additional expenses would have a material adverse effect on its liquidity or financial condition.\nThe following table summarizes the environmental remediation liability classifications included in the consolidated balance sheets as of August 31, 2023 and 2022:\n($ in thousands)\nAugust 31,\nBalance sheet location\nOther current liabilities\n$\n1,287\n$\n4,179\nOther noncurrent liabilities\n10,175\n10,967\nTotal environmental remediation liabilities\n$\n11,462\n$\n15,146\nNote 16 - Retirement Plans\nThe Company has defined contribution profit-sharing plans covering substantially all of its full-time U.S. employees. Participants may voluntarily contribute a percentage of compensation, but not in excess of the maximum allowed under the Internal Revenue Code. The plans provide for a matching contribution by the Company. The Companys total contributions charged to expense under the plans were $1.3 million, $1.2 million, and $1.3 million for the years ended August 31, 2023, 2022, and 2021, respectively.\nA supplementary non-qualified, non-funded retirement plan for five former executives is also maintained. Plan benefits are based on the executives average total compensation during the three highest compensation years of employment. This unfunded supplemental retirement plan is not subject to the minimum funding requirements of ERISA. While the plan is unfunded, the Company has purchased life insurance policies on certain former executives named in this supplemental retirement plan to provide funding for this liability. The cash surrender values of these insurance policies are recorded as other noncurrent assets.\nAs of August 31, 2023 and 2022, the funded status of the supplemental retirement plan was recorded in the consolidated balance sheets. The Company utilizes an August 31 measurement date for plan obligations related to the supplemental retirement plan. As this is an unfunded retirement plan, the funded status is equal to the benefit obligation.\nThe funded status of the plan and the net amount recognized in the accompanying balance sheets as of August 31 is as follows:\nAugust 31,\n($ in thousands)\nChange in benefit obligation:\nBenefit obligation at beginning of year\n$\n5,422\n$\n6,284\nInterest cost\nActuarial gain\n(191\n)\n(488\n)\nBenefits paid\n(530\n)\n(530\n)\nBenefit obligation at end of year\n$\n4,912\n$\n5,422\nAmounts recorded in the consolidated balance sheets for the pension benefit obligation consist of:\nAugust 31,\n($ in thousands)\nOther current liabilities\n$\n$\nOther non-current liabilities\n4,382\n4,892\nNet amount recognized\n$\n4,912\n$\n5,422\nThe before-tax amounts recognized in accumulated other comprehensive loss consists of:\nAugust 31,\n($ in thousands)\nNet actuarial loss\n$\n(2,591\n)\n$\n(2,993\n)\nFor the years ended August 31, 2023 and 2022, the Company assumed a discount rate of 5.0 percent and 4.1 percent, respectively, for the determination of the liability. The assumptions used to determine benefit obligations and costs are selected based on current and expected market conditions. The discount rate is based on a hypothetical portfolio of long-term corporate bonds with cash flows approximating the timing of expected benefit payments.\nFor the years ended August 31, 2023, 2022, and 2021, the Company assumed a discount rate of 4.1 percent, 2.6 percent, and 2.2 percent, respectively, for the determination of the net periodic benefit cost. The components of the net periodic benefit cost for the supplemental retirement plan recorded within other income (expense) on the consolidated statement of earnings are as follows:\nFor the years ended August 31,\n($ in thousands)\nInterest cost\n$\n$\n$\nNet amortization and deferral\nTotal\n$\n$\n$\nThe estimated actuarial loss for the supplemental retirement plan that will be amortized, on a pre-tax basis, from accumulated other comprehensive loss into net periodic benefit cost during fiscal 2024 will be $0.2 million.\nThe Companys future annual contributions to the supplemental retirement plan will be equal to expected net benefit payments since the plan is unfunded. The following net benefit payments are expected to be paid:\nFiscal years\n$ in thousands\n$\nThereafter\n2,466\n$\n4,912\nNote 17 - Warranties\nProduct Warranties\nThe Company generally warrants its products against certain manufacturing and other defects and estimates the amount of warranty accrual based on various factors, including historical warranty costs, current claim trends, and operating revenue. These product warranties are provided for specific periods and/or usage of the product. The accrued product warranty costs are for a combination of specifically identified items and other incurred, but not identified, items based primarily on historical experience of actual warranty claims. This reserve is classified within other current liabilities.\nThe following tables provide the changes in the Companys product warranties:\nFor the years ended August 31,\n($ in thousands)\nProduct warranty accrual balance, beginning of period\n$\n14,080\n$\n12,736\nLiabilities accrued for warranties during the period\n10,911\n10,931\nWarranty claims paid during the period\n(10,456\n)\n(9,393\n)\nChanges in estimates\n-\n(194\n)\nProduct warranty accrual balance, end of period\n$\n14,535\n$\n14,080\nWarranty costs were $10.9 million, $10.7 million, and $7.4 million for fiscal 2023, 2022, and 2021, respectively.\nNote 18 - Industry Segment Information\nThe Company manages its business activities in two reportable segments: Irrigation and Infrastructure. The accounting policies of the two reportable segments are the same as those described in Note 1, Description of Business and Significant Accounting Policies. The Company evaluates the performance of its reportable segments based on segment sales, gross profit, and operating income, with operating income for segment purposes excluding unallocated corporate general and administrative expenses, interest income, interest expense, other income and expenses, and income taxes. Operating income for segment purposes does include general and administrative expenses, selling expenses, engineering and research expenses and other overhead charges directly attributable to the segment. There are no inter-segment sales included in the amounts disclosed.\nIrrigation\nThis reporting segment includes the manufacture and marketing of center pivot, lateral move, and hose reel irrigation systems and large diameter steel tubing, as well as various innovative technology solutions such as GPS positioning and guidance, variable rate irrigation, remote irrigation management and scheduling technology, irrigation consulting and design, and industrial internet of things, or \"IIoT\", solutions. The irrigation reporting segment consists of one operating segment.\nInfrastructure\nThis reporting segment includes the manufacture and marketing of moveable barriers, specialty barriers, crash cushions and end terminals, and road marking and road safety equipment. The infrastructure reporting segment consists of one operating segment.\nThe Company has no single major customer representing ten percent or more of its total revenues during fiscal 2023, 2022, or 2021.\nSummarized financial information concerning the Companys reportable segments is shown in the following tables:\n($ in thousands)\nOperating revenues:\nIrrigation:\nNorth America\n$\n309,538\n$\n355,683\n$\n273,871\nInternational\n276,493\n310,146\n197,487\nIrrigation total\n586,031\n665,829\n471,358\nInfrastructure\n88,053\n104,914\n96,288\nTotal operating revenues\n$\n674,084\n$\n770,743\n$\n567,646\nOperating income:\nIrrigation\n$\n121,969\n$\n105,763\n$\n63,181\nInfrastructure\n12,067\n18,328\n20,174\nCorporate\n(31,852\n)\n(29,448\n)\n(29,248\n)\nTotal operating income\n102,184\n94,643\n54,107\nTotal other expense\n(1,809\n)\n(6,775\n)\n(3,721\n)\nEarnings before income taxes\n$\n100,375\n$\n87,868\n$\n50,386\nTotal capital expenditures:\nIrrigation\n$\n13,043\n$\n10,679\n$\n19,188\nInfrastructure\n5,287\n3,798\n6,866\nCorporate\n1,118\n$\n18,775\n$\n15,595\n$\n26,511\nDepreciation and amortization:\nIrrigation\n$\n12,834\n$\n13,011\n$\n12,245\nInfrastructure\n4,023\n3,781\n3,748\nCorporate\n2,425\n3,386\n3,183\n$\n19,282\n$\n20,178\n$\n19,177\nSummarized financial information concerning the Companys geographical areas is shown in the following tables.\nFor the years ended August 31,\n($ in thousands)\nRevenues\n% of total\nRevenues\n% of total\nRevenues\n% of total\nUnited States\n$347,238\n$394,080\n$307,313\nInternational\n326,846\n376,663\n260,333\nTotal revenues\n$674,084\n$770,743\n$567,646\nFor the years ended August 31,\n($ in thousands)\nLong-lived\ntangible\nassets\n% of total\nLong-lived\ntangible\nassets\n% of total\nLong-lived\ntangible\nassets\n% of total\nUnited States\n$\n76,428\n$\n70,643\n$\n68,526\nInternational\n23,253\n23,829\n23,471\nTotal long-lived assets\n$\n99,681\n$\n94,472\n$\n91,997\nTotal assets by reportable segment are not disclosed because such information is not used by the Company to allocate resources or evaluate performance.\nNote 19 - Share-Based Compensation\nShare-Based Compensation Program\nShare-based compensation is designed to reward employees for their long-term contributions to the Company and provide incentives for them to remain with the Company. The number and frequency of share grants are based on competitive practices, operating results of the Company, and individual performance. As of August 31, 2023, the Companys share-based compensation plan was the 2015 Long-Term Incentive Plan (the 2015 Plan). The 2015 Plan was approved by the shareholders of the Company, and became effective on January 26, 2015, and replaced the Companys 2010 Long Term Incentive Plan. At August 31, 2023, the Company had share-based awards outstanding under the 2015 Plan.\nThe 2015 Plan provides for awards of stock options, restricted shares, restricted stock units, stock appreciation rights, performance shares and performance stock units to employees and non-employee directors of the Company. The maximum number of shares as to which stock awards may be granted under the 2015 Plan is 626,968 shares, exclusive of any forfeitures from the 2010 Long-Term Incentive Plan. At August 31, 2023, 217,146 shares of common stock (including forfeitures from prior plans) remained available for issuance under the 2015 Plan. All stock awards will be counted against the 2015 Plan in a 1 to 1 ratio. The 2015 Plan also limits the total awards that may be made to any individual.\nShare-Based Compensation Information\nThe following table summarizes share-based compensation expense for fiscal 2023, 2022, and 2021:\nFor the years ended August 31,\n($ in thousands)\nShare-based compensation expense included in cost of\noperating revenues\n$\n$\n$\nEngineering and research\nSelling\nGeneral and administrative\n5,651\n4,637\n5,524\nShare-based compensation expense included in\noperating expenses\n6,515\n5,424\n6,270\nTotal share-based compensation expense\n6,698\n5,681\n6,528\nTax benefit\n(1,574\n)\n(1,335\n)\n(1,534\n)\nShare-based compensation expense, net of tax\n$\n5,124\n$\n4,346\n$\n4,994\nAs of August 31, 2023, there was $8.2 million pre-tax of total unrecognized compensation cost related to non-vested share-based compensation arrangements which is expected to be recognized over a weighted average period of 1.8 years.\nStock Options - Stock option awards have an exercise price equal to the closing price on the date of grant, expire no later than ten years from the date of grant and vest evenly over a three or four year period. The fair value of stock option awards is estimated using the Black-Scholes option pricing model. The table below shows the annual weighted average assumptions used for valuation purposes.\nGrant year\nFiscal 2023\nFiscal 2022\nFiscal 2021\nRisk-free interest rate\n4.4\n%\n1.2\n%\n0.5\n%\nDividend yield\n0.9\n%\n0.9\n%\n1.1\n%\nExpected life (years)\nVolatility\n35.7\n%\n33.8\n%\n32.8\n%\nWeighted average grant-date fair value of options granted\n$\n55.53\n$\n41.80\n$\n31.38\nThe risk-free rate is based on the U.S. Treasury yield curve in effect at the time of grant; the dividend yield is calculated as the ratio of dividends paid per share of common stock to the stock price on the date of grant; the expected life is based on historical and expected exercise behavior; and volatility is based on the historical volatility of the Companys stock price over the expected life of the option.\nThe following table summarizes stock option activity for fiscal 2023:\nNumber of\nstock options\nAverage\nexercise price\nAverage\nremaining\ncontractual\nterm (years)\nAggregate\nintrinsic value\n(thousands)\nStock options outstanding at August 31, 2022\n97,140\n$\n106.80\n7.0\n$\n5,203\nGranted\n21,743\n156.16\nExercised\n(413\n)\n76.37\nForfeited/cancelled\n-\n-\n-\nStock options outstanding at August 31, 2023\n118,470\n$\n115.96\n6.6\n$\n2,139\nStock options exercisable at August 31, 2023\n76,143\n$\n99.05\n5.5\n$\n2,072\nThere were 19,617, 47,222, and 38,954 outstanding stock options that vested during fiscal 2023, 2022, and 2021, respectively. Additional information regarding stock option exercises is summarized in the table below.\nFor the years ended August 31,\n($ in thousands)\nIntrinsic value of stock options exercised\n$\n$\n1,737\n$\n2,125\nCash received from stock option exercises\n$\n$\n2,894\n$\n3,965\nTax benefit realized from stock option exercises\n$\n$\n$\nWeighted average grant-date fair value of stock options vested\n$\n40.66\n$\n34.19\n$\n25.95\nRestricted stock units - The restricted stock units have a grant-date fair value equal to the fair market value of the underlying stock on the grant date less present value of expected dividends. The restricted stock units granted to employees vest over a three year period at approximately 33 percent per year. The restricted stock units granted to non-employee directors generally vest over a nine month period.\nThe following table summarizes restricted stock unit activity for fiscal 2023:\nNumber of\nrestricted\nstock units\nWeighted\naverage grant-\ndate fair value\nRestricted stock units outstanding at August 31, 2022\n44,251\n$\n126.50\nGranted\n24,123\n151.38\nVested\n(24,342\n)\n122.06\nForfeited / Cancelled\n(2,460\n)\n140.26\nRestricted stock units outstanding at August 31, 2023\n41,572\n$\n108.54\nRestricted stock units are generally settled with the issuance of shares with the exception of certain restricted stock units awarded to internationally-based employees that are settled in cash. At August 31, 2023, 2022, and 2021, outstanding restricted stock units included 4,039, 4,412, and 4,656 units, respectively, that will be settled in cash. The fair value of restricted stock units that vested during the period was $3.7 million and $4.1 million for each of the years ended August 31, 2023 and 2022, respectively. Share issuances are presented net of share repurchases to cover payroll taxes of $2.5 million, $1.2 million, and $1.3 million for each of the years ended August 31, 2023, 2022, and 2021, respectively.\nPerformance stock units - The performance stock units have a grant-date fair value equal to the fair market value of the underlying stock on the grant date less present value of expected dividends. The performance stock units granted to employees cliff vest after a three year period and a specified number of shares of common stock will be awarded under the terms of the performance stock units, if performance measures relating to revenue growth and a return on net assets are achieved.\nThe table below summarizes performance stock unit activity for fiscal 2023:\nNumber of\nperformance\nstock units\nWeighted\naverage grant-\ndate fair value\nPerformance stock units outstanding at August 31, 2022\n32,358\n$\n127.78\nGranted\n14,496\n173.17\nVested\n(9,344\n)\n102.28\nForfeited / cancelled\n-\n-\nPerformance stock units outstanding at August 31, 2023\n37,510\n$\n151.67\nPerformance stock units outstanding as of August 31, 2023 and issued during fiscal 2023, 2022, and 2021 include performance goals based on a return on invested capital and total shareholder return (\"TSR\") relative to the Companys peers during the performance period. The awards actually earned will range from zero to two hundred percent of the targeted number of performance stock units and will be paid in shares of common stock. Shares earned will be distributed upon vesting on the first day of November following the end of the three-year performance period. For the return on invested capital portion of the award, the Company is accruing compensation expense based on the estimated number of shares expected to be issued utilizing the most current information available to the Company at the date of the financial statements. For the TSR portion of the award, compensation expense is recorded ratably over the three-year term of the award based on the estimated grant date fair value. In fiscal 2023 and 2022 performance stock units that vested represented 18,688 and 18,998, respectively, actual shares of common stock issued. In fiscal 2021, no shares were issued related to performance stock units.\nThe fair value of the TSR portion of the awards granted in fiscal 2023, 2022, and 2021 was estimated at the grant date using a Monte Carlo simulation model which included the following assumptions:\nGrant year\nFiscal 2023\nFiscal 2022\nFiscal 2021\nExpected term (years)\nRisk-free interest rate\n4.5\n%\n0.7\n%\n0.2\n%\nVolatility\n38.6\n%\n39.1\n%\n38.6\n%\nDividend yield\n0.9\n%\n0.9\n%\n1.2\n%\nNote 20 - Share Repurchases\nThe Companys Board of Directors authorized a share repurchase program of up to $250.0 million of common stock with no expiration date. Under the program, shares may be repurchased in privately negotiated and/or open market transactions as well as under formalized trading plans in accordance with the guidelines specified under Rule 10b5-1 of the Securities Exchange Act of 1934, as amended. There were no shares repurchased during the twelve months ended August 31, 2023, 2022, and 2021. The remaining amount available under the repurchase program was $63.7 million as of August 31, 2023. ITEM 9 - Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot applicable. ITEM 9A - Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this report, the Company carried out an evaluation, under the supervision and with the participation of the Companys management, including the Companys Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended. The Companys disclosure controls and procedures are designed to ensure that information required to be disclosed in the reports that are filed or submitted under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission and to ensure the information required to be disclosed is accumulated and communicated to management, including principal executives and financial officers, as appropriate to allow timely decisions regarding required disclosures. Based upon that evaluation, the Companys Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures were effective as of the end of the period covered by this report.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. The Companys internal control system was designed to provide reasonable assurance to the Companys management and board of directors regarding the preparation and fair presentation of published financial statements.\nThe Company acquired FieldWise, LLC, during fiscal 2023, which management excluded from its assessment of the effectiveness of the internal control over financial reporting as of August 31, 2023. FieldWise, LLC's internal control over financial reporting related to the Company's financial statements for the year ended August 31, 2023 is associated with less than 1% of consolidated revenues and 4% of total assets.\nManagement has assessed the effectiveness of the Companys internal control over financial reporting as of August 31, 2023, based on the criteria for effective internal control described in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on its assessment, management concluded that the Companys internal control over financial reporting was effective as of August 31, 2023.\nThe Audit Committee has engaged KPMG LLP, the independent registered public accounting firm that audited the consolidated financial statements included in this Annual Report on Form 10-K, to attest to and report on managements evaluation of the Companys internal control over financial reporting. The report of KPMG LLP is included herein.\nChanges in Internal Control over Financial Reporting\nThere were no changes in the Companys internal controls over financial reporting that occurred during the quarter ended August 31, 2023 that materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors\nLindsay Corporation:\nOpinion on Internal Control Over Financial Reporting\nWe have audited Lindsay Corporation and subsidiaries' (the Company) internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of August 31, 2023 and August 31, 2022, the related consolidated statements of earnings, comprehensive income, shareholders equity, and cash flows for each of the years in the three-year period ended August 31, 2023, and the related notes and financial statement schedules (collectively, the consolidated financial statements), and our report dated October 19, 2023 expressed an unqualified opinion on those consolidated financial statements.\nThe Company acquired Fieldwise, LLC during fiscal 2023, and management excluded from its assessment of the effectiveness of the Companys internal control over financial reporting as of August 31, 2023, Fieldwise, LLCs internal control over financial reporting associated with less than 1% of consolidated revenues and 4% of total assets included in the consolidated financial statements of the Company as of and for the year ended August 31, 2023. Our audit of internal control over financial reporting of the Company also excluded an evaluation of the internal control over financial reporting of Fieldwise, LLC.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nOmaha, Nebraska\nOctober 19, 2023 ITEM 9B - Other Information\nNone.\nITEM 9C - Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III ITEM 10 - Directors, Executive Officers and Corporate Governance\nThe Company will file with the Securities and Exchange Commission a definitive Proxy Statement for its upcoming Annual Meeting of Stockholders (the Proxy Statement) not later than 120 days after the close of its fiscal year ended August 31, 2023. Information about the Board of Directors required by this Item 10 is incorporated by reference to the discussion responsive thereto under the captions Board of Directors and Committees and Corporate Governance in the Proxy Statement.\nPlease see the information concerning our executive officers contained in Item 1 of Part I herein under the caption Information About Our Executive Officers which is included therein in accordance with the Instruction to Item 401 of Regulation S-K.\nCode of Ethics - The Company has adopted a code of ethics applicable to the Companys principal executive officer and senior financial officers known as the Code of Ethical Conduct (Principal Executive Officer and Senior Financial Officers). The Code of Ethical Conduct (Principal Executive Officer and Senior Financial Officers) is available on the Companys website. In the event that the Company amends or waives any of the provisions of the Code of Ethical Conduct applicable to the principal executive officer and senior financial officers, the Company intends to disclose the same on the Companys website at www.lindsay.com. No waivers were provided for the fiscal year ended August 31, 2023. ITEM 11 - Executive Compensation\nThe information required by this Item 11 is incorporated by reference to the discussion responsive thereto under the captions Compensation Discussion and Analysis, Compensation Committee Report, Pay Ratio Information, Executive Compensation, Compensation of Directors, and Compensation Committee Interlocks and Insider Participation in the Proxy Statement. ITEM 12 - Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this Item 12 relating to security ownership of certain beneficial owners and management is incorporated by reference to the discussion responsive thereto under the caption Voting Securities and Beneficial Ownership Thereof by Principal Stockholders, Directors and Officers in the Proxy Statement.\nEquity Compensation Plan Information - The following equity compensation plan information summarizes plans and securities approved by security holders as of August 31, 2023 (there were no equity compensation plans not approved by security holders as of August 31, 2023):\n(a)\n(b)\n(c)\nPlan category\nNumber of securities to\nbe issued upon exercise\nof outstanding options,\nwarrants, and rights\nWeighted-average\nexercise price of\noutstanding options,\nwarrants, and rights\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation plans\n(excluding securities\nreflected in column (a))\nEquity compensation plans\napproved by security holders (1) (2)\n193,513\n$\n115.96\n217,146\nTotal\n193,513\n$\n115.96\n217,146\n(1)Plans approved by stockholders include the Companys 2010 and 2015 Long-Term Incentive Plans. While certain share-based awards remain outstanding under the Companys 2010 Long-Term Incentive Plan, no future equity compensation awards may be granted under such plan.\n(2)Column (a) includes (i) 37,510 shares that could be issued under performance stock units (PSU) outstanding at August 31, 2023, and (ii) 37,533 shares that could be issued under restricted stock units (RSU) outstanding at August 31, 2023. The PSUs are earned and Common Stock issued if certain predetermined performance criteria are met. Actual shares issued may be equal to, less than or greater than (but not more than 200 percent of) the number of outstanding PSUs included in column (a), depending on actual performance. The RSUs vest and are payable in Common Stock after the expiration of the time periods set forth in the related agreements. Column (b) does not take these PSU and RSU awards into account because they do not have an exercise price. ITEM 13 - Certain Relationships and Related Transactions, and Director Independence\nThe information required by this Item 13 is incorporated by reference to the discussion responsive thereto under the captions Corporate Governance and Related Party Transactions in the Proxy Statement. ITEM 14 - Principal Accounting Fees and Services\nOur independent registered public accounting firm is KPMG LLP, Omaha, Nebraska, Auditor Firm ID: 185. The information required by this Item 14 is incorporated by reference to the discussion responsive thereto under the caption Proposal 2 Ratification of Appointment of Independent Registered Public Accounting Firm in the Proxy Statement.\nPART IV ITEM 15 - Exhibit and Financial Statement Schedules\n(a)(1) Financial Statements.\nThe following financial statements of Lindsay Corporation and Subsidiaries are included in Part II Item 8.\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Statements of Earnings for the years ended August 31, 2023, 2022, and 2021\nConsolidated Statements of Comprehensive Income for the years ended August 31, 2023, 2022, and 2021\nConsolidated Balance Sheets as of August 31, 2023 and 2022\nConsolidated Statements of Shareholders' Equity for the years ended August 31, 2023, 2022, and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2023, 2022, and 2021\nNotes to Consolidated Financial Statements\n36-59\nValuation and Qualifying Accounts - Years ended August 31, 2023, 2022, and 2021\nFinancial statements and schedules other than those listed are omitted for the reason that they are not required, are not applicable or that equivalent information has been included in the financial statements or notes thereto.\n(a)(2) Financial Statement Schedules.\nLindsay Corporation and Subsidiaries\nVALUATION AND QUALIFYING ACCOUNTS\nYears ended August 31, 2023, 2022, and 2021\nAdditions\n(in thousands)\nBalance at\nbeginning\nof period\nCharges to\ncosts and\nexpenses\nCharged to\nother\naccounts\nDeductions\nBalance\nat end of\nperiod\nYear ended August 31, 2023:\nDeducted in the balance sheet from the\nassets to which they apply:\nAllowance for doubtful accounts (1)\n$\n4,118\n-\n(49\n)\n$\n5,048\nDeferred tax asset valuation allowance (2)\n1,203\n-\n-\n(712\n)\nYear ended August 31, 2022:\nDeducted in the balance sheet from the\nassets to which they apply:\nAllowance for doubtful accounts (1)\n$\n3,422\n-\n$\n4,118\nDeferred tax asset valuation allowance (2)\n1,091\n-\n-\n1,203\nYear ended August 31, 2021:\nDeducted in the balance sheet from the\nassets to which they apply:\nAllowance for doubtful accounts (1)\n$\n2,780\n-\n$\n3,422\nDeferred tax asset valuation allowance (2)\n3,218\n-\n2,333\n1,091\n(1)Deductions consist of uncollectible items reserved, less recoveries of items previously reserved.\n(2)Additions and deductions consist of changes to deferred tax assets not expected to be realized.\n(a)(3) Exhibits. The list of the Exhibits in the Exhibit Index is incorporated into this item by reference.\n(b) See Exhibit Index below.\nEXHIBIT INDEX\nExhibit\nNumber\nDescription\n2.1\nAgreement and Plan of Merger, dated November 4, 2014, by and between Lindsay Corporation, Matterhorn Merger Sub, Inc. and Elecsys Corporation, incorporated by reference to Exhibit 2.1 of the Companys Current Report on Form 8-K filed on November 4, 2014.\n3.1\nRestated Certificate of Incorporation of the Company, incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on December 14, 2006.\n3.2\nAmended and Restated By-Laws of the Company, incorporated by reference to Exhibit 3.1 to the Companys Current Report on Form 8-K filed on August 22, 2023.\n4.1\nSpecimen Form of Common Stock Certificate incorporated by reference to Exhibit 4(a) to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2006.\n4.2\nDescription of the Registrants Securities, incorporated by reference to Exhibit 4.2 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2019.\n10.1\nLindsay Corporation 2015 Long-Term Incentive Plan and forms of award agreements, incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2015.\u0086\n10.2\nFirst Amendment to Lindsay Corporation 2015 Long-Term Incentive Plan, incorporated by reference to Exhibit 10.3 to the Company's Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2022.\u0086\n10.3\nLindsay Corporation 2010 Long-Term Incentive Plan and forms of award agreements, incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2011.\u0086\n10.4**\nLindsay Corporation Management Incentive Plan (MIP), 2023 Plan Year, incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2022.\u0086\n10.5\nForm of Indemnification Agreement between the Company and its Officers and Directors, incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on October 19, 2018.\u0086\n10.6\nAmended and Restated Revolving Credit Agreement, dated February 18, 2015, by and between the Company and Wells Fargo Bank, National Association, incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on February 20, 2015.\n10.7\nFirst Amendment to Amended and Restated Revolving Credit Agreement, dated February 28, 2017, by and between the Company and Wells Fargo Bank, National Association, incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on March 1, 2017.\n10.8\nSecond Amendment to Amended and Restated Revolving Credit Agreement, dated May 31, 2019, by and between the Company and Wells Fargo Bank, National Association, incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on June 5, 2019.\n10.9\nThird Amendment to Amended and Restated Revolving Credit Agreement, dated August 26, 2021, by and between the Company and Wells Fargo Bank, National Association, incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on August 31, 2021.\n10.10\nSecond Amended and Restated Line of Credit Note, dated August 26, 2021, by the Company in favor of Wells Fargo Bank, National Association, incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on August 31, 2021.\n10.11\nNote Purchase Agreement, dated as of February 19, 2015, by and among the Company and the purchasers named therein, incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on February 20, 2015.\n10.12\nFirst Amendment to Note Purchase Agreement, dated May 31, 2019, by and among the Company and the noteholders named therein, incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on June 5, 2019.\n10.13\nLindsay Corporation Policy on Payment of Directors Fees and Expenses, incorporated by reference to Exhibit 10.2 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2022.\n10.14\nEmployment Agreement, dated May 9, 2016, between the Company and Randy A. Wood, incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended May 31, 2016.\u0086\n10.15\nEmployment Agreement, dated August 17, 2020 between the Company and Randy A. Wood, incorporated by reference to Exhibit 10.13 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2020.\u0086\n10.16\nAmendment to Employment Agreement, dated November 9, 2020, between the Company and Randy A. Wood, incorporated by reference to Exhibit 10.1 to the Companys Current Report on Form 8-K filed on November 10, 2020.\u0086\n10.17\nEmployment Agreement, dated April 5, 2016, between the Company and Brian L. Ketcham, incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed on April 5, 2016.\u0086\n10.18\nEmployment Agreement, dated May 25, 2018, between the Company and J. Scott Marion, incorporated by reference to Exhibit 10.1 to the Companys Quarterly Report on Form 10-Q for the fiscal quarter ended May 31, 2018.\u0086\n10.19\nEmployment Agreement, dated August 17, 2020, between the Company and Gustavo E. Oberto, incorporated by reference to Exhibit 10.17 to the Companys Annual Report on Form 10-K for the fiscal year ended August 31, 2020. \u0086\n10.20\nConsulting Agreement, dated November 9, 2020, between the Company and Timothy L. Hassinger, incorporated by reference to Exhibit 10.2 to the Companys Current Report on Form 8-K filed on November 10, 2020. \u0086\n10.21\nLindsay Corporation Nonqualified Deferred Compensation Plan, incorporated by reference to Exhibit 10.1 of the Company's Current Report on Form 8-K filed on May 3, 2022.\u0086\n10.22\nLindsay Corporation Nonqualified Deferred Compensation Plan Adoption Agreement, incorporated by reference to Exhibit 10.2 of the Company's Current Report on Form 8-K filed on May 3, 2022.\u0086\n10.23\nLindsay Corporation Directors Nonqualified Deferred Compensation Plan, incorporated by reference to Exhibit 10.4 of the Company's Quarterly Report on Form 10-Q for the fiscal quarter ended November 30, 2023.\n21*\nSubsidiaries of the Company\n23*\nConsent of KPMG LLP\n24*\nThe Power of Attorney authorizing Randy A. Wood to sign the Annual Report on Form 10-K for fiscal 2023 on behalf of non-management directors.\n31.1*\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 18 U.S.C. Section 1350.\n31.2*\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 18 U.S.C. Section 1350.\n32*\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 18 U.S.C. Section 1350.\n101*\nInteractive Data Files pursuant to Rule 405 of Regulation S-T formatted in Inline Extensible Business Reporting Language (\"Inline XBRL\").\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101).\n\u0086 Management contract or compensatory plan or arrangement required to be filed as an exhibit hereto pursuant to Item 15(b) of Form 10-K.\n* Filed herein.\n** Certain confidential portions of this Exhibit were omitted by means of marking such portions with brackets and asterisks because the identified confidential portions (i) are not material and (ii) would be competitively harmful if publicly disclosed.\nITEM 16 - Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on this 19th day of October, 2023.\nLINDSAY CORPORATION\nBy:\n/s/ BRIAN L. KETCHAM\nName:\nBrian L. Ketcham\nTitle:\nSenior Vice President and Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on this 19th day of October, 2023.\n/s/ RANDY A. WOOD\nDirector, President and Chief Executive Officer\nRandy A. Wood\n(Principal Executive Officer)\n/s/ BRIAN L. KETCHAM\nSenior Vice President and Chief Financial Officer\nBrian L. Ketcham\n(Principal Financial Officer and Principal Accounting Officer)\n/s/ ROBERT E. BRUNNER\n(1)\nChairperson of the Board of Directors\nRobert E. Brunner\n/s/ Michael N. Christodolou\n(1)\nDirector\nMichael N. Christodolou\n/s/ PABLO DI SI\n(1)\nDirector\nPablo Di Si\n/s/ IBRAHIM GOKCEN\n(1)\nDirector\nIbrahim Gokcen\n/s/ MARY A. LINDSEY\n(1)\nDirector\nMary A. Lindsey\n/s/ CONSUELO E. MADERE\n(1)\nDirector\nConsuelo E. Madere\n/s/ DAVID B. Rayburn\n(1)\nDirector\nDavid B. Rayburn\n(1) By: /s/ Randy A. Wood\nRandy A. Wood, Attorney-In-Fact"
}