{
    "cik": "836690",
    "company": "INNOVATIVE SOLUTIONS & SUPPORT INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-16",
    "period_of_report": "2022-09-30",
    "sic": "7371",
    "state_of_inc": "PA",
    "state_location": "PA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/836690/0001104659-22-127805-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/836690/000110465922127805/issc-20220930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/836690/0001104659-22-127805.txt",
    "filename": "836690_10K_2022_0001104659-22-127805.htm",
    "content": "Item 1. Business.\nOverview\nInnovative Solutions and Support, Inc. (the Company, IS&S, we or us) was incorporated in Pennsylvania on February 12, 1988. The Company operates in one business segment as a systems integrator that designs, develops, manufactures, sells and services air data equipment, engine display systems, standby equipment, primary flight guidance, autothrottles and cockpit display systems for retrofit applications and original equipment manufacturers (OEMs). The Company supplies integrated Flight Management Systems (FMS), Flat Panel Display Systems (FPDS), FPDS with Autothrottle, air data equipment, Integrated Standby Units (ISU), Standby ISU with Autothrottle Systems and advanced GPS receivers that enable reduced carbon footprint navigation.\nThe Company has continued to position itself as a system integrator, which capability provides the Company with the potential to generate more substantive orders over a broader product base. This strategy, as both a manufacturer and integrator, is designed to leverage the latest technologies developed for the computer and telecommunications industries into advanced and cost-effective solutions for the general aviation, commercial air transport, United States Department of Defense (DoD)/governmental and foreign military markets. This approach, combined with the Companys industry experience, is designed to enable IS&S to develop high-quality products and systems, to reduce product time to market, and to achieve cost advantages over products offered by its competitors.\nFor several years the Company has been working with advances in technology to provide pilots with more information to enhance both the safety and efficiency of flying and has developed its COCKPIT/IP® Cockpit Information Portal (CIP) product line, that incorporates proprietary technology, lower cost relative to the competition, reduced power consumption, decreased weight, and increased functionality. The Company has incorporated Electronic Flight Bag (EFB) functionality, such as charting and mapping systems, into its FPDS product line.\nThe Company has developed an FMS that combines the savings long associated with in-flight fuel optimization in enroute flight management combined with the precision of satellite-based navigation required to comply with the regulatory environments of both domestic and international markets. The Company believes that the FMS, alongside its FPDS and CIP product lines, is well suited to address market demand driven by certain regulatory mandates, new technologies, and the high cost of maintaining aging and obsolete equipment on aircraft that may be in service for up to fifty years. The shift in the regulatory and technological environment is illustrated by the dramatic increase in the number of Space Based Augmentation System (SBAS) or Wide Area Augmentation System (WAAS) approach qualified airports, particularly as realized through Localizer Performance with Vertical guidance (LPV) navigation procedures. Aircraft equipped with the Companys FMS, FPDS and SBAS/WAAS/LPV enabled navigator, will be qualified to land at such airports and will comply with Federal Aviation Administration (FAA) mandates for Required Navigation Performance, and Automatic Dependent Surveillance-Broadcast navigation. IS&S believes this will further increase the demand for the Companys products. The Companys FMS/FPDS product line is designed for new production and retrofit applications into general aviation, commercial air transport and military transport aircraft. In addition, the Company offers what we believe to be a state-of-the-art ISU, integrating the full functionality of the primary and navigation displays into a small backup-powered unit. This ISU builds on the Companys legacy air data computer to form a complete next-generation cockpit display and navigation upgrade offering to the commercial and military markets.\nThe Company has developed and received certification from the FAA on its NextGen Flight Deck featuring its ThrustSense® Integrated PT6 Autothrottle (ThrustSense® Autothrottle) for retrofit in the Pilatus PC-12. The NextGen Flight Deck features Primary Flight and Multi-Function Displays and ISUs, as well as an Integrated FMS and EFB System. The innovative avionics suite includes dual flight management systems, autothrottles, synthetic vision and enhanced vision. The NextGen enhanced avionics suite is available for integration into other business aircraft with Non-FADEC and FADEC engines.\nThe Company has developed its FAA-certified ThrustSense® Autothrottle for retrofit in the King Air, dual turbo prop PT6 powered aircraft. The autothrottle is designed to automate the power management for speed and power control including go-around. ThrustSense® also ensures aircraft envelope protection and engine protection during all phases of flight reducing pilot workload and increasing safety. The Company has signed a multi-year agreement with Textron Aviation, Inc. (Textron) to supply ThrustSense® on the King Air 360 and King Air 260. ThrustSense® is also available for retrofit on King Airs through Textron service centers and third-party service centers. The Company has also developed an FAA-certified safety mode feature for its King Air ThrustSense® Autothrottle, LifeGuard™, which provides critical Vmca protection that proportionally reduces engine power to maintain directional control during an engine-out condition.\nWe believe the ThrustSense® Autothrottle is innovative in that it is the first autothrottle developed for a turbo prop that allows a pilot to automatically control the power setting of the engine. The autothrottle computes and controls appropriate power levels thereby reducing overall pilot workload. The system computes thrust, holds selected speed/torque, and implements appropriate speed and engine limit protection. When engaged by the pilot, the autothrottle system adjusts the throttles automatically to achieve and hold the selected airspeed guarded by a torque/temperature limit mode. The autothrottle system takes full advantage of the integrated cockpit utilizing weight and balance information for optimal control settings and enabling safety functions like a turbulence control mode.\nThe Company sells to both the OEM and the retrofit markets. Customers include various OEMs, commercial air transport carriers and corporate/general aviation companies, DoD and its commercial contractors, aircraft operators, aircraft modification centers, government agencies, and foreign militaries. Occasionally, IS&S sells its products directly to DoD; however, the Company sells its products primarily to commercial customers for end use in DoD programs. Sales to defense contractors are generally made on commercial terms, although some of the termination and other provisions of government contracts are applicable to these contracts. The Companys retrofit projects are generally pursuant to either a direct contract with a customer or a subcontract with a general contractor to a customer (including government agencies).\nCustomers have been and may continue to be affected by changes in economic conditions both in the United States and abroad. Such changes may cause customers to curtail or delay their spending on both new and existing aircraft. Factors that can impact general economic conditions and the level of spending by customers include, but are not limited to, the impact of the ongoing COVID-19 pandemic, general levels of consumer spending, increases in fuel and energy costs, conditions in the real estate and mortgage markets, labor and healthcare costs, access to credit, consumer confidence, and other macroeconomic factors that affect spending behavior. Furthermore, spending by government agencies may be reduced in the future if tax revenues decline. If customers curtail or delay their spending or are forced to declare bankruptcy or liquidate their operations because of adverse economic conditions, the Companys revenues and results of operations would be affected adversely. For example, in the 2020 fiscal year, certain of the Companys customers temporarily suspended product deliveries as a result of the COVID-19 pandemic, and while these deliveries subsequently resumed, there is a possibility that the COVID-19 pandemic (including as a result of the impact of any newer variants or strains of SARS-CoV-2) will result in other suspensions, delays or order cancellations by the Companys customers or suppliers.\nOn the other hand, the Company believes that in adverse economic conditions, customers that may have otherwise elected to purchase newly manufactured aircraft may be interested instead in retrofitting existing aircraft as a cost-effective alternative, thereby creating a market opportunity for IS&S.\nThe ongoing COVID-19 pandemic is nevertheless a significant event, driver of market trends, and source of uncertainty that may ultimately have a direct or indirect material impact on the Companys business, financial position, liquidity, or ability to service customers or maintain critical operations. In direct response to the COVID-19 pandemic, the Company has taken specific actions to seek to ensure the safety of its employees, including temperature monitoring, frequent sanitization of workspaces, observance of social distancing protocols, and other increased safety measures.\nIndustry\nA wide range of information is critical for proper and safe operation of aircraft. With advances in technology, new types of information to assist pilots are becoming available for display in cockpits, such as satellite-based weather, ground terrain maps, and ADS-B navigation. The Company believes that aircraft cockpits will become more complete information centers, capable of delivering additional information that is either mandated by regulation or demanded by pilots to assist in the safe and efficient operation of aircraft. The flight deck will continue to adapt technologies which are stepping-stones for complete autonomy. The Company believes that the market will continue to embrace the initial phases of autonomous flight.\nThe Company classifies flight data into four general types: aircraft heading and altitude information, flight critical aircraft control data, navigation data, and maintenance and aircraft health data. Aircraft heading and altitude information includes aircraft speed, altitude, and rates of ascent and descent. Flight critical aircraft control information includes engine data, such as fuel and oil quantity, and other engine measurements. Navigation data includes radio position, flight management, GPS, and alternative source information (i.e., information not originating on the aircraft, including weather depiction maps, GPS navigation, and surface terrain maps). Maintenance and aircraft health data includes on-board sensors and programs to measure parameters related to the health of a system on the aircraft. Air data calculations are based primarily on air pressure measurements derived from sensors on the aircraft. Engine data are determined by measuring various indices such as temperature, volume, revolutions per minute, and pressure within an aircrafts engines and other mechanical equipment. GPS and alternative source information are derived typically from satellites or equipment located on land and transmitted by satellite or radio signals to the aircraft. Maintenance and aircraft health data measure multiple parameters on various products and interface with various components to manage, measure, and report on the health, reliability and usability of a system. This information is displayed in the cockpit for reference, enhanced position awareness, and reduced support logistics on properly equipped aircraft.\nTraditionally, flight data and other cockpit information were displayed on a series of separate analog mechanical instruments. In the early 1980s, Cathode Ray Tubes (CRT) and digital displays using monochromatic Liquid Crystal Displays (LCD) began to replace some individual analog instruments. Presently, the industry offers high resolution color flat panels using Active Matrix Liquid Crystal Displays (AMLCD) to replace traditional analog instruments, CRT or LCD displays. IS&S expects that the ability to display more information in an efficient space and custom platform will become increasingly important if additional information, such as weather depiction maps, traffic information, surface terrain maps, datalink messaging, and surveillance displays, becomes mandated by regulation or demanded by pilots. Accordingly, the Company believes flat panel displays, which can integrate and display a suite of information, will replace individual instrument CRTs and LCDs on legacy aircraft.\nIn the past, equipment data, such as engine and fuel-related information, were displayed on conventional analog mechanical instruments. Engine and fuel instruments provide information on engine activity, including oil and hydraulic pressures, and temperature. These instruments are clustered throughout an aircrafts cockpit. Engine and fuel instruments tend to be replaced more frequently than other instruments due to obsolescence and normal wear-and-tear. Aircraft operators continue to purchase individual conventional engine and fuel instruments as replacements because the information that these instruments display is vital for safe and efficient flight. Increasingly, operators are replacing their clusters of analog mechanical instruments with integrated Engine Instrument Display Systems or FPDS packages.\nAs the skies and airports become more crowded, the aviation industry and its regulators are concentrating on new technologies, procedures, and regulations that allow more aircraft to operate in the skies and on the ground safely, efficiently, and with less impact on the environment. These new technologies and procedures, such as traffic avoidance, ground awareness, increased precision of navigation and vertical position, runway incursion prevention, and increased digital communication, will require innovation and intuitive methods to display situational awareness information for the pilots. The Company believes that flat panel displays provide a strong solution to the growing need for innovation and new methods in this area.\nStrategy\nThe Companys objective is to become a leading supplier and integrator of cockpit information, and believes that its industry experience and reputation, technology and products, and business strategy provide the basis to achieve this objective. Key elements of the Companys strategy include:\n● Continue to drive the market toward the performance, situational awareness and safety advantages of equipping the ThrustSense® autothrottles on both aftermarket and OEM aircraft. IS&S saw the lack of an available autothrottle system on turboprop aircrafts as an unmet need in the marketplace and has invested in the development of a sophisticated turboprop autothrottle. We believe that ThrustSense®, IS&Ss new turboprop autothrottle with patented technology, is highly effective, is less complex and less costly than other available products and offers very sophisticated sensing and multiple safety features that we believe even exceeds those of much more expensive jet autothrottle systems. The Company received the first supplemental type certificate (STC) ever granted by the FAA for a turboprop autothrottle in June 2017. IS&S intends to continue to capitalize on being the first to market and introduce the product to owners and operators of turboprop aircraft.\n● Introduction of Autothrottle STC Installations: IS&S supplemented the ThrustSense® Autothrottle offering by seeking FAA approval to perform autothrottle installations. The FAA approved IS&S to perform PC-12 and King Air STC installations in June 2022 as the date certified to perform installations. IS&S can now go directly to an autothrottle customer location and perform the STC installation on site.\n● Focusing on retrofits. Cockpit avionics upgrades for existing aircraft are of great interest in the present environment. We believe the retrofit of an aircraft with the COCKPIT/IP® FPDS, FMS, and ISU system components is cost effective compared to the acquisition of a new aircraft and can provide equivalent functionality to that of new aircraft.\n● Expand presence in the flat panel display market. Due to recent demand from cargo operators, IS&S believes that many aircraft will be retrofitted with flat panel displays over the next several years. Given the versatility, visual appeal, and lower cost of displaying a series of instruments and other flight relevant information on a single flat panel, the Company believes that flat panel displays will increasingly replace individual analog and digital instrument LCDs and CRTs. The Company believes that the COCKPIT/IP® has significant benefits over competitive flat panel displays, including lower cost, larger size, reduced weight, enhanced viewing angles, and a broader array of functions. The Companys patented and proprietary Integrity Checking Processor and Zooming features provide increased situational awareness, reliability, performance, and utility to the owner/operator. Accordingly, the Company believes that these advantages will allow IS&S to generate significant revenues from the COCKPIT/IP® product, and to increase market share. In addition, the Company believes that demand for new aircraft, FAA mandates and obsolescence issues on older aircraft will contribute to this growth.\n● Continuing engineering and product development successes. IS&S develops innovative products by combining its avionics, engineering, and design expertise with commercially available technologies, components, and products from non-aviation applications, including the personal computer and telecommunications industries. The Companys COCKPIT/IP® system components present examples of its ability to engineer products through the selective application of non-avionic technology. In addition, as permitted by law, IS&S applies for and registers its patents and trademarks for the technology and products it develops in the United States and various countries around the world to protect its intellectual property.\n● Maintaining focus on air data markets. The Company believes that it is one of the largest suppliers of air data products to the U.S. retrofit market. The pressures on the DoD procurement budget make the retrofit of aging military aircraft with newer, more advanced, and more supportable air data systems attractive. In addition, higher performance engines in business aircraft are creating a need for the sophisticated air data products which the Company supplies.\n● Increasing sales to DoD, other government agencies, defense contractors, commercial air transport carriers and corporate/general aviation markets. IS&S has extended its efforts to diversify sales to include all aviation end user markets, especially legacy military programs and commercial air transport aircraft. In the commercial air transport market, the Company has addressed national carriers, regional carriers, and other fleet operators. The Company has targeted the corporate/general aviation market, both for retrofits and original equipment, and has ongoing retrofit programs and an OEM program with Pilatus Aircraft Limited (Pilatus).\n● Expanding international presence. IS&S plans to increase its international sales by adding sales and marketing personnel. The Company believes that European and other international aircraft operators and aircraft modification centers will retrofit legacy in-service aircraft with large flat panel displays. IS&S obtained approval from the European Union Aviation Safety Agency (EASA) for installing the FPDS in Europe for the B757/B767 aircraft and expects to obtain EASA approvals for other European aircraft types. In addition, the King Air ThrustSense® Autothrottle system is currently certified by most foreign civil aviation authorities; including EASA, TCCA, UK-CAA, and CAAC\nProducts\nCurrent lines of products include:\nFlat Panel Display Systems\nFlat panel displays are AMLCD screens that can replicate the display of one or a suite of analog or digital displays on one screen. Flat panel displays can replace existing displays in legacy aircraft. AMLCDs are used also for security monitoring on-board aircraft and as tactical workstations on military aircraft. The flat panel product line offers numerous advantages for presentation of engine performance data.\nThe Companys FPDS can replace conventional analog and digital displays and can display additional information which is not commonly displayed in the cockpit with conventional analog and digital displays. The COCKPIT/IP® is capable of displaying nearly all types of air data, engine and fuel data, altitude, heading and navigational data, maintenance and aircraft health data, and alternative source information. As technology and information delivery systems develop further, additional information will be displayed in the cockpit, such as surface terrain maps and data link messaging. IS&S designed the COCKPIT/IP® to be capable of displaying information from a variety of sources, including its Reduced Vertical Separation Minimum (RVSM) air data system, engine and fuel instrumentation, and third-party data and information products.\nFrom time to time, customers may order one or more FPDSs customized to their particular requirements. Typically, the Company charges for the added development cost. This revenue is reported as Engineering Development Contracts (EDC) on the consolidated statements of operations. Engineering costs incurred in customizing the FPDSs are included in cost of sales.\nFlight Management Systems\nThe IS&S NextGen Flight Management System is an easily installed navigation and performance computer that complements the IS&S Flat Panel Display System upgrade for commercial air transport aircraft. The FMS interfaces with the IS&S, SBAS, and GPS to provide a GPS-based navigation solution. The GPS receiver is located remotely depending on space availability. To minimize use of cockpit space and ease installation efforts, the FMS is housed in an ARINC 739B compliant Multifunction and Control Display Unit (MCDU).\nEach FMS/MCDU has an LCD display, keyboard, mode and function keys, line select keys and annunciator lights, and supports ethernet data loading. The flight crew can manually or datalink waypoint flight plans, routes or user-defined waypoints on the IS&S FMS and modify and update these plans via the FMS/MCDU screen. Once the flight plan data is entered, the MCDU computes the most economical flight profiles and provides steering commands for use by the aircraft control system to fly the airplane along the desired route.\nThe FMS/MCDU package incorporates a robust navigation database capable of storing todays global database with ample growth for the future. Flight crews can utilize the data in the navigation database to create, edit and modify flight plans for display on the FPDS. The navigation data includes airways, jet routes, Standard Instrument Departure, Standard Terminal Arrival Route, and company stored routes.\nThe FMS/MCDU is ARINC 739B compliant, which provides an interface option for other cockpit equipment such as SATCOM, ACARS, CMU, HUD, and a printer. The interface to the IS&S FPDS is provided via ethernet. The IS&S EFB is integrated with the FMS/MCDU and FPDS where the control selection of the EFB features and applications are handled via the FMS/MCDU. The display is a five-inch LCD with VGA resolution. The touchscreen display uses LED backlighting and is sunlight readable.\nIntegrated Standby Unit\nThe Companys ISU incorporates the measurement and display of attitude, altitude, airspeed, and navigation data into a single standby/backup navigation instrument for military, commercial air transport and corporate/general aviation applications. The ISU has an integral Inertial Measurement Unit that includes accelerometer, gyro, and magnetometer triads. The unit also includes an integral air data measurement module for measurement of static and total pressure for display of altitude, airspeed, and mach number.\nThe ISU is a highly reliable and accurate standby navigation system that is based on IS&Ss merger of COCKPIT/IP® display technology and RVSM air data products coupled with the modern technology in MEMS Gyros that have exceptional stability. An IS&S proprietary algorithm provides for accurate computation of attitude, heading and air data parameters. The unit includes a triaxial magnetometer that is designed to be tolerant to the local soft iron effects.\nThe display uses a familiar Primary Flight Display format to reduce pilot workload. Logistics and maintenance savings are realized due to increased reliability and a reduction in line-replaceable units. The unit is equipped with built-in test and display of navigational aid and maintenance data.\nAir Data Systems and Components\nThe Companys air data products calculate and display various measures such as aircraft speed, altitude, and vertical rate of change. These air data products utilize advanced sensors to gather air pressure data and customized algorithms to interpret data, thus allowing the system to calculate altitude more accurately.\nIS&S sells individual components and partial and complete air data systems. The components and systems include:\n● digital air data computers, which calculate various air data parameters such as altitude, airspeed, vertical speed, angle of attack and other information derived from the measure of air pressure;\n● integrated air data computers and display units, which calculate and convey air data information;\n● altitude displays, which convey aircraft altitude measurements;\n● airspeed displays, which convey various airspeed measurements including vertical airspeed and rates of ascent and descent; and\n● altitude alerters, which allow pilots to select a desired cruising altitude and which provide warnings to pilots when an unacceptable deviation occurs.\nEngine and Fuel Displays\nIS&S develops, manufactures and markets engine and fuel displays. These solid-state multifunction displays convey information with respect to fuel and oil levels, and engine activity, such as oil and hydraulic pressure and temperature. They include individual and multiple displays installed throughout the cockpit. The displays can be used in conjunction with the Companys engine and fuel data equipment or that of other manufacturers.\nEngine and fuel displays are vital to safe flight. In addition, accurate conveyance of engine and fuel information is critical for monitoring engine stress and parts maintenance. Engine and fuel displays tend to be replaced more frequently than other displays and have been slow to incorporate new technology since their introduction because of their low cost, standard design and universal use.\nIS&S believes that its air data engine and fuel displays are extremely reliable, have been designed to be programmable, and are easily adaptable without major modification to most modern aircraft. These products have been installed on B727, B737, C-130H, DC-9, DC-10, P-3, and A-10 aircraft.\nIntegrated Global Navigation System\nThe Companys Integrated Global Navigation System product is an alternative for adding GPS navigation capability to legacy aircraft through the OEM FMS without the high cost of upgrading the current FMS.\nThis product includes RNP and RNAV approaches via the certified IS&S Beta 3 GPS and leverages components of the Companys FPDS to provide annunciation to the pilot during GPS procedures.\nAutothrottle - ThrustSense®\nThe IS&S Autothrottle, ThrustSense®, is a full regime autothrottle, from takeoff to landing phases of flight including go around. ThrustSense® combines full-authority digital engine control (FADEC) functionality with low and high-speed protection for the Pilatus PC-12 and Beechcraft King Air series aircraft. IS&S believes ThrustSense® improves safety and performance for Pratt and Whitney PT6-powered single and multi-engine aircraft. In the case of multi-engine aircraft, such as the Beechcraft King Air, ThrustSense® provides Vmca protection during an engine out condition. The system is light weight, installs with minimal downtime and provides the user with high value for performance. IS&S believes ThrustSense® can attain fuel savings of 3% and when flying constant angle-of-attack the fuel savings can be as much as 10%. The Company in April 2019 received certification from the FAA for, its ThrustSense® Autothrottle for retrofit in the King Air, dual turbo prop PT6 powered aircraft. The Company has signed a multi-year agreement with Textron to supply ThrustSense® on their new production aircraft, the King Air 360 and King Air 260. ThrustSense® is also available for retrofit on King Airs through Textron service centers and third-party service centers.\nThe IS&S ThrustSense® Autothrottle is designed to ensure stabilized approaches by controlling speeds during descent. During high pilot workload, the autothrottle is designed to prevent the airplane from becoming dangerously slow or fast and protects against overtorque and overtemp, thereby enhancing the safety and capability of your aircraft.\nControl of the autothrottle is housed in an easy-to-install ISU that provides standby functionality on a high-resolution LCD display. The ThrustSense® Autothrottle is designed to avoid structural modifications to the existing throttle quadrant. ThrustSense® has MEL Relief and On Condition Maintenance.\nIS&S believes ThrustSense® can be adapted to virtually all PT6 powered aircrafts with the IS&S ISU. The ISU executes software to control the autothrottle actuator. In addition the ISU calculates, processes and displays altitude, attitude, airspeed, slip/skid, and navigation display information, which IS&S believes is presented in a logical and concise single instrument display. It features a high- resolution LCD display with full LED backlighting, thereby improving reliability and full sunlight readability to the pilot, and fully anti-aliased graphics.\nIS&S believes the autothrottle retrofit and standby are easily installed, and typical installation can take less than a week with minimum modifications to the existing flight deck.\nOther potential benefits of the ThrustSense® Autothrottle include:\n● safety enhancements and pilot workload reduction;\n● life-saving enhancements in multi-engine aircraft;\n● FADEC-like engine protection;\n● does not require replacement of the existing throttle quadrant (major cockpit modification) due to the patented compact and safe actuation mechanism; and\n● broader applications for retrofit in FADEC or non-FADEC Turbofan and Turboprop aircraft.\nUtilities Management System\nIS&S provides the Utilities Management System (UMS) for the Pilatus PC-24 which has been certified and delivered. The IS&S UMS integrates a wide range of aircraft functions, which are commonly supported by multiple individual controllers. The UMS-24 monitors aircraft sensors and aircraft control systems as required to achieve system functionality. This open architecture system allows Pilatus to design and/or refine control and monitoring algorithms, in-house.\nIS&S believes there is interest in its UMS from other aircraft manufacturers as well. The UMS is an innovative design that controls 20 plus aircraft systems such as navigation, auto-flight, landing gear, surface positions, fire protection, ice/rain protection, electrical loads, lighting, environmental conditions, cabin pressurization, and oxygen systems based on OEM custom configuration.\nThe UMS is a Data Concentrator and Processing Unit (DCPU) that allows manufacturers to configure and program specific applications on a ARINC 653 operating system in an open architecture platform. The UMS acts as the aircraft central maintenance computer allowing for a maximum of six DCPUs to be included in the communication ring. The system provides a significant power and weight saving over the use of federated boxes and utilizes the latest IS&S technological advancements in avionics circuit design.\nCustomers\nThe Companys customers include the United States government (including DoD, the Department of Interior and the Department of Homeland Security), Air Transport Services Group Inc. (ATSG), Amazon.com, Inc., American Airlines, Inc. (AAL), Boeing, Deutsche Post DHL Group (DHL), FedEx Corporation (FedEx), Icelandair, L3Harris Technologies, Inc., Lockheed Martin Corporation, Pilatus, Sierra Nevada Corporation (Sierra Nevada), Textron, and the Department of National Defense (Canada), among others.\nThe Companys revenue is concentrated with a limited number of customers. In fiscal year 2022, the three largest customers, Pilatus, ATSG and Textron accounted for 22%, 11% and 11% of total revenue, respectively. In fiscal year 2021, the two largest customers, Pilatus and Textron accounted for 20% and 17% of total revenue, respectively. In fiscal year 2020, the three largest customers, Pilatus, Dayton T. Brown, Inc., and Kalitta Air accounted for 33%, 12% and 10% of total revenue, respectively.\nRetrofit Market\nHistorically, most of the Companys sales have come from the retrofit market, which IS&S has pursued because of its continued growth in response to the need to support the worlds aging fleet of aircraft. The design and airframe structure of many types of older aircraft generally exceeds the technology and technical capabilities of the original cockpit instruments and avionics. The Company has developed products that enable owners and operators to upgrade their aircraft by retrofitting them with IS&S products at a competitive cost and with equipment that provides cockpit displays with capabilities and technology equivalent to new aircraft.\nIS&S expects its main customers in the retrofit market will continue to be:\n● the DoD and defense contractors,\n● aircraft operators, and\n● aircraft modification centers.\nDepartment of Defense and Defense Contractors. The Company sells its products directly to the DoD and to domestic and international defense contractors for end use on military aircraft retrofit programs. DoD programs generally take one of two forms: a subcontract with a prime government contractor, such as Boeing, Lockheed Martin, or L3Harris Technologies, Inc. or a direct contract with the appropriate government agency, such as the U.S. Air Force. The governments desire for cost-effective retrofit of its aircraft has led it to purchase commercial off-the-shelf equipment rather than to develop specially designed products, which are usually more costly and take longer to implement. These retrofit contracts tend to be on arms-length commercial terms, although some termination and other provisions of government contracts are typically applicable to these contracts, as described under Government Regulation below. Each government agency or general contractor retains the right to terminate a contract at any time at its convenience. Upon such alteration or termination, IS&S is entitled typically to be compensated for already delivered items and reimbursement for allowable costs incurred.\nAircraft Operators. The Company sells its products to aircraft operators, including commercial airlines, cargo carriers, and business and general aviation aircraft owners or suppliers, primarily for retrofitting of aircraft owned or operated by these customers. The Companys commercial fleet customers include or have included, among others, AAL, ATSG, FedEx and Icelandair. IS&S sells these customers a range of products from FPDS to air data systems.\nAircraft Modification Centers. Aircraft modification centers, which repair and retrofit private aircraft, represent the primary retrofit market for private and corporate jets. IS&S has established relationships with a several aircraft modification centers throughout the United States, which act as distribution outlets and installation centers for the Companys products.\nOriginal Equipment Manufacturers\nIS&S has signed a multi-year agreement with Textron to supply ThrustSense® on their new production aircraft, the King Air 360 and King Air 260 as described above in Products-Autothrottle - ThrustSense®. The Company has developed and manufactures the UMS for Pilatus PC-24 aircraft under a multi-year production contract as described above under Products-Utilities Management System. The Company also markets its products to other OEMs including, among others, Boeing and Lockheed Martin.\nBacklog\nSeptember 30\nBacklog, beginning of period\n$\n9,121,585\n$\n3,640,637\nPlus: bookings during period, net\n30,398,098\n28,525,744\nLess: sales recognized during period\n(27,740,695)\n(23,044,796)\nBacklog, end of period\n$\n11,778,988\n$\n9,121,585\nBacklog represents the value of contracts and purchase orders, less the revenue recognized to date on those contracts and purchase orders. The backlog excludes potential future sole-source production orders from products developed under the Companys EDC programs, including the Pilatus PC-24, the KC-46A and the Textron King Air 360 and King Air 260 ThrustSense® Autothrottle programs. Although the Company believes that the orders included in backlog are firm, most of the backlog involves orders that can be modified or terminated by the customer. As of September 30, 2022, 16% of the Companys backlog was expected to be filled beyond fiscal 2023.\nEngineering Development\nThe Company invests a significant percentage of its sales on engineering development, both Research & Development (R&D) and EDC. At September 30, 2022, approximately 22% of the Companys employees were engineers engaged in various engineering development projects. Total engineering development expense comprises both internally funded R&D and product development and design charges related to specific customer contracts. Engineering development expense consists primarily of payroll-related expenses of employees engaged in EDC projects, engineering related product materials and equipment, and subcontracting costs. R&D charges incurred for product design, product enhancements, and future product development are expensed as incurred. Product development and design charges related to specific customer contracts are charged to cost of sales-EDC based on the method of contract accounting (either recognized over time or at a point in time) applicable to such contracts.\nSales and Marketing\nIS&S focuses its sales efforts on passenger and cargo carrying aircraft operators, general aviation owner/operators, MRO/dealer networks, distributors, avionics integrators, aircraft modification centers, the DoD, DoD contractors, and OEMs. Periodically, the Company evaluates its sales and marketing efforts with respect to these focus areas and, where appropriate, makes use of third-party sales representatives who receive compensation through commissions based on performance. As of September 30, 2022, we have twelve representatives worldwide that are actively selling IS&S products.\nWe are continuing to expand our maintenance, repair and overhaul (MRO) dealer network to address worldwide markets for Boeing 737, 757 and 767, Pilatus PC-12s, Beechcraft King Air models and other aircraft types. We have established a dealer network for ThrustSense®, and we are in the process of exploring adding more MRO dealerships in the United States and internationally.\nOur marketing efforts have focused on applicable markets establishing and maintaining key customer rapport using email campaigns, key market influencers, advertisements, trade shows, web casts, direct mailers, digital and social media. Our Autothrottle offering on the Pilatus PC-12 and King Air have been favorably featured in multiple articles in major publications over the past several years.\nThe Company believes its ability to provide prompt and effective repair and upgrade service is critical to its marketing efforts. The Companys customer service program offers a 24-hour customer hotline. The Company services its customers utilizing either field service engineers or its in-house repair and upgrade facility. The Company may lend spare units to customers when it is repairing or overhauling their equipment. IS&S provides customers with a standard two-year warranty on new products. The Company offers customers extended warranties of varying lengths beyond the two years for additional fees.\nThe Company believes its ability to provide an installation service is critical to its marketing efforts. The Companys Repair Station provides a mobile STC Installation Team to install the PC-12 and King Air ThrustSense® Autothrottle systems beginning in June 2022.\nMost of the Companys sales, personnel and assets are located within the United States. In fiscal years 2022, 2021 and 2020 net sales outside the United States amounted to $11.1 million, $8.4 million and $9.4 million, respectively.\nGovernment Regulation\nFAA regulations govern the manufacture and installation of the Companys products in aircraft owned and operated in the United States. Both the IS&S manufacturing facility and the IS&S repair station are FAA-certified. The most significant product and installation regulations are Technical Standard Orders (TSOs), Parts Manufacturer Approvals (PMA), and STCs, which establish the minimum operational performance standards. For example, in April 2019, the FAA issued its TSO authorization and STC for the Companys ThrustSense® Autothrottle for retrofit in the King Air dual prop PT6 powered aircraft. In February 2019, the FAA issued its TSO authorization and STC for the Companys B767 Integrated Standby Unit to be used on B767 aircraft in the United States.\nGenerally, sales of IS&S products to European or other non-U.S. owners of aircraft require approval of EASA, or other relevant governmental agencies. EASA certification requirements for the manufacture and installation of the Companys products in European owned aircraft mirror FAA regulations, and its process for European certification is similar to that of the FAA. For example, in September 2021, EASA and the Transport Canada Civil Aviation issued STCs for the Companys ThrustSense(R) Full Regime Autothrottle for King Air series aircraft in the European Union and Canada, respectively.\nIn addition to product-related regulations, IS&S is subject to U.S. government procurement regulations with respect to the sale of the Companys products to government entities or government contractors. The government agency or general contractor retains the right to terminate a contract at any time at its convenience. Upon such alteration or termination, IS&S is generally entitled to an equitable adjustment to the contract price, so that the Company receives the purchase price for products or services already delivered, reimbursement for allowable costs incurred and for termination related costs.\nThe Companys business is also impacted by various other laws and regulations, including, but not limited to, local, state, federal, and international tax codes, import and export controls and customs laws, employment and employment-related laws, environmental laws, intellectual property laws, and consumer protection statutes. The Company from time to time incurs costs in the ordinary course of business in connection with maintaining compliance with these evolving and at times overlapping regulatory regimes.\nManufacturing, Assembly and Materials Acquisition\nThe Companys manufacturing activities consist primarily of assembling and testing components and subassemblies and integrating them into finished systems. Typically, the Company purchases components for products, including any necessary raw materials, from third-party suppliers, several of which are sole source, and assembles them in a clean room environment. Many of the components purchased are standard products, although certain parts are made to the Companys specifications. Although there are a limited number of suppliers of particular components, management believes other suppliers could provide similar components on comparable terms.\nWhen appropriate, IS&S enters into long-term supply agreements and uses its relationships with long-term suppliers to improve product quality and availability, and to reduce delivery times and product costs. In addition, the Company identifies alternative suppliers for important component parts. Generally, the introduction of component parts from new suppliers into existing products requires FAA certification of the entire finished product if the newly sourced component varies significantly from the original drawings and specifications. IS&S has not experienced significant delays in delivery of products caused by the inability to obtain either component parts or FAA approval of products incorporating new component parts.\nQuality Assurance\nProduct quality is of vital importance. The Company is ISO 9001 and AS9100D certified. These standards represent an international consensus on effective management practices with the goal of ensuring that a company can deliver its products and related services consistently in a manner that meets or exceeds customer quality requirements. IS&Ss certification to these standards allows the Company to represent to customers that it maintains high-quality industry standards in the education of its employees and in the design and manufacture of its products. In addition, the Companys products undergo extensive and documented quality control testing prior to being delivered to customers.\nCompetition\nThe market for the Companys products is highly competitive. Competitors vary in size and resources, and substantially all the Companys competitors are much larger than IS&S and have substantially greater resources. With respect to air data systems and related products, the Companys principal competitors include Honeywell International Inc., Collins Aerospace, Thales Defense & Security, Inc., and Garmin Ltd. With respect to flat panel displays, principal competitors currently include Honeywell International Inc., Collins Aerospace, L3Harris Technologies, Inc., Garmin Ltd. and GE Aviation Systems. However, as the flat panel display industry evolves and the demand for flat panel displays increases, IS&S may face future competition in this area from other suppliers. The Company believes that the principal competitive factors in its markets are cost, development cycle time, responsiveness to customer preferences, product quality, technology, and reliability. IS&S believes that its significant and long-standing customer relationships reflect the Companys ability to compete favorably with respect to these factors.\nIntellectual Property and Proprietary Rights\nIS&S relies on patents to protect its proprietary technology. As of September 30, 2022, the Company holds 14 U.S. patents and has 3 U.S. patent applications pending relating to its technology. In addition, IS&S holds 40 international patents and has 2 international patent applications pending. Certain of these patents and patent applications cover technology relating to air data measurement systems and others cover technology relating to flat panel display systems and other aspects of the COCKPIT/IP® solution. While IS&S believes these patents have significant value in protecting its technology, it believes that the innovative skill, technical expertise, and know-how of the Companys personnel in applying the technology reflected in its patents would be difficult, costly, and time consuming to reproduce.\nWhile IS&S is not aware of any pending lawsuits against the Company alleging patent infringement or the violation of other intellectual property rights, it cannot be certain such infringement claims will not be asserted against the Company in the future.\nHuman Capital\nOur people are the driving force behind our success, and our future and growth prospects depend on our ability to attract, train and retain highly qualified personnel. We are fortunate to have talented and outstanding employees, and we are proud of our diverse workforce and the broad range of skills and experiences that our people have. We work hard to cultivate a dynamic and enjoyable work environment full of opportunities to learn new skills, stressing teamwork and encouraging our employees to brainstorm, develop and refine new ideas to help us innovate and achieve our goals, and we maintain equity compensation plans and benefits packages designed to retain talented people who share our goals and interests. We also offer competitive salaries and generous benefits, including vacation, a 401(k) savings and retirement plan, health, dental, life, long-term disability insurance, an Employee Assistance Program (EAP), and health and dependent Flexible Spending Account programs. Additionally, we regularly review and reevaluate our recruitment strategies to ensure our practices align with our mission, purpose, and values. Nevertheless, competition for such qualified personnel is intense, and the Company may not be able to attract, train, and retain highly qualified personnel in the future.\nWe are an equal opportunity employer and a Vietnam Era Veterans Readjustment Assistance Act (VEVRAA) federal contractor. All qualified applicants receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. We also comply with all applicable state and local laws governing nondiscrimination in employment and have a Code of Business Conduct and Ethics applicable to each employee, director, officer, contractor and consultant of the Company designed to ensure that we maintain the highest standards of business conduct in every aspect of our business and operations.\nSafety is a vital aspect to the success of our people and business. We are proud of our employees collective commitment to secure and maintain safe work practices, in particular during the COVID-19 pandemic. Protecting the health and safety of our employees and their families has been a priority throughout the pandemic, and we have implemented temperature monitoring, frequent sanitization of workspaces, observance of social distancing protocols, and other increased safety measures in response to the pandemic.\nAs of September 30, 2022, IS&S had 81 employees (79 of whom were full-time employees). None of our employees are currently represented by a labor union, nor are they subject to a collective bargaining agreement. We consider relations with our employees to be good.\nExecutive Officers of the Registrant\nThe following is a list of the Companys executive officers, their ages and their positions in each case.\nName\nAge\nPosition\nShahram Askarpour\nDirector and Chief Executive Officer\nMichael Linacre\nChief Financial Officer\nShahram Askarpour has been the CEO since April of 2022. Dr. Askarpour joined the Company as a Director of Engineering in 2003, was promoted to Vice President of Engineering in 2005, and was promoted to President on April 2, 2012. Dr. Askarpour has more than 30 years of aerospace industry experience in managerial and technical positions. Prior to joining IS&S, he was employed by Smiths Aerospace (a division of Smiths Group PLC), Instrumentation Technology and Marconi Avionics. He holds a number of key patents in the aviation field. Dr. Askarpour received his engineering education in the United Kingdom and received an undergraduate degree in Electrical Engineering from Middlesex University, a post graduate Certificate of Advanced Study in Systems Engineering, and a PhD in Automatic Control from Brunel University. He was awarded the title of Associate Research Fellow for three consecutive years by Brunel University, and has published numerous papers in leading international, peer reviewed journals. In addition, he has completed management courses at Carnegie Mellon University and finance courses at the Wharton Business School.\nMichael Linacre has been the CFO since July of 2022. Prior to joining IS&S in 2022, Mr. Linacre, worked as a public accountant and auditor at KPMG LLP. He also held finance leadership positions at Genpak, LLC, a food service packaging company, and SI Group, Inc., a chemical manufacturing company, before serving as the Chief Financial Officer of Sysco Albany, LLC, a subsidiary of Sysco Corporation, a public multinational seller, marketer, and distributor of food products, Mr. Linacre is a licensed CPA and a member of the American Institute of CPAs and the New York State Society of CPAs. He received his Bachelors degree in Accounting from the State University of New York at Albany.\nOther\nThe SEC maintains a website that contains annual, quarterly, and current reports, proxy statements and information statements, and other information about issuers, including IS&S, that file electronically with the SEC. The public can obtain any document we file with the SEC at www.sec.gov.\nIS&S also maintains its corporate website at http://www.innovative-ss.com and makes available, free of charge, on that website (under the Investor Relations tab) the Companys annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those as reasonably practicable after it electronically files such material with, or furnishes it to, the SEC. The information on the Companys website is not incorporated as part of this Annual Report on Form 10-K. Item 1A. Risk Factors.\nEach reader should carefully consider the risks, uncertainties and other factors described below, in addition to the other information set forth in this report, because they could materially and adversely affect the Companys business, operating results, financial condition, cash flows, prospects, and the value of an investment in IS&S common stock.\nSummary\nAn investment in our common stock involves various risks, including risks related to the items listed below. However, you are urged to carefully consider all of the matters discussed in this Part I, Item 1A of this Report under the caption Risk Factors (not just those discussed in this summary) in considering our business and prospects.\nIS&S-Specific Risk Factors\nThe Company faces risks relating to:\n● continued market acceptance of the Companys air data systems and other products;\n● the deferral or termination of programs or contracts for convenience by customers;\n● the potential for losses due to cost overruns on fixed-price contract projects;\n● U.S. federal government budget deficits and audit practices, including the possibility of reductions in government expenditures;\n● the possibility that IS&S may lose one or more key customers;\n● the self-insured portion of IS&S employee medical insurance program;\n● our lack of substantial backlog;\n● the ability to service the international market; and\n● intense competition with key competitors.\nGeneral Risk Factors\nThe Company faces risks relating to:\n● the ongoing COVID-19 pandemic;\n● the ability to respond to technological change;\n● delays in receiving components from third-party suppliers;\n● challenges associated with the complexity of our products;\n● our ability to protect our intellectual property rights;\n● failure to retain/recruit key personnel;\n● succession planning;\n● variations in our revenue and operating results over time;\n● a cyber security incident;\n● potential litigation;\n● the costs of compliance with present and future laws and regulations;\n● changes in law, including changes to corporate tax laws in the United States and the availability of certain tax credits;\n● volatility and weakness in capital markets, including rising inflation and interest rates; and\n● the efficacy of our internal control over financial reporting.\nIS&S-Specific Risk Factors\nGrowth of the Companys customer base could be limited by delays or difficulties in completing development and introduction of planned products or product enhancements. If IS&S fails to enhance existing products, or to develop and achieve market acceptance for flat panel displays, flight management systems, autothrottle technology and other new products that meet customer requirements, its business, reputation and statements of income may be affected adversely.\nCurrently, IS&S spends a large portion of its R&D efforts in developing and marketing the FPDS, FMS, ThrustSense® Autothrottle and complementary products. The Companys ability to grow and diversify its operations through introduction and sale of new products is dependent upon its continued success in product development and engineering activities, its sales and marketing efforts, and its ability to obtain necessary regulatory approvals to sell such products. Sales growth will depend in part on market acceptance of and demand for the FPDS, FMS, ThrustSense® Autothrottle and future products. IS&S cannot be certain that it will be able to develop, introduce or market its FPDS, FMS, ThrustSense® Autothrottle or other new products or product enhancements in a timely or cost-effective manner, or that any new products or product enhancements will receive market acceptance or necessary regulatory approval. In addition, the Companys business is dependent upon maintaining its reputation and relationships with existing customers. If the Companys performance does not meet its customers expectations, the Companys reputation and its relationships could be damaged, which may have a material adverse impact on the Companys business and statements of income, including reductions in sales.\nIn seeking new customers, the Company may have difficulty in displacing the products of incumbent competitors. IS&S cannot be assured that potential customers will accept its products or that existing customers will not abandon them.\nContracts can be terminated by many of the Companys customers at any time and, therefore, may not result in sales.\nIS&Ss contracts, including contracts with government agencies, includes various terms and conditions that impose certain requirements on IS&S, including the ability of the government agency or general contractor to alter the price, quantity or delivery schedule of the products. Additionally, government agencies and general contractors typically retain the right to terminate the contract at any time at their convenience. Upon alteration or termination of these contracts, IS&S is entitled typically to an equitable adjustment to the contract price so that it would be compensated for delivered items and allowable costs incurred. However, because these contracts can be terminated for convenience, the Company cannot be assured that its backlog will result in sales.\nThe Company enters into fixed-price contracts or service arrangements to perform specified design and EDC services related to its products that could subject IS&S to losses in the event the Company incurs cost overruns on its projects.\nDuring fiscal year 2022, approximately 2% percent of the Companys total sales were from fixed-price EDC arrangements with customers to perform specified design and EDC services related to its products. These arrangements allow IS&S to benefit by recovering some of its product development costs, but it carries the risk of potential cost overruns. If the Companys initial cost estimates are incorrect, it can incur potentially large one time charges and losses on these contracts. These EDC arrangements can expose the Company to potential losses because the customer may compel IS&S to complete a project or, in the event of a termination for default, pay the incremental cost of its replacement by another provider. Because some of these projects involve new technologies and applications, and can last for more than a year, unforeseen events such as technological difficulties, fluctuations in the price of raw materials, problems with subcontractors, and cost overruns can result in the contractual price becoming less favorable or even unprofitable to IS&S over time. Furthermore, if the Company does not meet project deadlines or if its products do not meet customer specifications, it may need to renegotiate contracts on less favorable terms, be forced to pay penalties or liquidated damages, or suffer losses if the customer exercises its right to terminate. The Companys results of operations are dependent on its ability to maximize earnings from the EDC service arrangements. Lower earnings caused by cost overruns could have a negative impact on the Companys financial condition, operating results, and cash flows.\nA portion of IS&S sales come from government contracts, which could be adversely affected by continued high U.S. federal budget deficits. Government contracts are also subject to special risks as a result of the U.S. governments audit practices.\nA portion of IS&S sales has been, and is expected to continue to be, from defense contractors or government agencies in connection with government aircraft retrofit or OEM contracts. Sales to government contractors and government agencies could decline as a result of DoD spending cuts and general budgetary constraints which may become more severe as the federal budget deficit remains high.\nIn addition, the U.S. government regularly conducts investigations, inquiries and audits into its suppliers compliance with procurement regulations and performance under the relevant government contracts. If an investigation reveals or an audit finds that the Company violated applicable law or regulations, its government contracts could be terminated and it could be restricted from future procurement activities. Moreover, if an investigation, inquiry or audit finds that the Company acted improperly or was involved in illegal activities, the Company could be subject to civil penalties, criminal penalties, and administrative sanctions. As a result, the Companys reputation could be harmed even if the allegations were later determined to be false.\nReductions in government expenditures could adversely affect IS&S business.\nReductions in funding of the DoD and U.S. defense spending could have significant consequences to the Companys business and industry. While the full impact of such reductions is not determinable, the impact of any resulting reductions in defense appropriations, and/or reductions in U.S. defense spending could result in delays in procurement of products and services due to lack of funding, and negatively affect the IS&Ss revenues, financial condition and results of operations.\nThe loss of a key customer or a significant deterioration in the financial condition of a key customer could have a material adverse effect on the Companys results of operations.\nThe Companys revenue is concentrated with a limited number of customers. During fiscal year 2022 IS&S derived 58% of revenue from the top five customers. IS&S expects a relatively small number of customers to account for a majority of its revenues for the foreseeable future. As a result of the concentrated customer base, a loss of one or more of these customers or a dispute or litigation with one of these key customers could affect adversely its revenue and results of operations. The Company monitors and evaluates the credit status of its customers and attempts to adjust sales terms as appropriate. Despite these efforts, a significant deterioration in the financial condition or bankruptcy filing of a key customer could affect adversely the Companys business, results of operations, and financial condition.\nIn addition, the Company is subject to credit risk associated with the concentration of accounts receivable from its key customers. If any of the Companys top customers were to become bankrupt or insolvent or otherwise were unable to pay for the products and services provided by the Company, including as a result of the impact of the COVID-19 pandemic on their businesses or financial conditions, then the Company may incur significant write-offs of accounts receivable, incur other impairment charges or result in a significant loss of expected revenues, which may have a material adverse effect on the Companys results of operations.\nWe self-insure a significant portion of our employee medical insurance program, which may expose us to unpredictable costs and negatively affect our financial performance.\nWe self-insure a significant portion of our employee medical insurance program and related benefit claims. The estimated liability for the self-funded portion of our insurance program is determined actuarially, based on claims filed historically, demographic factors and an estimate of claims incurred but not yet reported. We maintain stop loss insurance coverage to limit our exposure for the self-funded portion of our health insurance program both on a per employee and aggregate basis, and liabilities associated with these losses include estimates of both claims filed and losses incurred but not yet reported. Unanticipated changes in any applicable actuarial assumptions or management estimates underlying our recorded liabilities for these losses could result in materially different amounts of expense than expected under these programs, which could have a material adverse effect on our financial condition and results of operations. In addition, the premiums for this coverage could increase in the future, or we could be forced to raise our self-insured retention amounts. If these expenses increase, or if we experience a claim in excess of our reserve and/or coverage limits, it could also have a material adverse effect on our financial condition and results of operation.\nWe currently operate without a substantial backlog.\nDuring periods of economic uncertainty, the rate of customer orders can quickly decrease, and a substantial backlog may help promote greater efficiency in production, facilitate business planning and improve revenue visibility. As of September 30, 2022, 16% of the Companys backlog was expected to be filled beyond fiscal 2023, which is below the Companys historical expectations and may result in lower revenues in future periods. As a result, future revenue will be dependent on orders booked and shipped in that quarter, and may not be predictable with any degree of certainty. Furthermore, certain contracts may represent a significant portion of our revenue and profits for a quarter such that the loss or deferral of even one such contract could adversely affect our revenue and profitability.\nThe Company has limited experience in marketing and distributing its products internationally.\nIS&S plans to derive increasing revenues from sales outside the United States, particularly in Europe and Asia. Risks inherent in doing business internationally include:\n● differing regulatory requirements;\n● legal uncertainty regarding liability and the enforceability of agreements;\n● tariffs, trade and investment barriers, and other regulatory barriers;\n● political and economic instability, including changes in government budgets;\n● changes in diplomatic and trade relationships;\n● failure by our employees or agents to comply with U.S. laws affecting the activities of U.S. companies abroad, including the Foreign Corrupt Practices Act of 1977, as amended;\n● difficulty with staffing and managing widespread operations;\n● the impact of recessions in economies outside the United States; and\n● variances and unexpected changes in local laws and regulations.\nCurrently, all of the Companys international sales are denominated in U.S. dollars. An increase in the dollars value compared to other currencies could render the Companys products less competitive in the international markets. In the future, IS&S may be required to conduct sales in the foreign countrys local currency, thus exposing it to fluctuations and volatility in exchange rates that could adversely affect its operating results. Further, as we pursue customers in Asia and other less developed markets throughout the world, our potential inability to ensure the creditworthiness of counterparties could impose additional risks and affect our overall profitability. Emerging market operations in particular can present many risks, including cultural differences (such as employment and business practices), volatility in gross domestic product, economic and government instability, and the imposition of exchange controls and capital controls.\nWhile these factors and their impact are difficult to predict, any one or more of them could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nThe Companys competition includes other manufacturers of air data systems and flight information displays against whom it may not be able to compete successfully.\nThe markets for the Companys products are intensely competitive and subject to rapid technological change. Competitors include Honeywell International Inc., Collins Aerospace, Thales Defense & Security, Inc., Garmin Ltd. and GE Aviation Systems. All these competitors have substantially greater financial, technical, and human resources than does IS&S. In addition, these competitors have much greater experience in and resources for marketing their products. As a result, these competitors may be able to respond more quickly to new or emerging technologies and customer preferences, or to devote greater resources to development, promotion and sale of their products than IS&S can. The Companys competitors may have greater name recognition and more extensive customer bases. Such competition could result in price reductions, fewer customer orders, reduced gross margins, and loss of market share.\nGeneral Risk Factors\nThe ongoing COVID-19 pandemic may adversely affect IS&S.\nThe Company has not yet seen a material impact from the COVID-19 pandemic on its business, financial position, liquidity, or ability to service customers or maintain critical operations. However, some parts of the world are continuing to see a rise in COVID-19 cases and hospitalizations, and it is possible that new, more virulent strains and variants of COVID-19 may emerge and lead governments and private sectors to re-institute quarantine and trade restrictions, which could adversely impact market conditions. IS&S will continue to monitor the impact of the COVID-19 pandemic on its business, including how it has impacted and will impact the Companys employees, customers, suppliers and distribution channels. The Company could face liquidity shortages, weaker product demand from its customers, disruptions in its supply chain, and/or staffing shortages in its workforce in the future due to the direct and indirect effects of the COVID-19 pandemic.\nIf IS&S is unable to respond to rapid technological change, its products could become obsolete and its reputation could suffer.\nFuture generations of flat panel displays, air data systems, engine and fuel displays, flight management systems and autothrottle technology which embody new technologies or new industry standards could render the Companys products obsolete. The market for aviation products is subject to rapid technological change, new product introductions, changes in customer preferences, and evolving industry standards and government regulations. The Companys future success will depend on its ability to:\n● embrace rapidly changing technologies;\n● adapt the Companys products to evolving industry standards and government regulations; and\n● develop and introduce timely, high-quality, cost effective new products and product enhancements to address the increasingly sophisticated needs of its customers.\nIf IS&S fails to modify or improve its products in response to evolving industry standards and government regulations, its products could rapidly become obsolete.\nThe Companys products are currently subject to direct regulation by the FAA and other equivalent organizations. The Companys products, as they relate to aircraft applications, must be approved by the FAA, EASA, or other equivalent organizations before they can be installed in an aircraft. To be certified, IS&S must demonstrate that its products are accurate and able to maintain certain levels of repeatability over time. Although the certification requirements of the FAA and EASA are substantially similar, no formal reciprocity exists between the two regulators. Accordingly, even though the Companys products are FAA approved, the Company may need to obtain approval from EASA or other appropriate organizations to have them certified for installation outside the United States.\nSignificant delay in receiving certification for newly developed products or enhancements to the Companys products, or the loss of certification for its existing products, could result in lost sales or delays in sales. Furthermore, new regulations or product standards, and changes to existing product standards could require IS&S to change its products and underlying technology. IS&S cannot ensure that it will receive regulatory approval on a timely basis or at all.\nIS&S relies on third-party suppliers for components of its products, including any necessary raw materials, and any interruption in the supply of these components could hinder its ability to deliver products on a timely basis.\nThe Companys manufacturing process consists primarily of assembling components purchased from its supply chain. The suppliers may not continue to be available to IS&S, including as a result of the impact of the COVID-19 pandemic on their businesses or financial conditions. If the Company is unable to maintain relationships with key third-party suppliers, the development and distribution of its products could be delayed until equivalent components can be obtained and integrated into the products. In addition, substitution of certain components from other manufacturers may require product redesign or FAA, EASA or other approvals, which could delay the Companys ability to ship products, and any increase in component costs, including the costs of any necessary raw materials, in the Companys supply chain could adversely affect the Companys results of operations.\nInasmuch as the Companys products utilize sophisticated technology and are deployed in complex aircraft cockpit environments, problems with these products may arise that could harm the Companys reputation for quality assurance and, consequently, its business prospects.\nThe Companys products use complex system designs and components that may contain errors, omissions, or defects, particularly when the Company incorporates new technologies into its products or when it releases new versions or enhancements of its existing products. Despite the Companys quality assurance process, errors, omissions or defects could occur in its current products, in new products, or in new versions or enhancements of existing products. IS&S may be required to redesign or recall those products or pay damages. Such an event could result in the following:\n● delay or loss of revenues;\n● cancellation of customer contracts;\n● diversion of development resources;\n● damage to the Companys reputation;\n● increased service and warranty costs; or\n● litigation costs.\nAlthough IS&S carries product liability insurance, this insurance may not be adequate to cover its losses in the event of a large product liability claim. In addition, IS&S may not be able to maintain such insurance in the future.\nThe Companys success depends on its ability to protect its proprietary rights against potential risk of infringement. If IS&S is unable to protect and enforce its intellectual property rights, it may be unable to compete effectively.\nThe Companys success and ability to compete will depend in part on its ability to obtain and maintain patent or other protection for its technology and products, both in the United States and internationally. In addition, IS&S must operate without infringing the proprietary rights of others.\nAs of September 30, 2022, IS&S holds 14 U.S. patents and has 3 U.S. patent applications pending relating to its technology. In addition, the Company holds 40 international patents and has 2 international patent applications pending. IS&S cannot be certain that patents will be issued on any of its present or future applications. In addition, existing patents or future patents may not adequately protect the Companys technology if they are not broad enough or are successfully challenged, or if other entities are able to develop competing methods without violating its patents. If IS&S is not successful in protecting its intellectual property, competitors could begin to offer products that incorporate its technology. Patent protection involves complex legal and factual questions, and, therefore, is highly uncertain. Litigation relating to intellectual property is often very time consuming and expensive. If a successful claim of patent infringement were made against IS&S, and if the Company were unable to develop non-infringing technology, or to license the infringed or similar technology on a timely and cost-effective basis, the Company might not be able to produce and sell some of its products. Further, IS&S has incurred, and may continue to incur, significant legal and other costs in defense of its intellectual property.\nIS&S depends on key personnel to manage its business effectively, and an inability to retain its key employees and plan for management succession could adversely impact the Companys ability to compete.\nThe Companys success depends on the efforts, abilities, and expertise of its senior management and other key personnel. There can be no assurance IS&S will be able to retain such employees, and the loss of some could damage its ability to execute its business strategy. The Company intends to continue hiring key management, engineering, and sales and marketing personnel. Competition for skilled personnel is intense, and IS&S may not be able to attract or retain additional qualified personnel.\nThe Companys future success will depend in part on its ability to implement and improve its operational, administrative and financial systems and controls and to manage, train and expand its employee base. IS&S cannot provide assurance that current and planned personnel levels, systems, procedures, and controls will be adequate to support its current and future customer base. In such a circumstance, the Company may not be able to fully capitalize on existing and potential market opportunities. Any delays or difficulties encountered could impair the Companys ability to attract new customers or maintain its relationships with existing customers. In addition, effective succession planning is important to our long-term success. Failure to ensure effective transfer of knowledge and smooth transitions involving senior management and other key personnel could hinder our strategic planning and execution.\nThe Companys revenue and operating results may vary significantly from quarter to quarter, which may cause its stock price to decline.\nThe Companys revenue and operating results may vary significantly from quarter to quarter because of a number of factors, including, but not limited to:\n● demand for products and/or delivery schedule changes by its customers;\n● capital expenditure budgets of aircraft owners and operators, and appropriation cycles of the U.S. government;\n● changes in the use of the Companys products, including air data systems, flat panel displays, flight management systems and autothrottle technology;\n● delays in introducing or obtaining government approval for new products;\n● new product introductions by competitors;\n● changes in IS&S pricing policies or pricing policies of competitors; and\n● costs related to possible acquisition of technologies or businesses.\nA cyber security incident or other technology disruption could have a negative impact on our business.\nWe face certain security threats and technology disruptions, including threats to our information technology (IT) infrastructure, attempts to gain access to our or our customers proprietary or classified information, threats of terrorism events, and failures of our technology tools and systems. Our IT networks and related systems are critical to the operation of our business and essential to our ability to successfully perform day-to-day operations. We are also involved with IT systems for certain customers and other third parties, for which we face similar security threats as for our own, in particular the DoD. In particular, cybersecurity threats-which include, but are not limited to, computer viruses, spyware and malware, attempts to access information, denial of service attacks and other electronic security breaches-are persistent and evolve quickly. In general, such threats have increased in frequency, scope and potential impact in recent years. Further, a variety of technological tools and systems, including both company-owned IT and technological services provided by outside parties, support our critical functions. These technologies, as well as our products, are subject to failure and the users inability to have such technologies properly supported, updated, expanded or integrated into other technologies and, in certain cases, may contain open source and third-party software which may unbeknownst to us contain defects or viruses that pose unintended risks. These risks, if not effectively mitigated or controlled, could materially harm our business or reputation. While we believe that we have implemented appropriate measures and controls, there can be no assurance that such actions will be sufficient to prevent disruptions to critical systems, unauthorized release of confidential information or corruption of data.\nThe security measures we have implemented may become subject to third-party security breaches, employee error, malfeasance, faulty password management or other irregularities. For example, third parties may attempt to fraudulently induce employees or customers into disclosing user names, passwords or other sensitive information, which may in turn be used to access our IT systems. These security systems cannot provide absolute security. To the extent we were to experience a breach of our systems and were unable to protect sensitive data, such a breach could materially damage business partner and customer relationships, and curtail or otherwise impact the use of our IT systems. Moreover, if a security breach of our IT systems affects our computer systems or results in the release of personally identifiable or other sensitive information of customers, business partners, employees and other third parties, our reputation and brand could be materially damaged, use of our products and services could decrease, and we could be exposed to a risk of loss, litigation and potential liability.\nSuch an event could require significant management attention and resources, negatively impact our reputation among our customers and the public and challenge our eligibility for future work on sensitive or classified systems, which could have a material adverse effect on our business, financial condition and results of operations.\nLitigation with customers, employees and others could harm our reputation and impact operating results.\nIn the ordinary course of business, we may be involved in lawsuits and regulatory actions with customers, employees and others. Additionally, we may be subject to employment-related claims alleging discrimination, harassment, wrongful termination and wage issues, including those relating to overtime compensation. We are susceptible to claims filed by customers alleging responsibility for breaches of contract or from product defects, and we are also subject to lawsuits filed by patent holders alleging patent infringement. These types of claims, as well as other types of lawsuits to which we are subject from time to time, can distract managements attention from core business operations and impact operating results, particularly if a lawsuit results in an unfavorable outcome, or could harm the Companys reputation with customers, employees, investors and others.\nTax changes could affect the Companys effective tax rate and future profitability.\nThe Companys future results could be affected negatively by changes in the effective tax rate as a result of changes in the overall profitability and changes to statutory tax rates in the United States and in other jurisdictions, changes in tax legislation, and the results of audits and examinations of previously filed tax returns. In addition, adverse changes in the underlying profitability and financial outlook of our operations or future changes in tax law could lead to changes in the value of tax assets or liabilities that we currently or in the future may hold, which could materially affect our results of operations. Further, the nature and impact of any future changes to tax law, and the resulting impact on our business, financial condition and results of operations, are uncertain.\nThe Company is subject to various laws and regulations. Changes to, or failure by the Company to comply with, these laws and regulations could have a significant impact on the Companys business and operations.\nThe Company is subject to, and must comply with, various laws and regulations, including, but not limited to, the product-related and other regulations of the FAA and the EASA, U.S. government procurement regulations, the rules and regulations of the SEC, and local, state, federal, and international tax codes, import and export controls and customs laws, employment and employment-related laws, environmental laws, intellectual property laws, and consumer protection statutes. Failure to comply with all applicable laws could result in investigation and remediation costs to the Company and could adversely impact the operations and profits of the Company. In addition, the evolving and at times overlapping regulatory regimes to which the Company is subject may change at any time, including as a result of the upcoming change in the U.S. presidential administration. Any changes to existing laws or regulations, or the adoption of new laws or regulations, could increase our compliance costs and operating costs. In addition, failure to timely comply with regulatory changes could cause payments to be withheld and/or an impact on future business.\nVolatility and weakness in capital markets may adversely affect credit availability and related financing costs, which could adversely affect IS&S.\nBank and capital markets can experience periods of volatility and disruption. During these periods of volatility and disruption, risks to IS&S include:\n● declines in revenues and profitability from reduced orders, payment delays or other factors caused by the economic problems of customers;\n● reprioritization of government spending away from defense programs in which IS&S participates;\n● reduced access to credit sources; and\n● disruptions in supplies associated with any financial constraints faced by vendors.\nIf the Company fails to maintain an effective system of internal control over financial reporting, it may not be able to accurately report its financial condition, results of operations or cash flows, which may adversely affect investor confidence in the Company and, as a result, the value of the Companys common stock.\nThe Sarbanes-Oxley Act of 2002, as amended (the Sarbanes-Oxley Act) requires, among other things, that the Company maintain effective internal control over financial reporting and disclosure controls and procedures. Under Section 404 of the Sarbanes-Oxley Act, the Company is required to furnish a report by management on, among other things, the effectiveness of the Companys internal control over financial reporting. This assessment must include disclosure of any material weaknesses identified by management in the Companys internal control over financial reporting. A material weakness is a control deficiency, or combination of control deficiencies, in internal control over financial reporting that results in more than a reasonable possibility that a material misstatement of annual or interim financial statements will not be prevented or detected on a timely basis. Section 404 of the Sarbanes-Oxley Act also generally requires an attestation from the Companys independent registered public accounting firm on the effectiveness of the Companys internal control over financial reporting.\nThe Companys compliance with Section 404 requires that it compile the system and process documentation necessary to perform an appropriate evaluation. During the evaluation and testing process, if the Company identifies one or more material weaknesses in its internal control over financial reporting, it will be unable to assert that its internal control over financial reporting is effective. The Company cannot assure you that there will not be material weaknesses or significant deficiencies in its internal control over financial reporting in the future. Any failure to maintain internal control over financial reporting could severely inhibit the Companys ability to accurately report its financial condition, results of operations or cash flows. If the Company is unable to conclude that its internal control over financial reporting is effective, or if its independent registered public accounting firm determines the Company has a material weakness or significant deficiency in its internal control over financial reporting once that firm begin its reviews, the Company could lose investor confidence in the accuracy and completeness of its financial reports, the market price of its common stock could decline, and it could be subject to sanctions or investigations by NASDAQ, the Securities and Exchange Commission or other regulatory authorities. Failure to remedy any material weakness in the Companys internal control over financial reporting, or to implement or maintain other effective control systems required of public companies, could also restrict the Companys future access to the capital markets. Item 1B. Unresolved Staff Comments.\nNone Item 2. Properties.\nIn fiscal 2001, IS&S purchased 7.5 acres of land in the Eagleview Corporate Park in Exton, Pennsylvania. Shortly thereafter, the Company constructed a 45,000 square foot design, manufacturing and office facility on this site. Land development approval allows for expansion of up to 20,400 square feet. Such expansion would provide for a 65,400 square foot facility which the Company believes is adequate to meet the needs of the Company for the foreseeable future.\nThe Company had occupied approximately 8,358 square feet of office and warehouse space in Exton, Pennsylvania under a lease that expired March 2021. The Companys fiscal year ended September 30, 2021 lease expense for this property was approximately $34,000.\nThe Company leased two separate hangars to house the Companys airplanes in New Castle County, Delaware under month-to-month leases. One hangar lease expired with the sale of the Pilatus PC-12 airplane during the quarter ended September 30, 2022. The annual lease expense for both hangars was approximately $52,000. Item 3. Legal Proceedings.\nIn the ordinary course of business, IS&S is at times subject to various legal proceedings and claims. The Company does not believe any such matters that are currently pending will, individually or in the aggregate, have a material effect on the results of operations or financial position. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for the Registrants Common Equity, Related Stockholder Matters, and Issuer purchases of Equity Securities.\nThe Companys common stock has been traded on the NASDAQ Global Select Market(R) tier of the NASDAQ Stock Market, LLC under the symbol ISSC since its initial public offering on August 4, 2000.\nMany of our shares of common stock are held by brokers and other institutions on behalf of stockholders, as a result, we are unable to estimate the total number of stockholders represented by these record holders.\nThe Company did not pay cash dividends in fiscal 2022. The declaration and payment of any dividend in the future will be at the discretion of the Companys Board of Directors.\nOn September 4, 2020, the Companys Board of Directors declared a special cash dividend in the amount of $0.65 per share, payable on October 1, 2020 to shareholders of record as of the close of business on September 15, 2020. The total dividend payment was approximately $11.2 million.\nOn December 10, 2020, the Companys Board of Directors declared a special cash dividend in the amount of $0.50 per share, payable on December 30, 2020 to shareholders of record as of the close of business on December 21, 2020. The total dividend payment was approximately $8.6 million. Item 6. Selected Consolidated Financial Data.\nThe following tables present portions of the Companys consolidated financial statements. The following selected consolidated financial data set forth below should be read together with Managements Discussion and Analysis of Financial Condition and Results of Operations and the consolidated financial statements and related notes to the consolidated financial statements appearing elsewhere herein. The selected statement of operations data for the fiscal years ended September 30, 2022, 2021 and 2020 and the balance sheet data as at September 30, 2022 and 2021 are derived from the Companys audited consolidated financial statements included elsewhere in this Annual Report on Form 10-K. The selected statements of operations data for the fiscal years ended September 30, 2019 and 2018 and the balance sheet data as at September 30, 2020, 2019 and 2018 are extracted from the Companys audited consolidated financial statements that are not included in this Annual Report on Form 10-K.\nFiscal year ended September 30,\nStatements of Operations Data:\nNet sales\n$\n27,740,695\n$\n23,044,796\n$\n21,595,199\n$\n17,572,589\n$\n13,850,372\nCost of sales\n11,066,314\n10,263,166\n9,793,224\n7,676,119\n7,311,923\nGross profit\n16,674,381\n12,781,630\n11,801,975\n9,896,470\n6,538,449\nResearch and development\n2,705,140\n2,622,919\n2,955,976\n2,489,806\n3,575,801\nSelling, general and administrative\n6,753,915\n6,257,732\n6,100,545\n5,877,920\n6,674,187\nTotal operating expenses\n9,459,055\n8,880,651\n9,056,521\n8,367,726\n10,249,988\nOperating income (loss)\n7,215,326\n3,900,979\n2,745,454\n1,528,744\n(3,711,539)\nInterest income\n61,051\n1,234\n154,950\n249,620\n53,561\nOther income\n65,232\n74,906\n60,497\n73,737\n67,724\nIncome (loss) before income taxes\n7,341,609\n3,977,119\n2,960,901\n1,852,101\n(3,590,254)\nIncome tax expense (benefit)\n1,817,831\n(1,087,783)\n(308,882)\n1,805\n63,651\nNet Income (loss)\n$\n5,523,778\n$\n5,064,902\n$\n3,269,783\n$\n1,850,296\n$\n(3,653,905)\nNet income (loss) per common share:\nBasic\n$\n0.32\n$\n0.29\n$\n0.19\n$\n0.11\n$\n(0.22)\nDiluted\n$\n0.32\n$\n0.29\n$\n0.19\n$\n0.11\n$\n(0.22)\nCash dividends declared per common share\n$\n-\n$\n0.50\n$\n0.65\n$\n-\n$\n-\nWeighted average shares outstanding:\nBasic\n17,256,750\n17,225,423\n16,939,302\n16,867,550\n16,805,991\nDiluted\n17,257,871\n17,226,620\n17,114,191\n16,942,447\n16,805,991\nAs of September 30,\nBalance Sheet Data:\nCash and cash equivalents\n$\n17,250,546\n$\n8,265,606\n$\n12,603,967\n$\n22,416,830\n$\n20,390,713\nRestricted Cash\n-\n-\n11,180,900\n-\n-\nWorking capital\n24,262,016\n15,218,172\n19,473,305\n27,739,070\n25,315,334\nTotal assets\n34,705,323\n27,086,000\n41,545,837\n38,557,025\n37,633,678\nTotal shareholders equity\n30,749,955\n24,585,081\n27,769,031\n36,208,152\n34,154,470 Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nObjective\nThe following discussion provides an analysis of the Companys financial condition, cash flows and results of operations from managements perspective and should be read in conjunction with Selected Consolidated Financial Data and the consolidated financial statements and related notes included in this report. Our objective is to also provide discussion of events and uncertainties known to management that are reasonably likely to cause reported financial information not to be indicative of future operating results or of future financial condition and to offer information that provides understanding of our financial condition, cash flows and results of operations.\nOverview\nInnovative Solutions and Support, Inc. (the Company, IS&S, we or us) was incorporated in Pennsylvania on February 12, 1988. The Company operates in one business segment as a systems integrator that designs, develops, manufactures, sells, and services, air data equipment, engine display systems, standby equipment, primary flight guidance, autothrottles and cockpit display systems for retrofit applications and original equipment manufacturers (OEMs). The Company supplies integrated Flight Management Systems (FMS), Flat Panel Display Systems (FPDS), FPDS with Autothrottle, air data equipment, Integrated Standby Units (ISU), ISU with Autothrottle and advanced GPS receivers that enable reduced carbon footprint navigation.\nThe Company has continued to position itself as a system integrator, which provides the Company with the capability and potential to generate more substantive orders over a broader product base. This strategy, as both a manufacturer and integrator, is designed to leverage the latest technologies developed for the computer and telecommunications industries into advanced and cost-effective solutions for the general aviation, commercial air transport, United States Department of Defense (DoD)/governmental, and foreign military markets. This approach, combined with the Companys industry experience, is designed to enable IS&S to develop high-quality products and systems, to reduce product time to market and to achieve cost advantages over products offered by its competitors.\nThe Company sells to both the OEM and the retrofit markets. Customers include various OEMs, commercial air transport carriers and corporate/general aviation companies, DoD and its commercial contractors, aircraft operators, aircraft modification centers, government agencies, and foreign militaries. Occasionally, IS&S sells its products directly to DoD; however, the Company sells its products primarily to commercial customers for end use in DoD programs. Sales to defense contractors are generally made on commercial terms, although some of the termination and other provisions of government contracts are applicable to these contracts. The Companys retrofit projects are generally pursuant to either a direct contract with a customer or a subcontract with a general contractor to a customer (including government agencies).\nCost of sales related to product sales comprises material, components and third-party avionics purchased from suppliers, direct labor, and overhead costs. Many of the components are standard, although certain parts are manufactured to meet IS&S specifications. The overhead portion of cost of sales primarily comprises salaries and benefits, building occupancy costs, supplies, and outside service costs related to production, purchasing, material control, and quality control. Cost of sales includes warranty costs.\nCost of sales related to Engineering Development Contracts (EDC) sales comprises engineering labor, consulting services, and other costs associated with specific design and development projects. These costs are incurred pursuant to contractual arrangements and are accounted for typically as contract costs within cost of sales, with the reimbursement accounted for as a sale in accordance with the percentage-of-completion method or completed contract method of accounting. Company funded research and development (R&D) expenditures relate to internally-funded efforts for the development of new products and the improvement of existing products. These costs are expensed as incurred and reported as R&D expenses. The Company intends to continue investing in the development of new products that complement current product offerings and to expense associated R&D costs as they are incurred.\nSelling, general and administrative expenses consist of sales, marketing, business development, professional services, salaries and benefits for executive and administrative personnel, facility costs, recruiting, legal, accounting and other general corporate expenses.\nIS&S sells its products to agencies of the United States and foreign governments, aircraft operators, aircraft modification centers, and OEMs. Customers have been and may continue to be affected by changes in economic conditions both in the United States and abroad. Such changes may cause customers to curtail or delay their spending on both new and existing aircraft. Factors that can impact general economic conditions and the level of spending by customers include, but are not limited to, the impact of the ongoing COVID-19 pandemic, general levels of consumer spending, increases in fuel and energy costs, conditions in the real estate and mortgage markets, labor and healthcare costs, access to credit, consumer confidence, and other macroeconomic factors that affect spending behavior. Furthermore, spending by government agencies may be reduced in the future if tax revenues decline. If customers curtail or delay their spending or are forced to declare bankruptcy or liquidate their operations because of adverse economic conditions, the Companys revenues and results of operations would be affected adversely. For example, earlier in the 2020 fiscal year, certain of the Companys customers temporarily suspended product deliveries as a result of the COVID-19 pandemic, and while these deliveries subsequently resumed, there is a possibility that the COVID-19 pandemic will result in other suspensions, delays or order cancellations by the Companys customers or suppliers.\nIn particular, the ongoing COVID-19 pandemic is a significant event, driver of market trends, and source of uncertainty that may ultimately have a direct or indirect material impact on the Companys business, financial position, liquidity, or ability to service customers or maintain critical operations. In direct response to the COVID-19 pandemic, the Company has taken specific actions to seek to ensure the safety of its employees, including temperature monitoring, frequent sanitization of workspaces, observance of social distancing protocols, and other increased safety measures.\nResults of Operations\nThe following table sets forth statements of operations data expressed as a percentage of total net sales for the fiscal years indicated:\nTwelve Months Ending September 30,\nNet sales:\nProduct\n98.3\n%\n98.8\n%\n96.3\n%\nEngineering development contracts\n1.7\n%\n1.2\n%\n3.7\n%\nTotal net sales\n100.0\n%\n100.0\n%\n100.0\n%\nCost of sales:\nProduct\n39.3\n%\n44.2\n%\n44.3\n%\nEngineering development contracts\n0.6\n%\n0.3\n%\n1.0\n%\nTotal cost of sales\n39.9\n%\n44.5\n%\n45.3\n%\nGross profit\n60.1\n%\n55.5\n%\n54.7\n%\nOperating expenses:\nResearch and development\n9.8\n%\n11.4\n%\n13.7\n%\nSelling, general and administrative\n24.3\n%\n27.1\n%\n28.2\n%\nTotal operating expenses\n34.1\n%\n38.5\n%\n41.9\n%\nOperating income\n26.0\n%\n17.0\n%\n12.8\n%\nInterest income\n0.2\n%\n0.0\n%\n0.7\n%\nOther income\n0.2\n%\n0.3\n%\n0.3\n%\nIncome before income taxes\n26.4\n%\n17.3\n%\n13.8\n%\nIncome tax expense (benefit)\n6.5\n%\n(4.7)\n%\n(1.3)\n%\nNet income\n19.9\n%\n22.0\n%\n15.1\n%\nFiscal Year Ended September 30, 2022 Compared to Fiscal Year Ended September 30, 2021\nNet sales. Net sales for fiscal 2022 increased $4.7 million, or 20.4%, to $27.7 million from $23.0 million for fiscal 2021. For fiscal 2022, product sales increased $3.7 million and customer service sales increased $0.8, or 20.8% from fiscal 2021. This increase in product sales primarily reflects increased shipments of aftermarket retrofit displays to commercial customers. OEM sales to general aviation customers were relatively flat compared to fiscal 2021 at $10.4 million. Military sales were up slightly from fiscal 2021 at $2.8 million, which was up $0.3 million or 13.5%. The increase in customer service revenue was mainly due to increases in repair work from the Department of Defense.\nCost of sales. Cost of sales was $11.1million or 39.9% of net sales, for fiscal 2022 compared to $10.3 million, or 44.5% of net sales, in fiscal 2021. The increase in cost of sales was primarily the result of an increase in product sales volume. The Companys overall gross margin in fiscal 2021 was 60.1% compared to 55.5% in fiscal 2021. The fiscal 2022 gross margin percentage increase was attributable to operating leverage achieved due to increased sales that resulted in increased cost absorption, as well as a favorable product mix.\nResearch and development. R&D expense was $2.7 million for fiscal 2022 and $2.6 million for fiscal 2021. R&D expense decreased to 9.8% of net sales in fiscal 2022 compared to 11.4% of net sales in fiscal 2021. This decrease in R&D expense as a percent of net sales was due to lower salaries and benefits due to lower headcount, along with fewer R&D related projects, including STC certifications.\nSelling, general, and administrative (SG&A). SG&A expense increased $0.5 million or 7.9% to $6.8 million from $6.3 million in fiscal 2021. The increase in SG&A expense was primarily the result of increased legal, and professional fees, with an offset due to the sale of a PC-12 aircraft.\nInterest income. Interest income of $61,051 in fiscal 2022 increased by $59,817 as compared to fiscal 2021 interest income of $1,234. The increase in interest income was primarily the result of the increase in the cash balance in fiscal 2022 and a general increase in interest rates as compared to fiscal 2021.\nOther income. Other income was flat at $0.1 million for both fiscal 2022 and fiscal 2021.\nIncome taxes. Income tax expense of $1.8 million for fiscal 2022 as compared to income tax benefit of $1.1 million in fiscal 2021. The effective tax rate benefit for fiscal 2021 was 27.4% and differs from the statutory rate primarily due to the release of the valuation allowance for all federal and state deferred tax assets. This release both increased the deferred tax asset and removed the valuation allowance. Fiscal 2022 income tax expense of $1.8 million represents income taxes due based on an effective tax rate of 24.7% with no related allowances.\nNet income. As a result of the factors described above, the Companys net income for fiscal 2022 was $5.5 million compared to net income of $5.1 million for fiscal 2021. On a fully diluted basis, net income per share was $0.32 for fiscal 2022, compared to a net income of $0.29 per share for fiscal 2021.\nFiscal Year Ended September 30, 2021 Compared to Fiscal Year Ended September 30, 2020\nNet sales. Net sales for fiscal 2021 increased $1.4 million, or 6.7%, to $23.0 million from $21.6 million for fiscal 2020. For fiscal 2021, product sales increased $1.9 million and EDC sales decreased $0.5 million, in each case, compared to fiscal 2020. This increase in product sales primarily reflects increased shipments for OEM programs to general aviation customers and displays for retrofit programs to commercial transport customers. These increases were partially offset by reduced shipments under the U.S. Navy production contract and displays for retrofit programs to other military customers compared to fiscal 2020. The decrease in EDC sales was primarily the result of the completion of a modification contract with the U.S. Navy in 2020.\nCost of sales. Cost of sales was $10.3 million or 44.5% of net sales, for fiscal 2021 compared to $9.8 million, or 45.3% of net sales, in fiscal 2020. The increase in cost of sales was primarily the result of an increase in product sales volume. The Companys overall gross margin in fiscal 2021 was 55.5% compared to 54.7% in fiscal 2020. The fiscal 2021 gross margin percentage increase was attributable to product mix as well as the favorable leverage achieved by the growth in revenues.\nResearch and development. R&D expense was $2.6 million for fiscal 2021 and $3.0 million for fiscal 2020. R&D expense decreased to 11.4% of net sales in fiscal 2021 compared to 13.7% of net sales in fiscal 2020. This decrease in R&D expense was primarily the result of a decrease in third party costs related to STC certifications offset by an increase in payroll and payroll related benefits.\nSelling, general, and administrative (SG&A). SG&A expense increased $0.2 million or 2.6% to $6.3 million or 27.2% of net sales, for fiscal 2021 from $6.1 million, or 28.2%, for fiscal 2020. The increase in SG&A expense was primarily the result of an increase in employee stock compensation, payroll and payroll related benefits.\nInterest income, net. Net interest income of $1,234 in fiscal 2021 decreased by $153,716 as compared to fiscal 2020 interest income of $154,950. The decrease in interest income was primarily the result of decreased cash balance and lower interest rates in fiscal 2021 as compared to fiscal 2020.\nOther income. Other income is primarily composed of royalties earned and increased by $14,409, to $74,906 in fiscal 2021 from $60,497 in fiscal 2020.\nIncome taxes. Income tax benefit for fiscal 2021 was $1,087,783 as compared to income tax benefit of $308,882 for fiscal 2020. The effective tax rate benefit for fiscal 2021 was 27.4% and differs from the statutory rate primarily due to the release of the valuation allowance for all federal and state deferred tax assets with the exception of certain state net operating losses for jurisdictions in which the Company does not believe these net operating losses are more likely than not to be realized. This release both increased the deferred tax asset and removed the valuation allowance.\nNet income. As a result of the factors described above, the Companys net income for fiscal 2021 was $5.1 million compared to net income of $3.3 million for fiscal 2020. On a fully diluted basis, net income per share was $0.29 for fiscal 2021, compared to a net income of $0.19 per share for fiscal 2020.\nLiquidity and Capital Resources\nThe following table highlights key financial measurements of the Company:\nSeptember 30,\nSeptember 30,\nCash and cash equivalents\n$\n17,250,546\n$\n8,265,606\nAccounts receivable\n$\n4,297,457\n$\n4,046,337\nCurrent assets\n$\n28,202,319\n$\n17,690,411\nCurrent liabilities\n$\n3,940,303\n$\n2,472,239\nContract liability\n$\n135,686\n$\n61,330\nOther non-current liabilities (1)\n$\n15,065\n$\n28,680\nQuick ratio (2)\n5.47\n4.98\nCurrent ratio (3)\n7.16\n7.16\nTwelve Months Ended September 30,\nCash flow activities:\nNet cash provided by operating activities\n$\n6,094,440\n$\n4,592,499\n$\n2,192,167\nNet cash provided by (used in) investing activities\n2,589,346\n(340,678)\n(118,797)\nNet cash provided by (used in) financing activities\n301,154\n(19,771,082)\n(705,333)\n(1) Excludes contract liability\n(2) Calculated as: the sum of cash and cash equivalents plus accounts receivable, net, divided by current liabilities\n(3) Calculated as: current assets divided by current liabilities\nThe Companys principal source of liquidity has been cash flows from current year operations and cash accumulated from prior years operations. Cash is used principally to finance inventory, accounts receivable, contract assets, and payroll, as well as the Companys known contractual and other commitments (including those described in Note 16, Lease Recognition. The Companys existing cash balances and anticipated cash flows from operations are expected to be adequate to satisfy the Companys liquidity needs for at least the next 12 months. Apart from what has been disclosed above, management is not aware of any trends, events or uncertainties that have had or are likely to have a material impact on our liquidity, financial condition and capital resources.\nThe Company did not pay cash dividends in fiscal 2022. The declaration and payment of any dividend in the future will be at the discretion of the Companys Board of Directors.\nOn September 4, 2020, the Companys Board of Directors declared a special cash dividend in the amount of $0.65 per share, payable on October 1, 2020 to shareholders of record as of the close of business on September 15, 2020. The total dividend payment was approximately $11.2 million.\nOn December 10, 2020, the Companys Board of Directors declared a special cash dividend in the amount of $0.50 per share, payable on December 30, 2020 to shareholders of record as of the close of business on December 21, 2020. The total dividend payment was approximately $8.6 million.\nThe ongoing COVID-19 pandemic is a significant event, driver of market trends, and source of uncertainty that may have a material impact on the Companys liquidity, financial condition, capital resources, cash flows or operating results. In direct response to the COVID-19 pandemic, the Company has taken specific actions to seek to ensure the safety of its employees, including temperature monitoring, frequent sanitization of workspaces, observance of social distancing protocols, and other increased safety measures.\nOperating Activities\nThe Company generated $6.1 million of cash from operating activities during fiscal 2022 as compared to cash generated of $4.6 million during fiscal 2021. The cash generated by operating activities for the year ended September 30, 2022 was primarily generated by net income of $5.5 million, increase in accrued expenses of $1.3 million and a decrease in deferred income tax assets of $1.0 million, partially offset by the gain on sale of the Companys Pilatus PC-12 airplane of $1.2 million and an increase in inventories of $0.7 million.\nThe Company generated $4.6 million of cash in operating activities during fiscal 2021 as compared to cash generated of $2.2 million during fiscal 2020. The cash generated by operating activities for the year ended September 30, 2021 was primarily generated by net income of $5.1 million, depreciation and amortization of $0.4 million and a decrease in accounts receivable of $0.3 million, partially offset by an increase in deferred income tax assets of $1.2 million.\nInvesting Activities\nCash provided by investing activities was $2.6 million for fiscal year 2022 and consisted primarily of proceeds from the sale of the Companys Pilatus PC-12 airplane offset by spending of $0.2 million primarily for quality test equipment and computer hardware. The Company plans to continue investing in capital equipment to support engineering development efforts and operations.\nCash used in investing activities was $0.3 million for fiscal year 2021 and consisted of spending for manufacturing facility and laboratory test equipment. The Company plans to continue investing in capital equipment to support engineering development efforts and operations.\nFinancing Activities\nCash provided by financing activities was $0.3 million for fiscal year 2022 and consisted of proceeds from employees exercise of stock options. Cash used by financing activities was $19.8 million for fiscal year 2021 and consisted primarily of dividends paid.\nSummary\nFuture capital requirements depend upon numerous factors, including market acceptance of the Companys products, the timing and rate of expansion of business, acquisitions, joint ventures, and other factors. IS&S has experienced increases in expenditures since its inception and anticipates that expenditures will remain relatively constant with the levels experienced in fiscal 2022 and fiscal 2021. The Company believes that its cash and cash equivalents will provide sufficient capital to fund operations for at least the next twelve months. Further, IS&S may need to develop and introduce new or enhanced products, to respond to competitive pressures, to invest in or acquire businesses or technologies, or to respond to unanticipated requirements or developments. If insufficient funds are available, the Company may not be able to introduce new products or to compete effectively.\nInflation\nIS&S does not believe inflation had a material effect on its financial position or results of operations during the past three years; however, it cannot predict future effects of inflation.\nImpact of the COVID-19 Pandemic\nThe Company has not yet seen a material impact from the COVID-19 pandemic on its business, financial position, liquidity, or ability to service customers or maintain critical operations. However, some parts of the world are continuing to see a rise in COVID-19 cases and hospitalizations and it is possible that new, more virulent strains and variants of COVID-19 may emerge and lead governments and private sectors to re-institute quarantine and trade restrictions, which could adversely impact market conditions. IS&S will continue to monitor the impact of the COVID-19 pandemic on its business, including how it has impacted and will impact the Companys employees, customers, suppliers and distribution channels. The Company could face liquidity shortages, weaker product demand from its customers, disruptions in its supply chain, and/or staffing shortages in its workforce in the future due to the direct and indirect effects of the COVID-19 pandemic.\nEnvironmental, Social and Governance Considerations\nIn recent years, environmental, social and governance (ESG) issues have become an increasing area of focus for some of our shareholders, customers and suppliers. Management and the Companys Board of Directors are committed to identifying, assessing, and understanding the potential impact of ESG issues and related risks on the Companys business model, as well as potential areas of improvement.\nWe are committed to recruiting, motivating and developing a diversity of talent. We are an equal opportunity employer and a Vietnam Era Veterans Readjustment Assistance Act federal contractor. All qualified applicants receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.\nThe nature of our business also supports long-term sustainability. Historically, a majority of the Companys sales have come from the retrofit market, in which the Company, by making upgrades to improve the functionality and safety of existing machinery, facilitates the re-use and recycling of aircraft and equipment that might otherwise be scrapped as obsolete. The Companys GPS receivers also facilitate reduced carbon footprint navigation. The Company also plans to enhance its focus on the environmental impact of its operations.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP) requires management to make estimates and assumptions that affect reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. The Companys most critical accounting policies are revenue recognition, income taxes and inventory valuation.\nRevenue recognition\nThe Company enters into sales arrangements with customers that, in general, provide for the Company to design, develop, manufacture and deliver large flat-panel display systems, flight information computers, autothrottles and advanced monitoring systems that measure and display critical flight information, including data relative to aircraft separation, airspeed, altitude, and engine and fuel data measurements.\nRevenue from Contracts with Customers\nThe Company accounts for revenue in accordance with ASC 606, Revenue from Contracts with Customers (ASC 606). The core principle of ASC 606 is that an entity recognizes revenue when a customer obtains control of promised goods or services. The amount of revenue recognized reflects the consideration to which the Company expects to be entitled to receive in exchange for these goods or services. To achieve this core principle, the Company applies the following five steps:\n1) Identify the contract with a customer\nThe Companys contract with its customers typically is the form of a purchase order issued to the Company by its customers and, to a lesser degree, in the form of a purchase order issued in connection with a formal contract executed with a customer. For the purpose of accounting for revenue under ASC 606, a contract with a customer exists when (i) the Company enters into an enforceable contract with a customer that defines each partys rights regarding the goods or services to be transferred and identifies the payment terms related to these goods or services, (ii) the contract has commercial substance and, (iii) the Company determines that collection of substantially all consideration for goods or services that are transferred is probable based on the customers intent and ability to pay the promised consideration. Payment terms are defined by when payment is typically due. The Company applies judgment in determining the customers ability and intention to pay, which is based on a variety of factors including the customers historical payment experience or, in the case of a new customer, published credit and financial information pertaining to the customer.\n2) Identify the performance obligations in the contract\nPerformance obligations promised in a contract are identified based on the goods or services that will be transferred to the customer that are both capable of being distinct, whereby the customer can benefit from the good or service either on its own or together with other resources that are readily available from third parties or from the Company, and are distinct in the context of the contract, whereby the transfer of the goods or services is separately identifiable from other promises in the contract. Most of our revenue is derived from purchases under which we provide a specific product or service and, as a result, there is only one performance obligation. In the event that a contract includes multiple promised goods or services, such as an EDC contract which includes both engineering services and a resulting product shipment, the Company must apply judgment to determine whether promised goods or services are capable of being distinct in the context of the contract. In these cases, the Company considers whether the customer could, on its own, or together with other resources that are readily available from third parties, produce the physical product using only the output resulting from the Companys completion of engineering services. If the customer cannot produce the physical product, then the promised goods or services are accounted for as a combined performance obligation.\n3) Determine the transaction price\nThe transaction price is determined based on the consideration to which the Company will be entitled in exchange for transferring goods or services to the customer. To the extent the transaction price includes variable consideration, the Company estimates the amount of variable consideration that should be included in the transaction price utilizing either the expected value method or the most likely amount method depending on the nature of the variable consideration. Variable consideration is included in the transaction price if, in the Companys judgment, it is probable that a significant future reversal of cumulative revenue under the contract will not occur.\n4) Allocate the transaction price to performance obligations in the contract\nIf the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. The Company determines standalone selling price based on the price at which the performance obligation is sold separately. If the standalone selling price is not observable through past transactions, the Company estimates the standalone selling price by taking into account available information such as market conditions as well as the cost of the goods or services and the Companys normal margins for similar performance obligations.\n5) Recognize revenue when or as the Company satisfies a performance obligation\nThe Company satisfies performance obligations either over time or at a point in time as discussed in further detail below. Revenue is recognized at the time the related performance obligation is satisfied by transferring a promised good or service to a customer. Historically, the Company has also recognized revenue from EDC contracts and is recognized over time using an input measure (e.g., costs incurred to date relative to total estimated costs at completion) to measure progress. Contract costs include material, components and third-party avionics purchased from suppliers, direct labor, and overhead costs.\nContract Balances\nContract assets consist of the right to consideration in exchange for product offerings that we have transferred to a customer under the contract. Contract liabilities primarily relate to consideration received in advance of performance under the contract.\nCustomer Service Revenue\nThe Company enters into sales arrangements with customers for the repair or upgrade of its various products that are not under warranty. The Companys customer service revenue and cost of sales are included in product sales and product cost of sales, respectively, on the accompanying consolidated statements of operations.\nIncome taxes\nIncome taxes are recorded in accordance with ASC Topic 740, Income Taxes (ASC Topic 740), which utilizes a balance sheet approach to provide for income taxes. Under this method, the Company recognizes deferred tax assets and liabilities for temporary differences between the financial reporting basis and the tax basis of the Companys assets, liabilities, and expected benefits of utilizing NOLs and tax credit carry-forwards. The impact on deferred taxes of changes in tax rates and laws, if any, are applied to the years during which temporary differences are expected to be settled, and are reflected in the consolidated financial statements in the period of enactment. At the end of each interim reporting period, the Company prepares an estimate of the annual effective income tax rate and applies that annual effective income tax rate to ordinary year-to-date pre-tax income for the interim period. Specific tax items discrete to a particular quarter are recorded in income tax expense for that quarter. The estimated annual effective tax rate used in providing for income taxes on a year-to-date basis may change in subsequent periods.\nDeferred tax assets are reduced by a valuation allowance if, based on the consideration of all available evidence, it is more likely than not that some portion of the deferred tax asset will not be realized. Significant weight is given to evidence that can be verified objectively, and significant management judgment is required in determining any valuation allowance recorded against net deferred tax assets. The Company evaluates deferred income taxes on a quarterly basis to determine if a valuation allowance is required by considering available evidence. Deferred tax assets are recognized when expected future taxable income is sufficient to allow the related tax benefits to reduce taxes that would otherwise be payable. The sources of taxable income that may be available to realize the benefit of deferred tax assets are future reversals of existing taxable temporary differences, future taxable income exclusive of reversing temporary differences and credit carryforwards, taxable income in carry-back years, and tax planning strategies which are both prudent and feasible. For the year ended September 30, 2021, the valuation allowance was released against all federal and state deferred tax assets with the exception of certain state net operating losses due to positive evidence that the assets are more likely than not to be realized in future years. The Company will continue to assess all available evidence during future periods to evaluate any changes to the realization of its deferred tax assets. If the Company were to determine that it would be able to realize additional state deferred tax assets in the future, it would make an adjustment to the valuation allowance which would reduce the provision for income taxes.\nThe accounting for uncertainty in income taxes requires a more likely than not threshold for financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. The Company records a liability for the difference between the (i) benefit recognized and measured for financial statement purposes and (ii) the tax position taken or expected to be taken on the Companys tax return. To the extent that the Companys assessment of such tax positions changes, the change in estimate is recorded in the period in which the determination is made. The Company has elected to record any interest or penalties associated with uncertain tax positions as income tax expense.\nThe Company files a consolidated U.S. federal income tax return. The Company prepares and files tax returns based on the interpretation of tax laws and regulations, and records estimates based on these judgments and interpretations. In the normal course of business, the tax returns are subject to examination by various taxing authorities. Such examinations may result in future tax and interest assessments by these taxing authorities, and the Company records a liability when it is probable that there will be an assessment. The Company adjusts the estimates periodically as a result of ongoing examinations by and settlements with the various taxing authorities, and changes in tax laws, regulations and precedent. The consolidated tax provision of any given year includes adjustments to prior years income tax accruals that are considered appropriate, and any related estimated interest. Management believes that it has made adequate accruals for income taxes. Differences between estimated and actual amounts determined upon ultimate resolution, individually or in the aggregate, are not expected to have a material effect on the Companys consolidated financial position but could possibly be material to its consolidated results of operations or cash flow of any one period.\nIn March 2020, in response to the COVID-19 pandemic, the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) was signed into law to provide emergency assistance to affected individuals, families, and businesses. The CARES Act provides numerous tax provisions and other stimulus measures, including temporary changes regarding the prior and future utilization of NOLs. The CARES Act amends the NOL provisions of the Tax Act, allowing for the carryback of losses arising in tax years beginning before December 31, 2017, to each of the two taxable years preceding the taxable year of loss. Approximately $1,500,000 of pre-tax NOL was carried back two years to fully offset taxable income. This carryback frees up previously utilized R&D credits, resulting in an estimated increase in R&D credit carryforward of $196,000. The carryback created approximately $16,000 of AMT tax, which was refunded. The cash impact of this carryback was $309,412. A receivable was setup for this amount as of March 31, 2020 and the cash has since been received.\nIn December 2020, the Consolidations Appropriations Act of 2020 (the CAA) was enacted as a supplement to the CARES Act legislation providing additional financial relief to taxpayers adversely impacted by restrictions put into place in response to the COVID-19 pandemic. In addition, the CCA provides funding for public health initiatives in response to the pandemic. This legislation did not have a material impact on the Companys tax position.\nIn March 2021, the American Rescue Plan Act of 2021 (the ARPA), which includes certain business tax provisions, was signed into law. This legislation did not have a material impact on the Companys tax position.\nIn August 2022, the U.S government enacted the Inflation Reduction Act (the IRA). The IRA makes the following changes to the U.S tax code: imposes a corporate alternative minimum tax of 15% on corporations with an average annual Adjusted Financial Statement Income over a three year period in excess of $1 billion, increases the amount of R&D credit that qualified businesses can apply against payroll taxes to $500,000, imposes an excise tax equal to one percent of the fair market value of stock of a publicly traded U.S. corporation that is repurchased by the company. These changes predominately apply to tax years beginning after December 31, 2022. It does not appear that this legislation will have a material impact on the Companys tax position.\nInventory valuation\nThe Company values inventory at the lower of cost (first-in, first-out) or net realizable value. Inventories are written down for estimated obsolescence equal to the difference between inventory cost and estimated net realizable value based on a combination of historical usage and assumptions based on expected usage related to estimated future customer and market demands. The Companys method of valuing inventory contains uncertainties because the calculation requires management to consider inventory aging, to make assumptions regarding expected usage, and to apply judgments on forecasted future demand, market conditions, and technological obsolescence. If actual future demand or market conditions are less favorable than those projected by management, additional inventory write-down may be required.\nNew Accounting Pronouncements\nIn June 2016, FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instrument (ASU 2016-13). ASU 2016-13 replaces the incurred loss impairment methodology in current U.S. GAAP with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to inform credit loss estimates. ASU 2016-13 is effective for SEC small business filers for fiscal years beginning after December 15, 2022. The adoption of this standard is not expected to have a material impact on our condensed consolidated financial statements or related disclosures.\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12), which simplifies the accounting for income taxes, eliminates certain exceptions within Accounting Standards Codification Topic 740, Income Taxes (ASC 740), and clarifies certain aspects of ASC 740 to promote consistency among reporting entities. We adopted this update effective October 1, 2021. The adoption of this standard did not have a material impact on our condensed consolidated financial statements or related disclosures.\nAs new accounting pronouncements are issued, we will adopt those that are applicable.\nBusiness Segments\nThe Company operates in one business segment as a systems integrator that designs, develops, manufactures, sells, and services flight guidance and cockpit display systems for OEMs and retrofit applications. Customers include various OEMs, commercial air transport carriers and corporate/general aviation companies, DoD and its commercial contractors, aircraft operators, aircraft modification centers, government agencies, and foreign militaries. The Company currently derives the majority of its revenues from the sale of this equipment and related EDC services. Most of the Companys sales, operating results and identifiable assets are generated in the United States. In fiscal years 2022, 2021 and 2020 net sales outside the United States amounted to $11.1 million, $8.4 million and $9.4 million, respectively. Item 7A. Quantitative and qualitative disclosures about market risk.\nThe Companys operations are exposed to market risks primarily as a result of changes in interest rates. The Company does not use derivative financial instruments for speculative or trading purposes. The Companys exposure to market risk for changes in interest rates relates to its cash equivalents. The Companys cash equivalents consist of funds invested in money market funds, which bear interest at a variable rate. The Company does not participate in interest rate hedging. A change in interest rates earned on the Companys cash equivalents would impact interest income and cash flows but would not impact the fair market value of the underlying instruments. Assuming that the balances during fiscal 2022 were to remain constant and that the Company did not act to alter the existing interest rate sensitivity, a hypothetical 1% increase in variable interest rates would have affected interest income by approximately $88,000. This would result in a net impact on cash of approximately $88,000 for fiscal 2022. Item 8. Financial statements and supplementary data.\nThe financial statements of Innovative Solutions and Support, Inc. listed in the index appearing under Item 8 herein are filed as part of this Report.\nInnovative Solutions and Support, Inc.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm PCAOB ID Number 248\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Shareholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\n43-60\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nInnovative Solutions & Support, Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of Innovative Solutions & Support, Inc. (a Pennsylvania corporation) and subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, shareholders equity, and cash flows for each of the three years in the period ended September 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2014.\nPhiladelphia, Pennsylvania\nDecember 16, 2022\nINNOVATIVE SOLUTIONS AND SUPPORT, INC.\nCONSOLIDATED BALANCE SHEETS\nSeptember 30,\nSeptember 30,\nASSETS\nCurrent assets\nCash and cash equivalents\n$\n17,250,546\n$\n8,265,606\nAccounts receivable\n4,297,457\n4,046,337\nContract asset\n162,742\n-\nInventories\n5,349,104\n4,545,392\nPrepaid expenses and other current assets\n1,142,470\n833,076\nTotal current assets\n28,202,319\n17,690,411\nProperty and equipment, net\n6,292,189\n8,143,483\nDeferred income taxes\n46,487\n1,063,822\nOther assets\n164,328\n188,284\nTotal assets\n$\n34,705,323\n$\n27,086,000\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities\nAccounts payable\n$\n708,845\n$\n623,620\nAccrued expenses\n2,972,275\n1,431,115\nContract liability\n135,686\n61,330\nContract liability - related party\n123,497\n356,174\nTotal current liabilities\n3,940,303\n2,472,239\nOther liabilities\n15,065\n28,680\nTotal liabilities\n3,955,368\n2,500,919\nCommitments and contingencies (See Note 14)\nShareholders equity\nPreferred stock, 10,000,000 shares authorized, $.001 par value, of which 200,000 shares are authorized as Class A Convertible stock. No shares issued and outstanding at September 30, 2022 and 2021\n-\n-\nCommon stock, $.001 par value: 75,000,000 shares authorized, 19,412,664 and 19,342,823 issued at September 30, 2022 and 2021, respectively\n19,413\n19,343\nAdditional paid-in capital\n52,458,121\n51,817,095\nAccumulated deficit\n(359,042)\n(5,882,820)\nTreasury stock, at cost, 2,096,451 shares at September 30, 2022 and at September 30, 2021\n(21,368,537)\n(21,368,537)\nTotal shareholders equity\n30,749,955\n24,585,081\nTotal liabilities and shareholders equity\n$\n34,705,323\n$\n27,086,000\nThe accompanying notes are an integral part of these statements.\nINNOVATIVE SOLUTIONS AND SUPPORT, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Fiscal Year Ended September 30,\nNet sales:\nProduct\n$\n27,279,750\n$\n22,760,083\n$\n20,806,121\nEngineering development contracts\n460,945\n284,713\n789,078\nTotal net sales\n27,740,695\n23,044,796\n21,595,199\nCost of sales:\nProduct\n10,905,799\n10,185,510\n9,568,553\nEngineering development contracts\n160,515\n77,656\n224,671\nTotal cost of sales\n11,066,314\n10,263,166\n9,793,224\nGross profit\n16,674,381\n12,781,630\n11,801,975\nOperating expenses:\nResearch and development\n2,705,140\n2,622,919\n2,955,976\nSelling, general and administrative\n6,753,915\n6,257,732\n6,100,545\nTotal operating expenses\n9,459,055\n8,880,651\n9,056,521\nOperating income\n7,215,326\n3,900,979\n2,745,454\nInterest income\n61,051\n1,234\n154,950\nOther income\n65,232\n74,906\n60,497\nIncome before income taxes\n7,341,609\n3,977,119\n2,960,901\nIncome tax (benefit) expense\n1,817,831\n(1,087,783)\n(308,882)\nNet income\n$\n5,523,778\n$\n5,064,902\n$\n3,269,783\nNet income per common share:\nBasic\n$\n0.32\n$\n0.29\n$\n0.19\nDiluted\n$\n0.32\n$\n0.29\n$\n0.19\nWeighted average shares outstanding:\nBasic\n17,256,750\n17,225,423\n16,939,302\nDiluted\n17,257,871\n17,226,620\n17,114,191\nThe accompanying notes are an integral part of these statements.\nINNOVATIVE SOLUTIONS AND SUPPORT, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\n(Accumulated\nAdditional\nDeficit)\nCommon\nPaid-In\nRetained\nTreasury\nStock\nCapital\nEarnings\nStock\nTotal\nBalance, September 30, 2019\n$\n19,006\n$\n51,987,096\n$\n5,570,587\n$\n(21,368,537)\n$\n36,208,152\nShare-based compensation\n-\n17,337\n-\n-\n17,337\nExercise of stock options\n174,911\n-\n-\n175,143\nIssuance of stock to directors\n159,919\n-\n-\n159,992\nTax withholding related to cashless exercise of stock options\n-\n(880,476)\n-\n-\n(880,476)\nDividends declared\n-\n-\n(11,180,900)\n-\n(11,180,900)\nNet income\n-\n-\n3,269,783\n-\n3,269,783\nBalance, September 30, 2020\n$\n19,311\n$\n51,458,787\n$\n(2,340,530)\n$\n(21,368,537)\n$\n27,769,031\nShare-based compensation\n-\n181,350\n-\n-\n181,350\nExercise of stock options\n17,005\n-\n-\n17,010\nIssuance of stock to directors\n159,953\n-\n-\n159,980\nDividends declared\n-\n-\n(8,607,192)\n-\n(8,607,192)\nNet income\n-\n-\n5,064,902\n-\n5,064,902\nBalance, September 30, 2021\n$\n19,343\n$\n51,817,095\n$\n(5,882,820)\n$\n(21,368,537)\n$\n24,585,081\nShare-based compensation\n-\n166,617\n-\n-\n166,617\nExercise of stock options\n301,111\n-\n-\n301,154\nIssuance of stock to directors\n173,298\n-\n-\n173,325\nNet income\n-\n-\n5,523,778\n-\n5,523,778\nBalance, September 30, 2022\n$\n19,413\n$\n52,458,121\n$\n(359,042)\n$\n(21,368,537)\n$\n30,749,955\nThe accompanying notes are an integral part of these statements.\nINNOVATIVE SOLUTIONS AND SUPPORT, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Fiscal Year Ended September 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income\n$\n5,523,778\n$\n5,064,902\n$\n3,269,783\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n368,499\n432,176\n433,510\nShare-based compensation expense\nStock options\n166,617\n181,350\n17,337\nStock awards\n173,325\n159,980\n160,006\nGain on disposal of property and equipment\n(1,191,743)\n-\n-\nExcess and obsolete inventory cost\n-\n(100,446)\n66,511\nDeferred income taxes\n1,017,335\n(1,193,511)\n(Increase) decrease in:\nAccounts receivable\n(251,120)\n322,774\n(2,020,574)\nContract asset\n(162,742)\n-\n80,182\nInventories\n(708,859)\n(153,611)\n112,848\nPrepaid expenses and other current assets\n(309,394)\n(157,967)\n(33,060)\nOther non-current assets\n-\n-\n(96,269)\nIncrease (decrease) in:\nAccounts payable\n85,224\n(167,272)\n(288,181)\nAccrued expenses\n1,272,826\n(4,655)\n207,568\nIncome taxes\n269,015\n104,640\n(1,666)\nContract liability\n74,356\n(242,835)\n284,684\nContract liability - related party\n(232,677)\n346,974\n(550)\nNet cash provided by operating activities\n6,094,440\n4,592,499\n2,192,167\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of property and equipment\n(161,230)\n(340,678)\n(118,797)\nProceeds from the sale of property and equipment\n2,750,576\n-\n-\nNet cash provided by (used in) investing activities\n2,589,346\n(340,678)\n(118,797)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from paycheck protection program\n-\n-\n1,203,900\nRepayment of paycheck protection program\n-\n-\n(1,203,900)\nProceeds from exercise of stock options\n301,154\n17,010\n175,143\nTax withholding related to cashless exercise of stock options\n-\n-\n(880,476)\nDividend paid\n-\n(19,788,092)\n-\nNet cash provided by (used in) financing activities\n301,154\n(19,771,082)\n(705,333)\nNet increase (decrease) in cash and cash equivalents and restricted cash\n8,984,940\n(15,519,261)\n1,368,037\nCash and cash equivalents and restricted cash, beginning of year\n8,265,606\n23,784,867\n22,416,830\nCash and cash equivalents and restricted cash, end of year\n$\n17,250,546\n$\n8,265,606\n$\n23,784,867\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION\nCash paid for income taxes\n$\n531,481\n$\n1,089\n$\n2,456\nCash received from income tax refund\n-\n-\n309,712\nSUPPLEMENTAL DISCLOSURE OF NONCASH INFORMATION\nCashless exercise of stock options\n-\n-\n1,635,000\nAccrual of dividends payable\n-\n-\n11,180,900\nThe accompanying notes are an integral part of these statements.\nINNOVATIVE SOLUTIONS AND SUPPORT, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Background\nInnovative Solutions and Support, Inc. (the Company, IS&S, we or us) was incorporated in Pennsylvania on February 12, 1988. The Company operates in one business segment as a systems integrator that designs, develops, manufactures, sells, and services air data equipment, engine display systems, standby equipment, primary flight guidance and cockpit display systems for retrofit applications and original equipment manufacturers (OEMs). The Company supplies integrated Flight Management Systems (FMS), Flat Panel Display Systems (FPDS), FPDS with Autothrottle, air data equipment, Integrated Standby Units (ISU), ISU with Autothrottle and advanced GPS receivers that enable reduced carbon footprint navigation.\nThe Company has continued to position itself as a system integrator, which provides the Company with the capability and potential to generate more substantive orders over a broader product base. This strategy, as both a manufacturer and integrator, is designed to leverage the latest technologies developed for the computer and telecommunications industries into advanced and cost-effective solutions for the general aviation, commercial air transport, DoD/governmental, and foreign military markets. This approach, combined with the Companys industry experience, is designed to enable IS&S to develop high-quality products and systems, to reduce product time to market, and to achieve cost advantages over products offered by its competitors. Customers include various OEMs, commercial air transport carriers and corporate/general aviation companies, DoD and its commercial contractors, aircraft operators, aircraft modification centers, government agencies, and foreign militaries.\n2. Concentrations\nMajor Customers and Products\nIn fiscal 2022, 2021 and 2020, the Company derived 58%, 59% and 63%, respectively, of total sales from five customers, although not all the same customers in each year. Accounts receivable and contract assets related to those top five customers was $3.3 million, $2.1 million and $3.4 million as of September 30, 2022, 2021 and 2020, respectively.\nIn fiscal year 2022, the three largest customers, Pilatus, ATSG and Textron accounted for 22%, 11% and 11% of total revenue, respectively. In fiscal year 2021, the two largest customers, Pilatus and Textron accounted for 20% and 17% of total revenue, respectively. In fiscal year 2020, the three largest customers, Pilatus, Dayton T. Brown, Inc., and Kalitta Air accounted for 33%, 12% and 10% of total revenue, respectively.\nFlat panel sales were 98%, 88% and 80% of total sales in the years ended September 30, 2022, 2021 and 2020, respectively. Sales of air data systems and components were 2%, 12% and 20% of total sales for the years ended September 30, 2022, 2021 and 2020, respectively. Sales to government contractors and agencies accounted for approximately 21%, 18% and 32% of total sales during fiscal years 2022, 2021 and 2020, respectively. The government agency or general contractor typically retains the right to terminate the contract at any time at its convenience. Upon alteration or termination of these contracts, IS&S is typically entitled to an equitable adjustment to the contract price so that it would be compensated for delivered items and allowable costs incurred. Accordingly, because these contracts can be terminated, the Company cannot be assured that its backlog will result in sales.\nMajor Suppliers\nThe Company buys several of its components from sole source suppliers. Although there are a limited number of suppliers of particular components, management believes other suppliers could provide similar components on comparable terms.\nDuring fiscal 2022 the Company had three suppliers that accounted for 33.7% of the Companys total inventory related purchases. During fiscal 2021 the Company had one supplier that accounted for 14.9% of the Companys total inventory related purchases.\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to concentration of credit risk consist principally of cash balances and accounts receivable. The Company invests its excess cash where preservation of principal is the major consideration. Cash balances are maintained with two major banks. Balances on deposit with certain money market accounts and operating accounts may exceed the Federal Deposit Insurance Corporation limits. The Companys customer base consists principally of companies within the aviation industry. The Company requests advance payments and/or letters of credit from customers that it considers to be credit risks.\n3. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe Companys condensed consolidated financial statements include the accounts of its wholly-owned subsidiaries. All intercompany balances and transactions have been eliminated in consolidation.\nImpact of the COVID-19 Pandemic\nThe Company has not yet seen a material impact from the COVID-19 pandemic on its business, financial position, liquidity, or ability to service customers or maintain critical operations. However, some parts of the world are continuing to see a rise in COVID-19 cases and hospitalizations, and it is possible that new, more virulent strains or variants of COVID-19 may emerge and lead governments and private sectors to re-institute quarantine and trade restrictions, which could adversely impact market conditions. IS&S will continue to monitor the impact of the COVID-19 pandemic on its business, including how it has impacted and will impact the Companys employees, customers, suppliers and distribution channels. The Company could face liquidity shortages, weaker product demand from its customers, disruptions in its supply chain, and/or staffing shortages in its workforce in the future due to the direct and indirect effects of the COVID-19 pandemic.\nUse of Estimates\nThe financial statements of the Company have been prepared in accordance with accounting principles generally accepted in the United States of America, which require management to make estimates and assumptions that affect the amounts reported in the financial statements. Actual results could differ from those estimates. Estimates are used in accounting for, among other items, long term contracts, allowances for doubtful accounts, inventory obsolescence, product warranty cost liabilities, income taxes, engineering and material costs on EDC programs, percentage of completion on EDC contracts, recoverability of long-lived assets and contingencies. Estimates and assumptions are reviewed periodically and the effects of changes, if any, are reflected in the consolidated statements of operations in the period they are determined.\nCash and Cash Equivalents\nHighly liquid investments, purchased with an original maturity of three months or less, are classified as cash equivalents. Cash equivalents at September 30, 2022 and 2021 consist of cash on deposit and cash invested in money market funds with financial institutions.\nInventory Valuation\nInventories are stated at the lower of cost (first-in, first-out) or net realizable value, net of write-downs for excess and obsolete inventory, and consist of the following:\nSeptember 30,\nSeptember 30,\nRaw materials\n$\n4,451,045\n$\n3,729,692\nWork-in-process\n795,723\n629,814\nFinished goods\n102,336\n185,886\n$\n5,349,104\n$\n4,545,392\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation is provided using an accelerated method over the estimated useful lives of the assets (the lesser of three to seven years or over the lease term), except for the manufacturing facility and the corporate airplanes, which are depreciated using the straight-line method over their estimated useful lives of thirty-nine years and ten years, respectively. Major additions and improvements are capitalized, while maintenance and repairs that do not improve or extend the life of assets are charged to expense as incurred.\nLong-Lived Assets\nThe Company assesses the impairment of long-lived assets in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 360-10, Property, Plant and Equipment. This statement requires that long-lived assets be reviewed for impairment whenever events or changes in circumstances indicate the carrying amount of an asset may not be recoverable. In addition, long-lived assets to be disposed of should be reported at the lower of the carrying amount or fair value less cost to sell. The Company considers historical performance and future estimated results in its evaluation of potential impairment and then compares the carrying amount of the asset to estimated future cash flows expected to result from use of the asset. If the carrying amount of the asset exceeds the estimated expected undiscounted future cash flows, the Company measures the amount of the impairment by comparing the carrying amount of the asset to its fair value. The estimation of fair value is generally measured by discounting expected future cash flows. No impairment charges were recorded in fiscal years 2022, 2021 or 2020.\nRevenue Recognition\nThe Company enters into sales arrangements with customers that, in general, provide for the Company to design, develop, manufacture and deliver large flat-panel display systems, flight information computers, autothrottles and advanced monitoring systems that measure and display critical flight information, including data relative to aircraft separation, airspeed, altitude, and engine and fuel data measurements.\nRevenue from Contracts with Customers\nThe Company accounts for revenue in accordance with ASC 606, Revenue from Contracts with Customers (ASC 606). The core principle of ASC 606 is that an entity recognizes revenue when a customer obtains control of promised goods or services. The amount of revenue recognized reflects the consideration to which the Company expects to be entitled to receive in exchange for these goods or services. To achieve this core principle, the Company applies the following five steps:\n1)Identify the contract with a customer\nThe Companys contract with its customers typically is the form of a purchase order issued to the Company by its customers and, to a lesser degree, in the form of a purchase order issued in connection with a formal contract executed with a customer. For the purpose of accounting for revenue under ASC 606, a contract with a customer exists when (i) the Company enters into an enforceable contract with a customer that defines each partys rights regarding the goods or services to be transferred and identifies the payment terms related to these goods or services, (ii) the contract has commercial substance and, (iii) the Company determines that collection of substantially all consideration for goods or services that are transferred is probable based on the customers intent and ability to pay the promised consideration. The Company applies judgment in determining the customers ability and intention to pay, which is based on a variety of factors including the customers historical payment experience or, in the case of a new customer, published credit and financial information pertaining to the customer.\n2)Identify the performance obligations in the contract\nPerformance obligations promised in a contract are identified based on the goods or services that will be transferred to the customer that are both capable of being distinct, whereby the customer can benefit from the good or service either on its own or together with other resources that are readily available from third parties or from the Company, and are distinct in the context of the contract, whereby the transfer of the goods or services is separately identifiable from other promises in the contract. Most of our revenue is derived from purchases under which we provide a specific product or service and, as a result, there is only one performance obligation. In the event that a contract includes multiple promised goods or services, such as an EDC contract which includes both engineering services and a resulting product shipment, the Company must apply judgment to determine whether promised goods or services are capable of being distinct in the context of the contract. In these cases, the Company considers whether the customer could, on its own, or together with other resources that are readily available from third parties, produce the physical product using only the output resulting from the Companys completion of engineering services. If the customer cannot produce the physical product, then the promised goods or services are accounted for as a combined performance obligation.\n3)Determine the transaction price\nThe transaction price is determined based on the consideration to which the Company will be entitled in exchange for transferring goods or services to the customer. To the extent the transaction price includes variable consideration, the Company estimates the amount of variable consideration that should be included in the transaction price utilizing either the expected value method or the most likely amount method depending on the nature of the variable consideration. Variable consideration is included in the transaction price if, in the Companys judgment, it is probable that a significant future reversal of cumulative revenue under the contract will not occur.\n4)Allocate the transaction price to performance obligations in the contract\nIf the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. The Company determines standalone selling price based on the price at which the performance obligation is sold separately. If the standalone selling price is not observable through past transactions, the Company estimates the standalone selling price by taking into account available information such as market conditions as well as the cost of the goods or services and the Companys normal margins for similar performance obligations.\n5)Recognize revenue when or as the Company satisfies a performance obligation\nThe Company satisfies performance obligations either over time or at a point in time as discussed in further detail below. Revenue is recognized at the time the related performance obligation is satisfied by transferring a promised good or service to a customer. Historically, the Company has also recognized revenue from EDC contracts and is recognized over time using an input measure (e.g., costs incurred to date relative to total estimated costs at completion) to measure progress. Contract costs include material, components and third-party avionics purchased from suppliers, direct labor, and overhead costs.\nContract Estimates\nAccounting for performance obligations in long-term contracts that are satisfied over time involves the use of various techniques to estimate progress towards satisfaction of the performance obligation. The Company typically measures progress based on costs incurred compared to estimated total contract costs. Contract cost estimates are based on various assumptions to project the outcome of future events that often span more than a single year. These assumptions include the amount of labor and labor costs, the quantity and cost of raw materials used in the completion of the performance obligation, and the complexity of the work to be performed.\nAs a significant change in one or more of these estimates could affect the profitability of our contracts, we review and update our contract-related estimates regularly. We recognize adjustments in estimated profit on contracts under the cumulative catch-up method. Under this method, the impact of the adjustment on profit recorded to date is recognized in the period the adjustment is identified. Revenue and profit in future periods of contract performance is recognized using the adjusted estimate. If at any time the estimate of contract profitability indicates an anticipated loss on the contract, we recognize the total loss in the quarter it is identified.\nThe impact of adjustments in contract estimates on our operating earnings can be reflected in either operating costs and expenses or revenue. The aggregate impact of adjustments in contract estimates did not change our revenue and operating earnings (and diluted earnings per share) for the fiscal years ended September 30, 2022 and 2021. Therefore, no adjustment on any contract was material to our consolidated financial statements for the fiscal years ended September 30, 2022 and 2021.\nContract Balances\nContract assets consist of the right to consideration in exchange for product offerings that we have transferred to a customer under the contract. Contract liabilities primarily relate to consideration received in advance of performance under the contract. The following table reflects the Companys contract assets and liabilities:\nContract\nContract\nAssets\nLiabilities\nSeptember 30, 2021\n$\n-\n$\n417,504\nAmount transferred to receivables from contract assets\n-\n-\nContract asset additions\n162,742\n-\nPerformance obligations satisfied during the period that were included in the contract liability balance at the beginning of the period\n-\n(316,320)\nIncreases due to invoicing prior to satisfaction of performance obligations\n-\n157,999\nSeptember 30, 2022\n$\n162,742\n$\n259,183\nCustomer Service Revenue\nThe Company enters into sales arrangements with customers for the repair or upgrade of its various products that are not under warranty. The Companys customer service revenue and cost of sales are included in product sales and product cost of sales, respectively, on the accompanying consolidated statements of operations. The Companys customer service revenue and cost of sales for the fiscal years ended 2022, 2021 and 2020 are as follows:\nFor the Fiscal Year Ended September 30,\nCustomer Service Sales\n$\n4,879,591\n$\n4,034,294\n$\n4,265,086\nCustomer Service Cost of Sales\n1,502,899\n1,489,942\n1,457,995\nGross Profit\n$\n3,376,692\n$\n2,544,352\n$\n2,807,091\nLease Recognition\nThe Company accounts for leases in accordance with ASU 2016-02, Leases (Topic 842). At the inception of an arrangement, the Company determines whether the arrangement is or contains a lease based on the unique facts and circumstances present in the arrangement. Leases with a term greater than one year are recognized on the balance sheet as right-of-use assets and short-term and long-term lease liabilities, as applicable. The Company does not have any financing leases that are material in nature.\nIncome Taxes\nIncome taxes are recorded in accordance with ASC Topic 740, Income Taxes (ASC Topic 740), which utilizes a balance sheet approach to provide for income taxes. Under this method, the Company recognizes deferred tax assets and liabilities for temporary differences between the financial reporting basis and the tax basis of the Companys assets, liabilities, and expected benefits of utilizing net operating losses (NOL) and tax credit carry-forwards. The impact on deferred taxes of changes in tax rates and laws, if any, are applied to the years during which temporary differences are expected to be settled, and are reflected in the consolidated financial statements in the period of enactment. At the end of each interim reporting period, the Company prepares an estimate of the annual effective income tax rate and applies that annual effective income tax rate to ordinary year-to-date pre-tax income for the interim period. Specific tax items discrete to a particular quarter are recorded in income tax expense for that quarter. The estimated annual effective tax rate used in providing for income taxes on a year-to-date basis may change in subsequent periods.\nDeferred tax assets are reduced by a valuation allowance if, based on the consideration of all available evidence, it is more likely than not that some portion of the deferred tax asset will not be realized. Significant weight is given to evidence that can be verified objectively, and significant management judgment is required in determining any valuation allowance recorded against net deferred tax assets. The Company evaluates deferred income taxes on a quarterly basis to determine if a valuation allowance is required by considering available evidence. Deferred tax assets are recognized when expected future taxable income is sufficient to allow the related tax benefits to reduce taxes that would otherwise be payable. The sources of taxable income that may be available to realize the benefit of deferred tax assets are future reversals of existing taxable temporary differences, future taxable income exclusive of reversing temporary differences and credit carryforwards, taxable income in carry-back years, and tax planning strategies which are both prudent and feasible. For the year ended September 30, 2021, the valuation allowance was released against all federal and state deferred tax assets with the exception of certain state net operating losses due to positive evidence that the assets are more likely than not to be realized in future years. The Company will continue to assess all available evidence during future periods to evaluate any changes to the realization of its deferred tax assets. If the Company were to determine that it would be able to realize additional state deferred tax assets in the future, it would make an adjustment to the valuation allowance which would reduce the provision for income taxes.\nThe accounting for uncertainty in income taxes requires a more likely than not threshold for financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. The Company records a liability for the difference between the (i) benefit recognized and measured for financial statement purposes and (ii) the tax position taken or expected to be taken on the Companys tax return. To the extent that the Companys assessment of such tax positions changes, the change in estimate is recorded in the period in which the determination is made. The Company has elected to record any interest or penalties associated with uncertain tax positions as income tax expense.\nThe Company files a consolidated U.S. federal income tax return. The Company prepares and files tax returns based on the interpretation of tax laws and regulations, and records estimates based on these judgments and interpretations. In the normal course of business, the tax returns are subject to examination by various taxing authorities. Such examinations may result in future tax and interest assessments by these taxing authorities, and the Company records a liability when it is probable that there will be an assessment. The Company adjusts the estimates periodically as a result of ongoing examinations by and settlements with the various taxing authorities, and changes in tax laws, regulations and precedent. The consolidated tax provision of any given year includes adjustments to prior years income tax accruals that are considered appropriate, and any related estimated interest. Management believes that it has made adequate accruals for income taxes. Differences between estimated and actual amounts determined upon ultimate resolution, individually or in the aggregate, are not expected to have a material effect on the Companys consolidated financial position but could possibly be material to its consolidated results of operations or cash flow of any one period.\nIn March 2020, in response to the COVID-19 pandemic, the CARES Act was signed into law to provide emergency assistance to affected individuals, families, and businesses. The CARES Act provides numerous tax provisions and other stimulus measures, including temporary changes regarding the prior and future utilization of NOLs. The CARES Act amends the NOL provisions of the Tax Act, allowing for the carryback of losses arising in tax years beginning before December 31, 2017, to each of the two taxable years preceding the taxable year of loss. Approximately $1,500,000 of pre-tax NOL was carried back two years to fully offset taxable income. This carryback frees up previously utilized R&D credits, resulting in an estimated increase in R&D credit carryforward of $196,000. The carryback created approximately $16,000 of AMT tax, which was refunded. The cash impact of this carryback was $309,412. A receivable was setup for this amount as of March 31, 2020 and the cash has since been received.\nIn December 2020, the CAA was enacted as a supplement to the CARES Act legislation providing additional financial relief to taxpayers adversely impacted by restrictions put into place in response to the COVID-19 pandemic. In addition, the CCA provides funding for public health initiatives in response to the pandemic. This legislation did not have a material impact on the Companys tax position.\nOn March 11, 2021, the ARPA, which includes certain business tax provisions, was signed into law. This legislation did not have a material impact on the Companys tax position.\nEngineering Development\nTotal engineering development expense comprises both internally funded R&D and product development and design charges related to specific customer contracts. Engineering development expense consists primarily of payroll-related expenses of employees engaged in EDC projects, engineering related product materials and equipment, and subcontracting costs. R&D charges incurred for product design, product enhancements, and future product development are expensed as incurred. Product development and design charges related to specific customer contracts are charged to cost of sales-EDC based on the method of contract accounting (either percentage-of-completion or completed contract) applicable to such contracts.\nComprehensive Income\nPursuant to FASB ASC Topic 220, Comprehensive Income, the Company is required to classify items of other comprehensive income by their nature in a financial statement and display the accumulated balance of other comprehensive income separately from retained earnings and additional paid-in capital in the equity section of its condensed consolidated balance sheets. For fiscal years 2022, 2021 and 2020 comprehensive income consisted of net income only, and there were no items of other comprehensive income for any of the periods presented.\nFair Value of Financial Instruments\nThe net carrying amounts of cash and cash equivalents, accounts receivable, accounts payable and short-term debt approximate their fair value because of the short-term nature of these instruments. For financial assets and liabilities measured at fair value on a recurring basis, fair value is the price the Company would receive to sell an asset or pay to transfer a liability in an orderly transaction with a market participant at the measurement date. A three-level fair value hierarchy prioritizes the inputs used to measure fair value as follows:\nLevel 1 - Unadjusted quoted prices that are available in active markets for the identical assets or liabilities at the measurement date.\nLevel 2 - Other observable inputs available at the measurement date, other than quoted prices included in Level 1, either directly or indirectly, including:\n● Quoted prices for similar assets or liabilities in active markets;\n● Quoted prices for identical or similar assets in non-active markets;\n● Inputs other than quoted prices that are observable for the asset or liability; and\n● Inputs that are derived principally from or corroborated by other observable market data.\nLevel 3 - Unobservable inputs that cannot be corroborated by observable market data and reflect the use of significant management judgment. These values are generally determined using pricing models for which the assumptions utilize managements estimates of market participant assumptions.\nThe following table sets forth by level within the fair value hierarchy the Companys financial assets and liabilities that were accounted for at fair value on a recurring basis as of September 30, 2022 and 2021, according to the valuation techniques the Company used to determine their fair values.\nFair Value Measurement on September 30, 2022\nQuoted Price in\nSignificant Other\nSignificant\nActive Markets for\nObservable\nUnobservable\nIdentical Assets\nInputs\nInputs\n(Level 1)\n(Level 2)\n(Level 3)\nAssets\nCash and cash equivalents:\nMoney market funds\n$\n16,083,571\n$\n-\n$\n-\nFair Value Measurement on September 30, 2021\nQuoted Price in\nSignificant Other\nSignificant\nActive Markets for\nObservable\nUnobservable\nIdentical Assets\nInputs\nInputs\n(Level 1)\n(Level 2)\n(Level 3)\nAssets\nCash and cash equivalents:\nMoney market funds\n$\n6,051,902\n$\n-\n$\n-\nShare-Based Compensation\nThe Company accounts for share-based compensation under ASC Topic 718, which requires the Company to measure the cost of employee or non-employee director services received in exchange for an award of equity instruments based on the grant-date fair value of the award using an option pricing model. The Company recognizes such cost over the period during which an employee or non-employee director is required to provide service in exchange for the award.\nAccordingly, adoption of ASC Topic 718s fair value method results in recording compensation costs under the Companys stock based compensation plans. The Company determined the fair value of its stock option awards at the date of grant using the Black-Scholes option pricing model. Option pricing models and generally accepted valuation techniques require management to make assumptions and to apply judgment to determine the fair value of its awards. These assumptions and judgments include estimating future volatility of the Companys stock price, expected dividend yield, future employee turnover rates, and future employee stock option exercise behaviors. Changes in these assumptions can materially affect fair value estimates. The Company does not believe that a reasonable likelihood exists that there will be a material change in future estimates or assumptions used to determine share-based compensation expense. However, if actual results are not consistent with the Companys estimates or assumptions, the Company would adjust its estimates. Such adjustments could have a material impact on the Companys financial position.\nWarranty Reserves\nThe Company offers warranties on some products of various lengths, however the standard warranty period is twenty-four months. At the time of shipment, the Company establishes a reserve for estimated costs of warranties based on its best estimate of the amounts necessary to settle future and existing claims using historical data on products sold as of the balance sheet date. The length of the warranty period, the products failure rates, and the customers usage affect warranty cost. If actual warranty costs differ from the Companys estimated amounts, future results of operations could be affected adversely. Warranty cost is recorded as cost of sales, and the reserve balance recorded as an accrued expense. While the Company maintains product quality programs and processes, its warranty obligation is affected by product failure rates and the related corrective costs. If actual product failure rates and/or corrective costs differ from the estimates, the Company revises the estimated warranty liability accordingly.\nSelf-Insurance Reserves\nSince January 1, 2014, the Company has self-insured a significant portion of its employee medical insurance. The Company maintains a stop-loss insurance policy that limits its losses both on a per employee basis and an aggregate basis. Liabilities associated with the risks that are retained by the Company are estimated based upon actuarial assumptions such as historical claims experience and demographic factors. The Company estimated the total medical claims incurred but not reported and the Company believes that it has adequate reserves for these claims at September 30, 2022 and 2021. However, the actual value of such claims could be significantly affected if future occurrences and claims differ from these assumptions. At September 30, 2022 and 2021, the estimated liability for medical claims incurred but not reported was $51,600 and $55,900, respectively. The Company has recorded the excess of funded premiums over estimated claims incurred but not reported of $424,200 as a current asset in the accompanying consolidated balance sheet. During the year ended September 30, 2022, the Company has used the excess of funded premiums to reduce amounts payable for claims incurred.\nTreasury Stock\nWe account for treasury stock purchased under the cost method and include treasury stock as a component of stockholders equity. Treasury stock purchased with intent to retire (whether or not the retirement is actually accomplished) is charged to common stock.\nNew Accounting Pronouncements\nIn June 2016, FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instrument (ASU 2016-13). ASU 2016-13 replaces the incurred loss impairment methodology in current U.S. GAAP with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to inform credit loss estimates. ASU 2016-13 is effective for SEC small business filers for fiscal years beginning after December 15, 2022. The adoption of this standard is not expected to have a material impact on our condensed consolidated financial statements or related disclosures.\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12), which simplifies the accounting for income taxes, eliminates certain exceptions within Accounting Standards Codification Topic 740, Income Taxes (ASC 740), and clarifies certain aspects of ASC 740 to promote consistency among reporting entities. We adopted this update effective October 1, 2021. The adoption of this standard did not have a material impact on our condensed consolidated financial statements or related disclosures.\nAs new accounting pronouncements are issued, we will adopt those that are applicable.\n4. Net Income Per Share\nFor the Fiscal Year Ended September 30,\nNumerator:\nNet income\n$\n5,523,778\n$\n5,064,902\n$\n3,269,783\nDenominator:\nBasic weighted average shares\n17,256,750\n17,225,423\n16,939,302\nDilutive effect of share-based awards\n1,121\n1,197\n174,889\nDiluted weighted average shares\n17,257,871\n17,226,620\n17,114,191\nNet income per common share:\nBasic\n$\n0.32\n$\n0.29\n$\n0.19\nDiluted\n$\n0.32\n$\n0.29\n$\n0.19\nNet income per share is calculated pursuant to ASC Topic 260, Earnings per Share (ASC Topic 260). Basic earnings per share (EPS) excludes potentially dilutive securities and is computed by dividing net income by the weighted average number of common shares outstanding for the period. Diluted EPS is computed assuming the conversion or exercise of all dilutive securities such as employee stock options and restricted stock units (RSUs).\nThe number of incremental shares from the assumed exercise of stock options and RSUs is calculated by using the treasury stock method. As of September 30, 2022, 2021 and 2020, there were 57,584, 100,000 and 104,500 options to purchase common stock outstanding, respectively. As of September 30, 2022, 2021 and 2020 , there were 7,886, 0 and 0 shares subject to vesting of restricted stock units outstanding, respectively. The average outstanding diluted shares calculation excludes options with an exercise price that exceeds the average market price of shares during the period. For fiscal year 2022, no options to purchase common stock were excluded from the computation of diluted earnings per share because the effect would be anti-dilutive. For fiscal years 2021 and 2020, 100,000 shares, respectively were excluded from the calculation of earnings per share as their effect would be anti-dilutive.\n5. Prepaid Expenses and Other Current Assets\nPrepaid expenses and other current assets consist of the following:\nSeptember 30,\nSeptember 30,\nPrepaid insurance\n$\n777,311\n$\n318,138\nOther\n365,159\n514,938\n$\n1,142,470\n$\n833,076\n6. Property and Equipment\nProperty and equipment, net consists of the following balances:\nSeptember 30,\nSeptember 30,\nComputer equipment\n$\n2,307,139\n$\n2,309,053\nCorporate airplanes\n2,406,468\n5,601,039\nFurniture and office equipment\n976,993\n970,725\nManufacturing facility\n5,889,491\n5,889,491\nEquipment\n5,624,966\n5,545,529\nLand\n1,021,245\n1,021,245\n18,226,302\n21,337,082\nLess accumulated depreciation and amortization\n(11,934,113)\n(13,193,599)\n$\n6,292,189\n$\n8,143,483\nDepreciation related to property and equipment was approximately $358,837, $373,068 and $387,617 in fiscal years 2022, 2021 and 2020, respectively. The Pilatus PC-12 airplane, one of the Companys two corporate airplanes, was sold during the quarter ended September 30, 2022 and the Company recognized a gain on sale of the aircraft of approximately $1,192,000. The corporate airplanes are utilized primarily in support of product development. Noncash investing activities involving property, plant and equipment comprise the abandonment of fully depreciated assets with an original cost and accumulated amortization of $34,656, $416,626 and $15,430 in fiscal years 2022, 2021 and 2020, respectively.\n7. Other Assets\nOther assets consist of the following:\nSeptember 30,\nSeptember 30,\nIntangible assets, net of accumulated amortization of $636,158 at September 30, 2022 and $634,032 at September 30, 2021\n$\n60,348\n$\n62,474\nOperating lease right-of-use assets\n28,680\n42,976\nOther non-current assets\n75,300\n82,834\n$\n164,328\n$\n188,284\nIntangible assets consist of licensing and certification rights which are amortized over a defined number of units. No impairment charges were recorded in fiscal 2022, 2021 or 2020.\nTotal intangible amortization expense was $2,126, $50,377 and $32,618 in fiscal years 2022, 2021 and 2020, respectively. The timing of future amortization expense is not determinable because the intangible assets are being amortized over a defined number of units.\nOther non-current assets as of September 30, 2022 and September 30, 2021 include the security deposit for an airplane hangar, and a deposit for medical claims required under the Companys medical plan. In addition, other non-current assets include $0 and $7,535 of prepaid software licenses, that will be earned upon the shipment of a certain product to a customer, as of September 30, 2022, and September 30, 2021, respectively.\n8. Accrued Expenses\nAccrued expenses consist of the following:\nSeptember 30,\nSeptember 30,\nWarranty\n$\n607,001\n$\n589,260\nSalary, benefits and payroll taxes\n1,030,628\n385,287\nProfessional fees\n364,794\n163,130\nOperating lease\n13,615\n14,296\nOther\n956,237\n279,142\n$\n2,972,275\n$\n1,431,115\n9. Warranty\nThe Company provides for the estimated cost of product warranties at the time revenue is recognized. Warranty cost is recorded as cost of sales and the reserve balance is recorded as an accrued expense in the financial statements. While the Company engages in extensive product quality programs and processes, the Companys warranty obligation is affected by product failure rates and by the related material, labor, and delivery costs incurred in correcting a product failure. If actual product failure rates, material, or labor costs differ from the Companys estimates, further revisions to the estimated warranty liability would be recorded.\nWarranty cost and accrual information for fiscal years ended September 30, 2022 and 2021:\nWarranty accrual as of October 1,\n$\n589,260\n$\n547,743\nExpense accrual for fiscal year\n152,419\n176,028\nWarranty cost incurred for fiscal year\n(134,678)\n(134,511)\nWarranty accrual as of September 30,\n$\n607,001\n$\n589,260\n10. Income Taxes\nIn March 2020, the CARES Act was signed into law providing numerous tax provisions and other stimulus measures, including temporary changes regarding the prior and future utilization of NOLs. The CARES Act amends the NOL provisions of the Tax Act, allowing for the carryback of losses arising in tax years beginning before December 31, 2017, to each of the two taxable years preceding the taxable year of loss. Approximately $1,500,000 of pre-tax NOL was carried back two years to fully offset taxable income. This carryback frees up previously utilized R&D credits, resulting in an estimated increase in R&D credit carryforward of $196,000. The carryback created approximately $16,000 of AMT tax, which was refunded. The cash impact of this carryback was $309,412. A receivable was setup for this amount as of March 31, 2020 and the cash has since been received.\nIn December 2020, the CAA was enacted as a supplement to the CARES Act legislation providing additional financial relief to taxpayers adversely impacted by restrictions put into place in response to the COVID-19 pandemic. In addition, the CCA provides funding for public health initiatives in response to the pandemic. This legislation did not have a material impact on the Companys tax position.\nOn March 11, 2021, the ARPA, which includes certain business tax provisions, was signed into law. This legislation did not have a\nmaterial impact on the Companys tax position.\nThe components of income taxes are as follows:\nFor the Fiscal Year Ended September 30,\nCurrent provision (benefit):\nFederal\n$\n522,473\n$\n95,818\n$\n(309,401)\nState\n277,991\n9,911\nTotal current provision (benefit)\n800,464\n105,729\n(308,920)\nDeferred provision (benefit)\nFederal\n998,585\n(754,995)\n-\nState\n18,782\n(438,517)\nTotal deferred provision (benefit)\n1,017,367\n(1,193,511)\nTotal current and deferred provision (benefit)\n$\n1,817,831\n$\n(1,087,783)\n$\n(308,882)\nFollowing is a reconciliation of the statutory federal rate to the Companys effective income tax rate:\nFor the Fiscal Year Ended September 30,\nU.S. Federal statutory tax rate\n21.00\n%\n21.00\n%\n21.00\n%\nRate change due to tax reform\n0.0\n%\n0.0\n%\n0.0\n%\nState income taxes, net of federal benefit\n11.8\n%\n0.6\n%\n(2.2)\n%\nPermanent items\n0.1\n%\n0.2\n%\n(6.3)\n%\nResearch and development tax credits\n(0.1)\n%\n(0.6)\n%\n(10.6)\n%\nValuation allowance\n(6.4)\n%\n(47.9)\n%\n(15.2)\n%\nChange in unrecognized tax benefits\n(1.5)\n%\n(0.7)\n%\n2.2\n%\n123R cancellations and forfeitures\n0.3\n%\n0.0\n%\n0.0\n%\nTax Law Changes: CARES Act\n0.0\n%\n0.0\n%\n0.3\n%\nOther\n(0.5)\n%\n0.0\n%\n0.3\n%\nEffective income tax rate\n24.7\n%\n(27.4)\n%\n(10.4)\n%\nThe deferred tax effect of temporary differences giving rise to the Companys deferred tax assets and liabilities consists of the components below:\nAs of September 30,\nNon Current\nNon Current\nNon Current\nDeferred tax assets:\nReserves and accruals\n$\n651,321\n$\n654,624\n$\n698,233\nResearch and development credit\n-\n1,327,162\n1,589,247\nNOL carryforwards -fed/state\n984,004\n1,612,043\n2,192,018\nDepreciation\n-\n-\n(807,522)\nStock options\n45,069\n41,652\n5,296\nOther\n-\n-\n-\n1,680,394\n3,635,481\n3,677,272\nLess: Valuation allowance\n(981,816)\n(1,449,204)\n(3,471,164)\nTotal deferred tax assets\n698,578\n2,186,277\n206,108\nDeferred tax liabilities:\nDepreciation\n(652,091)\n(1,122,455)\n(335,797)\nTotal deferred tax liabilities\n(652,091)\n(1,122,455)\n(335,797)\nNet deferred tax asset (liability)\n$\n46,487\n$\n1,063,822\n$\n(129,689)\nAt September 30, 2022 and 2021, the Company had state NOL carryforwards of approximately $19.7 and $22.2 million, respectively, which begin to expire in varying amounts after the fiscal year ending September 30, 2026. The Company has federal R&D Tax Credit carryforwards of approximately $0 and $1.3 million in fiscal 2022 and 2021, respectively.\nDeferred tax assets are reduced by valuation allowances if, based on the consideration of all available evidence, it is more likely than not that some portion of the deferred tax asset will not be realized. Significant weight is given to evidence that can be verified objectively, and significant management judgment is required in determining any valuation allowance recorded against net deferred tax assets. The Company evaluates deferred income taxes on a quarterly basis to determine if valuation allowances are required by considering available evidence, including historical and projected taxable income and tax planning strategies which are both prudent and feasible. ASC Topic 740 requires the consideration of a valuation allowance to reflect the likelihood of realization of deferred tax assets. Significant management judgment is required in determining any valuation allowance recorded against net deferred tax assets.\nFor the year ended September 30, 2021, the valuation allowance was released against all federal and state deferred tax assets with the exception of certain state net operating losses due to positive evidence that the assets are more likely than not to be realized in future years. The Company will continue to assess all available evidence during future periods to evaluate any changes to the realization of its deferred tax assets. If the Company were to determine that it would be able to realize additional state deferred tax assets in the future, it would make an adjustment to the valuation allowance which would reduce the provision for income taxes.\nFollowing is a reconciliation of beginning and ending balances of total amounts of gross unrecognized tax benefits:\nFor the Fiscal Year Ended September 30,\nBalance at beginning of year\n$\n590,000\n$\n615,000\n$\n546,000\nUnrecognized tax benefits related to prior years\n-\n-\n39,000\nUnrecognized tax benefits related to current year\n-\n7,000\n37,000\nDecrease in unrecognized tax benefits due to the lapse of applicable statute of limitations\n(138,000)\n(32,000)\n(7,000)\nBalance at end of year\n$\n452,000\n$\n590,000\n$\n615,000\nThe total liabilities associated with the unrecognized tax benefits that, if recognized, would impact the Companys effective tax rate were $452,000, $590,000 and $615,000 at September 30, 2022, 2021 and 2020, respectively. It is not anticipated that the balance of unrecognized tax benefits at September 30, 2022 will change significantly over the next twelve months. The balance of unrecognized tax benefits as reflected in the table above at September 30, 2022 are recorded on the balance sheet as a reduction to deferred tax assets.\nThe Companys policy is to recognize interest accrued and, if applicable, penalties related to unrecognized tax benefits in income tax expense for all periods presented. At September 30, 2022, the Company currently has no unrecognized tax benefits against which interest has been accrued, and there is no accrual recorded for penalties.\nFor the fiscal years ended September 30, 2022, 2021 and 2020, the Company did not recognize any expense for interest (net of federal impact) within income tax expense.\nThe Company is subject to income taxes in the U.S. federal and various state jurisdictions. Tax regulations within each jurisdiction are subject to the interpretation of related tax laws and regulations and require significant judgment to apply. The Companys federal income tax returns for the fiscal years ended September 30, 2018 and thereafter are open years subject to examination by the Internal Revenue Service. The Company files income tax returns in various state jurisdictions, as appropriate, with varying statutes of limitation. There are no state income tax examinations in process at this time.\n11. Savings Plan\nThe Company sponsors a voluntary defined contribution savings plan covering all employees. The Company made contributions of approximately $126,000, $123,000 and $112,000 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\n12. Share-Based Compensation\nThe Company accounts for share-based compensation under the provisions of ASC Topic 718 by using the fair value method for expensing stock options and stock awards.\nTotal share-based compensation expense was approximately $345,000, $341,000, and $177,000 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively. The income tax impact recognized as a credit to additional paid in capital in the statement of shareholders equity related to share-based compensation arrangements was $166,617, $181,350 and $17,337 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively. Compensation expense related to share-based awards is recorded as a component of selling, general and administrative expenses.\n2019 Stock-Based Incentive Compensation Plan\nThe 2019 Plan was approved by the Companys shareholders at the Companys Annual Meeting of Shareholders held on April 2, 2019. The 2019 Plan authorizes the grant of stock appreciation rights, restricted stock, options and other equity-based awards. Options granted under the 2019 Plan may be either incentive stock options as defined in section 422 of the Code or nonqualified stock options, as determined by the Compensation Committee.\nSubject to an adjustment necessary upon a stock dividend, recapitalization, forward split or reverse split, reorganization, merger, consolidation, spin-off, combination, repurchase or share exchange, extraordinary or unusual cash distribution, or similar corporate transaction or event, the maximum number of shares of common stock available for awards under the 2019 Plan is 750,000, plus 139,691 shares of common stock that were authorized but unissued under the 2009 Plan as of the effective date of the 2019 Plan (i.e., April 2, 2019), all of which may be issued pursuant to awards of incentive stock options. In addition, the 2019 Plan provides that no more than 300,000 shares may be awarded in any calendar year to any employee. As of September 30, 2022, there were 653,836 shares of common stock available for awards under the 2019 Plan.\nIf any award is forfeited, terminates or otherwise is settled for any reason without an actual distribution of shares to the participant, the related shares of common stock subject to such award will again be available for future grant. Any shares tendered by a participant in payment of the exercise price of an option or the tax liability with respect to an award (including, in any case, shares withheld from any such award) will not be available for future grant under the 2019 Plan. If there is any change in the Companys corporate capitalization, the Compensation Committee must proportionately and equitably adjust the number and kind of shares of common stock which may be issued in connection with future awards, the number and kind of shares of common stock covered by awards then outstanding under the 2019 Plan, the aggregate number and kind of shares of common stock available under the 2019 Plan, any applicable individual limits on the number of shares of common stock available for awards under the 2019 Plan, the exercise or grant price of any award, or if deemed appropriate, make provision for a cash payment with respect to any outstanding award. In addition, the Compensation Committee may make adjustments in the terms and conditions of any awards, including any performance goals, in recognition of unusual or nonrecurring events affecting the Company or any subsidiary, or in response to changes in applicable laws, regulations, or accounting principles.\nFollowing is a summary of option activity under the 2019 Plan for the fiscal year ended September 30, 2022, and changes during the periods then ended:\nWeighted\nAverage\nAggregate\nExercise\nIntrinsic\nOptions\nPrice\nValue\nOutstanding at September 30, 2020\n100,000\n$\n7.10\n$\n-\nGranted\n-\n-\n-\nExercised\n-\n-\n-\nCancelled\n-\n-\n-\nOutstanding at September 30, 2021\n100,000\n$\n7.10\n$\n-\nGranted\n-\n-\n-\nExercised\n(42,416)\n8.26\n64,896\nCancelled\n-\n-\n-\nOutstanding at September 30, 2022\n57,584\n$\n7.10\n$\n88,104\nVested and expected to vest\n57,584\n$\n7.10\n$\n88,104\nOptions exercisable at September 30, 2022\n57,584\n$\n7.10\n$\n88,104\nThe following table summarizes information about stock options under the 2019 Plan at September 30, 2022:\nOptions Outstanding\nOptions Exercisable\nOutstanding\nWeighted-\nAs of\nAverage\nWeighted-\nAs of\nWeighted-\nRange of Exercise\nSeptember 30,\nRemaining\nAverage\nSeptember 30,\nAverage\nPrices\nContractual Life\nExercise Price\nExercise Price\n$0.00 - $9.00\n57,584\n7.9\n$\n7.10\n57,584\n$\n7.10\nFair value of each option grant is estimated on the date of grant using the Black-Scholes option pricing model. Options are exercisable over a maximum term of ten years from date of grant and vest typically over periods of three to five years from the grant date. The expected term of options represents the period of time that options granted are expected to be outstanding and is based on historical experience and the expected turnover rate of the employees receiving the options. Expected volatility is based on historical volatility of the Companys stock. The risk free interest rate is based on U.S. Treasuries with maturities consistent with the expected life of the options in effect at the time of grant. Compensation expense for employee stock options includes an estimate for forfeitures and is recognized ratably over the vesting term.\nBelow are the fair value assumptions used to record compensation expense, related to the 2019 Plan, for the following periods identified:\nFiscal Year Ended September 30,\n2022 (1)\n2021 (1)\nExpected dividend rate\n-\n-\n-\nExpected volatility\n-\n%\n-\n%\n58.4\n%\nWeighted average risk-free interest rate\n-\n%\n-\n%\n0.3\n%\nExpected lives (years)\n-\n-\n5.5\n(1) The Company did not grant any options in fiscal 2022 and 2021.\nThe Company granted 100,000 options in fiscal year 2020.\nTotal compensation expense associated with stock option awards to employees under the 2019 Plan was approximately $164,000, $181,000 and $17,000 for fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nAt September 30, 2022, unrecognized compensation expense of $0, net of forfeitures, related to non-vested stock options under the 2019 Plan, will be recognized.\nRestricted Stock Units\nDuring fiscal 2021, the Companys Board of Directors (the Board) approved grants of RSUs to the non-employee directors on the Board as compensation for their services during calendar year 2021. Under the terms of the awards, at the conclusion of the vesting period on January 3, 2022, the grants of RSUs were settled in shares of the Companys common stock at a rate of one share of stock for each unit, provided that if a director resigns from the Board prior to January 1, 2022, such director shall only receive a pro rata portion of such award for time served. As of September 30, 2021, there were 25,396 unvested restricted stock units outstanding under the 2019 Plan, all of which were issued during the fiscal year ended September 30, 2022. As of September 30, 2022, there were 32,897 unvested restricted stock units outstanding under the 2019 Plan.\nNon-vested\nWeighted Average\nStock Awards\nShare Price\nBalance at September 30, 2020\n27,488\n$\n5.82\nGranted\n25,396\n6.30\nIssued\n(27,488)\n5.82\nCancelled\n-\n-\nBalance at September 30, 2021\n25,396\n$\n6.30\nGranted\n38,986\n6.52\nIssued\n(27,425)\n6.32\nCancelled\n(4,059)\n6.57\nBalance at September 30, 2022\n32,897\n$\n6.51\nTotal share-based compensation expense associated with the annual grant of stock awards to non-employee directors under the 2019 Plan was approximately $178,000, $160,000 and $160,000 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nTotal share-based compensation expense associated with the annual grant of stock awards to employees under the 2019 Plan was approximately $3,000, $0 and $0 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nAt September 30, 2022, unrecognized compensation expense of $97,954, net of forfeitures, related to non-vested stock awards under the 2019 Plan, will be recognized.\n13. Commitments and Contingencies\nPurchase Obligations\nA purchase obligation is defined as an agreement to purchase goods or services that is enforceable and legally binding on the Company and that specifies all significant terms, including fixed or minimum quantities to be purchased, fixed, minimum or variable price provisions, and the approximate timing of the transaction. These amounts primarily comprise of open purchase order commitments entered in the ordinary course of business with vendors and subcontractors pertaining to fulfillment of the Companys current order backlog. The purchase obligations on open purchase orders were $2.6 million, $2.1 million and $0.9 million as of September 30, 2022, 2021 and 2020, respectively.\nProduct Liability\nThe Company has product liability insurance of $50,000,000. The Company has not experienced any material product liability claims.\nLegal Proceedings\nIn the ordinary course of business, the Company is at times subject to various legal proceedings and claims. The Company does not believe any such matters that are currently pending will, individually or in the aggregate, have a material effect on the results of operations or financial position.\n14. Related Party Transactions\nIn recent years, the Company has had sales to AML Global Eclipse, LLC, (Eclipse), whose principal shareholder is also a principal shareholder in the Company. Eclipse is a new related party for fiscal year 2022 due to their president acquiring more than 10% in shares on the company. Prior balances are disclosed below for comparability.\nSales to Eclipse amounted to $0.6 million, $1.6 million and $0.1 million for the years ended September 30, 2022, 2021 and 2020, respectively. As of September 30, 2022 and 2021, a contract liability to Eclipse was $0.1 million and $0.4 million, respectively.\n15. Business Segments\nThe Company operates in one business segment which designs, manufactures and sells flat panel displays, flight information computers, and advanced monitoring systems to the DoD, the Department of Interior, other government agencies, commercial air transport carriers and corporate/general aviation markets. The Company currently derives virtually all of its revenues from the sale of this equipment and related EDC.\nGeographic Data\nMost of the Companys sales, operating results and identifiable assets are generated in the United States. In fiscal years 2022, 2021 and 2020, net sales outside the United States amounted to $11.1 million, $8.4 million and $9.4 million, respectively.\nProduct Data\nThe Companys current product line includes FPDS, flight management systems, and air data systems and components. During fiscal years 2022, 2021 and 2020, the Company derived 98%, 88% and 80%, respectively, of its total product revenue from sales of FPDS. The remaining revenue for each of the fiscal years was from sales of air data systems and components.\n16. Lease Recognition\nThe Company accounts for leases in accordance with ASU 2016-02 and records right-of-use assets and corresponding lease liabilities on the balance sheet for most leases with an initial term of greater than one year. We recognize payments for leases with a term of less than one year in the statement of operations on a straight-line basis over the lease term.\nWe lease real estate and equipment under various operating leases. A lease exists when a contract or part of a contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. In determining whether a lease exists, we consider whether a contract provides us with both: (a) the right to obtain substantially all of the economic benefits from the use of the identified asset and (b) the right to direct the use of the identified asset.\nSome of our leases include base rental periods coupled with options to renew or terminate the lease, generally at our discretion. In evaluating the lease term, we consider whether we are reasonably certain to exercise such options. To the extent a significant economic incentive exists to exercise an option, that option is included within the lease term. However, based on the nature of our lease arrangements, options generally do not provide us with a significant economic incentive and are therefore excluded from the lease term for the majority of our arrangements.\nOur leases typically include a combination of fixed and variable payments. Fixed payments are generally included when measuring the right-of-use asset and lease liability. Variable payments, which primarily represent payments based on usage of the underlying asset, are generally excluded from such measurement and expensed as incurred. In addition, certain of our lease arrangements may contain a lease coupled with an arrangement to provide other services, such as maintenance, or may require us to make other payments on behalf of the lessor related to the leased asset, such as payments for taxes or insurance. As permitted by ASU 2016-02, we have elected to account for these non-lease components together with the associated lease component if included in the lease payments. This election has been made for each of our asset classes.\nThe measurement of right-of-use assets and lease liabilities requires us to estimate appropriate discount rates. To the extent the rate implicit in the lease is readily determinable, such rate is utilized. However, based on information available at lease commencement for our leases, the rate implicit in the lease is not known. In these instances, we utilize an incremental borrowing rate, which represents the rate of interest that we would pay to borrow on a collateralized basis over a similar term.\nRent expense and cash paid for various operating leases in aggregate are approximately $115,000 for the period ended September 30, 2022. The weighted average remaining lease term is 2.2 years, and the weighted average discount rate is 5.0% as of September 30, 2022. Related assets and liabilities resulting from lease obligations are deemed to be immaterial.\nFuture minimum lease payments under operating leases are as follows at September 30, 2022:\nTwelve Months\nEnding\nOperating\nSeptember 30,\nLeases\n$\n14,676\n14,676\n2,446\nTotal minimum lease payments\n$\n31,798\nAmount representing interest\n(3,118)\nPresent value of minimum lease payments\n28,680\nCurrent portion\n(13,615)\nLong-term portion of lease obligations\n$\n15,065 Item 9. Changes in and disagreements with accountants on accounting and financial disclosure.\nNone. Item 9A. Controls and procedures\n(a) We carried out an evaluation under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) promulgated under the Exchange Act of 1934. Based on that evaluation, our chief executive officer and chief financial officer concluded that these controls and procedures were effective as of September 30, 2022 to provide reasonable assurance that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the rules and forms of the Securities and Exchange Commission and accumulated and communicated to our management including our chief executive and financial officers, as appropriate, to allow timely decisions regarding required disclosure.\n(b) Managements annual report on internal control over financial reporting is set forth below on this Annual Report on Form 10-K.\n(c) There were no changes in the Companys internal control over financial reporting identified in connection with the evaluation of such controls that occurred during the Companys most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting.\nManagements report on internal control over financial reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control over financial reporting is a process designed under the supervision of the Companys principal executive officer and principal financial officer and intended to provide reasonable assurance regarding the reliability of financial reporting and preparation of the Companys financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America.\nThe Companys internal control over financial reporting includes policies and procedures that are intended to (1) pertain to maintenance of records that, in reasonable detail, accurately and fairly reflect transactions and dispositions of the assets of the Company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of Company assets that could have a material effect on financial statements.\nDue to its inherent limitations, internal control over financial reporting may not prevent or detect misstatements and, even when determined to be effective, can only provide reasonable, not absolute, assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to risk that controls may become inadequate as a result of changes in conditions or deterioration in the degree of compliance.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of September 30, 2022. This assessment was based on criteria for effective internal control over financial reporting described in Internal Control-Integrated Framework (2013), issued by the Committee on Sponsoring Organizations of the Treadway Commission. Based on this assessment, management believes that, as of September 30, 2022, internal control over financial reporting was effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with U.S. generally accepted accounting principles. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III Item 10. Directors, executive officers and corporate governance.\nThis information (other than information relating to executive officers included in Part I Item 1.) will be included in the Companys Proxy Statement relating to its Annual Meeting of Shareholders, which will be filed within 120 days after the close of the Companys fiscal year covered by this Annual Report on Form 10-K, and is hereby incorporated by reference to such Proxy Statement. IS&S has adopted a written code of business conduct and ethics, known as the Companys code of conduct, which applies to all of its directors, officers, and employees, including its chief executive officer, its president, and its chief financial officer. The Companys code of conduct is available on its website, www.innovative-ss.com. The code of conduct may also be obtained by contacting investor relations at (610) 646-9800. Any amendments to the Companys code of conduct or waivers from provisions of the code for its directors and officers will be disclosed on the Companys website promptly following the date of such amendment or waiver. Item 11. Executive compensation.\nThis information will be included in the Companys Proxy Statement relating to its Annual Meeting of Shareholders, which will be filed within 120 days after close of the Companys fiscal year covered by this Report, and is hereby incorporated by reference to such Proxy Statement. Item 12. Security ownership of certain beneficial owners and management and related stockholder matters.\nThis information will be included in the Companys Proxy Statement relating to its Annual Meeting of Shareholders, which will be filed within 120 days after close of the Companys fiscal year covered by this Report and is hereby incorporated by reference to such Proxy Statement.\nEquity Compensation Plan Information\nThe following table gives information about the Companys common stock that may be issued upon the exercise of options and rights under all of its existing equity compensation plans and arrangements as of September 30, 2022.\nNumber of Securities to be\nWeighted-average\nNumber of Securities remaining available\nissued upon exercise of\nexercise price of\nfor future issuance under equity\noutstanding options\noutstanding\ncompensation plans (excluding securities\nPlan Category\nand rights\noptions and rights\nreflected in second column)\nEquity compensation plans approved by security holders\n57,584\n$\n7.10\n653,836\nEquity compensation plans not approved by security holders\n-\n-\n-\nTotal\n57,584\n7.10\n653,836\nThe Company expects to make annual grants of restricted stock awards to its non-employee directors under the 2019 Plan. In the fiscal years ended September 30, 2022, 2021 and 2020, the Company granted to its non-employee directors a total of 27,425, 27,488 and 73,056 restricted shares, respectively, under the 2019 Plan.\nTotal share-based compensation expense for non-employee directors was $178,000, $160,000 and $160,000 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively. Item 13. Certain relationships and related transactions and director independence.\nRelated Party Transactions\nThis information will be included in the Companys Proxy Statement relating to its Annual Meeting of Shareholders, which will be filed within 120 days after close of the Companys fiscal year covered by this Report, and is hereby incorporated by reference to such Proxy Statement. Item 14. Principal accounting fees and services\nThis information will be included in the Companys Proxy Statement relating to its Annual Meeting of Shareholders, which will be filed within 120 days after close of the Companys fiscal year covered by this Report, and is hereby incorporated by reference to such Proxy Statement.\nPART IV Item 15. Exhibits, financial statement schedules.\n(a) The following documents are filed as part of this report:\n1. Financial Statements\nSee index to Financial Statements at Item 8 on page 36 of this report.\n2. Financial Statement Schedules\nSchedules have been omitted because they are not applicable or are not required or the information required to be set forth therein is included in the financial statements or notes thereto.\n3. The following exhibits are filed as part of, or incorporated by reference into this report:\nExhibit\nNumber\nExhibit Title\n3.1\nArticles of Incorporation of IS&S. (1)\n3.2\nAmended and Restated Bylaws of IS&S. (2)\n4.1\nDescription of Capital Stock\n4.2\nRights Agreement, dated September 12, 2022, between IS&S and Broadridge Corporate Issuer Soltutions, Inc. (3)\n10.1\nEmployment Agreement, dated February 14, 2012, between IS&S and Shahram Askarpour (4)\n10.2\nIS&S 2019 Stock-Based Incentive Compensation Plan (5)\nSubsidiaries of IS&S.\n23.1\nConsent of Grant Thornton LLP\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14(a)\n31.2\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(a)\n32.1\nCertification Pursuant to U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File - the cover page XBRL tags are embedded within the Inline XBRL document contained in Exhibit 101\n(1) Incorporated by reference from the Registrants Current Report on Form 8-K filed with the Commission on September 19, 2007.\n(2) Incorporated by reference from the Registrants Current Report on Form 8-K filed with the Commission on May 1, 2018.\n(3) Incorporated by reference from the Registrants Current Report on Form 8-K filed with the Commission on September 12, 2022.\n(4) Incorporated by reference from the Registrants Current Report on Form 8-K filed with the Commission on April 2, 2012.\n(5) Incorporated by reference from the Registrants Proxy Statement filed with the Commission on January 28, 2019.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nINNOVATIVE SOLUTIONS AND SUPPORT, INC.\nBy:\n/s/ Shahram Askarpour\nShahram Askarpour\nDirector & Chief Executive Officer\nDated: December 16, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Shahram Askarpour\nDirector & Chief Executive Officer\nDecember 16, 2022\nShahram Askarpour\n(Principal Executive Officer)\n/s/ Michael Linacre\nChief Financial Officer\nDecember 16, 2022\nMichael Linacre\n(Principal Financial and Accounting Officer)\n/s/ Winston J. Churchill\nDirector & Chairman of the Board\nDecember 16, 2022\nWinston J. Churchill\n/s/ Glen R. Bressner\nDirector & Vice Chairman of the Board\nDecember 16, 2022\nGlen R. Bressner\n/s/ Stephen L. Belland\nDirector\nDecember 16, 2022\nStephen L. Belland\n/s/ Roger A. Carolin\nDirector\nDecember 16, 2022\nRoger A. Carolin\n/s/ Parizad Olver (Parchi)\nDirector\nDecember 16, 2022\nParizad Olver (Parchi)"
}