{
    "cik": "851726",
    "company": "Santa Fe Gold CORP",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "1000",
    "state_of_inc": "AZ",
    "state_location": "NM",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/851726/0001096906-22-002483-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/851726/000109690622002483/sfgc-20220630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/851726/0001096906-22-002483.txt",
    "filename": "851726_10K_2022_0001096906-22-002483.htm",
    "content": "Item 1. BUSINESS\nOverview History\nWe are an exploration stage mining company, in the business of acquiring and developing metal and mineral properties that may contain recoverable gold and silver deposits. Our general business strategy is to acquire and develop mining properties positioned for low-cost production. We were originally incorporated in the State of Delaware on August 8, 1991 under the name Azco Mining, Inc. and on August 21, 2007, we changed our name to Santa Fe Gold Corporation by filing a Certificate of Amendment with the Delaware Secretary of State.\nAs an exploration mining company, we are engaged in the business of acquiring and developing mines and mining properties as well as securing production from existing and developed mining and mineral properties. Currently we own certain mining leases and other mineral rights, however none of them contain any proven or probable reserves, as defined in Regulation S-K 1300; and they are all currently considered exploratory in nature. Currently we have three projects, each of which management has determined is material based on the costs to secure the rights associated with them, as required by Regulation S-K 1304, these are: our Alhambra Property, the Jim Crow Imperial Mine and the Billali Mine, each of which are exploratory in nature and is described more fully in the properties section of this report.\nAlthough management is optimistic about its plans for developing certain such properties, to date, minimal mining activities have commenced at the Jim Crow Imperial Mine and the Billali Mine sites and there can be no assurance that the Companys mining activities will be profitable.\nAfter the dismissal from bankruptcy in June 2016, we had no assets and approximately $20 million of indebtedness was reinstated. The properties we currently own were acquired subsequent to our dismissal from bankruptcy proceedings. We will be required to raise the capital that is required, in part, to continue to development of our current mining properties, construct a mill operation for processing our head ore and to help meet our continuing working capital requirements. There can be no assurances that we will be successful in raising the capital necessary to implement our business plan or if we are successful, that there may not be additional or superseding demands on our capital resources. Although the Company has been successful in meeting its capital requirements in the past, since emerging from Bankruptcy and management continues to be optimistic about being able to secure needed funding, any failure to do so or any unforeseen expenses or other demands on the Companys capital could result in the need to curtail or cease operation, resulting in losses to investors.\nExploration Stage Company\nWe are considered an exploration stage company, as defined in S-K 1300. The Company has not demonstrated the existence of mineral reserves at any of our properties. Under Regulation S-K 1300, the SEC defines a mineral reserve as an estimate of tonnage and grade or quality of indicated and measured mineral resources that, in the opinion of the qualified person, can be the basis of an economically viable project. To have mineral resources, there must be reasonable prospects for economic extraction. Per the SEC, probable mineral reserves are the economically mineable part of an indicated and, in some cases, a measured mineral resource and proven mineral reserves can only result from measured mineral resources. Mineral reserves cannot be considered proven or probable unless and until they are supported by a preliminary feasibility study or feasibility study, indicating that the mineral reserves have had the requisite geologic, technical and economic work performed and are economically and legally extractable. We have not completed a preliminary feasibility study or feasibility study with regard to any of our properties to date. We do not anticipate leaving exploration stage company for the foreseeable future. Under S-K we will not exit the exploration stage until such time, if ever, that we demonstrate the existence of proven or probable mineral reserves that meet the guidelines under S-K 1300. When we begin extracting material from our properties, we will remain an exploration company under S-K 1300 guidelines.\nCompany Organizational Chart\nOverview of Current Events\nOur Business\nAs a mining company in the exploration stage, we are engaged in the business of acquiring mineral properties that may contain recoverable mineral deposits, (we are currently targeting gold and/or silver deposits) with a view to develop them and, if there are mineral resources identified or mineral reserves, to actively mine them. Although management is optimistic about its prospects for favorable exploration results on the properties in which it has acquired interests, to date no mineral reserves have been determined. There are however minimal mining activities that have commenced and we have conducted limited extraction activity. Nevertheless, there can be no assurance it will continue or, that if it does, that any of the mining activities will be profitable, with or without mineral reserves.\nManagements continuing efforts were successfully rewarded as the Company secured, what management believes will ultimately be, promising mining leases and other mineral rights. The properties we now own are exploratory in nature and consist of certain mining leases and other mineral rights. As stated, they were acquired subsequent to our dismissal from bankruptcy proceedings and, although management is optimistic, none of them contain any proven and probable reserves. We are in the process of raising the capital required, in part (i) to begin further exploration activities of these current mining properties, and (ii) to help meet our working capital requirements. There can be no assurances that we will be successful in raising the capital necessary to implement our business plan or that, if we are successful in raising such capital, that there may not be additional or superseding demands on our capital resources. Although the Company has been successful in meeting its capital requirements in the past, and since emerging from Bankruptcy, management continues to be optimistic about its ability to continue securing the funding needed to execute on its business plan, any failure to do so or any unforeseen expenses or other demands on the Companys capital could result in the need to curtail or cease some or all of the Companys operations, resulting in losses to investors.\nIn October 2021, we exercised the purchase option for $164,335 on the mill property in Duncan, Arizona, and the transaction closed on November 9, 2021.\nThe Company is currently in the process of acquiring a mill operation for its head ore to be located on its property in Duncan, Arizona. The seller of the mill has disassembled the mill in Kellogg, Idaho and relocated the mill to the Duncan, Arizona site. Currently all associated costs of the mill and its relocation are being accumulated and finalized by the seller. At this time there are no agreements between the seller and the Company as to terms and sales price of the delivered disassembled mill and such price is anticipated to be negotiated and determined in late fall 2022, when the necessary funding will be raised by the Company for the acquisition of the mill equipment and its construction. At the time of filing this Form 10-K, negotiations for the purchase of the disassembled mill with the seller have not taken place and will be finalized upon the Company raising the adequate funding for the acquisition and determination if the seller or the Company will be responsible for its construction at the mill site.\nOur Status as an Exchange Act Registrant and Trading in our Common Stock\nThe Companys common stock has been quoted on OTC Markets (PINK) most recently under the trading symbol SFEG. However, in July 2020 it received notice that on June 25, 2020, the U.S. Securities and Exchange Commission (the SEC or Commission)\nissued an order suspending trading under Section 12(k) of the Securities Exchange Act of 1934, as amended (the Exchange Act.). Thereafter, the Commission commenced administrative proceedings to de-register the Companys common stock under Section 12(j) of the Exchange Act. Issuers of securities registered pursuant to Section 12 of the Exchange Act are required under Section 13(a) of the Exchange Act and the rules promulgated thereunder to file current and accurate information in periodic reports with the Commission. Specifically, Exchange Act Rule 13a-1 requires issuers to file annual reports, and Exchange Act Rule 13a-13 requires domestic issuers to file quarterly reports. The Companys inability to prepare and file the required quarterly and annual reports began with the misappropriation of funds by its former CEO; this had a direct impact on its financial statements as originally filed. This not only resulted in the need to amend and restate the 2017 annual report and related quarterly reports that had been filed with the Commission on Form 10-K and on Forms 10-Q, but since a restatement necessarily has a material effect on all future reports, the Company was not in a position to confidently restate its financial statements until it was able to fully and accurately define the scope of: (a) the issue created by Mr. Laws and (b) the subsequent actions taken against Mr. Laws by the Company and other unrelated parties. Compounding the issue, the Companys auditor declined to continue auditing the Companys financial statements, management believes, due to its potential liability and the conflicts that could result from any of the Laws proceedings. Thereafter, the Company had difficulty engaging a qualified replacement audit firm, in part because of the perception of risk associated with the required restatements of its financial statements.\nUltimately, while the underlying circumstances that gave rise to the Companys delinquent filings were, in part, caused by an individual who was dismissed upon discovery of his misappropriation of funds, the difficulty in finding a replacement audit firm was an additional factor that was beyond the control of management that contributed substantially to delays in our filings. Although we have since filed the Annual Reports that were delinquent, one of which required restating our financials and all but three of the Quarterly Reports that were delinquent have since been filed, the Commissions standard position has been that, once de-registration proceedings are commenced for failure to comply with Exchange Act Section 13(a) and Rules 13a-1 and 13a-13 thereunder, it will not then grant a right to cure or comply. Thus, when the Commission then commenced administrative proceedings under Section 12(j), the Registrants only options were to defend the matter in litigation or to settle it and agree with the Commissions order for de-registration of securities registered under Section 12(j) of the Exchange Act. Therefore, given: (a) the protracted nature of litigation in general, and (b) the high expense associated with defending an adversary proceeding with the Commission and (c) the low probability of a successful outcome, compared with the fact that: (x) a settlement with the SEC would allow the Company to re-file a registration statement as soon as it was drafted, (y) the Company had already completed one of the required audits, was in a position to complete the other, and was in a position to file a Registration Statement on Form 10-12G, and (z) Form 10-12G Registration Statements are automatically effective 60 days from the date of filing (unless the Commission objects, which is rarely done, although it is now common to receive comments by the Commission that then must be addressed). After considering the forgoing, the Company determined that it was in the best interest of its shareholders to settle and consent to the de-registration of its common stock and to file a Registration Statement on Form 10-12G. On December 17, 2020, the SEC order suspending trading went into effect.\nOn May 14, 2022, the Company filed a Form 10-12G Registration statement with the SEC and was withdrawn by the Company on July 12, 2021 due to comments not completely cleared by the SEC. On July 20, 2021, we refiled a new Form 10-12G and on September 17, 2021 we withdrew the filing due to SEC comments requiring financial restatements. The Company made the required financial restatements and our auditors recertified the audited financial statements and we submitted a new Form 10-12G on June 14, 2022 and on August 4, 2022 the SEC declared our Form 10-12G Registration effective. Although the Company is not trading currently and we are a reporting Company under Section 12(g) of the Securities and Exchange Act of 1934, as amended and are required to timely file periodic and current reports with the SEC.\nThe Company is working on securing a broker dealer to prepare Form 211 for submittal to Financial Industry Regulatory Authority (FINRA) for review and approval. Upon receiving FINRAs approval and issuance our trading symbol, the Company will request a review from the OTC for removal the Caveat Emptor designation associated with our prior trading symbol and submit our application to the OTC to trade on their QB tier.\nCompetition\nThe mining industry is highly competitive. We will be competing with numerous companies, substantially all of which have far greater resources available to them that we are likely to have when Swe commence operations. We therefore may be at a significant disadvantage in the course of obtaining materials, supplies, labor, and equipment from time to time. Additionally, we are and will continue to be an insignificant participant in the business of mining, exploration and development. Because there is presently no known mineral reserve at this time on our existing properties, we have not determined the impact of any capital expenditures on our earnings or competitive position in the event a potentially commercially mineable ore deposit is discovered.\nCompliance with Government Regulations\nContinuing to acquire and explore mineral properties in the State of New Mexico will require the Company to comply with all regulations, rules and directives of governmental authorities and agencies applicable to the exploration of minerals in the State of New Mexico and the United States.\nThe mining industry, (specifically the activities of exploration, drilling) operate in a legal environment that requires permits to conduct virtually all operations; and permits are required by local, state and federal government agencies. Local authorities, usually counties, also have control over mining activity. The various permits address such issues as prospecting, development, production, labor standards, taxes, occupational health and safety, toxic substances, air quality, water use, water discharge, water quality, noise, dust, wildlife impacts, as well as other environmental and socioeconomic issues.\nLike all other mining companies doing business in the United States, we are subject to a variety of federal, state and local statutes, rules and regulations designed to protect the quality of the air and water, and to protect threatened or endangered species, in the vicinity of our mining operations. These include permitting or pre-operating approval requirements that are designed: (i) to ensure the environmental integrity of a proposed mining facility, (ii) to ensure operating plans are designed to mitigate the effects of discharges into the environment during exploration, mining operations, and reclamation and (iii) that post-operation plans are designed to remediate the lands affected by a mining facility once commercial mining operations have ceased.\nUnited States\nMining in the State of New Mexico is subject to federal, state and local law. Three types of laws are of particular importance to the Companys U.S. mineral properties: those affecting land ownership and mining rights; those regulating mining operations; and those dealing with the environment.\nLand Ownership\nOn Federal Lands, mining rights are governed by the General Mining Law of 1872 (General Mining Law) as amended, 30 U.S.C. §§ 21-161 (various sections), which allows the location of mining claims on certain Federal Lands upon the discovery of a valuable mineral deposit and proper compliance with claim location requirements. A valid mining claim provides the holder with the right to conduct mining operations for the removal of locatable minerals, subject to compliance with the General Mining Law and New Mexico state law governing the staking and registration of mining claims, as well as compliance with various federal, state and local operating and environmental laws, regulations and ordinances. As the owner or lessee of the unpatented mining claims, the Company has the right to conduct mining operations on the lands subject to the prior procurement of required operating permits and approvals, compliance with the terms and conditions of any applicable mining lease, and compliance with applicable federal, state, and local laws, regulations and ordinances.\nMining Operations\nThe exploration of mining properties and development and operation of mines is governed by both federal and state laws. The State of New Mexico likewise requires various permits and approvals before mining operations can begin, although the state and federal regulatory agencies usually cooperate to minimize duplication of permitting efforts. The State of New Mexico Mining and Minerals Division requires mine permits for each mining location. The permit has an Annual Permit Fee that is due by April 30 of each year. The Annual Permit Fee for minimal impact mines is currently $250.\nPrior to receiving the necessary permits to explore or mine, the operator must comply with all regulatory requirements imposed by all governmental authorities having jurisdiction over the project. Generally, in order to obtain the requisite permits, the operator must have its land reclamation, restoration or replacement plans pre-approved. Specifically, the operator must present its plan to restore or replace the affected area. Often these requirements result in delays and/or costly studies or changes in the proposed activities; which may extend the time to completion. Although this may be necessary in order to mitigate the negative impact of certain aspects of an initial plan, all of these factors make it more difficult and costly to operate; and have a negative, and sometimes fatal, impact on the economic viability of the exploration or planned mining operation. Finally, it is possible that future changes in laws or regulations could have a significant impact on our business, requiring the planned activities to be economically reevaluated at that time.\nEffect of Existing or Potential Government Regulations\nMineral exploration, including mining operations is subject to governmental regulation. Our operations may be affected in varying degrees by government regulation such as restrictions on production, price controls, tax increases, expropriation of property, environmental and pollution controls or changes in conditions under which minerals may be marketed. An excess supply of certain minerals may exist from time to time due to lack of markets, restrictions on exports, and numerous factors beyond our control. These factors include market fluctuations and government regulations relating to prices, taxes, royalties, allowable production and importing and exporting minerals. The effect of these factors cannot be accurately determined, and we are not aware of any probable government regulations that would impact the Company at this time, although there can be no assurances that regulations may not arise in the future. To the extent that government regulations do arise in the future, they may have a negative effect on our operations, which may in turn, result in losses to investors. This section is intended as a brief overview of the laws and regulations described herein and is not intended to be a comprehensive treatment of the subject matter.\nEnvironmental Laws\nFederal legislation in the United States and implementing regulations adopted and administered by the Environmental Protection Agency, the Forest Service, the Bureau of Land Management, the Fish and Wildlife Service, the Army Corps of Engineers and other agencies-in particular, legislation such as the federal Clean Water Act, the Clean Air Act, the National Environmental Policy Act, the Endangered Species Act, the National Forest Management Act, the Wilderness Act, and the Comprehensive Environmental Response, Compensation and Liability Act ‘have a direct bearing on domestic mining operations. These federal initiatives are often administered and enforced through state agencies operating under parallel state statutes and regulations.\nThe Clean Water Act\nThe Federal Clean Water Act is the principal Federal environmental protection law regulating mining operations in the United States as it pertains to water quality. At the state level, water quality is regulated by the New Mexico Environment Department. If our exploration or any future development activities could affect a ground water aquifer, we are required to apply for a ground water discharge permit in compliance with the groundwater regulations. If exploration affects surface water, then compliance with surface water regulations is required.\nThe Clean Air Act\nThe Federal Clean Air Act establishes ambient air quality standards, limits the discharges of new sources and hazardous air pollutants and establishes a federal air quality permitting program for such discharges. Hazardous materials are defined in the Federal Clean Air Act and enabling regulations adopted under the Federal Clean Air Act to include various metals. The Federal Clean Air Act also imposes limitations on the level of particulate matter generated from mining operations.\nNational Environmental Policy Act (NEPA)\nNEPA requires all governmental agencies to consider the impact on the human environment of major federal actions as therein defined.\nEndangered Species Act (ESA)\nThe ESA requires federal agencies to ensure that any action authorized, funded or carried out by such agency is not likely to jeopardize the continued existence of any endangered or threatened species or result in the destruction or adverse modification of their critical habitat. In order to facilitate the conservation of imperiled species, the ESA establishes an interagency consultation process. When a federal agency proposes an action that may affect a listed species, it must consult with the USFWS and must prepare a biological assessment of the effects of a major construction activity if the USFWS advises that a threatened species may be present in the area of the activity.\nNational Forest Management Act\nThe National Forest Management Act, as implemented through Title 36 of the Code of Federal Regulations, provides a planning framework for lands and resource management of the National Forests. The planning framework seeks to manage the National Forest System resources in a combination that best serves the public interest without impairment of the productivity of the land, consistent with the Multiple Use Sustained Yield Act of 1960.\nWilderness Act\nThe Wilderness Act of 1964 created a National Wilderness Preservation System composed of Federally owned areas designated by Congress as wilderness areas to be preserved for future use and enjoyment.\nThe Comprehensive Environmental Response, Compensation and Liability Act (CERCLA)\nCERCLA generally imposes joint and several liability, without regard to fault or legality of conduct, on classes of persons who are considered to be responsible for the release of a hazardous substance into the environment. These persons include the current owner or operator of a contaminated facility, a former owner or operator of the facility at the time of contamination and those persons that disposed or arranged for the disposal of the hazardous substance. Under CERCLA and comparable state statutes, such persons may be subject to strict joint and several liability for the costs of cleaning up the hazardous substances that have been released into the environment, for damages to natural resources and for the costs of certain health studies. In addition, it is not uncommon for neighboring landowners and other third parties to file claims for personal injury and property damage allegedly caused by the hazardous substances released into the environment. Governmental agencies or third parties may seek to hold the Company responsible under CERCLA and comparable state statutes for all or part of the costs to clean up sites at which such hazardous substances have been released.\nThe Resource Conservation and Recovery Act (RCRA)\nRCRA was designed and implemented to regulate the disposal of solid and hazardous wastes. It restricts solid waste disposal practices and the management, reuse or recovery of solid wastes and imposes substantial additional requirements on the subcategory of solid wastes that are determined to be hazardous. Like the Clean Water Act, RCRA provides for citizens suits to enforce the provisions of the law.\nNational Historic Preservation Act\nThe National Historic Preservation Act was designed and implemented to protect historic and cultural properties. Compliance with the Act is necessary where federal properties or federal actions are undertaken, such as mineral exploration on federal land, which may impact historic or traditional cultural properties, including native or Indian cultural sites.\nReclamation\nWe generally will be required to mitigate long-term environmental impacts by stabilizing, contouring, re-sloping and revegetating various portions of a site after mining and mineral processing operations are completed. These reclamation efforts would be conducted in accordance with detailed plans, which must be reviewed and approved by the appropriate regulatory agencies. As soon as we have a mining operation, we will be required to arrange and pledge certificates of deposits for reclamation with the state regulatory agencies. At this time no reclamation cost is required to be calculated or carried forward.\nEmployees\nWe currently have three full time employees as of our current fiscal year end. In order to implement our business plan, we will be required to employ or retain qualified consultants with the technical expertise to evaluate and mine our mineral properties and for administrative duties as required. We currently employ no miners for our mines in in New Mexico as we are currently under a mine maintenance protocol until the processing mill is in operation in Duncan, AZ.\nEmployment Agreements\nEffective July 7, 2020, the Company retained a new Chief Financial Officer and the prior Chief Financial Officer was reassigned to oversee all mining operations as they come on line in our fiscal 2022-23 year. Both parties signed a one-year employment agreement with the Company, with automatic successive one-year renewals provided that neither party has provided notice of termination prior to 30 days from the end of such applicable term.\nInsurance\nWe normally maintain property, liability and workmens compensation insurance coverages to cover losses or risks incurred in the ordinary course of business. Upon resuming operations, the Company will reinstate our insurance coverages.\nExploration\nThe Company has spent only nominal amounts during each of the last two fiscal years on exploration and mine development due to the lack of availability to currently economically process mined head ore into concentrates that could be monetized for working capital funds.\nSeasonality\nWe have no properties at this time that are subject to material restrictions on our operations due to seasonality.\nOffice Facilities\nOur principal offices are located at 2325 San Pedro NE, Suite 225, Albuquerque, NM 87110. Our telephone number is (505) 255-4852 and our mailing address is P.O. BOX 25201, Albuquerque, NM 87125-0201.\nDismissal of Bankruptcy Proceeding and Emergence from Voluntary Reorganization\nIn August 2015, the Company filed for Bankruptcy protection under Chapter 11 of the United States Bankruptcy Code in Delaware in order to secure the existing assets from creditor actions, Case No. 15-11761 (MFW). Notwithstanding the Companys Bankruptcy, the management continued to search for options that would allow it to continue as a going concern.\nAfter the dismissal from Bankruptcy, the Company had limited assets, yet remained liable for all commitments and debts that then were outstanding. Santa Fe Gold Barbados, The Lordsburg Mining Company and AZCO are subsidiaries of the Company with no assets and all of their commitments and debts remain. The bankruptcy court set up a trust fund funded by the activities of the Summit mine (main asset sold in bankruptcy proceedings) for five years from the inception of mine production at the Summit mine, with the funds held in trust distributed by an independent trustee to certain unsecured creditors. Following prior managements failure to provide a plan of reorganization, the resulting significant transactions that occurred upon emergence from bankruptcy were as follows:\n·The approximately $20 million of indebtedness outstanding on account of the Companys finance facilities and unsecured claims were reinstated; and\n·The Court established a trust in April 2016 for the benefit of certain creditors. A profit interest was attached to the Summit mine for the benefit of certain creditors holding unsecured claims filed by each creditor.\nThe Company received Bankruptcy Court confirmation of the dismissal in June 2016, and subsequently emerged from bankruptcy. The only funds available for the future administrative costs were prepaid insurance funds of approximately $49,000. The Company subsequently began selling, on a best-efforts basis, equity for the cash needed for working capital purposes. Currently we have no continuing commitment from any party to provide working capital, and there is no certainty that the Company will be able to continue its current business plan. However, the mining claims / assets that it has managed to secure appear to present a significant opportunity for the Company to continue in the mining business.\nAvailable Information\nWe make available, free of charge, on or through our Internet website, at www.santafegoldcorp.com, our annual report on Form 10-K, our quarterly reports on Form 10-Q and our current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the U.S. Securities Exchange Act of 1934. Our Internet website and the information contained therein or connected thereto are not intended to be, and are not, incorporated into this report on Form 10-K.\nYou can read our SEC filings, including this annual report as well as our other periodic and current reports, on the SECs website at www.sec.gov. You may also read and copy any document we file with the SEC at its public reference facilities at 100 F Street, N.E., Room 1580, Washington, D.C. 20549. You may also obtain copies of the documents at prescribed rates by writing to the Public Reference Section of the SEC at 100 F Street, N.E., Room 1580, Washington, D.C. 20549. Please call the SEC at 1-800-SEC-0330 for further information on the operation of the public reference facilities. ITEM 1A. RISK FACTORS\nThe Company operates in a rapidly changing environment that involves numerous risks and uncertainties involving precious metal prices, explorations costs and government oversight. Investors should carefully consider the risks described below before purchasing the Companys common shares. The occurrence of any of the following events could negatively affect our business operations and our results of operations. If these events occur, the trading price of the Companys common shares could decline, and shareholders may lose part or even all of their investment.\nRisk Associated with Our Business\nOur business involves a number of very significant risks, including but not limited to various areas of the mining exploration industry. The Company operates in a rapidly changing environment that involves numerous risks and uncertainties involving precious metal prices, explorations costs and government oversight. Our business, operating results and financial condition could be seriously harmed as a result of the occurrence of any of the following risks.\nYou should invest in our common stock only if you can afford to lose your entire investment. Your decision to invest in our common stock should only be made after you have knowingly accepted the possibilities of such a loss and the associated risks.\nRisks Related to Our Business\nAll of our properties are in the exploration stage. There can be no assurance that we will establish the existence of any mineral resource or reserves on any of our properties. Until we can do so, there is a possibility we may not be likely to generate substantial revenues from these properties on an economically feasible basis, and our business could fail.\nWe have not established that any of our mining properties contain any mineral reserves; and as such, under Regulation S-K 1300 et. seq. (Reg S-K 1300), we are considered an exploration stage company. Under the new rules set forth in Reg S-K 1300, an individual property is defined as being: 1.) An exploration stage property if it has no mineral reserves disclosed; 2.) A development stage property if it has mineral reserves disclosed, but has no material extraction; and 3.) A production stage property if it has material extraction of mineral reserves. Our ability to conclude that an individual prospect has any viable mineral reserves requires further efforts and any funds that we spend on exploration may be lost. Even if we do eventually discover mineral reserves on one or more of our properties and they are considered development stage because we have not engaged in any material extraction, there can be no assurances that they will become production stage properties. Both mineral exploration and development involve a high degree of risk and few properties, which are explored become development properties; and even if they become eligible to be considered development stage properties, as defined in Reg. S-K 1300, there are no assurances that they will ultimately become production stage properties with commercially viable producing mines.\nThe commercial viability of an established mineral deposit will depend on a large number of factors; including, by way of example, the size, grade and other attributes of the mineral deposit, the proximity of the resource to infrastructure, roads and a point for shipping, government regulation and market prices. Most of these factors will be beyond our control, and any of them could increase costs and make extraction of any previously identified mineral resource unprofitable. Because of this, we will most likely be required to conduct a feasibility study by a qualified person or company in order to secure any financing for development, extraction and processing. Feasibility studies, themselves, are very time consuming and costly. There are no assurances that we will be able to fund a feasibility study or to find an investor or partner that will be willing to fund feasibility studies needed to progress to extraction. If we are unable to fund a feasibility study when needed, or if the results of a feasibility study do not suggest that a property will be commercially viable, any funds used on the property will have been lost.\nEven if commercial viability of a mineral or metal deposit is established, we may be required to expend significant resources until production is possible, during which time the economic feasibility of production may change. Substantial expenditures are required to both establish proven and probable reserves as well as those required to implement permitting and drilling operations. Because of these uncertainties, investors have no assurances that our drilling programs will result in commercially viable operations nor that we will be successful in the establishment or expansion of any resources or reserves. Any failure in our ability to successfully execute on the forgoing will adversely impact our business results of operations, in turn leading to losses for investors.\nAs the Company has adopted the required disclosure prescribed in Regulation S-K 1300 et. seq., the concept of a feasibility study is the same; and although, the terms mineral resource, measured mineral resource, indicated mineral resource and inferred mineral resource were not defined terms under SEC Industry Guide 7 and were not permitted to be used in reports and registration statements filed with the SEC. Under Reg. S-K 1300 each of those terms is specifically defined and must be used as defined therein in describing mineral deposits in the required reports. Investors are cautioned not to assume that any part or all of potential mineral deposits will ever be converted into mineral resources, as the term under Reg. S-K 1300 means not only that there are mineral deposits present but that they have been determined to be economically viable for extraction. The mineral deposits on our properties have a great amount of uncertainty as to their existence, and great uncertainty as to their economic feasibility. Our properties currently do not contain any known proven or probable ore reserves under Reg. S-K 1300 reporting standards. Investors are cautioned not to assume that any identified mineral deposits will be determined to be mineral reserves or ever be converted into mineral resources as defined in Reg. S-K 1300 et. seq.\nIf we establish the existence of commercially viable mineral resources on any of our properties, we will require additional capital in order to develop the property into a producing mine. If we cannot raise this additional capital, we will not be able to exploit the resource, and our business could suffer.\nIf we do discover mineral resources on any of our properties, as defined under Reg. S-K 1300 meaning that such mineral deposit(s) is/are commercially viable, we will be required to expend substantial sums of money to establish the extent of the resource, engage in drilling operations and develop extraction and processing facilities (or effect acceptable shipping arrangements therefor) and infrastructure. We do not have adequate capital to develop necessary facilities and infrastructure and will need to raise additional funds. Although we may derive substantial benefits from the discovery of commercially exploitable deposits, there can be no assurance that such a mineral resource will be large enough to justify conventional commercial operations or that we will be able to raise the funds required for development and/or processing on a timely basis. If we cannot raise the necessary capital or complete the necessary facilities, infrastructure, development, processing or related activities, our business may fail and we may be forced to curtail or cease operations.\nOur exploration and extraction activities may not be commercially successful.\nWhile we believe there are positive indicators that our properties contain commercially exploitable minerals and metals, such belief has been based solely on preliminary tests that we have conducted and data provided by third parties. There can be no assurance that the tests and data upon which we have relied are correct or accurate. Moreover, mineral exploration is highly speculative in nature, involves many risks and is frequently non-productive. Unusual or unexpected geologic formations and the inability to obtain suitable or adequate machinery, equipment or labor are risks involved in the conduct of most exploration programs. The success of mineral exploration and development is determined in part by the following factors:\n·the identification of potential mineralization based on analysis;\n·the availability of permits;\n·compliance with environmental requirements;\n·increases in operating mining related costs;\n·the quality of our management and our geological and technical expertise; and\n·the capital available for mining operations.\nSubstantial expenditures and time are required to establish existing proven and probable reserves through drilling and analysis, and to develop the mines and facilities and infrastructure at any site chosen for mining. Whether a mineral or metal deposit will be commercially viable and meet Reg. S-K 1300s definition of mineral resource, depends on a number of factors, which include, without limitation: the particular attributes of the deposit, such as size, grade and proximity to infrastructure; metal prices, which fluctuate widely; and government regulations, including, without limitation, regulations relating to prices, taxes, royalties, land tenure, land use, importing and exporting of minerals and environmental protection; and general economic factors, which include, without limitation, market prices for certain minerals or metals, labor costs, the impact of technological innovations on the supply and demand for the commodities we mine. If our exploration and extraction activities are not successful, our business will likely fail.\nThere may be challenges to the title of our mineral properties.\nThe Company has acquired certain rights to its properties by unpatented claims, ownership of land or by lease from those owning the property and its patented claims are limited. The validity of title to many types of natural resource property depends upon numerous circumstances and factual matters (many of which are not discoverable of record or by other readily available means) and is subject to many uncertainties of existing law and its application. There can be no assurance that the validity of our titles to our properties will be upheld or that third parties will not otherwise seek to invalidate those rights. In the event the validity of our title to any of these properties are not upheld, such events would have a material adverse effect on us.\nMineral operations are subject to applicable law and government regulations. Even if we discover a mineral resource in a commercially exploitable quantity, these laws and regulations could restrict or prohibit the exploitation of them. If we cannot exploit any mineral resources that we discover on our properties, our business may fail.\nBoth mineral exploration and extraction require permits from various foreign, federal, state, provincial and local governmental authorities and are governed by laws and regulations, including those with respect to prospecting, mine development, mineral production, transport, export, taxation, labor standards, occupational health, waste disposal, toxic substances, land use, environmental protection, mine safety and other matters.\nCompanies, such as ours that plan to engage in exploration and extraction activities, often experience increased costs and delays in production and other schedules as a result of the need to comply with applicable laws, regulations and permits. Issuance of permits for our activities is subject to the discretion of government authorities, and we may be unable to obtain or maintain such permits. Permits required for future exploration or development may not be obtainable on reasonable terms, on a timely basis or at all. There can be no assurance that we will be able to obtain or maintain any of the permits required for the continued exploration or development of our mineral properties or for the construction and operation of a mine on our properties at economically viable costs. If we cannot accomplish these objectives, our business could face difficulty and/or fail.\nWe believe that we are in compliance with all material laws and regulations that currently apply to our activities but there can be no assurance that we can continue to do so. Current laws and regulations could be amended and we might not be able to comply with them, as amended. Further, there can be no assurance that we will be able to obtain or maintain all permits necessary for our future operations, or that we will be able to obtain them on reasonable terms. To the extent such approvals are required and are not obtained, we may be delayed or prohibited from proceeding with planned exploration or development of our mineral properties.\nEnvironmental hazards unknown to us, which have been caused by previous or existing owners or operators of the properties, may exist on the properties in which we hold an interest. It is possible that our properties could be located on or near the site of a Federal Superfund cleanup project. Although we endeavor to avoid such sites, it is possible that environmental cleanup or other environmental restoration procedures could remain to be completed or mandated by law, causing unpredictable and unexpected liabilities to arise. We are not currently aware of any environmental issues or litigation relating to any of our current or former properties but if they were to arise, we could face significant liability that would negatively impact our operations that would cause our business to fail.\nCompetition in the mining industry is intense, and we have limited financial and personnel resources with which to compete.\nCompetition in the mining industry for desirable properties, investment capital, equipment and personnel are intense. Numerous companies headquartered in the United States, Canada and elsewhere throughout the world compete for properties on a global basis, including areas where we intend to operate. We are currently an insignificant participant in the mining industry due, in part, to our limited financial and personnel resources. We may be unable to: i) attract the necessary investment capital or a joint venture partner to fully develop our mineral properties, ii) acquire other desirable properties, iii) attract and hire necessary personnel, or iv) purchase necessary equipment.\nThe nature of mineral exploration and production activities involves a high degree of risk and the possibility of uninsured losses.\nThe business of exploring for and extracting minerals and metals involves a high degree of risk. Few properties are ultimately developed into producing mines. Whether a mineral deposit can be commercially viable depends upon a number of factors, including the particular attributes of the deposit, including size, grade and proximity to infrastructure, metal prices, which can be highly variable, and government regulation, including environmental and reclamation obligations. These factors are not within our control. Uncertainties as to the metallurgical amenability of any minerals discovered may not warrant the mining of these metals or minerals on the basis of available technology. Our operations are subject to all of the operating hazards and risks normally incident to exploring for and developing mineral or metal properties, such as, but not limited to:\n·encountering unusual or unexpected formations;\n·environmental pollution;\n·personal injury, flooding and landslides;\n·variations in grades of minerals or metals;\n·political and economic related conditions;\n·labor disputes; and\n·a decline in the price of gold or silver.\nWe currently have no insurance or hedges to guard against any of these risks. If we determine that capitalized costs associated with any of our mineral interests are not likely to be recovered, we would incur a write-down on our investment in such property interests. All of these factors may result in losses in relation to amounts spent which are not recoverable. The payment of any liabilities that arise from any such occurrence would have a material, adverse impact on our Company.\nOur exploration and development activities are subject to environmental risks, which could expose us to significant liability and delay, suspension or termination of our operations.\nThe exploration, possible future development and production phases of our business will be subject to federal, state and local environmental regulation. These regulations mandate, among other things, the maintenance of air and water quality standards and land reclamation. They also set out limitations on the generation, transportation, storage and disposal of solid and hazardous waste. Environmental legislation is evolving in a manner which will require stricter standards and enforcement, increased fines and penalties for non-compliance, more stringent environmental assessments, and a heightened degree of responsibility for companies and their officers, directors and employees. Future changes in environmental regulations, if any, may adversely affect our operations. If we fail to comply with any of the applicable environmental laws, regulations or permit requirements, we could face regulatory or judicial sanctions. Penalties imposed by either the courts or administrative bodies could delay or stop our operations or require a considerable capital expenditure. Although we intend to comply with all environmental laws and permitting obligations in conducting our business, there is always a possibility that those opposed to exploration and mining may attempt to interfere with our operations, whether by legal process, regulatory process or otherwise.\nWe could be subject to environmental lawsuits.\nNeighboring landowners, other third parties and governmental entities could file claims based on environmental statutes and common law for personal injury and property damage allegedly caused by the release of hazardous substances or other waste material into the environment on or around our properties. There can be no assurance that our defense of such claims will be successful. A successful claim against us could have an adverse effect on our business prospects, financial condition and results of operation.\nThe Companys industry is highly competitive and we have less capital and resources than many of our competitors which may give them an advantage in developing and securing mining claims and marketing products similar to ours or make our products obsolete.\nWe are involved in a highly competitive industry where we may compete with numerous other companies who offer alternative methods or approaches. These competitors may have far greater resources, more experience, and personnel perhaps more qualified than we do.\nSuch resources may give our competitors an advantage in developing and marketing products similar to ours or products that make our products obsolete. There can be no assurance that we will be able to successfully compete against these other entities.\nThe Companys failure to continue to attract, train, or retain highly qualified personnel could harm the Companys business:\nThe Companys success also depends on the Companys ability to attract, train, and retain qualified personnel, specifically those with management and product development skills. In particular, the Company must hire additional skilled personnel to further the Companys research and development efforts. Competition for such personnel is intense. If the Company does not succeed in attracting new personnel or retaining and motivating the Companys current personnel, the Companys business could be harmed.\nRisks Related to the Company\nLitigation with respect to Mr. Laws may not result in additional funds being obtained to reduce his indebtedness owed to the Company.\nThe Company has determined by its records that Mr. Laws initially owed us $1,197,198 (The Missing Funds), excluding related professional fees, forensic accounting costs and interest and penalties associated with the indebtedness. As of the filing of this Form 10-K, after deducting cash collections of $990,632 from Laws and related litigation and properties held for sale of $25,800, Laws owes the Company $180,766 plus penalties, professional fees and accrued interest. The Company has been awarded from litigation and collection efforts, the foreclosure on pledged assets and received these assets free and clear of any liens.\nThere were also expenses associated with engaging the special committee to conduct a forensic review of the Companys books and records in connection with the transactions giving rise to the Missing Funds. The Company has incurred costs associated with engaging counsel to represent the Company in this matter and in the investigations as well as the court proceedings. The Missing Funds together with the additional expenses that have arisen as a result of Mr. Laws actions in the aggregate are substantial and have been expensed in the periods incurred.\nThere can be no assurance the Company will successfully implement its plans.\nWe have historically incurred net losses from operations and we expect losses in the future periods. Our likelihood of success must be considered in light of the problems, expenses, difficulties, complications and delays frequently encountered in connection with the formation of a new business which seeks to obtain funds to finance its operations in a highly competitive environment. There can be no assurance that we will successfully implement any of our plans (including without limitation production of any mine, shipping ore to a smelter or otherwise commercially exploit our properties) in a timely or effective manner or that we will ever be profitable. In addition, there can be no assurances that we will choose to continue to develop any of our current properties because we intend to consider and, as appropriate, to divest ourselves of properties that may no longer be a strategic fit to our business strategy or that we lack the necessary capital to develop. If we lack the capital to implement our plans, we will be forced to curtail or cease operations.\nMineral exploration and development inherently involve significant and irreducible financial risks. We may suffer from the failure to find and develop profitable mineral deposits.\nThe exploration for and development of mineral deposits involves significant financial risks, which even a combination of careful evaluation, experience and knowledge may not eliminate. Unprofitable efforts may result from the failure to discover mineral deposits. Even if mineral deposits are found, such deposits may be insufficient in quantity and quality to return a profit from production, or it may take a number of years until production is possible, during which time the economic viability of the project may change. Few properties which are explored are ultimately developed into producing mines. Mining companies rely on consultants and others for exploration, development, construction and operating expertise.\nSubstantial expenditures are required to establish ore reserves, extract metals from ores and, in the case of new properties, to construct mining and processing facilities. The economic feasibility of any development project is based upon, among other things, estimates of the size and grade of ore reserves, proximity to infrastructures and other resources (such as water and power), metallurgical recoveries, production rates and capital and operating costs of such development projects, and metals prices. Development projects are also subject to the completion of favorable feasibility studies, issuance and maintenance of necessary permits and receipt of adequate financing.\nOnce a mineral deposit is developed, whether it will be commercially viable depends on a number of factors, including: the particular attributes of the deposit, such as size, grade and proximity to infrastructure; government regulations including taxes, royalties and land tenure; land use, importing and exporting of minerals and environmental protection; and mineral prices. Factors that affect adequacy of infrastructure include: reliability of roads, bridges, power sources and water supply; unusual or infrequent weather phenomena; sabotage; and government or other interference in the maintenance or provision of such infrastructure. All of these factors are highly cyclical. The exact effect of these factors cannot be accurately predicted, but the combination may result in not receiving an adequate return on invested capital.\nSignificant investment risks and operational costs are associated with our exploration activities. These risks and costs may result in lower economic returns and may adversely affect our business.\nMineral exploration, particularly for gold, involves many risks and is frequently unproductive. If mineralization is discovered, it may take a number of years until production is possible, during which time the economic viability of the project may change. Development projects may have no operating history upon which to base estimates of future operating costs and capital requirements. Development project items such as estimates of reserves, metal recoveries and cash operating costs are to a large extent based upon the interpretation of geologic data, obtained from a limited number of drill holes and other sampling techniques, and feasibility studies. Estimates of cash operating costs are then derived based upon anticipated tonnage and grades of ore to be mined and processed, the configuration of the ore body, expected recovery rates of metals from the ore, comparable facility and equipment costs, anticipated climate conditions and other factors. As a result, actual cash operating costs and economic returns of any and all development projects may materially differ from the costs and returns estimated, and accordingly, our financial condition and results of operations may be negatively affected.\nAny of our future acquisitions may result in significant risks, which may adversely affect our business.\nAn important element of our business strategy is the opportunistic acquisition of operating mines, properties and businesses or interests therein within our geographical area of interest. While it is our practice to engage independent mining consultants to assist in evaluating and making acquisitions, any mining properties or interests therein we may acquire may not be developed profitably or, if profitable when acquired, that profitability might not be sustained. In connection with any future acquisitions, we may incur indebtedness or issue equity securities, resulting in increased interest expense, or dilution of the percentage ownership of existing shareholders. We cannot predict the impact of future acquisitions on the price of our business or our common stock. Unprofitable acquisitions, or additional indebtedness or issuances of securities in connection with such acquisitions, may impact the price of our common stock and negatively affect our results of operations.\nOur ability to find and acquire new mineral properties is uncertain. Accordingly, our prospects are uncertain for the future growth of our business.\nBecause mines have limited lives based on proven and probable ore reserves, we may seek to replace and expand our future ore reserves, if any. Identifying promising mining properties is difficult and speculative. Furthermore, we encounter strong competition from other mining companies in connection with the acquisition of properties producing or capable of producing gold. Many of these companies have greater financial resources than we do. Consequently, we may be unable to replace and expand future ore reserves through the acquisition of new mining properties or interests therein on terms we consider acceptable. As a result, our future revenues from the sale of gold or other precious metals, if any, may decline, resulting in lower income and reduced growth.\nDelaware law and our by-laws protect our directors from certain types of lawsuits.\nDelaware law provides that our directors will not be liable to us or our stockholders for monetary damages except for certain types of conduct as directors. Our by-laws require us to indemnify our directors and officers against all damages incurred in connection with our business to the fullest extent provided or allowed by law. The exculpation provisions may have the effect of preventing stockholders from recovering damages against our directors caused by their negligence, poor judgment, or other circumstances. The indemnification provisions may require us to use our assets to defend our directors and officers against claims, including claims arising out of their negligence, poor judgment, or other circumstances.\nEven if the Ore Contains a Substantial amount of Gold or Silver it May Not be Profitable Because of Other Factors.\nThe Company is in the preliminary stages of mining operations in the Jim Crow and Billali Mines. There can be no assurances of continued mining operations at the Jim Crow and Billali Mines or that continued operations will be profitable. The Company currently does not have a long-term smelting contract and there can be no assurances that shipping to a smelter will occur in the immediate or near future. Transportation of head ore is expensive and the smelter the Company previously used is no longer accepting ore from outside sources. This has forced the Company to advance its plans to construct a mill on our site in Duncan, Arizona. This will enable us to process our ore into concentrate, which is more efficient to transport cost wise to the smelter. Without the ability to process the head ore into concentrate, the transportation of the head ore is cost prohibitive. Thus, it is imperative that the Company construct a mill to process its ore on a site that is in close proximity to our mine sites. Any delays in securing the financing necessary to construct the required mill and/or any delays in constructing it will negatively impact the Companys mining operations and results of operations. The Company is currently seeking financing to construct the mill but there can be no assurances that it will be successful in securing the necessary financing or that if it is able to secure financing that it will be on terms that are favorable to the Company. Any delays or problems in raising the funds required for a mill will adversely impact the Company and its operations which ultimately adversely impacts investors.\nDismissal of Bankruptcy Proceedings and Emergence from Voluntary Reorganization did not result in the elimination of Company liabilities.\nAfter the dismissal of the bankruptcy petition in June 2016 and the sale of the Companys significant assets, the Company emerged with limited assets while it remained liable for all commitments and debts that then were outstanding. Santa Fe Gold Barbados, The Lordsburg Mining Company and AZCO are subsidiaries of the Company with no assets and all of their commitments and debts remain outstanding. The bankruptcy court set up a trust fund, funded by the activities of the Summit mine (main asset sold in bankruptcy proceedings) for five years from the inception of mine production at the Summit mine and the trust funds will be distributed to certain unsecured creditors by an independent trustee. The Company failed to provide a plan of reorganization with the filing for protection under the Bankruptcy Code and as such, its debts were not discharged. The significant transactions that occurred upon emergence from bankruptcy were as follows:\n·The approximately $20 million of indebtedness outstanding on account of the Companys senior notes and unsecured claims were reinstated; and\n·The courts established a trust in April 2016 for the benefit of certain creditors. A profit interest was attached to the Summit mine with the benefit for certain creditors holding unsecured claims filed by each creditor.\nAccordingly, there can be no assurance that the Companys remaining liabilities, after the emergence from bankruptcy, will not materially impact the Company. The Company has no continuing commitment from any party to provide working capital, and there is no certainty that the Company will be able to raise sufficient capital to fund any or all existing liabilities as well as to fund its current business plan. The failure to raise needed capital may result in the curtailment or cessation of our business.\nWe have a history of operating losses and expect to incur substantial operating losses and negative operating cash flows for the foreseeable future, and we may never achieve or maintain profitability.\nWe have had no revenues since emerging from bankruptcy, and we may not generate revenues this current fiscal year, depending on the completion of our mill project. We do not currently have sufficient capital to fund operations through June 30, 2023 and will need to raise additional funding to implement our business strategy. Even if we succeed in developing any of our properties and the mill site, we may incur operating losses for the foreseeable future and may never become profitable. We also expect to continue to incur significant operating and capital expenditures and anticipate that our expenses will increase substantially in the foreseeable future. As the Company has no commitment for debt or equity financing, the Company will be reliant upon best-efforts fund-raising activities to provide sufficient working capital to fund current and future needs. There can be no assurance that the Company will be successful in its best-efforts capital raising efforts, and the failure to raise needed capital will result in the curtailment or cessation of our business.\nWe may never be able to write-down certain liabilities and this may have a negative impact on our ability to raise capital and on the market price of our common stock, when we resume trading.\nAt the end of the Companys fiscal year ending June 30, 2019, the Company wrote off debt and related accrued interest aggregating $12,507,540. The write off of debt was related to two finance facilities governed by and enforceable under British Columbia statutes. The Company retained legal services in British Columbia to research the British Columbia statutes of limitations on the collectability of the finance facilities. Legal counsel reviewed all related documents, records of proceedings and all records and documents deemed relevant to the two finance facilities. The finance facilities were subject to the laws of the Providence of British Columbia and the National laws of Canada and as a result, the Company secured a written legal opinion from Canadian counsel that any liability under the two finance facilities, because of the Limitations Act (British Columbia) and the relevant case law in British Columbia, were no longer enforceable. That is, because the statute of limitations had run for the two liabilities, pursuant to the Limitations Act (British Columbia), no future claims could be commenced in the Province of British Columbia and therefore, the Company had no outstanding legal obligations on the two finance facilities. With this, the Company wrote down $12,507,540 in liabilities and this has been the Companys position; however, upon review of earlier Registration Statements that were subsequently withdrawn, the SEC Staff expressed its concern with the Company taking this write-down because FASB ASC 405-20-40-1(b) states that a liability has been extinguished if the debtor is legally released from being the primary obligor under the liability, either judicially or by the creditor. Since management knew that one of the creditors had been dissolved and was no longer in existence and the other creditor had written-off the amounts that had been owed to it by the Company in one of its annual reports, it knew that it would be difficult if not impossible to get both creditors to release it from liability and that obtaining a court order would be time consuming and expensive at best. The Commission Staff was willing to allow an opinion of counsel, however the opinions we provided did not meet the standard that the Commission requires. The standard that the Commission Staff requires is what is sometimes referred to as a would or will opinion. In requiring a will or would opinion, the Commission is looking for greater assurance that the Company would or will be successful in the event that one of the creditors sought to collect on the liabilities. Although this standard may seem subjective, will opinions are regularly used in the context of tax law where a tax opinion is needed. In that context the term will means that the drafter of the opinion believes and is effectively stating that there is a 90%-95% probability that a given result will come to pass based on the facts present. Absent the availability of one of these three routes to write-off the liabilities, he Commission Staffs position is that\nthe correct treatment of the aforementioned liabilities is to continue carrying them on the Companys balance sheets. The Company was not able to procure a judicial order in a timely manner, specific written agreement of the creditors nor an opinion of counsel meeting the would or will standard, therefore it determined the most expeditious course of action was to restate the consolidated financial statements so that the liabilities that were written-off are now included in the liabilities of the Company once again; in effect, restating the consolidated financial statements as of June 30, 2019 and 2020. Although, in a future period, while the Company plans to either seek a judicial determination or an opinion of counsel that meets the would or will standard with respect to the liabilities, there can be no assurance that the Company will be successful in meeting the requirements necessary to write-off the aforementioned liabilities or that the Commission will agree that the judicial determination or opinion of counsel satisfies the requirements and spirit of FASB ASC 405-20-40-1(b). To meet the requirements of the Commission, the Company reinstated the debt and restated our financial statements in question in our Registration Statement on Form 10-12G filed on June 14, 2022 and became effective on August 4, 2022. As a result of these restated financial statements and the forward impact on future financial statements, our stock prices as well as our ability to secure necessary financial funding could be harmed as a result.\nWe have a limited operating history on which to base an evaluation of our business and properties.\nAny investment in the Companys securities should be considered a high-risk investment because investors will be placing funds at risk in an early-stage business with unforeseen costs, expenses, competition, a history of operating losses and other problems, to which start-up ventures are often subject. Investors should not invest in the Companys securities unless they can afford to lose their entire investment. Your investment must be considered in light of the risks, expenses, and difficulties encountered in establishing a new business in a highly competitive and mature industry. Our operating history does not provide a meaningful basis for an evaluation of our current prospects. Other than through conventional and typical exploration methods and procedures, we have no additional way to evaluate the likelihood of whether other properties contain commercial quantities of mineral or metal reserves or, if they do, if they will be operated successfully.\nManagement of growth may be necessary for us to be competitive.\nSuccessful expansion of our business will depend on our ability to effectively attract and manage staff, strategic business relationships, and shareholders. Specifically, we will need to hire skilled management and technical personnel as well as manage partnerships and joint ventures to navigate shifts in the general economic environment. Expansion has the potential to place significant strains on financial, management, and operational resources, yet failure to expand will inhibit our profitability goals.\nIf we cannot secure additional funding, we will be unable to implement our business plan.\nSince we do not generate any revenues, we may not have sufficient financial resources ourselves, to undertake all planned development activities relating to our business plan. As stated, the smelter the Company previously used is no longer accepting ore from outside sources and this has forced the Company to advance its plans to construct a mill on site so that the ore can be processed into concentrate. Without the ability to process the head ore into concentrate, the transportation of the head ore is cost prohibitive. Thus, unless the smelter we had used previously begins accepting outside ore for processing, it is imperative that the Company construct a mill to process its ore. The Company had planned on constructing a mill in the future but this development with our previous smelter has forced the Company to plan and start construction immediately in order for it to realize any revenue from the ore it mines. The Company currently does not have the financial resources to construct the mill, therefore until it is able to secure the necessary financing, its prospects for generating revenue from the Jim Crow and Billali Mines is non-existent. Nevertheless, there can be no assurances that additional financing will be available to us or that if available, that it would be on terms acceptable to us. We do not have any commitments for debt or equity financing at this time, nor do we have credit facilities available with financial institutions or other third parties, and investors may lose their all of their investment if we are unable to secure such financing in a timely manner. As the Company has no commitment for debt or equity financing, the Company will be reliant upon its own best-efforts fund-raising activities to provide sufficient working capital to fund its current and future needs, as well as on the potential cash flow from operations. There can be no assurances that the Company will be successful in its best-efforts capital raising or receive significant cash flow from operations; and the failure to generate needed working capital may result in the curtailment or cessation of its business, and losses for investors.\nOur resources may not be sufficient to manage our expected growth; failure to properly manage our potential growth would be detrimental to our business.\nEven if we obtain funding for operations, we may fail to adequately manage our anticipated future growth. Any growth in our operations will place a significant strain on our administrative, financial and operational resources, and increase demands on our management, as well as our operational and administrative systems, controls and other resources. There can be no assurances that our existing personnel, systems, procedures or controls will be adequate to support our operations in the future; or that we will be able to successfully implement appropriate measures consistent with our growth strategy. As part of this growth, we may have to implement new operational and financial systems, procedures and controls to expand, train and manage our employee base, and maintain close coordination among our staff. There can be no guarantee that we will be able to do so, or that if we are able to do so, we will be able to effectively integrate them into our existing staff and systems.\nIf we are unable to manage growth effectively, our business, operating results and financial condition could be materially adversely affected. As with all expanding businesses, the potential exists that growth will occur rapidly. If we are unable to effectively manage this growth, our business and operating results could suffer. Anticipated growth in future operations may place a significant strain on management systems and resources. In addition, the integration of new personnel will continue to result in some disruption to ongoing operations. The ability to effectively manage growth in a rapidly evolving market requires effective planning and management processes. We will need to continue to improve operational, financial and managerial controls, reporting systems and procedures, and will need to continue to expand, train and manage our work force.\nThe loss of key personnel could adversely impact the Company.\nThe nature of our business, including our ability to continue our current activities depends, in large part, on the efforts of our key personnel, the loss of any of which could have a material adverse effect on our business.\nWe may be unable to continue as a going concern.\nAs a result of our financial condition, our auditors have expressed doubt as to our ability to continue as a going concern which may have an adverse impact on our relationship with third parties with whom we do business, and could make it challenging and difficult for us to raise additional debt or equity financing, all of which could have a material adverse impact on our business, results of operations, financial condition and future prospects. The consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities and commitments in the normal course of business. Should the Company be unable to continue as a going concern, it may be unable to realize the carrying value of its assets and to meet its liabilities as they become due.\nA substantial or extended decline in gold and silver prices would have a material adverse effect on the value of our assets, on our ability to raise capital and could result in lower than estimated economic returns.\nThe value of our assets, our ability to raise capital and any future economic returns are substantially dependent on the prices of gold and silver. Gold and silver prices fluctuate daily and are affected by numerous factors beyond our control. Factors tending to influence gold prices, for example, include:\n·gold sales or leasing by governments and central banks or changes in their monetary policy, including gold inventory management and reallocation of reserves;\n·speculative short positions taken by significant investors or traders in gold;\n·the relative strength of the U.S. dollar;\n·expectations of the future rate of inflation;\n·interest rates;\n·changes to economic activity in the United States, China, India and other industrialized or developing countries;\n·geopolitical conflicts;\n·changes in industrial, jewelry or investment demand;\n·changes in supply from production, disinvestment and scrap; and\n·forward sales by producers in hedging or similar transactions.\nRisks Related to our Common Stock\nThe Companys Common Stock was Deregistered and Trading was Halted.\nIn July of 2020, the Company received notice from the SEC that it was seeking to deregister the Companys common stock pursuant to Section 12(j), based on the Companys failure to file periodic reports with the Commission and otherwise provide current information to the market. This failure was based in large part from the need to restate its financial statements and the need to find and engage a PCAOB auditor who was willing to conduct and provide the required audits amid the SEC and DOJs investigations. Although we were able to secure a qualified auditor, we were not able to make our filings quickly enough and by the time they were completed, the Commission had already sent a notice under Section 12(k). The Commission takes a hardline position in these situations such that once they have instituted deregistration proceedings, the only options available to the Company were to litigate or settle and consent to the deregistration of the Companys common stock. Historically, registrants have not been successful in litigating with the Commission over Section 12(j) matters and therefore the Company determined that the best course of action was to consent to deregistration of its common stock and then file a new registration statement on Form 10-12G. The Company has signed a settlement agreement with the SEC with respect to the registration of its common stock in response to the Commissions institution of deregistration proceedings under Section 12(j), and has re-registered the same under Section 12(g) by way of filing our Form 10-12G and the filing has been ordered effective by the SEC on August 4, 2022. Currently the Company is preparing the application to the Over-the-Counter Markets Group (the OTC) to trade on their QB tier. Upon the OTC completing their due diligence on the application their and approval of the\napplication, it will submit a Form 211 to the Financial Industry Regulatory Authority (FINRA) for their final review and acceptance of the OTC due diligence process. The Company filed a complete and current Form 10-12G and it meets the informational requirements of the SEC Rule 15c2-11. Upon the FINRA approval, they will issue our trading symbol and the Company will begin trading. Any delay or failure in securing FINRAs final approval and issuance of our trading symbol would result in our shareholders not having a public market to sell their shares. Further, it would make it more difficult for the Company to obtain the financing it requires.\nOur common stock is not currently traded, and there is no guarantee that our stock will be tradable or that if it is as to the prices at which the shares may trade.\nTrading of our common stock recently was most recently quoted by OTC Markets Group, Inc., under the ticker symbol SFEG. Since the Company was not current in its filings with the U.S. Securities and Exchange Commission (the SEC or Commission), the Company it had a skull and cross bones associated with its trading symbol (the symbol used by OTC Markets meaning Caveat Emptor or buyer beware) but trading was suspended indefinitely when the SEC approved the Companys settlement agreement which culminated in the deregistration of its common stock following the proceedings instituted by the Commission under Section 12j. In July 2020 we received notice that on June 25, 2020, the Commission had issued an order suspending trading under Section 12(k) of the Securities Exchange Act of 1934, as amended (the Exchange Act.). Thereafter, the Commission commenced administrative proceedings to de-register the Companys common stock under Section 12(j) of the Exchange Act. On December 17, 2020, the SEC order suspending trading went into effect.\nCurrently the Company is preparing the application to the OTC to trade on their QB tier. Upon the OTC completing their due diligence on the application and their approval of the application, it will submit a Form 211 to the Financial Industry Regulatory Authority (FINRA) for their final review and acceptance of the OTC due diligence process. The Company filed a complete and current Form 10-12G and it meets the informational requirements of the SEC Rule 15c-211. Upon the FINRA approval, they will issue our trading symbol and the Company will begin trading. Any delay or failure in securing FINRAs final approval and issuance of our trading symbol would result in our shareholders not having a public market to sell their shares. This in turn would negatively affect the Companys ability to secure the funding required for it to execute on its business plan, which would negatively affect its operations and could result in a complete loss to investors.\nAlthough our Form 10-12G became effective, with all comments cleared, we still face challenges in receiving FINRA approval and even if we are successful and resume trading, trading may still be limited or suffer because we are not listed on an established securities exchange.\nAlthough management is optimistic that we will receive approval to resume trading and views any delays as a short-term issue as of the date of filing of this Form 10-K, there can be no assurances that we will in fact receive timely approval to resume trading or that we will ever be successful in our efforts to resume trading. Additionally, even if we are able to resume trading through the quotations on OTC Markets, not being listed for trading on an established securities exchange has an adverse effect on the liquidity of our common stock, not only in terms of the number of shares that can be bought and sold at a given price, but also through delays in the timing of transactions, number of market makers and lack of security analysts research coverage of the Company. This may result in systemically lower prices for your common stock than might otherwise be obtained if the Company had been listed on the NYSE or NASDAQ exchanges and could also result in a larger spread between the bid and ask prices that are quoted for our common stock. Historically, our common stock has been thinly traded, and there is no guarantee of the prices at which the shares will trade, or that there will be sufficient volume to allow stockholders to sell their shares without having an adverse effect on market prices.\nBecause our common stock is currently a penny stock, it may be difficult to sell shares at times and prices that are acceptable.\nAssuming we are successful in having our stock resume trading on OTC Markets, our common stock will likely be considered a penny stock. Broker-dealers who sell penny stocks must provide purchasers of these stocks with a standardized risk disclosure document prepared by the SEC. This document provides information about penny stocks and the nature and level of risks involved in investing in the penny stock market. A broker must also give a purchaser, orally or in writing, bid and offer quotations and information regarding broker and salesperson compensation, make a written determination that the penny stock is a suitable investment for the purchaser, and obtain the purchasers written agreement to the purchase. Assuming a market maker are allowed to provide bid and offer quotations because we have been successful in securing through our OTC application process and we are able to satisfy FINRAs requirements, we will continue to be considered a penny stock. The penny stock rules may make it difficult for you to sell your shares of our common stock. Because of these rules, many brokers choose not to participate in penny stock transactions and there is less trading in penny stocks overall as a result. Accordingly, you may not always be able to resell shares of our common stock in ordinary transactions at times and prices that you feel are appropriate.\nIf we are successful, it our efforts to have our stock resume trading, the sale of it by existing stockholders may depress its price due to the limited trading market that would likely exist.\nAny sales of a significant amount of common stock by existing shareholders may depress the price otherwise causing the price of our common stock may decline.\nA small number of existing shareholders own a significant portion of our common stock, which could limit your ability to influence the outcome of any shareholder vote.\nA relatively small number of shareholders hold large concentrations of shares and under our certificate of incorporation and Delaware law, the vote of a majority of the shares outstanding is generally required to approve most shareholder actions. As a result, these individuals and entities will be able to influence the outcome of shareholder votes for the foreseeable future, including votes concerning the election of directors, amendments to our certificate of incorporation or proposed mergers or other significant corporate transactions.\nIf the Company is successful in its efforts to have its common stock resume trading, the Companys stock price and volume is likely to be highly volatile, limited and sporadic.\nThe market price of our common stock fluctuated historically and if the Company is successful in its efforts to have it resume trading is likely to continue to fluctuate in the future. These fluctuations may be exaggerated since the trading volume would likely be volatile, limited, and sporadic. These fluctuations may or may not be based upon any business or operating results. Our common stock may experience similar or even more dramatic price and volume fluctuations in the future, if our efforts are successful and its trading resumes.\nThe Company will not pay dividends on its common stock.\nWe have never paid any cash dividends on any shares of our capital stock, and we do not anticipate that we will pay any dividends in the foreseeable future. Our current business plan is to retain any future earnings to finance the expansion of our business. Any future determination to pay cash dividends will be at the discretion of our Board of Directors, and will be dependent upon our financial condition, results of operations, capital requirements and other factors as our board of directors may deem relevant at that time. If we do not pay cash dividends, our stock may be less valuable because a return on your investment will only occur if our stock price appreciates. This may never happen and investors may lose all of their investment in our company.\nIf trading in our common stock is allowed to resume, any outstanding shares that are eligible for future sale could adversely impact a public trading market for our common stock.\nWe have offered and sold and will continue to offer and sell shares without registration under the Securities Act, through exemptions available under the Securities Act. All such shares are \"restricted securities\" as defined by Rule 144 (\"Rule 144\") when issued under available exemptions from registration under the Securities Act, and cannot be resold without registration except in reliance on Rule 144 or another applicable exemption from registration. In general, under Rule 144, our non-affiliates (who have not been affiliates within the past 90 days) can sell restricted shares held for at least six months, subject only to the requirement that we make current information available publicly as required by Rule 144. However, since being deregistered, some broker-dealers may require a one year holding period out of an abundance of caution if they take the position that the Company could have been a shell at some point. Shareholders including our affiliates could sell restricted securities after they have been held for six months if broker-dealers are willing to accept that the Company has never been a shell, subject to compliance with manner of sale, volume restrictions, Form 144 filing and current public information requirements.\nNo prediction can be made as to the effect, if any, that future sales of restricted shares of common stock, or the availability of such common stock for sale, would have on the market price of the common stock prevailing from time to time, assuming the resumption of trading. Sales of substantial amounts of such common stock in the public market, or the perception that such sales may occur, could adversely affect the then prevailing market price of the common stock.\nRisk Factors Related to the COVID-19 Pandemic.\nAn occurrence of an uncontrollable event such as the COVID-19 pandemic may negatively affect our operations. A pandemic typically results in social distancing, travel bans and quarantine, and this may limit access to our facilities, customers, management, support staff and professional advisors. These factors, in turn, may not only impact our operations, financial condition and demand for our product but our overall ability to react timely to mitigate the impact of this event. Our mine manager and two employee miners contracted COVID-19 and our operations were negatively affected in the form of delays in the execution of our business plan. Although, it appears that the Company will not continue to experience issues due to COVID-19, assuming that the vaccines on the market prove successful, of which there can be no assurance. It is possible that new variants of the COVID virus may develop and that they may have the same or worse impact on our future operations and in our markets as was experienced with COVID-19.\nBecause we may issue additional shares of our common stock, investment in our company could be subject to substantial dilution.\nInvestors interests in our Company will be diluted and investors may suffer dilution in their net book value per share when we issue additional shares. We are authorized to issue 550,000,000 shares of common stock, $0.002 par value per share. As of June 30, 2022 and 2021 there were 441,308,551 and 433,018,551, shares of our common stock issued and outstanding, respectively. We anticipate that all or at least some of our future funding, if any, will be in the form of equity financing from the sale of our common stock. If we do sell more common stock, investors investment in our company will likely be diluted. Dilution is the difference between what investors pay for their stock and the net tangible book value per share immediately after the additional shares are sold by us. If dilution occurs, any investment in our Companys common stock could seriously decline in value.\nOur prior trading in our common stock on the OTC Pink Exchange has been subject to wide fluctuations.\nOur common stock was quoted for public trading on OTC Markets prior to Commission order suspending trading that went into effect on December 17, 2020. Historically, the trading price of our common stock has been subject to wide fluctuations. Assuming trading resumes, of which there can be no assurance, the trading prices of our common stock may fluctuate in response to a number of factors, many of which will be beyond our control. The stock market has generally experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of companies with limited business operations. There can be no assurance that trading prices and price earnings ratios previously experienced by our common stock will be matched or maintained. These broad market and industry factors may adversely affect the market price of our common stock, regardless of our operating performance. In the past, following periods of volatility in the market price of a companys securities, securities class-action litigation has often been instituted. Such litigation, if instituted, could result in substantial costs for us and a diversion of managements attention and resources.\nDelaware law our Certificate of Incorporation and our by-laws provide for the indemnification of our officers and directors at our expense, and correspondingly limits their liability, which may result in a major cost to us and hurt the interests of our shareholders because corporate resources may be expended for the benefit of officers and/or directors.\nOur Certificate of Incorporation and By-Laws include provisions that eliminate the personal liability of our directors for monetary damages to the fullest extent possible under the laws of the State of Delaware or other applicable law. These provisions eliminate the liability of our directors and our shareholders for monetary damages arising out of any violation of a director of his fiduciary duty of due care. Under Delaware law, however, such provisions do not eliminate the personal liability of a director for (i) breach of the director's duty of loyalty, (ii) acts or omissions not in good faith or involving intentional misconduct or knowing violation of law, (iii) payment of dividends or repurchases of stock other than from lawfully available funds, or (iv) any transaction from which the director derived an improper benefit. These provisions do not affect a director's liabilities under the federal securities laws or the recovery of damages by third parties.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules described above, the Financial Industry Regulatory Authority (known as FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common shares, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nTrading was suspended on our common stock following the deregistration of our common stock in accordance with our settlement with the SEC.\nTrading in our common stock was suspended after the SEC commenced Administrative Proceedings under 12k of the Exchange Act. The Commission then commenced proceedings under 12j of the Exchange Act to deregister our common stock because we had not posted current information by filing the required Periodic Reports on Forms 10-K and 10-Q. We had not made these filings because of the need to restate our financial statements following the misappropriation of funds by our former CEO, Thomas Laws. However, notwithstanding these mitigating circumstances, the failure to file the required reports is a matter of strict liability and has resulted in the deregistration of our common stock, which became effective on December 17, 2020 following execution of our settlement agreement with the Commission. We may not be able unable to satisfy FINRAs requirements in a timely manner or at all, market makers will not post bids or offers for our common stock.\nOn September 28, 2021, the SEC compliance date of their amended Rule 15c2-11and the amended FINRA rule 6432 went into effect. The amended Rule 15c2-11 allows a qualified IDOS (i.e., the OTC Markets) to comply with the information review requirements, to\npublish an affirmative determination that it has conducted such review, and for the broker-dealer to rely on the OTC markets determination without conducting an independent review. As long as the OTC Markets makes it known to the public that it has completed a review, a broker-dealer can quote or resume quoting the securities and be in compliance with Rule 15c2-11. The amended Rule 6432 requires that (i) a qualified inter-dealer quotation system (Qualified IDOS) (i.e. OTC Markets) submit a modified Form 211 filing to FINRA in connection with each initial information review that it conducts; (ii) a Qualified IDOS ( OTC Markets) that makes a certain publicly available determination under Rule 15c2-11 submit a daily security file to FINRA containing applicable summary information for all securities quoted on its system, and (iii) other changes to the FINRA Rule 6432 and the form 211 to further clarify the operation of the rule and conform it to the amended Rule 15c2-11.\nThe Company has registered its common stock with the SEC on Form 10-12G and the filing has been declared effective by the SEC on August 4, 2022, resulting in the Company becoming an Exchange Act reporting company at that time. The information contained in its Form 10-12G filing was complete and current information, and as a result, the effective filing contains the current information that meets the requirements of Rule 15c2-11.\nUntil we are able to have our Form 211 approved by FINRA and a trading symbol issued by FINRA, of which there can be no assurance, it may be difficult for the Company to secure the financing it requires to implement its current business plan.\nThe filing of our Registration Statement on Form 10-12G should allow us to receive FINRA approval more quickly than we would have if we had not been an Exchange Act reporting company, there is no way to determine the length of time it may take to receive final approval or if we will receive approval at all. Any delays in our ability to secure approval for the filing of our Form 211 t by FINRA and by the OTC will delay market makers from posting bids and offers for our common stock and this in turn, may make it more difficult for the Company to find investors and the capital required for it to implement its business plan. The lack of an active market or even posted bids and offers severely limits our shareholders and prospective shareholders from availing themselves of an exit in the event that they need or want to sell their shares. As a result, many prospective investors may be reluctant to invest in our common stock unless we are able to have market makers resume posting bids and offers. Until the listing is complete, with FINRAs approval, the Company may have difficulty in finding investors that are willing to purchase shares. Even if investors are willing to purchase shares, they may not be willing to purchase unless shares are offered at substantially lower prices. Any of the forgoing impediments to our ability to sell shares at what we believe are reasonable prices or at all, would have a negative impact on the Company and its operations. ITEM 1B. UNRESOLVED STAFF COMMENTS\nThere are no unresolved SEC Staff comments. ITEM 2. PROPERTIES\nMining Claims\nPatented Mining Claims\nWe hold seven (7) patented claims related to the Jim Crow Imperial Mine and the one (1) for the Billali Mine, all of which are held by our wholly owned subsidiary, Minerals Acquisitions, LLC, together with thirteen (13) for the Alhambra Mine held by our wholly owned subsidiary, Bullards Peak Corporation. Patented mining claims, such as the ones located in our Jim Crow Imperial Mine, our Billali Mine and our Alhambra Mine, are mining claims on federal lands that are held in fee simple by the owner. No maintenance fees or royalties are payable to the BLM; however, payments and royalties with third parties are applicable on some of these claims.\nUnpatented Mining Claims: The Mining Law of 1872\nThus, our mining rights consist of agreements covering patented and \"unpatented\" mining claims created and maintained in accordance with the U.S. General Mining Law of 1872, or the General Mining Law. Unpatented mining claims are unique U.S. property interests and are generally considered to be subject to greater title risk than other real property interests because the validity of unpatented mining claims is often uncertain. The validity of an unpatented mining claim, in terms of both its location and its maintenance, is dependent on strict compliance with a complex body of federal and state statutory and decisional law that supplement the General Mining Law. Also, unpatented mining claims and related rights, including rights to use the surface, are subject to possible challenges by third parties or contests by the federal government. In addition, there are few public records that definitively control the issues of validity and ownership of unpatented mining claims. We have not filed a patent application for any of our unpatented mining claims that are located on federal public lands in the United States and, under possible future legislation to change the General Mining Law, patents may be difficult to obtain.\nOur exploration, development and mining rights relate to patented and unpatented mining claims covering federal and State lands in the State of New Mexico. Location of mining claims under the General Mining Law, is a self-initiation system under which a person physically stakes an unpatented mining claim on public land that is open to location, posts a location notice and monuments the\nboundaries of the claim in compliance with federal laws and regulations and with state location laws, and files notice of that location in the county records and with the Bureau of Land Management (BLM). Mining claims can be located on land as to which the surface was patented into private ownership under the Stock Raising Homestead Act of 1916, 43 U.S.C. §299, but the mining claimant cannot injure, damage or destroy the surface owner's permanent improvements and must pay for damage to crops caused by prospecting. Discovery of a valuable mineral deposit, as defined under federal law, is essential to the validity of an unpatented mining claim and is required on each mining claim individually. The location is made as a lode claim for mineral deposits found as veins or rock in place, or as a placer claim for other deposits. While the maximum size and shape of lode claims and placer claims are established by statute, there are no limits on the number of claims one person may locate or own. The General Mining Law also contains a provision for acquiring five-acre claims of non-mineral land for mill site purposes. A mining operation typically is comprised of many mining claims.\nThe holder of a valid unpatented mining claim has possessory title to the land covered thereby, which gives the claimant exclusive possession of the surface for mining purposes and the right to mine and remove minerals from the claim. Legal title to land encompassed by an unpatented mining claim remains in the United States, and the government can contest the validity of a mining claim. The General Mining Law requires the performance of annual assessment work for each claim, and subsequent to enactment of the Federal Land Policy and Management Act of 1976, 43 U.S.C. §1201 et seq., mining claims are invalidated if evidence of assessment work is not timely filed with the BLM. However, in 1993 Congress enacted a provision requiring payment of a small claim maintenance fee in lieu of performing assessment work, subject to an exception for small miners having less than 10 claims. No royalty is paid to the United States with respect to minerals mined and sold from a mining claim. The General Mining Law provides a procedure for a qualified claimant to obtain a mineral patent (i.e., fee simple title to the mining claim) under certain conditions. It has become much more difficult in recent years to obtain a patent. Beginning in 1994, Congress imposed a funding moratorium on the processing of mineral patent applications which had not reached a designated stage in the patent process at the time the moratorium went into effect. Additionally, Congress has considered several bills in recent years to repeal the General Mining Law or to amend it to provide for the payment of royalties to the United States and to eliminate or substantially limit the patent provisions of the law. Any such changes to the law and increases to our costs would have a negative impact on our results of operations.\nMining claims are conveyed by deed or leased by the claimant to the party seeking to develop the property. Such a deed or lease (or memorandum of it needs to be recorded in the real property records of the county where the property is located, and evidence of such transfer needs to be filed with the BLM in order to secure title to such claims. It is not unusual for the grantor or lessor to reserve a royalty, which as to precious metals often is expressed as a percentage of net smelter returns.\n[The Remainder of this Page is Intentionally Left Blank]\nMining Properties General Locations\nSteeple Rock District, Grant County New Mexico - Project Description\nProperties - The Jim Crow, Imperial and Billali Mines\nSanta Fes properties consist of the Jim Crow group of patented and unpatented claims in the southern part of the district and the Billali patented claim in the northern part of the district. The Jim Crow group is made up of seven patented mining claims and the Billali consists of one (1) patented mining claim.\nPatented Lode Claims\nName\nMS No.\nImperial Lode\nMS 1012 A\nJim Crow Lode\nMS 1012 B\nGold King Lode\nMS 1012 C\nPortal Lode\nMS 1012 D\nGold Bug Lode\nMS 1012 E\nRed Prince Lode\nMS 1012 F\nThree Brothers Lode\nMS 1012 G\nContention Lode\nMS 1012 H\nThe Jim Crow group also consists of two unpatented mining claims and Mineral Acquisitions, LLC controls nine unpatented mining claims.\nUnpatented Lode Claims\nName\nBLM Serial Number\nPapoose No 1 Lode\nLeslie Billingsley - claimant\nPapoose No 2 Lode\nLeslie Billingsley - claimant\nTelephone Ridge No 1\nNMMC193685\nTelephone Ridge No 2\nNMMC193686\nTelephone Ridge No 3\nNMMC193687\nTelephone Ridge No 4\nNMMC196049\nTelephone Ridge No 5\nNMMC196050\nTelephone Ridge No 6\nNMMC196051\nTelephone Ridge No 7\nNMMC196052\nTelephone Ridge No 8\nNMMC196053\nTelephone Ridge No 9\nNMMC196054\nAll the combined mining claims for this project encompass approximately 343 acres.\nLocation and Access\nThe Steeple Rock mining district is in the western part of Grant County, New Mexico. The district lies approximately 45 miles east of the town of Safford, Arizona and approximately 10 miles northeast of Duncan, Arizona. The district is reached by well-maintained county roads from Duncan.\nDistrict, Historical and Prior Operations\nThe Steeple Rock district was discovered in the 1860s and was in production until the so-called silver panic of 1893. Since 1893, there has been little activity. We believe that the Steeple Rock district was reopened at different times in the 1950s, 1960s and the 1970s, but no sustained development or production is believed to have occurred. There has been some trenching and surface Geochem work done at various times. During the time of elevated precious metal prices after 1980 there was considerable activity, including a project at the Imperial-Jim Crow Mine by Queenstake Resources in the early 1980s and work by ASARCO also in the 1980s. The Billali was explored by Biron Bay Resources in 1990-1993 and again in 2013-2014 by Shooting Star Mining Co. In 2010 the Summit mine was successfully developed and operated but closed in 2013.\nTitle and Ownership of the Billali, Jim Crow and Imperial Mine Projects\nThe Company determined the Agreement with the sellers of the properties is Right of Use (ROU) asset lease at its inception and provides for grant of use. The Company has the right to cancel the Agreement at any time. The Company currently considers the properties to be exploration properties. The Agreement gives the Company surface, mining, and access rights. These are subject only to any limitations imposed by federal, state and local regulations, the free, unrestricted and uninterrupted right of access, for ingress and egress to the Billali, Jim Crow and Imperial Mines over existing roads or alternate routes approved by Seller and the right to enter upon and occupy the Billali, Jim Crow and Imperial Mines for all purposes reasonably incident to: exploring for, developing, mining (by underground mining, surface mining, strip mining or any other surface or subsurface method, including any method later developed), extracting, milling, smelting, refining, stockpiling, storing, processing, removing and marketing there from, all ores, metals, minerals, mineral products (including intermediate products) and materials of every nature or sort, and the right to place, construct, maintain, use and thereafter remove such structures, facilities, equipment, roadways, haulage ways, utility lines, reservoirs and water courses, and other improvements as may be necessary, useful or convenient for the full enjoyment of all of the rights granted, are the rights granted by the seller under our agreement. We have sole and exclusive custody, possession, ownership and control of all ore, rock, drill core and other mineral substances extracted or removed from the Billali, and Jim Crow and Imperial Mines and may sell or otherwise dispose any of the forgoing. We have also been granted the right to use any of the sellers water rights, which were assigned to the Company, on, about, under or appurtenant to the Billali and Jim Crow Mines to facilitate the exploration, mining and processing rights we were granted under our agreement with the seller. Until the total price under the agreement is paid in full, title on all of the properties and all unpatented property will remain in the name of the seller.\nMineralization and Geology\nThe Steeple Rock district is classified as a high level, epithermal gold and silver bearing, quartz vein system hosted principally in andesite lava flow rock which comprises the lower part of the tertiary volcanic section in the region. Other rocks exposed within the district are Precambrian igneous and metamorphic rocks, Paleozoic sedimentary rocks, and Mesozoic igneous and sedimentary rocks. The veins trend northwesterly and northerly. Most of the historic production has been from the northwest trending set of veins. Veins within the district are numerous and only a few of them have undergone systematic development to date. The ore in the Steeple Rock district appears to be controlled by rock lithology, with the host rock being a coarse-grained quartz diorite. Vein boundaries are sharp and the vein filings are generally recognizable visually. Mineralization in the Steeple Rock mining district consists of numerous narrow carbonate veins containing varying amounts of cobalt and nickel, silver, uranium, and arsenic. This is a geologic type of mineral deposit generally referred to as five element veins.\nDescription of the Jim Crow and Imperial Mines\nThe Jim Crow group covers approximately 4,000 feet strike length on the north trending Imperial vein and approximately 2,600 feet strike length of the northwest trending Jim Crow vein system. The Imperial mine occupies the southernmost 1,000 feet of the Imperial vein at which point the Jim Crow system branches to the northwest. The north trending Imperial continues another 3,050 to the property end line. The Jim Crow trend consists of three, possibly more, sub-parallel veins converging in the northwest.\nThe Jim Crow mine is well equipped and in good working order. It is served by a 320-foot-deep inclined shaft with a well-designed steel headframe. The hoist is equipped with up-to-date safety devices. The shaft is capable of lifting 30 tons per hour and can handle both ore and waste at the same time. The mine has three levels, 50 feet, 200 feet and 300 feet, all with air, water and ventilation services installed. Broken muck is moved to the shaft by scrapers on the 50- and 200-foot levels and by a 2-foot gauge rail on the 300-foot level.\nThe location of the Jim Crow mine is highly advantageous in that the unexplored and undeveloped segments of the Imperial and Jim Crow veins can be easily accessed from the mine. The lower 300-foot level can be extended to the south to explore and develop the Imperial vein below it and the lowermost 200-foot level in the area intercepted by the encouraging drill holes. It can also be extended to the northwest to explore the northwest extension of the Jim Crow vein and its parallel wall veins and the area where these veins intersect. The unexplored north trending segment of the Imperial vein could also be readily accessed from the Jim Crow Mine.\nDescription of the Billali Mine\nThe Billali property consists of one patented mining claim. It covers 1,200 feet of vein length and is situated approximately 3,000 feet northwest of the Summit mine.\nThe principal working on the Billali is a 12 x12 decline driven at grade of -20% for approximately 1120 feet. The decline was started on the northeast flank of the vein zone, driven across it for approximately 260 feet and then turned southeast and continued straight along the zone for another, approximately 580 feet. The present water level is at approximately 800 feet. From that point it extends in an irregular manner for another 650 feet to its present head which is approximately 260 feet vertically below the portal. A lateral level was driven 300 feet northeast across the vein zone from the bottom of the decline. The first 856 feet of the decline is set up for rail haulage using a winch stationed on the surface.\nThe Billali Mine occupies the northwest extension of the Summit vein. In the 1990-1992 time period Byron Bay Resources, a Canadian mining company, conducted an extensive exploration program on the Summit vein including the Billali mine. Data in the mine owners archives are poorly documented and drill hole collars are not definitely located. Diamond drilling was done on the Billali claim in 1990, 1991 and 1992. Partial data is available for twenty of these drill holes. Byron Bay Resources company reports dated 1990 and 1991 describe a vein zone approximately 350 feet wide with a discontinuously mineralized footwall and hanging wall quartz veins, ranging from 3 to 15 feet true width.\nIn 2013 and 2014 Shooting Star Mining Co. optioned the property and continued development. Their intention was to expand on the previous work of Biron Bay Resources and to in fill the drill intercepts of that 1990-90 project. They drove the decline to explore the drill intercepts of Biron Bay. The company completed 21 underground diamond drill holes. The Shooting Star drilling failed to establish horizontal continuity for the earlier drilling but did establish that high grade mineralization over economically viable widths was present. They concluded that the prospect would not support a conventional mine-mill operation.\nThe work by these two companies has demonstrated that, although the vein is not consistently mineralized enough to support a large-scale operation, there are numerous lenses and pockets of high-grade rock that could be profitably extracted by careful development and mining and the Company will be engaging a specialist in connection with the construction of its mill in order to maximize the yield.\nExploration Status\nExploration and development work done in the 1990s and in the 2011-14 time period suggest there are potentially high-grade zones with indications of vertical continuity distributed throughout the length of the property. These can be in any of the three or more veins that are presently identified within the approximately 350-foot-wide structural zone that makes up Billali vein zone.\nSanta Fe is currently mining one of these gold-silver bearing pipe-like bodies that has recently been discovered approximately 180 feet from the portal. Certain long hole drilling in the overlying Hoover Tunnel some 70 feet above suggests that this zone is continuous for at least that far, although we have not conducted any exploration in this area to date. The mined high silica vein rock is being stockpiled and will be tested by the specialists we intend to engage for our mill design. Initially we had planned to send a trial shipment to a nearby smelter pending the aggregation of 500 tons and assuming it was accepted and we were able to execute an acceptable contract with the smelter. Since that smelter is no longer accepting outside ore and it currently is not cost effective to send our ore to another smelter for initial processing, we have determined that we will need to construct a mill to process our ore into concentrate in order for shipping to become cost effective. Whether we are able to sell to our smelter as initially planned or we construct a mill, the Company intends to mine on three levels approximately 100 vertical feet apart. These levels will crosscut the entire vein zone and the veins will be developed by a series of lateral workings from these crosscuts.\nWe have not established that our Billali Mine and Jim Crow Mine rights contain proven or probable reserves, as defined under Reg. S-K 1300. The Company has conducted a limited amount of exploration work on the Jim Crow mine to date. The Company commenced work at the Jim Crow mine in late 2019. Work to date has consisted of upgrading the surface facilities, rehabilitating the shaft, expanding the hoisting capability and underground excavation on three levels and a crushing plant site was purchased on January 1, 2020, in Duncan, Arizona. We have extracted approximately 2,000 tons of ore that is sitting on our property awaiting further processing and analysis.\nThe Company will need to conduct further work on the mine properties for sustained production. Such work will consist of exploration drilling from the surface and underground. The Company will continue to be considered an exploration stage property until it has disclosed reserves and once it has disclosed reserves it will be considered a development stage. Further work to be done includes drifting, raising and slope development, as well as further improvement of the surface facilities.\nPower and Water\nThe Company will be required to use water from the mine, to be stored in a water tank to be placed on the property, for its water source. It is believed that this water will be sufficient for any development purposes. The Company will be required to place a generator on the property for electricity.\nDevelopment Plans\nSanta Fe Gold believes that a profitable operation can be established and sustained in the Steeple Rock district by careful development and mining the high silica, gold and silver bearing vein rock thought to be present in both the Jim Crow and Billali mines, although we have not conducted any analytical work to demonstrate this. The district has a long record of producing high quality smelter flux ores that were previously directly shipped to a nearby copper smelter. Both the Jim Crow and Billali mines have well developed infrastructure with services in place. Both can be commissioned with relatively little development cost and continued maintenance. We have extracted ore from the Jim Crow mine recently and have been upgrading the Billali mine with the enhancements to make it ready for development and if successful, production. With the prior COVID-19 situation and other unstated factors, the copper smelter the Company previously utilized is not accepting any outside material from any source. Coupled with some of our mine personnel contacting the COVID-19 virus, we ceased extracting ore until we can develop our alternative business plan and finance its implementation.\nWith that current situation, we were required to advance our business plan by approximately a year referencing the design and construction of a mine-mill complex in Duncan, Arizona. This site will service both the Companys property sites in the Steeple Rock mining district and the Black Hawk mining district. The Company will need to raise or finance the construction of the mill complex. The Companys future revenue is contingent on the construction of a mill complex. The mill complex will require us to raise financing in order for it to be constructed and ramp-up operations at the mill complex and for mining operations. The Companys plan for operations is reliant on our ability to secure the financing required to construct and operate the mill-complex and continue mining operations. No assurances can be made that the Company will be successful in securing this needed financing or that if it is able to, that it will be on terms acceptable to the Company.\nThe Company currently has its crushing equipment on this site and retained a specialist firm in Colorado which has completed the analysis our ore and prepared a process and mill site plan with the optimal equipment, methods, chemical reagents that will allow us to realize the maximum yield from our ore. We received the report in late September 2021. This is the first step needed for the construction of our mill and we have the detailed plan of what will be required. The Company anticipates that the total cost to construct the mill site will approximate around $1,200,000. We will need to secure these funds in order to begin construction and to purchase the equipment and materials necessary and to have the mill operational, of which there can be no assurance.\nAs of filing this Form 10-K, the Company is currently in process of acquiring a mill operation for its head ore to be located on its property in Duncan, Arizona. The seller of the mill has disassembled the mill in Kellogg, Idaho and relocated the mill to the Duncan, Arizona site. Currently all associated costs of the mill and its relocation are being accumulated and finalized by the seller. At this time there are no agreements between the seller and the Company as to terms and sales price of the delivered disassembled mill and such price is anticipated to be negotiated and determined in late fall 2022, when the necessary funding will be raised by the Company for the acquisition of the mill equipment and its construction. At the time of filing this Form 10-K, negotiations for the purchase of the disassembled mill with the seller have not taken place and will be finalized upon the Company raising the adequate funding for the acquisition and determination if the seller or the Company will be responsible for its construction at the mill site.\nDescription of Black Hawk Project\nProperty Location and Access\nThe Black Hawk district, also called the Bullards Peak district in some references, is located approximately 15 miles west-southwest of Silver City New Mexico. Santa Fe Gold Corp. owns 13 patented and 82 unpatented mining claims covering approximately 72% of the known extent of the district. This property includes four of the five mines with recorded production among which are the two largest, the Black Hawk and the Alhambra. The property is reached by truck on a private dirt road that turns left off a paved highway, which access road is approximately 15 miles west-southwest of Silver City. The claims are all located within approximately 1,900 acres.\nProperty Description\nThe Black Hawk district, sometimes referred to as the Bullard Peak district, is located in Grant County, New Mexico, approximately 15 miles by road west of Silver City, New Mexico, the terminus of a branch line of the Atchison, Topeka and Santa Fe Railway. The district is in the northeastern foothills of the Big Burro Mountains at an altitude of approximately 5,450 to 6,150 feet. Scattered junipers, scrub oak, small pines, and brush cover the hillsides. Most of the district is drained by way of Black Hawk Canyon which bisects the area and flows northward to Mangas Creek, but the eastern part is drained by tributaries of Silver Dale Creek, which flows northeastward to Mangas Creek. Mangas Creek flows into the Gila River about 9 miles northwest of the mouth of Black Hawk Canyon. The ore in the Black Hawk district appears to be controlled by rock lithology, with the host rock being a coarse-grained quartz diorite. Vein boundaries are sharp and the vein filings are generally recognizable visually. Mineral property claims are as follows:\nPatented Lode Claims\nName\nMS No.\nAlhambra Lode\nMS 869\nKent County Lode\nMS 778\nBlackhawk Lode\nMS 364A\nButternut Lode\nMS 546\nLittle Rody Lode\nMS 365A\nExtension Lode\nMS 772\nPumpkin Lode\nMS 548\nSilver Glance Lode\nMS 366A\nGood Hope Lode\nMS 480\nChicago Lode\nMS 771\nSurprise Lode\nMS 367A\nCornicopia Lode\nMS 770\nStonewall Lode\nMS 547\nUnpatented Lode Claims\nName\nBLM Serial Number\nAlhambra Extension - Lode\nNMMC 50356\nEasy Days - Lode\nNMMC 50357\nOld Hobson - Lode\nNMMC 50358\nArgentine No. 5 - Lode\nNMMC 85992\nArgentine No. 6 - Lode\nNMMC 85993\nArgentine No. 7 - Lode\nNMMC 85994\nArgentine No. 8 - Lode\nNMMC 85995\nArgentine No. 9 - Lode\nNMMC 85996\nArgentine No. 17 - Lode\nNMMC 86004\nArgentite #1 - Lode\nNMMC 64721\nArgentite #2 - Lode\nNMMC 64722\nArgentite #3 - Lode\nNMMC 64723\nArgentite #4 - Lode\nNMMC 64724\nArgentite #10 - Lode\nNMMC 64725\nArgentite #11 - Lode\nNMMC 64726\nArgentite #12 - Lode\nNMMC 64727\nArgentite #13 - Lode\nNMMC 64728\nArgentite #14 - Lode\nNMMC 64729\nArgentite #15 - Lode\nNMMC 64730\nArgentite #16 - Lode\nNMMC 64731\nArgentite #18 - Lode\nNMMC 64732\nArgentite #19 - Lode\nNMMC 64733\nArgentite #20 - Lode\nNMMC 64734\nArgentite #21 - Lode\nNMMC 64735\nArgentite #22 - Lode\nNMMC 64736\nContention #1 - Lode\nNMMC 64719\nContention #2 - Lode\nNMMC 64720\nNo Show #1 - Lode\nNMMC 106382\nNo Show #2 - Lode\nNMMC 106383\nNo Show #3 - Lode\nNMMC 106384\nNo Show #4 - Lode\nNMMC 106385\nNo Show #5 - Lode\nNMMC 106386\nNo Show #6 - Lode\nNMMC 106387\nNo Show #7 - Lode\nNMMC 106388\nNo Show #8 - Lode\nNMMC 106389\nNo Show #9 - Lode\nNMMC 106390\nNo Show #10 - Lode\nNMMC 106391\nNo Show #11- Lode\nNMMC 106392\nNo Show #12 - Lode\nNMMC 106393\nNo Show #13 - Lode\nNMMC 106394\nNo Show #14 - Lode\nNMMC 106395\nNo Show #15 - Lode\nNMMC 106396\nNo Show #16 - Lode\nNMMC 106397\nNo Show #17 - Lode\nNMMC 106398\nNo Show #18 - Lode\nNMMC 106399\nNo Show #19 - Lode\nNMMC 106400\nNo Show #20 - Lode\nNMMC 106401\nRhonda #1 - Lode\nNMMC 106402\nRhonda #2 - Lode\nNMMC 106403\nRhonda #3 - Lode\nNMMC 106404\nRhonda #4 - Lode\nNMMC 106405\nRhonda #5 - Lode\nNMMC 106406\nRhonda #6 - Lode\nNMMC 106407\nRhonda #7 - Lode\nNMMC 106408\nRhonda #8 - Lode\nNMMC 106409\nRhonda #9 - Lode\nNMMC 106410\nRhonda #10 - Lode\nNMMC 106411\nRhonda #11 - Lode\nNMMC 106412\nRhonda #12 - Lode\nNMMC 106413\nRhonda #13 - Lode\nNMMC 106414\nRhonda #14 - Lode\nNMMC 106415\nRhonda #15 - Lode\nNMMC 106416\nRhonda #16 - Lode\nNMMC 106417\nRhonda #17 - Lode\nNMMC 106418\nRhonda #18 - Lode\nNMMC 106419\nPec-II #1 - Lode\nNMMC 106420\nBarite - Lode\nNMMC 109082\nBarite No. 2 - Lode\nNMMC 109083\nBarite No. 3 - Lode\nNMMC 109084\nJody #1 - Lode\nNMMC 115276\nJody #2 - Lode\nNMMC 115277\nJody #3 - Lode\nNMMC 115278\nJody #4 - Lode\nNMMC 115279\nJody #5 - Lode\nNMMC 115280\nJody #7 - Lode\nNMMC 115281\nJody #8 - Lode\nNMMC 115282\nJody #9 - Lode\nNMMC 115283\nJody #10 - Lode\nNMMC 115284\nStonewall Surprise - Lode\nNMMC 193678\nAlhambra Extension 2 - Lode\nNMMC 193679\nNo Show No. 21 - Lode\nNMMC 193680\nNo Show No. 23 - Lode\nNMMC 193681\nHistory and Prior Operations\nThe Black Hawk district was discovered in 1881 and was in production until the so called silver panic of 1893. Since its main productive period, ending in its closure in late 1893 or early 1894, there has been little activity in the Black Hawk district. One of the mines, the Black Hawk was reopened in 1917 and some development done in the upper levels. Both the Black Hawk and the Alhambra were reopened at different times in the 1950s, 1960s, and the 1970s but no sustained development or production was achieved. There has been some trenching and surface Geochem work done at various times.\nProject Status and Exploration Activities\nWe have not established that our Black Hawk and Bullard Peak rights contain proven or probable reserves, as defined under Reg S-K 1300. No exploration activities have commenced to date and no exploration costs have been incurred or paid. To date, the Company\nhas not (i) commenced or adopted plans to conduct any exploration, (ii) prepared drilling plans, proposals, timetables or budgets for exploration work, or (iii) identified engineers and other personnel that will conduct or assist in any exploration work. The Company will need to raise funds to conduct exploration work and it currently lacks firm commitment financing for any exploration activities.\nThe Company will need to prepare the property for exploration and drilling activities, including building infrastructure, installing facilities, and purchasing equipment. Future exploration drilling on any of our properties that consist of BLM land will require us to either file a Notice of Intent (NOI) or a Plan of Operations with the BLM, depending upon the amount of new surface disturbance that is planned. A Notice of Intent is required for planned surface activities that anticipate less than 5.0 acres of surface disturbance, and usually can be obtained within a 30 to 60-day time period. The Company currently lacks sufficient capital to fund these expenditures and is currently allocating working capital to the Jim Crow and Billali project.\nOn December 1, 2020, the Company made a joint announcement with Texas Mineral Resources Corp. (TMRC), of the execution of a letter agreement to pursue, negotiate and thereafter enter into a definitive joint venture agreement with TMRC to jointly explore and develop a targeted silver property to be selected by TMRC among patented and unpatented mining claims held by Santa Fe Gold within the Black Hawk Mining District in Grant County, New Mexico. Completion of a joint venture agreement is subject to the successful outcome of a multi-phase exploration plan to be undertaken in the near future by TMRC. Under terms of the letter agreement TMRC plans to conduct a district-wide evaluation among the patented and unpatented claims held by Santa Fe Gold consisting of geologic mapping, sampling, trenching, radiometric surveying, geophysics, drilling and/or other methods as warranted. The purpose of the letter agreement was to allow TMRC the ability to enter onto the Companys property, begin incurring the costs associated with the work necessary to secure a bankable feasible study. The parties may then secure the funding needed to develop and mine the 80 acres that TMRC identifies. TMRC will be responsible for mining operations and will receive 51% of the profits as defined in the definitive agreement, when executed. The Company will receive 49% of the profits.\nOn July 28, 2022, TMRC issued a press release that updated the successful completion of their geophysical work in the Blackhawk mining district in New Mexico. The related project details that were provided to TMRC by the advanced technology deployed were cost effective and will assist TMRC in developing their next phase in their exploration program on project site.\nMineralization and Geology\nMineralization in the Black Hawk mining district consists of numerous narrow carbonate veins containing varying amounts of cobalt, nickel, silver, uranium, and arsenic. It is one of a well-known, but poorly understood, geologic type of mineral deposit generally called five element veins. They are also rich in uranium, nickel and, of interest today, cobalt. In the Black Hawk district, the host is a coarse-grained quartz diorite. Mining conditions within the veins are good. The lack of strong alteration results in stable walls requiring minimum support, only occasional faults or gouge zones require timber. Vein boundaries are sharp and the vein fillings are easily recognizable visually.\nThe Silver City quadrangle covers approximately 20,650 square kilometers chiefly in the southern basin and range province of Southwestern New Mexico and Southeastern Arizona. Bedrock of the ranges includes Precambrian igneous and metamorphic rocks, Paleozoic sedimentary rocks, Mesozoic igneous and sedimentary rocks, and Cenozoic igneous rocks. The intervening basins, which constitute about 65% of the quadrangles surface area, are filled with Late Cenozoic (Pliocene-Pleistocene) sedimentary deposits in places to depths of more than 1,000 meters. The geology of each range is generally different, and most rock units and pre-basin and range structures cannot be correlated across the basin areas. The principal hydrothermal ore-forming processes in the quadrangle are believed to be attributable to subduction-related events including complex eruptive systems during two distinct periods in the development of the western orogenic continental margin: (i) a medium-potassium calcium/alkaline volcanic arc system in late Cretaceous/early Tertiary time (the Laramide orogeny 80/50 million years ago); and (ii) a high-potassium calcium/alkaline volcano-plutonic arc system in middle Tertiary time (30/15 million years ago). The hydrothermal-magmatic vein and pegmatite type deposits are probably Precambrian in age and the syngenetic sedimentary and volcanic deposits range in age from Cambrian to late Tertiary (or younger).\nAlthough there is some local variation in some of the districts, the five metal types of deposits in the Black Hawk district are fissure veins where the carbonate and the ore minerals fill open space caused by the fracturing. The ore generally occurs in small high-grade pods or shoots randomly distributed within the fracture zone. The location of these open spaces is the sole recognized control of ore distribution. The favorability of the host seems to be governed by its fracturing characteristics rather than any chemical factor. Generally, in these deposits there is one favored rock type that accounts for most of the production. At the Black Hawk district, the preferred host rock is the coarse-grained quartz diorite.\nThe project requires further evaluation of its mineralogical makeup and economic modeling to determine the appropriate course for any potential future development and production. The Company has not conducted a preliminary feasibility study for the project at the time of filing this Registration Statement. Upon completion of the preliminary feasibility study for the project, the Company will prepare an impairment analysis of the project to determine if an impairment is required at that time.\nPower and Water\nThe Company will be required to use water from the mine. Water will be pumped from a mine using one or more electric pumps powered by one or more on-site generators placed on site. Water will be stored in an on-site water tank placed on site for use in processing. We believe that the water we collect from will be sufficient for exploration, development and production purposes. The Company will be required to place a generator(s) on the property for electricity required to run the water pumps and for other operational purposes.\nREGULATION S-K 1300 DEFINITIONS\nThe following definitions are taken from Regulation S-K 1300 which goes into effect in the First Fiscal Quarter of Operations for the Companys Fiscal year 2022. Previously the Company made disclosures in compliance with Industry Guide 7 for the mining industry entitled Description of Property by Issuers Engaged or to be Engaged in Significant Mining Operations contained in the Securities Act Industry Guides published by the United States Securities and Exchange Commission, as amended. There are a number of definitional changes. The following terms have the definitions set opposite them under Regulation S-K 1300:\nExploration Stage Property\nThe term exploration stage property is a property that has no mineral reserves disclosed.\nDevelopment Stage Property\nThe term development stage property is a property that has mineral reserves disclosed, pursuant to …[the definition in Reg S-K 1300], but no material extraction.\nInferred Mineral Resource\nThe term inferred mineral resource is that part of a mineral resource for which quantity and grade or quality are estimated on the basis of limited geological evidence and sampling. The level of geological uncertainty associated with an inferred mineral resource is too high to apply relevant technical and economic factors likely to influence the prospects of economic extraction in a manner useful for evaluation of economic viability. Because an inferred mineral resource has the lowest level of geological confidence of all mineral resources, which prevents the application of the modifying factors in a manner useful for evaluation of economic viability, an inferred mineral resource may not be considered when assessing the economic viability of a mining project, and may not be converted to a mineral reserve.\nMineral Reserves\nThe term mineral reserve is an estimate of tonnage and grade or quality of indicated and measured mineral resources that, in the opinion of the qualified person, can be the basis of an economically viable project. More specifically, it is the economically mineable part of a measured or indicated mineral resource, which includes diluting materials and allowances for losses that may occur when the material is mined or extracted\nMineral Resource\nThe term mineral resource is a concentration or occurrence of material of economic interest in or on the Earth's crust in such form, grade or quality, and quantity that there are reasonable prospects for economic extraction. A mineral resource is a reasonable estimate of mineralization, taking into account relevant factors such as cut-off grade, likely mining dimensions, location or continuity, that, with the assumed and justifiable technical and economic conditions, is likely to, in whole or in part, become economically extractable. It is not merely an inventory of all mineralization drilled or sampled.\nProbable Mineral Reserve\nThe term probable mineral reserve is the economically mineable part of an indicated and, in some cases, a measured mineral resource.\nProduction Stage Property\nThe term production stage property is a property with material extraction of mineral reserves.\nProven Mineral Reserve\nThe term proven mineral reserve is the economically mineable part of a measured mineral resource and can only result from conversion of a measured mineral resource.\nQualified Person\nThe term qualified person is an individual who is:\n(1) A mineral industry professional with at least five years of relevant experience in the type of mineralization and type of deposit under consideration and in the specific type of activity that person is undertaking on behalf of the registrant; and\n(2) An eligible member or licensee in good standing of a recognized professional organization at the time the technical report is prepared. For an organization to be a recognized professional organization, it must:\n(i) Be either:\n(A) An organization recognized within the mining industry as a reputable professional association; or\n(B) A board authorized by U.S. federal, state or foreign statute to regulate professionals in the mining, geoscience or related field;\n(ii) Admit eligible members primarily on the basis of their academic qualifications and experience;\n(iii) Establish and require compliance with professional standards of competence and ethics;\n(iv) Require or encourage continuing professional development;\n(v) Have and apply disciplinary powers, including the power to suspend or expel a member regardless of where the member practices or resides; and\n(vi) Provide a public list of members in good standing.\nRelevant experience means, for purposes of determining whether a party is a qualified person, that the party has experience in the specific type of activity that the person is undertaking on behalf of the registrant. If the qualified person is preparing or supervising the preparation of a technical report concerning exploration results, the relevant experience must be in exploration. If the qualified person is estimating, or supervising the estimation of mineral resources, the relevant experience must be in the estimation, assessment and evaluation of mineral resources and associated technical and economic factors likely to influence the prospect of economic extraction. If the qualified person is estimating, or supervising the estimation of mineral reserves, the relevant experience must be in engineering and other disciplines required for the estimation, assessment, evaluation and economic extraction of mineral reserves.\n(1) Relevant experience also means, for purposes of determining whether a party is a qualified person, that the party has experience evaluating the specific type of mineral deposit under consideration (e.g., coal, metal, base metal, industrial mineral, or mineral brine). The type of experience necessary to qualify as relevant is a facts and circumstances determination. For example, experience in a high-nugget, vein-type mineralization such as tin or tungsten would likely be relevant experience for estimating mineral resources for vein-gold mineralization, whereas experience in a low grade disseminated gold deposit likely would not be relevant.\nNote 1 to paragraph (1) of the definition of relevant experience: It is not always necessary for a person to have five years' experience in each and every type of deposit in order to be an eligible qualified person if that person has relevant experience in similar deposit types. For example, a person with 20 years' experience in estimating mineral resources for a variety of metalliferous hard-rock deposit types may not require as much as five years of specific experience in porphyry-copper deposits to act as a qualified person. Relevant experience in the other deposit types could count towards the experience in relation to porphyry-copper deposits.\n(2) For a qualified person providing a technical report for exploration results or mineral resource estimates, relevant experience also requires, in addition to experience in the type of mineralization, sufficient experience with the sampling and analytical techniques, as well as extraction and processing techniques, relevant to the mineral deposit under consideration. Sufficient experience means that level of experience necessary to be able to identify, with substantial confidence, problems that could affect the reliability of data and issues associated with processing.\n(3) For a qualified person applying the modifying factors, as defined by this section, to convert mineral resources to mineral reserves, relevant experience also requires:\n(i) Sufficient knowledge and experience in the application of these factors to the mineral deposit under consideration; and\n(ii) Experience with the geology, geostatistics, mining, extraction and processing that is applicable to the type of mineral and mining under consideration.\n(Remainder of page left blank.)\nThe SEC replaced its disclosure requirements for mining companies and replacing Industry Guide 7 with Regulation S-K 1300 et. seq. This new disclosure goes into effect for the Company beginning with the first quarter of our fiscal year beginning July 1, 2021. Because of this, we are required to file our annual reports and quarterly reports aligned to S-K 1300 requirements. The S-K 1300 is aligned more closely to CRIRSC definitions and shares similarities with, but not equal to, other reporting codes applicable to the mining industry such as NI 43-101. Industry Guide 7 will remain effective until all registrants are required to comply with the rules, at which time Industry Guide 7 will be rescinded. Note that under Reg. S-K 1300, there is a greater focus on materiality and integrity or quality of information. The concept of a qualified person is added where there are results of exploration disclosed in terms of quantified mineral content and the various reports with the prescribed content required in each, every technical report referenced under Regulation. S-K 1300 must be prepared by a qualified person. Thus, where previously we could have disclosed certain limited exploration results that we were able to secure from the prior owner of a property in which we now have mining interests, where the data was incomplete and yet the prior owners notes did have the gold and silver content listed per ton at various drill holes listed, where that information was purported to have come from a report prepared in a large exploration program of the area where the property is situated, however under Regulation S-K 1300 we may not disclose that information if it was not based on work prepared by a qualified person. Without a way to determine that the reports, summary technical report or property disclosure was prepared by a qualified person, as defined in Regulation S-K 1300. Under Item 1302(a)(1) of Regulation S-K 1300, we may disclose historical information in technical reports, property disclosures and other summaries of work, provided it is based on the work of a qualified person. However, since it is from the prior owners notes and those notes were incomplete and there isnt a way to determine conclusively if it was based on the work of a qualified person, we have determined that the information may not be disclosed. ITEM 3. LEGAL PROCEEDINGS\nAll legal proceedings were stayed with the filing of Chapter 11 bankruptcy.\nBoart Longyear Company v. Lordsburg Mining Company, Case No. D-2-2-CV-2015- 06048, County of Bernalillo, NM; Boart Longyear Company v. Lordsburg Mining Company, Case No. D-721-CV-2015- 00058, County of Sierra, NM; and Boart Longyear Company v. Lordsburg Mining Company, Case No. D-608-CV- 201500165, County of Quintero, NM. There are a series of collection cases by Boart Longyear Company, a company that obtained Utah judgments for equipment delivered to Lordsburg Mining Company in the aggregate amounts of $158,480 and has an interest rate of 5.25% per annum. Accrued interest on the obligation at June 30, 2022 and 2021 was $53,322 and $45,002 respectively. Interest on the obligation for the years ended June 30, 2022 and 2021 was $8,320, respectively for both years.\nWagner Equipment Co. v. Lordsburg Mining Company, Case No. D-2014-02372, County of Bernalillo, NM 28 is a collection case by Wagner equipment, who obtained judgment for equipment delivered to Lordsburg Mining Company in the amount of $115,789 and has a rate of interest of 8.75% per annum. Accrued interest on the obligation at June 30, 2022 and 2021 was $77,994 and $67,862, respectively. Interest on the obligation for the years ended June 30, 2022 and 2021 was $10,132, respectively.\nWith the completion of the bankruptcy in June 2016, all pending legal actions were reinstated and debts at the time of the bankruptcy are currently due and in default, but none of the then existing litigation has to date resulted in subsequent legal proceedings. There can be no assurance that subsequent legal proceedings will not materialize. After the dismissal of the bankruptcy case, the Company had limited assets, but remained liable for all commitments and debts that then were outstanding. Santa Fe Gold Barbados, The Lordsburg Mining Company and AZCO are subsidiaries of the Company with nominal assets and all of their commitments, debts and legal proceedings remain. The bankruptcy court set up a trust fund funded by the activities of the Summit mine (main asset sold in bankruptcy proceedings) for five years from reopening of the mine and the trust funds will be distributed by an independent trustee to certain unsecured creditors of record.\nA former director and former chief executive officer of the Company, Mr. Thomas H. Laws, entered into a secured promissory note and security agreement in the principal amount of $930,000 in favor of the Company on September 19, 2018, bearing interest at the annual rate of 4% and maturing on September 30, 2018 (Secured Promissory Note). The Company requested the former chief executive to execute the Secured Promissory Note and security agreement as a result of the matters discussed below prior to the completion of the special committee investigation. The security interests included certain real estate and a Cessna model 182G airplane. The Secured Promissory Note also contains late fee and default provisions under the deeds of trust, Security Agreement and other agreements.\nSubsequent professional costs including legal, auditing, forensic accounting and related filing costs related to this event have been added to the amounts owed by Mr. Laws. As of the filing of this annual report, we have determined that the costs associated with Mr. Laws action currently aggregate to approximately $1,651,263 including legal charges and forensic accounting, of which we have collected $990,632 in cash and property with an estimated net market value of $25,800 as of the date of filing of this Form 10-K.\nAs of the filing of this report, Mr. Laws has plead guilty to various charges brought against him by the U. S. District Attorney for the District of New Mexico, which include the Companys allegations. Mr. Laws has been sentenced on the charges which he plead, to 81 months in prison. Currently he is serving that sentence. The Company attorneys have filed all required documents for future monetary settlements to be determined by the court. In November 2020 the court awarded various Laws properties to the Company and in\nDecember 2020 the Company was provided good title, free and clear of any encumbrances to them. Laws residence was levied on pursuant to court order and has been sold by the court and the net proceeds received by the Company in March 2021. The Company does not anticipate receiving any additional substantial reimbursement of the remaining expenses that were incurred as a result of Laws malfeasance after the sale of the remaining property received from the court.\nIn April 2021, the Company was served with a complaint in the State of Florida by Euro Bentley Advisors, LLC (EBA) for the sum of $120,000 based on the alleged breach of contract between the Company and EBA. The Company has settled this litigation in the amount of $100,000 and has paid $30,000 against this obligation in our quarter ending December 2021 and the remaining $70,000 was paid in February 2022.\nWe are subject from time to time to litigation, claims and suits arising in the ordinary course of business. ITEM 4. MINE SAFETY DISCLOSURES\nPursuant to Section 1503(a) of the recently enacted Dodd-Frank Wall Street Reform and Consumer Protection Act (The Dodd-Frank Act), issuers that are operators, or that have a subsidiary that is an operator, of a coal or other mine in the United States are required to disclose in their periodic reports filed with the SEC information regarding specified health and safety violations, orders and citations, related assessments and legal actions, and mining-related fatalities. During the fiscal years ended June 30, 2022 and 2021, our U.S. exploration properties were not subject to regulation by the Federal Mine Safety and Health Administration (MSHA) under the Federal Mine Safety and Health Act of 1977 (the Mine Act) as no material mining activity had commenced.\nPART II ITEM 5. MARKET FOR COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND PURCHASE OF EQUITY SECURITIES\nMarket Information\nPrior to the Commission stop order on the trading of our common stock and deregistration on December 17, 2020, our common stock traded on the OTC PINK Exchange under the ticker symbol SFEG. The following table sets forth, for the periods indicated, the high and low closing sales prices of our common stock. Trading was sporadic and limited. Quotations represent prices between dealers, do not include retail markups, markdowns, or commissions, and do not necessarily represent at which actual transactions were affected.\nOTCPINK\n(U.S. $)\nHIGH\nLOW\nFiscal 2022\nQuarter ended September 30, 2021 Delisted\n0.0000\n0.0000\nQuarter ended December 31, 2021 Delisted\n0.0000\n0.0000\nQuarter ended March 31, 2022 Delisted\n0.0000\n0.0000\nQuarter ended June 30, 2022 Delisted\n0.0000\n0.0000\nFiscal 2021\nQuarter ended September 30, 2020\n0.0940\n0.0480\nQuarter ended December 31, 2020\n0.0598\n0.0300\nQuarter ended March 31, 2021 Delisted\n0.0000\n0.0000\nQuarter ended June 30, 2021 Delisted\n0.0000\n0.0000\nHolders of Common Equity\nAs of June 30, 2022, we had approximately 864 holders of record of our common stock.\nTransfer Agent\nColonial Stock Transfer Co. is the transfer agent for our common stock. The principal office of Colonial Stock Transfer Co. is located at 7840 S 700 E, Sandy, Utah 84070 and the telephone number is (801) 355-5740.\nDividend Policy\nWe have never declared or paid dividends on our common stock. Payment of future dividends, if any, will be at the discretion of our board of directors after taking into account various factors, including the terms of any credit arrangements, our financial condition, operating results, current and anticipated cash needs and plans for expansion.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe do not have an effective equity compensation plan, whether approved by shareholders or not.\nRecent Sales of Unregistered Securities\nDuring the Companys 2021 and 2022 fiscal years ending June 30, the Company received proceeds from the sale of shares of its Common Stock of $929,000 and $414,500 respectively. A total of 15,366,668 shares were sold during fiscal 2021 at an average price per share of $0.0604 per share, with prices ranging between $0.05 and $0.07 per share. A total of 8,290,000 shares were sold during fiscal 2022 at a price of $0.0500 per share and were at a discount to the market price on the date of delisting at a discount price per share of $0.098 per share, The shares sold and issued were shares of restricted Common Stock made in reliance upon the exemptions from registration provided by Section 4(2) of the Securities Act of 1933, and/or Rule 506 of Regulation D promulgated thereunder. The investors were accredited investors and/or sophisticated investors pursuant to Section 501(a) of the Securities Act, who provided the Company with representations, warranties and information concerning their qualifications as a sophisticated investor and/or accredited investors. The Company provided and made available, to the investors, full information regarding its business and operations. There was no general solicitation in connection with the offers or sales of the restricted securities. The investors acquired the restricted common stock for their own accounts, for investment purposes and not with a view to public resale or distribution thereof within the meaning of the Securities Act. The restricted shares so purchased cannot be sold unless pursuant to an effective registration statement by the Company, or by exemptions from registration requirements of Section 5 of the Securities Act-the existence of any such exemptions is subject to legal review and approval by the Company.\nDate\nSecurity\nNumber of Shares\nPurchaser\nProceeds ($)\nConsideration\n7/07/2020\nCommon Stock\n750,0000\nInvestor\nNil\nBonus\n7/13/2020\nCommon Stock\n3,500,000\nInvestors\n175,000\nCash\n7/15/2020\nCommon Stock\n1,500,000\nInvestor\n105,000\nCash\n7/28/2020\nCommon Stock\n1,500,000\nInvestor\n105,000\nCash\n7/31/2020\nCommon Stock\n213,162\nConsultant\nNil\nAdvisory Services\n9/03/2020\nCommon Stock\n750,000\nInvestor\n52,500\nCash\n9/29/2020\nCommon Stock\n833,334\nInvestor\n50,000\nCash\n10/08/2020\nCommon Stock\n2,500,000\nInvestor\n150,000\nCash\n10/31/2020\nCommon Stock\n230,167\nConsultant\nNil\nAdvisory Services\n11/04/2020\nCommon Stock\n2,500,000\nInvestor\n150,000\nCash\n01/07/2021\nCommon Stock\n250,000\nInvestor\n17,500\nCash\n01/11/2021\nCommon Stock\n833,334\nInvestor\n50,000\nCash\n01/31/2021\nCommon Stock\n250,000\nConsultant\nNil\nAdvisory Services\n02/22/2021\nCommon Stock\n150,000\nInvestor\n10,500\nCash\n03/11/2021\nCommon Stock\n1,000,000\nInvestor\n60,000\nCash\n03/22/2021\nCommon Stock\n50,000\nInvestor\n3,500\nCash\n04/30/2021\nCommon Stock\n250,836\nConsultant\nNil\nAdvisory Services\n7/12/2021\nCommon Stock\n70,000\nInvestor\n3,500\nCash\n7/30/2021\nCommon Stock\n2,000,000\nInvestor\n100,000\nCash\n8/17/2021\nCommon Stock\n2,000,000\nInvestor\n100,000\nCash\n9/14/2021\nCommon Stock\n100,000\nInvestor\n5,000\nCash\n10/28/2021\nCommon Stock\n600,000\nInvestor\n30,000\nCash\n01/01/2022\nCommon Stock\n60,000\nInvestor\n3,000\nCash\n02/02/2022\nCommon Stock\n1,000,000\nInvestor\n50,000\nCash\n02/17/2022\nCommon Stock\n1,400,000\nInvestor\n70,000\nCash\n04/21/2022\nCommon Stock\n1,000,000\nInvestor\n50,000\nCash\n05/02/2022\nCommon Stock\n60,000\nInvestor\n3,000\nCash ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nExcept for the historical information, the following discussion contains forward-looking statements that are subject to risks and uncertainties. Readers are cautioned that the following discussion contains certain forward-looking statements and should be read in conjunction with the Cautionary Statement on Forward-Looking Statements appearing at the beginning of this Annual Report. We caution you not to put undue reliance on any forward-looking statements, which speak only as of the date of this report. Our actual results or actions may differ materially from these forward-looking statements for many reasons, including the risks described in Risk Factors and elsewhere in this annual report. Our discussion and analysis of our financial condition and results of operations should be read in conjunction with the Financial Statements of the Company and notes thereto included elsewhere in this Annual Report. See Financial Statements. Our actual future results may be materially different from what we currently project.\nOverview of Operating Highlights\nWe are a company engaged in the business of acquiring, exploring and developing precious metal projects in New Mexico. We own an advanced stage exploration project in the Black Hawk mining district located in Grant County, New Mexico and have the mineral and mining rights to our project in the Steeple Rock District, Grant County New Mexico.\nThe consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities and commitments in the ordinary course of business. If the Company becomes unable to continue as a going concern, it may be unable to realize the carrying value of its assets or to meet its liabilities as they become due.\nWe have a total accumulated deficit of $114,974,250 at June 30, 2022. To continue as a going concern, we are dependent on continued fund raising and future cash flow from operations. However, currently we have no commitment in place from any party to provide additional capital and there is no assurance that such funding will be available, or if available, that its terms will be favorable or acceptable to us or that sufficient cash flow will be obtained in our 2023 fiscal year, to allow us to meet our obligations as the come due, and allow us to meet our current business plan.\nCurrent Plan of Operation\nWe believe that investors will gain a better understanding of our Company if they understand how we measure and talk about our results. As an exploration company, we recognize the importance of managing our liquidity and capital resources. We pay close attention to non-discretionary cash expenses and look for ways to minimize them when possible. We ensure we have sufficient cash on hand to meet our annual land holding costs as the maintenance of mining claims and leases that are essential to preserve the value of our mineral property assets and mineral interests we hold.\nFor the fiscal year 2023, our current business plan is to undertake the following:\nFinalize the mill purchase and construction for ore processing and concentration.\nContinued mine enhancements at the Jim Crow and Billali mines.\nResume mining operations at the Jim Crow and Billali mines.\nProcess ore into concentrates and monetize for working capital cash flow.\nResults of Operations\nThe following table sets forth Condensed Consolidated Statements of Operations data for the periods presented:\nFor the Year Ended June 30,\nRevenues\n$\n-\n$\n-\nExploration and mine related\n124,447\n546,895\nGeneral and administrative\n1,332,181\n1,662,022\nLoss on asset disposition\n-\n1,836\nTotal expenses from operations\n1,456,628\n2,210,753\n(Loss) from Operations\n(1,456,628)\n(2,210,753)\nOther (Expense) Income\n(877,464)\n130,241\nNet (Loss)\n$\n(2,334,092)\n$\n(2,080,512)\nSignificant changes in our results of operations are more fully described below.\nFiscal Year Ended June 30, 2022 Compared to Fiscal Year Ended June 30, 2021\nRevenues\nWe are an exploration stage company as defined in regulation S-K 300 with limited operations and have generated no revenues during our fiscal years ended June 30, 2022 and 2021.\nOperating Expenses\nOur operating cost incurred in our fiscal year ended June 30, 2022, decreased $754,125 from $2,210,753 in the fiscal year ended June 30, 2021 to $1,456,628 for the fiscal year ended June 30, 2022. Details of the significant changes are as follows.\nExploration and other mine related costs: The decrease in exploration and mine related costs incurred in the current fiscal year was $422,448 and was a result of decreased activity at the Jim Crow mine. The decrease was mainly attributable to decreases in the following areas: $269,702 in wages and payroll burden costs, and other major areas of mine related operating costs of $152,746.\nGeneral and administrative: The decrease in general and administrative of $329,841 was mainly attributable to decreases in the following areas: salaries and related payroll burden of $47,306, consulting fees of $214,932, insurance of $23,487, SEC processing fees of $10,785 and legal fees of $110,456. These decreases were offset by increases in the following; BLM claim fees of $18,380, audit fees and miscellaneous general costs of $18,865 and costs associated with options and warrants of $41,300.\nOther Income (Expense)\nOther income and (expense) for the fiscal year ended June 30, 2022, was $(877,464) as compared to $130,241 for the fiscal year ended June 30, 2021, a decrease in other income of $(1,007,705). The net decrease in other income for the current year of measurement is mainly comprised of the decreases in the following other income components: gain on debt extinguishment of $226,367 and recovery of misappropriated funds of $540,702. These decreases in other income were offset by increased other expenses in financing costs-commodity supply agreement of $218,096 and interest cost of $22,538.\nRecent Equity Transactions, Financing Facilities and Debt Settlements\nBelow summarizes equity financing, financing facilities and debt settlements in our fiscal years ended June 30, 2022 and 2021 as follows:\nFor the Year Ended June 30,\nRestricted common stock sold to accredited investors\n8,290,000\n25,399,720\nFunds Generated\nGross proceeds from equity financing\n$\n414,500\n$\n929,000\nSBA PPP loan proceeds\n-\n127,520\nNote payable proceeds\n500,000\n-\nInsurance proceeds\n-\n17,906\nProceeds from sale of assets\n38,167\n-\nCash provided for working capital\n$\n952,667\n$\n1,074,426\nFunds Utilized\nCash payments on notes payable\n$\n10,000\n$\n-\nPayments on mineral leases\n300,000\n300,000\nPurchase of property and equipment and deposits\n179,469\n22,860\nRent deposit\n-\nPayments on lease principle\n4,403\n17,503\nCash utilized from working\n$\n493,997\n$\n340,363\nSignificant changes in our results of operations are more fully described below.\nLiquidity and Capital Resources\nAs of June 30, 2022, we had cash of $19,939 and a working capital deficit of $21,872,755. At June 30, 2022, we were in arrears on old debt aggregating approximately $19,779,121 that was incurred prior to our bankruptcy filing. We have had no revenues since emerging from bankruptcy, and we are not currently profitable. We currently do not have sufficient capital to fund operations through our fiscal year ending June 30, 2023 and will need to raise additional funding to implement our current business strategy. We have previously commenced production operations at the Jim Crow mine and implemented mine improvements and water removal in the fourth calendar quarter of 2020 to the Billali mine site. In the last week of November 2020, our mine manager contacted the COVID-19 virus and later two of our employee miners contacted it also and we shut the mining operation down and from that time to current, the mines and equipment are under a maintenance protocol. The mines will remain under this maintenance protocol until the processing mill is constructed at the Duncan Arizona site and ready for operation.\nCurrently, there can be no assurance of any revenue from these mine sites until we construct our processing mill. Ore previously produced is being inventoried for future processing at the future mill site. Even if we are successful in developing any of our properties, we expect to incur operating losses for the foreseeable future and may never become profitable. We also expect to continue to incur significant operating and capital expenditures and anticipate that our expenses will increase substantially in the foreseeable future. As the Company has currently has no commitment for debt or equity financing, the Company will be reliant upon its own best-efforts fundraising activities to provide sufficient working capital to fund current and immediate plan requirements. There can be no assurance that the Company will be successful in its capital raising efforts, and the failure to raise needed capital will likely result in the curtailment or cessation of our business which would adversely affect investors.\nCash Flows Used in June 30, 2022 Operations\nCash used to fund our operations which included corporate general and administration expenses, land holding costs, and mine maintenance programs at our Jim Crow and Bilalli projects was $466,189.\nThe Company continues to build our asset base with capital expenditures. In fiscal 2022 net cash expenditures of $479,469 and consisted of the cash payments under the Jim Crow and Billali project Agreement of $300,000 and $179,469 for property acquisition.\nFactors Affecting Future Operating Results\nCurrently we have no continuing commitment from any party to provide additional working capital, or if one becomes available, there is no certainty that its terms will be favorable or acceptable to the Company. Historically, we and other similar exploration and development public companies have accessed capital through equity financing arrangements or by the sale of royalties on its mineral properties. If, however we are unable to obtain additional capital or financing, our exploration and development activities will be\nsignificantly adversely affected. Until positive cash flow is generated from operations, we will be dependent upon future working capital facilities or equity financing arrangements, to meet our expenses and to fund execution on our business plan.\nWe anticipate our twelve-month cash expenditures for our fiscal year ending June 30, 2023 to be as follows:\n$880 thousand on corporate administration expenses, comprising of executive management and employee salaries, legal, audit, marketing, SEC filings and other general and administrative expenses.\n$2.8 million to $3.5 million on the Jim Crow and Billali projects including, exploration, mine development and enhancements, mine operational costs, including employee compensation, benefits, land holding costs and potential new mine properties in the Black Hawk mining district.\n$1.9 million for the mill site construction project in Duncan, Arizona. Costs include final design fees, mill equipment purchase, site construction, permits and project development ramp up.\nCritical Accounting Policies\nOur discussion and analysis of our consolidated financial condition and results of operations are based on the Companys consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these consolidated financial statements requires us to make estimates and judgments that affect the reported amount of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amount of revenues and expenses for each period. Critical accounting policies are defined, as policies that management believes are the most important to the portrayal of our consolidated financial condition and results of operations. These policies may require us to make difficult, subjective or complex judgments, commonly about the effects of matters that are inherently uncertain.\nOur significant accounting policies are described in the audited consolidated financial statements and notes thereto. See Note 2, Summary of Significant Accounting Policies in the Notes to the Consolidated Financial Statements for our fiscal years June 30, 2022 and 2021, which these describe our significant accounting policies which are reviewed by management on a regular basis.\nWe believe our most critical accounting policies relate to asset impairment obligations, mineral property cost estimates, derivative instruments and variables used in the Black-Scholes option pricing model and estimates utilized in stock-based compensation and warrant and option issuances computations.\nImpairment of Long-Lived Assets\nThe Company reviews long-lived assets for impairment annually or whenever events or changes in circumstances indicate that the carrying amount of the assets may not be fully recoverable. The Company recognizes an impairment loss when the sum of expected undiscounted future cash flows is less than the carrying amount of the asset. The amount of impairment is measured as the difference between the assets estimated fair value and its book value.\nMineral Rights\nMineral properties are capitalized at their fair value at the acquisition date, either as an individual asset purchase or as part of a business combination. When it is determined that a mineral property can be economically developed as a result of establishing reserves, subsequent mine development is capitalized and are amortized using the units of production method over the estimated life of the ore body based on estimated recoverable tonnage in proven and probable reserves.\nEstimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting year. Actual results could differ from those estimates under different assumptions or conditions.\nDerivative Financial Instruments\nDerivative financial instruments are initially measured at their fair value. For derivative financial instruments that are accounted for as liabilities, the derivative instrument is initially recorded at its fair value and is then re-valued at each reporting date, with changes in the fair value reported as charges or credits to income. To the extent that the initial fair values of the freestanding and/or bifurcated derivative instrument liabilities exceed the total proceeds received, an immediate charge to income is recognized as a one-day derivative loss, in order to initially record the derivative instrument liabilities at their fair value.\nWhen required to arrive at the fair value of derivatives associated with the convertible notes and warrants, a Black Scholes or a Monte Carlo model is utilized that values the Convertible Note and Warrant based on average discounted cash flow factoring in the various potential outcomes by a Chartered Financial Analyst (‘CFA). In determining the fair value of the financial derivatives, the CFA assumed that the Companys business would be conducted as a going concern.\nOff-Balance Sheet Arrangements\nDuring the fiscal years ended June 30, 2022 and 2021, we did not engage in any off-balance sheet arrangements as set forth in Item 303(a) (4) of the Regulation S-K. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThis section is not required to be completed by smaller reporting companies. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSANTA FE GOLD CORPORATION\nCONSOLIDATED FINANCIAL STATEMENTS\nAs of and for the Years ended June 30, 2022 and 2021\nSANTA FE GOLD CORPORATION\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID 5854)\nFINANCIAL STATEMENTS:\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statement of Stockholders' Deficit\nConsolidated Statements of Cash Flows\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Santa Fe Gold Corp.:\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Santa Fe Gold Corp. (the Company) as of June 30, 2022, and the related statements of income, comprehensive income, stockholders equity, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 of the financial statements, the Company has suffered recurring losses from operations that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might results from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ TAAD LLP.\nWe have served as the Companys auditor since 2018.\nDiamond Bar, California\nOctober 13, 2022\nSANTA FE GOLD CORPORATION\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent Assets:\nCash and cash equivalents\n$\n19,939\n$\n27,458\nPrepaid expenses and other current assets\n8,740\n8,902\nTotal current assets\n28,679\n36,360\nNON-CURRENT ASSETS:\nProperty and equipment, net\n432,118\n287,403\nMineral property\n4,215,365\n3,915,365\nFinance lease right-of-use asset, net\n-\n17,098\nDeposit\n-\nAssets held for sale\n202,821\n247,800\nTotal Assets\n$\n4,879,108\n$\n4,504,026\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent Liabilities:\nAccounts payable\n$\n3,812,836\n$\n3,742,933\nAccrued liabilities\n12,385,090\n11,030,356\nFinance lease liability\n-\n4,403\nNotes payable, current maturities\n2,343,635\n2,271,635\nCompletion guaranty payable\n3,359,873\n3,359,873\nTotal Current Liabilities\n21,901,434\n20,409,200\nNon-current notes payable\n510,786\n109,883\nTotal Liabilities\n22,412,220\n20,519,083\nCommitments and Contingencies\nStockholders' Deficit:\nCommon stock, $0.002 par value, 550,000,000 shares authorized at June 30, 2022 and\nJune 30, 2021; 441,308,551 issued and outstanding at June 30, 2022 and\n433,018,551 shares issued and outstanding at June 30, 2021\n882,617\n866,037\nAdditional paid-in capital\n96,558,521\n95,759,064\nAccumulated deficit\n(114,974,250\n)\n(112,640,158\n)\nTotal Stockholders' Deficit\n(17,533,112\n)\n(16,015,057\n)\nTotal Liabilities and Stockholders' Deficit\n$\n4,879,108\n$\n4,504,026\nThe accompanying notes are an integral part of these audited consolidated financial statements.\nSANTA FE GOLD CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears Ended June 30,\nRevenues\n$\n-\n$\n-\nOperating Expenses:\nExploration and other mine related costs\n124,447\n546,895\nGeneral and administrative\n1,332,181\n1,662,022\nLoss on asset disposition\n-\n1,836\nTotal Operating Expenses\n1,456,628\n2,210,753\nLoss from Operations\n(1,456,628\n)\n(2,210,753\n)\nOther Income (Expense):\nMiscellaneous income\n-\nGain on debt forgiveness\n-\n226,367\nRecovery (loss) associated with misappropriated funds\n(6,812\n)\n533,890\nFinancing costs-commodity supply agreements\n(199,736\n)\n18,360\nInterest expense\n(670,916\n)\n(648,378\n)\nTotal Other (Expense) Income\n(877,464\n)\n130,241\nIncome (Loss) Before Provision for Income Taxes\n(2,334,092\n)\n(2,080,512\n)\nProvision for Income Taxes\n-\n-\nNet (Loss)\n$\n(2,334,092\n)\n$\n(2,080,512\n)\nBasic and Diluted Per Share Data:\nNet (Loss) - Basic and diluted\n$\n(0.01\n)\n$\n(0.00\n)\nWeighted Average Common Shares Outstanding:\nBasic and diluted\n438,287,455\n428,947,739\nThe accompanying notes are an integral part of these audited consolidated financial statements.\nSANTA FE GOLD CORPORATION\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nAdditional\nCommon Stock\nPaid-In\nAccumulated\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance, June 30, 2020 (Restated)\n415,957,718\n$\n831,915\n$\n94,399,116\n$\n(110,559,646\n)\n$\n(15,328,615\n)\nCommon shares issued for consulting\n944,165\n1,889\n57,944\n-\n59,833\nSale of common shares for cash\n15,366,668\n30,733\n898,267\n-\n929,000\nCommon shares issued for bonus award\n750,000\n1,500\n43,500\n-\n45,000\nValue of warrants issued\n-\n-\n360,237\n-\n360,237\nNet income\n-\n-\n-\n(2,080,512\n)\n(2,080,512\n)\nBalance June 30, 2021\n433,018,551\n$\n866,037\n$\n95,759,064\n$\n(112,640,158\n)\n$\n(16,015,057\n)\nSale of common shares for cash\n8,290,000\n16,580\n397,920\n-\n414,500\nValue of warrants issued\n-\n-\n401,537\n-\n401,537\nNet loss\n-\n-\n-\n(2,334,092\n)\n(2,334,092\n)\nBalance, June 30, 2022\n441,308,551\n$\n882,617\n$\n96,558,521\n$\n(114,974,250\n)\n$\n(17,533,112\n)\nThe accompanying notes are an integral part of these audited consolidated financial statements.\nSANTA FE GOLD CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended June 30,\nCash Flows from Operating Activities:\nNet loss\n$\n(2,334,092\n)\n$\n(2,080,512\n)\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nStock based compensation\n-\n104,833\nWarrant/option expense from derivative liability\n401,537\n360,237\nGain on PPP debt forgiveness\n-\n(226,367\n)\nDepreciation and amortization\n51,852\n67,076\nNon-cash interest expense\n1,663\nNon-cash expense\n(18,000\n)\n-\nLoss on asset disposition\n-\n1,836\nNon-cash loss (recovery) associated with misappropriated funds\n6,812\n(247,800\n)\nNet change in operating assets and liabilities:\nPrepaid expenses and other current assets\n2,971\nAccounts payable and accrued liabilities\n1,424,637\n1,206,362\nNet Cash Used in Operating Activities\n(466,189\n)\n(809,701\n)\nCash Flows from Investing Activities:\nPayment on mineral leases\n(300,000\n)\n(300,000\n)\nPurchase of property and equipment\n(179,469\n)\n(2,860\n)\nDeposit on mill design and engineering contract\n-\n(20,000\n)\nNet Cash Used in Investing Activities\n(479,469\n)\n(322,860\n)\nCash Flows from Financing Activities:\nProceeds from issuance of common stock\n414,500\n929,000\nNet proceeds from assets for sale\n38,167\n-\nProceeds from notes payable\n500,000\n127,520\nInsurance proceeds from truck loss\n-\n17,906\nPayment on note principal\n(10,000\n)\n-\nRent deposit payment\n(125\n)\n-\nPayment on lease principle\n(4,403\n)\n(17,503\n)\nNet Cash Provided by Financing Activities\n938,139\n1,056,923\nNet (Decrease) Increase in Cash and Cash Equivalents\n(7,519\n)\n(75,638\n)\nCash and Cash Equivalents Beginning of year\n27,458\n103,096\nCash and Cash Equivalents End of Year\n$\n19,939\n$\n27,458\nSupplemental Cash Flow Information:\nCash paid for interest\n$\n$\n1,933\nCash paid for income taxes\n$\n-\n$\n-\nSupplemental Disclosure of Non-Cash Investing and Financing Activities:\nShares issued for bonus award\n$\n-\n$\n45,000\nFinance charges on commodity supply agreement, in accrued liabilities\n$\n199,736\n$\n267,428\nThe accompanying notes are an integral part of the audited consolidated financial statements.\nSANTA FE GOLD CORPORATION\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - NATURE OF OPERATIONS\nSanta Fe Gold Corporation (the Company, our or we) is a U.S. mining company incorporated in Delaware in August 1991. Our general business strategy is to acquire, explore, develop and mine mineral properties. The Company elected on August 26, 2015, to file for Chapter 11 Bankruptcy protection, Case # 15-11761 (MFW) and that case was dismissed on June 15, 2016. The Summit Silver-Gold Project, the Lordsburg Copper Project, Black Canyon Mica Project, Planet MIO Project, all claims and other assets were lost in the process. After the Company emerged from the bankruptcy with a management team of two with no assets, we developed a business plan to raise equity funds to acquire new mining claims, a potential processing plant or arrangements with a processing plant in an acceptable geographic location to potential new mining claims.\nIn August 2017, the Company acquired all the capital stock of Bullards Peak Corporation and the related patented and unpatented claims in the Black Hawk district of New Mexico from Black Hawk Consolidated Mines Company for a purchase price of $3,115,365. The mine property is known as the Alhambra mine site. The transaction was finalized and closed in April 2019. The mining property acquired is an asset in our subsidiary, Mineral Acquisitions, LLC.\nIn January 2019 the Company has acquired right of use on two properties in western New Mexico, consisting of eight (8) patented claims and two unpatented claims, all located in the Steeple Rock Mining District, Grant County, New Mexico and the related water rights lease agreements. The two properties are known as the Billali Mine and the Jim Crow Imperial Mine. The Company has made improvements to the Jim Crow Imperial mine and has commenced mining operations during the third calendar quarter of 2020. In the last week of November 2020, our mine manager contacted the COVID-19 virus and later two of our employee miners contacted it also and we shut the mining operation down and currently the mines and equipment are under a maintenance protocol. Currently it is anticipated to reopen the mines in late 2022 when we the complete the construction of our mill operation in Duncan, Arizona. The Company has no current COVID-19 problems.\nWe are considered an exploration stage company under the U.S. Securities and Exchange Commission (SEC) S-K 1300. The mining leases and other mineral rights we have control of, however, none of them contain any proven or probable reserves, as defined under S-K 1300. As such, they are all currently considered exploratory in nature. The new S-K 1300 guide replaced SEC Guide 7 and went into effect for the Company beginning with our fiscal year July 1, 2021. We are now required to file our Forms 10-Q and 10-K reports with the Commission aligned to S-K 1300 requirements. S-K 1300 is aligned more closely to CRIRSC definitions and shares similarities with, but not equal to, other reporting codes applicable to the mining industry such as NI 43-101.\nCovid-19\nOn January 30, 2020, the World Health Organization (WHO) announced a global health emergency because of a new strain of coronavirus originating in Wuhan, China (the COVID-19 outbreak) and the risks to the international community as the virus spreads globally beyond its point of origin. In March 2020, the WHO classified the COVID-19 outbreak as a pandemic, based on the rapid increase in exposure globally.\nAt this time, we cannot foresee whether the outbreak of COVID-19 will continue be effectively contained, nor can we predict the severity and duration of its impact. If the outbreak of COVID-19 or other infectious viruses are not effectively and timely controlled, our business plans and financial condition may be materially and adversely affected as a result of the potential deteriorating economic outlook or other factors that we cannot foresee. Any of these factors and other factors beyond our control could have an adverse effect on the overall business environment and cause our business to suffer in ways that we cannot predict at this time and that may materially and adversely impact our business plans, financial condition and results of operations.\nWith three of our mine employees contacted the COVID-19 virus in the last week of November 2020, we shut the mining operation down and currently the mines and equipment are under a maintenance protocol. With the current COVID -19 situation and the current inability to process the mined ore we anticipate not restarting the mining operation until late 2022, depending on the projected completion of our mill operation in Duncan, Arizona.\nAt this time, we cannot foresee whether the potential COVID-19 or any other variants that may affect our future operations, nor if an occurrence should happen, can we predict the severity and duration of its impact. Our business plans and financial condition may be materially and adversely affected as a result of the potential deteriorating economic outlook or other factors that we cannot foresee. Any of these factors and other factors beyond our control could have an adverse effect on the overall business environment and cause our business to suffer in ways that we cannot predict at this time and that may materially and adversely impact our business plans, financial condition and results of future operations. Currently, COVID-19 and any variants has had no additional effect on the Company.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nLiquidity and Going Concern\nThe financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities and commitments in the normal course of business. Should the Company be unable to continue as a going concern, it may be unable to realize the carrying value of its assets and to meet its liabilities as they become due.\nBelow presents summary financial information for the two fiscal years presented in this Form 10-K filing.\nJune 30,\nCash on hand\n$\n19,939\n$\n27,458\nWorking capital (deficit)\n$\n(21,897,755\n)\n$\n(20,372,840\n)\nStockholder (deficit)\n$\n(17,533,112\n)\n$\n(16,015,057\n)\nCurrent year net (loss)\n$\n(2,334,092\n)\n$\n(2,080,512\n)\nOn August 26, 2015, Santa Fe filed for Chapter 11 Bankruptcy protection, Case # 15-11761 (MFW) in Delaware. With the dismissal of our bankruptcy case in June 15, 2016, all assets of the Company were sold. These conditions raise substantial doubt regarding the Companys ability to continue as a going concern.\nTo continue as a going concern, the Company is dependent on continued capital financing for project development, repayment of various debt facilities and payment of current operating expenses until the Company has constructed its mill operation and implemented ore production at our mine sites to process the mineralized ore to generate revenue. We have no commitment from any party to provide additional working capital and there is no assurance that any funding will be available as required, or if available, that its terms will be favorable or acceptable to the Company.\nAs of the fiscal years ending June 30, 2022 and 2021, the Company was in default debt facility payments, accounts payable and accrued liabilities related to pre-bankruptcy obligations as follows:\nJune 30,\nAccounts payable and other accrued liabilities\n$\n3,663,249\n$\n3,644,799\nAmounts due Sandstorm under the Gold Stream Agreement\n$\n10,379,629\n$\n10,003,500\nNotes payable and accrued interest\n$\n5,736,243\n$\n5,294,491\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries AZCO Mica, Inc., a Delaware corporation. The Lordsburg Mining Company, a New Mexico corporation, Santa Fe Gold Barbados Corporation, a Barbados corporation, Santa Fe Acquisitions Company, a New Mexico Limited Liability Company, Minerals Acquisitions, LLC, a New Mexico Limited Liability Company and Bullards Peak Corporation, a New Mexico corporation. All significant inter-company accounts and transactions have been eliminated in consolidation.\nEstimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting year. Actual results could differ from those estimates under different assumptions or conditions.\nSignificant estimates are used when accounting for the Companys carrying value of mineral properties, useful life of fixed assets, depreciation and amortization, accruals, derivative instrument liabilities, taxes and contingencies, asset retirement obligations, revenue recognition, and stock-based compensation which are discussed in the respective notes to the consolidated financial statements.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in generally accepted accounting principles (GAAP) and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three (3) broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three (3) levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1\nQuoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2\nPricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3\nPricing inputs that are generally observable inputs and not corroborated by market data.\nFinancial assets are considered Level 3 when their fair values are determined using pricing models, discounted cash flow methodologies or similar techniques and at least one significant model assumption or input is unobservable. A slight change in unobservable inputs such as volatility can significantly have a significant impact on the fair value measurement of the derivatives liabilities.\nThe fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. If the inputs used to measure the financial assets and liabilities fall within more than one level described above, the categorization is based on the lowest level input that is significant to the fair value measurement of the instrument.\nThe carrying amounts of the Companys financial assets and liabilities, such as cash and accounts payable approximate their fair values because of the short maturity of these instruments.\nCash and Cash Equivalents\nThe Company considers all liquid investments purchased with an initial maturity of three months or less to be cash equivalents. The Company maintains its cash in bank deposit accounts which, at times, may exceed federally insured limits. The Company has not experienced any losses in such accounts. The Company believes it is not exposed to any significant credit risk on cash balances.\nProperty and Equipment\nProperty is carried at cost. The cost of repairs and maintenance are expensed as incurred and major replacements and improvements are capitalized. When assets are retired or disposed of, the cost and accumulated depreciation are removed from the accounts, and any resulting gains or losses are included in income in the year of disposition. Depreciation is calculated on a straight-line basis over the estimated useful life of the assets as follows.\nVehicles\n5 years\nMine equipment\n7 years\nGeneral equipment\n3-7 years\nSmall tools\n1.25 years\nMine Development\nMine development costs include engineering and metallurgical studies, drilling, and other related costs to delineate an ore body, and the building of access ways, shafts, lateral access, drifts, ramps and other infrastructure in an underground mine. Costs incurred before mineralization is classified as proven and probable reserves are expensed and classified as exploration expense. Capitalization of mine development project costs, that meet the definition of an asset, begins once mineralization is classified as proven and probable reserves.\nDrilling and related costs are capitalized for an ore body where proven and probable reserves exist and the activities are directed at obtaining additional information on the ore body or converting non-reserve mineralization to proven and probable reserves. All other drilling and related costs are expensed as incurred. Drilling costs incurred during the production phase for operational ore control are allocated to inventory costs and then included as a component of costs applicable to sales.\nMine development is amortized using the units-of-production method based upon estimated recoverable ounces in proven and probable reserves. To the extent that these costs benefit an entire ore body, they are amortized over the estimated life of the ore body. Costs incurred to access specific ore blocks or areas that only provide benefit over the life of that area are amortized over the estimated life of that specific ore body. Currently, with no claims or mines in our possession have proven and probable reserves, we have no development costs incurred. As of June 30, 2022, the Company has not established proven or probable reserves or established the commercial feasibility of any of our exploration projects and all mine development costs are expensed as incurred.\nMineral Rights\nMineral properties are capitalized at their fair value at the acquisition date, either as an individual asset purchase or as part of a business combination. When it is determined that a mineral property can be economically developed as a result of establishing reserves, subsequent mine development is capitalized and are amortized using the units of production method over the estimated life of the ore body based on estimated recoverable tonnage in proven and probable reserves.\nThe Companys mineral rights generally are enforceable regardless of whether proven and probable reserves have been established. The Company has the ability and intent to renew mineral interests where the existing term is not sufficient to recover all identified and valued proven and probable reserves and/or undeveloped mineralized material.\nCosts of exploration, carrying and retaining unproven mineral lease properties are expensed as incurred. The Company expenses all mineral exploration costs as incurred as it is still in the exploration stage. If the Company identifies proven and probable reserves in its investigation of its properties and upon development of a plan for operating a mine, it would enter the development stage and capitalize future costs until production is established.\nWhen a property reaches the production stage, the related capitalized costs are amortized on a units-of-production basis over the proven and probable reserves following the commencement of production. The Company assesses the carrying costs of the capitalized mineral properties for impairment under ASC 360-10, Impairment of long-lived assets, and evaluates the carrying value under ASC 930-360, Extractive Activities - Mining, annually. An impairment is recognized when the sum of the expected undiscounted future cash flows is less than the carrying amount of the mineral properties. Impairment losses, if any, are measured as the excess of the carrying amount of the mineral properties over its estimated fair value.\nTo date, the Company has not established the commercial feasibility of any of our exploration prospects; therefore, all exploration costs are expensed as incurred.\nImpairment of Long-Lived Assets\nThe Company reviews long-lived assets for impairment annually or whenever events or changes in circumstances indicate that the carrying amount of the assets may not be fully recoverable. The Company recognizes an impairment loss when the sum of expected undiscounted future cash flows is less than the carrying amount of the asset. The amount of impairment is measured as the difference between the assets estimated fair value and its book value. The Company did not recognize any impairment during the fiscal years ended June 30, 2022 and 2021.\nReclamation and Asset Retirement Costs\nReclamation obligations are recognized when incurred and recorded as liabilities at fair value. The liability is accreted over time through periodic charges to accretion expense. The asset retirement cost is capitalized as part of the assets carrying value and depreciated over the life of the related asset. Reclamation costs are periodically adjusted to reflect changes in the estimated present value resulting from the passage of time and revisions to the estimates of either the timing or amount of the reclamation costs. The reclamation obligation is based on when spending for an existing disturbance will occur. The Company reviews, on an annual basis, unless otherwise deemed necessary, the reclamation obligation at each mine site in accordance with ASC guidance for reclamation obligations. No reclamation costs were required for the end of our fiscal years June 30, 2022 and 2021.\nDerivative Financial Instruments\nThe Company does not use derivative instruments to hedge exposures to cash flow, market, or foreign currency risks. From time to time, the Company reviews the terms of convertible debt, equity instruments and other financing arrangements to determine whether there are embedded derivative instruments, including embedded conversion options that are required to be bifurcated and accounted for separately as a derivative financial instrument. Also, in connection with the issuance of financing instruments, the Company may issue freestanding options or warrants that may, depending on their terms, be accounted for as derivative instrument liabilities, rather than as equity. The Company may also issue options or warrants to non-employees in connection with consulting or other services.\nDerivative financial instruments are initially measured at their fair value. For derivative financial instruments that are accounted for as liabilities, the derivative instrument is initially recorded at its fair value and is then re-valued at each reporting date, with changes in the fair value reported as charges or credits to income. To the extent that the initial fair values of the freestanding and/or bifurcated derivative instrument liabilities exceed the total proceeds received, an immediate charge to income is recognized as a one-day derivative loss, in order to initially record the derivative instrument liabilities at their fair value.\nThe discount from the face value of convertible debt or equity instruments resulting from allocating some or all of the proceeds to the derivative instruments, together with the stated interest on the instrument, is amortized over the life of the instrument through periodic charges to income, using the effective interest method.\nWhen required to arrive at the fair value of derivatives associated with the convertible notes and warrants, a Black Scholes or Monte Carlo models are utilized that values the Convertible Note and Warrant based on average discounted cash flow factoring in the various potential outcomes by a Chartered Financial Analyst (‘CFA). In determining the fair value of the financial derivatives, the CFA assumes that the Companys business would be conducted as a going concern.\nThe classification of derivative instruments, including whether such instruments should be recorded as liabilities or as equity, is reassessed at the end of each reporting period. If reclassification is required, the fair value of the derivative instrument, as of the determination date, is reclassified. Any previous charges or credits to income for changes in the fair value of the derivative instrument are not reversed. Derivative instrument liabilities are classified in the balance sheet as current or non-current based on whether or not net-cash settlement of the derivative instrument could be required within twelve months of the balance sheet date.\nLeases\nIn February 2016, the FASB issued ASU 2016-02, Leases (Topic 842), which requires lessees to recognize assets and liabilities on the balance sheet for the rights and obligations created by all leases with a term of more than one year. Accounting by lessors will remain similar to existing U.S. GAAP. Subsequent accounting standards updates have been issued, which amend and/or clarify the application of ASU 2016-02. For the purposes of recognizing ROU assets and lease liabilities associated with the Companys leases, the Company has elected the practical expedient to not recognize a ROU asset or lease liability for short-term leases, which are leases with a term of twelve months or less. The lease term is defined as the noncancelable portion of the lease term plus any periods covered by an option to extend the lease if it is reasonably certain that the option will be exercised. The guidance is effective for fiscal years, and interim periods within those years, beginning after December 15, 2018. The Company adopted Topic 842 as of July 1, 2019 and the standard will not have a significant impact on our consolidated financial statements until a significant a lease agreement is entered.\nWarrants and Options\nIn connection with certain financing, the Company has issued warrants to purchase shares of its common stock. The outstanding warrants are standalone instruments that are not puttable or mandatorily redeemable by the holder and are classified as equity awards. The Company measures the fair value of the awards using the Black-Scholes option pricing model as of the measurement date. Warrants are recorded at fair value as expense over the requisite service period or at the date of issuance, if there is not a service period.\nThe Company assessed the classification of its common stock purchase warrants as of the date of each equity offering and determines that such instruments meet the criteria for equity classification, as the settlement terms indicate that the instruments are indexed to the entitys underlying stock. Warrant and option expense for the fiscal years ended June 30, 2022 and 2021 was $401,537 and $360,237 respectively.\nIncome Taxes\nThe Company accounts for income taxes using the asset and liability approach, which requires recognition of deferred tax liabilities and assets for the expected future tax consequences of temporary differences between the carrying amounts and the tax basis of such assets and liabilities. This method utilizes enacted statutory tax rates in effect for the year in which the temporary differences are expected to reverse and gives immediate effect to changes in income tax rates upon enactment. A valuation allowance is recorded when it is more likely than not that deferred tax assets will be unrealizable in future periods. As of June 30, 2022 and 2021 the Company has recorded a valuation allowance against the full amount of its net deferred tax assets. The inability to foresee taxable income in future years makes it more likely than not that the Company will not realize its deferred tax assets in future periods.\nNet Earnings (Loss) Per Share\nBasic loss per share is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding during the period. Diluted loss per share is computed by dividing net loss applicable to common stockholders by the weighted average number of common shares outstanding, plus the number of additional common shares that would have been outstanding if all dilutive potential common shares had been issued using the treasury stock method. Diluted loss per share excludes all potential common shares if their effect is anti-dilutive. The following potentially dilutive shares were excluded from the shares used to calculate diluted earnings per share as their inclusion would be anti-dilutive.\nFor the fiscal years ended June 30, 2022 and 2021 calculations of basic and diluted loss per share are the same because potential dilutive securities would have had an anti-dilutive effect. The potentially dilutive securities consisted of the following:\nJune 30,\nOptions to purchase common stock\n40,000,000\n30,000,000\nWarrants to purchase common stock\n16,010,483\n12,865,483\nTotal\n56,010,483\n42,885,483\nStock-Based Compensation\nIn connection with terms of employment with the Companys executives and employees, the Company occasionally issues options to acquire its common stock. Awards are made at the discretion of the Board of Directors. Such options may be exercisable at varying exercise prices and generally vested upon date of grant or may vest over a period of six months to a year. The Company accounts for option-based compensation on the grant date fair value of the award. The Company estimates the fair value of the award using the Black-Scholes option pricing model for valuation of the share-based payments. The Company believes this model provides the best estimate of fair value due to its ability to incorporate inputs that change over time, such as volatility and interest rates, and to allow for actual exercise behavior of option holders. If there is a vesting period, the compensation cost is recognized over the expected vesting period.\nThe Company has adopted the provisions of FASB ASC 718, Stock Compensation (ASC 718), which establishes accounting for equity instruments exchanged for employee services. Under the provisions of ASC 718, stock-based compensation cost is measured at the grant date, based on the calculated fair value of the award, and is recognized as an expense over the employees requisite service period (generally the vesting period of the equity grant). New shares of the Companys common stock are issued for any options exercised.\nShare based payments to nonemployees are valued at the earlier or a commitment date or completion of services. Stock based compensation for the years ended June 30, 2022 and 2021 was $0 and $104,833, respectively.\nRecent Accounting Pronouncements\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes, which is intended to simplify various aspects related to accounting for income taxes. The standard is effective for annual periods beginning after December 15, 2020 and interim periods within, with early adoption permitted. Adoption of the standard requires certain changes to be made prospectively, with some changes to be made retrospectively. The Company adopted ASU 2019-12, effective July 1, 2021, and determined the adoption of this standard will not have a material impact on the Companys consolidated financial statements and related disclosures.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging Contracts in Entitys Own Equity (Subtopic 815-40), which eliminates the beneficial conversion and cash conversion accounting models for convertible instruments, amends the accounting for certain contracts in an entitys own equity that are currently accounted for as derivatives because of specific settlement provisions, and modifies how particular convertible instruments and certain contracts that may be settled in cash or shares impact the diluted EPS calculation. The standard is effective for annual periods beginning after December 15, 2021, and interim periods within those reporting periods. The standard can be adopted under the modified retrospective method or the full retrospective method. The Company expects that this guidance will not have an impact on the Companys consolidated financial statements.\nIn August 2020, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2020-06-Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entity's Own Equity (Subtopic 815-40)-Accounting For Convertible Instruments and Contracts in an Entity's Own Equity. The ASU simplifies accounting for convertible instruments by removing major separation models required under current GAAP. Consequently, more convertible debt instruments will be reported as a single liability instrument with no separate accounting for embedded conversion features. The ASU removes certain settlement conditions that are required for equity contracts to qualify for the derivative scope exception, which will permit more equity contracts to qualify for it. The ASU also simplifies the diluted net income per share calculation in certain areas. The new guidance is effective for annual and interim periods beginning after December 15, 2021, and early adoption is permitted for fiscal years beginning after December 15, 2020. The Company adopted ASU 2020-06 for the fiscal year beginning July 1, 2022. The guidance currently will not have an impact on the Companys consolidated financial statements.\nIn March 2022, the U.S. Securities and Exchange Commission (the SEC) issued the proposed rule under SEC Release No. 33-11042, The Enhancement and Standardization of Climate-Related Disclosures for Investors, to enhance and standardize the climate-related disclosures provided by public companies. This update will require the disclosure of greenhouse gas emissions, including Scope 1 and Scope 2 emissions, which will be subject to third-party assurance, as well as climate-related targets and goals, and how the Board of Directors (the Board) and management oversee climate-related risks. As of June 30, 2022, these proposed rules were not adopted by the SEC; however, we anticipate that the adoption of these proposed rules may have a material impact on our financial statements and disclosures.\nOther recent accounting pronouncements issued by the FASB (including its Emerging Issues Task Force, and the SEC did not, or are not believed by management to, have a material impact on the Company's present or future financial position, results of operations or cash flows.\nNOTE 3 - PROPERTY AND EQUIPMENT\nProperty and equipment consist of the following at June 30, 2022 and 2021 are as follows:\nJune 30,\nMine equipment\n$\n146,399\n$\n146,399\nGeneral equipment\n160,081\n160,081\nSmall tools\n4,882\n4,882\nMill site property\n175,343\n-\nMill site development costs\n35,134\n20,000\nLand\n35,000\n35,000\n556,839\n366,362\nLess: accumulated depreciation\n(124,721\n)\n(78,959\n)\nProperty and equipment, net\n$\n432,118\n$\n287,403\nDepreciation and amortization expense on property and equipment for the years ended June 30, 2022 and 2021 was $51,852 and $67,076, respectively.\nNOTE 4 - MINERAL PROPERTIES\nThe Company has capitalized acquisition costs on mineral properties at June 30, 2022 and 2021 are as follows:\nJune 30,\nAlhambra - Blackhawk project\n$\n3,115,365\n$\n3,115,365\nBillali - Jim crow Imperial minerals rights\n1,100,000\n800,000\n4,215,365\n3,915,365\nLess: Accumulated amortization\n-\n-\nTotal mineral property\n$\n4,215,365\n$\n3,915,365\nExploration Status Overview\nWe have not established that the Alhambra - Blackhawk project or Billali Mine - Jim Crow / Imperial Mine rights projects contain proven or probable reserves, as defined under SEC S-K 1300.\nTo date, with respect to the Alhambra - Blackhawk project, the Company has not (i) commenced or adopted plans to conduct any exploration, (ii) prepared drilling plans, proposals, timetables or budgets for exploration work, or (iii) identified engineers and other personnel that will conduct or assist in any exploration work. The Company will need to raise funds to conduct exploration work and it currently lacks a firm financing commitment for any exploration activities.\nOn December 1, 2020, the Company made a joint announcement with Texas Mineral Resources Corp. (TMRC), of the execution of a letter agreement to pursue, negotiate and thereafter enter into a definitive joint venture agreement with TMRC to jointly explore and develop a targeted silver property to be selected by TMRC among patented and unpatented mining claims held by Santa Fe Gold within the Black Hawk Mining District in Grant County, New Mexico. Completion of a joint venture agreement is subject to the successful outcome of a multi-phase exploration plan to be undertaken in the near future by TMRC. Under terms of the letter agreement TMRC plans to conduct a district-wide evaluation among the patented and unpatented claims held by Santa Fe Gold consisting of geologic mapping, sampling, trenching, radiometric surveying, geophysics, drilling and/or other methods as warranted. The purpose of the letter agreement was to allow TMRC the ability to enter onto the Companys property, begin incurring the costs associated with the work necessary to secure a bankable feasible study. The parties may then secure the funding needed to develop and mine the 80 acres that TMRC identifies. TMRC will be responsible for mining operations and will receive 51% of the profits as defined in the definitive agreement, when executed. The Company will receive 49% of the profits. TMRC has currently completed its phase two of their field work consisting of geophysical work in the Black Hawk district. As detailed in the TMRC press release on July 28, 2022, analysis of their field data completed to date covers approximate 10% of the area surveyed. Upon completion their field data analysis, it will provide TMRC information to develop a detailed targeted drilling program for phase three of their exploration program.\nWe commenced exploration work on the Jim Crow mine in late 2019. Work to date has consisted of beginning the upgrading of the surface facilities, rehabilitating the shaft, expanding the hoisting capability and underground excavation and mining preparation on three levels. Early in the third quarter of 2020 we commenced initial mining operations in the Jim Crow mine. The Company had our mined ore tested at a nearby smelter that it had used prior to our bankruptcy proceedings and the ore was approved for processing at the smelter. In November the smelter ceased taking all outside ore due to a new certification they were attempting to secure. At that time the Company was currently forced to change its current business plan and look for a favorable mill site to process our mined ore. In January 2020 a purchase option agreement was entered into for a mill site in Duncan, Arizona. The Company the exercised purchase option on the site in November 2021.\nWith three of our mine employees having contacted the COVID-19 virus in the last week of November 2020, we shut the mining operation down and currently the mines and equipment are under a maintenance protocol. With the current COVID -19 situation and the current inability to process the mined ore we anticipate not restarting the mining operation in late 2022, depending on the projected completion of our planned mill operation in Duncan, Arizona.\nAcquired mineral rights are considered tangible assets under ASC 930-805. ASC 930-805 requires that mineral rights be recognized at fair value as of the acquisition date. Mining assets include mineral rights. The payments made under the Billali Mine - Jim Crow Mine\nAgreement are capitalized by the Company and if a revenue stream is attained, of which there can be no assurance, the capitalized balance will be amortized to expenses based on the estimated site production life by our qualified person.\nNOTE 5 - FINANCE LEASE RIGHT-OF-USE ASSET\nThe right-of-use property (ROU) consists of the following at June 30, 2022 and 2021, as follows:\nJune 30,\nROU asset\n$\n-\n$\n44,505\nLess: accumulated amortization\n-\n27,407\nFinancial lease right-of-use asset, net\n$\n-\n$\n17,098\nAmortization expense on the ROU asset for the years ended June 30, 2022 and 2021 was $6,090 and $18,271, respectively. At the end of the right-to-use lease, the purchase option was exercised and the balance of the ROU asset of $11,008 was added to the acquired mill property basis.\nNOTE 6 - ACCRUED LIABILITIES\nAccrued liabilities consist of the following at June 30, 2022 and 2021 are as follows:\nJune 30,\nFranchise taxes\n$\n3,920\n$\n3,920\nAudit fees\n40,000\n55,600\nMerger costs, net\n269,986\n269,986\nPayroll burden\n414,404\n247,121\nVacation pay\n36,014\n51,785\nAccrued director fees\n675,000\n375,000\nOther\n144,500\n95,000\nCommodity supply agreement (See NOTE 11 )\n5,255,827\n5,056,091\nInterest\n5,545,439\n4,875,853\nTotal\n$\n12,385,090\n$\n11,030,356\nNOTE 7 - FINANCE LEASE OBLIGATION\nWe signed a finance lease purchase agreement effective January 1, 2020, for the acquisition of a non-mineral property for our processing plant site to house our crusher and related future milling operations.\nThe determination of whether an arrangement contains a lease and the classification of a lease, if applicable, is made at lease commencement, at which time the Company also measures and recognizes an right of use (ROU) asset, representing the Companys right to use the underlying asset, and a lease liability, representing the Companys obligation to make lease payments under the terms of the arrangement. For the purposes of recognizing ROU assets and lease liabilities associated with the Companys leases, the Company has elected the practical expedient to not recognize a ROU asset or lease liability for short-term leases, which are leases with a term of twelve months or less. The lease term is defined as the noncancelable portion of the lease term plus any periods covered by an option to extend the lease if it is reasonably certain that the option will be exercised.\nROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. The rates implicit within the Company's lease is not determinable. The determination of the Companys incremental borrowing rate requires judgment. The incremental borrowing rate is determined at lease commencement and the Company determined its incremental borrowing rate on the finance lease to be 12%. At the lease inception, the Company recorded a ROU asset of $44,505 and a corresponding lease liability of $29,505. The asset value is comprised of the present value of the lease payments at inception of $29,505 and the payment of the purchase option price of $15,000 at the lease inception for a total of $44,505.\nThe components of lease expense and supplemental cash flow information related to lease for the period are as follows:\nYear ended\nJune 30, 2022\nYear ended\nJune 30, 2021\nLease Cost:\nFinancing lease cost included in exploration and mine costs for fiscal 2022 and 2021 is $6,090 and $18,272 and $97 and $1,933 in interest expense in Companys audited consolidated statement of operations, respectively\n$ 6,187\n$ 20,205\nCash paid for amounts included in the measurement of lease liabilities for the year ended June 30, 2022 and 2021\n$ 4,500\n$ 18,000\nOther Information:\nRemaining lease term - operating lease (in years)\n-\n0.333\nDiscount rate - financing lease\n12.0%\n12.0%\nEffective rate - financing lease\n13.1%\n13.1%\nAs of\nJune 30, 2022\nAs of\nJune 30, 2021\nFinancing lease:\nRight-of-use asset, net\n$ -\n$ 17,098\nFinancing lease liability - current portion\n$ -\n$ 4,403\nLong-term portion\n-\n-\nTotal operating lease liabilities\n$ -\n$ 4,403\nFinancing\nFinancing\nFiscal Year Ending 6/30:\nLease\nLease\n6,000\n-\n-\nTotal lease payments\n-\n$ 6,000\nLess: Present value discount\n-\n(1,597)\nPresent value of lease liabilities\n-\n$ 4,403\nLease associated costs for fiscal June 30, 2022 and 2021 were $6,187 and $20,205, respectively.\nNOTE 8 - NOTES PAYABLE\nInstallment Sales Note\nOn June 1, 2012, the Company entered into an installment sales contract for $593,657 to purchase certain equipment. The term of the agreement is for 48 months at an interest rate of 5.75%, secured by the equipment. The balance owed on the installment sales contract was $398,793 at June 30, 2022 and 2021, respectively, had accrued interest of $179,409 and $156,479, respectively and interest expense of $22,930, respectively. The Company has been unable to make its monthly payments since November 2013 and has been in default since that time. The installment sales contract is due and in default at June 30, 2022 and 2021. The equipment has been returned to the vendor for sale, and the equipment remains unsold.\nTyhee Merger Agreement\nIn conjunction with the Merger Agreement, Tyhee Gold Corp. (Tyhee) and the Company entered into a Bridge Loan Agreement (Bridge Loan), pursuant to which Tyhee was obligated to advance up to $3 million to the Company in accordance with the terms thereof. Tyhee advanced the Company $1,745,092 under the Bridge Loan as of June 30, 2014. The Bridge Loan bears an annual interest rate of 24%. At this time the Company and Tyhee are in disagreement as to the due date of the Bridge Loan. Tyhee has provided the Company with purported notice of default under the Bridge Loan Agreement. The Company has numerous claims against Tyhee resulting from the Merger Agreement, Tyhees failure to fund the total $3 million under the Bridge Loan and Tyhees allocation of the\nproceeds from the Bridge Loan. The Company recorded merger expenses that are due to Tyhee of $269,986 and was included in accrued liabilities at June 30, 2022 and 2021. This amount is net of a break fee of $300,000 due to the Company from Tyhee. Interest expense for the fiscal years ended June 30, 2022 and 2021 was $418,822, respectively and accrued interest was $3,412,949 and $2,994,127, respectively and the loan balance was $1,745,092 at June 30,2022 and 2021, respectively. Tyhee Gold Corp. is no longer in existence and the Company is in process of having a litigation firm in British Columbia to have the debt judicially extinguished under British Columbia law, where the agreement is governed, and in accordance FASB ASC 405-20-40-1(b) which states that a liability has been extinguished if the debtor is legally released from being the primary obligor under the liability, either judicially or by the creditor.\nAn individual during our fiscal year 2019 loaned the Company $239,750 of which the Company paid back $130,000 through our fiscal year ended June 30, 2021, and in our fiscal year ended June 30, 2021 and received an additional $18,000 loaned to the Company in that current fiscal year. The loan is at an annual interest rate of 6%, has no stated due date and is payable on demand by the lender. Accrued interest on the loan at June 30, 2022 and June 30, 2021 is $29,091 and $24,848, respectively. During the period ended September 30, 2021, the Company made a $10,000 principal payment on the note and reversed the $18,000 unauthorized payment of costs on behalf of the Company. Balance of the loan at June 30, 2022 and June 30, 2021 was $99,750 and $127,750, respectively. Interest expense on the loan for the years ended June 30, 2022 and 2021 is $4,243 and $7,558, respectively.\nA shareholder in April 2022, loaned the Company $100,000 at an annual interest rate of 12% and the note has a six-month maturity. The proceeds were used for working capital requirements. In conjunction with the loan, the Company granted 2,000,000 six-month vested stock options with a strike price of $0.05 per share. Accrued interest on the loan at June 30, 2022 was $2,170 and interest expense on the loan for the year ended June 30, 2022 was $2,170.\nThe following summarizes notes payable:\nJune 30,\nInstallment sales note in 48 monthly installments of $13,874,\nincluding interest through July 16, 2016\n$\n398,793\n$\n398,793\nUnsecured bridge loan notes payable, interest at 2% monthly, payable August 17, 2014, six months after the first advance on the bridge loan\n1,745,092\n1,745,092\nNote payable, interest at 6%\n99,750\n127,750\nNote payable, 12%\n100,000\n-\n$\n2,343,635\n$\n2,271,635\nNOTE 9 - COMPLETION GUARANTEE PAYABLE\nAt June 30, 2012, the Company calculated the completion guarantee payable provided by Amendment 1 under the Gold Stream Agreement with Sandstorm. Based upon the provisions of the Agreement and the related completion guarantee test, incremental financing charges totaling $504,049 were recognized in Other Expenses and accrued at June 30, 2012. These accrued charges, combined with the remaining unaccredited liability totaled $3,359,873 at June 30, 2022 and at June 30, 2021. Interest of $176,393 was expensed during the fiscal years ended June 30, 2022 and 2021, respectively. Accrued interest at June 30, 2022 and June 30, 2021 was $1,763,929 and $1,587,536, respectively.\nNOTE 10 - NON-CURRENT NOTES PAYABLE\nNotes Payable\nDuring the quarter ended December 31, 2021, a shareholder made two secured loans of $200,000 each, with an annual interest rate of 10% and, note maturity dates of two years from the date of the notes. Interest is due and payable on the annual anniversary dates and the principal is due on the maturity date of the notes. The note holder loans are secured by the Duncan, Arizona mill property. Accrued interest on the notes at June 30, 2022 is $26,575. Interest expense on these notes for the year ended June 30, 2022 is $26,575. In conjunction with each note issuance, the Company granted 4,000,000 two-year vested stock options with a strike price of $0.05 per share.\nPaycheck Protection Program Loans\nDuring the quarter ending June 30, 2020, the Company entered into a Promissory Notes (the PPP Notes) with Bank of Oklahoma as the lender (the Lender), pursuant to which the Lender agreed to make the loans to the Company under the Paycheck Protection Program (the \"PPP Loan\") offered by the U.S. Small Business Administration (the SBA) in a principal amount of $224,700 pursuant to Title 1 of the Coronavirus Aid, Relief and Economic Security Act (the CARES Act).\nThe PPP Loan proceeds are available to be used to pay for payroll costs, including salaries, other similar compensation, group health care benefits, and paid leaves; rent; utilities; and interest on certain other outstanding debt. The amount that will be forgiven will be calculated in part with reference to the Companys full time headcount during the twenty-four week covered period, as adjusted for current regulation updates, following the funding of the PPP Loan.\nDuring our fiscal year 2021 our PPP loans received in 2020, and the accrued interest thereon were forgiven in the amount of $226,367 and a gain on debt forgiveness was recognized.\nDuring our fiscal year 2022 we received two loans in the second round of the PPP loan program in the principal amount of $109,520.\nThe PPP Loan proceeds are available to be used to pay for payroll costs, including salaries, and similar compensation, group health care benefits, and paid leaves; rent; utilities; and interest on certain other outstanding debt. Any amount that will be forgiven will be calculated in part with reference to the Companys fulltime headcount during the twenty-four-week covered period. Under the new regulations for the second draw, at least 60% of the proceeds must be spent on payroll costs.\nThe interest rate on the PPP Note is a fixed rate of 1% per annum. To the extent that the amounts owed under the PPP Loans, or a portion of them, are not forgiven, the Company will be required to make principal and interest payments. Currently, the deferral period for payments of principal and interest is 10 months from the end of the covered period. A loan forgiveness application must be submitted to the lender within the 10 months after the 24-week covered period. The Company will not have to begin principal and interest payments before the date on which the SBA remits the loan forgiveness amount to the lender.\nUnder current regulations, any monthly installments would begin approximately seventeen months from March 20, 2021. The PPP Notes have a maturity dates of five years from their effective note date. The PPP Note includes events of default. Upon the occurrence of an event of default, the Lender will have the right to exercise remedies against the Company, including the right to require immediate payment of all amounts due under the PPP Note.\nThe following summarizes non-current debt at June 30, 2022 and 2021:\nJune 30,\nNotes payable\n$\n400,000\n$\n-\nLoans payable to bank under the Paycheck Protection Program\n109,520\n109,520\nAccrued interest on Paycheck Protection Program Loans\n1,266\n$\n510,786\n$\n109,883\nNOTE 11- CONTINGENCIES AND COMMITMENTS\nCommodity Supply Agreement\nIn December 2009, the Company entered into a definitive gold stream agreement (the Gold Stream Agreement) with Sandstorm to deliver a portion of the life-of-mine gold production (excluding all silver production) from the Companys Summit silver-gold mine. Under the agreement, the Company received advances of $4,000,000 as an upfront deposit, plus continues to receive future ongoing payments equal to the lesser of: $400 per ounce or the prevailing market price, (the Fixed Price) for each ounce of gold delivered pursuant to the Gold Stream Agreement for the life of the mine. The Company purchases and delivers refined gold in order to satisfy the requirements of the Gold Stream Agreement and receives the Fixed Price per ounce in cash from Sandstorm. The difference between the prevailing market price and the Fixed Price per ounce for gold delivered is credited against the upfront deposit of $4,000,000 until the obligation is reduced to zero. Future ongoing payments for gold deliveries will continue at the Fixed Price per ounce with no additional credits or advances to be received from Sandstorm. In certain circumstances, including failure to meet minimum production rates, interruption in production due to permitting issues and customary events of default, the agreement may be terminated. In such event, the Company may be required to return to Sandstorm any remaining unaccredited balance of the original $4,000,000 upfront deposit. See NOTE 9 - COMPLETION GUARANTEE PAYABLE. Gold production subject to the agreement includes 50% of the first 10,000 ounces of gold produced, and 22% of the gold thereafter. The net cost of delivering refined gold along with other related transactional costs corresponding to the Gold Stream Agreement are recorded in Other Expenses as financing costs - commodity supply agreements.\nUnder the Gold Stream Agreement, the Company has a recorded obligation at June 30, 2021, 2020 (Restated) and 2019 (Restated), of 3,709 ounces of undelivered gold valued at approximately $5.06, $5.07 and $3.74 million, respectively, presented in accrued liabilities\non the balance sheet, net of the Fixed Price of $400 per ounce to be received upon delivery. The Summit silver-gold mine property referred to in this Gold Stream Agreement was sold in the 363 Asset Sale as of asset transfer on February 26, 2016.\nMineral Property Rights\nThe Company determined the agreement on the Billali and Jim Crow/Imperial mines is a Right Of Use (ROU) asset lease and is cancellable at any time by the Company. There are no interest charges provided for in the Agreement.\nCosts of exploration, mine development, and carrying and retaining unproven mineral lease properties are expensed as incurred. The Company expenses all mineral exploration and development costs as incurred as we are in the exploration stage. If the Company identifies mineral reserves under Regulation S-K 1300, in its investigation of its properties and in the opinion of the qualified person, can be the basis of an economically viable project, we would enter the development stage and capitalize future costs until production is established. The Company will capitalize the payments under the Agreement as made. At the time the Company has a revenue stream from this project, the Company will amortize the capitalized payment balance each quarter. Companies that have mineral reserves under Regulation S-K 1300 typically capitalize these costs, and subsequently depreciate or amortize them on a units-of-production basis as reserves are mined. Unlike these other companies, on our properties that have no reserves we will depreciate or amortize any capitalized costs based on the most appropriate amortization method, which includes straight-line or units-of-production method over the estimated life of the mine, as determined by our qualified person. As we have no reliable information to compute a units of production methodology, we will amortize our capitalized costs on a straight-line basis over the estimated remaining mine life as determined by our qualified person.\nBased upon the terms of the ROU agreement, the Company does not have ownership of the properties and the ROU agreement provides for ownership transfer upon completion of all payments. The Company has the right to terminate the agreement at any time by written notice to the seller. Upon such termination by the Company, all right, title and interest of the Company under the ROU agreement will terminate with respect to the mines and water lease. The Company would be relieved of all further obligations as set forth in the ROU agreement except for any obligations which accrued prior to such termination. Upon such termination, the Company may not make any claims as to the right to reimbursement, set-off, other payment or other return of value paid by the Company for any improvements and any capitalized cost that has not been amortized on the Companys books, would be written off to expense.\nAs of June 30, 2022, the Company has not established mineral reserves on any of our exploration projects; therefore, all exploration costs are being expensed. In our current fiscal year of operation ended June 30, 2022, we capitalized payments of $300,000 under the Agreement.\nIt should also be noted, that the Company may never exit the exploration stage company status due to the costs of determining mineral reserves under regulation S-K 1300.\nPayments under Amendment Five of the Agreement on the Billali and Jim Crow/Imperial mines are estimated as follows:\nFiscal years ending June 30:\nPrior year payments to 6/30/2020\n$\n500,000\n300,000\n300,000\n600,000\n1,475,000\n2,100,000\nThereafter\n4,725,000\nTotal lease payments\n$\n10,000,000\nOffice and Real Property Leases\nThe Companys work office consists of a single room located in Albuquerque, NM, at the home of the former CFO for a monthly rent of $550 until the Company is required to lease increased office space due to additional personnel requirements. Rental expense paid to Mr. Mueller was $6,600 for fiscal years ended June 30, 2022 and 2021, respectively.\nTitle to Mineral Properties\nAlthough the Company has taken steps, consistent with industry standards, to verify title to mineral properties in which it has an interest, these procedures do not guarantee the Companys title. Such properties may be subject to prior agreements or transfers and title may be affected by undetected defects.\nNOTE 12 - STOCKHOLDERS DEFICIT\nThe Companys Common Stock was Deregistered and Trading was Halted\nIn July of 2020, the Company received notice from the SEC that it was seeking to deregister the Companys common stock pursuant to Section 12(j), based on the Companys failure to file periodic reports with the Commission and otherwise provide current information to the market. This failure was based in large part from the need to restate its financial statements and the need to find and engage a PCAOB auditor who was willing to conduct and provide the required audits amid the SEC and DOJs investigations. Although we were able to secure a qualified auditor, we were not able to make our filings quickly enough and by the time they were completed, the Commission had already sent a notice under Section 12(k). The Commission takes a hardline position in these situations such that once they have instituted deregistration proceedings, the only options available to the Company were to litigate or settle and consent to the deregistration of the Companys common stock. Historically, registrants have not been successful in litigating with the Commission over Section 12(j) matters and therefore the Company determined that the best course of action was to consent to deregistration of its common stock and then file a new registration statement on Form 10-12G. On December 17, 2020, the SEC order suspending trading went into effect. At this time, the Company has signed a settlement agreement with the SEC with respect to the registration of its common stock in response to the Commissions institution of deregistration proceedings under Section 12(j), it is re-registering the same under Section 12(g) by way of filing a Form 10-12G.\nThe Company filed the Form 10-12G Registration Statement with the SEC and on August 4, 2022 the SEC declared the Form 10-12G Registration Statement effective. The Company is currently preparing the application to the Over-The-Counter Markets Group (the OTC) to trade on OTC-QB tier. Upon going through OTC approval process and receiving our application approval, it will be sent to the Financial Industry Regulatory Authority ( FINRA) for their review and approval. The Companys complete and current effective Form 10-12G meets the information requirements required by Form 15c2-11. Until FINRA has accepted our filing and we have provided any required addition requested information and documentation required, there will not be a publicly quoted market for our stock. Upon approval by FINRA, they will issue our trading symbol and we will be relisted for trading. Any delay or failure in satisfying FINRAs requirements would result in our shareholders not having a public market to sell their shares. Further, it would make it more difficult for the Company to obtain the financing it requires.\nCommon Stock Transactions\nFiscal year ended June 30, 2022, the Company:\n(i)\nAccepted subscriptions for an aggregate of 8,290,000 shares of restricted common stock s from accredited investors for cash proceeds of $414,500.\nFiscal year ended June 30, 2021:\n(i)\nIssued an aggregate of 944,165 shares of restricted common stock for consulting services at a value of $59,833 on the dates of issuances;\n(ii)\nAccepted subscriptions for an aggregate of 15,366,668 shares of restricted common stock from accredited investors for cash proceeds of $929,000; and\n(iii)\nIssued 750,000 shares of restricted common stock for bonus compensation at a value of $45,000 on the date of issuance.\nWarrants\nDuring the fiscal year ended June 30, 2022, the Company issued 3,145,000 three-year warrants at an average strike price of $0.05 as part of private placements to accredited investors. The Black-Scholes fair value of the issued warrants is $132,115.\nDuring the fiscal year ended June 30, 2021, the Company issued 7,783,334 three-year warrants at an average strike price of $0.062 as part of private placements to accredited investors. The Black-Scholes fair value of the issued warrants is $360,237.\nStock Options\nDuring the fiscal year ended June 30, 2022, the Company granted 8,000,000 two-year options at strike price of $0.05 and granted 2,000,000 one-half year options at a strike price of $0.05. The Black-Scholes fair value of the issued options was $269,661.\nDuring our fiscal years ended June 30, 2021 there was no option activity.\nThe Black-Scholes option-pricing model was used to estimate the fair value of the options and warrants with the following weighted-average assumptions for the fiscal years ending June 30, 2022 and 2021 were as follows:\nJune 30,\nJune 30,\nRisk-free interest rate\n0.30% - 2.93\n%\n0.11% - 0.22\n%\nExpected volatility\n0% -119.78\n%\n123.545% -138.01\n%\nExpected life (years)\n2-3\n3-5\nExpected dividend yield\n%\n%\nStock option and warrant activity for the year ended June 30, 2022 are as follows:\nOptions\nWarrants\nNumber of\nExercise\nNumber of\nExercise\nShares\nPrice\nShares\nPrice\nOutstanding at June 30, 2020\n30,000,000\n$\n0.05\n5,082,149\n$\n0.05\nGranted\n---\n---\n7,783,334\n$\n0.062\nCancelled\n---\n---\n---\n---\nExpired\n---\n$\n---\n---\n$\n---\nExercised\n---\n---\n---\n---\nOutstanding at June 30, 2021\n30,000,000\n$\n0.05\n12,865,483\n$\n0.058\nGranted\n10,000,000\n$\n0.05\n3,145,000\n$\n0.05\nCanceled\n---\n---\n---\n---\nExpired\n---\n$\n---\n---\n---\nExercised\n---\n---\n---\n---\nOutstanding at June 30, 2022\n40,000,000\n$\n0.05\n16,010,483\n$\n0.056\nStock options and warrants outstanding and exercisable at June 30, 2022, are as follows:\nOutstanding and Exercisable Options\nOutstanding and Exercisable Warrants\nWeighted\nWeighted\nAverage\nAverage\nContractual\nWeighted\nContractual\nWeighted\nExercise\nRemaining\nAverage\nExercise\nRemaining\nAverage\nPrice\nOutstanding\nExercisable\nLife\nExercise\nPrice\nOutstanding\nExercisable\nLife\nExercise\nRange\nNumber\nNumber\n(in Years)\nPrice\nRange\nNumber\nNumber\n(in Years)\nPrice\n$0.05\n30,000,000\n30,000,000\n1.72\n$\n0.05\n9,877,149\n9,879,149\n1.30\n$0.05\n4,000,000\n4,000,000\n1.27\n$\n0.06\n3,833,334\n3,833,334\n0.62\n$0.05\n4,000,000\n4,000,000\n1.40\n$\n0.07\n2,100,000\n2,100,000\n0.51\n$0.05\n2,000,000\n2,000,000\n0.32\n$\n0.15\n200,000\n200,000\n1.80\n40,000,000\n40,000,000\n16,010,483\n16,010,483\nOutstanding Options\n1.56\n$\n0.05\nOutstanding Warrants\n1.04\n$\n0.056\nExercisable Options\n1.56\n$\n0.05\nExercisable Warrants\n1.04\n$\n0.056\nAs of June 30, 2022, the aggregate intrinsic value of all stock options and warrants vested and expected to vest was $488,796 and the aggregate intrinsic value of currently exercisable stock options and warrants was $488,796. The intrinsic value of each option or warrant share is the difference between the fair market value of the common stock and the exercise price of such option or warrant share to the extent it is \"in-the-money\". Aggregate intrinsic value represents the value that would have been received by the holders of in-the-money options had they exercised their options on the last trading day of the quarter and sold the underlying shares at the closing stock price on such day. The intrinsic value calculation is based on the $0.0589 closing stock price of the common stock on December 17, 2020, the day our stock was delisted. The total number of in-the-money options and warrants vested and exercisable as of June 30, 2022 was 56,010,483.\nThe total intrinsic value associated with options exercised during the year fiscal ended June 30, 2022 was $0. Intrinsic value of exercised shares is the total value of such shares on the date of exercise less the cash received from the option or warrant holder to exercise the options.\nThe total grant-date fair value of option and warrant shares vested during the fiscal year ended June 30, 2022 was $401,537.\nNOTE 13 - INCOME TAXES\nThe Company has had no income tax expense or benefit since July 1, 1997, because of operating losses. Deferred tax assets and liabilities are determined based on the estimated future tax effect of differences between the financial statement and tax reporting basis of assets and liabilities, as well as for net operating loss carry forwards, given the provisions of existing tax laws. The Company files income tax returns in the U.S. and state jurisdictions and there are open statutes of limitations for taxing authorities to audit the Companys tax returns for fiscal years ended after June 30, 2016.\nThe approximate income tax benefit is computed by applying the current revised U.S. federal income tax rate of 21% to net income (loss) before taxes for the fiscal years ended June 30, 2020 and prior tax years at the revised tax rate of 21% . New Mexico revised their tax rate to 6.2 % for 2017 and 5.9 % in 2019 and the approximate income tax benefit is computed by applying the current revised New Mexico revised tax rate of 5.9% to net income (loss) before taxes for the fiscal year ended after June 30, 2013.\nThe components of the income tax benefit provision are as follows:\nFiscal Year Ended June 30,\n2021 (Restated)\nTax (benefit) at the federal statutory rate\n$\n(282,861\n)\n$\n(251,748\n)\nState tax (benefit)\n(79,471\n)\n(70,729\n)\nReduction in Federal and/or State tax rates\n1,313,873\n288,776\nDecrease (increase) in valuation allowance\n(951,541\n)\n33,701\nIncome tax expense\n$\n---\n$\n---\nThe components of the deferred tax assets at June 30, 2022 and 2021 are as follows:\nDeferred Tax Asset\nFiscal Year Ended June 30,\n2021 (Restated)\nFederal net operating loss carry forwards\n$\n21,112,513\n$\n22,143,525\nState net operating loss carry forwards\n2,204,335\n2,124,864\nValuation allowance\n(23,316,848\n)\n(24,268,389\n)\nNet deferred tax asset\n$\n---\n$\n---\nIn assessing the realizability of estimated deferred tax assets, the Company considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income. Due to the Companys history of losses, the deferred tax assets are fully offset by a valuation allowance as of June 30, 2022 and 2021.\nAt June 30, 2022, the Company had estimated federal tax basis net operating loss carry forwards for federal income tax purposes of approximately $114.3 million. Under the Tax Cuts and Jobs Act (TCJA) passed on December 22, 2017, provides that net operating losses (NOL) arising in tax years beginning after December 31, 2017, the TCJA limits NOL deduction to 80% of taxable income.\nFor tax years beginning after December 31, 2017, the TCJA eliminated the two-year carryback period but allows for an infinite carryforward.\nFor NOLs generated in tax years beginning prior to December 31, 2017, the prior tax law still applies, and the 80 percent limitation does not apply, and the NOLs can be carried forward for 20 years. The Company has an approximate NOL under the old tax law of $104.96 million. The NOLs under the old tax law expire in varying amounts between 2023 and 2038.\nAt June 30, 2022, the Company had estimated state tax basis NOL carryforwards for state income tax purposes of approximately $36.2 million. Net operating losses for state income tax purposes beginning with our tax year ended in 2014, may be carried forward for nineteen years. These losses expire in varying amounts from 2033 to 2041.\nNOTE 14 - RELATED PARTY TRANSACTIONS\nSince August 2015, the Company has leased a home office space from Mr. Mueller for $550 a month for the corporate administrative office in Albuquerque, NM. Rental expense paid to Mr. Mueller was $6,600 for fiscal years ended June 30, 2022 and 2021.\nSince July 2019, Nataliia Mueller, wife of Mr. Mueller, has been paid an annual wage of $60,000 as an assistant to the current and prior CFO, in the areas of purchasing, payroll and accounts payable.\nMisappropriated Funds and Entry into a Material Definitive Agreement\nA former director and former chief executive officer of the Company, Mr. Thomas H. Laws, entered into a secured promissory note and security agreement in the principal amount of $930,000 in favor of the Company on September 19, 2018, bearing interest at the annual rate of 4% and maturing September 30, 2018 (Secured Promissory Note). The Company requested the former chief executive to execute the Secured Promissory Note and security agreement as a result of the matters discussed below, prior to the completion of the\nspecial committee investigation. The security interests include certain real estate and a Cessna model 182G airplane. The Secured Promissory Note also contains late fee and default provisions under the deeds of trust, Security Agreement and other agreements.\nSubsequent professional costs including legal, auditing, forensic accounting and related filing costs related to this event have been added to the amounts owed by Mr. Laws. At the time of filing this annual report, we have determined costs associated with Mr. Laws action currently aggregates approximately $1,651,263. We have collected $990,632 in cash and property held for sale with an estimated net market value of $25,800 as of the date of filing this annual report.\nAs of the filing of this report, Mr. Laws has plead guilty to various charges brought against him by the U. S. District Attorney for the District of New Mexico, which include the Companys allegations. Mr. Laws is currently has been sentenced on the charges which he plead, to 81 months in prison. Currently he is serving that sentence. The Company attorneys have filed all required documents for future monetary settlements to be determined by the court. In November 2020 the court awarded various Laws properties to the Company and in December 2020 the Company was provided good title, free and clear of any encumbrances to them. Laws residence was levied on pursuant to court order and has been sold by the court and the net proceeds received by the Company in March, 2021. The Company does not anticipate receiving any additional substantial reimbursement of the remaining expenses that were incurred as a result of Laws malfeasance after the sale of the remaining property received from the court.\nTransactions involving related parties cannot be presumed to be carried out on an arm's-length basis, as the requisite conditions of competitive, free-market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arm's-length transactions unless such representations can be substantiated.\nNOTE 15- LEGAL PROCEEDINGS\nAll legal proceedings were stayed with the filing of Chapter 11 bankruptcy.\nBoart Longyear Company v. Lordsburg Mining Company, Case No. D-2-2-CV-2015- 06048, County of Bernalillo, NM; Boart Longyear Company v. Lordsburg Mining Company, Case No. D-721-CV-2015- 00058, County of Sierra, NM; and Boart Longyear Company v. Lordsburg Mining Company, Case No. D-608-CV- 201500165, County of Quintero, NM. There are a series of collection cases by Boart Longyear Company, a company that obtained Utah judgments for equipment delivered to Lordsburg Mining Company in the aggregate amounts of $158,480 and has an interest rate of 5.25% per annum. Accrued interest on the obligation at June 30, 2022 and 2021 was $53,322 and $45,002 respectively. Interest on the obligation for the years ended June 30, 2022 and 2021 was $8,320, respectively for both years.\nWagner Equipment Co. v. Lordsburg Mining Company, Case No. D-2014-02372, County of Bernalillo, NM 28 is a collection case by Wagner equipment, who obtained judgment for equipment delivered to Lordsburg Mining Company in the amount of $115,789 and has a rate of interest of 8.75% per annum. Accrued interest on the obligation at June 30, 2022 and 2021 was $77,994 and $67,862, respectively. Interest on the obligation for the years ended June 30, 2022 and 2021 was $10,132, respectively.\nWith the completion of the bankruptcy in June 2016, all pending legal actions were reinstated and debts at the time of the bankruptcy are currently due and in default, but none of the then existing litigation has to date resulted in subsequent legal proceedings. There can be no assurance that subsequent legal proceedings will not materialize. After the dismissal of the bankruptcy case, the Company had limited assets, but remained liable for all commitments and debts that then were outstanding. Santa Fe Gold Barbados, The Lordsburg Mining Company and AZCO are subsidiaries of the Company with nominal assets and all of their commitments, debts and legal proceedings remain. The bankruptcy court set up a trust fund funded by the activities of the Summit mine (main asset sold in bankruptcy proceedings) for five years from reopening of the mine and the trust funds will be distributed by an independent trustee to certain unsecured creditors of record.\nAs disclosed in the Companys Form 8-K filed on October 1, 2018, a director and former chief executive officer of the Company, Mr. Thomas H. Laws, entered into a secured promissory note and security agreement in the principal amount of $930,000 in favor of the Company on September 19, 2018, bearing interest at the annual rate of 4% and maturing on September 30, 2018 (Secured Promissory Note). The Company requested the former chief executive to execute the Secured Promissory Note and security agreement as a result of the matters discussed below prior to the completion of the special committee investigation. The security interests included certain real estate and a Cessna model 182G airplane. The Secured Promissory Note also contains late fee and default provisions under the deeds of trust, Security Agreement and other agreements.\nSubsequent professional costs including legal, auditing, forensic accounting and related filing costs related to this event have been added to the amounts owed by Mr. Laws. As of the filing of this annual report, we have determined that the costs associated with Mr. Laws\naction currently aggregate to approximately $1,651,263 including legal charges and forensic accounting, of which we have collected $990,632 in cash and property with an estimated net market value of $25,800 as of the date of filing of this annual report.\nAs of the filing of this report, Mr. Laws has plead guilty to various charges brought against him by the U. S. District Attorney for the District of New Mexico, which include the Companys allegations. Mr. Laws is currently has been sentenced on the charges which he plead, to 81 months in prison. Currently he is serving that sentence. The Company attorneys have filed all required documents for future monetary settlements to be determined by the court. In November 2020 the court awarded various Laws properties to the Company and in December 2020 the Company was provided good title, free and clear of any encumbrances to them. Laws residence was levied on pursuant to court order and has been sold by the court and the net proceeds received by the Company in March, 2021. The Company does not anticipate receiving any additional substantial reimbursement of the remaining expenses that were incurred as a result of Laws malfeasance after the sale of the remaining property received from the court.\nIn April 2021, the Company was served with a complaint in the State of Florida by Euro Bentley Advisors, LLC (EBA) for the sum of $120,000 based on the alleged breach of contract between the Company and EBA. The Company has settled this litigation in the amount of $100,000 and has paid $30,000 against this obligation in our quarter ending December 2021 and the remaining $70,000 was paid in February 2022.\nWe are subject from time to time to litigation, claims and suits arising in the ordinary course of business.\nNOTE 16 - SUBSEQUENT EVENTS\nRecent Issuances of Unregistered Securities\nIn the period from July 1, 2022 through October 7, 2022, the Company sold an aggregate of 2,000,000 restricted shares of common stock to stock to the chairman of the board for cash proceeds $100,000.\nIn the period from July 1, 2022 through October 7, 2022, the Company issued 1,000,000 warrants to the chairman of the board that were attached a restricted stock purchase. The warrants were vested at issuance, have a three life and an exercise price of $0.05 per share.\nMiscellaneous Events\nOn August 15, 2022, the Company completed the sale of an office building awarded by the court in the Thomas Laws litigation for net proceeds received of $176,078.\nOn August 4, 2022, the SEC declared the Companys Form 10-12G Registration Statement effective. With our registration effective, the Company is a reporting company required to file its quarterly and annual filings with the SEC. The effectiveness of our registration statement does not permit the trading of our shares. The Company must receive approvals from FINRA and the OTC of all required submitted documentation and upon their approvals, FINRA will issue the Company trading symbol and allow trading to begin on our shares upon approval and admittance to the OTC. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of June 30, 2022. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the companys management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure. We have adopted and maintain disclosure controls and procedures (as defined Rules 13a-15(e) and 15d-15(e) under the Exchange Act) that are designed to provide reasonable assurance that information required to be disclosed in the reports filed under the Exchange Act, such as this Annual Report on Form 10-K, is collected, recorded, processed, summarized and reported within the time\nperiods specified in the rules of the SEC. Our disclosure controls and procedures are also designed to ensure that such information is accumulated and communicated to management to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on the evaluation of our disclosure controls and procedures as of June 30, 2022 our Chief Executive Officer and Chief Financial Officer concluded that, as of such a date, our disclosure controls and procedures were not effective at the reasonable assurance level, due to the material weaknesses in our internal control over financial reporting, as further described below.\nMaterial Weakness\nManagement has previously identified material weaknesses in our internal control over financial reporting relating to lack the of segregation of duties. The Company has not yet retained sufficient staff to segregate various financial functions and multiple levels of review. We will in the future with growth, be required to expend resources hiring and engaging additional accounting staff for the appropriate segregation of various responsibilities for proper internal control purposes. We have determined that these internal control deficiencies may constitute a material weaknesses in our control over financial reporting. A material weakness is a deficiency or combination of deficiencies in our internal control over financial reporting, such that there is a potential possibility that a material misstatement of our annual or quarterly condensed financial statements that would not be prevented or detected on a timely basis.\nCurrent Remediation Plan\nTo assist in preventing reoccurrences of prior problems the Company has experienced, management has developed and is executing a remediation plan to address the previously disclosed material weaknesses that the Company has described within this report. The Chief Executive Officer and Chief Financial Officer are actively engaged in a review process of all corporate disbursements and material Company contracts entered into. The Chief Financial Officer reports all corporate funding to the Chief Executive Office with weekly updates on cash funds, current funding requirements and submittal of any Company commitments.\nThe Chief Financial Officer approves and signs all disbursements and has developed a written review process for quarterly closings for each subsidiary and period accounting transaction cutoff procedures to ensure the material accuracy of financial statements issued by the Company.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting, as defined in Rule 13a-15(f) and 15d-15(f) promulgated under the Exchange Act, during the year ended June 30, 2022, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nInherent Limitations over Internal Controls\nThe Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles (GAAP). While present in our design of internal controls, our internal controls over financial reporting and disclosure are not formally written in detail; however, the operation of many controls are in place and are applied on a consistent basis. Company personnel perform controls standard to: 1) approve all Company expenditures, 2) approve and sign contractual obligations, 3) reconcile bank accounts and other general ledger accounts, and 4) many other similar rudimentary controls applied as best practice.\nHowever, we have concluded that due to the Companys small size and limited personnel available to perform control functions, and the weakness described above, the Company was precluded from applying adequate segregation of duties in financial transactions. The Company has taken steps to assure all original financial documents are received and maintained at the corporate office. The material weaknesses described are common to companies of our similar size and staffing in our industry. We expect these material weakness conditions to continue for the foreseeable future, or until Company growth results in additional personnel to perform segregated financial functions.\nManagement, including the Companys Chief Executive Officer and Chief Financial Officer, does not expect that the Companys internal controls will completely prevent or detect all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of internal controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. Also, any evaluation of the effectiveness of controls in future periods are subject to the risk that those internal controls may become inadequate because of changes in business conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagements Annual Report on Internal Control over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Management conducted an assessment of the effectiveness of the Companys internal control over financial reporting based on the criteria set forth in the 2013 Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on the Companys assessment, management has concluded that its internal control over financial reporting was effective as of June 30, 2022, due to the changes described above at the beginning of the current fiscal year, and provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with GAAP. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following individuals serve as the directors and executive officers of our Company as of the report date hereof:\nName\nPrincipal Occupation\nAge\nDate Elected\nBrian Adair\nDirector\nApril 5, 2018\nChairman of the Board, acting Chief Executive Officer\nJuly 26, 2018\nStephen J. Antol\nChief Financial Officer, Secretary, Director\nJuly 7, 2020\nBrian J. Adair, earned his Bachelors degree in Business Administration from LaRoche College. He then continued his studies at Duquesne University to earn his Masters degree. Brians vision to protecting and preserving personal wealth paved the way to establish Adair Financial Group in 2004, of which he has served as principal since inception. Adair Financial Group is a comprehensive, solutions-driven firm, well known for high standards and business ethics. His clients needs are addressed in a collaborative fashion by using the clients advisory team of financial, legal and tax experts, often representing multiple generations of families. Adair Financial Group can handle any case regardless of the complexity and is unique in that the intellectual property is not reserved for just the ultra-wealthy client. Mr. Adairs financial guidance and expertise is beneficial to the Company in his role as a director. Mr. Adair was nominated to the board by the current directors on April 5, 2018.\nIn 2012, the National Senior Market recognized Brian as a Finalist for Advisor of the Year. In addition, Mr. Adair was recently inducted into the Top of the Table - Million Dollar Round Table organization. This elite industry group recognizes top financial services professionals. His designation as the Top of the Table is only awarded to the top 1% of the top 1% of financial professionals - internationally.\nStephen J. Antol, has consulted with the Company since July 2005, prepared the federal and state income tax returns and assisted from in our financial closings and reporting. Mr. Antol, previously served as Chief Financial Officer from November 2004 to May 2007 and from April 2009 until current, for a small reporting precious metals company. For the period May 2007 to May 2009, and from late 1992 through November 2004, Mr. Antol rendered services as a consultant chief financial officer for a number of small and medium-size businesses, public and private companies requiring technical expertise on a limited or recurring basis. From 1990 to 1992, Mr. Antol served as Chief Financial Officer of Lou Register Furniture, a fine furniture retailer located in Phoenix, Arizona. From 1987 to 1990, Mr. Antol served as Director of Finance for F.S. Inc. (dba Audio Express and Country House Furniture), a retailer of furniture and stereo equipment in four southwestern states. From 1975 to 1987, Mr. Antol worked for Giant Industries, Inc., an independent refiner and marketer of petroleum products, in such capacities as Corporate Controller and Corporate Treasurer. Mr. Antol also has six years audit and tax experience with two major certified public accounting firms in Phoenix, Arizona. Mr. Antol received a Bachelor of Arts degree from Michigan State University in 1968, and became a licensed Certified Public Accountant in 1970 after meeting a two year resident requirement. He no longer practices as a licensed CPA. Mr. Antol was appointed a director by the Board on July 7, 2020.\nBoard members are elected to the board by the shareholders at the annual shareholders meeting or a new board member may be nominated to the board by current board members and are confirmed to the board by the shareholders at the next annual shareholder meeting. All board members at that time were confirmed at the last annual shareholder meeting in January 2019. Board members remain on the board until they retire from the board or are voted off by the shareholders.\nBoard Meetings\nDuring fiscal year ended 2022, our board met as required by operational activities and took action by unanimous consent on all matters acted on. All meetings were held telephonically and all directors attended all of the meetings.\nAs the Company is small and with limited directors, we do not maintain nominating or corporate governance committee at this time. The audit committee is served by Mr. Brian Adair. As the Company grows and our related board is expanded, it is the intent appoint committee chairpersons to the various committees.\nCompliance with Section 16(a) of The Securities Exchange Act of 1934\nBased solely on our review of the SEC website, we believe that, during the fiscal year ended June 30, 2022, our officers, directors and greater than ten percent beneficial owners did not comply with all applicable filing requirements as the Companys stock was suspended by the SEC on December 12, 2020.\nCode of Business Conduct\nOur board has adopted a code of business conduct that is applicable to all members of our board, our executive officers and our employees. We have posted our code of business conduct on our website at www.santafegoldcorp.com.\nCode of Ethics\nEffective June 2006, we adopted a Code of Ethics that was filed as an exhibit to our Annual Report on Form 10-KSB for the year ended June 30, 2006. The code summarizes the legal, ethical and regulatory standards that we must follow. Compliance with this code and high standards of business conduct is mandatory for each of our officers. As adopted, our Code of Ethics sets forth written standards that are designed to deter wrongdoing and to promote:\n1) honest and ethical conduct, including the ethical handling of actual or apparent conflicts of interest between personal and professional relationships;\n2) compliance with applicable governmental laws, rules and regulations;\n3) the prompt internal reporting of violations of the Code of Ethics to an appropriate person or persons identified in the Code of Ethics; and\n4) accountability for adherence to the Code of Ethics.\nWe will provide a copy of the Code of Ethics to any person without charge, upon request. Requests can be sent to: Santa Fe Gold Corporation, P.O. Box 25201, Albuquerque, NM 87125. ITEM 11. EXECUTIVE AND DIRECTOR COMPENSATION\nSummary Compensation Table\nThe following table summarizes the compensation awarded to, earned by or paid during the last two fiscal years to our principal executive officers and chief financial officer.\nName and Principal Position\nYear\nSalary ($)\nBonus ($)\nStock Awards ($)\nNon-Equity Incentive Plan Compensation ($)\nAll Other Compensation ($)\nTotal ($)\nBrian Adair, Acting CEO\n300,000\n-\n-\n-\n-\n300,000\nBoard Chairman\n300,000\n-\n-\n-\n-\n300,000\nSteve Antol\n150,000\n-\n-\n-\n-\n150,000\nCFO\n150,000\n-\n-\n-\n-\n150,000\nEmployment Agreements\nEffective July 7, 2020, the Company retained a new Chief Financial Officer and the prior Chief Financial Officer was reassigned to oversee all mining operations as they come on line in our fiscal 2021-2023 years. Both parties signed a one-year employment agreement with the Company, with automatic successive one-year renewals provided that neither party has provided notice of termination prior to 30 days from the end of such applicable term. Both employment agreements are in effect at the time of filing this Form 10-K.\nOutstanding Equity Awards as of June 30, 2022\nThe following table summarizes the outstanding equity awards as of June 30, 2022, for our chief executive officer and director:\nOutstanding Equity Awards as of June 30, 2022\nName\nNumber of Securities Underlying Unexercised Options Exercisable\nNumber of Securities Underlying Unexercised Options Exercisable\nOption Exercise Price\nOption Expiration Date\nBrian Adair\n15,000,000\n-\n$\n0.05\n3/20/2024\nCompensation of Directors\nThe Company has not paid any compensation to its directors during the last two fiscal years.\nCompensation Committee\nThe Company does not maintain a compensation committee and all compensation for the executive officers and any consultant is determined by the board of directors. The Company does not maintain any processes or procedures for the consideration and determination of compensation and currently all compensation is approved by the board of directors.\nEmployment and Change in Control Agreements\nIn May 2016, we entered into a change of control agreement with Frank Mueller, our chief financial officer. The change of control agreement provides that if there is a change of control of the Company (including a change in the composition of the board of directors) and the individual leaves the employment of the Company, for reason other than discharge for cause, death, or disability, within six months after such change of control, the employee shall receive a lump sum cash payment of 200% of the base salary in effect at the time of change of control. In addition, the employee will continue to be covered by our medical, health, life and dental plans for 24 months after such cessation of employment.\nThe Company leases a home office space from Mr. Mueller for $500 a month, plus a $50 per month cell phone reimbursement, which office currently serves as the corporate administrative office in Albuquerque, NM. The Company employs Nataliia Mueller, wife of Mr. Mueller, as an assistant to the prior and current Chief Financial Officer in the areas of purchasing, accounts payable and payroll. Mrs. Mueller salary for fiscal years 2022 and 2021 was $60,000, respectively. ITEM 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of October 7, 2022, certain information regarding beneficial ownership of our capital stock according to the information supplied to us, that were beneficially owned by (i) each person known by the Company to be the beneficial owner of more than 5% of each class of the Companys outstanding voting stock, (ii) each director, (iii) each named executive officer identified in the Summary Compensation Table, and (iv) all named executive officers and directors as a group. Except as otherwise indicated, the persons named in the table have sole voting and dispositive power with respect to all shares beneficially owned, subject to community property laws where applicable. The address of our directors and executive officers is corporate address.\nCommon Stock\nName and Address of Beneficial Owner\nShares\n% of Class (1)\n5% Stockholders\nBoonyin Investments\nNew Australia 2000\n69,936,590\n15.85%\nMichael Musulin (2)\nScottsdale, AZ\n42,573,504\n9.39%\nDirectors and Executive Officers\nBrian Adair (3)\n81,914,525\n16.56%\nStephen J. Antol\n2,900,000\n0.70%\nCurrent officers and directors as a group (2 persons)\n84,814.525\n17.07%\n______________\n*\nLess than 1%\n(1)\nApplicable percentage of ownership is based on 443,308,551 shares of common stock issued and outstanding as of October 7, 2022, together with securities exercisable or convertible into shares of common stock within sixty (60) days of October 7, 2022 for each stockholder. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Shares of common stock subject to options or warrants exercisable or convertible into shares of common stock that are currently exercisable or exercisable within sixty days of that are deemed to be beneficially owned by the person holding such options or warrants for the purpose of computing the percentage of ownership of such person, but are not treated as outstanding for the purpose of computing the percentage ownership of any other person.\n(2)\nIncludes 1,500,000 shares in Mr. Musulins spouses name, 2,500,000 shares issuable upon exercise of warrants and 10,000,000 shares issuable upon exercise of options, both that are currently exercisable within sixty days following October 7, 2022.\n(3)\nMr. Adair is Chairman of the Board, Audit Committee Chairman and acting Chief Executive Officer of the Company. Includes 1,000,000 shares in Mr. Adairs spouses name, 5,701,667 shares issuable upon exercise of warrants, 500,000 shares issuable upon exercise of warrants in the spouses name and 30,000,000 shares issuable upon exercise of options, all that are currently exercisable within sixty days following October 7, 2022.\nITEM 13CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nIn March 2019, the Company issued to each of Mr. Adair and Mr. Mueller a 5-year warrant to purchase 15 million shares of Company common stock at an exercise price of $0.05 per share.\nAdair purchased 4,833,334 shares of restricted common stock in fiscal 2021 for $260,000 and purchased 5,070,000 shares of restricted common stock in fiscal 2022 for $253,500.\nITEM 14PRINCIPAL ACCOUNTING FEES AND SERVICE\nThe following table discloses the fees approximate fees for professional services provided by TAAD, LLP for the fiscal years ended June 30, 2022 and 2021:\nJune 30,\nAudit and quarterly reports fees\n$ 89,145\n$ 74,714\nTax fees\n-\n-\nAll other fees\n-\n-\n$ 89,145\n$ 74,714\n(1)\nIncludes services rendered for audit of the Companys consolidated financial statements, review of quarterly financial information, and assistance and issuance of consents associated with SEC filings.\n(2)\nRelates to services rendered for tax advice and compliance services.\nPART IV\nITEM 15.\nEXHIBITS, FINANCIAL STATEMENT AND SCHEDULES\nEXHIBIT INDEX\nItem 16. Exhibits\nThe following exhibits are attached hereto or are incorporated by reference:\nExhibit No.\nDescription\n3.1\nCertificate of Incorporation dated August 8, 1991, incorporated by reference to Exhibit 3.1 to the Registration Statement on Form 10-12g (File No. 000-20430)\n3.2\nCertificate of Amendment of Certificate of Incorporation dated December 5, 1991, incorporated by reference to Exhibit 3.2 to the Registration Statement on Form 10-12g (File No. 000-20430 )\n3.3\nCertificate of Amendment of Certificate of Incorporation dated June 6, 2011(1)\n3.4\nCertificate of Amendment of Certificate of Incorporation dated January 23, 2019, incorporated by reference to Exhibit 3.1 of the Form 8-K filed with the SEC on January 16, 2019\n3.5\nAmended Bylaws incorporated by reference to Exhibit 3.3 to the Registration Statement on Form S-4 (File No. 33-45162)\n3.6\nForm 10-12G Registration Statement filed on June 4, 2022 and declared effect by the Securities and Exchange Commission on August 4, 2022 (File No. 000-20430)\n4.1\nForm of Common Stock Certificate, incorporated by reference to Exhibit 4.1 of our Form 10-K for the period ended August 31, 2009 filed with the SEC on February 8, 2011\n10.1\nPurchase Agreement dated January 04, 2019 by and between Mineral Acquisitions, LLC, Richard Billingsley and Leslie Billingsley, incorporated by reference to Exhibit 10.1 of the Form 8-K filed with the SEC on January 4, 2019\n10.2\nPurchase Agreement dated August 18, 2017, as subsequently amended, by and between Santa Fe Acquisition, LLC, Bullards Peak Corporation and Black Hawk Consolidated Mines Company(1)\n10.3\nDaniel E. Gorski consulting agreement dated November 2018(1)\n10.4\nChange of Control Agreement for Frank Mueller(1)\n10.5\nVerbal employment agreement for Frank Mueller(1)\n10.6\nWritten employment agreement Frank Mueller(1)\n10.7\nWritten chief financial officer consulting contract(1)\n14.1\nCode of Ethics for CEO and Senior Financial Officers dated June 15, 2006, incorporated by reference to Exhibit 14.1 of the Form 10-K filed with the SEC on February 16, 2007\n21.1\nList of subsidiaries(1)\n31.1\nCertification of Principal Executive Officer and Chief Executive Officer pursuant to Rule 13a-14(a)/15d-14(a)(1)\n31.2\nCertification of Principal Executive Officer and Chief Financial Officer pursuant to Rule 13a-14(a)/15d-14(a)(1)\n32.1\nCertification of Principal Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350(1)\n101.INS(2)\nXBRL Instance Document\n101.SCH(2)\nXBRL Taxonomy Extension - Schema\n101.CAL(2)\nXBRL Taxonomy Extension - Calculations\n101.DEF(2)\nXBRL Taxonomy Extension - Definitions\n101.LAB(2)\nXBRL Taxonomy Extension - Labels\n101.PRE(2)\nXBRL Taxonomy Extension - Presentations\nManagement contract or compensatory plan or arrangement.\n(1)Filed herewith.\n(2)Submitted Electronically Herewith. Attached as Exhibit 101 to this report are the following formatted in XBRL (Extensible Business Reporting Language)\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSANTA FE GOLD CORPORATION\nDate: October 13, 2022\nBy:\n/s/ Brian Adair\nBrian Adair\nChief Executive Officer and Director\n(Principal Executive Officer)\nDate: October 13, 2022\nBy:\n/s/ Stephen J. Antol\nStephen J. Antol\nChief Financial Officer, Secretary and Director\n( (Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Brian Adair\nChief Executive Officer and Director\nOctober 13, 2022\nBrian Adair\n(Principal Executive Officer)\n/s/ Stephen J. Antol\nChief Financial Officer, Secretary and Director\nOctober 13, 2022\nStephen J. Antol\n(Principal Financial and Accounting Officer)   ITEM 15.\nEXHIBITS, FINANCIAL STATEMENT AND SCHEDULES\nEXHIBIT INDEX\nItem 16. Exhibits\nThe following exhibits are attached hereto or are incorporated by reference:\nExhibit No.\nDescription\n3.1\nCertificate of Incorporation dated August 8, 1991, incorporated by reference to Exhibit 3.1 to the Registration Statement on Form 10-12g (File No. 000-20430)\n3.2\nCertificate of Amendment of Certificate of Incorporation dated December 5, 1991, incorporated by reference to Exhibit 3.2 to the Registration Statement on Form 10-12g (File No. 000-20430 )\n3.3\nCertificate of Amendment of Certificate of Incorporation dated June 6, 2011(1)\n3.4\nCertificate of Amendment of Certificate of Incorporation dated January 23, 2019, incorporated by reference to Exhibit 3.1 of the Form 8-K filed with the SEC on January 16, 2019\n3.5\nAmended Bylaws incorporated by reference to Exhibit 3.3 to the Registration Statement on Form S-4 (File No. 33-45162)\n3.6\nForm 10-12G Registration Statement filed on June 4, 2022 and declared effect by the Securities and Exchange Commission on August 4, 2022 (File No. 000-20430)\n4.1\nForm of Common Stock Certificate, incorporated by reference to Exhibit 4.1 of our Form 10-K for the period ended August 31, 2009 filed with the SEC on February 8, 2011\n10.1\nPurchase Agreement dated January 04, 2019 by and between Mineral Acquisitions, LLC, Richard Billingsley and Leslie Billingsley, incorporated by reference to Exhibit 10.1 of the Form 8-K filed with the SEC on January 4, 2019\n10.2\nPurchase Agreement dated August 18, 2017, as subsequently amended, by and between Santa Fe Acquisition, LLC, Bullards Peak Corporation and Black Hawk Consolidated Mines Company(1)\n10.3\nDaniel E. Gorski consulting agreement dated November 2018(1)\n10.4\nChange of Control Agreement for Frank Mueller(1)\n10.5\nVerbal employment agreement for Frank Mueller(1)\n10.6\nWritten employment agreement Frank Mueller(1)\n10.7\nWritten chief financial officer consulting contract(1)\n14.1\nCode of Ethics for CEO and Senior Financial Officers dated June 15, 2006, incorporated by reference to Exhibit 14.1 of the Form 10-K filed with the SEC on February 16, 2007\n21.1\nList of subsidiaries(1)\n31.1\nCertification of Principal Executive Officer and Chief Executive Officer pursuant to Rule 13a-14(a)/15d-14(a)(1)\n31.2\nCertification of Principal Executive Officer and Chief Financial Officer pursuant to Rule 13a-14(a)/15d-14(a)(1)\n32.1\nCertification of Principal Executive Officer and Chief Financial Officer pursuant to 18 U.S.C. Section 1350(1)\n101.INS(2)\nXBRL Instance Document\n101.SCH(2)\nXBRL Taxonomy Extension - Schema\n101.CAL(2)\nXBRL Taxonomy Extension - Calculations\n101.DEF(2)\nXBRL Taxonomy Extension - Definitions\n101.LAB(2)\nXBRL Taxonomy Extension - Labels\n101.PRE(2)\nXBRL Taxonomy Extension - Presentations\nManagement contract or compensatory plan or arrangement.\n(1)Filed herewith.\n(2)Submitted Electronically Herewith. Attached as Exhibit 101 to this report are the following formatted in XBRL (Extensible Business Reporting Language)\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSANTA FE GOLD CORPORATION\nDate: October 13, 2022\nBy:\n/s/ Brian Adair\nBrian Adair\nChief Executive Officer and Director\n(Principal Executive Officer)\nDate: October 13, 2022\nBy:\n/s/ Stephen J. Antol\nStephen J. Antol\nChief Financial Officer, Secretary and Director\n( (Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Brian Adair\nChief Executive Officer and Director\nOctober 13, 2022\nBrian Adair\n(Principal Executive Officer)\n/s/ Stephen J. Antol\nChief Financial Officer, Secretary and Director\nOctober 13, 2022\nStephen J. Antol\n(Principal Financial and Accounting Officer)"
}