{
    "cik": "862668",
    "company": "ESCALON MEDICAL CORP",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "3845",
    "state_of_inc": "PA",
    "state_location": "PA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/862668/0000862668-23-000022-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/862668/000086266823000022/esmc-20230630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/862668/0000862668-23-000022.txt",
    "filename": "862668_10K_2023_0000862668-23-000022.htm",
    "content": "ITEM 1. BUSINESS\nCompany Overview\nEscalon Medical Corp. (\"Escalon\" or \"Company\") is a Pennsylvania corporation initially incorporated in California in 1987, and reincorporated in Pennsylvania in November 2001. Within this document, the Company collectively shall mean Escalon, which includes its division called \"Trek\" and its wholly owned subsidiaries: Sonomed, Inc. (Sonomed), Escalon Digital Solutions, Inc. (EMI), and Sonomed IP Holdings, Inc. All intercompany accounts and transactions have been eliminated.\nThe Company operates in the healthcare market, specializing in the development, manufacture, marketing and distribution of medical devices for ophthalmic applications. The Company and its products are subject to regulation and inspection by the United States Food and Drug Administration (the FDA). The FDA and other government authorities requires extensive testing of new products prior to sale and has jurisdiction over the safety, efficacy and manufacture of products, as well as product labeling and marketing.\nA-Scans\nThe A-Scan provides information about the internal structure of the eye by sending a beam of ultrasound along a fixed axis through the eye and displaying the various echoes reflected from the surfaces intersected by the beam. The principal echoes occur at the cornea, both surfaces of the lens and the retina. The system displays the position and magnitudes of the echoes on an electronic display. The A-Scan also includes software for measuring distances within the eye. This information is primarily used to calculate lens power for implants.\nB-Scans\nThe B-Scan is primarily a diagnostic tool that supplies information to physicians where the media within the eye are cloudy or opaque. Whereas physicians normally use light, which cannot pass through such media, the ultrasound beam is capable of passing through the opacity and displaying an image of the internal structures of the eye. Unlike the A-Scan, the B-Scan transducer is not in a fixed position; it swings through a 60 degree sector to provide a two-dimensional image of the eye.\nUBM\nThe UBM is a high frequency/high resolution ultrasound device, designed to provide highly detailed information about the anterior segment of the eye. The UBM is used for glaucoma evaluation, tumor evaluation and differentiation, pre- and post-intraocular lens implantation and corneal refractive surgery. The device allows the surgeons to perform precise measurements within the anterior chamber of the eye.\nPachymeters\nThe pachymeter uses the same principles as the A-Scan, but the system is tailored to measure the thickness of the cornea. Central corneal thickness is used in the calculation of intraocular pressure. Pachymetry is also used by refractive surgeons to screen candidates and help plan surgery.\nIspan Intraocular Gases\nThe Company distributes two intraocular gas products C3F8 and SF6, which are used by vitreoretinal surgeons as a temporary tamponade in detached retina surgery. Under a non-exclusive distribution agreement with AirGas, Inc. (AirGas\"), the Company distributes packages of AirGas gases in canisters containing up to 25 grams of gas. Along with the intraocular gases, the Company manufactures and distributes a patented disposable universal gas kit, which delivers the gas from the canister to the patient.\nSurgical Packs\nThe Company markets disposable surgical packs used in vitreoretinal surgery, including packs which aid surgeons in the process of injecting and extracting silicone oil.\nAXIS Image Management\nThe AXIS Image Management system easily manages ophthalmic diagnostic images via a web browser from any device regardless of modality, device manufacturer or location.\nResearch and Development\nThe development of ultrasound ophthalmic equipment and AXIS Image Management system are performed at the Companys Lake Success, New York facility. Company-sponsored research and development expenditures from operations for the fiscal years ended June 30, 2023 and 2022 were approximately $820,000 and $991,000, respectively.\nManufacturing and Distribution\nThe Company assembles and distributes its ophthalmic surgical products at its 7,440 square foot leased facility in New Berlin, WI. The Company designs, assembles, and services its ophthalmic ultrasound products at its 6,278 square foot leased facility in Lake Success, NY. In addition to performing its own assembly, the Company subcontracts component manufacturing, sterilization, and other services to various qualified vendors.\nThe Company has registered its facilities with the FDA and has attained ISO 13485 certification for its facilities and medical devices. ISO 13485 requires an implemented quality system that applies to product design, manufacture, installation, and servicing. Certification can be obtained only after an audit of a companys quality system by a qualified independent outside auditor and requires regular reexamination. The Company has obtained European Community certification (CE-Mark) for many of its medical devices.\nThe manufacture, testing, and marketing of each of the Companys products entails risk of product liability. The Company carries product liability insurance to cover primary risk.\nGovernmental Regulations\nThe Companys products are subject to stringent ongoing regulation by the FDA and similar health authorities, and if these governmental approvals or clearances of the Companys products are restricted or revoked, the Company could face delays that would impair the Companys ability to generate funds from operations.\nThe Company has received the necessary FDA and other necessary regulations clearances and approvals for all products that the Company currently markets. The FDA and comparable agencies in state and local jurisdictions and in foreign countries impose substantial requirements upon the manufacturing and marketing of pharmaceutical and medical device equipment and related disposables, including the obligation to adhere to the FDAs Good Manufacturing Practice regulations. Compliance with\nthese regulations requires detailed validation of manufacturing and quality control practices, FDA periodic inspections and other procedures. If the FDA finds any deficiencies the FDA may impose restrictions on marketing the specific products until such deficiencies are corrected.\nThe FDA and similar health authorities in foreign countries extensively regulate the Companys activities. The Company must obtain either 510(K) clearances or pre-market approvals and new drug application approvals prior to marketing a product in the United States. Foreign regulation also requires that the Company obtain other approvals from foreign government agencies prior to the sale of products in those countries. Also, the Company may be required to obtain FDA clearance or approval before exporting a product or device that has not received FDA marketing clearance or approval.\nThe Company has received CE approval on several of the Companys products that allows the Company to sell the products in the countries comprising the European Community. CE marking indicates that a product has been assessed by the manufacturer and deemed to meet EU safety, health and environmental protection requirements. In addition to the CE mark, some foreign countries require separate individual foreign regulatory clearances.\nMarketing and Sales\nThe Company's products are sold through independent sales representatives, a network of distributors, and internal sales employees directly to medical institutions, throughout the world.\nService and Support\nThe Company maintains a full-service program for all products sold. The Company provides limited warranties on all products against defects and performance. Product repairs are made at the Company's New York facility for ultrasound products. Service support for AXIS Imaging Management and surgical products are provided remotely.\nPatents, Trademarks and Licenses\nThe pharmaceutical and medical device communities place considerable importance on obtaining patent and trade secret protection for new technologies, products and processes for the purpose of strengthening the Companys position in the market place and protecting the Companys economic interests. The Companys policy is to protect its technology by aggressively obtaining patent protection for substantially all of its developments and products, both in the United States and in selected countries outside the United States. It is the Companys policy to file for patent protection in those foreign countries in which the Company believes such protection is necessary to protect its economic interests. The duration of the Companys patents, trademarks and licenses vary through 2027. The Company has 2 United States patents that cover the Companys technology. The Company believes that the impact of the patents is minimal in that our current products and revenue are driven less by our patents and more by our knowledge and trade secrets.\nThe Company intends to vigorously defend its patents if the need arises.\nCompetition\nThere are numerous direct and indirect competitors of the Company in the United States and abroad. These competitors include ophthalmic-oriented companies that market a broad portfolio of products, including companies that market prescription devices and pharmaceuticals exclusively for ophthalmic indications and integrated companies that market products for ophthalmic and other indications.\nSeveral large companies dominate the ophthalmic market, with the balance of the industry being highly fragmented and comprised of smaller companies ranging from start-up entities to established market players. The ophthalmic market in general is intensely competitive, with each company eager to expand its market share. The Companys strategy is to compete primarily on the basis of technological innovation to which it has proprietary rights. The Company believes, therefore, that its business will depend in large part on protecting its intellectual property through maintaining trade secrets, patents, and other governmental regulations.\nSonomeds principal competitors are Quantel, Inc., and Accutome, Inc.. Sonomed has had a leading presence in the ophthalmic ultrasound industry for over 30 years. Management believes that this has helped Sonomed build a reputation as a long-standing operation that provides a quality product, which has enabled the Company to establish effective distribution coverage throughout the world. Various competitors offering similar products at a lower price could threaten Sonomeds market position. The development of optical technologies for ophthalmic biometrics and imaging may also diminish the Companys market position. This equipment can be used instead of ultrasound equipment in certain applications with some advantage. Such equipment, however, is more expensive.\nTreks competitor for the ISPAN® gases is Alcon Laboratories. Treks competitors for its surgical packs include Alcon Laboratories and Bausch & Lomb. To remain competitive, the Company needs to maintain a low-cost operation. There are numerous other companies that can provide this manufacturing service.\nEMIs principal competitors are Carl Zeiss Meditec Inc. and Topcon Healthcare Solutions. The Company believes it establishes competitive advantage by offering technical innovation, product features, low total cost of ownership, and capable and responsive technical support.\nHuman Capital\nAs of June 30, 2023, the Company employed 38 employees. Of these employees, 20 of the Companys employees are employed in manufacturing, 12 are employed in general and administrative positions, 5 are employed in sales and marketing and 1 is employed in research and development. The Companys employees are not covered by a collective bargaining agreement, and the Company considers its relationship with its employees to be good. ITEM 1A. RISK FACTORS\nIn addition to other information contained in this report on Form 10-K, the following Risk Factors should be considered carefully in evaluating our business. If any of the following risks actually occur, our financial condition and results of operations could be materially and adversely affected.\nFinancial Risks\nDue to the Companys history of operating losses, we have complied these financial statements based on the assumption the Company cannot continue as a going concern.\nOur operations are subject to a number of factors that can affect our operating results and financial condition. Such factors include, but are not limited to: the continuous enhancement of the current products, development of new products; changes in domestic and foreign regulations; ability of manufacture successfully; competition from products manufactured and sold or being developed by other companies; the price of, and demand for, our products and our ability to raise capital to support our operations.\nAs of June 30, 2023, we had an accumulated deficit of $68.4 million, and had incurred historical recurring losses from operations and negative cash flows from operating activities in prior years. For the fiscal year ending June 30, 2023, the Company generated net income from operations of $479,000 and generated cash inflow of $325,000 from operating activities. While the overall trend has been toward profitability, having just one year out of the last five of income, the question is whether the Company will keep the profitability trend and sales growth. These factors raise substantial doubt regarding our ability to continue as a going concern.\nAs a result of above matters, our independent auditors have indicated in their report on our June 30, 2023 financial statements that there is substantial doubt about our ability to continue as a going concern. A \"going concern\" opinion indicates that the financial statements have been prepared assuming we will continue as a going concern and do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets, or the amounts and classification of liabilities that may result if we do not continue as a going concern. Therefore, you should not rely on our consolidated balance sheet as an indication of the amount of proceeds that would be available to satisfy claims of our creditors, and potentially be available for distribution to our stockholders, in the event of liquidation.\nOur continued operations will ultimately depend on the ability to be profitable from our operations and the on-going support of our stockholders and creditors.\nThere are inherent uncertainties involved in estimates, judgments and assumptions used in the preparation of financial statements in accordance with United States GAAP. Any changes in estimates, judgments and assumptions used could have a material adverse effect on the Companys business, financial position and operating results.\nThe consolidated financial statements included in the periodic reports the Company files with the SEC are prepared in accordance with accounting principles generally accepted in the United States of America, or GAAP. The preparation of financial statements in accordance with GAAP involves making estimates, judgments and assumptions that affect reported amounts of assets (including intangible assets), liabilities and inventories, revenues, expenses and income. This includes estimates, judgments and assumptions for assessing the recoverability of the Companys other intangible assets, pursuant to Financial Accounting Standards Board (FASB) issued authoritative guidance. If any estimates, judgments or assumptions change in the future, the Company may be required to record additional expenses or impairment charges. Any resulting expense or impairment loss would be recorded as a charge against the Company's earnings and could have a material adverse impact on the Company's financial condition and operating results. Estimates, judgments and assumptions are inherently subject to change in the future, and any such changes could result in corresponding changes to the amounts of assets (including goodwill and other intangible assets), liabilities, revenues, expenses and income. Any such changes could have a material adverse effect on the Companys financial position and operating results.\nOn an on-going basis, the Company evaluates its estimates, including, among others, those relating to:\nsales returns;\nallowances for doubtful accounts;\ninventories;\nintangible assets;\nright-of-use assets;\nincome and other tax accruals;\ndeferred tax asset valuation allowances;\nsales discounts;\nwarranty obligations;\ncontingencies and litigation.\nThe Company bases its estimates on historical experience and on various other assumptions that the Company believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. The Companys assumptions and estimates may, however, prove to have been incorrect and the Companys actual results may differ from these estimates under different assumptions or conditions. While the Company believes the assumptions and estimates it makes are reasonable, any changes to the Companys assumptions or estimates, or any actual results which differ from the Companys assumptions or estimates, could have a material adverse effect on the Companys financial position and operating results. Improper design and implementation of internal control related to the estimates could result in misstatement of financial reports.\nOperational Risk\nAny acquisitions, strategic alliances, joint ventures and divestitures that the Company effects, if any, could result in financial results that differ from market expectations.\nIn the normal course of business, the Company engages in discussions with third parties regarding possible acquisitions, strategic alliances, joint ventures and divestitures. As a result of any such transactions, of which the Company cannot assure that any will occur, the Companys financial results may differ from the investment communitys expectations in a given quarter. In addition, acquisitions and alliances may require the Company to integrate a different company culture, management team, business infrastructure, accounting systems and financial reporting systems. The Company may not be able to effect any such acquisitions or alliances. The Company may have difficulty developing, manufacturing and marketing the products of a newly acquired business in a way that enhances the performance of the Companys combined businesses or product lines to realize the value from any expected synergies. Depending on the size and complexity of an acquisition, the Companys successful integration of the entity depends on a variety of factors, including the retention of key employees and the management of facilities and employees in separate geographical areas. These efforts require varying levels of management resources, which may divert the Companys attention from other business operations. Also, the Companys results may be adversely impacted because of acquisition-related costs, amortization costs for certain intangible assets and impairment losses related to goodwill in connection with such transactions. Finally, acquisitions or alliances by the Company may not occur, which could impair the Companys growth.\nThe Companys results fluctuate from quarter to quarter.\nThe Company has experienced quarterly fluctuations in operating results and anticipates continued fluctuations in the future. A number of factors contribute to these fluctuations:\nThe timing and expense of new product introductions by the Company or its competitors, although the Company might not successfully develop new products and any such new products may not gain market acceptance;\nThe cancellation or delays in the purchase of the Companys products;\nFluctuations in customer demand for the Companys products;\nChanges in domestic and foreign regulations;\nThe gain or loss of significant customers;\nChanges in the mix of products sold by the Company;\nCompetitive pressures on prices at which the Company can sell its products;\nAnnouncements of new strategic relationships by the Company or its competitors;\nLitigation costs and settlements; and\nGeneral economic conditions and other external factors such as energy costs.\nThe Company sets its spending levels in advance of each quarter based, in part, on the Companys expectations of product orders and shipments during that quarter. A shortfall in revenue, therefore, in any particular quarter as compared to the Companys plan could have a material adverse impact on the Companys results of operations and cash flows. Also, the Companys quarterly results could fluctuate due to general market conditions in the healthcare industry or global economy generally, or market volatility unrelated to the Companys business and operating results.\nFailure of the market to accept the Companys products could adversely impact the Companys business and financial condition.\nThe Companys business and financial condition will depend in part upon the market acceptance of the Companys products. The Companys products may not achieve or maintain market acceptance. Market acceptance depends on a number of factors including:\nThe price of the products;\nThe continued receipt of regulatory approvals for multiple indications;\nThe establishment and demonstration of the clinical safety and efficacy of the Companys products; and\nThe advantages of the Companys products over those marketed by the Companys competitors.\nAny failure to achieve or maintain significant market acceptance of the Companys products will have a material adverse impact on the Companys business.\nThe success of products with which the Companys products compete could have an adverse impact on the Companys business.\nThe Company faces intense competition in the medical device and pharmaceutical markets, which are characterized by rapidly changing technology, short product life cycles, cyclical oversupply and rapid price erosion. Many of the Companys competitors have substantially greater financial, technical, marketing, distribution and other resources. The Companys strategy is to compete primarily on the basis of technological innovation, reliability, quality and price of the Companys products. Without timely introductions of new products and enhancements, the Companys products will become technologically obsolete over time, in which case the Companys revenues and operating results would suffer. The success of the Companys new product offerings will depend on several factors, including the Companys ability to:\nProperly identify customer needs;\nInnovate and develop new technologies, services and applications;\nEstablish adequate product distribution coverage;\nObtain and maintain required regulatory approvals from the FDA and other regulatory agencies;\nProtect the Companys intellectual property;\nSuccessfully commercialize new technologies in a timely manner;\nManufacture and deliver the Companys products in sufficient volumes on time;\nDifferentiate the Companys offerings from the offerings of the Companys competitors;\nPrice the Companys products competitively;\nAnticipate competitors announcements of new products, services or technological innovations; and\nAnticipate general market and economic conditions.\nThe Company may not be able to compete effectively in the competitive environments in which the Company operates.\nLack of availability of key system components could result in delays, increased costs or costly redesign of the Companys products.\nAlthough some of the parts and components used to manufacture the Companys products are available from multiple sources, the Company currently purchases most of the Companys components and outsourced finished goods from single sources in an effort to obtain volume discounts. Lack of availability of any of these parts, components and finished goods could result in production delays, increased costs or costly redesign of the Companys products. Any loss of availability of an essential component or finished good could result in a material adverse change to the Companys business, financial condition and results of operations. Some of the Companys suppliers are subject to the FDAs Good\nManufacturing Practice regulations. Failure of these suppliers to comply with those regulations could result in the delay or limitation of the supply of parts or components to the Company, which would adversely impact the Companys financial condition and results of operations.\nThe supply chain challenges could increase the costs of products and the numbers of backorders and could adversely affect our results of operations.\nThe Company is dependent on its management and key personnel to succeed.\nThe Companys principal executive officers and technical personnel have extensive experience with the Companys products, the Companys research and development efforts, the development of marketing and sales programs and the necessary support services to be provided to the Companys customers. Also, the Company competes with other companies, universities, research entities and other organizations to attract and retain qualified personnel. The loss of the services of any of the Companys executive officers or other technical personnel, or the Companys failure to attract and retain other skilled and experienced personnel, could have a material adverse impact on the Companys ability to maintain or expand businesses.\nLegal, Regulatory and Global\nThe Companys products are subject to stringent ongoing regulation by the FDA and similar domestic and foreign health care regulatory authorities, and if the regulatory approvals or clearances of the Companys products are restricted or revoked, the Company could face delays that would impair the Companys ability to generate funds from operations.\nThe FDA and similar health care regulatory authorities in foreign countries extensively regulate the Companys activities. The Company must obtain either 510(K) clearances or pre-market approvals and new drug application approvals prior to marketing any products in the United States. Foreign regulation also requires that the Company obtain other approvals from foreign government agencies prior to the sale of products in those countries. Also, the Company may be required to obtain FDA approval before exporting a product or device that has not received FDA marketing clearance or approval.\nThe Company has received the necessary FDA approvals for all products that the Company currently markets in the United States. Any restrictions on or revocation of the FDA approvals and clearances that the Company has obtained, however, would prevent the continued marketing of the impacted products and other devices. The restrictions or revocations could result from the discovery of previously unknown problems with the product. Consequently, FDA revocation would impair the Companys ability to generate funds from operations.\nThe FDA and comparable agencies in state and local jurisdictions and in foreign countries impose substantial requirements upon the manufacturing and marketing of pharmaceutical and medical device equipment and related disposables, including the obligation to adhere to the FDAs Good Manufacturing Practice regulations. Compliance with these regulations requires time-consuming detailed validation of manufacturing and quality control processes, FDA periodic inspections and other procedures. If the FDA finds any deficiencies in the validation processes, for example, the FDA may impose restrictions on marketing the specific products until such deficiencies are corrected.\nThe Company has received CE approval on several of the Companys products that allows the Company to sell the products in the countries comprising the European Community. In addition to the CE mark, however, some foreign countries may require separate individual foreign regulatory clearances. The Company may not be able to obtain regulatory clearances for other products in the United States or foreign markets.\nThe process for obtaining regulatory clearances and approvals underlying clinical studies for any new products or devices and for multiple indications for existing products is lengthy and will require substantial commitments of Companys financial resources and Companys managements time and effort. Any delay in obtaining clearances or approvals or any changes in existing regulatory requirements would materially adversely impact the Companys business.\nThe Companys failure to comply with the applicable regulations would subject the Company to fines, delays or suspensions of approvals or clearances, seizures or recalls of products, operating restrictions, injunctions or civil or criminal penalties, which would adversely impact the Companys business, financial condition and results of operations.\nThe Companys products employ proprietary technology, and this technology may infringe on the intellectual property rights of third parties.\nThe Company holds several United States and foreign patents for the Companys products. Other parties, however, hold patents relating to similar products and technologies. If patents held by others were adjudged valid and interpreted broadly in an adversarial proceeding, the court or agency could deem them to cover one or more aspects of the Companys products or procedures. Any claims for patent infringements or claims by the Company for patent enforcement would consume time, result in costly litigation, divert technical and management personnel or require the Company to develop non-infringing technology or enter into royalty or licensing agreements. The Company may become subject to one or more claims for patent infringement. The Company may not prevail in any such action, and the Companys patents may not afford protection against competitors with similar technology.\nIf a court determines that any of the Companys products infringes, directly or indirectly, on a patent in a particular market, the court may enjoin the Company from making, using or selling the product. Furthermore, the Company may be required to pay damages or obtain a royalty-bearing license, if available, on acceptable terms.\nThe Companys ability to market or sell the Companys products may be adversely impacted by limitations on reimbursements by government programs, private insurance plans and other third-party payers.\nThe Companys customers bill various third party-payers, including government programs and private insurance plans, for the health care services provided to their patients. Third-party payers may reimburse the customer, usually at a fixed rate based on the procedure performed, or may deny reimbursement if they determine that the use of the Companys products was elective, unnecessary, inappropriate, not cost-effective, experimental or used for a non-approved indication. Third-party payers may deny reimbursement notwithstanding FDA approval or clearance of a product and may challenge the prices charged for the medical products and services. The Companys ability to sell the Companys products on a profitable basis may be adversely impacted by denials of reimbursement or limitations on reimbursement, compared with reimbursement available for competitive products and procedures. New legislation that further reduces reimbursements under the capital cost pass-through system utilized in connection with the Medicare program could also adversely impact the marketing of the Companys products.\nThe Company may become involved in product liability litigation, which may subject the Company to liability and divert management attention.\nThe testing and marketing of the Companys products entails an inherent risk of product liability, resulting in claims based upon injuries or alleged injuries or a failure to diagnose associated with a product defect. Some of these injuries may not become evident for a number of years. Although the Company is not currently involved in any product liability litigation, the Company may be party to litigation in the future as a result of an alleged claim. Litigation, regardless of the merits of the claim or outcome, could consume a great deal of the Companys time and attention away from the Companys core businesses. The Company maintains limited product liability insurance coverage of $1,000,000 per occurrence and $2,000,000 in the aggregate, with umbrella policy coverage of $5,000,000 in excess of such amounts. A successful product liability claim in excess of any insurance coverage may adversely impact the Companys financial condition and results of operations. The Companys product liability insurance coverage may not continue to be available to the Company in the future on reasonable terms or at all.\nThe Companys international operations could be adversely impacted by changes in laws or policies of foreign governmental agencies and social and economic conditions in the countries in which the Company operates.\nThe Company derives a portion of its revenue from sales outside the United States. Changes in the laws or policies of governmental agencies, as well as social and economic conditions, in the countries in which the Company operates could impact the Companys business in these countries and the Companys results of operations. Also, economic factors, including inflation and fluctuations in interest rates and foreign currency exchange rates, and competitive factors such as price competition, business combinations of competitors or a decline in industry sales from continued economic weakness, both in the United States and other countries in which the Company conducts business, could adversely impact the Companys results of operations.\nThe impact of terrorism or acts of war could have a material adverse impact on the Companys business.\nTerrorist acts or acts of war, whether in the United States or abroad, could cause damage or disruption to the Companys operations, its suppliers, channels to market or customers, or could cause costs to increase, or create political or economic instability, any of which could have a material adverse impact on the Companys business.\nIn February 2022, Russia invaded Ukraine. As military activity proceeds and sanctions, export controls and other measures are imposed by many countries against Russia, Belarus and specific areas of Ukraine, the war is\nincreasingly affecting the global economy and financial markets, as well as exacerbating ongoing economic challenges, including rising inflation and global supply-chain disruption. The Company has operations or activities in countries and regions outside the United States. As a result, its global operations are affected by economic, political and other conditions in the foreign countries in which it does business as well as U.S. laws regulating international trade, although the Company has not yet assessed that the war has had a material effect on its financial position or results of operations.\nThe Companys charter documents and Pennsylvania law may inhibit a takeover.\nCertain provisions of Pennsylvania law and the Companys Bylaws could delay or impede the removal of incumbent directors and could make it more difficult for a third party to acquire, or discourage a third party from attempting to acquire, control of the Company. These provisions could limit the share price that certain investors might be willing to pay in the future for shares of the Companys common stock. The Companys Board of Directors is divided into three classes, with directors in each class elected for three-year terms. The Bylaws impose various procedural and other requirements that could make it more difficult for stockholders to effect certain corporate actions. The Companys Board of Directors may issue shares of preferred stock without stockholder approval on such terms and conditions, and having such rights, privileges and preferences, as the Board may determine. The rights of the holders of common stock will be subject to, and may be adversely impacted by, the rights of the holders of any preferred stock that may be issued in the future.\nHealthcare policy changes, including pending proposals to reform the U.S. healthcare system and implementation of the Affordable Healthcare Act, may have a material adverse effect on the Company.\nHealthcare costs have risen significantly over the past decade. There have been and continue to be proposals by legislators, regulators and third-party payors to keep these costs down. Certain proposals, if passed, would impose limitations on the prices the Company will be able to charge for the Companys products, or the amounts of reimbursement available for its products from governmental agencies or third-party payers. These limitations could have a material adverse effect on the Companys financial position and results of operations.\nChanges in the healthcare industry in the U.S. and elsewhere could adversely affect the demand for the Companys products as well as the way in which the Company conducts the Companys business. The 2010 Affordable Care Act provides that most individuals must have health insurance, establishes new regulations on health plans, and creates insurance pooling mechanisms and other expanded public health care measures.\nThe Company anticipates that the healthcare reform legislation will further reduce Medicare spending on services provided by hospitals and other providers and further forms sales or excise tax on the medical device manufacturing sector. Various healthcare reform proposals have also emerged at the federal and state level. The Company cannot predict what healthcare initiatives, if any, will be implemented at the federal or state level, or the effect any future legislation or regulation will have on the Company. However, an expansion in governments role in the U.S. healthcare industry may lower reimbursements for the Companys products, reduce medical procedure volumes and adversely affect the Companys business, possibly materially.\nFuture legislation or changes in government programs may adversely impact the market for the Companys products.\nFrom time to time, the federal government and Congress have made proposals to change aspects of the delivery and financing of health care services. The Company cannot predict what form any future legislation or regulation may take or its impact on the Companys business. Legislation that sets price limits and utilization controls adversely impact the rate of growth of the markets in which the Company participates. If any future health care legislation or regulations were to adversely impact those markets, the Companys product marketing could also suffer, which would adversely impact the Companys business.\nInformation Security, cybersecurity and Data Privacy Risks\nCybersecurity incidents could disrupt business operations, result in the loss of critical and confidential information and adversely impact the Company's reputation and results of operations.\nThe Company is subject to cyber security risks and may incur increasing costs in efforts to minimize those risks and to comply with regulatory standards. The Company employs information technology systems and Internet systems, including websites, which allow for the secure storage and transmission of proprietary or confidential information regarding the Companys customers, employees and others, including credit card information and personal identification information. The Company has made significant efforts to secure its computer network to mitigate the risk of possible\ncyber-attacks and is continuously working to upgrade its existing information technology systems and provide employee awareness training around phishing, malware, and other cyber risks to ensure that the Company is protected, to the greatest extent possible, against cyber risks and security breaches. Despite these efforts security of the Companys computer networks could be compromised which could impact operations and confidential information could be misappropriated, which could lead to negative publicity, loss of sales and profits or cause the Company to incur significant costs to reimburse third-parties for damages which could adversely impact profits.\nOther\nThe Companys Chairman and Chief Executive Officer, Richard DePiano Jr. is the Companys controlling stockholder and has sufficient voting power to determine the outcome of all matters submitted to the Companys stockholders for approval.\nIn February 2018, the Company entered into a Debt Exchange Agreement (the \"Exchange Agreement\") with Mr. DePiano Sr. and DP Associates Inc. Profit-Sharing Plan of which Mr. DePiano is the sole owner and sole trustee (the \"Holders\"). Pursuant to the terms of the Exchange Agreement, the Holders exchanged a total of $645,000 principal amount of debt the Company owed the Holders under factoring agreements and notes (the \"Notes\") the Company entered into with the Holders in February and March of 2016 for 2,000,000 shares of Series A Convertible Preferred Stock (the \"Preferred Stock\"). Each share the Preferred Stock entitles the Holder thereof to 13 votes per share and will vote together with all other classes and series of stock of the Company as a single class on all actions to be taken by the Companys stockholders. As a result of this voting power, the Holders currently beneficially own approximately 77.81% of the voting power on all actions to be taken by the Companys stockholders. If the Holders were to convert their shares of Preferred Stock into common stock at the current conversion ratio, the Holders would receive a total of 4,300,000 shares of Common Stock, or approximately 36.70% of the currently outstanding shares of Common Stock assuming such conversion.\nThe Holders, therefore, control the election of all of the members of the Companys board of directors and control the outcome of any corporate transaction or other matter submitted to a vote of the Companys stockholders for approval, including mergers or other acquisition proposals and the sale of all or substantially all of the Companys assets, in each case regardless of how all of the Companys stockholders other than the Holders vote their shares. The interests of the Holders in maintaining this voting control of the Company may have an adverse effect on the price of the Companys common stock because of the absence of any potential takeover premium and may, therefore, be inconsistent with the interest of the Companys stockholders other than the Holders. The voting control by the Holders could also discourage a third party from attempting to acquire control of the Company and may make it more difficult for a third party to acquire control of the Company. Mr. DePiano Sr. passed away on October 3, 2019 and left a will by which he appointed Richard J. DePiano, Jr., the Chief Executive Officer of the Company, as executor. Richard DePiano Jr. was elected to serve as chairman of the Company's board. Mr. DePiano, Jr. qualified as executor and has control over the shares in his capacity as executor of Mr. DePiano Sr.'s estate.\nThe market price of the Companys stock has historically been volatile, and the Company has not paid cash dividends.\nThe volatility of the Companys common stock imposes a greater risk of capital losses on stockholders as compared to less volatile stocks. In addition, such volatility makes it difficult to ascribe a stable valuation to a stockholders holdings of the Companys common stock. The following factors have and may continue to have a significant impact on the market price of the Companys common stock:\nAcquisitions, strategic alliances, joint ventures and divestitures that the Company effects, if any;\nAnnouncements of technological innovations;\nChanges in marketing, product pricing and sales strategies or new products by the Companys competitors;\nChanges in domestic or foreign governmental regulations or regulatory requirements; and\nDevelopments or disputes relating to patent or proprietary rights and public concern as to the safety and efficacy of the procedures for which the Companys products are used.\nMoreover, the possibility exists that the stock market could experience extreme price and volume fluctuations unrelated to operating performance.\nThe Company has not paid cash dividends on its common stock and does not anticipate paying cash dividends in the foreseeable future.\nIf the Company raises funds in the future, the Company may be required to raise those funds through public or private financings, strategic relationships or other arrangements at prices and other terms that may not be favorable. The sale of additional equity and debt securities may result in additional dilution to the Companys stockholders. Additional financing may not be available in amounts or on terms acceptable to the Company or at all. ITEM 1B. UNSOLVED SEC STAFF COMMENTS\nThe Company does not believe there are any unresolved SEC staff comments. ITEM 2. PROPERTIES\nAs of June 30, 2023 the Company leased an aggregate of 16,354 square feet of space for its (i) corporate offices in Wayne, Pennsylvania, (ii) Sonomed's manufacturing facility in Lake Success, New York, and (iii) Treks distribution facility in New Berlin, Wisconsin. The Company's current corporate office lease of 2,186 square feet will expire on December 2024. The New York facility lease of 6,728 square feet will expire on December 31, 2024. The Company's Wisconsin warehouse of 7,440 square feet will end on April 30, 2025. ITEM 3. LEGAL PROCEEDINGS\nThe Company, from time to time is involved in various legal proceedings and disputes that arise in the normal course of business. These matters have previously and could pertain to intellectual property disputes, commercial contract disputes, employment disputes, and other matters. The Company does not believe that the resolution of any of these matters has had or is likely to have a material adverse impact on the Companys business, financial condition or results of operations. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable\nPart II. ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nThe Companys common stock trades on the OTCQB Market under the symbol ESMC. Any over the counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not present actual transactions.\nAs of October 12, 2023 there were 1,267 holders of record of the Companys common stock. On October 12, 2023 the closing price of the Companys Common Stock as reported by the OTCQB Market was $0.37 per share.\nThe Company has never declared or paid a cash dividend on its common stock and presently intends to retain any future earnings to finance future growth and working capital needs.\nThe Companys forecast of the period of time through which its financial resources will be adequate to support its operations is a forward-looking statement and involves risks and uncertainties, and actual results could vary as a result of a number of factors, including the factors discussed in Risk Factors included in this Form 10-K. If the Company raises funds in the future, the Company may be required to raise those funds through public or private financings, strategic relationships or other arrangements at prices and other terms that may not be as favorable as they would without such qualification. The sale of additional equity and debt securities may result in additional dilution to the Companys stockholders. Additional financing may not be available in amounts or on terms acceptable to the Company or at all. ITEM 6. [Reserved] ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read together with the consolidated financial statements and notes thereto and other financial information contained elsewhere in this Form 10-K and the discussion under Risk Factors included in Item 1A of this Form 10-K.\nConsolidated net revenue increased approximately $1,477,000 or 13.8%, to $12,180,000 during the year ended June 30, 2023 as compared to the prior fiscal year. The increase in net revenue is attributed to an increase of approximately $1,192,000 in sales of Sonomed's ultrasound products mainly due to fulfillment of back orders during the current year, an increase of approximately $335,000 in sales of Trek products, and an increase of $49,000 of other Digital revenue. The increase is offset by a decrease in service plans revenue of $99,000.\nConsolidated cost of revenue totaled approximately $6,699,000, or 55.0%, of total revenue during the year ended June 30, 2023, as compared to $6,096,000, or 57.0%, of total revenue of the prior fiscal year. The decrease of 2.0% in cost of revenue as a percentage of total revenue is mainly due to change of product mix.\nConsolidated marketing, general and administrative expenses increased $98,000, or 2.4%, to $4,184,000 during the year ended June 30, 2023, as compared to the prior fiscal year. The increase in marketing, general and administrate expenses is mainly due to increased network expense of $169,000 and sales compensation of $106,000, trade show related expenses of $70,000, offset by the recovery of bad debt expense of $113,000 and reduced consulting expense related to AXIS regulatory filing of $60,000.\nConsolidated research and development expenses decreased $172,000 or 17.4%, to $819,000 during the year ended June 30, 2023 as compared to the same period of the prior fiscal year. Research and development expenses were primarily expenses associated with the introduction of new or enhanced products. The decrease in research and development expense is mainly due to decreased consulting expense in year ended June 30, 2023.\nResults of Operations\nYears Ended June 30, 2023 and 2022\nThe following table shows consolidated net revenue, as well as identifying trends in revenues for the years ended June 30, 2023 and 2022. Table amounts are in thousands:\nFor the Years Ended June 30,\n2023 2022 % Change\nNet Revenue:\nProducts $ 11,556 $ 9,980 15.8 %\nService plans 624 723 (13.7) %\nTotal $ 12,180 $ 10,703 13.8 %\nConsolidated net revenue increased approximately $1,477,000 or 13.8%, to $12,180,000 during the year ended June 30, 2023 as compared to the prior fiscal year. The increase in net revenue is attributed to an increase of approximately $1,192,000 in sales of Sonomed's ultrasound products mainly due to fulfillment of back orders during the current year, an increase of approximately $335,000 in sales of Trek products, and an increase of $49,000 of other Digital revenue. The increase is offset by a decrease in service plans revenue of $99,000.\nForeign sales\nThe following table presents domestic and international sales from continuing operations. Table amounts are in thousands:\nFor the Years Ended June 30,\n2023 2022\nDomestic $ 7,044 57.8 % $ 5,720 53.4 %\nForeign 5,136 42.2 % 4,983 46.6 %\nTotal $ 12,180 100.0 % $ 10,703 100.0 %\nThe following table presents consolidated cost of revenue and as a percentage of revenues for the years ended June 30, 2023 and 2022. Table amounts are in thousands:\nFor the Years Ended June 30,\n2023 % 2022 %\nCost of Revenue:\n$ 6,699 55.0 % $ 6,096 57.0 %\nTotal $ 6,699 55.0 % $ 6,096 57.0 %\nConsolidated cost of revenue totaled approximately $6,699,000, or 55.0%, of total revenue during the year ended June 30, 2023, as compared to $6,096,000, or 57.0%, of total revenue of the prior fiscal year. The decrease of 2.0% in cost of revenue as a percentage of total revenue is mainly due to change of product mix.\nThe following table presents consolidated marketing, general and administrative expenses for the years ended June 30, 2023 and 2022. Table amounts are in thousands:\nFor the Years Ended June 30,\n2023 2022 % Change\nMarketing, General and Administrative:\n$ 4,184 $ 4,086 2.4 %\nTotal $ 4,184 $ 4,086 2.4 %\nConsolidated marketing, general and administrative expenses increased $98,000, or 2.4%, to $4,184,000 during the year ended June 30, 2023 as compared to the prior fiscal year. The increase in marketing, general and administrate expenses is mainly due to increased network expense of $169,000 and sales compensation of $106,000, trade show related expenses of $70,000, offset by the recovery of bad debt expense of $113,000 and reduced consulting expense related to AXIS regulatory filing of $60,000.\nThe following table presents consolidated research and development expenses for the years ended June 30, 2023 and 2022.\nTable amounts are in thousands:\nFor the Years Ended June 30,\n2023 2022 % Change\nResearch and Development:\n$ 819 $ 991 (17.4) %\nTotal $ 819 $ 991 (17.4) %\nConsolidated research and development expenses decreased $172,000, or 17.4%, to $819,000 during the year ended June 30, 2023 as compared to the prior fiscal year. Research and development expenses were primarily expenses associated with the introduction of new or enhanced products. The decrease in research and development expense is mainly due to decreased consulting expense in year ended June 30, 2023.\nOther income (expense)\nOn April 27, 2020, the Company entered into a PPP loan for $500,000 in connection with the CARES Act related to COVID-19. The promissory note has a fixed payment schedule. The Company submitted the loan forgiveness application on August 2, 2021. The full amount of the PPP loan and accrued interest of $6,305 were forgiven on August 13, 2021 and reported as other income during the year ended June 30, 2022.\nRussia-Ukraine War\nIn February 2022, Russia invaded Ukraine. As military activity proceeds and sanctions, export controls and other measures are imposed by many countries against Russia, Belarus and specific areas of Ukraine, the war is increasingly affecting the global economy and financial markets, as well as exacerbating ongoing economic challenges, including rising inflation and global supply-chain disruption. The Company has operations or activities in countries and regions outside the United States. As a result, its global operations are affected by economic, political and other conditions in the foreign countries in which it does business as well as U.S. laws regulating international trade, although the Company has not yet assessed that the war has had a material effect on its financial position or results of operations.\nLiquidity and Capital Resources\nOur total cash as of June 30, 2023 consisted approximately $890,000 of cash on hand and restricted cash of approximately $256,000 compared to approximately $594,000 of cash on hand and restricted cash of $256,000 as of June 30, 2022.\nBecause our operations have not historically generated sufficient revenues to enable profitability we will continue to monitor costs and expenses closely and may need to raise additional capital in order to fund operations.\nWe expect to continue to fund operations from cash on hand and through capital raising sources if possible and available, which may be dilutive to existing stockholders, through revenues from the licensing of our products, or through strategic alliances. Additionally, we may seek to sell additional equity or debt securities through one or more discrete transactions, or enter into a strategic alliance arrangement, but can provide no assurances that any such financing or strategic alliance arrangement will be available on acceptable terms, or at all. Moreover, the incurrence of indebtedness in connection with a debt financing would result in increased fixed obligations and could contain covenants that would restrict our operations.\nAs of June 30, 2023 we had an accumulated deficit of approximately $68.4 million, incurred historically recurring losses from operations and negative cash flows from operating activities in prior years. For the fiscal year ending June 30, 2023, the Company generated net income from operations of $479,000 and generated cash inflow of $325,000 from operating activities. While the overall trend has been toward profitability, having just one year out of the last five of income, the question is whether the Company will keep the profitability trend and sales growth. These factors raise substantial doubt regarding our ability to continue as a going concern, and our ability to generate cash to meet our cash requirements for the following twelve months as of the filing date of this form 10-K.\nThe following table presents overall liquidity and capital resources as of June 30, 2023 and 2022. Table amounts are in thousands:\nJune 30, June 30,\n2023 2022\nCurrent Ratio:\nCurrent assets $4,637 $4,186\nLess: Current liabilities 2,853 3,002\nWorking capital $1,784 $1,184\nCurrent ratio 1. 63 to 1 1.39 to 1\nDebt to Total Capital Ratio:\nLine of credit, note payable, lease liabilities, and EIDL loan $890 $1,205\nTotal debt 890 1,205\nTotal equity 1,935 1,478\nTotal capital $2,825 $2,683\nTotal debt to total capital 31.5% 44.9%\nWorking Capital Position\nWorking capital increased approximately $600,000 to $1,784,000 as of June 30, 2023, and the current ratio increased to 1. 63 to 1 to from 1.39 to 1 when compared to June 30, 2022.\nThe increase in working capital is due to a decrease in current liabilities of $149,000 when a loan of $201,575 was converted to a sixty-month note payable on March 29, 2023, and an increase in current assets of approximately $451,000 as of June 30, 2023 due to operating income.\nDebt to total capital ratio was 31.5% and 44.9% as of June 30, 2023 and June 30, 2022, respectively.\nCash Flow Provided By (Used In) Operating Activities\nDuring year ended June 30, 2023 the Company provided by approximately $325,000 of cash in operating activities as compared to approximately $1,050,000 of cash used in operating activities during the year ended June 30, 2022.\nFor the year ended June 30, 2023, its cash provided by operations is mainly due to a decrease in inventory of $44,000, an increase in accounts payable of $193,000 and an increase in deferred revenue of $94,000. The cash inflow is offset by a\ndecrease in accrued expense of $250,000. The remaining offsetting items for cash used in operations is comprised of less significant items.\nFor the year ended June 30, 2022, its cash used in operations is mainly due to non-cash other income of $506,000, an increase in inventory of $187,000, an increase in accounts receivable of $615,000, and a decrease in accounts payable of $90,000. The cash outflow is offset by an increase in accrued expense of $218,000. The remaining offsetting items for cash used in operations is comprised of less significant items.\nCash Flows Used In Investing Activities\nCash flows used in investing activities for the year ended June 30, 2023 was due to purchase of the licenses of $7,000 and purchase of the fixed assets of $7,000. There was no cash flow used in investing activities for the year ended June 30, 2022.\nAny necessary capital expenditures have generally been funded out of cash from operations, and the Company is not aware of any factors that would cause historical capital expenditure levels to not be indicative of capital expenditures in the future and, accordingly, does not believe that the Company will have to commit material resources to capital investment for the foreseeable future.\nCash Flows Used in Financing Activities\nFor the year ended June 30, 2023 the cash used in the financing activities of $12,000 was due to repayment of notes payable and repayment of EIDL loan of $3,000.\nFor the year ended June 30, 2022 the cash used in the financing activities of $4,000 was due to auto loan payment and repayment of EIDL loan of $3,000.\nOff-balance Sheet Arrangements and Contractual Obligations\nThe Company was not a party to any off-balance sheet arrangements during the years ended June 30, 2023 and 2022.\nCritical Accounting Estimates and policies\nThe preparation of financial statements requires management to make estimates and assumptions that impact amounts reported therein. The consolidated financial statements are prepared in conformity with accounting principles generally accepted in the United States of America, and, as such, include amounts based on informed estimates and judgments of management.\nThe following items require significant estimation or judgment:\nAccounts receivable-uncollectible receivables, and\nInventories- obsolete inventory,\nActual results achieved in the future could differ from current estimates. The Company used what it believes are reasonable assumptions and, where applicable, established valuation techniques in making its estimates.\nRevenue Recognition\nThe Company recognizes revenue when its performance obligations with its customers have been satisfied. At contract inception, the Company determines if the contract is within the scope of Accounting Standards Codification (ASC) Topic 606, Revenue from Contracts with Customers, and then evaluates the contract using the following five steps: (1) identify the contract with the customer; (2) identify the performance obligations; (3) determine the transaction price; (4) allocate the transaction price to the performance obligations; and (5) recognize revenue when (or as) the entity satisfies a performance obligation. The Company only recognizes revenue to the extent that it is probable that a significant revenue reversal will not occur in a future period.\nInventories\nInventories are stated at the lower of cost or net realizable value. Cost is determined on a first-in, first-out basis and include freight-in materials, labor and overhead costs. Inventories are written down if the estimated net realizable value is less than the recorded value. The Company reviews the carrying cost of inventories by product to determine the adequacy of reserves for obsolescence. In accounting for inventories, the Company must make estimates regarding the estimated realizable value of inventory. The estimate is based on, in part, age of inventory. If actual conditions are less favorable than those the Company has projected, the Company may need to increase its reserves for excess and obsolete inventories. Any increases in the reserves will adversely impact the Companys results of operations. The establishment of a reserve for excess and obsolete\ninventory establishes a new cost basis in the inventory. Such reserves are not reduced until the product is sold. If the Company is able to sell such inventory any related reserves would be reversed in the period of sale. In accordance with industry practice, service parts inventory is included in current assets, although service parts are carried for established requirements during the serviceable lives of the products and, therefore, not all parts are expected to be sold within one year.\nRecently Issued Accounting Standards\nThe Company considers the applicability and impact of all accounting standards updates (\"ASUs\"). Management periodically reviews new accounting standards that are issued.\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (ASC 326), authoritative guidance amending how entities will measure credit losses for most financial assets and certain other instruments that are not measured at fair value through net income. The guidance requires the application of a current expected credit loss model, which is a new impairment model based on expected losses. The new guidance is effective for interim and annual reporting periods beginning after December 15, 2022. The Company is currently evaluating the impact of the new guidance on the Company's consolidated financial statements.\nFINANCIAL STATEMENTS AND SUPPLIMENTARY DATA\nEscalon Medical Corp.\nIndex to Consolidated Financial Statements\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 688)\nReport of Independent Registered Public Accounting Firm (PCAOB ID 711)\nConsolidated Balance Sheets at June 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of Escalon Medical Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Escalon Medical Corp. (the Company) and Subsidiaries as of June 30, 2023, the related consolidated statements of operations, stockholders equity and cash flows for the year ended June 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023, and the results of its operations and its cash flows for the year ended June 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As more fully described in Note 2, the Company's historical recurring losses from operations and negative cash flows from operating activities raise substantial doubt about the Companys ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Marcum LLP\nMarcum LLP\nWe have served as the Companys auditor since 2010 (such date takes into account the acquisition of certain assets of Friedman LLP by Marcum LLP effective September 1, 2022)\nMarlton, New Jersey\nOctober 13, 2023\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of Escalon Medical Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Escalon Medical Corp. (the Company) and Subsidiaries as of June 30, 2022, the related consolidated statements of operations, stockholders equity and cash flows for the year ended June 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As more fully described in Note 2, the Company has not generated sufficient revenues to enable profitability and the Company has a significant accumulated deficit. These conditions raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Friedman LLP\nFriedman LLP\nWe served as the Companys auditor from 2018 to 2022.\nMarlton, New Jersey\nSeptember 28, 2022\nESCALON MEDICAL CORP. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nJune 30,\n2023 June 30,\nASSETS\nCurrent assets:\nCash $ 889,674 $ 593,869\nRestricted cash 256,293 256,165\nAccounts receivable, net 1,653,721 1,541,750\nInventories, net 1,587,989 1,603,955\nOther current assets 249,790 190,043\nTotal current assets 4,637,467 4,185,782\nProperty and equipment, net 34,064 52,660\nRight-of-use assets 503,647 788,257\nLicense, net 69,986 82,750\nOther long term assets 62,787 62,788\nTotal assets $ 5,307,951 $ 5,172,237\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nLine of credit $ - $ 201,575\nCurrent portion of note payable 37,087 3,401\nCurrent portion of EIDL loan 3,105 3,105\nAccounts payable 1,205,510 1,012,451\nAccrued expenses 651,978 901,996\nRelated party accrued interest 112,389 112,389\nCurrent portion of operating lease liabilities 329,638 304,737\nDeferred revenue 426,227 332,383\nOther short term liabilities 87,125 129,961\nTotal current liabilities 2,853,059 3,001,998\nNote payable, net of current portion 159,511 3,888\nOperating lease liabilities, net of current portion 214,103 538,794\nEIDL loan, net of current portion 146,435 149,540\nTotal long-term liabilities 520,049 692,222\nTotal liabilities 3,373,108 3,694,220\nCommitments and Contingencies (Note 10)\nStockholders' equity:\nSeries A convertible preferred stock, $0.001 par value; 2,000,000 shares authorized; 2,000,000 shares issued and outstanding (liquidation value of $922,331 and $870,731) 645,000 645,000\nCommon stock, $0.001 par value; 35,000,000 shares authorized; 7,415,329 shares issued and outstanding 7,415 7,415\nAdditional paid-in capital 69,702,043 69,702,043\nAccumulated deficit (68,419,615) (68,876,441)\nTotal stockholders equity 1,934,843 1,478,017\nTotal liabilities and stockholders equity $ 5,307,951 $ 5,172,237\nSee notes to consolidated financial statements\nESCALON MEDICAL CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended June 30,\n2023 2022\nNet revenues:\nProducts $ 11,555,907 $ 9,980,343\nService plans 624,314 722,727\nRevenues, net 12,180,221 10,703,070\nCosts and expenses:\nCost of revenue 6,698,858 6,096,169\nMarketing, general and administrative 4,184,051 4,085,982\nResearch and development 818,769 990,982\nTotal costs and expenses\n11,701,678 11,173,133\nIncome (loss) from operations 478,543 (470,063)\nOther income (expense)\nOther income - 506,305\nInterest income 128 245\nInterest expense (21,845) (18,406)\nTotal other income (expense), net (21,717) 488,144\nIncome tax expense $ - $ -\nNet income 456,826 18,081\nLess undeclared dividends on preferred stocks 51,600 51,600\nLess income allocated to convertible preferred stocks 183,695 -\nNet income (loss) applicable to common stockholders $ 221,531 $ (33,519)\nNet income per share\nBasic income per share applicable to common stockholder $ 0.03 $ 0.00\nDiluted income per share $ 0.03 $ 0.00\nWeighted average shares-basic 7,415,329 7,415,329\nWeighted average shares-diluted 13,564,202 13,220,202\nSee notes to consolidated financial statements\nESCALON MEDICAL CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nFOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nSeries A Convertible Preferred Stock Common Stock Additional\nPaid-in\nCapital Accumulated\nDeficit Total\nStockholders\nEquity\nShares Amount Shares Amount\nBalance at June 30, 2022 2,000,000 $ 645,000 7,415,329 $ 7,415 $ 69,702,043 $ (68,876,441) $ 1,478,017\nNet income - - - - - 456,826 456,826\nBalance at June 30, 2023 2,000,000 $ 645,000 7,415,329 $ 7,415 $ 69,702,043 $ (68,419,615) $ 1,934,843\nSeries A Convertible Preferred Stock Common Stock Additional\nPaid-in\nCapital Accumulated Deficit Total\nStockholders\nEquity\nShares Amount Shares Amount\nBalance at June 30, 2021 2,000,000 $ 645,000 7,415,329 $ 7,415 $ 69,702,043 $ (68,894,522) $ 1,459,936\nNet income - - - - - 18,081 18,081\nBalance at June 30, 2022 2,000,000 $ 645,000 7,415,329 $ 7,415 $ 69,702,043 $ (68,876,441) $ 1,478,017\nSee notes to consolidated financial statements\nESCALON MEDICAL CORP. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended June 30,\n2023 2022\nCash Flows from Operating Activities:\nNet income $ 456,826 $ 18,081\nAdjustments to reconcile net income to net cash provided by (used in) operating activities:\nIncrease in accounts receivable allowance 118,000 155,267\nIncrease in inventory reserve 60,000 -\nOther income-gain on PPP loan forgiveness - (506,305)\nDepreciation and amortization 45,202 48,432\nNon cash lease expense 289,557 279,719\nChange in operating assets and liabilities:\nAccounts receivable (229,971) (615,315)\nInventories (44,034) (187,229)\nOther current assets (59,746) (2,684)\nAccounts payable 193,059 (89,674)\nAccrued expenses (250,018) 218,373\nChange in operating lease liability (304,737) (290,267)\nDeferred revenue 93,844 (31,317)\nOther short-term and long-term liabilities (42,836) (47,006)\nNet cash provided by (used in) operating activities 325,146 (1,049,925)\nCash Flows from Investing Activities:\nPurchase of equipment (6,687) -\nPurchase of license (7,155) -\nNet cash used in investing activities (13,842) -\nCash Flows from Financing Activities:\nRepayment of EIDL loan (3,105) (2,980)\nRepayment of note payable (12,266) (3,951)\nNet cash used in financing activities (15,371) (6,931)\nNet increase (decrease) in cash, cash equivalents and restricted cash 295,933 (1,056,856)\nCash, and restricted cash, beginning of year 850,034 1,906,890\nCash, and restricted cash, end of year $ 1,145,967 $ 850,034\nCash, and restricted cash consist of the following:\nEnd of year\nCash $ 889,674 $ 593,869\nRestricted cash 256,293 256,165\n$ 1,145,967 $ 850,034\nBeginning of year\nCash $ 593,869 $ 1,650,970\nRestricted cash 256,165 255,920\n$ 850,034 $ 1,906,890\nSupplemental Schedule of Cash Flow Information:\nInterest paid $ 22,281 $ 18,406\nNon Cash Finance Activities\nRecord right-of-use assets per ASC 842 $ - $ 224,417\nRecord lease liability per ASC 842 $ - $ 224,417\nSee notes to consolidated financial statements\nEscalon Medical Corp. and Subsidiaries\nNotes to Consolidated Financial Statements\n1. Organization and Basis of Presentation\nEscalon Medical Corp. (\"Escalon\" or \"Company\") is a Pennsylvania corporation initially incorporated in California in 1987, and reincorporated in Pennsylvania in November 2001. Within this document, the Company collectively shall mean Escalon, which includes its division called \"Trek\" and its wholly owned subsidiaries: Sonomed, Inc. (Sonomed), Escalon Digital Solutions, Inc. (EMI), and Sonomed IP Holdings, Inc.\nThe Company operates in the healthcare market, specializing in the development, manufacture, marketing and distribution of medical devices and pharmaceuticals in the area of ophthalmology. The Company and its products are subject to regulation and inspection by the United States Food and Drug Administration (the FDA). The FDA and other government authorities require extensive testing of new products prior to sale and have jurisdiction over the safety, efficacy and manufacture of products, as well as product labeling and marketing.\nThe Companys common stock trades on the OTCQB Market under the symbol ESMC.\n2. Going Concern\nThe Companys operations are subject to a number of factors that can affect its operating results and financial condition. Such factors include, but are not limited to: the continuous enhancement of the current products, development of new products; changes in domestic and foreign regulations; ability of manufacture successfully; competition from products manufactured and sold or being developed by other companies; the price of, and demand for, the Companys products and its ability to raise capital to support its operations.\nTo date, the Companys operations have not generated sufficient revenues to enable profitability. Through June 30, 2023, the Company had incurred historical recurring losses from operations and incurred negative cash flows from operating activities in prior years. For the fiscal year ending June 30, 2023, the Company generated net income from operations of $479,000 and generated cash inflow of $325,000 from operating activities. While the overall trend has been toward profitability, having just one year out of the last five of income, the question is whether the Company will keep the profitability trend and sales growth. These factors raise substantial doubt regarding the Companys ability to continue as a going concern for the following twelve months as of the filing date of this form 10-K.\nThe accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. These consolidated financial statements do not include any adjustments relating to the realization of the carrying value of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe Company's continuance as a going concern is dependent on its future profitability and on the on-going support of its stockholders, affiliates and creditors. In order to mitigate the going concern issues, the Company is actively pursuing business partnerships, managing its continuing operations, implementing cost-cutting measures. The Company may not be successful in any of these efforts.\n3. Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries. All intercompany accounts and transactions have been eliminated.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (\"US GAAP\") requires management to make estimates and assumptions that impact the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nCash\nFor the purposes of reporting cash flows, the Company considers all cash accounts, which are not subject to withdrawal restrictions or penalties, and highly liquid investments with original maturities of 90 days or less to be cash and cash equivalents. From time to time cash balances exceed federal insurance limits. As of June 30, 2023 there were no cash equivalents.\nRestricted Cash\nAs of June 30, 2023 and 2022 restricted cash included approximately $256,000, which was pursuant to the requirements in the TD Bank Loan entered into June 2018 (see Note 6).\nAccounts Receivable\nAccounts receivable are recorded at net realizable value. The Company performs ongoing credit evaluations of customers financial condition and does not require collateral for accounts receivable arising in the normal course of business. The Company maintains allowances for potential credit losses based on the Companys historical trends, specific customer issues and current economic trends. Accounts are written off against the allowance when they are determined to be uncollectible based on managements assessment of individual accounts. The Company recorded an allowance for doubtful accounts of approximately $154,000 and $236,000 as of June 30, 2023 and 2022.\nJune 30,\n2023 2022\nBalance, July 1 $ 236,349 $ 100,480\nIncrease in allowance 118,000 155,267\nRecovery in bad debts (113,400) -\nWrite-offs (87,071) (19,398)\nBalance, June 30 $ 153,878 $ 236,349\nInventories\nInventories are stated at the lower of cost or net realizable value. Cost is determined on a first-in, first-out basis and include freight-in materials, labor and overhead costs. Inventories are written down if the estimated net realizable value is less than the recorded value. The Company reviews the carrying cost of inventories by product to determine the adequacy of reserves for obsolescence. In accounting for inventories, the Company must make estimates regarding the estimated realizable value of inventory. The estimate is based, in part, on age of inventory. If actual conditions are less favorable than those the Company has projected, the Company may need to increase its reserves for excess and obsolete inventories. Any increases in the reserves will adversely impact the Companys results of operations. The establishment of a reserve for excess and obsolete inventory establishes a new cost basis in the inventory. Such reserves are not reduced until the product is sold. If the Company is able to sell such inventory any related reserves would be reversed in the period of sale. In accordance with industry practice, service parts inventory is included in current assets, although service parts are carried for established requirements during the serviceable lives of the products and, therefore, not all parts are expected to be sold within one year. The Company recorded a $150,000 inventory write-off of inventory that was previously reserved and increased the reserve $60,000 for additional slow moving inventory in the current period resulting in a net reduction of $90,000 as of June 30, 2023 as compared to June 30, 2022.\nFor the years ended June 30,\n2023 2022\nRaw materials $ 882,093 $ 1,010,471\nWork in process 85,575 138,182\nFinished goods 880,717 805,698\nTotal inventories $ 1,848,385 $ 1,954,351\nAllowance for obsolete inventory (260,396) (350,396)\nInventories, net $ 1,587,989 $ 1,603,955\nProperty and Equipment\nProperty and equipment are recorded at cost. Leasehold improvements are amortized on a straight-line basis over the lesser of the estimated useful life of the asset or lease term. Depreciation on property and equipment is recorded using the straight-line method over the estimated economic useful life of the related assets. Estimated useful lives are generally three years to five years for computer equipment and software, five years to seven years for furniture and fixtures and five years to ten years for production and test equipment. Depreciation and amortization expense for the years ended June 30, 2023 and 2022 was approximately $25,000 and $29,000, respectively.\nProperty and equipment consist of the following:\nJune 30,\n2023 2022\nEquipment $ 777,785 $ 771,097\nFurniture and fixtures 128,499 128,499\nLeasehold improvements 39,048 39,048\n945,332 938,644\nLess: Accumulated depreciation and amortization (911,268) (885,984)\n$ 34,064 $ 52,660\nIntangible Assets and Long-Lived Assets\nLong-lived assets including intangible assets deemed to have finite lives, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Impairment indicators include, among other conditions, cash flow deficits, historic or anticipated declines in revenue or operating profit or material adverse changes in the business climate that indicate that the carrying amount of an asset may be impaired. When impairment indicators are present, the recoverability of the asset is measured by comparing the carrying value of the asset to the estimated undiscounted future cash flows expected to be generated by the asset. If the projected undiscounted cash flows from the asset are less than the carrying value of the asset the asset is considered to be impaired. The impairment to be recognized is measured by the amount by which the carrying amount of the asset exceeds the fair value of the asset. At June 30, 2023 and 2022 the Company concluded that there were no triggering event that would result in impairment of the long-lived assets, including the ROU assets.\nAccrued Warranties\nThe Company provides a limited one-year warranty against manufacturers defects on its products sold to customers. The Companys standard warranties require the Company to repair or replace, at the Companys discretion, defective parts during such warranty period. The Company accrues for its product warranty liabilities based on estimates of costs to be incurred during the warranty period, based on historical repair information for warranty costs.\nFair Value of Financial Instruments\nThe carrying amounts for cash and cash equivalents, restricted cash, accounts receivable, and accounts payable approximate their fair value because of their short-term maturity. The Company determined that the carrying amount of the\nnotes payable and lease liabilities approximates fair value since such debt borrowing bears interest at the approximate current market rate. While the Company believes the carrying value of the assets and liabilities are reasonable, considerable judgment is used to develop estimates of fair value; thus the estimates are not necessarily indicative of the amounts that could be realized in a current market exchange.\nRevenue Recognition\nThe Company recognizes revenue when its performance obligations with its customers have been satisfied. At contract inception, the Company determines if the contract is within the scope of Accounting Standards Codification (ASC) Topic 606, Revenue from Contracts with Customers, and then evaluates the contract using the following five steps: (1) identify the contract with the customer; (2) identify the performance obligations; (3) determine the transaction price; (4) allocate the transaction price to the performance obligations; and (5) recognize revenue when (or as) the entity satisfies a performance obligation. The Company only recognizes revenue to the extent that it is probable that a significant revenue reversal will not occur in a future period.\nThe Company generates product revenue from the sale of medical device products and the sale and installation of the Company's AXIS image management system software. Revenue for service plans relate to the customer care plans for the Companys equipment and AXIS image management system software.\nRevenue is recognized upon transfer of control of the promised goods or services to the customer for an amount that reflects the consideration that the Company expects to be entitled in exchange for those goods or services. The Companys performance obligations are for product sales, installation of AXIS image management system software and customer care plans. The performance obligations are determined at contract inception based upon promises within the contract that are distinct.\nThe product sales and installation of AXIS image management system software performance obligations are satisfied at a point in time, which is upon shipment for product sales and upon successful installation for the AXIS image management system. The performance obligation for customer care plans is satisfied over time as the customer receives and consumes the Companys services.\nThe Company invoices its customers upon shipment for product sales. For the installation of AXIS image management system software and customer care plans, the Company invoices its customers upon successful installation. Invoice payments are generally due within 30 days of invoice date. The transaction price is determined based on fixed consideration in the Companys customer contracts and is recorded net of variable consideration. In determining the transaction price, a significant financing component does not exist since the timing from when the Company invoices its customers to when payment is received as it is less than one year.\nRevenue for product sales and installation of AXIS image management system software is recognized when delivered or installed. The customer care plan revenues are recognized proportionately over the service period, which is a 12-month period.\nThe Company has elected the following practical expedients in applying ASC 606:\nUnsatisfied Performance Obligations - all performance obligations relate to contracts with a duration of less than one year, the Company has elected to apply the optional exemption provided in ASC 606 and therefore, is not required to disclose the aggregate amount of the transaction price allocated to performance obligations that are unsatisfied or partially unsatisfied at the end of the reporting period.\nContract Costs - all incremental customer contract acquisition costs are expensed as they are incurred as the amortization period of the asset that the Company otherwise would have recognized is one year or less in duration.\nSignificant Financing Component - the Company does not adjust the promised amount of consideration for the effects of a significant financing component as the Company expects, at contract inception, that the period between when the entity transfers a promised good or service to a customer and when the customer pays for that good or service will be one year or less.\nSales Tax Exclusion from the Transaction Price - the Company excludes from the measurement of the transaction price all taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue-producing transaction and collected by the Company from the customer.\nShipping and Handling Activities - the Company elected to account for shipping and handling activities as a fulfillment cost rather than as a separate performance obligation.\nPortfolio Approach - the Company applied the Portfolio Approach to contract reviews within its identified\nrevenue streams that have similar characteristics and the Company believes this approach would not differ materially than if applying Topic 606 to each individual contract.\nDeferred Revenue\nThe Company records deferred revenues when cash payments are received or due in advance of its performance. The Companys deferred revenues relate to payments received for the customer care plans for a 12-month period. The consideration received is recognized monthly over the service period.\nYears ended June 30,\n2023 2022\nBeginning of Year $ 333,000 $ 364,000\nAdditions 717,000 692,000\nRevenue Recognized (624,000) (722,000)\nEnd of Year $ 426,000 $ 333,000\nIncluded in accrued expenses as of June 30, 2023 and 2022 is approximately $129,000 and $213,000, respectively of customer deposits that will be recorded as income in the consecutive period once the products have been shipped. Revenue recorded that included within prior period deferred revenue was $315,000 and $362,000, respectively for year ended June 30, 2023 and 2022.\nShipping and Handling Revenues and Costs\nShipping and handling revenues are included in product revenue and the related costs are included in cost of revenue.\nResearch and Development\nAll research and development costs are charged to operations as incurred.\nEarnings Per Share\nThe Company used the two-class method to compute net income per common share. These participating securities included the Companys convertible preferred stock which accrues dividends payable. The two-class method requires earnings for the period to be allocated between common stock and participating securities based upon their respective rights to receive distributed and undistributed earnings.\nUnder the two-class method, for periods with net income, basic net income per common share is computed by dividing the net income attributable to common stockholders by the weighted average number of shares of common stock outstanding during the period. Net income attributable to common stockholders is computed by subtracting from net income the portion of current period earnings that the participating securities would have been entitled to receive pursuant to their dividend rights had all of the periods earnings been distributed. No such adjustment to earnings is made during periods with a net loss, as the holders of the participating securities have no obligation to fund losses.\nDiluted net income per common share is computed under the two-class method by using the weighted average number of shares of common stock outstanding, plus, for periods with net income attributable to common stockholders, the potential dilutive effects of stock options. The Company analyzed the potential dilutive effect of any outstanding dilutive securities under the if-converted method and treasury-stock method when calculating diluted earnings per share, in which it is assumed that the outstanding participating securities convert into common stock at the beginning of the period or date of issuance, if later. The Company reports the more dilutive of the approaches (two-class or if-converted) as its diluted net income per share during the period. per share is computed by dividing net income by the weighted average number of shares of common stock outstanding during the year. As of June 30, 2023 and 2022, the average market prices for the years then ended are less than the exercise price of all the outstanding stock options and, therefore, the inclusion of the stock options would be anti-dilutive.\nFor the Years Ended June 30,\n2023 2022\nNumerator:\nNumerator for basic earnings (loss) per share:\nNet income $ 456,826 $ 18,081\nLess undeclared dividends on convertible stocks 51,600 51,600\nLess net income allocated to convertible preferred stocks 183,695 -\nNet income (loss) applicable to common stockholders $ 221,531 $ (33,519)\nNumerator for diluted earnings (loss) per share:\nNet income $ 456,826 $ 18,081\nUndeclared dividends on convertible stocks 51,600 51,600\nNet income (loss) applicable to convertible common stockholders $ 405,226 $ (33,519)\nDenominator:\nDenominator for basic earnings per share - weighted average shares outstanding 7,415,329 7,415,329\nWeighted average preferred stock converted to common stock 6,148,873 5,804,873\nDenominator for diluted earnings per share - weighted average and assumed conversion 13,564,202 13,220,202\nNet income per share:\nBasic net income per share $ 0.03 $ 0.00\nDiluted net income per share $ 0.03 $ 0.00\nThe following table summarizes convertible preferred stock and securities that, if exercised would have an anti-dilutive effect\non earnings per share.\nFor the Years Ended June 30,\n2023 2022\nStock options 157,000 157,000\nConvertible preferred stock - -\nTotal potential dilutive securities not included in income per share 157,000 157,000\nIncome Taxes\nThe Company accounts for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the consolidated financial statements. Under this method, the Company determines deferred tax assets and liabilities on the basis of the differences between the financial statement and tax bases of assets and liabilities by using enacted tax rates in effect for the year in which the differences are expected to reverse. The effect of a change in tax rates on deferred tax assets and liabilities is recognized in income in the period that includes the enactment date.\nThe Company recognizes deferred tax assets to the extent that it believes that these assets are more likely than not to be realized. In making such a determination, the Company considers all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, and results of recent operations. If the Company determines that it would be able to realize its deferred tax assets in the future in excess of their net recorded amount, the Company would make an adjustment to the deferred tax asset valuation allowance, which would reduce the provision for income taxes. As of June 30, 2023 and June 30, 2022, the Company has recorded a full valuation allowance against its deferred tax assets.\nThe Company records uncertain tax positions in accordance with ASC 740 on the basis of a two-step process in which (1) the Company determines whether it is more likely than not that the tax positions will be sustained on the basis of the technical merits of the position and (2) for those tax positions that meet the more-likely-than-not recognition threshold, the Company recognizes the largest amount of tax benefit that is more than 50 percent likely to be realized upon ultimate settlement with the related tax authority.\nThe Company recognizes interest and penalties related to unrecognized tax benefits on the income tax expense line in the accompanying consolidated statements of operations. As of June 30, 2023 and June 30, 2022, no accrued interest or penalties were required to be included on the related tax liability line in the consolidated balance sheets. The Company dissolved Escalon Holdings, Inc. and Escalon IP Holdings, Inc. in a tax-free dissolution under Section 332 of the Internal Revenue Code during the year ended June 30, 2022. There is no tax impact on the consolidated financial statements of the Company's current and prior years.\nLeases\nThe Company determines if an arrangement is a lease at the inception of a contract. Operating lease right-of-use (\"ROU\") assets are included in right-of-use assets on the consolidated balance sheets. The current and long-term components of operating lease liabilities are included in the current portion of operating lease liabilities and operating lease liabilities, net of current portion, respectively on the consolidated balance sheets.\nOperating lease ROU assets and operating lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term. As most of the Company's leases do not provide an implicit rate, the Company uses an incremental borrowing rate based on the information available at the commencement date in determining the present value of future payments. Certain leases may include options to extend or terminate the lease. Lease expense for minimum lease payments is recognized on a straight-line basis over the lease term.\nNew Accounting Pronouncements\nRecently Issued Accounting Standards\nThe Company considers the applicability and impact of all accounting standards updates (\"ASUs\"). Management periodically reviews new accounting standards that are issued.\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (ASC 326), authoritative guidance amending how entities will measure credit losses for most financial assets and certain other instruments that are not measured at fair value through net income. The guidance requires the application of a current expected credit loss model, which is a new impairment model based on expected losses. The new guidance is effective for interim and annual reporting periods beginning after December 15, 2022. The Company is currently evaluating the impact of the new guidance on the Company's consolidated financial statements.\n4. Intangible Assets\nThe Company's intangible assets consist of the following:\nLicenses\nThe Company capitalized and amortized its purchased licenses over 10 years. Amortization expense is approximately $20,000 for each of the years ended June 30, 2023 and 2022. Annual amortization related entirely to licenses is estimated to be $20,676 for the years ending June 30, 2024 through 2026 and $7,958 thereafter.\nThe following table presents amortized licenses as of June 30, 2023:\nGross\nCarrying\nAmount Impairment Adjusted\nGross\nCarrying\nAmount Accumulated\nAmortization Net\nCarrying\nValue\nAmortized Intangible Assets Licenses\n$ 206,155 $ - $ 206,155 $ (136,169) $ 69,986\nTotal $ 206,155 $ - $ 206,155 $ (136,169) $ 69,986\nThe following table presents amortized licenses as of June 30, 2022:\nGross\nCarrying\nAmount Impairment Adjusted\nGross\nCarrying\nAmount Accumulated\nAmortization Net\nCarrying\nValue\nAmortized Intangible Assets Licenses\n$ 199,000 $ - $ 199,000 $ (116,250) $ 82,750\nTotal $ 199,000 $ - $ 199,000 $ (116,250) $ 82,750\n5. Accrued Expenses\nThe following table presents accrued expenses:\nJune 30,\n2023 2022\nAccrued compensation $ 470,896 $ 445,651\nWarranty reserve 32,078 32,078\nTax payable 101,103 100,380\nOther accruals 47,901 323,887\nTotal accrued expenses $ 651,978 $ 901,996\nAccrued compensation as of June 30, 2023 and 2022 primarily relates to payroll, vacation accruals, and sales tax payable.\n6. Line of Credit\nOn June 29, 2018 the Company entered a business loan agreement with TD bank receiving a line of credit evidenced by a promissory note of $250,000. The interest is subject to change based on changes in an independent index which the Wall Street Journal Prime. The index rate at the date of the agreement is 5.000% per annum. Interest on the unpaid principal balance of the note is calculated using a rate of 0.740 percentage points over the index, adjusted if necessary for any minimum and maximum rate limitations, resulting in an initial rate of 5.740% per annum based on a year of 360 days. The Company was required to put $250,000 in the TD bank savings account as collateral. Mr. Richard J. DePiano Sr. executed a guarantee of the loan in favor of TD Bank. Mr. DePiano Sr. passed away on October 3, 2019, therefore the guarantee is now assumed by his estate.\nAs of June 30, 2022, the line of credit balance was $201,575 with TD bank. TD bank elected to exercise the term note conversion option to convert the loan balance of $201,575 to a five-year term note effective March 29, 2023 (\"the Conversion Date\"). The scheduled monthly principal and interest payments in the amount of $4,247 began on April 29, 2023. Commencing on the Conversion Date, the aggregate principal balance outstanding bears interest at a fixed per annum rate of 9.49% pursuant to the loan's terms and conditions. $168,313 was reported as long term note payable as of March 31, 2023.\nYear ending June 30,\nTD Note Payment\n2024 $ 34,057\n2025 37,434\n2026 41,145\n2027 45,224\n2028 35,708\nTotal\n$ 193,568\n7. Long-term debt\nPaycheck Protection Program (\"PPP\") loan\nOn April 27, 2020, the Company entered into a PPP loan for $500,000 in connection with the CARES Act related to COVID-19. The full amount of the PPP loan was classified as current as of June 30, 2022. The full amount of the PPP loan and accrued interest were forgiven on August 13, 2021, and reported as other income during the year ended June 30, 2022.\nEconomic Injury Disaster (\"EIDL\") loan\nEIDL is designed to provide economic relief to businesses that are currently experiencing a temporary loss of revenue due to the Coronavirus (COVID-19) pandemic. EIDL proceeds can be used to cover a wide array of working capital and normal operating expenses, such as continuation to health care benefits, rent, utilities, and fixed debt payments. The Company received $150,000 EIDL loan. The annual interest rate is 3.75%. The payment term is 30 years and the monthly payment is $731 from July 1, 2021. The EIDL loan is secured by the tangible and intangible personal property of the Company. The EIDL loan is secured by the tangible and intangible personal property of the Company.\nThe future annual principal amounts and accrued interest to be paid as of June 30, 2023 are as follows:\nYear ending June 30, EIDL Loan Payment\n2024 $ 3,105\n2025 3,202\n2026 3,324\n2027 3,744\n2028 3,594\nThereafter 132,571\nTotal $ 149,540\n8. Capital Stock Transactions\nStock Option Plans\nAs of June 30, 2023, the Company had in effect two employee stock option plans that provide for incentive and non-qualified stock options. Under the terms of the plans, options may not be granted for less than the fair market value of the Common Stock at the date of grant. Vesting generally occurs ratably between one and five years and for non-employee directors, immediately, and the options are exercisable over a period no longer than 10 years after the grant date. As of June 30, 2023, options to purchase 157,000 shares of the Companys common stock were outstanding and exercisable.\nThe following is a summary of Escalons stock option activity and related information for the fiscal years ended June 30, 2023 and 2022:\n2023 2022\nCommon\nStock\nOptions Weighted\nAverage\nExercise\nPrice Common\nStock\nOptions Weighted\nAverage\nExercise\nPrice\nOutstanding at the beginning of the year 157,000 $ 1.47 157,000 $ 1.47\nGranted - - - -\nExercised - - - -\nForfeited - - - $ -\nOutstanding at the end of the year 157,000 $ 1.47 157,000 $ 1.47\nExercisable at the end of the year 157,000 $ 1.47 157,000 1.47\nThe following table summarizes information about stock options outstanding as of June 30, 2023:\nNumber\nOutstanding\nat June 30,\n2023 Weighted\nAverage\nRemaining\nContractual\nLife (Years) Weighted\nAverage\nExercise\nPrice Number\nExercisable\nat June 30,\n2023 Weighted\nAverage\nExercise\nPrice\nRange of Exercise Prices\n$0.79 21,000 2.83 $ 0.79 21,000 $ 0.79\n$1.45 to $2.12 136,000 0.83 $ 1.57 136,000 $ 1.57\nTotal 157,000 157,000\nThere was no compensation expense related to stock options for the years ended June 30, 2023 and 2022.\n9. Income Taxes\nThe provision for income taxes for the years ended June 30, 2023 and 2022 consists of the following:\n2023 2022\nCurrent income tax provision\nFederal $ - $ -\nState - -\n- -\nDeferred income tax provision\nFederal 64,399 (82,615)\nState 30,666 (23,605)\nChange in valuation allowance (95,065) 106,220\n- -\nIncome tax expense (benefit) $ - $ -\nIncome tax expense (benefit) as a percentage of loss for the years ended June 30, 2023 and 2022 differ from statutory federal income tax rate due to the following:\n2023 2022\nStatutory federal income tax rate 21.00 % 21.00 %\nPermanent differences 0.00 % 0.00 %\nValuation allowance (21.00) % (21.00) %\nEffective income tax rate 0.00 % 0.00 %\nThe components of the net deferred income tax assets and liabilities as of June 30, 2023 and 2022 are as follows:\n2023 2022\nDeferred income tax assets:\nNet operating loss carryforward $ 7,028,242 7,430,299\nStock options 33,877 -\nOperating lease liability 155,111 -\nAllowance for doubtful accounts 47,391 49,633\nAccrued vacation 70,084 48,969\nInventory reserve 107,914 73,583\nAccelerated depreciation 290,921 57,628\nWarranty reserve 9,879 6,736\nTotal deferred income tax assets 7,743,419 7,666,848\nValuation allowance (7,554,406) (7,649,471)\n189,013 17,377\nDeferred income tax liabilities:\nAccelerated depreciation (21,554) (17,377)\nRight of use asset (167,459) -\nTotal deferred income tax liabilities (189,013) (17,377)\n$ - $ -\nAs of June 30, 2023, the Company has a valuation allowance of $7,554,406, which primarily relates to the federal net operating loss carryforwards. During the year ended June 30, 2023, the valuation allowance decreased by $95,065 and during the year ended June 30, 2022, the valuation increased by $106,220. The valuation allowance is a result of management evaluating its estimates of the net operating losses available to the Company as they relate to the results of operations of acquired businesses subsequent to their being acquired by the Company. The Company evaluates a variety of factors in determining the amount of the valuation allowance, including the Companys earnings history, the number of years the Companys operating loss can be carried forward, the existence of taxable temporary differences, and near-term earnings expectations. Future reversal of the valuation allowance will be recognized either when the benefit is realized or when it has been determined that it is more likely than not that the benefit will be realized through future earnings. The Company has available federal and state net operating loss carry forwards of approximately $32,814,000 and $2,427,000, respectively, of which $25,376,000 and $2,029,000, respectively, will expire over the next ten years, $5,209,000 and $398,000, respectively, will expire in years eleven through twenty, and $2,229,000 and $0, respectively, which will not expire.\nThe Company continues to monitor the realization of its deferred tax assets based on changes in circumstances, for example, recurring periods of income for tax purposes following historical periods of cumulative losses or changes in tax laws or regulations. The Companys income tax provision and managements assessment of the realizability of the Companys deferred tax assets involve significant judgments and estimates. If taxable income expectations change, in the near term the Company may be required to reduce the valuation allowance which would result in a material benefit to the Companys results of operations in the period in which the benefit is determined by the Company.\nFiscal year ended June 30, 2019 and subsequent years remain open to tax examination. However, to the extent allowed by law, the tax authorities may have the right to examine prior periods where net operating losses were generated and carried forward, and make adjustments up to the amount of the net operating loss amount. At June 30, 2023, the Company did not have any significant unrecognized tax positions. The Company has provided what it believes to be an appropriate amount of tax for items that involve interpretation to the tax law. However, events may occur in the future that will cause the Company to reevaluate the current provision and may result in an adjustment to the liability for taxes.\n10. Commitments and Contingencies\nLegal Proceedings\nThe Company, from time to time is involved in various legal proceedings and disputes that arise in the normal course of business. These matters have included intellectual property disputes, contract disputes, employment disputes and other matters.\nThe Company does not believe that the resolution of any of these matters has had or is likely to have a material adverse impact on the Companys business, financial condition or results of operations.\n11. Related Party Transactions and Preferred Stock\nOn February 14, 2018, the Company entered into a Debt Exchange Agreement (the Exchange Agreement) with Mr. DePiano Sr., the Company's former Chairman and DP Associates Inc. Profit-Sharing Plan of which Mr. DePiano Sr. is the sole owner and sole trustee (the Holders). Pursuant to the terms of the Exchange Agreement, effective February 15, 2018, the Holders exchanged a total of $645,000 principal amount of debt related to the accounts receivable factoring program for 2,000,000 shares of Series A Convertible Preferred Stock (the Preferred Stock). As of June 30, 2023 and 2022, the related party interest accrual of $112,389 related to the debt prior to the exchange, remained as an on demanded payable.\nEach share of Preferred Stock entitles the Holder thereof to 13 votes per share and will vote together with all other classes and series of stock of the Company as a single class on all actions to be taken by the Companys stockholders. As a result of this voting power, the Holders as of June 30, 2023 beneficially own approximately 77.81% of the voting power on all actions to be taken by the Companys stockholders.\nSubject to the terms and conditions of Preferred Stock, the holder of any share or shares of the Preferred Stock has the right, at its option at any time, to convert each such share of Preferred Stock (except that, upon any liquidation of the Company, the right of conversion will terminate at the close of business on the business day fixed for payment of the amounts distributable on the Preferred Stock) into 2.15 shares of Common Stock (the Conversion Ratio). The Conversion Ratio is subject to standard provisions for adjustment in the event of a subdivision or combination of the Companys Common Stock and upon any reorganization or reclassification of the capital stock of the Company. If the Holders were to convert their shares of Preferred Stock into Common Stock at the Conversion Ratio the Holders would receive a total of 4,300,000 shares of Common Stock, or approximately 36.70% of the then outstanding shares of Common Stock assuming such conversion.\nEach outstanding share of the Preferred Stock accrues dividends calculated cumulatively at the annual rate of $.0258 per share (such amount subject to equitable adjustment in the event of any stock dividend, stock split, combination, reclassification other similar event), payable upon the earlier of (i) a liquidation, dissolution or winding up of the Company or (ii) conversion of the Preferred Stock into Common Stock. Upon either of such events, all such accrued and unpaid dividends, whether or not earned or declared, to and until the date of such event, will become immediately due and payable and will be paid in full. The dividends payable to the holders of the Preferred Stock is payable in cash or, at the election of any such holder, in a number of additional shares of Common Stock equal to the amount of the dividend expressed in dollars divided by the then applicable Conversion Ratio, described above. As of June 30, 2023 and 2022 the cumulative dividends payable is $277,331 ($0.1387 per share) and $225,731 ($0.1129 per share), respectively.\nMr. DePiano Sr. passed away on October 3, 2019 and left a will by which he appointed Richard J. DePiano, Jr., the Chief Executive Officer of the Company, as executor. Richard DePiano Jr. was elected to serve as chairman of the Company's board. Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano Sr.'s estate.\n12. Concentration of Credit Risk\nCredit Risk\nFinancial Instruments, which potentially subject the Company to concentration of credit risk, consist principally of cash and cash equivalents, restricted cash and trade receivables. Concentration of credit risk with respect to trade receivables is generally diversified due to the large number of entities comprising the Company's customer base and their dispersion across geographic areas principally within the United States and international. The Company routinely address the financial strength of its customer and, as a consequence, believes that its receivable credit risk exposure is limited. The Company does not require customers to post collateral.\nMajor Customer\nOne customer accounted for approximately 11% of net sales during the year ended June 30, 2023. One customer accounted for approximately 11% of net sales during the year ended June 30, 2022.\nAs of June 30, 2023 the Company had one customer that represents approximately 24% of the total accounts receivable balance. As of June 30, 2022 the Company had one customer that represents approximately 13% of the total accounts receivable balance.\nMajor Supplier\nThe Company's two largest suppliers accounted for 42% and 11% of the total purchases for the year ended June 30, 2023. The Company's two largest suppliers accounted for the total purchases for 39% and 12% of total purchases for the year ended June 30, 2022. As of June 30, 2023 the Company had two suppliers that represent approximately 36% and 11% of the total accounts payable balance. As of June 30, 2022 the Company had one supplier that represents 36% of the total accounts payable balance.\nForeign Sales\nDomestic and international sales from continuing operations are as follows:\n(in thousands) For the Years Ended June 30,\n2023 2022\nDomestic $ 7,044 57.8 % $ 5,720 53.4 %\nForeign 5,136 42.2 % 4,983 46.6 %\nTotal $ 12,180 100.0 % $ 10,703 100.0 %\n13. Leases\nThe Company leases certain facilities and equipment under operating leases. Total lease expense, under ASC 842, was included in cost of revenue and marketing, general and administrative costs in the Company's unaudited condensed consolidated statement of operations for the years ended June 30, 2023 and 2022 as follows:\nYear Ended June 30,\n2023 2022\nOperating lease costs:\nFixed $ 341,136 $ 337,774\nTotal: $ 341,136 $ 337,774\nSupplemental cash flow information was as follows:\nYear Ended June 30,\n2023 2022\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows for operating leases $ 343,241 $ 334,912\nTotal $ 343,241 $ 334,912\nLeases recorded on the balance sheet consist of the following:\nJune 30,\nLeases (operating) Classification on the Balance Sheet 2023 2022\nAssets\nOperating lease ROU assets Right-of-use asset $ 503,647 $ 788,257\nLiabilities\nCurrent Current portion of operating lease liabilities $ 329,638 $ 304,737\nNon-current Operating lease liabilities $ 214,103 $ 538,794\nThe table below reconciles the undiscounted future minimum lease payments (displayed by year and in the aggregate)\nunder noncancelable operating leases with terms of more than one year to the total operating lease liabilities\nrecognized on the consolidated balance sheets as of June 30, 2023:\nThe aggregate future lease payments for operating leases as of June 30, 2023 were as follows:\nOperating\n2024 $ 351,042\n2025 212,415\n2026 3,928\n2027 1,200\n2028 1,200\nThereafter 600\nTotal lease payments 570,385\nLess interest 26,644\nPresent value of lease liabilities $ 543,741\nAverage lease terms and discount rates were as follows:\nJune 30,\n2023 2022\nWeighted-average remaining lease terms (years)\nOperating leases\n1.67 3.35\nWeighted-average discount rate\nOperating leases\n5.69 % 5.65 %\n.\nITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone\nITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this Annual Report on Form 10-K, the Companys management\nevaluated, with the participation of the Companys principal executive officer and principal financial officer, the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934). Based upon that evaluation, the Companys principal executive officer and principal financial officer concluded that the Companys disclosure controls and procedures are not effective in ensuring that information required to be disclosed by the Company in the reports that we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and is accumulated and communicated to our management, including the Companys principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934). The Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that:\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Companys assets;\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Companys receipts and expenditures are being made only in accordance with authorizations of the Companys management and directors; and\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on our financial statements.\nAs of the end of the period covered by this Annual Report on Form 10-K, the Companys management evaluated, with the participation of its principal executive officer and principal financial officer, the effectiveness of the Companys internal control over financial reporting. This evaluation was conducted using the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission 2013. We identified a material weakness in internal control related to the proper design and implementation of controls over our estimates relating to the valuation of inventory specifically over the precision of managements review. Based on our evaluation and as a result of the material weakness identified, our management, with the participation of our principal executive officer and principal financial officer, concluded that our internal control over financial reporting was not effective as of June 30, 2023.\nRemediation Plan for Existing Material Weakness\nManagement is committed to the remediation of the material weakness described above. As such, controls will be added to both increase the precision of the review of all assumptions used in the valuation of inventory and allowance for doubtful accounts, as well as to conduct senior management reviews of any and all material estimates that are applied in these instances\nPursuant to the rules of the SEC, the Companys managements report on internal control over financial reporting is furnished with this Annual Report on Form 10-K and shall not be deemed to be filed for purposes of Section 18 of the Securities Exchange Act of 1934 or otherwise subject to the liabilities of that section, nor shall it be deemed to be incorporated by reference in any filing under the Securities Act of 1933 or Securities Exchange Act of 1934.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys independent registered public accounting firm regarding the Company's internal control over financial reporting. The Companys managements report on internal control over financial reporting was not subject to attestation by the Companys independent registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permits the Company to provide only the Companys managements report on internal control over financial reporting in this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during our fourth fiscal quarter of 2023 that would have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nITEM 9B. OTHER INFORMATION\nNone\nPART III.\nITEM 10 DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth information with respect to our directors and our executive officers.\nName Age Position\nRichard J. DePiano, Jr. 57 Chief Executive Officer, President and General Counsel and Director\nMark G. Wallace 54 Chief Operating Officer and Principal Financial & Accounting Officer\nLisa A. Napolitano 60 Director\nC. Todd Trusk 56 Director\nJohn P. Dogum 57 Director\nDavid J. Jocavini 47 Director\nSet forth below are the names, positions held and business experience, including during the past five years, of our directors and executive officers as of October 13, 2023. Officers serve at the discretion of the board of directors.\nMr. DePiano, Jr. has been a Class I director since May 9, 2013, and was appointed our President and General Counsel of the Company on January 1, 2008 and our Chief Executive Officer on September 28, 2013. Previously, he was Chief Operating Officer and General Counsel. Mr. DePiano, Jr. joined us in November of 2000 as Vice President Corporate and Legal Affairs. He currently serves as a member of the board of directors, and served as President from 2008 to 2009 of the Delaware Valley Corporate Counsel Association (DELVACCA). Mr. DePiano, Jr. also serves as a member of the nominations committee, Chairman of the law school initiative committee and member of the pro-bono committee of DELVACCA. He also is vice chairman of the board of directors of the Montgomery County Industrial Development Authority.\nMr. Wallace was appointed our Chief Operating Officer on January 1, 2008. He was also appointed the Principal Financial and Accounting Officer on July 7, 2017. Mr. Wallace has worked with us since 1997. Previous to being appointed Chief Operating Officer he was Executive Vice President of our Escalon Digital Solutions and Trek Medical subsidiaries. He has jointly held the position of Vice President-Quality, with quality and regulatory responsibilities for all of our companies, and has also previously served as Operations Manager at Sonomed, Inc. and our Quality Manager. He had previously worked with Lunar Corp. (now GE Healthcare) and Trek Medical. He holds a B.S. in Industrial Engineering and a M.S. in Manufacturing Systems Engineering, both from the University of Wisconsin-Madison, is a senior member of the American Society of Quality, and has over 20 years experience in the medical device industry.\nMs. Napolitano has served on our board of directors since 2003. She is a Class II director. Ms. Napolitano has served as a Tax Manager at Global Tax Management, Inc., a provider of compliance support services for both federal and state taxes, since 1998. Ms. Napolitano is a Certified Public Accountant in Pennsylvania. Ms. Napolitano qualifies for our board of directors and audit committee based on her extensive experience in public accounting and through her understanding of internal controls, accounting principles, business operations and regulatory compliance. We believe that Ms. Napolotanos financial, operational and regulatory experience qualifies her to serve as a member of our board of directors and our audit committee.\nMr. Trusk was appointed as a member of our Board in 2015 as a Class I director. He is President of BroadBase Solutions, Inc., an information technology staffing and consulting firm since 2000. Mr. Trusk was a sales executive with CB Technologies an IT consulting firm based in the Philadelphia suburbs. Before joining CB Technologies Mr. Trusk held several sales and sales management positions within the disposable medical equipment markets. B. Braun Medical from 1994 to 1997 and Calgon Vestal Labs, a subsidiary of Merck & Co.; Inc. from 1991 to 1994. We believe Mr. Trusks operational, executive and professional experience qualifies him to serve as a member of our Board and our Audit Committee.\nMr. Jacovini was appointed as a Class III Director in February 2018. He previously served as the Chief Financial Officer of LaFrance Corp, a global manufacturer specializing in on-product branding. Previously, he was President and Founder of Innovator Management LLC, a sponsor of mutual funds and exchange traded funds, from 2011 to 2017. He served as Chief Executive Officer and portfolio manager of Academy Asset Management LLC from 2007 to 2015. Between 2007 and 2017 he held the positions of President, Treasurer, and Trustee of the Academy Funds Trust, a registered investment company. Prior to that, he worked on Wall Street as a derivatives marketer at Deutsche Bank AG and as a municipal strategist at Prudential Securities Incorporated. He holds a BA from the College of the Holy Cross and an MBA from the MIT Sloan School of Management. We believe Mr. Jacovini's operational, executive and professional experience qualifies him to serve as a member of our Board and our Audit Committee.\nMr. Dogum was appointed as a Class II director in February 2018. John P. Dogum is a partner at Martin Law where he has been working since 2003. He has concentrated his practice on litigating Pennsylvania workers compensation cases since 1992. Mr. Dogum has served as consultant to major insurers in addition to frequently appearing before Workers Compensation\nJudges in the Eastern region of Pennsylvania. Mr. Dogum has argued a case of first impression before the Third Circuit Court of Appeals. He has also litigated claims under the Federal Longshore and Harbor Workers Compensation Act. Mr. Dogum has been listed as a Pennsylvania Super Lawyer since 2009 as well as a Top 100 Philadelphia Super Lawyer in 2009. He has been listed as a Best Lawyer since 2013 by Best Lawyers in America. He holds a BS from the Susquehanna University and JD from the Widener University School of Law. We believe Mr. Dogum's operational, executive and professional experience qualifies him to serve as a member of our Board and our Audit Committee.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires our directors, executive officers and 10% stockholders to file initial reports of ownership and reports of changes in ownership of our common stock and other equity securities with the Securities and Exchange Commission (the \"SEC\"). The directors, executive officers and 10% stockholders are required to furnish us with copies of all Section 16(a) reports they file. Based on a review of the copies of such reports furnished to us and written representations from our directors and executive officers that no other reports were required, we believe that our directors, executive officers and 10% stockholders complied with all Section 16(a) filing requirements applicable to them for the year ended June 30, 2023.\nCode of Conduct and Ethics\nOur board of directors has adopted a Code of Conduct and Ethics, which applies to all of our directors, the principal executive officer, principal financial officer, principal accounting officer or controller and persons performing similar functions, officers and employees. Our Code of Conduct and Ethics is posted in the Corporate Governance section of our Internet web site at www.escalonmed.com. Any amendments to, or grant of waiver with respect to, any provision of our Code of Conduct and Ethics, will be disclosed noting the nature of such amendment or waiver in the Corporate Governance section of our Internet web site at www.escalonmed.com or by other appropriate means as required or permitted under the applicable regulations of the SEC.\nAudit Committee Members and Financial Expert\nThe members of the audit committee of our board of directors are Ms. Napolitano, Mr. Trusk, John P. Dogum and David J. Jacovini. Our board of directors has determined that each audit member has the attributes, education and experience of, and therefore is, an audit committee financial expert, as such term is defined in Item 407(d)(5) of Regulation S-K, and that each member of our audit committee is independent, as such term is defined in the applicable regulations of the Securities.\nITEM 11. EXECUTIVE COMPENSATION\nOverview of Executive Employment Agreements and Equity-Based Awards\nOn February 14, 2018, the Company entered into a Debt Exchange Agreement (the Exchange Agreement) with Mr. DePiano Sr., the Company's former Chairman and DP Associates Inc. Profit-Sharing Plan of which Mr. DePiano Sr. is the sole owner and sole trustee (the Holders). Pursuant to the terms of the Exchange Agreement, effective February 15, 2018, the Holders exchanged a total of $645,000 principal amount of debt related to the accounts receivable factoring program for 2,000,000 shares of Series A Convertible Preferred Stock (the Preferred Stock).\nEach share of Preferred Stock entitles the Holder thereof to 13 votes per share and will vote together with all other classes and series of stock of the Company as a single class on all actions to be taken by the Companys stockholders. As a result of this voting power, the Holders as of June 30, 2023 beneficially own approximately 77.81% of the voting power on all actions to be taken by the Companys stockholders.\nSubject to the terms and conditions of Preferred Stock, the holder of any share or shares of the Preferred Stock has the right, at its option at any time, to convert each such share of Preferred Stock (except that, upon any liquidation of the Company, the right of conversion will terminate at the close of business on the business day fixed for payment of the amounts distributable on the Preferred Stock) into 2.15 shares of Common Stock (the Conversion Ratio). The Conversion Ratio is subject to standard provisions for adjustment in the event of a subdivision or combination of the Companys Common Stock and upon any reorganization or reclassification of the capital stock of the Company. If the Holders were to convert their shares of Preferred Stock into Common Stock at the Conversion Ratio the Holders would receive a total of 4,300,000 shares of Common Stock, or approximately 36.70% of the then outstanding shares of Common Stock assuming such conversion.\nEach outstanding share of the Preferred Stock accrues dividends calculated cumulatively at the annual rate of $.0258 per share (such amount subject to equitable adjustment in the event of any stock dividend, stock split, combination,\nreclassification other similar event), payable upon the earlier of (i) a liquidation, dissolution or winding up of the Company or (ii) conversion of the Preferred Stock into Common Stock. Upon either of such events, all such accrued and unpaid dividends, whether or not earned or declared, to and until the date of such event, will become immediately due and payable and will be paid in full. The dividends payable to the holders of the Preferred Stock is payable in cash or, at the election of any such holder, in a number of additional shares of Common Stock equal to the amount of the dividend expressed in dollars divided by the then applicable Conversion Ratio, described above.As of June 30, 2023 and 2022 the cumulative dividends payable is $277,331 ($0.1387 per share) and $225,731 ($0.1129 per share), respectively.\nMr. DePiano Sr. passed away on October 3, 2019 and left a will by which he appointed Richard J. DePiano, Jr., the Chief Executive Officer of the Company, as executor. Richard DePiano Jr. was elected to serve as chairman of the Company's board. Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano Sr.'s estate.\nCompensation of Named Executive Officers\nSummary Compensation Table\nThe following table sets forth certain summary information concerning compensation that we paid or accrued to or on behalf of each of our executive officers (the Named Executive Officers) during each of the fiscal years ended June 30, 2023, 2022 and 2021.\nName and Principal Position Year Salary Bonus Stock\nAwards Option\nAwards (1) Non-Equity\nIncentive Plan\nCompensation Nonqualified\nDeferred\nCompensation\nEarnings All Other\nCompensation (1) Total\nRichard J. DePiano, Jr.\nChief Executive Officer, President and General Counsel 2023 $ 182,000 $ - $ - $ - $ - $ - $ 22,000 $ 204,000\n2022 $ 182,000 $ - $ - $ - $ - $ - $ 22,000 $ 204,000\n2021 $ 182,000 $ - $ - $ - $ - $ - $ 22,000 $ 204,000\nMark Wallace\nChief Operating Officer and Principal Financial & Accounting Officer 2023 $ 149,000 $ - $ - $ - $ - $ - $ 12,810 $ 161,810\n2022 $ 149,000 $ - $ - $ - $ - $ - $ 12,810 $ 161,810\n2021 $ 149,000 $ - $ - $ - $ - $ - $ 12,810 $ 161,810\n(1)Includes payment of, (a) an automobile allowance and (b) insurance premiums paid for life insurance.\nGrants of Plan Based Awards\nOutstanding Equity Awards at Fiscal Year-End\nThe following table sets forth certain information regarding grants of equity awards held by the named executive officers as of June 30, 2023.\nOption Awards\nName Number of\nSecurities\nUnderlying\nUnexercised\nOptions Number of\nSecurities\nUnderlying\nUnexercised\nOptions Equity\nIncentive\nPlan Awards:\nNumber of\nSecurities\nUnderlying\nUnexercised\nUnearned\nOptions Option\nExercise\nPrice Option\nExpiration\nDate\nExercisable Unexercisable\nRichard J. DePiano, Jr.\n10,000 - - $ 1.57 5/7/2024\n10,000 - - $ 0.79 5/7/2026\n45,000 - - $ 1.57 5/7/2024\nMark Wallace\n35,000 - - $ 1.57 5/7/2024\nCompensation of Directors\nThe compensation committee of our board recommends director compensation to our board of directors based on factors it considers appropriate, market conditions and trends and the recommendations of management. In fiscal 2023, none of our non-employee directors received any compensation.\nAccounting and Tax Considerations\nOn July 1, 2007, we adopted in the FASB issued authoritative guidance related to share based payments. Under this accounting standard, we are required to value stock options granted in fiscal year 2007 and in subsequent fiscal years under the fair value method and expense those amounts in the income statement over the vesting period of the stock option. We were also required to value unvested stock options granted prior to our adoption of the FASB issued authoritative guidance related to share based payments under the fair value method and amortize such expense in the income statement over the stock options remaining vesting period. A material portion of such amortizing expense relates to option grants made to our executive officers.\nITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following table indicates, as of October 13, 2023 information about the beneficial ownership of our common stock by (1) each director as of October 13, 2023, (2) each Named Executive Officer, (3) all directors and executive officers as of October 13, 2023 as a group and (4) each person who we know beneficially owns more than 5% of our common stock. All such shares were owned directly with sole voting and investment power unless otherwise indicated.\nBeneficial Ownership Table\nName (1) Amount of\nBeneficial\nOwnership\nof\nOutstanding\nShares (1) Percent\nof Class Amount of\nBeneficial\nOwnership of\nShares\nUnderlying\nOptions Amount of\nAggregate\nBeneficial\nOwnership Aggregate\nPercent of\nClass\nRichard J. DePiano, Jr. 4,440,833 (2) 59.9 % 65,000 4,505,833 (2) 59.5 %\nMark G. Wallace - - % 35,000 35,000 *\nLisa A. Napolitano - - % 2,000 2,000 *\nC. Todd Trusk 250 - % 7,000 7,250 *\nJohn P. Dogum - - % - - *\nDavid J. Jocavinni - - % - - *\nAll Directors and Executive Officers as a group (7 persons) 4,441,083 59.9 % 109,000 4,550,083 60.1 %\n(*) Less than one percent\n(1)Information furnished by each individual named. This table includes shares that are owned jointly, in whole or in part with the persons spouse, or individually by his or her spouse. No shares held by board members or named executive officers are pledged as collateral.\n(2) Includes the shares of Mr. Depiano Sr. as Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano.Sr.'s estate.\nEquity Compensation Plan Information\nThe following table sets forth information, as of June 30, 2023, with respect to compensation plans under which shares of our common stock are authorized for issuance.\nPlan Category Number of Shares to be\nissued upon exercise of\noutstanding stock options\n(a) Weighted-average exercise\nprice of outstanding stock\noptions\n(b) Number of securities remaining\navailable for future issuance\nunder equity compensation plans\n(excluding securities reflected in\ncolumn a))\n(c)\nEquity Compensation plans approved by stockholders 157,000 $ 1.47\nEquity Compensation plans not approved by stockholders - - -\n157,000 $ 1.47 -\nITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nRelated Person Transactions\nWe recognize that related person transactions present a heightened risk of conflicts of interest and can create the appearance of a conflict of interest. Therefore, all proposed related person transactions are disclosed to our board of directors before we enter into the transaction, and, if the transaction continues for more than one year, the continuation is reviewed annually by our board of directors.\nOn February 14, 2018, the Company entered into a Debt Exchange Agreement (the Exchange Agreement) with Mr. DePiano Sr., the Company's former Chairman and DP Associates Inc. Profit-Sharing Plan of which Mr. DePiano Sr. is the sole owner and sole trustee (the Holders). Pursuant to the terms of the Exchange Agreement, effective February 15, 2018, the Holders exchanged a total of $645,000 principal amount of debt related to the accounts receivable factoring program for 2,000,000 shares of Series A Convertible Preferred Stock (the Preferred Stock).\nEach share of Preferred Stock entitles the Holder thereof to 13 votes per share and will vote together with all other classes and series of stock of the Company as a single class on all actions to be taken by the Companys stockholders. As a result of this voting power, the Holders as of June 30, 2023 beneficially own approximately 77.81% of the voting power on all actions to be taken by the Companys stockholders.\nSubject to the terms and conditions of Preferred Stock, the holder of any share or shares of the Preferred Stock has the right, at its option at any time, to convert each such share of Preferred Stock (except that, upon any liquidation of the Company, the right of conversion will terminate at the close of business on the business day fixed for payment of the amounts distributable on the Preferred Stock) into 2.15 shares of Common Stock (the Conversion Ratio). The Conversion Ratio is subject to standard provisions for adjustment in the event of a subdivision or combination of the Companys Common Stock and upon any reorganization or reclassification of the capital stock of the Company. If the Holders were to convert their shares of Preferred Stock into Common Stock at the Conversion Ratio the Holders would receive a total of 4,300,000 shares of Common Stock, or approximately 36.70% of the then outstanding shares of Common Stock assuming such conversion.\nEach outstanding share of the Preferred Stock accrues dividends calculated cumulatively at the annual rate of $.0258 per share (such amount subject to equitable adjustment in the event of any stock dividend, stock split, combination, reclassification other similar event), payable upon the earlier of (i) a liquidation, dissolution or winding up of the Company or\n(ii) conversion of the Preferred Stock into Common Stock. Upon either of such events, all such accrued and unpaid dividends, whether or not earned or declared, to and until the date of such event, will become immediately due and payable and will be paid in full. The dividends payable to the holders of the Preferred Stock is payable in cash or, at the election of any such holder, in a number of additional shares of Common Stock equal to the amount of the dividend expressed in dollars divided by the then applicable Conversion Ratio, described above. As of June 30, 2023 and 2022 the cumulative dividends payable is $277,331 ($0.1387 per share) and $225,731 ($0.1129 per share), respectively.\nMr. DePiano Sr. passed away on October 3, 2019 and left a will by which he appointed Richard J. DePiano, Jr., the Chief Executive Officer of the Company, as executor. Richard DePiano Jr. was elected to serve as chairman of the Company's board. Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano Sr.'s estate.\nDirector Independence\nOur board of directors has determined that, Lisa Napolitano, C. Todd Trusk, John P. Dogum and David J. Jocavini are\nindependent, as such term is defined in the applicable rules of the SEC.\nITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table summarizes the aggregate fees billed to Escalon Medical Corp. by Friedman LLP (through September 2022) and its post-merger successor Marcum LLP (after September 2022), for the fiscal years ended June 30, 2023 and 2022.\nFor the years ended June 30,\n2023 2022\nAudit Fees $ 129,000 $ 129,000\nAudit-Related Fees - -\nTax Fees 40,000 -\nAll Other Fees - -\nTotal Fees $ 169,000 $ 129,000\nIn the table above, pursuant to definitions under the applicable regulations of the SEC, audit fees are fees for professional services rendered for the audit of our annual financial statements and review of our financial statements included in our quarterly reports on Form 10-Q and for services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements; audit-related fees are fees for assurance and related services that are reasonably related to the performance of the audit and review of our financial statements, and primarily include accounting consultations and audits in connection with potential acquisitions; tax fees are fees for tax compliance, tax advice and tax planning; and all other fees are fees for any services not included in the first three categories.\nOur audit committee is responsible for pre-approving all audit services and permitted non-audit services to be performed by our principal accountant, except in those instances which do not require such pre-approval pursuant to the applicable regulations of the SEC. The audit committee has established policies and procedures for its pre-approval of audit services and permitted non-audit services and, from time to time, the audit committee reviews and revises its policies and procedures for pre-approval.\nITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n1.Documents Filed as Part of This Annual Report on Form 10-K:\na.Financial Statements\nThe following consolidated financial statements of the Company and its subsidiaries are included in Part II, Item 8 of this Annual Report on Form 10-K:\nReport of Independent Registered Public Accounting Firm (PCAOB ID 688)\nReport of Independent Registered Public Accounting Firm (PCAOB ID 711)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the years ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\n2.Financial Statement Schedules\nAll other schedules have been omitted because the required information is not applicable or the information is included in the Companys Consolidated Financial Statements or the related Notes to Consolidated Financial Statements.\n3.EXHIBITS\nThe following is a list of exhibits filed as part of this Annual Report on Form 10-K, where so indicated by footnote, exhibits that were previously filed, are incorporated by reference. For exhibits incorporated by reference, the location of the exhibit in the previous filing is indicated parenthetically, followed by the footnote reference to the previous filing.\n3.1 (a) Restated Articles of Incorporation of the Company.\n(b) Agreement and Plan of Merger dated as of September 28, 2001 between Escalon Pennsylvania, Inc. and Escalon Medical Corp. (8)\n(c) Statement with respect to shares dated February 15, 2018. (18)\n3.2 Bylaws of Registrant. (8)\n4.1 Description of Securities\n10.1 Employment Agreement between the Company and Richard J. DePiano dated May 12, 1998. (6)**\n10.2 Companys amended and restated 1999 Equity Incentive Plan. (13) **\n10.30 Manufacturing Supply and Distribution Agreement between Sonomed, Inc. and Ophthalmic Technologies, Inc. dated as of March 11, 2004. (15)\n10.40 Supplemental Executive Retirement Benefit Agreement for Richard DePiano dated June 23, 2005. (16)**\n10.5 2013 Equity Incentive Plan dated December 27, 2013 incorporate by reference.\n10.6 Business Loan Agreement with TD Bank, N.A. dated June 29, 2018. (19)\n10.70 Promissory Note dated June 29, 2018 between the Company and TD Bank N.A. (19)\n10.8 Agreement of Deposit Account dated June 29, 2018 between the Company and TD Bank N.A. (19)\n21 Subsidiaries. (11)\n23.1 Consent of Independent Registered Public Accounting Firm (*).\n23.3 Consent of Independent Registered Public Accounting Firm (*).\n31.1 Certification of the Chief Executive Officer pursuant to Section 302 of the Sarbanes Oxley Act of 2002 (*).\n31.2 Certification of the Chief Financial Officer pursuant to Section 302 of the Sarbanes Oxley Act of 2002 (*).\n32.1 Certification of the Chief Executive Officer pursuant to Section 906 of the Sarbanes Oxley Act of 2002 (*).\n32.2 Certification of the Chief Financial Officer pursuant to Section 906 of the Sarbanes Oxley Act of 2002 (*).\n101. SCH Inline XBRL Taxonomy Extension Schema Document\n101. CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101. DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101. LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101. PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith\n** Management contract of compensatory plan\n(1) Filed as an exhibit to Pre-Effective Amendment No. 2 to the Companys Registration Statement on Form S-1 dated November 9, 1993 (Registration No. 33-69360).\n(2) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 1994.\n(3) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 1995.\n(4) Filed as an exhibit to the Companys Form 8-K dated February 27, 2008.\n(5) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 1999.\n(6) Filed as an exhibit to the Companys Form 8-K/A, dated March 31, 2000\n(7) Filed as an exhibit to the Companys Registration Statement on Form s-* dated February 25, 2000 (Registration No. 333-31138).\n(8) Filed as an exhibit to the Companys Proxy Statement on Schedule 14A, as filed by the Company with the SEC on September 21, 2001.\n(9) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 2001.\n(10) Filed as an exhibit to the Companys Form 10-Q for the quarter ended March 31, 2001.\n(11) Filed as an exhibit to the Companys Form 10-KSB/A for the year ended June 30, 2002.\n(12) Filed as an exhibit to the Companys Form 10-Q for the quarter ended December 31, 2002.\n(13) Filed as an exhibit to the Companys Form 10-Q for the quarter ended December 31, 2003.\n(14) Filed as an exhibit to the Companys Registration Statement on Form S-3 dated April 8, 2004 (Registration No. 333-114332).\n(15) Filed as an exhibit to the Companys Form 10-Q for the quarter ended March 31, 2004.\n(16) Filed as an exhibit to the Companys Form 8-K, dated June 23, 2005.\n(17) Filed as an exhibit to the Companys Form 8-K, dated May 6, 2010.\n(18) Filed as an exhibit to the Company's Form 8-K, dated February 15, 2018\n(19) Filed as exhibit to the Company's Form 8-K dated July 6, 2018\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nEscalon Medical Corp.\n(Registrant)\nBy: /s/ Richard J. DePiano, Jr.\nRichard J. DePiano, Jr.\nChief Executive Officer\nDated: October 13, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nBy: /s/ Richard J. DePiano, Jr. Chairman and Chief Executive Officer (Principal Executive Officer) October 13, 2023\nRichard J. DePiano, Jr.\nBy: /s/ Mark Wallace Chief Operating Officer and Principal Financial & Accounting Officer\nOctober 13, 2023\nMark Wallace\nBy: /s/ John P. Dogum Director October 13, 2023\nJohn P. Dogum\nBy: /s/ Lisa Napolitano Director October 13, 2023\nLisa Napolitano\nBy: /s/ C. Todd Trusk Director October 13, 2023\nC. Todd Trusk\nBy: /s/ David J Jacovini Director October 13, 2023\nDavid J Jacovini   ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nAs of the end of the period covered by this Annual Report on Form 10-K, the Companys management\nevaluated, with the participation of the Companys principal executive officer and principal financial officer, the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934). Based upon that evaluation, the Companys principal executive officer and principal financial officer concluded that the Companys disclosure controls and procedures are not effective in ensuring that information required to be disclosed by the Company in the reports that we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and is accumulated and communicated to our management, including the Companys principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934). The Companys internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that:\nPertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the Companys assets;\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP, and that the Companys receipts and expenditures are being made only in accordance with authorizations of the Companys management and directors; and\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on our financial statements.\nAs of the end of the period covered by this Annual Report on Form 10-K, the Companys management evaluated, with the participation of its principal executive officer and principal financial officer, the effectiveness of the Companys internal control over financial reporting. This evaluation was conducted using the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission 2013. We identified a material weakness in internal control related to the proper design and implementation of controls over our estimates relating to the valuation of inventory specifically over the precision of managements review. Based on our evaluation and as a result of the material weakness identified, our management, with the participation of our principal executive officer and principal financial officer, concluded that our internal control over financial reporting was not effective as of June 30, 2023.\nRemediation Plan for Existing Material Weakness\nManagement is committed to the remediation of the material weakness described above. As such, controls will be added to both increase the precision of the review of all assumptions used in the valuation of inventory and allowance for doubtful accounts, as well as to conduct senior management reviews of any and all material estimates that are applied in these instances\nPursuant to the rules of the SEC, the Companys managements report on internal control over financial reporting is furnished with this Annual Report on Form 10-K and shall not be deemed to be filed for purposes of Section 18 of the Securities Exchange Act of 1934 or otherwise subject to the liabilities of that section, nor shall it be deemed to be incorporated by reference in any filing under the Securities Act of 1933 or Securities Exchange Act of 1934.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys independent registered public accounting firm regarding the Company's internal control over financial reporting. The Companys managements report on internal control over financial reporting was not subject to attestation by the Companys independent registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permits the Company to provide only the Companys managements report on internal control over financial reporting in this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during our fourth fiscal quarter of 2023 that would have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone\nPART III. ITEM 10 DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth information with respect to our directors and our executive officers.\nName Age Position\nRichard J. DePiano, Jr. 57 Chief Executive Officer, President and General Counsel and Director\nMark G. Wallace 54 Chief Operating Officer and Principal Financial & Accounting Officer\nLisa A. Napolitano 60 Director\nC. Todd Trusk 56 Director\nJohn P. Dogum 57 Director\nDavid J. Jocavini 47 Director\nSet forth below are the names, positions held and business experience, including during the past five years, of our directors and executive officers as of October 13, 2023. Officers serve at the discretion of the board of directors.\nMr. DePiano, Jr. has been a Class I director since May 9, 2013, and was appointed our President and General Counsel of the Company on January 1, 2008 and our Chief Executive Officer on September 28, 2013. Previously, he was Chief Operating Officer and General Counsel. Mr. DePiano, Jr. joined us in November of 2000 as Vice President Corporate and Legal Affairs. He currently serves as a member of the board of directors, and served as President from 2008 to 2009 of the Delaware Valley Corporate Counsel Association (DELVACCA). Mr. DePiano, Jr. also serves as a member of the nominations committee, Chairman of the law school initiative committee and member of the pro-bono committee of DELVACCA. He also is vice chairman of the board of directors of the Montgomery County Industrial Development Authority.\nMr. Wallace was appointed our Chief Operating Officer on January 1, 2008. He was also appointed the Principal Financial and Accounting Officer on July 7, 2017. Mr. Wallace has worked with us since 1997. Previous to being appointed Chief Operating Officer he was Executive Vice President of our Escalon Digital Solutions and Trek Medical subsidiaries. He has jointly held the position of Vice President-Quality, with quality and regulatory responsibilities for all of our companies, and has also previously served as Operations Manager at Sonomed, Inc. and our Quality Manager. He had previously worked with Lunar Corp. (now GE Healthcare) and Trek Medical. He holds a B.S. in Industrial Engineering and a M.S. in Manufacturing Systems Engineering, both from the University of Wisconsin-Madison, is a senior member of the American Society of Quality, and has over 20 years experience in the medical device industry.\nMs. Napolitano has served on our board of directors since 2003. She is a Class II director. Ms. Napolitano has served as a Tax Manager at Global Tax Management, Inc., a provider of compliance support services for both federal and state taxes, since 1998. Ms. Napolitano is a Certified Public Accountant in Pennsylvania. Ms. Napolitano qualifies for our board of directors and audit committee based on her extensive experience in public accounting and through her understanding of internal controls, accounting principles, business operations and regulatory compliance. We believe that Ms. Napolotanos financial, operational and regulatory experience qualifies her to serve as a member of our board of directors and our audit committee.\nMr. Trusk was appointed as a member of our Board in 2015 as a Class I director. He is President of BroadBase Solutions, Inc., an information technology staffing and consulting firm since 2000. Mr. Trusk was a sales executive with CB Technologies an IT consulting firm based in the Philadelphia suburbs. Before joining CB Technologies Mr. Trusk held several sales and sales management positions within the disposable medical equipment markets. B. Braun Medical from 1994 to 1997 and Calgon Vestal Labs, a subsidiary of Merck & Co.; Inc. from 1991 to 1994. We believe Mr. Trusks operational, executive and professional experience qualifies him to serve as a member of our Board and our Audit Committee.\nMr. Jacovini was appointed as a Class III Director in February 2018. He previously served as the Chief Financial Officer of LaFrance Corp, a global manufacturer specializing in on-product branding. Previously, he was President and Founder of Innovator Management LLC, a sponsor of mutual funds and exchange traded funds, from 2011 to 2017. He served as Chief Executive Officer and portfolio manager of Academy Asset Management LLC from 2007 to 2015. Between 2007 and 2017 he held the positions of President, Treasurer, and Trustee of the Academy Funds Trust, a registered investment company. Prior to that, he worked on Wall Street as a derivatives marketer at Deutsche Bank AG and as a municipal strategist at Prudential Securities Incorporated. He holds a BA from the College of the Holy Cross and an MBA from the MIT Sloan School of Management. We believe Mr. Jacovini's operational, executive and professional experience qualifies him to serve as a member of our Board and our Audit Committee.\nMr. Dogum was appointed as a Class II director in February 2018. John P. Dogum is a partner at Martin Law where he has been working since 2003. He has concentrated his practice on litigating Pennsylvania workers compensation cases since 1992. Mr. Dogum has served as consultant to major insurers in addition to frequently appearing before Workers Compensation\nJudges in the Eastern region of Pennsylvania. Mr. Dogum has argued a case of first impression before the Third Circuit Court of Appeals. He has also litigated claims under the Federal Longshore and Harbor Workers Compensation Act. Mr. Dogum has been listed as a Pennsylvania Super Lawyer since 2009 as well as a Top 100 Philadelphia Super Lawyer in 2009. He has been listed as a Best Lawyer since 2013 by Best Lawyers in America. He holds a BS from the Susquehanna University and JD from the Widener University School of Law. We believe Mr. Dogum's operational, executive and professional experience qualifies him to serve as a member of our Board and our Audit Committee.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires our directors, executive officers and 10% stockholders to file initial reports of ownership and reports of changes in ownership of our common stock and other equity securities with the Securities and Exchange Commission (the \"SEC\"). The directors, executive officers and 10% stockholders are required to furnish us with copies of all Section 16(a) reports they file. Based on a review of the copies of such reports furnished to us and written representations from our directors and executive officers that no other reports were required, we believe that our directors, executive officers and 10% stockholders complied with all Section 16(a) filing requirements applicable to them for the year ended June 30, 2023.\nCode of Conduct and Ethics\nOur board of directors has adopted a Code of Conduct and Ethics, which applies to all of our directors, the principal executive officer, principal financial officer, principal accounting officer or controller and persons performing similar functions, officers and employees. Our Code of Conduct and Ethics is posted in the Corporate Governance section of our Internet web site at www.escalonmed.com. Any amendments to, or grant of waiver with respect to, any provision of our Code of Conduct and Ethics, will be disclosed noting the nature of such amendment or waiver in the Corporate Governance section of our Internet web site at www.escalonmed.com or by other appropriate means as required or permitted under the applicable regulations of the SEC.\nAudit Committee Members and Financial Expert\nThe members of the audit committee of our board of directors are Ms. Napolitano, Mr. Trusk, John P. Dogum and David J. Jacovini. Our board of directors has determined that each audit member has the attributes, education and experience of, and therefore is, an audit committee financial expert, as such term is defined in Item 407(d)(5) of Regulation S-K, and that each member of our audit committee is independent, as such term is defined in the applicable regulations of the Securities. ITEM 11. EXECUTIVE COMPENSATION\nOverview of Executive Employment Agreements and Equity-Based Awards\nOn February 14, 2018, the Company entered into a Debt Exchange Agreement (the Exchange Agreement) with Mr. DePiano Sr., the Company's former Chairman and DP Associates Inc. Profit-Sharing Plan of which Mr. DePiano Sr. is the sole owner and sole trustee (the Holders). Pursuant to the terms of the Exchange Agreement, effective February 15, 2018, the Holders exchanged a total of $645,000 principal amount of debt related to the accounts receivable factoring program for 2,000,000 shares of Series A Convertible Preferred Stock (the Preferred Stock).\nEach share of Preferred Stock entitles the Holder thereof to 13 votes per share and will vote together with all other classes and series of stock of the Company as a single class on all actions to be taken by the Companys stockholders. As a result of this voting power, the Holders as of June 30, 2023 beneficially own approximately 77.81% of the voting power on all actions to be taken by the Companys stockholders.\nSubject to the terms and conditions of Preferred Stock, the holder of any share or shares of the Preferred Stock has the right, at its option at any time, to convert each such share of Preferred Stock (except that, upon any liquidation of the Company, the right of conversion will terminate at the close of business on the business day fixed for payment of the amounts distributable on the Preferred Stock) into 2.15 shares of Common Stock (the Conversion Ratio). The Conversion Ratio is subject to standard provisions for adjustment in the event of a subdivision or combination of the Companys Common Stock and upon any reorganization or reclassification of the capital stock of the Company. If the Holders were to convert their shares of Preferred Stock into Common Stock at the Conversion Ratio the Holders would receive a total of 4,300,000 shares of Common Stock, or approximately 36.70% of the then outstanding shares of Common Stock assuming such conversion.\nEach outstanding share of the Preferred Stock accrues dividends calculated cumulatively at the annual rate of $.0258 per share (such amount subject to equitable adjustment in the event of any stock dividend, stock split, combination,\nreclassification other similar event), payable upon the earlier of (i) a liquidation, dissolution or winding up of the Company or (ii) conversion of the Preferred Stock into Common Stock. Upon either of such events, all such accrued and unpaid dividends, whether or not earned or declared, to and until the date of such event, will become immediately due and payable and will be paid in full. The dividends payable to the holders of the Preferred Stock is payable in cash or, at the election of any such holder, in a number of additional shares of Common Stock equal to the amount of the dividend expressed in dollars divided by the then applicable Conversion Ratio, described above.As of June 30, 2023 and 2022 the cumulative dividends payable is $277,331 ($0.1387 per share) and $225,731 ($0.1129 per share), respectively.\nMr. DePiano Sr. passed away on October 3, 2019 and left a will by which he appointed Richard J. DePiano, Jr., the Chief Executive Officer of the Company, as executor. Richard DePiano Jr. was elected to serve as chairman of the Company's board. Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano Sr.'s estate.\nCompensation of Named Executive Officers\nSummary Compensation Table\nThe following table sets forth certain summary information concerning compensation that we paid or accrued to or on behalf of each of our executive officers (the Named Executive Officers) during each of the fiscal years ended June 30, 2023, 2022 and 2021.\nName and Principal Position Year Salary Bonus Stock\nAwards Option\nAwards (1) Non-Equity\nIncentive Plan\nCompensation Nonqualified\nDeferred\nCompensation\nEarnings All Other\nCompensation (1) Total\nRichard J. DePiano, Jr.\nChief Executive Officer, President and General Counsel 2023 $ 182,000 $ - $ - $ - $ - $ - $ 22,000 $ 204,000\n2022 $ 182,000 $ - $ - $ - $ - $ - $ 22,000 $ 204,000\n2021 $ 182,000 $ - $ - $ - $ - $ - $ 22,000 $ 204,000\nMark Wallace\nChief Operating Officer and Principal Financial & Accounting Officer 2023 $ 149,000 $ - $ - $ - $ - $ - $ 12,810 $ 161,810\n2022 $ 149,000 $ - $ - $ - $ - $ - $ 12,810 $ 161,810\n2021 $ 149,000 $ - $ - $ - $ - $ - $ 12,810 $ 161,810\n(1)Includes payment of, (a) an automobile allowance and (b) insurance premiums paid for life insurance.\nGrants of Plan Based Awards\nOutstanding Equity Awards at Fiscal Year-End\nThe following table sets forth certain information regarding grants of equity awards held by the named executive officers as of June 30, 2023.\nOption Awards\nName Number of\nSecurities\nUnderlying\nUnexercised\nOptions Number of\nSecurities\nUnderlying\nUnexercised\nOptions Equity\nIncentive\nPlan Awards:\nNumber of\nSecurities\nUnderlying\nUnexercised\nUnearned\nOptions Option\nExercise\nPrice Option\nExpiration\nDate\nExercisable Unexercisable\nRichard J. DePiano, Jr.\n10,000 - - $ 1.57 5/7/2024\n10,000 - - $ 0.79 5/7/2026\n45,000 - - $ 1.57 5/7/2024\nMark Wallace\n35,000 - - $ 1.57 5/7/2024\nCompensation of Directors\nThe compensation committee of our board recommends director compensation to our board of directors based on factors it considers appropriate, market conditions and trends and the recommendations of management. In fiscal 2023, none of our non-employee directors received any compensation.\nAccounting and Tax Considerations\nOn July 1, 2007, we adopted in the FASB issued authoritative guidance related to share based payments. Under this accounting standard, we are required to value stock options granted in fiscal year 2007 and in subsequent fiscal years under the fair value method and expense those amounts in the income statement over the vesting period of the stock option. We were also required to value unvested stock options granted prior to our adoption of the FASB issued authoritative guidance related to share based payments under the fair value method and amortize such expense in the income statement over the stock options remaining vesting period. A material portion of such amortizing expense relates to option grants made to our executive officers. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following table indicates, as of October 13, 2023 information about the beneficial ownership of our common stock by (1) each director as of October 13, 2023, (2) each Named Executive Officer, (3) all directors and executive officers as of October 13, 2023 as a group and (4) each person who we know beneficially owns more than 5% of our common stock. All such shares were owned directly with sole voting and investment power unless otherwise indicated.\nBeneficial Ownership Table\nName (1) Amount of\nBeneficial\nOwnership\nof\nOutstanding\nShares (1) Percent\nof Class Amount of\nBeneficial\nOwnership of\nShares\nUnderlying\nOptions Amount of\nAggregate\nBeneficial\nOwnership Aggregate\nPercent of\nClass\nRichard J. DePiano, Jr. 4,440,833 (2) 59.9 % 65,000 4,505,833 (2) 59.5 %\nMark G. Wallace - - % 35,000 35,000 *\nLisa A. Napolitano - - % 2,000 2,000 *\nC. Todd Trusk 250 - % 7,000 7,250 *\nJohn P. Dogum - - % - - *\nDavid J. Jocavinni - - % - - *\nAll Directors and Executive Officers as a group (7 persons) 4,441,083 59.9 % 109,000 4,550,083 60.1 %\n(*) Less than one percent\n(1)Information furnished by each individual named. This table includes shares that are owned jointly, in whole or in part with the persons spouse, or individually by his or her spouse. No shares held by board members or named executive officers are pledged as collateral.\n(2) Includes the shares of Mr. Depiano Sr. as Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano.Sr.'s estate.\nEquity Compensation Plan Information\nThe following table sets forth information, as of June 30, 2023, with respect to compensation plans under which shares of our common stock are authorized for issuance.\nPlan Category Number of Shares to be\nissued upon exercise of\noutstanding stock options\n(a) Weighted-average exercise\nprice of outstanding stock\noptions\n(b) Number of securities remaining\navailable for future issuance\nunder equity compensation plans\n(excluding securities reflected in\ncolumn a))\n(c)\nEquity Compensation plans approved by stockholders 157,000 $ 1.47\nEquity Compensation plans not approved by stockholders - - -\n157,000 $ 1.47 - ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nRelated Person Transactions\nWe recognize that related person transactions present a heightened risk of conflicts of interest and can create the appearance of a conflict of interest. Therefore, all proposed related person transactions are disclosed to our board of directors before we enter into the transaction, and, if the transaction continues for more than one year, the continuation is reviewed annually by our board of directors.\nOn February 14, 2018, the Company entered into a Debt Exchange Agreement (the Exchange Agreement) with Mr. DePiano Sr., the Company's former Chairman and DP Associates Inc. Profit-Sharing Plan of which Mr. DePiano Sr. is the sole owner and sole trustee (the Holders). Pursuant to the terms of the Exchange Agreement, effective February 15, 2018, the Holders exchanged a total of $645,000 principal amount of debt related to the accounts receivable factoring program for 2,000,000 shares of Series A Convertible Preferred Stock (the Preferred Stock).\nEach share of Preferred Stock entitles the Holder thereof to 13 votes per share and will vote together with all other classes and series of stock of the Company as a single class on all actions to be taken by the Companys stockholders. As a result of this voting power, the Holders as of June 30, 2023 beneficially own approximately 77.81% of the voting power on all actions to be taken by the Companys stockholders.\nSubject to the terms and conditions of Preferred Stock, the holder of any share or shares of the Preferred Stock has the right, at its option at any time, to convert each such share of Preferred Stock (except that, upon any liquidation of the Company, the right of conversion will terminate at the close of business on the business day fixed for payment of the amounts distributable on the Preferred Stock) into 2.15 shares of Common Stock (the Conversion Ratio). The Conversion Ratio is subject to standard provisions for adjustment in the event of a subdivision or combination of the Companys Common Stock and upon any reorganization or reclassification of the capital stock of the Company. If the Holders were to convert their shares of Preferred Stock into Common Stock at the Conversion Ratio the Holders would receive a total of 4,300,000 shares of Common Stock, or approximately 36.70% of the then outstanding shares of Common Stock assuming such conversion.\nEach outstanding share of the Preferred Stock accrues dividends calculated cumulatively at the annual rate of $.0258 per share (such amount subject to equitable adjustment in the event of any stock dividend, stock split, combination, reclassification other similar event), payable upon the earlier of (i) a liquidation, dissolution or winding up of the Company or\n(ii) conversion of the Preferred Stock into Common Stock. Upon either of such events, all such accrued and unpaid dividends, whether or not earned or declared, to and until the date of such event, will become immediately due and payable and will be paid in full. The dividends payable to the holders of the Preferred Stock is payable in cash or, at the election of any such holder, in a number of additional shares of Common Stock equal to the amount of the dividend expressed in dollars divided by the then applicable Conversion Ratio, described above. As of June 30, 2023 and 2022 the cumulative dividends payable is $277,331 ($0.1387 per share) and $225,731 ($0.1129 per share), respectively.\nMr. DePiano Sr. passed away on October 3, 2019 and left a will by which he appointed Richard J. DePiano, Jr., the Chief Executive Officer of the Company, as executor. Richard DePiano Jr. was elected to serve as chairman of the Company's board. Mr. DePiano, Jr. qualified as executor and has control over the listed shares in his capacity as executor of Mr. DePiano Sr.'s estate.\nDirector Independence\nOur board of directors has determined that, Lisa Napolitano, C. Todd Trusk, John P. Dogum and David J. Jocavini are\nindependent, as such term is defined in the applicable rules of the SEC. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table summarizes the aggregate fees billed to Escalon Medical Corp. by Friedman LLP (through September 2022) and its post-merger successor Marcum LLP (after September 2022), for the fiscal years ended June 30, 2023 and 2022.\nFor the years ended June 30,\n2023 2022\nAudit Fees $ 129,000 $ 129,000\nAudit-Related Fees - -\nTax Fees 40,000 -\nAll Other Fees - -\nTotal Fees $ 169,000 $ 129,000\nIn the table above, pursuant to definitions under the applicable regulations of the SEC, audit fees are fees for professional services rendered for the audit of our annual financial statements and review of our financial statements included in our quarterly reports on Form 10-Q and for services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements; audit-related fees are fees for assurance and related services that are reasonably related to the performance of the audit and review of our financial statements, and primarily include accounting consultations and audits in connection with potential acquisitions; tax fees are fees for tax compliance, tax advice and tax planning; and all other fees are fees for any services not included in the first three categories.\nOur audit committee is responsible for pre-approving all audit services and permitted non-audit services to be performed by our principal accountant, except in those instances which do not require such pre-approval pursuant to the applicable regulations of the SEC. The audit committee has established policies and procedures for its pre-approval of audit services and permitted non-audit services and, from time to time, the audit committee reviews and revises its policies and procedures for pre-approval. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n1.Documents Filed as Part of This Annual Report on Form 10-K:\na.Financial Statements\nThe following consolidated financial statements of the Company and its subsidiaries are included in Part II, Item 8 of this Annual Report on Form 10-K:\nReport of Independent Registered Public Accounting Firm (PCAOB ID 688)\nReport of Independent Registered Public Accounting Firm (PCAOB ID 711)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the years ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\n2.Financial Statement Schedules\nAll other schedules have been omitted because the required information is not applicable or the information is included in the Companys Consolidated Financial Statements or the related Notes to Consolidated Financial Statements.\n3.EXHIBITS\nThe following is a list of exhibits filed as part of this Annual Report on Form 10-K, where so indicated by footnote, exhibits that were previously filed, are incorporated by reference. For exhibits incorporated by reference, the location of the exhibit in the previous filing is indicated parenthetically, followed by the footnote reference to the previous filing.\n3.1 (a) Restated Articles of Incorporation of the Company.\n(b) Agreement and Plan of Merger dated as of September 28, 2001 between Escalon Pennsylvania, Inc. and Escalon Medical Corp. (8)\n(c) Statement with respect to shares dated February 15, 2018. (18)\n3.2 Bylaws of Registrant. (8)\n4.1 Description of Securities\n10.1 Employment Agreement between the Company and Richard J. DePiano dated May 12, 1998. (6)**\n10.2 Companys amended and restated 1999 Equity Incentive Plan. (13) **\n10.30 Manufacturing Supply and Distribution Agreement between Sonomed, Inc. and Ophthalmic Technologies, Inc. dated as of March 11, 2004. (15)\n10.40 Supplemental Executive Retirement Benefit Agreement for Richard DePiano dated June 23, 2005. (16)**\n10.5 2013 Equity Incentive Plan dated December 27, 2013 incorporate by reference.\n10.6 Business Loan Agreement with TD Bank, N.A. dated June 29, 2018. (19)\n10.70 Promissory Note dated June 29, 2018 between the Company and TD Bank N.A. (19)\n10.8 Agreement of Deposit Account dated June 29, 2018 between the Company and TD Bank N.A. (19)\n21 Subsidiaries. (11)\n23.1 Consent of Independent Registered Public Accounting Firm (*).\n23.3 Consent of Independent Registered Public Accounting Firm (*).\n31.1 Certification of the Chief Executive Officer pursuant to Section 302 of the Sarbanes Oxley Act of 2002 (*).\n31.2 Certification of the Chief Financial Officer pursuant to Section 302 of the Sarbanes Oxley Act of 2002 (*).\n32.1 Certification of the Chief Executive Officer pursuant to Section 906 of the Sarbanes Oxley Act of 2002 (*).\n32.2 Certification of the Chief Financial Officer pursuant to Section 906 of the Sarbanes Oxley Act of 2002 (*).\n101. SCH Inline XBRL Taxonomy Extension Schema Document\n101. CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101. DEF Inline XBRL Taxonomy Extension Definition Linkbase Document\n101. LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101. PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith\n** Management contract of compensatory plan\n(1) Filed as an exhibit to Pre-Effective Amendment No. 2 to the Companys Registration Statement on Form S-1 dated November 9, 1993 (Registration No. 33-69360).\n(2) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 1994.\n(3) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 1995.\n(4) Filed as an exhibit to the Companys Form 8-K dated February 27, 2008.\n(5) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 1999.\n(6) Filed as an exhibit to the Companys Form 8-K/A, dated March 31, 2000\n(7) Filed as an exhibit to the Companys Registration Statement on Form s-* dated February 25, 2000 (Registration No. 333-31138).\n(8) Filed as an exhibit to the Companys Proxy Statement on Schedule 14A, as filed by the Company with the SEC on September 21, 2001.\n(9) Filed as an exhibit to the Companys Form 10-KSB for the year ended June 30, 2001.\n(10) Filed as an exhibit to the Companys Form 10-Q for the quarter ended March 31, 2001.\n(11) Filed as an exhibit to the Companys Form 10-KSB/A for the year ended June 30, 2002.\n(12) Filed as an exhibit to the Companys Form 10-Q for the quarter ended December 31, 2002.\n(13) Filed as an exhibit to the Companys Form 10-Q for the quarter ended December 31, 2003.\n(14) Filed as an exhibit to the Companys Registration Statement on Form S-3 dated April 8, 2004 (Registration No. 333-114332).\n(15) Filed as an exhibit to the Companys Form 10-Q for the quarter ended March 31, 2004.\n(16) Filed as an exhibit to the Companys Form 8-K, dated June 23, 2005.\n(17) Filed as an exhibit to the Companys Form 8-K, dated May 6, 2010.\n(18) Filed as an exhibit to the Company's Form 8-K, dated February 15, 2018\n(19) Filed as exhibit to the Company's Form 8-K dated July 6, 2018\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nEscalon Medical Corp.\n(Registrant)\nBy: /s/ Richard J. DePiano, Jr.\nRichard J. DePiano, Jr.\nChief Executive Officer\nDated: October 13, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nBy: /s/ Richard J. DePiano, Jr. Chairman and Chief Executive Officer (Principal Executive Officer) October 13, 2023\nRichard J. DePiano, Jr.\nBy: /s/ Mark Wallace Chief Operating Officer and Principal Financial & Accounting Officer\nOctober 13, 2023\nMark Wallace\nBy: /s/ John P. Dogum Director October 13, 2023\nJohn P. Dogum\nBy: /s/ Lisa Napolitano Director October 13, 2023\nLisa Napolitano\nBy: /s/ C. Todd Trusk Director October 13, 2023\nC. Todd Trusk\nBy: /s/ David J Jacovini Director October 13, 2023\nDavid J Jacovini"
}