{
    "cik": "866706",
    "company": "ESCO TECHNOLOGIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-11-29",
    "period_of_report": "2022-09-30",
    "sic": "3669",
    "state_of_inc": "MO",
    "state_location": "MO",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/866706/0001410578-22-003540-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/866706/000141057822003540/ese-20220930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/866706/0001410578-22-003540.txt",
    "filename": "866706_10K_2022_0001410578-22-003540.htm",
    "content": "Item 1. Business\nThe Company\nThe Registrant is ESCO Technologies Inc., sometimes referred to in this report as ESCO. Except where the context indicates otherwise, the terms Company, we, our and us are used in this report to refer to ESCO together with its subsidiaries through which its businesses are conducted. We are:\n● A global provider of highly engineered filtration and fluid control products and integrated propulsion systems for the aviation, navy, space and process markets worldwide, as well as composite-based products and solutions for navy, defense and industrial customers;\n● An industry leader in radio frequency (RF) shielding and electromagnetic compatibility (EMC) test products; and\n● A provider of diagnostic instruments, software and services for the benefit of industrial power users and the electric utility and renewable energy industries.\nOur business is focused on generating predictable and profitable long-term growth through continued innovation and expansion of our product offerings across each of our business segments. We conduct our business through a number of wholly-owned direct and indirect subsidiaries. Our corporate strategy is centered on a multi-segment approach designed to enhance the strength and sustainability of sales and earnings growth by providing lower risk through diversification. Our stock is listed on the New York Stock Exchange, where its ticker symbol is ESE.\nOur fiscal year ends September 30. Throughout this Annual Report, unless the context indicates otherwise, references to a year (for example 2022) refer to our fiscal year ending on September 30 of that year, and references to the Consolidated Financial Statements refer to our Consolidated Financial statements included in the Financial Information section of this Annual Report beginning on page, an Index to which is provided on page.\nWe classify our business operations into three segments for financial reporting purposes, although for reporting certain financial information we treat Corporate activities as a separate segment. Our three operating segments during 2022, together with the significant domestic and foreign operating subsidiaries within each segment, are as follows:\nAerospace & Defense (A&D):\nVACCO Industries (VACCO)\nPTI Technologies Inc. (PTI)\nCrissair, Inc. (Crissair)\nGlobe Composite Solutions, LLC (Globe)\nMayday Manufacturing Co. (Mayday) (includes former subsidiary Hi-Tech Metals, Inc., which was merged into Mayday effective December 31, 2021)\nNetworks Electronic Co. (NEco)\nWestland Technologies, Inc. (Westland)\nUtility Solutions Group (USG):\nDoble Engineering Company\nI.S.A. - Altanova Group S.r.l. and affiliates (Altanova)\nMorgan Schaffer Ltd. (Morgan Schaffer)\nNRG Systems, Inc. (NRG)\nExcept as the context otherwise indicates, the term Doble as used herein includes Doble Engineering Company and ESCOs other USG subsidiaries except NRG.\nRF Shielding and Test (Test):\nETS-Lindgren Inc.\nExcept as the context otherwise indicates, the term ETS-Lindgren as used herein includes ETS-Lindgren Inc. and ESCOs other Test segment subsidiaries.\nOur operating subsidiaries are engaged primarily in the research, development, manufacture, sale and support of the products and systems described below. Their respective businesses are subject to a number of risks and uncertainties, including without limitation those discussed in Item 1A, Risk Factors. See also Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations, and Forward-Looking Information.\nWe are continually seeking ways to reduce our overall operating costs, streamline business processes and enhance the branding of our products and services. For example, during 2020 Doble consolidated its headquarters operations into a single, more cost-efficient facility in Marlborough, Massachusetts, and in 2021 it closed its facility in Toronto, Ontario and consolidated its Manta product line into its existing production capacity for Doble instruments.\nWe are also continually seeking opportunities to supplement our growth by making strategic acquisitions. In October 2020 we acquired Advanced Technology Machining, Inc. (ATM) and its sister company TECC Grinding, Inc.; in July 2021 we acquired I.S.A Altanova Group S.r.l. and its affiliated companies (Altanova); in August 2021 we acquired the assets of Phenix Technologies Inc. (Phenix); and in November 2021 we acquired Networks Electronic Company, LLC (NEco), a provider of miniature electro-explosive components and subsystems supporting mission, flight, and life-critical applications to the aerospace and defense end-markets. Information about these acquired businesses is provided in the following section, Products, and in Note 2 to the Consolidated Financial Statements.\nIn December 2019, we sold the businesses comprising our former Technical Packaging segment and used the proceeds from the sale to pay down debt and for other corporate purposes. The Technical Packaging segment was reported as Discontinued Operations in 2020. See Note 3 to the Consolidated Financial Statements.\nProducts\nOur principal products are described below. See Note 12 to the Consolidated Financial Statements for financial information regarding business segments and 10% customers.\nA&D\nBeginning in the first quarter of 2020, we renamed our Filtration/Fluid Flow segment as Aerospace & Defense to better reflect the composition of the segments products, end markets and customer characteristics. The A&D segments individual legal and operating entities and historical financial results are unchanged from what was formerly presented as Filtration/Fluid Flow.\nThe A&D segment accounted for approximately 41%, 44% and 48% of our total revenue in 2022, 2021 and 2020, respectively. This segment has seven facilities in the United States and one in Mexico.\nOur companies within this segment primarily design and manufacture specialty filtration, fluid control and naval products, including hydraulic filter elements, fluid control devices, and precision-tolerance machined components used in aerospace and defense applications, unique filter mechanisms used in micro-propulsion devices for satellites, custom designed filters for manned aircraft and submarines, products and systems to reduce vibration and/or acoustic signatures and otherwise reduce or obscure a vessels signature, and other communications, sealing, surface control and hydrodynamic related applications to enhance U.S. Navy maritime survivability; and miniature electro-explosive devices for military aircraft ejection seats and missile arming devices.\nUSG\nOur USG segment accounted for approximately 32%, 28% and 26% of our total revenue in 2022, 2021 and 2020, respectively. This segment has seven facilities in the United States, one in Canada, and eight outside North America.\nDoble is an industry leader in the development, manufacture and delivery of diagnostic testing and data management solutions that enable electric power grid operators to assess the integrity of high-voltage power delivery equipment. It combines three core elements for customers - diagnostic test instruments and condition monitoring systems, expert consulting, and testing services. The acquisition of Phenixs assets has enhanced Dobles high voltage, high current, high power test systems, components and solutions. NRG is a global market leader in the design and manufacture of decision support tools for the renewable energy industry, primarily wind and solar.\nAltanova, headquartered in Taino, Italy, provides products and services in more than 100 countries. Its strong market share in Europe and Asia creates a significant international platform for our USG segment and fills important product gaps and geographies not previously served by our existing products and solutions. Dobles offices outside North America have been consolidated with Altanovas, and going forward we expect that Altanova will represent their combined businesses in markets outside the U.S. and Canada.\nTest\nOur Test segment accounted for approximately 27%, 28% and 26% of our total revenue in 2022, 2021 and 2020, respectively. This segment has four facilities in the United States and six outside the United States.\nETS-Lindgren is an industry leader in designing and manufacturing products which provide its customers with the ability to measure and contain magnetic, electromagnetic and acoustic energy. It supplies its customers with a broad range of isolated environments and turnkey systems, including RF test facilities, acoustic test enclosures, RF and magnetically shielded rooms, secure communication facilities, RF measurement systems and broadcast and recording studios. Many of these facilities include proprietary features such as shielded doors and windows. ETS-Lindgren also provides the design, program management, installation and integration services required to successfully complete these types of facilities.\nETS-Lindgren also supplies customers with a broad range of components including RF absorptive materials, RF filters, active compensation systems, antennas, antenna masts, turntables and electric and magnetic probes, RF test cells, proprietary measurement software and other test accessories required to perform a variety of tests. ETS-Lindgren offers a variety of services including calibration for antennas and field probes, chamber certification, field surveys, customer training and a variety of product tests. ETS-Lindgrens test labs are accredited by the following organizations: American Association for Laboratory Accreditation, National Voluntary Laboratory Accreditation Program and CTIA-The Wireless Association Accredited Test Lab. ETS-Lindgren serves the acoustics, medical, health and safety, electronics, wireless communications, automotive and defense markets.\nMarketing and Sales\nOur products generally are distributed to customers through a domestic and foreign network of distributors, sales representatives, direct sales teams and in-house sales personnel.\nOur sales to international customers accounted for approximately 30%, 28% and 27% of our total revenue in 2022, 2021 and 2020, respectively. See Note 12 to the Consolidated Financial Statements for financial information by geographic area. See Item 1A, Risk Factors, for a discussion of risks related to our international operations.\nGovernment Contracts\nSome of our products are sold to the U.S. Government either directly under contracts with the Army, Navy and Air Force as well as other Government agencies or indirectly under subcontracts with their prime contractors. Direct and indirect sales to the U.S. Government, primarily related to the A&D segment, accounted for approximately 27%, 26% and 28% of our total revenue in 2022, 2021 and 2020, respectively.\nOur Government contracts primarily include firm fixed-price contracts under which work is performed and paid for at a fixed amount without adjustment for the actual costs experienced in connection with the contracts. All Government prime contracts and virtually all of our Government subcontracts provide that they may be terminated at the convenience of the Government or the customer. Upon a termination for convenience, we are entitled to receive equitable compensation from the customer for the work we completed prior to termination.\nAll of our facilities are in material compliance with appliable COVID-related Government regulations and executive orders.\nSee Item 1A, Risk Factors, for a discussion of risks related to our Government business.\nIntellectual Property\nWe own or have other rights in various forms of intellectual property (i.e., patents, trademarks, service marks, copyrights, mask works, trade secrets and other items). As a major supplier of engineered products to industrial and commercial markets, we emphasize developing intellectual property and protecting our rights therein. However, the legal protection afforded by intellectual property rights is often uncertain and can involve complex legal and factual issues. Some intellectual property rights, such as patents, have a\nlimited term, and there can be no assurance that third parties will not infringe or design around our intellectual property. Policing the unauthorized use of intellectual property is difficult, and infringement and misappropriation are persistent problems for many companies, particularly in some international markets, and in some cases, we may elect not to pursue an unauthorized user due to the high costs and uncertainties associated with litigation. Further, there can be no assurance that courts will ultimately hold issued patents or other intellectual property valid and enforceable. See Item 1A, Risk Factors.\nA number of products in the Aerospace & Defense segment are based on patented or otherwise proprietary technology that sets them apart from the competition, such as VACCOs proprietary quieting technology and Westlands signature reduction solutions. In addition, Globe has developed significant manufacturing and logistics capability useful for special hull treatments for submarines.\nIn the USG segment, our policy is to seek patent and/or other forms of intellectual property protection on new and improved products, components of products, and methods of operation for our businesses, as such developments are made. Doble has obtained and is pursuing additional patent protection on improvements to its line of diagnostic equipment and NERC CIP compliance tools and its newly-introduced Calisto R9 dissolved gas analyzer. Doble also holds an extensive library of apparatus performance information useful to entities that generate, distribute or consume electric energy, and it makes part of this library available to registered users via an Internet portal. Altonova has obtained and is pursuing additional patent protection on instruments and methods for detecting partial discharges in electrical apparatus. NRG has intellectual property related to certain LIDAR technology and applications, and has obtained and is pursuing additional patent protection on its line of bat deterrent systems, which are designed to significantly reduce bat mortality at windfarms and in other applications where bat conservation is a concern.\nIn the Test segment, we have sought patent protection for significant inventions. Examples of such inventions include novel designs for window and door assemblies used in shielded enclosures and anechoic chambers, improved acoustic techniques for sound isolation and a variety of unique antennas. In addition, the Test segment holds a number of patents, and has patents pending, on products used to perform wireless device testing.\nWe consider our patents and other intellectual property to be of significant value to each of our segments.\nBacklog\nTotal Company backlog of firm orders at September 30, 2022 was $695.0 million, representing an increase of $103.0 million (17.4%) from the backlog of $592.0 million at September 30, 2021. By segment, the backlog at September 30, 2022 and September 30, 2021, respectively, was $408.3 million and $367.2 million for A&D; $128.1 million and $91.6 million for USG; and $158.6 million and $133.2. million for Test. We estimate that as of September 30, 2022 domestic customers accounted for approximately 70% of our total firm orders and international customers accounted for approximately 30%. Of our total backlog at September 30, 2022, approximately 80% is expected to be completed in the fiscal year ending September 30, 2023.\nPurchased Components and Raw Materials\nOur products require a wide variety of components and materials. Although we have multiple sources of supply for most of our materials requirements, certain components and raw materials are supplied by sole source vendors, and our ability to perform certain contracts depends on their timely performance. In the past, these required raw materials and various purchased components generally have been available in sufficient quantities. However, we do have some risk of shortages of materials or components due to reliance on sole or limited sources of supply; and supplies of components and materials are periodically impacted by supply chain disruptions, as well as complications due to current or future trade policies. Where feasible, we engineer and qualify substitute products to avoid short-term supply issues; however, we are subject to the same supply chain risks as other electronics manufacturers. An unanticipated delay in delivery by our suppliers could result in the inability to deliver our products on-time and to meet the expectations of our customers. Additionally, we have experienced, and could continue to experience, an increase in the costs of doing business, including increasing raw material prices and transportation costs, which have and could continue to have an adverse impact on our business, results of operations, financial condition and cash flows. See also Item 1A, Risk Factors.\nOur A&D segment purchases supplies from a wide array of vendors. In most instances, multiple vendors of raw materials are screened during a qualification process to ensure that there will not be an interruption of supply should one of them underperform or discontinue operations. Nonetheless, in some situations, there is a risk of shortages due to reliance on a limited number of suppliers or because of price fluctuations due to the nature of the raw materials. For example, aerospace-grade titanium and gaseous helium, important raw materials for our A&D segment subsidiaries, may at times be in short supply.\nOur USG segment manufactures electronic instrumentation through a network of regional contract manufacturers under long-term contracts. In general, USG purchases the same kinds of component parts as do other electronic products manufacturers, and these\nelectronic components can be subject to supply chain constraints. USG purchases only a limited amount of raw materials, although some USG products require helium, which may at times be in short supply.\nOur Test segment is a vertically integrated supplier of electro-magnetic (EM) shielding and RF absorbing products, producing most of its critical RF components itself. This segment purchases significant quantities of raw materials such as polyurethane foam, polystyrene beads, steel, aluminum, copper, nickel and wood. Accordingly, it is subject to price fluctuations in the worldwide raw materials markets. While ETS-Lindgren has long-term contracts with a number of its suppliers, performance of these contracts is vulnerable to the risks described in Item 1A. Risk Factors\nThis Form 10-K, including Item 1, Business, Item 2, Properties, Item 3, Legal Proceedings, Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations, and Item 7A, Quantitative and Qualitative Disclosures About Market Risk, contains forward-looking statements within the meaning of the safe harbor provisions of the federal securities laws, as described under Forward-Looking Statements above.\nIn addition to the risks and uncertainties discussed in those Items and elsewhere in this Form 10-K, and risks and uncertainties that apply to businesses or public companies generally, the following important risk factors which are particularly applicable to our business could cause actual results and events to differ materially from those contained in any forward-looking statements, or could otherwise materially adversely affect our business, operating results or financial condition:\nCOVID-19 Related Risks\nThe continuation of the COVID-19 pandemic and the impacts of known or unknown COVID-19 variants may have a material adverse effect on our business which could continue for an unknown period of time.\nThe effects of the COVID-19 global pandemic continue to create or increase the economic, demand and operational uncertainties of our business. We have global operations, customers and suppliers, including in countries most impacted by COVID-19, and both the disease itself and the actions taken around the world to slow the spread of COVID-19 and its variants have impacted our customers and suppliers; and future developments could cause further disruptions to the Company due to the interconnected nature of our business relationships.\nWe have been and may continue to be subject to postponement or cancellation of certain contracts to which we are a party. Current restrictions and conditions have and may continue to prevent or delay us in accessing customer facilities to deliver products and provide services, and disrupt or delay our supply chain. Further, we have occasionally incurred short-term disruptions in some facility operations, and due to the nature of the COVID-19 pandemic there can be no assurance that we will not suffer facility closures or other adverse effects on our business operations in the future.\nThe facilities of our suppliers and customers have experienced, and may continue to experience, disruptions in manufacturing and supply arrangements due to the loss or disruption of critical manufacturing and supply elements, such as raw materials or other finished product components, transportation, workforce or other manufacturing and distribution capability. We may also experience failure of third parties on which we rely, including our suppliers, distributors and contractors, to meet their obligations to us, or significant restrictions in their ability to do so.\nThese facts and circumstances may have a material adverse effect on our business, results of operations, financial condition and cash flows. The extent to which the COVID-19 pandemic will impact our business, results of operations, financial condition and cash flows in the future, and the length of time these impacts may continue, will depend on future developments that are highly uncertain and cannot be predicted at this time, including new information that may emerge concerning the severity of COVID-19 and its variants, the longevity of COVID-19 and its variants, and the actions taken to contain their impacts.\nRisks Related to our Governmental and Aerospace Business\nOur sales of products to the Government depend upon continued Government funding.\nSales to the U.S. Government and its prime contractors and subcontractors represent a significant portion of our business. Over the past three fiscal years, from 26% to 28% of our revenues have been generated from sales to the U.S. Government or its contractors, primarily within our A&D segment. These sales are dependent on government funding of the underlying programs, which is generally subject to annual Congressional appropriations. There could be reductions or terminations of, or delays in, the government funding on programs which apply to us or our customers. These funding effects could adversely affect our sales and profit, and could bring about a restructuring of our operations, which could result in an adverse effect on our financial condition or results of operations. A significant portion of VACCOs, Westlands and Globes sales involve major U.S. Government programs such as NASAs Space Launch System (SLS) and U.S. Navy submarines. A reduction or delay in Government spending on these programs could have a significant adverse impact on our financial results which could extend for more than a single year.\nOur Government business increases the risk that we may not realize the full amount of our backlog.\nAs of September 30, 2022, our twelve-month backlog was approximately $556.2 million, which represents confirmed orders we believe will be recognized as revenue within the next twelve months. There can be no assurance that our customers will purchase all the orders represented in our backlog, particularly as to contracts which are subject to the U.S. Governments and its subcontractors ability to modify or terminate major programs or contracts, and if and to the extent that this occurs, our future revenues could be materially reduced.\nThe end of customer product life cycles could negatively affect our A&D segments results.\nMany of our A&D segment products are sold to be components in our customers end-products. If a customer discontinues a certain end-product line, our ability to continue to sell those components will be reduced or eliminated. The result could be a significant\ndecrease in our sales. For example, a substantial portion of PTIs revenue is generated from commercial aviation aftermarket sales. As certain aircraft are retired and replaced by newer aircraft, there could be a corresponding decrease in sales associated with our current products. Such a decrease could adversely affect our operating results.\nRisks Related to our International Business\nNegative worldwide economic conditions and related inflation, rising interest rates and a potential economic slowdown could result in a decrease in our sales and an increase in our operating costs, which could adversely affect our business and operating results.\nIf there is a worsening of global and U.S. economic and financial market conditions and additional tightening of global credit markets, many of our customers may further delay or reduce their purchases of our products. Uncertainties in the global economy may cause the utility industry and commercial market customers to experience increases in cost of capital, which could limit spending. To the extent this problem affects our customers, our sales and profits could be adversely affected. Likewise, if our suppliers face challenges in obtaining credit, they may have to increase their prices or become unable to continue to offer the products and services we use to manufacture our products, which could have an adverse effect on our business, results of operations and financial condition.\nIncreases in tariffs or other changes in trade policies could adversely affect our ability to compete.\nIn addition to the effects of increases in market prices, increases in domestic import tariffs could increase the prices to us of our foreign-sourced raw materials and product components and thereby require us to either increase our selling prices or accept reduced margins. In the case of ETS-Lindgren, for example, tariffs on imports of Chinese goods have raised the costs of components purchased by it either from its China facility or from other Chinese suppliers, and its margins in China have been impacted by the increased costs of its products made in the U.S. and sold through its Chinese business.\nIn addition, increases in foreign-country tariffs applicable to our exported products could increase the effective prices of our products to our customers in those countries unless we are able to offset the tariffs by reducing our selling prices. Any or all of these factors could decrease the demand for our products, reduce our profitability, and/or make our products less competitive than those of other manufacturers that are not subject to the same tariffs. For example, since 2019 increased tariffs imposed by China on U.S. origin goods have adversely affected sales of NRGs products in China by increasing their prices to Chinese customers.\nIn addition, trade restrictions against certain foreign-made products or entities may adversely affect our business and our ability to compete in certain markets. Our business may also be impacted by the ongoing trade tensions between the U.S. and China which are causing U.S. goods to be viewed in a less favorable light by Chinese customers.\nOur international operations expose us to fluctuations in currency exchange rates that could adversely affect our results of operations and cash flows.\nWe have significant manufacturing and sales activities in foreign countries, and our domestic operations have sales to foreign customers. Our financial results may be affected by fluctuations in foreign currencies and by the translation of the financial statements of our foreign subsidiaries from local currencies into U.S. dollars, and we may not be able to adequately or successfully hedge against these risks. In addition, a rise in the dollar against foreign currencies could make our products more expensive for foreign customers and cause them to reduce the volume of their purchases.\nEconomic, political and other risks of our international operations, including terrorist activities or armed conflict, could adversely affect our business.\nIn 2022, approximately 30% of our net sales were to customers outside the United States. Adverse changes in the political situation in certain foreign countries in which we do business could cause a decline in revenues and adversely affect our financial condition. For example, our Test segment does significant business in Asia, and changes in the Asian political climate or political changes in specific Asian countries could negatively affect our business. Several of our subsidiaries are based in Europe and could be negatively impacted by the ongoing conflict between Russia and Ukraine. If this conflict were to spread beyond these two countries, we would expect an increasingly unfavorable impact on our global business environment.\nOur international sales are also subject to other risks inherent in foreign commerce, including currency fluctuations and devaluations, differences in foreign laws, uncertainties as to enforcement of contract or intellectual property rights, and difficulties in negotiating and resolving disputes with our foreign customers.\nOur governmental sales and our international and export operations are subject to special U.S. and foreign government laws and regulations which may impose significant compliance costs, create reputational and legal risk, and impair our ability to compete in international markets.\nThe international scope of our operations subjects us to a complex system of commercial and trade regulations around the world, and our foreign operations are governed by laws and business practices that often differ from those of the U.S. In addition, laws such as the U.S. Foreign Corrupt Practices Act and similar laws in other countries increase the need for us to manage the risks of improper conduct not only by our own employees but by distributors and contractors who may not be within our direct control. Many of our exports are of products which are subject to U.S. Government regulations and controls such as the U.S. International Traffic in Arms Regulations (ITAR), which impose certain restrictions on the U.S. export of defense articles and services, and these restrictions are subject to change from time to time, including changes in the countries into which our products may lawfully be sold.\nIf we were to fail to comply with these laws and regulations, we could be subject to significant fines, penalties and other sanctions including the inability to continue to export our products or to sell our products to the U.S. Government or to certain other customers. In addition, some of these regulations may be viewed as too restrictive by our international customers, who may elect to develop their own domestic products or procure products from other international suppliers which are not subject to comparable export restrictions; and the laws, regulations or policies of certain other countries may also favor their own domestic suppliers over foreign suppliers such as the Company.\nRisks Related to our Manufacturing and Sales Operations and Technology\nDisruptions of Our Information Technology Systems, or Information Security and/or Data Privacy Breaches, Could Adversely Affect Our Business.\nWe have many information technology systems that are important to the operation of our businesses, some of which are managed by third parties. These systems are used to obtain, process, transmit and store electronic information and to manage or support a variety of integral business processes and activities. Our primary and backup computer systems are vulnerable to damage, disruptions or shutdowns during the process of upgrading or replacing software, databases or components and from power outages, computer and telecommunication failures, security breaches, natural disasters and errors by employees. Any failure in the operation of our information technology systems could adversely affect our businesses or operating results. Although losses arising from some of these issues may be covered by information security insurance, we cannot guarantee that our coverage will be adequate for all costs or losses incurred.\nGlobal information technology security threats and targeted computer crime are increasing in frequency and sophistication and pose a risk to the security of our systems and networks and the confidentiality, availability and integrity of our data and communications. We attempt to mitigate these risks through numerous measures, including implementation of standard cybersecurity controls, employee training and testing, comprehensive monitoring of our networks and systems, and maintenance of backup and protective systems. Although we do not believe we have experienced a material information security breach in the last three years, and we have incurred no fines, settlement costs or other material expenses related to information security breaches, if we were to experience such a breach it could adversely affect our reputation and result in litigation, regulatory action, liability for fines, penalties and related expenses, and costs of implementing additional data protection procedures. In addition, even though we generally do not conduct business directly with retail or individual customers or consumers we must comply with increasingly complex and rigorous regulatory standards enacted to protect business and personal data in the U.S. and elsewhere. Compliance with data privacy laws and regulations increases operational complexity, and failure to comply with legal or regulatory standards could subject us to fines and penalties, as well as legal and reputational risks, including proceedings against us by governmental entities or others. Although we maintain insurance coverage for data privacy risks, we cannot guarantee that our coverage will be adequate for all costs or losses incurred.\nA significant part of our manufacturing operations depends on a small number of third-party suppliers.\nA significant part of our manufacturing operations relies on a small number of third-party manufacturers to supply component parts or products. For example, Doble has arrangements with six manufacturers which produce and supply a substantial portion of its end-products, and one of these suppliers produces approximately 23% of Dobles products from a single location within the United States.\nAs another example, PTI has a single supplier of critical electronic components for a significant aircraft production program, and if this supplier were to discontinue producing these components the need to secure another source could pose a risk to the production program. A significant disruption in the supply of those products or others provided by a small number of suppliers could negatively affect the timely delivery of products to customers as well as future sales, which could increase costs and reduce margins.\nCertain of our other businesses are dependent upon sole source or a limited number of third-party manufacturers of parts and components. Many of these suppliers are small businesses. Since alternative supply sources are limited, there is an increased risk of adverse impacts on our production schedules and profits if our suppliers were to default in fulfilling their price, quality or delivery obligations. In addition, some of our customers or potential customers may prefer to purchase from a supplier which does not have such a limited number of sources of supply.\nIncreases in prices of raw material and components, and decreased availability of such items, could adversely affect our business.\nThe cost of raw materials and product components is a major element of the total cost of many of our products. For example, our Test segments critical components rely on purchases of raw materials from third parties. Increases in the prices of raw materials (such as steel, copper, nickel, zinc, wood and petrochemical products) could have an adverse impact on our business by, among other things, increasing costs and reducing margins. Aerospace-grade titanium and gaseous helium, important raw materials for our A&D segment, may at times be in short supply; in addition, although we try to tie our supplier pricing to long-term contracts this is not always possible, and we are experiencing price inflation on a number of products. Further, some of Dobles items of equipment which are provided to its customers for their use are in the maturity of their life cycles, which creates the risk that replacement components may be unavailable or available only at increased costs. We have experienced COVID-related short term disruptions in the supply chain which have periodically resulted in extended lead times and cost increases, and the long term impacts of these disruptions are uncertain. See also COVID-19 Related Risks above.\nIn addition, our reliance on sole or limited sources of supply of raw materials and components in each of our segments could adversely affect our business, as described in the preceding Risk Factor. The potential physical impacts of climate change, such as increased frequency and severity of storms, floods and other climatic events, could disrupt our supply chain, and cause our suppliers to incur significant costs in preparing for or responding to these effects. These and other weather-created disruptions in supply, in addition to affecting costs, could impact our ability to procure an adequate supply of these raw materials and components, and delay or prevent deliveries of products to our customers. The entire electronics industry is currently disrupted due to limited sources of supply, and we are subject to the same supply chain risks as other manufacturers of products containing electronic components.\nOur inability to timely develop new products could reduce our future sales.\nMuch of our business is dependent on the continuous development of new products and technologies to meet the changing needs of our markets on a cost-effective basis. Many of these markets are highly technical from an engineering standpoint, and the relevant technologies are subject to rapid change. If we fail to timely enhance existing products or develop new products as needed to meet market or competitive demands, we could lose sales opportunities, which would adversely affect our business. In addition, in some existing contracts with customers, we have made commitments to develop and deliver new products. If we fail to meet these commitments, the default could result in the imposition on us of contractual penalties including termination. Our inability to enhance existing products in a timely manner could make our products less competitive, while our inability to successfully develop new products may limit our growth opportunities. Development of new products and product enhancements may also require us to make greater investments in research and development than we now do, and the increased costs associated with new product development and product enhancements could adversely affect our operating results. In addition, our costs of new product development may not be recoverable if demand for our products is not as great as we anticipate it to be.\nProduct defects or customer claims could result in costly fixes, litigation and damages.\nOur business exposes us to potential product liability risks that are inherent in the design, manufacture and sale of our products and the products of third-party vendors which we use or resell, many of which are mission-critical to our customers. If there are claims related to defective products (under warranty or otherwise), particularly in a product recall situation, we could be faced with significant expenses in replacing or repairing the product. For example, the A&D segment obtains raw materials, machined parts and other product components from suppliers who provide certifications of quality which we rely on. Should these product components be defective and pass undetected into finished products, or should a finished product contain a defect, we could incur significant costs for repairs, re-work and/or removal and replacement of the defective product. In addition, if a dispute over product claims cannot be settled, arbitration or litigation may result, requiring us to incur attorneys fees and exposing us to the potential of damage awards against us.\nA major portion of our Test segments business involves working in conjunction with general contractors to produce complex building components constructed on-site, such as electronic test chambers, secure communication rooms and MRI facilities. If there are performance problems caused by either us or a contractor, they could result in cost overruns and may lead to a dispute as to which party is responsible. The resolution of such disputes can involve arbitration or litigation, and can cause us to incur significant expense including attorneys fees. In addition, these disputes could result in a reduction in revenue, a loss on a particular project, or even a significant damages award against us.\nDespite our efforts, we may be unable to adequately protect our intellectual property.\nMuch of our business success depends on our ability to protect and freely utilize our various intellectual properties, including both patents and trade secrets. Despite our efforts to protect our intellectual property, unauthorized parties or competitors may copy or otherwise obtain and use our products and technology, particularly in foreign countries such as China where the laws may not protect our proprietary rights as fully as in the United States. Our current and future actions to enforce our proprietary rights may ultimately not be successful; or in some cases we may not elect to pursue an unauthorized user due to the high costs and uncertainties associated with litigation. We may also face exposure to claims by others challenging our intellectual property rights. Any or all of these actions may divert our resources and cause us to incur substantial costs.\nEnvironmental laws and regulations or environmental contamination could increase our expenses and adversely affect our profitability.\nOur operations and properties are subject to U.S. and foreign environmental laws and regulations governing, among other things, the generation, storage, emission, discharge, transportation, treatment and disposal of hazardous materials and the clean-up of contaminated properties. In addition, governments around the world are increasingly focused on enacting laws and regulations regarding climate change and regulation of greenhouse gases. These regulations, and changes to them, could increase our cost of compliance, and our failure to comply could result in the imposition of significant fines, suspension of production, alteration of product processes, cessation of operations or other actions which could materially and adversely affect our business, financial condition and results of operations.\nWe are currently involved as a responsible party in several ongoing investigations and remediations of contaminated third-party owned properties. In addition, environmental contamination may be discovered in the future on properties which we formerly owned or operated and for which we could be legally responsible. Future costs associated with these situations, including ones which may be currently unknown to us, are difficult to quantify but could have a significant effect on our financial condition. See Item 1, Business - Environmental Matters for a discussion of these factors.\nRisks Related to Our Business Strategy and Corporate Structure\nChanges in testing standards could adversely impact our Test and USG segments sales.\nA significant portion of the business of our USG and Test segments involves sales to technology customers who need to have a third party verify that their products meet specific international and domestic test standards. If regulatory agencies were to eliminate or reduce certain domestic or international test standards, or if demand for product testing from these customers were to decrease for some other reason, our sales could be adversely affected. For example, if a regulatory authority were to relax the test standards for certain electronic devices because they were determined not to interfere with the broadcast spectrum, or if new wireless\ncommunication technologies were developed that required less testing or different types of testing, our sales of certain testing products could be significantly reduced.\nWe may not be able to identify suitable acquisition candidates or complete acquisitions successfully, which may inhibit our rate of growth.\nAs part of our growth strategy, we plan to continue to pursue acquisitions of other companies, assets and product lines that either complement or expand our existing business. However, we may be unable to implement this strategy if we are unable to identify suitable acquisition candidates or consummate future acquisitions at acceptable prices and terms. We expect to face competition for acquisition candidates which may limit the number of acquisition opportunities available to us and may result in higher acquisition prices. As a result, we may be limited in the number of acquisitions which we are able to complete and we may face difficulties in achieving the profitability or cash flows needed to justify our investment in them.\nOur acquisitions of other companies carry risk.\nAcquisitions of other companies involve numerous risks, including difficulties in the integration of the operations, technologies and products of the acquired companies, the potential exposure to unanticipated and undisclosed liabilities, the potential that expected benefits or synergies are not realized and that operating costs increase, the potential loss of key personnel, suppliers or customers of acquired businesses and the diversion of Managements time and attention from other business concerns. Although we attempt to identify and evaluate the risks inherent in any acquisition, we may not properly ascertain or mitigate all such risks, and our failure to do so could have a material adverse effect on our business.\nWe may incur significant costs, experience short-term inefficiencies, or be unable to realize expected long-term savings from facility consolidations and other business reorganizations.\nWe periodically assess the cost and operational structure of our facilities in order to manufacture and sell our products in the most efficient manner, and based on these assessments, we may from time to time reorganize, relocate or consolidate certain of our facilities. These actions may require us to incur significant costs and may result in short term business inefficiencies as we consolidate and close facilities and transition our employees; and in addition, we may not achieve the expected long-term benefits. Any or all of these factors could result in an adverse impact on our operating results, cash flows and financial condition.\nOur inability to hire or retain qualified key employees could affect our performance and revenues.\nThere is a risk of our losing key employees having engineering and technical expertise. For example, our USG segment relies heavily on engineers with significant experience and reputation in the utility industry to furnish expert consulting services and support to customers, and our other segments similarly rely on qualified and experienced employees to carry on their businesses. Despite our active recruitment efforts, there remains a shortage of these qualified engineers and other employees because of hiring competition from other companies in the industry and a generally tight labor market, possibly exacerbated by COVID-related retirements or career changes. Losing current employees or qualified candidates to other employers or for other reasons could reduce our ability to provide services and negatively affect our revenues.\nOur decentralized organizational structure presents certain risks.\nWe are a relatively decentralized company in comparison with some of our peers. This decentralization necessarily places significant control and decision-making powers in the hands of local management, which present various risks, including the risk that we may be slower or less able to identify or react to problems affecting a key business than we would in a more centralized management environment. We may also be slower to detect or react to compliance related problems (such as an employee undertaking activities prohibited by applicable law or by our internal policies), and Company-wide business initiatives may be more challenging and costly to implement, and the risks of noncompliance or failures higher, than they would be under a more centralized management structure. Depending on the nature of the problem or initiative in question, such noncompliance or failure could have a material adverse effect on our business, financial condition or result of operations.\nProvisions in our articles of incorporation, bylaws and Missouri law could make it more difficult for a third party to acquire us and could discourage acquisition bids or a change of control, and could adversely affect the market price of our common stock.\nOur articles of incorporation and bylaws contain certain provisions which could discourage potential hostile takeover attempts, including: a limitation on the shareholders ability to call special meetings of shareholders; advance notice requirements to nominate candidates for election as directors or to propose matters for action at a meeting of shareholders; a classified board of directors, which means that approximately one-third of our directors are elected each year; and the authority of our board of directors to issue, without shareholder approval, preferred stock with such terms as the board may determine. In addition, the laws of Missouri, in which we are incorporated, require a two-thirds vote of outstanding shares to approve mergers or certain other major corporate transactions, rather than a simple majority as in some other states such as Delaware. These provisions could impede a merger or other change of control not approved by our board of directors, which could discourage takeover attempts and in some circumstances reduce the market price of our common stock. Item 1B. Unresolved Staff Comments\nNone Item 2. Properties\nWe believe our buildings, machinery and equipment have been generally well maintained, are in good operating condition and are adequate for our current production requirements and other needs.\nAt September 30, 2022, our physical properties, including those described in the table below, comprised approximately 1,618,000 square feet of floor space, of which approximately 757,500 square feet were owned and approximately 860,500 square feet were leased. The table below includes our principal physical properties. We do not believe any of the omitted properties, consisting primarily of office and/or warehouse space, are individually or collectively material to our operations or business. See also Note 14 to the Consolidated Financial Statements.\nPrincipal Use(s)\n(M=Manufacturing,\nApprox.\nOwned / Leased (with\nE=Engineering, O=Office,\nOperating\nLocation\nSq. Ft.\nExpiration Date)\nW=Warehouse)\nSegment\nModesto, CA\n181,500\nLeased (9/30/2033)\nM, E, O,W\nA&D\nDenton, TX\n145,000\nLeased (9/30/2029, plus options)\nM, E, O, W\nA&D\nCedar Park, TX\n130,000\nOwned\nM, E, O, W\nTest\nOxnard, CA\n127,400\nOwned\nM, E, O, W\nA&D\nSouth El Monte, CA\n100,100\nOwned\nM, E, O, W\nA&D\nDurant, OK\n100,000\nOwned\nM, O, W\nTest\nValencia, CA\n79,300\nOwned\nM, E, O\nA&D\nMarlborough, MA\n79,100\nLeased (2/28/2037)\nM, E, O, W\nUSG\nHinesburg, VT\n77,000\nOwned\nM, E, O, W\nUSG\nStoughton, MA\n71,400\nLeased (1/31/2029)\nM, E, O, W\nA&D\nAccident, MD\n66,800\nOwned\nM, E, O, W\nUSG\nSouth El Monte, CA\n63,300\nLeased (6/30/2024)\nM, O, W\nA&D\nBrockton, MA\n47,300\nLeased (7/31/2023)\nW\nA&D\nEura, Finland\n41,500\nOwned\nM, E, O, W\nTest\nMontreal, Québec\n38,400\nLeased (8/31/2041)\nM, E, O, W\nUSG\nTianjin, China\n38,100\nLeased (11/19/2027)\nM, E, O\nTest\nMinocqua, WI\n35,400\nOwned\nM, O, W\nTest\nBologna, Italy\n28,200\nLeased (8/13/2028)\nM, E, O, W\nUSG\nOntario, CA\n26,900\nLeased (8/31/2025)\nM, E, O, W\nUSG\nChatsworth, CA\n24,800\nLeased (12/31/2023)\nM, E, O, W\nA&D\nSt. Louis, MO\n21,500\nLeased (8/31/2025)\nESCO Corporate Office\nCorporate\nTaino, Italy\n18,000\nLeased (various term ends)\nM, E, O, W\nUSG\nZola Predosa, Italy\n12,900\nLeased (1/31/2029)\nM, E, O, W\nUSG\nMorrisville, NC\n11,600\nLeased (1/31/2027), plus options\nO\nUSG\nWood Dale, IL\n10,700\nLeased (6/30/2024)\nE, O\nTest Item 3. Legal Proceedings\nAs a normal incident of the businesses in which we are engaged, various claims, charges and litigation are asserted or commenced from time to time against us. With respect to claims and litigation currently asserted or commenced against us, it is the opinion of our Management that final judgments, if any, which might be rendered against us are adequately reserved for, are covered by insurance, or are not likely to have a material adverse effect on our financial condition or results of operations. Nevertheless, given the uncertainties of litigation, it is possible that certain types of claims, charges and litigation could have a material adverse impact on us; see Item 1A, Risk Factors. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nHolders of Record. As of November 7, 2022, there were approximately 1,808 holders of record of our common stock.\nPrice Range of Common Stock and Dividends. Our common stock is listed on the New York Stock Exchange; its trading symbol is ESE.\nCompany Purchases of Equity Securities. For information about our common stock repurchase programs, please refer to Note 9 to the Consolidated Financial Statements. We did not repurchase any shares of our common stock during the fourth quarter of fiscal 2022.\nSecurities Authorized for Issuance Under Equity Compensation Plans. For information about securities authorized for issuance under our equity compensation plans, please refer to Item 12 of this Form 10-K and to Note 10 to the Consolidated Financial Statements.\nPerformance Graph. The graph and table on the following page present a comparison of the cumulative total shareholder return on our common stock as measured against the cumulative total returns of the Russell 2000 index, which is a broad equity market index, and the S&P SmallCap 600 Industrials index, which is a published industry index designed to measure the performance of small-cap companies that are classified as members of the GICS Industrials sector. The Company is a component of both the Russell 2000 index and the S&P SmallCap 600 Industrials index.\nThe measurement period begins on September 30, 2017 and measures at each September 30 thereafter. These figures assume that all dividends, if any, paid over the measurement period were reinvested, and that the starting values of each index and the investments in our common stock were $100 at the close of trading on September 30, 2017.\nCOMPARISON OF 5 YEAR CUMULATIVE TOTAL RETURN\nAmong ESCO Technologies Inc., the Russell 2000 Index,\nand the S&P SmallCap 600 Industrials Index\n9/30/17\n9/30/18\n9/30/19\n9/30/20\n9/30/21\n9/30/22\nESCO Technologies Inc.\n$\n100.00\n$\n114.13\n$\n134.04\n$\n136.42\n$\n130.83\n$\n125.19\nRussell 2000 Index\n100.00\n115.24\n104.99\n105.40\n155.66\n119.08\nS&P Small Cap 600 Industrials Index\n100.00\n121.53\n112.63\n105.97\n155.41\n134.57\nThe stock price performance included in this graph is not necessarily indicative of future stock price performance. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the Consolidated Financial Statements and Notes thereto and refers to our results from continuing operations except where noted.\nSelected financial information for each of our business segments is provided in the discussion below and in Note 12 to the Companys Consolidated Financial Statements.\nThis section includes comparisons of certain 2022 financial information to the same information for 2021. Year-to-year comparisons of the 2021 financial information to the same information for 2020 are contained in Item 7 of our Form 10-K for 2021 filed with the Securities and Exchange Commission on November 29, 2021 and available through the SECs website at https://www.sec.gov/edgar/searchedgar/companysearch.html.\nIntroduction\nWe classify our business operations into three segments for financial reporting purposes, although for reporting certain financial information we treat Corporate activities as a separate segment. Our three operating segments during 2022 were Aerospace & Defense (A&D), Utility Solutions Group (USG), and RF Shielding and Test (Test). Our operating segments are comprised of the following primary operating subsidiaries:\n● A&D: PTI Technologies Inc. (PTI); VACCO Industries (VACCO); Crissair, Inc. (Crissair); Westland Technologies, Inc. (Westland); Mayday Manufacturing Co. (Mayday); Globe Composite Solutions, LLC (Globe); and Networks Electronic Co. (NEco).\n● USG: Doble Engineering Company, I.S.A. - Altanova Group S.r.l. and affiliates (Altanova) and Morgan Schaffer Ltd. (collectively, Doble); and NRG Systems, Inc. (NRG).\n● Test: ETS-Lindgren Inc. (ETS-Lindgren).\nA&D. PTI, VACCO and Crissair primarily design and manufacture specialty filtration products, including hydraulic filter elements and fluid control devices used in commercial aerospace applications, unique filter mechanisms used in micro-propulsion devices for satellites and custom designed filters for manned aircraft and submarines. Westland and Globe design, develop and manufacture elastomeric-based signature reduction solutions for U.S. naval vessels. Mayday designs and manufactures mission-critical bushings, pins, sleeves and precision-tolerance machined components for landing gear, rotor heads, engine mounts, flight controls, and actuation systems for the aerospace and defense industries.\nUSG. Doble develops, manufactures and delivers diagnostic testing solutions that enable electric power grid operators to assess the integrity of high-voltage power delivery equipment. NRG designs and manufactures decision support tools for the renewable energy industry, primarily wind and solar.\nTest. ETS-Lindgren is an industry leader in providing its customers with the ability to identify, measure and contain magnetic, electromagnetic and acoustic energy.\nWe continue to operate with meaningful growth prospects in our primary served markets and with considerable financial flexibility. We continue to focus on new products that incorporate proprietary design and process technologies. Our Management is committed to delivering shareholder value through organic growth, ongoing performance improvement initiatives, and acquisitions.\nIn December 2019, we sold the businesses comprising our former Technical Packaging segment. We received net proceeds from the sale of approximately $184 million and recorded $76.5 million of after-tax net earnings on the sale in 2020. The Technical Packaging segment is reflected as discontinued operations in the Consolidated Financial Statements and related notes for all periods presented, in accordance with accounting principles generally accepted in the United States of America (GAAP). See Note 3 to the Consolidated Financial Statements for further discussion.\nHighlights of 2022\n● Sales, net earnings and diluted earnings per share in 2022 were $857.5 million, $82.3 million and $3.16 per share, respectively, compared to sales, net earnings and diluted earnings per share in 2021 of $715.4 million, $63.5 million and $2.42 per share, respectively.\n● Diluted EPS - GAAP for 2022 was $3.16, compared to Diluted EPS - GAAP for 2021 of $2.42.\n● Diluted EPS - As Adjusted for 2022 was $3.21 excluding $1.3 million of pretax charges (or $0.05 per shares after tax), consisting of Altanova and NEco purchase accounting adjustments, severance charges primarily at VACCO and NRG, and acquisition and management transition costs at Corporate. Diluted EPS - As Adjusted for 2021 was $2.59 excluding $6.0 million of pretax charges (or $0.17 per share after tax) consisting of one-time compensation and acquisition related costs at Corporate; restructuring costs within the USG segment, primarily facility consolidation charges; purchase accounting adjustments related to the Phenix and Altanova acquisitions, primarily inventory step-up charges; partially offset by the final settlement from the sale of the Doble Watertown facility. See Non-GAAP Financial Measures below.\nFiscal year ended\n(Dollars in millions)\nDiluted EPS - GAAP\n$\n3.16\n2.42\nOne time compensation & acquisition related costs\n0.02\n0.12\nRestructuring adjustments\n0.01\n0.08\nPurchase accounting adjustments\n0.02\n0.03\nGain on building sale\n-\n(0.06)\nDiluted EPS - As Adjusted\n$\n3.21\n2.59\n● Net cash provided by operating activities was $135.3 million in 2022 compared to $123.1 million in 2021.\n● At September 30, 2022, cash on hand was $97.7 million and outstanding debt was $153.0 million, for a net debt position (total debt less cash on hand) of approximately $55.3 million.\n● Entered orders for 2022 were $960.5 million resulting in a book-to-bill ratio of 1.12x. Backlog at September 30, 2022 was $695.0 million compared to $592.0 million at September 30, 2021.\n● The Company declared dividends of $0.32 per share during 2022, totaling $8.3 million in dividend payments.\nResults of Operations\nNet Sales\nChange\nFiscal year ended\n(Dollars in millions)\nvs. 2021\nA&D\n$\n351.4\n314.8\n11.6\n%\nUSG\n278.4\n202.9\n37.2\n%\nTest\n227.7\n197.7\n15.2\n%\nTotal\n$\n857.5\n715.4\n19.9\n%\nNet sales increased $142.1 million, or 19.9%, to $857.5 million in 2022 from $715.4 million in 2021. The increase in net sales in 2022 as compared to 2021 was mainly due to a $75.5 million increase in the USG segment, a $36.6 million increase in the A&D segment, and a $30.0 million increase in the Test segment. Organic sales increased $90 million and recent acquisitions added approximately $52 million of revenue growth in 2022 as compared to 2021.\nA&D.\nThe $36.6 million, or 11.6%, increase in net sales in 2022 as compared to 2021 was mainly due to a $16.4 million increase in net sales at PTI (including $5.2 million from NEco), a $14.1 million increase in net sales at Mayday, both primarily due to an increase in commercial aerospace sales driven by the rebound from the COVID-19 pandemic; a $3.0 million increase in net sales at Westland driven by timing of navy defense projects, a $1.5 million increase in net sales at VACCO, a $0.9 million increase in net sales at Crissair and a $0.7 million increase in net sales at Globe.\nUSG.\nThe $75.5 million, or 37.2%, increase in net sales in 2022 as compared to 2021 was mainly due to a $46.9 million increase in net sales from the 2021 acquisitions of Altanova and Phenix, a $20 million increase in core Doble products and services; and a $8.2 million increase in net sales at NRG driven by renewable energy products.\nTest.\nThe $30.0 million, or 15.2%, increase in net sales in 2022 as compared to 2021 was mainly due to a $22.3 million increase in net sales from the Companys U.S. operations, $11.5 million increase in net sales from the Companys Asian operations both driven by increased medical and industrial shielding and power filter demand, partially offset by a $3.8 million decrease in net sales from the Companys European operations, primarily driven by the timing of test and measurement chamber projects.\nOrders and Backlog\nNew orders received were $960.5 million in 2022 and $796.3 million in 2021. Order backlog was $695.0 million at September 30, 2022, compared to order backlog of $592.0 million at September 30, 2021. Orders are entered into backlog as firm purchase order commitments are received.\nBy operating segment, 2022 orders were $392.5 million related to A&D products, $314.9 million related to USG products, and $253.1 million related to Test products; and 2021 orders were $337.4 million related to A&D products, $243.9 million related to USG products (including $29 million of acquired backlog), and $215.0 million related to Test products.\nSelling, General and Administrative Expenses\nSelling, general and administrative (SG&A) expenses were $195.1 million, or 22.7% of net sales, in 2022, and $167.5 million, or 23.4% of net sales, in 2021. The increase in SG&A expenses in 2022 as compared to 2021 was mainly due to higher expenses at Doble as a result of the SG&A expenses from the Altanova and Phenix acquisitions and the return of discretionary spending to more normal levels (travel, events, etc.) as COVID-19 pandemic related restrictions eased.\nAmortization of Intangible Assets\nAmortization of intangible assets was $25.9 million in 2022 and $20.8 million in 2021, including $19.3 million and $14.3 million of amortization of acquired intangible assets in 2022 and 2021, respectively, related to our acquisitions. The amortization of acquired intangible assets related to acquisitions is included in the Corporate segments results. The remaining amortization expenses relate to other identifiable intangible assets (primarily software, patents and licenses), which are included in the respective segments operating results. The increase in amortization expense in 2022 as compared to 2021 was mainly due to the Companys recent acquisitions of Phenix, Altanova and NEco.\nOther Income or Expenses, Net\nOther income, net, was $0.3 million in 2022, compared to other income, net, of $0.9 million in 2021. There were no individually significant items in other income, net in 2022. The principal components of other income, net, in 2021 included a gain of approximately $2 million for the final settlement on the sale of the Doble Watertown, MA property, partially offset by facility consolidation charges within the USG segment (Doble Manta, Morgan Schaffer and Altanova facilities).\nNon-GAAP Financial Measures\nThe information reported herein includes the financial measures Diluted EPS As Adjusted, which we define as Diluted EPS excluding the per-share impact of discrete compensation and acquisition related costs, severance charges primarily within the A&D segment, and purchase accounting charges related to the Companys recent acquisitions (Altanova and NEco) in 2022; the per-share net impact of discrete compensation and acquisition related costs, facility consolidation charges within the USG segment, and purchase accounting charges related to the Companys recent acquisitions in 2021, partially offset by a gain on the final installment of the Doble Watertown, MA property sale; and pension plan termination charge and restructuring charges related to our facility consolidation restructuring plans in 2020; EBIT, which we define as earnings before interest and taxes; and EBIT margin, which we define as EBIT\nexpressed as a percentage of net sales. Diluted EPS - Continuing Operations As Adjusted, EBIT on a consolidated basis, and EBIT margin on a consolidated basis are not recognized in accordance with U.S. generally accepted accounting principles (GAAP). However, we believe that EBIT and EBIT margin provide investors and Management with valuable information for assessing our operating results. Management evaluates the performance of our operating segments based on EBIT and believes that EBIT is useful to investors to demonstrate the operational profitability of our business segments by excluding interest and taxes, which are generally accounted for across the entire company on a consolidated basis. EBIT is also one of the measures Management uses to determine resource allocations and incentive compensation. We believe that the presentation of EBIT, EBIT margin and Diluted EPS - Continuing Operations As Adjusted provides important supplemental information to investors by facilitating comparisons with other companies, many of which use similar non-GAAP financial measures to supplement their GAAP results. The use of non-GAAP financial measures is not intended to replace any measures of performance determined in accordance with GAAP.\nEBIT\nThe reconciliation of EBIT to a GAAP financial measure is as follows:\n(Dollars in millions)\nEBIT\n$\n111.3\n82.9\nLess: Interest expense, net\n(4.9)\n(2.2)\nLess: Income tax expense\n(24.1)\n(17.2)\nNet earnings\n$\n82.3\n63.5\nEBIT by business segment is as follows:\nChange\nFiscal year ended\n(Dollars in millions)\nvs. 2021\nA&D\n$\n68.4\n56.5\n21.1\n%\n% of net sales\n19.5\n%\n17.9\n%\nUSG\n57.6\n40.9\n40.8\n%\n% of net sales\n20.7\n%\n20.2\n%\nTest\n32.6\n27.6\n18.1\n%\n% of net sales\n14.3\n%\n14.0\n%\nCorporate\n(47.3)\n(42.1)\n(12.4)\n%\nTotal\n$\n111.3\n82.9\n34.3\n%\n% of net sales\n13.0\n%\n11.6\n%\nA&D\nThe $11.9 million, or 21.1%, increase in EBIT in 2022 as compared to 2021 was primarily due to higher sales volumes, favorable product mix and price increases at Mayday, Westland, PTI and Globe partially offset by a decrease in EBIT at Crissair and VACCO due to product mix and inflationary pressures. EBIT in 2022 was negatively impacted by a $0.3 million inventory step-up charge related to the NEco acquisition and $0.4 million of severance charges primarily at VACCO.\nUSG\nThe $16.7 million, or 40.8%, increase in EBIT in 2022 as compared to 2021 was mainly due to higher sales volumes at Doble and NRG with a favorable product mix and price increases, partially offset by inflationary pressures and increased travel and event costs. EBIT in 2022 was negatively impacted by approximately $0.5 million of inventory step-up charges related to the Altanova acquisition.\nTest\nThe $5.0 million, or 18.1%, increase in EBIT in 2022 as compared to 2021 was primarily due to leverage on higher sales volumes and price increases mainly from the segments Asian and U.S. operations partially offset by material cost and wage inflation.\nCorporate\nCorporate operating charges included in 2022 consolidated EBIT increased to $47.3 million as compared to $42.1 million in 2021 mainly due to an increase in amortization expense of acquired intangible assets related to the Companys recent acquisitions of Phenix, Altanova and NEco.\nThe Reconciliation to Consolidated Totals (Corporate) in Note 12 to the Consolidated Financial Statements represents Corporate office operating charges.\nInterest Expense, Net\nInterest expense, net was $4.9 million and $2.3 million in 2022 and 2021, respectively. The increase in interest expense in 2022 was mainly due to higher average outstanding borrowings and higher average interest rates. Average outstanding borrowings were $190 million in 2022 compared to $71 million in 2021. The weighted average interest rates were 2.11% in 2022 compared to 1.20% in 2021.\nIncome Tax Expense\nThe effective tax rates from continuing operations for 2022, 2021 and 2020 were 22.7%, 21.3% and 37.1%, respectively. The increase in the 2022 effective tax rate as compared to 2021 was due an increase in state income tax expense and a reduction in research credit benefits, increasing the rate by 1.0% and 0.6%, respectively.\nNo provision has been made in 2022 for foreign withholding of any applicable U.S. income taxes on the undistributed earnings of non-U.S. subsidiaries where these earnings are considered indefinitely invested or otherwise retained for continuing international operations. Determination of the amount of taxes that might be paid on these undistributed earnings if eventually remitted is not practicable.\nAcquisitions and Divestiture\nInformation regarding our acquisitions and divestiture during 2022, 2021 and 2020 is set forth in Notes 2 and 3 to the Consolidated Financial Statements, which Notes are incorporated by reference herein.\nAll of our acquisitions have been accounted for using the purchase method of accounting, and accordingly, the respective purchase prices were allocated to the assets (including intangible assets) acquired and liabilities assumed based on estimated fair values at the date of acquisition. The financial results from these acquisitions have been included in our financial statements from the date of acquisition.\nCapital Resources and Liquidity\nOur overall financial position and liquidity are strong. Working capital (current assets less current liabilities) increased to $254.5 million at September 30, 2022 from $191.2 million at September 30, 2021. Accounts receivable increased by $18.3 million during 2022 mainly due to a $10.4 million increase within the USG segment, a $4.7 million increase within the Test segment and a $3.2 million increase within the A&D segment, driven by timing and higher sales volumes in the current year. Inventories increased by $15.3 million during 2022 mainly due to a $7.9 million increase within the Test segment and an $8.7 million increase within the USG segment resulting primarily from the timing of receipt of raw materials to meet anticipated demand and an increase in work in process inventories due to timing of manufacturing existing orders. Accounts payable increased by $22.1 million during 2022 mainly due to a $9.6 million increase within the Test segment, a $7.1 million increase within the A&D segment and a $4.2 million increase within the USG segment, due to the timing of payments.\nNet cash provided by operating activities was $135.3 million in 2022 and $123.1 million in 2021.\nNet cash used in investing activities was $55.9 million in 2022 and $202.4 million in 2021. The decrease in net cash used in investing activities in 2022 as compared to 2021 was mainly due to a decrease in amounts spent on acquisitions in 2022. Capital expenditures were $32.1 million in 2022 and $26.7 million in 2021. The increase in 2022 as compared to 2021 was mainly due to the purchase of\nthe NRG building of approximately $10 million in the first quarter of 2022. In addition, the Company incurred expenditures for capitalized software of $12.9 million in 2022 and $8.8 million in 2021.\nThere were no commitments outstanding that were considered material for capital expenditures at September 30, 2022.\nNet cash used by financing activities was $32 million in 2022 compared to net cash provided by financing activities of $81.5 million in 2021, primarily due to lower borrowings in the current year and repurchases of common stock into treasury.\nBank Credit Facility\nA description of our credit facility (the Credit Facility) is set forth in Note 8 to the Consolidated Financial Statements, which Note is incorporated by reference herein.\nCash flow from operations and borrowings under the Credit Facility is expected to provide adequate resources to meet our capital requirements and operational needs both for the next 12 months and for the foreseeable future.\nDividends\nDuring both 2022 and 2021 we paid a regular quarterly cash dividend at an annual rate of $0.32 per share, totaling $8.3 million in both 2022 and 2021.\nOff-Balance-Sheet Arrangements\nWe had no off-balance-sheet arrangements outstanding at September 30, 2022.\nShare Repurchases\nDuring 2022, the Company repurchased approximately 257,500 shares for approximately $20.0 million.\nCritical Accounting Policies\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles (GAAP) requires Management to make estimates and assumptions in certain circumstances that affect amounts reported in the Consolidated Financial Statements. In preparing these financial statements, Management has made its best estimates and judgments of certain amounts included in the Consolidated Financial Statements, giving due consideration to materiality. We do not believe there is a great likelihood that materially different amounts would be reported under different conditions or using different assumptions related to the accounting policies described below. However, application of these accounting policies involves the exercise of judgment and use of assumptions as to future uncertainties and, as a result, actual results could differ from these estimates. Our senior Management discusses the critical accounting policies described below with the Audit and Finance Committee of our Board of Directors on a periodic basis.\nThe following discussion of critical accounting policies is intended to bring to the attention of readers those accounting policies which Management believes are critical to the Consolidated Financial Statements and other financial disclosure. It is not intended to be a comprehensive list of all significant accounting policies that are more fully described in Note 1 to the Consolidated Financial Statements.\nRevenue Recognition\nWe account for revenue in accordance with ASC Topic 606, Revenue from Contracts with Customers. The unit of account in ASC Topic 606 is a performance obligation. The transaction price for our contracts represents our best estimate of the consideration we will receive and includes assumptions regarding variable consideration, as applicable, which are based on historical, current and forecasted information. The transaction price is allocated to each distinct performance obligation within the contract and recognized as revenue when, or as, the performance obligation is satisfied. Certain of our long-term contracts contain incentive fees that can increase the transaction price. These variable amounts generally are awarded upon achievement of certain performance metrics, program milestones or cost targets and can be based upon customer discretion. We include estimated amounts in the transaction price to the\nextent it is probable that a significant reversal of cumulative revenue recognized will not occur. The estimated amounts are based on an assessment of our anticipated performance and all other information that is reasonably available to us.\nApproximately 60% of the A&D segments revenue (25% of consolidated revenue) is recognized over time as the products do not have an alternative use and either we have an enforceable right to payment for costs incurred plus a reasonable margin or the inventory is owned by the customer. Selecting the method to measure progress towards completion for our contracts requires judgment and is based on the nature of the products or services to be provided.\nThe A&D segment generally uses the cost-to-cost method to measure progress on our contracts, as the rate at which costs are incurred to fulfill a contract best depicts the transfer of control to the customer. Under this method, we measure the extent of progress towards completion based on the ratio of costs incurred to date to the estimated costs at completion of the performance obligation, and we record revenue proportionally as costs are incurred based on an estimated profit margin.\nThe Test segment generally uses the milestone output method to measure progress on our contracts because it best depicts the transfer of control to the customer that occurs as we incur costs on our contracts. Under this method, we estimate profit as the difference between total revenue and total estimated costs at completion of a contract and recognize these revenues and costs based on milestones achieved.\nTotal contract cost estimates are based on current contract specifications and expected engineering requirements and require us to make estimates on expected profit. The estimates on profit are based on judgments we make to project the outcome of future events, and can often span more than one year and include labor productivity and availability, the complexity of the work to be performed, change orders issued by our customers, and other specialized engineering and production related activities. Our cost estimation process is based on historical results of contracts and historical actuals to original estimates, and the application of professional knowledge and experience of engineers and program managers along with finance professionals to these historical results. We review and update our estimates of costs quarterly or more frequently when circumstances significantly change, which can affect the profitability of our contracts.\nFor contracts where revenue is recognized over time, we recognize changes in estimated contract revenues, costs and profits using the cumulative catch-up method of accounting. This method recognizes the cumulative effect of changes on current and prior periods with the impact of the change from inception-to-date recorded in the current period. We have net revenue recognized in the current year from performance obligations satisfied in the prior year due to changes in our estimated costs to complete the related performance obligations. We recognize anticipated losses on contracts in full in the period in which the losses become known.\nThe impact of adjustments in contract estimates on our operating earnings can be reflected in either revenue or operating costs and expenses. The aggregate impact of adjustments in contract estimates decreased our earnings before income tax and diluted earnings per share by $0.9 million and $0.03 per share, respectively, in 2022.\nIncome Taxes\nWe operate in numerous taxing jurisdictions and are subject to examination by various U.S. Federal, state and foreign jurisdictions for various tax periods. Our income tax positions are based on research and interpretations of the income tax laws and rulings in each of the jurisdictions in which we do business. Due to the subjectivity of interpretations of laws and rulings in each jurisdiction, the differences and interplay in tax laws between those jurisdictions, as well as the inherent uncertainty in estimating the final resolution of complex tax audit matters, Managements estimates of income tax liabilities may differ from actual payments or assessments.\nWe account for income taxes under the asset and liability method. We recognize deferred tax assets and liabilities for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. We measure deferred tax assets and liabilities using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. We may reduce deferred tax assets by a valuation allowance if it is more likely than not that some portion of the deferred tax assets will not be realized. We recognize the effect on deferred tax assets and liabilities of a change in tax rates in income in the period that includes the enactment date. We regularly review our deferred tax assets for recoverability and establish a valuation allowance when Management believes it is more likely than not such assets will not be recovered, taking into consideration historical operating results, expectations of future earnings, tax planning strategies, and the expected timing of the reversals of existing temporary differences.\nGoodwill and Other Long-Lived Assets\nOur Management annually reviews goodwill and other long-lived assets for impairment or whenever events or changes in circumstances indicate the carrying amount may not be recoverable. If we determine that the carrying value of the goodwill and other long-lived assets may not be recoverable, we record a permanent impairment charge for the amount by which the carrying value of the goodwill and other long-lived assets exceeds its fair value. We measure fair value based on a discounted cash flow method using a discount rate determined by Management to be commensurate with the risk inherent in each of our reporting units or asset groups current business models. Our estimates of cash flows and discount rate are subject to change due to the economic environment, including such factors as interest rates, expected market returns and volatility of markets served. We believe that Managements estimates of future cash flows and fair value are reasonable; however, changes in estimates could result in impairment charges. At September 30, 2022 we have determined that no goodwill or other long-lived assets were impaired.\nWe amortize intangible assets with estimable useful lives over their respective estimated useful lives to their estimated residual values, and review them for impairment whenever events or changes in business circumstances indicate the carrying value of the assets may not be recoverable.\nOther Matters\nQuantitative and Qualitative Disclosures about Market Risk\nMarket risks relating to our operations result primarily from changes in interest rates and changes in foreign currency exchange rates. We are exposed to market risk related to changes in interest rates, and we selectively use derivative financial instruments, including forward contracts and swaps, to manage these risks. Our Canadian subsidiary Morgan Schaffer has entered into foreign exchange contracts to manage foreign currency risk, because a portion of their revenue is denominated in U.S. dollars. We report all derivative instruments on our balance sheet at fair value. For derivative instruments designated as cash flow hedges, we defer the gain or loss on the derivative in accumulated other comprehensive income until recognized in earnings with the underlying hedged item. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot Applicable. Item 8. Financial Statements and Supplementary Data\nThe information required by this Item is incorporated by reference to the Consolidated Financial Statements of the Company, the Notes thereto, and the related Reports of Independent Registered Public Accounting Firm of Grant Thornton LLP and KPMG LLP, as set forth in the Financial Information section of this Annual Report, an Index to which is provided on page. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot Applicable. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur Chief Executive Officer and Chief Financial Officer (Certifying Officers) carried out an evaluation of the effectiveness of the design and operation of the Companys disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act) as of September 30, 2022. The evaluation was conducted under the supervision and with the participation of the Companys Management, including the Companys Chief Executive Officer and Chief Financial Officer, using the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Disclosure controls and procedures are designed to ensure that information required to be disclosed by the Company in reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. Based upon that evaluation, the Companys Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures were effective as of September 30, 2022.\nManagements Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act. The Companys Management, with participation of the Certifying Officers, under the oversight of our Board of Directors, evaluated the effectiveness of the Companys internal control over financial reporting as of September 30, 2022 using the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Because of its inherent limitations, any system of internal control over financial reporting, no matter how well designed, may not prevent or detect misstatement due to the possibility that a control can be circumvented or overridden or that misstatements due to error or fraud may occur that are not detected. Also, because of changes in conditions, internal control effectiveness may vary over time.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of September 30, 2022, using criteria established in Internal Control - Integrated Framework (2013) issued by COSO and concluded that the Company maintained effective internal control over financial reporting as of September 30, 2022, based on these criteria.\nOur internal control over financial reporting as of September 30, 2022, has been audited by Grant Thornton, an independent registered public accounting firm, as stated in its report which is included herein.\nChanges in Internal Control Over Financial Reporting\nNo changes in the Companys internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) occurred during the fiscal quarter ended September 30, 2022, that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspection\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nInformation regarding our directors, nominees and nominating procedures, Code of Ethics, Audit and Finance Committee, and non-compliance (if any) with Section 16(a) of the Securities Exchange Act of 1934 is hereby incorporated by reference to the sections captioned Proposal 1: Election of Directors and Securities Ownership of Directors and Executive Officers in the 2022 Proxy Statement.\nInformation regarding our executive officers is set forth in Item 1, Business - Information about our Executive Officers, above. Item 11. Executive Compensation\nInformation regarding our compensation committee and director and executive officer compensation is hereby incorporated by reference to the sections captioned Committees - Compensation Committee Interlocks and Insider Participation, Director Compensation and Proposal 3: Advisory Vote to Approve Executive Compensation in the 2022 Proxy Statement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nInformation regarding the beneficial ownership of our common stock by our directors, director nominees and executive officers individually and as a group, and by any known holder of five percent or more of the common stock, is hereby incorporated by reference to the sections captioned Securities Ownership of Directors and Executive Officers and Securities Ownership of Certain Beneficial Owners in the 2022 Proxy Statement.\nInformation regarding shares of our common stock issued or issuable under our equity compensation plans is hereby incorporated by reference to the section captioned Other Equity Compensation Plan Information in the 2022 Proxy Statement. Item 13. Certain Relationships and Related Transactions and Director Independence\nInformation regarding transactions with related parties and the independence of our directors, nominees for directors and members of the committees of our board of directors is hereby incorporated by reference to the section captioned Proposal 1: Election of Directors in the 2022 Proxy Statement. Item 14. Principal Accountant Fees and Services\nInformation regarding our independent registered public accounting firm, its fees and services, and our Audit and Finance Committees pre-approval policies and procedures regarding such fees and services, is hereby incorporated by reference to the section captioned Proposal 5: Ratification of Appointment of Independent Registered Pubic Accounting Firm in the 2022 Proxy Statement.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) The following documents are filed as a part of this Report:\n(1) Financial Statements. The Consolidated Financial Statements of the Company, and the Report of Independent Registered Public Accounting Firm thereon of KPMG LLP, are included in this Report beginning on page; an Index thereto is set forth on page.\n(2) Financial Statement Schedules. Financial Statement Schedules are omitted because either they are not applicable or the required information is included in the Consolidated Financial Statements or the Notes thereto.\n(3) Exhibits. The following exhibits are filed with this Report or incorporated herein by reference to the document location indicated:\nExhibit No.\nDescription\nDocument Location\n3.1(a)\nRestated Articles of Incorporation\nExhibit 3(a) to the Companys Form 10-K for the fiscal year ended September 30, 1999\n3.1(b)\nAmended Certificate of Designation, Preferences and Rights of Series A Participating Cumulative Preferred Stock\nExhibit 4(e) to the Companys Form 10-Q for the fiscal quarter ended March 31, 2000\n3.1(c)\nArticles of Merger, effective July 10, 2000\nExhibit 3(c) to the Companys Form 10-Q for the fiscal quarter ended June 30, 2000\n3.1(d)\nAmendment to Articles of Incorporation, effective February 5, 2018\nExhibit 3.1 to the Companys Form 8-K filed February 7, 2018\n3.2\nBylaws\nExhibit 3.1 to the Companys Form 8-K filed November 19, 2019\n3.3\nBylaws, as amended and restated effective as of January 1, 2023\nExhibit 3.1 to the Companys Form 8-K filed November 22, 2022\n4.1(a)\nDescription of Common Stock\nExhibit 4.1(a) to the Companys Form 10-K for the fiscal year ended September 30, 2019\n4.1(b)\nSpecimen revised Common Stock Certificate\nExhibit 4.1 to the Companys Form 10-Q for the fiscal quarter ended March 31, 2010\n4.2\nCredit Agreement dated September 27, 2019, incorporated by reference to Exhibit 10.1 hereto\nExhibit 10.1 to the Companys Form 8-K filed September 30, 2019\n10.1\nCredit Agreement dated as of September 27, 2019 among ESCO Technologies Inc., the Foreign Subsidiary Borrowers party thereto, the Lenders party thereto, JPMorgan Chase Bank, N.A. as Administrative Agent, BMO Harris Bank N.A. as Syndication Agent, and Bank of America, N.A., SunTrust Bank, U.S. Bank National Association and Wells Fargo Bank, National Association as Co-Documentation Agents\nExhibit 10.1 to the Companys Form 8-K filed September 30, 2019\n10.2\nForm of Indemnification Agreement with each of ESCOs non-employee directors\nExhibit 10.1 to the Companys Form 10-K for the fiscal year ended September 30, 2012\n10.3(a)\n*\nFirst Amendment to the ESCO Electronics Corporation Supplemental Executive Retirement Plan, effective August 2, 1993 (comprising restatement of entire Plan)\nExhibit 10.2(a) to the Companys Form 10-K for the fiscal year ended September 30, 2012\nExhibit No.\nDescription\nDocument Location\n10.3(b)\n*\nSecond Amendment to Supplemental Executive Retirement Plan, effective May 1, 2001\nExhibit 10.4 to the Companys Form 10-K for the fiscal year ended September 30, 2001\n10.3(c)\n*\nForm of Supplemental Executive Retirement Plan Agreement\nExhibit 10.28 to the Companys Form 10-K for the fiscal year ended September 30, 2002\n10.4\n*\nDirectors Extended Compensation Plan, adopted effective October 11, 1993, restated to include all amendments through August 7, 2013 (current as of November 2021)\nExhibit 10.5 to the Companys Form 10-K for the fiscal year ended September 30, 2019\n10.5(a)\n*\nCompensation Plan For Non-Employee Directors, as amended and restated to reflect all amendments through December 8, 2020\nExhibit 10.1 to the Companys Form 8-K filed December 9, 2020\n10.5(b)\n*\nSub-Plan for Compensation of Non-Employee Directors under 2018 Omnibus Incentive Plan\nExhibit 10.1 to the Companys Form 10-Q filed May 10, 2022\n10.5(c)\n*\nForm of Director Share Award Agreement\n(Non-Employee Director)\nExhibit 10.2 to the Companys Form 10-Q filed May 10, 2022\n10.6(a)\n*\n2018 Omnibus Incentive Plan\nExhibit 10.1 to the Companys Form 8-K filed February 6, 2018\n10.6(b)\n*\n2018 Omnibus Incentive Plan as Amended and Restated November 17, 2020\nExhibit 10.3 to the Companys Form 8-K filed November 19, 2020\n10.7(a)\n*\nForm of 2020-21 Awards of Performance-Accelerated Restricted Shares under 2018 Omnibus Incentive Plan\nExhibit 10.1 to the Companys Form 10-Q filed August 9, 2021\n10.7(b)\n*\nForm of Restricted Share Unit Awards to Executive Officers under 2018 Omnibus Incentive Plan (2021)\nExhibit 10.2 to the Companys Form 10-Q filed August 9,2021\n10.7(c)\n*\nForm of Restricted Share Unit Awards to Executive Officers under 2018 Omnibus Incentive Plan (2022)\nExhibit 10.1 to the Companys Form 10-Q filed August 9,2022\n10.7(d)\n*\nForm of Performance Share Unit Awards to Executive Officers under 2018 Omnibus Incentive Plan\nExhibit 10.1 to the Companys Form 10-Q filed February 7, 2022\n10.8(a)\nEighth Amendment and Restatement of Employee Stock Purchase Plan, effective August 2, 2018\nExhibit 10.7 to the Companys Form 10-K for the fiscal year ended September 30, 2018\n10.8(b)\nNinth Amendment and Restatement of Employee Stock Purchase Plan, effective February 5, 2019\nExhibit 10.1 to the Companys Form 8-K filed February 7, 2019\n10.9\n*\nPerformance Compensation Plan for Corporate, Subsidiary and Division Officers and Key Managers, adopted August 2, 1993, as amended and restated through February 4, 2019\nExhibit 10.1 to the Companys Form 8-K filed November 19, 2019\n10.10\n*\nCompensation Recovery Policy, adopted effective February 4, 2010\nExhibit 10.6 to the Companys Form 8-K filed February 10, 2010\n10.11\n*\nFourth Amended and Restated Severance Plan dated November 17, 2020\nExhibit 10.2 to the Companys Form 8-K filed November 19, 2020\n10.12\n*\nEmployment and Compensation Agreement with Victor L. Richey effective May 10, 2021\nExhibit 10.3 to the Companys Form 10-Q filed August 9, 2021\n10.13\n*\nEmployment and Compensation Agreement with Christopher L. Tucker effective April 30, 2021\nExhibit 10.4 to the Companys Form 10-Q filed August 9, 2021\n10.14\n*\nEmployment and Compensation Agreement with David M. Schatz effective April 30, 2021\nExhibit 10.5 to the Companys Form 10-Q filed August 9, 2021\nExhibit No.\nDescription\nDocument Location\nSubsidiaries of the Company\nFiled herewith\n23.1\nConsent of Independent Registered Public Accounting Firm (Grant Thornton LLP)\nFiled herewith\n23.2\nConsent of Independent Registered Public Accounting Firm (KPMG LLP)\nFiled herewith\n31.1\nCertification of Chief Executive Officer\nFiled herewith\n31.2\nCertification of Chief Financial Officer\nFiled herewith\n**\nCertification of Chief Executive Officer and Chief Financial Officer\nFurnished herewith\n101.INS\n***\nInline XBRL Instance Document\nSubmitted herewith\n101.SCH\n***\nInline XBRL Schema Document\nSubmitted herewith\n101.CAL\n***\nInline XBRL Calculation Linkbase Document\nSubmitted herewith\n101.LAB\n***\nInline XBRL Label Linkbase Document\nSubmitted herewith\n101.PRE\n***\nInline XBRL Presentation Linkbase Document\nSubmitted herewith\n101.DEF\n***\nInline XBRL Definition Linkbase Document\nSubmitted herewith\n***\nCover Page Inline Interactive Data File (contained in Exhibit 101)\nSubmitted herewith\n* Indicates a management contract or compensatory plan or arrangement.\n** Furnished (and not filed) herewith pursuant to Item 601(b)(32)(ii) of Regulation S-K.\n*** Exhibits 101 and 104 to this report consist of documents formatted in XBRL (Extensible Business Reporting Language) and filed with the Securities and Exchange Commission; they are not included in printed copies of this Report.\nItem 16. Form 10-K Summary\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nESCO TECHNOLOGIES INC.\nBy:\n/s/ Victor L. Richey\nVictor L. Richey\nPresident and Chief Executive Officer\nDate:\nNovember 29, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Victor L. Richey\nChairman, President, Chief Executive Officer (Principal Executive Officer) and Director\nNovember 29, 2022\nVictor L. Richey\n/s/ Christopher L. Tucker\nSenior Vice President and Chief Financial Officer (Principal Accounting Officer)\nNovember 29, 2022\nChristopher L. Tucker\n/s/ Patrick M. Dewar\nDirector\nNovember 29, 2022\nPatrick M. Dewar\n/s/ Janice L. Hess\nDirector\nNovember 29, 2022\nJanice L. Hess\n/s/ Vinod M. Khilnani\nDirector\nNovember 29, 2022\nVinod M. Khilnani\n/s/ Leon J. Olivier\nDirector\nNovember 29, 2022\nLeon J. Olivier\n/s/ Robert J. Phillippy\nDirector\nNovember 29, 2022\nRobert J. Phillippy\n/s/ James M. Stolze\nDirector\nNovember 29, 2022\nJames M. Stolze\n/s/ Gloria L. Valdez\nDirector\nNovember 29, 2022\nGloria L. Valdez\nFINANCIAL INFORMATION\nINDEX\nReports of Independent Registered Public Accounting Firm, PCAOB ID Number 248 [Grant Thornton LLP]\nReport of Independent Registered Public Accounting Firm, PCAOB ID Number 185 [KPMG LLP]\nConsolidated Statements of Operations for the Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Comprehensive Income for the Years Ended September 30, 2022, 2021 and 2020\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the Years Ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\nManagements Statement of Financial Responsibility\nREPORTS OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM,\nPCAOB ID NUMBER 248\nBoard of Directors and Shareholders\nESCO Technologies Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheet of ESCO Technologies Inc. (a Missouri corporation) and subsidiaries (the Company) as of September 30, 2022, and the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for the fiscal year ended September 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022, and the results of its operations and its cash flows for the fiscal year ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 30, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated November 29, 2022 expressed an unqualified opinion.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Estimate of contract costs expected at completion\nAs described further in Notes 1 and 15 to the financial statements, the Companys Aerospace & Defense and Test segments enter into certain long-term fixed price contracts with their customers to produce certain products that do not have an alternative use to the Company and for which the Company has an enforceable right to payment for costs incurred to date plus a reasonable margin. For the Aerospace & Defense segment, the Company uses a cost-to-cost method to recognize the revenue for these contracts over time. Using the cost-to-cost method, the Company measures progress to contract completion using the ratio of contract costs incurred to date compared to estimated total contract costs at completion. Judgment is required in estimating the total contract costs at completion due to the unique specifications and requirements for each individual contract relating to the design, development, manufacturing, and installation of the built-to-spec products.\nWe identified the determination of the estimated total contract costs at completion for certain contracts in the Aerospace & Defense segment for which revenue is recognized over time using the cost-to-cost method as a critical audit matter.\nThe principal considerations for our determination that the estimated total contract costs at completion is a critical audit matter are that the estimated total contract costs at completion require complex judgment to evaluate the engineering and production requirements of the contract and the related labor and materials costs, which are assumptions with a high level of estimation uncertainty and susceptibility to potential management bias. Changes to the assumptions used in developing these estimates may significantly impact the net sales and earnings recorded during the fiscal year.\nOur audit procedures related to the estimated total contract costs at completion include the following, among others. We evaluated the design and tested the operating effectiveness of certain internal controls related to the Companys revenue recognition and job cost processes. This included controls over the accumulation and estimation of costs to complete the contracts. For a selection of completed contracts, we compared the Companys historical estimated costs and profit margin to the actual costs and profit margin to assess the Companys ability to accurately estimate costs. We also tested the Companys assumptions for labor hours and materials to be incurred for a selection of in-process contracts by:\n● inspecting a sample of underlying contracts, including any applicable amendments, to obtain an understanding of the contractual requirements and deliverables and the nature of the costs necessary to fulfill those contracts\n● assessing the progress towards completion by obtaining customer validation of the achievement of milestones, if applicable, and performing inquiries of key financial and operations executives to evaluate the progress to date and factors impacting the estimated total contract costs expected at completion\n● comparing the actual costs incurred to date, as a percentage of the estimated total contract costs at completion, and comparing that to the revenue recognized to date\n● comparing the margins to date on selected contracts to similar products previously produced, if applicable\n● evaluating the estimates for indicators of management bias through the procedures described above.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2021.\nSt. Louis, Missouri\nNovember 29, 2022\nBoard of Directors and Shareholders\nESCO Technologies Inc.\nOpinion on internal control over financial reporting\nWe have audited the internal control over financial reporting of ESCO Technologies Inc. (a Missouri corporation) and subsidiaries (the Company) as of September 30, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on criteria established in the 2013 Internal Control-Integrated Framework issued by COSO.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements of the Company as of and for the year ended September 30, 2022, and our report dated November 29, 2022 expressed an unqualified opinion on those financial statements.\nBasis for opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and limitations of internal control over financial reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ GRANT THORNTON LLP\nSt. Louis, Missouri\nNovember 29, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM,\nPCAOB ID NUMBER 185\nTo the Shareholders and Board of Directors\nESCO Technologies Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of ESCO Technologies Inc. and subsidiaries (the Company) as of September 30, 2021, the related consolidated statements of operations, comprehensive income, shareholders equity, and cash flows for each of the years in the two-year period ended September 30, 2021 and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2021, in conformity with U.S. generally accepted accounting principles.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ KPMG LLP\nWe served as the Companys auditor from 1990 to 2021.\nSt. Louis, Missouri\nNovember 29, 2021\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Dollars in thousands, except per share amounts)\nYears ended September 30,\nNet sales\n$\n857,502\n715,440\n730,471\nCosts and expenses:\nCost of sales\n525,457\n445,045\n458,311\nSelling, general and administrative expenses\n195,127\n167,534\n159,490\nAmortization of intangible assets\n25,936\n20,829\n21,812\nInterest expense, net\n4,851\n2,255\n6,730\nPension plan termination charge\n-\n-\n40,600\nOther (income) expenses, net\n(304)\n(894)\n7,122\nTotal costs and expenses\n751,067\n634,769\n694,065\nEarnings before income tax\n106,435\n80,671\n36,406\nIncome tax expense\n24,115\n17,175\n13,510\nNet earnings from continuing operations\n82,320\n63,496\n22,896\nNet gain on sale from discontinued operations, net of tax expense of $23,501\n-\n-\n76,515\nNet earnings from discontinued operations\n-\n-\n76,515\nNet earnings\n$\n82,320\n63,496\n99,411\nEarnings per share:\nBasic:\nContinuing operations\n$\n3.17\n2.44\n0.88\nDiscontinued operations\n-\n-\n2.94\nNet earnings\n$\n3.17\n2.44\n3.82\nDiluted:\nContinuing operations\n$\n3.16\n2.42\n0.88\nDiscontinued operations\n-\n-\n2.93\nNet earnings\n$\n3.16\n2.42\n3.81\nAverage common shares outstanding (in thousands):\nBasic\n25,933\n26,046\n26,010\nDiluted\n26,067\n26,225\n26,135\nSee accompanying Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(Dollars in thousands)\nYears ended September 30,\nNet earnings\n$\n82,320\n63,496\n99,411\nOther comprehensive (loss) income, net of tax:\nForeign currency translation adjustments\n(28,876)\n1,496\n3,172\nPension plan termination\n-\n-\n40,600\nAmortization of prior service costs, actuarial losses and other\n(727)\n-\n(3,455)\nTotal other comprehensive (loss) income, net of tax\n(29,603)\n1,496\n40,317\nComprehensive income\n$\n52,717\n64,992\n139,728\nSee accompanying Notes to Consolidated Financial Statements.\nCONSOLIDATED BALANCE SHEETS\n(Dollars in thousands)\nAs of September 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n97,724\n56,232\nAccounts receivable, less allowance for credit losses of $2,612 and $1,949 in 2022 and 2021, respectively\n164,645\n146,341\nContract assets, net\n125,154\n93,771\nInventories, net\n162,403\n147,148\nOther current assets\n22,696\n22,662\nTotal current assets\n572,622\n466,154\nProperty, plant and equipment:\nLand and land improvements\n12,126\n10,547\nBuildings and leasehold improvements\n110,306\n109,279\nMachinery and equipment\n187,287\n176,447\nConstruction in progress\n11,576\n5,543\n321,295\n301,816\nLess accumulated depreciation and amortization\n(165,322)\n(147,551)\nNet property, plant and equipment\n155,973\n154,265\nIntangible assets, net\n394,464\n409,250\nGoodwill\n492,709\n504,853\nOperating lease assets, net\n29,150\n31,846\nOther assets\n9,538\n10,977\nTotal Assets\n$\n1,654,456\n1,577,345\nSee accompanying Notes to Consolidated Financial Statements.\nCONSOLIDATED BALANCE SHEETS\n(Dollars in thousands)\nAs of September 30,\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nCurrent maturities of long-term debt and short-term borrowings\n$\n20,000\n20,000\nAccounts payable\n78,746\n56,669\nContract liabilities, net\n125,009\n106,045\nAccrued salaries\n40,572\n39,768\nAccrued other expenses\n53,802\n52,513\nTotal current liabilities\n318,129\n274,995\nDeferred tax liabilities, net\n82,023\n73,560\nNon-current operating lease liabilities\n24,853\n28,032\nOther liabilities\n48,294\n47,062\nLong-term debt\n133,000\n134,000\nTotal liabilities\n606,299\n557,649\nShareholders equity:\nPreferred stock, par value $.01 per share, authorized 10,000,000 shares\nCommon stock, par value $.01 per share, authorized 50,000,000 shares; issued 30,707,748 and 30,666,173 shares in 2022 and 2021, respectively\nAdditional paid-in capital\n301,553\n297,644\nRetained earnings\n905,022\n830,989\nAccumulated other comprehensive loss, net of tax\n(31,764)\n(2,161)\n1,175,118\n1,126,779\nLess treasury stock, at cost (4,854,997 and 4,604,741 common shares in 2022 and 2021, respectively)\n(126,961)\n(107,083)\nTotal shareholders equity\n1,048,157\n1,019,696\nTotal Liabilities and Shareholders Equity\n$\n1,654,456\n1,577,345\nSee accompanying Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nAccumulated\nAdditional\nOther\nCommon Stock\nPaid-In\nRetained\nComprehensive\nTreasury\n(In thousands)\nShares\nAmount\nCapital\nEarnings\nIncome (Loss)\nStock\nTotal\nBalance, September 30, 2019\n30,597\n$\n292,408\n684,741\n(43,974)\n(107,259)\n826,222\nComprehensive income (loss):\nNet earnings\n-\n-\n-\n99,411\n-\n-\n99,411\nTranslation adjustments, net of tax of $0\n-\n-\n-\n-\n3,172\n-\n3,172\nPension termination and net unrecognized actuarial loss, net of tax of $(1,161)\n-\n-\n-\n-\n37,145\n-\n37,145\nCash dividends declared ($0.32 per share)\n-\n-\n-\n(8,323)\n-\n-\n(8,323)\nStock compensation plans, net of tax of $0\n-\n1,274\n-\n-\n1,399\nBalance, September 30, 2020\n30,646\n$\n293,682\n775,829\n(3,657)\n(107,134)\n959,026\nComprehensive income (loss):\nNet earnings\n-\n-\n-\n63,496\n-\n-\n63,496\nTranslation adjustments, net of tax of $0\n-\n-\n-\n-\n1,496\n-\n1,496\nCash dividends declared ($0.32 per share)\n-\n-\n-\n(8,336)\n-\n-\n(8,336)\nStock compensation plans, net of tax of $0\n3,962\n-\n-\n4,014\nBalance, September 30, 2021\n30,666\n$\n297,644\n830,989\n(2,161)\n(107,083)\n1,019,696\nComprehensive income (loss):\nNet earnings\n-\n-\n-\n82,320\n-\n-\n82,320\nNet unrecognized actuarial loss - SERP\n-\n-\n-\n-\n(727)\n-\n(727)\nTranslation adjustments, net of tax of $0\n-\n-\n-\n-\n(28,876)\n-\n(28,876)\nCash dividends declared ($0.32 per share)\n-\n-\n-\n(8,287)\n-\n-\n(8,287)\nPurchases of common stock into treasury\n-\n-\n-\n-\n-\n(19,878)\n(19,878)\nStock compensation plans, net of tax of $0\n-\n3,909\n-\n-\n-\n3,909\nBalance, September 30, 2022\n30,708\n301,553\n905,022\n(31,764)\n(126,961)\n1,048,157\nSee accompanying Notes to Consolidated Financial Statements.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Dollars in thousands)\nYears ended September 30,\nCash flows from operating activities:\nNet earnings\n$\n82,320\n63,496\n99,411\nAdjustments to reconcile net earnings to net cash provided by operating activities:\nNet earnings from discontinued operations, net of tax\n-\n-\n(76,515)\nDepreciation and amortization\n48,343\n42,049\n41,338\nStock compensation expense\n7,320\n6,914\n5,550\nChanges in assets and liabilities\n(11,654)\n15,671\n26,585\nGain on sale of building and land\n-\n(1,950)\n-\nEffect of deferred taxes on tax provision\n8,946\n(3,041)\n(2,785)\nPension contributions\n-\n-\n(25,650)\nPension plan termination charge\n-\n-\n40,600\nNet cash provided by operating activities - continuing operations\n135,275\n123,139\n108,534\nNet cash (used) by discontinued operations\n-\n-\n(26,254)\nNet cash provided by operating activities\n135,275\n123,139\n82,280\nCash flows from investing activities:\nAcquisition of businesses, net of cash acquired\n(10,906)\n(168,903)\n-\nCapital expenditures\n(32,101)\n(26,705)\n(32,108)\nAdditions to capitalized software\n(12,912)\n(8,783)\n(9,023)\nProceeds from sale of building and land\n-\n1,950\n-\nNet cash used by investing activities - continuing operations\n(55,919)\n(202,441)\n(41,131)\nNet cash provided by investing activities - discontinued operations\n-\n-\n182,084\nNet cash (used) provided by investing activities\n(55,919)\n(202,441)\n140,953\nCash flows from financing activities:\nProceeds from long-term debt\n100,000\n216,000\n12,368\nPrincipal payments on long-term debt\n(101,000)\n(124,368)\n(235,000)\nDividends paid\n(8,268)\n(8,336)\n(8,323)\nPurchases of common stock into treasury\n(19,878)\n-\n-\nOther\n(2,976)\n(1,823)\n(3,125)\nNet cash (used) provided by financing activities - continuing operations\n(32,122)\n81,473\n(234,080)\nNet cash used by financing activities - discontinued operations\n-\n-\n(2,140)\nNet cash (used) provided by financing activities\n(32,122)\n81,473\n(236,220)\nEffect of exchange rate changes on cash and cash equivalents\n(5,742)\n1,501\n3,739\nNet increase (decrease) in cash and cash equivalents\n41,492\n3,672\n(9,248)\nCash and cash equivalents at beginning of year\n56,232\n52,560\n61,808\nCash and cash equivalents at end of year\n$\n97,724\n56,232\n52,560\nChanges in assets and liabilities:\nAccounts receivable, net\n$\n(17,676)\n11,266\n14,633\nContract assets and liabilities, net\n(12,419)\n8,974\n35,283\nInventories\n(13,788)\n(10,340)\nOther assets and liabilities\n9,412\n(477)\n(8,609)\nAccounts payable\n21,985\n(688)\n(13,275)\nAccrued expenses\n(3,836)\n8,893\n$\n(11,654)\n15,671\n26,585\nSupplemental cash flow information:\nInterest paid\n$\n2,835\n5,869\nIncome taxes paid (including state & foreign)\n9,856\n26,054\n37,714\nSee accompanying Notes to Consolidated Financial Statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Summary of Significant Accounting Policies\nA. Principles of Consolidation\nThe Consolidated Financial Statements include the accounts of ESCO Technologies Inc. (ESCO) and its wholly owned subsidiaries. Except where the context indicates otherwise, the terms Company, we, our and us are used in this report to refer to ESCO together with its subsidiaries through which its businesses are conducted. All significant intercompany transactions and accounts have been eliminated in consolidation.\nB. Basis of Presentation\nOur fiscal year ends on September 30. Throughout the Consolidated Financial Statements, unless the context indicates otherwise, references to a year (for example 2022) refer to fiscal year ending on September 30 of that year. Certain prior period amounts have been reclassified to conform to the current period presentation.\nOur former Technical Packaging segment is reflected as discontinued operations in the Consolidated Financial Statements and related notes for all periods presented, in accordance with accounting principles generally accepted in the United States of America (GAAP).\nC. Nature of Operations\nWe are organized based on the products and services we offer and we currently classify our business operations in three segments for financial reporting purposes: Aerospace & Defense (A&D), Utility Solutions Group (USG), and RF Shielding and Test (Test).\nA&D: The companies within this segment primarily design and manufacture specialty filtration products, including hydraulic filter elements and fluid control devices used in commercial aerospace applications; unique filter mechanisms used in micro-propulsion devices for satellites; custom designed filters for manned aircraft and submarines; products and systems to reduce vibration and/or acoustic signatures and otherwise reduce or obscure a vessels signature, and other communications, sealing, surface control and hydrodynamic related applications to enhance U.S. Navy maritime survivability; precision-tolerance machined components for the aerospace and defense industry; and metal processing services; and miniature electro-explosive devices for military aircraft ejection seats and missile arming devices.\nUSG: The companies within this segment provide diagnostic testing solutions that enable electric power grid operators to assess the integrity of high-voltage power delivery equipment, as well as decision support tools for the renewable energy industry, primarily wind and solar.\nTest: The companies within this segment provide their customers with the ability to identify, measure and contain magnetic, electromagnetic and acoustic energy.\nIn addition, for reporting certain financial information we treat Corporate activities as a separate segment.\nD. Use of Estimates\nThe preparation of financial statements in conformity with GAAP requires Management to make estimates and assumptions that affect the reported amounts of assets and liabilities. Actual results could differ from those estimates.\nE. Revenue Recognition\nWe recognize revenue when control of the goods or services promised under the contract is transferred to the customer either at a point in time (e.g., upon delivery) or over time (e.g., as we perform under the contract). We account for a contract when it has approval and commitment from both parties, the rights and payment terms of the parties are identified, the contract has commercial substance and collectability of consideration is probable. We review contracts to determine whether there are one or multiple performance obligations. A performance obligation is a promise to transfer a distinct good or service to a customer and represents the unit of accounting for revenue recognition. For contracts with multiple performance obligations, we allocate the expected\nconsideration, or the transaction price, to each performance obligation identified in the contract based on the relative standalone selling price of each performance obligation. We then recognize revenue for the transaction price allocated to the performance obligation when control of the promised goods or services underlying the performance obligation is transferred.\nPayment terms with our customers vary by the type and location of the customer and the products or services offered. We do not adjust the promised amount of consideration for the effects of significant financing components based on the expectation that the period between when we transfer a promised good or service to a customer and when the customer pays for that good or service will be one year or less. Arrangements with customers that include payment terms extending beyond one year are not significant. We account for shipping and handling costs on a gross basis and include them in net sales. We account for taxes collected from customers and remitted to governmental authorities on a net basis and exclude them from net sales.\nA&D: Within the A&D segment, approximately 40% of revenues (approximately 17% of consolidated revenues) are recognized at a point in time when products are shipped (when control of the goods transfers) to unaffiliated customers. The related contracts are with commercial and military customers and have a single performance obligation as there is only one good promised or the promise to transfer the goods or services is not distinct or separately identifiable from other promises in the contract. The transaction price for these contracts reflects our estimate of returns and discounts, which are based on historical, current and forecasted information to determine the expected amount to which we will be entitled in exchange for transferring the promised goods or services to the customer. The realization of variable consideration occurs within a short period of time from product delivery; therefore, the time value of money effect is not significant. Amounts billed to customers for shipping and handling are included in the transaction price as the related activities are performed prior to the customer obtaining control of the products. They generally are not treated as separate performance obligations as these costs fulfill a promise to transfer the product to the customer and are expensed in cost of goods sold in the period they are incurred. Taxes collected from customers and remitted to government authorities are recorded on a net basis. We primarily provide standard warranty programs for products in our commercial businesses for periods that typically range from one to two years. These assurance-type programs typically cannot be purchased separately and do not meet the criteria to be considered a performance obligation.\nApproximately 60% of the segments revenues (approximately 25% of consolidated revenues) are accounted for over time as the product does not have an alternative use and we have an enforceable right to payment for costs incurred plus a reasonable margin or the inventory is owned by the customer. The related contracts are primarily cost-plus or fixed price contracts related to the design, development and manufacture of complex fluid control products, quiet valves, manifolds, shock and vibration dampening, thermal insulation and systems primarily for the commercial aerospace and military (U.S. Government) markets. The contracts may contain multiple products, which are capable of being distinct as the customer could benefit from each product on its own or together with other readily available resources. Each product is separately identifiable from the other products in the contract. Therefore, each product is distinct in context of the contract and will be accounted for as a separate performance obligation. Our contracts are frequently modified for changes in contract specifications and requirements. Most of our contract modifications are for products that are not distinct from the existing contract and are accounted for as part of that existing contract.\nContracts with the U.S. Government generally contain clauses that provide lien rights to work-in-process along with clauses that allow the customer to unilaterally terminate the contract for convenience, pay us for costs incurred plus a reasonable profit and take control of any work-in-process. Due to the continuous transfer of control to the U.S. Government, we recognize revenue over the time that we perform under the contract.\nSelecting the method to measure progress towards completion for the commercial and military contracts requires judgment and is based on the nature of the products or service to be provided. We generally use the cost-to-cost method to measure progress for our Aerospace & Defense segment contracts, as the rate at which costs are incurred to fulfill a contract best depicts the transfer of control to the customer. Under this method, we measure the extent of progress towards completion based on the ratio of costs incurred to date to the estimated costs at completion of the performance obligation, and record revenue proportionally as costs are incurred based on an estimated profit margin.\nThe transaction price for our contracts represents our best estimate of the consideration we will receive and includes assumptions regarding variable consideration as applicable. Certain of our long-term contracts contain incentive fees that can increase the transaction price. These variable amounts generally are awarded upon achievement of certain performance metrics, program milestones or cost targets and can be based upon customer discretion. We include estimated amounts in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. Our estimates of variable consideration and determination of whether to include estimated\namounts in the transaction price are based largely on an assessment of our anticipated performance and all other information that is reasonably available to us.\nTotal contract cost is estimated utilizing current contract specifications and expected engineering requirements. Contract costs typically are incurred over a period of several months to one or more years, and the estimation of these costs requires judgment. Our cost estimation process is based on the professional knowledge and experience of engineers and program managers along with finance professionals. We review and update our projections of costs quarterly or more frequently when circumstances significantly change.\nUnder the typical payment terms of our long term fixed price contracts, the customer pays us either performance-based or progress payments. Performance-based payments represent interim payments based on quantifiable measures of performance or on the achievement of specified events or milestones. Progress payments are interim payments of costs incurred as the work progresses. Because of the timing difference of revenue recognition and customer billing, these contracts will often result in revenue recognized in excess of billings and billings in excess of costs incurred, which we present as contract assets and contract liabilities, respectively, in the Consolidated Balance Sheets. We classify amounts billed and due from our customers in Accounts receivable, net. For short term fixed price and cost-type contracts, we are generally paid within a short period of time.\nFor contracts where revenue is recognized over time, we recognize changes in estimated contract revenues, costs and profits using the cumulative catch-up method of accounting. This method recognizes the cumulative effect of changes on current and prior periods with the impact of the change from inception-to-date recorded in the current period. We have net revenue recognized in the current year from performance obligations satisfied in the prior year due to changes in our estimated costs to complete the related performance obligations. We recognize anticipated losses on contracts in full in the period in which the losses become known.\nUSG: Within the USG segment, approximately 80% of revenues (approximately 25% of consolidated revenues) are recognized at a point in time when products are shipped (when control of the goods transfers) to unaffiliated customers. The related contracts are with commercial customers. The contracts may contain multiple products which are capable of being distinct as the customer could benefit from each product on its own or together with other readily available resources. Each product is separately identifiable from the other products in the contract. Therefore, each product is distinct in context of the contract and is accounted for as a separate performance obligation. The transaction price for these contracts reflects our estimate of variable consideration in the form of returns, rebates and discounts, which are based on historical, current and forecasted information to determine the expected amount to which we will be entitled in exchange for transferring the promised goods or services to the customer. The realization of variable consideration occurs within a short period of time from product delivery; therefore, the time value of money effect is not significant. Amounts billed to customers for shipping and handling are included in the transaction price as the related activities are performed prior to customer obtaining control of the products. We generally do not treat them as separate performance obligations as these costs fulfill a promise to transfer the product to the customer and are expensed in selling, general and administrative costs in the period they are incurred. We record taxes collected from customers and remitted to government authorities on a net basis. We primarily provide standard warranty programs for products in our commercial businesses for periods that typically range from one to two years. These assurance-type programs typically cannot be purchased separately and do not meet the criteria to be considered a performance obligation.\nApproximately 20% of the segments revenues (approximately 6% of consolidated revenues) are recognized over time as services are performed. The services accounted for under this method include an obligation to provide testing services using hardware and embedded software, software maintenance, training, lab testing, and consulting services. Typically, the related contracts contain a bundle of goods and services that are integrated in the context of the contract. Therefore, the goods and services are not distinct and we have a single performance obligation. Selecting the method to measure progress towards completion for these contracts requires judgment and is based on the nature of the products and service to be provided. We will recognize revenue as a series of distinct services based on each day of providing services (straight-line over the contract term) for our USG segment contracts. The transaction price for our contracts represents our best estimate of the consideration we will receive and includes assumptions regarding variable consideration as applicable. Under the typical payment terms of our service contracts, the customer pays us in advance of when services are performed. Because of the timing difference of revenue recognition and customer payment, which is typically received upon commencement of the contract, these contracts result in deferred revenue, which we present as contract liabilities, in the Consolidated Balance Sheets.\nIncluded in this category, approximately 6% of the segments revenues (approximately 2% of consolidated revenues) are recognized based on the terms of the software contract. For contracts that transfer a software license to the customer, revenue will be recognized at a point in time. These type of software contracts represent a right to use the software, or a functional license, in which revenue should be recognized upon transfer of the license. For contracts in software as a service (SaaS) arrangements, revenue will be\nrecognized over time. The customer receives and consumes the benefits of the SaaS arrangement through access to the system which is for a stated period. We will recognize revenue based on each day of providing access (straight-line over the contract term). The transaction price for our contracts represents our best estimate of the consideration we will receive and includes assumptions regarding variable consideration as applicable. Under the typical payment terms of our software contracts, the customer pays us in advance of when services are performed. Because of the timing difference of revenue recognition and customer payment, these contracts result in deferred revenue, which we present as contract liabilities, in the Consolidated Balance Sheets.\nTest: Within the Test segment, approximately 25% of revenues (approximately 7% of consolidated revenues) are recognized at a point in time when products such as, antennas and probes are shipped (when control of the goods transfers) to unaffiliated customers. The related contracts are with commercial customers. The contracts may contain multiple products which are capable of being distinct because the customer could benefit from each product on its own or together with other readily available resources. Each product is separately identifiable from the other products in the contract. Therefore, each product is distinct in the context of the contract and will be accounted for as a separate performance obligation. The transaction price for these contracts reflects our estimate of variable consideration in the form of returns, rebates and discounts, which are based on historical, current and forecasted information to determine the expected amount to which we will be entitled in exchange for transferring the promised goods or services to the customer. The realization of variable consideration occurs within a short period of time from product delivery; therefore, the time value of money effect is not significant. Amounts billed to customers for shipping and handling are included in the transaction price as the related activities are performed prior to customer obtaining control of the products. They generally are not treated as separate performance obligations as these costs fulfill a promise to transfer the product to the customer and are expensed in selling, general, and other costs in the period they are incurred. Taxes collected from customers and remitted to government authorities are recorded on a net basis. We primarily provide standard warranty programs for products in our commercial businesses for periods that typically range from one to two years. These assurance-type programs typically cannot be purchased separately and do not meet the criteria to be considered a performance obligation.\nApproximately 75% of the segments revenues (approximately 20% of consolidated revenues) are recorded over time as the product does not have an alternative use and we have an enforceable right to payment for costs incurred plus a reasonable margin. Products accounted for under this guidance include the construction and installation of test chambers to a buyers specifications that provide its customers with the ability to measure and contain magnetic, electromagnetic and acoustic energy. The goods and services related to each installed test chamber are not distinct due to the significant amount of integration provided and each installed chamber is accounted for as a single performance obligation. Selecting the method to measure progress towards completion for these contracts requires judgment and is based on the nature of the products and service to be provided. We use milestones to measure progress for our Test segment contracts because it best depicts the transfer of control to the customer that occurs as we incur costs on our contracts. For arrangements that are accounted for under this guidance, we estimate profit as the difference between total revenue and total estimated cost of a contract and recognize these revenues and costs based primarily on contract milestones. The transaction price for our contracts is typically fixed price and represents our best estimate of the consideration we will receive.\nWe estimate total contract cost utilizing current contract specifications and expected engineering requirements. Contract costs typically are incurred over a period of several months to a year, and the estimation of these costs requires judgment. Our cost estimation process is based on the professional knowledge and experience of engineers and program managers along with finance professionals. We review and update our projections of costs quarterly or more frequently when circumstances significantly change.\nUnder the typical payment terms of our fixed price contracts, the customer pays us either based on progress or based on a fixed billing schedule within the contract. Performance-based payments represent interim payments based on noted progress points as the work progresses. Because of the timing difference of revenue recognition and customer billing, these contracts result in revenue recognized in excess of billings and billings in excess of revenue recognized, which we present as contract assets and contract liabilities, respectively, in the Consolidated Balance Sheets. Amounts billed and due from our customers are classified in Accounts receivable, net.\nFor contracts where revenue is recognized over time, we generally recognize changes in estimated contract revenues, costs and profits using the cumulative catch-up method of accounting. This method recognizes the cumulative effect of changes on current and prior periods with the impact of the change from inception-to-date recorded in the current period. We have net revenue recognized in the current year from performance obligations satisfied in the prior year due to changes in our estimated costs to complete the related performance obligations. We recognize anticipated losses on contracts in full in the period in which the losses become probable and estimable.\nContract Assets and Liabilities\nContract assets arise from contracts when revenue is recognized over time and the amount of revenue recognized, including our estimate of variable consideration that has been included in the transaction price, exceeds the amount billed to the customer. These amounts are included in contract assets until the right to payment is no longer conditional on events other than the passage of time. These contract assets are reclassified to receivables when the right to consideration becomes unconditional. Contract liabilities include deposits, deferred revenue, upfront payments and billings in excess of revenue recognized. We include liabilities for customer rebates and discounts in other current liabilities in the Consolidated Balance Sheets.\nSee the further discussion of our revenue recognition in Note 15 below.\nF. Cash and Cash Equivalents\nCash equivalents include temporary investments that are readily convertible into cash, such as money market funds, with original maturities of three months or less.\nG. Accounts Receivable\nWe reduce accounts receivable by an allowance for amounts that we estimate are uncollectible in the future. This estimated allowance is based on Managements evaluation of the financial condition of the customer and historical write-off experience.\nH. Inventories\nWe value inventories at the lower of cost (first-in, first-out) or net realizable value. We regularly review inventories for excess quantities and obsolescence based upon historical experience, specific identification of discontinued items, future demand, and market conditions. Inventories under long-term contracts reflect accumulated production costs, factory overhead, initial tooling and other related costs less the portion of such costs charged to cost of sales.\nI. Property, Plant and Equipment\nProperty, plant and equipment are recorded at cost. Depreciation and amortization are computed primarily on a straight-line basis over the estimated useful lives of the assets: buildings, 10-40 years; machinery and equipment, 3-10 years; and office furniture and equipment, 3-10 years. Leasehold improvements are amortized over the remaining term of the applicable lease or their estimated useful lives, whichever is shorter. Long-lived tangible assets are reviewed for impairment whenever events or changes in business circumstances indicate the carrying value of the assets may not be recoverable. Impairment losses are recognized based on fair value.\nJ. Leases\nOur lease agreements primarily relate to office space, manufacturing facilities, and machinery and equipment. We determine at lease inception whether an arrangement that provides control over the use of an asset is a lease. We recognize at lease commencement a right-of-use (ROU) asset and lease liability based on the present value of the future lease payments over the lease term. We have elected not to recognize a ROU asset and lease liability for leases with terms of 12 months or less. Certain of our leases include options to extend the term of the lease for up to 20 years. When it is reasonably certain that we will exercise the option, Management includes the impact of the option in the lease term for purposes of determining total future lease payments. As most of our lease agreements do not explicitly state the discount rate implicit in the lease, Management uses our incremental borrowing rate on the commencement date to calculate the present value of future payments based on the tenor of each arrangement.\nK. Goodwill and Other Long-Lived Intangible Assets\nGoodwill represents the excess of purchase price over the fair value of net identifiable assets acquired in business acquisitions. Management annually reviews goodwill and other long-lived assets with indefinite useful lives for impairment or whenever events or changes in circumstances indicate the carrying amount may be less than fair value. If we determine that the carrying value of the long-lived asset or reporting unit is less than fair value, we record a permanent impairment charge for the amount by which the carrying value of the long-lived asset exceeds its fair value. We measure the fair value of our reporting units based on a discounted cash flow method using a discount rate determined by Management to be commensurate with the risk inherent in each of our reporting units\ncurrent business models. We determine the fair value of trade names using a generally accepted valuation method based on an income approach called the relief from royalty method. During 2022, Management performed a quantitative impairment analysis, which included a detailed calculation of the fair value of our trade names and reporting units related to certain reporting units within these segments. A step 0 analysis was performed on the other reporting units for which a quantitative analysis was not performed. The results of these impairment analyses indicated that the fair values of the trade names and reporting units are not less than their carrying values. Our estimates of discounted cash flows to derive the fair value were measured in accordance with ASC 350, Intangibles - Goodwill and Other. We are using estimates of discounted cash flows that may change, and if they change negatively it could result in the need to write down those assets to fair value.\nOther intangible assets represent costs allocated to identifiable intangible assets, principally customer relationships, capitalized software, patents, trademarks, and technology rights. We amortize intangible assets with estimable useful lives over their respective estimated useful lives to their estimated residual values, and review them for impairment whenever events or changes in business circumstances indicate the carrying value of the assets may not be recoverable.\nSee Note 4 regarding goodwill and other intangible assets activity.\nL. Capitalized Software\nCosts incurred for the development of computer software that will be sold, leased, or otherwise marketed are charged to research and development expense when incurred, until technological feasibility has been established for the product. Technological feasibility is typically established upon completion of a detailed program design. Costs incurred after this point are capitalized on a project-by-project basis. Capitalized costs consist of internal and external development costs. Upon general release of the product to customers, we cease capitalization and begin amortization, which is calculated on a project-by-project basis as the greater of (1) the ratio of current gross revenues for a product to the total of current and anticipated future gross revenues for the product or (2) the straight-line method over the estimated economic life of the product. We generally amortize software development costs over a three-to-seven year period based upon the estimated future economic life of the product. Factors we consider in determining the estimated future economic life of the product include anticipated future revenues, and changes in software and hardware technologies. Management annually reviews the carrying values of capitalized costs for impairment or whenever events or changes in circumstances indicate the carrying amount may not be recoverable. If expected cash flows are insufficient to recover the carrying amount of the asset, then we recognize an impairment loss to state the asset at its net realizable value.\nM. Income Taxes\nWe account for income taxes under the asset and liability method. We recognize deferred tax assets and liabilities for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. We measure deferred tax assets and liabilities using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. We may reduce deferred tax assets by a valuation allowance if it is more likely than not that some portion or all of the deferred tax assets will not be realized. We recognize the effect on deferred tax assets and liabilities of a change in tax rates in income in the period that includes the enactment date. We regularly review our deferred tax assets for recoverability and establish a valuation allowance when Management believes it is more likely than not such assets will not be recovered, taking into consideration historical operating results, expectations of future earnings, tax planning strategies, and the expected timing of the reversals of existing temporary differences. Our policy is to include interest related to unrecognized tax benefits in income tax expense and penalties in operating expense.\nN. Research and Development Costs\nCompany-sponsored research and development costs include research and development and bid and proposal efforts related to our products and services. We charge Company-sponsored product development costs to expense when incurred. Customer-sponsored research and development costs refer to certain situations whereby customers provide funding to support specific contractually defined research and development costs. We account for customer-sponsored research and development costs incurred pursuant to contracts similarly to other program costs. Total Company and customer-sponsored research and development expenses were approximately $12.3 million, $15.4 million and $13.3 million for 2022, 2021 and 2020, respectively.\nO. Foreign Currency Translation\nWe translate the financial statements of our foreign operations into U.S. dollars in accordance with FASB ASC Topic 830, Foreign Currency Matters. We record the resulting translation adjustments as a separate component of accumulated other comprehensive income.\nP. Earnings Per Share\nWe calculate basic earnings per share using the weighted average number of common shares outstanding during the period. We calculate diluted earnings per share using the weighted average number of common shares outstanding during the period plus shares issuable upon the assumed exercise of dilutive vesting of unvested restricted units (restricted shares) using the treasury stock method. There are no anti-dilutive shares.\nThe number of shares used in the calculation of earnings per share for each year presented is as follows:\n(in thousands)\nWeighted Average Shares Outstanding - Basic\n25,933\n26,046\n26,010\nDilutive Restricted Shares\nShares - Diluted\n26,067\n26,225\n26,135\nQ. Share-Based Compensation\nWe provide compensation benefits to certain key employees under several share-based plans providing for performance-accelerated, performance-based and/or time-vested restricted stock unit awards, and to non-employee directors under a separate compensation plan for non-employee directors. We measure share-based payment expense at the grant date based on the fair value of the award and recognize it on a straight-line basis over the requisite service period (generally the vesting period of the award) and/or if the performance criteria are deemed probable.\nR. Accumulated Other Comprehensive Loss\nAccumulated other comprehensive loss of $(31.8) million at September 30, 2022 consisted primarily of currency translation adjustments.\nS. Fair Value Measurements\nFair value is defined as the price at which an asset could be exchanged in a current transaction between knowledgeable, willing parties or the amount that would be paid to transfer a liability to a new obligor, not the amount that would be paid to settle the liability with the creditor. Where available, we base fair value on observable market prices or parameters or derived from such prices or parameters. Where observable prices or inputs are not available, we apply valuation models. These valuation techniques involve some level of Management estimation and judgment, the degree of which is dependent on the price transparency for the instruments or market and the instruments complexity.\nThe accounting guidance establishes a three-level hierarchy for disclosure of fair value measurements, based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date, as follows:\nLevel 1 - Inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2 - Inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\nLevel 3 - Inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nFinancial Assets and Liabilities\nWe have estimated the fair value of our financial instruments as of September 30, 2022 using available market information or other appropriate valuation methodologies. The carrying amounts of cash and cash equivalents, receivables, payables and other current assets and liabilities approximate fair value because of the short maturity of those instruments. The carrying amounts due under the revolving credit facility approximate fair value as the interest on outstanding borrowings is calculated at a spread over the London Interbank Offered Rate (LIBOR) or based on the prime rate, at our election.\nNonfinancial Assets and Liabilities\nOur nonfinancial assets such as property, plant and equipment, inventories, and other intangible assets are not measured at fair value on a recurring basis; however they are subject to fair value adjustments in certain circumstances, such as when there is evidence that an impairment may exist. No impairments were recorded during 2022.\n2. Acquisitions\nOn November 4, 2021, we acquired Networks Electronic Company, LLC (NEco) for a purchase price of approximately $15.4 million, net of cash acquired. NEco, based in Chatsworth, California, provides miniature electro-explosive devices utilized in mission-critical defense and aerospace applications. Since the date of acquisition, the operating results for the NEco business have been included as part of PTI in the A&D segment. The acquisition date fair value of the assets acquired and liabilities assumed primarily were as follows: approximately $0.6 million of accounts receivable, $1.5 million of inventory, $0.2 million of property, plant and equipment, $0.7 million of accounts payable and accrued expenses, $8.1 million of identifiable intangible assets, mainly consisting of customer relationships totaling $6.3 million. The acquired goodwill of $5.7 million related to excess value associated with opportunities to expand the services and products that the Company can offer to its customers. We anticipate that the goodwill will be deductible for tax purposes.\nOn August 9, 2021 we acquired the assets of Phenix Technologies, Inc. (Phenix), for a purchase price of approximately $47.2 million in cash. Phenix, based in Accident, Maryland, is a leading designer and manufacturer of high voltage, high current, high power test systems and components and solutions supporting the electric utility industry, high voltage test laboratories, and field service organizations worldwide. Since the date of acquisition, the operating results for the Phenix business have been included as part of the USG segment. The acquisition date fair value of the assets acquired and liabilities assumed were as follows: approximately $2.6 million of accounts receivable, $5.8 million of inventory, $8.0 million of property, plant and equipment, $6.2 million of accounts payable and accrued expenses, $3.7 million for tradenames, $9.6 million of customer relationships and $0.5 million of miscellaneous items. The tradename was determined to have an indefinite useful life and the customer relationships were determined to have a useful life of 13 years. The acquired goodwill of $18.7 million relates to excess value associated with opportunities to expand the services and products that the Company can offer to its customers, with approximately $15 million of goodwill deductible for tax purposes. During the fourth quarter of 2022, the Company received $4.6 million upon finalization of the working capital adjustment.\nOn July 29, 2021 we acquired I.S.A. - Altanova Group S.r.l., (Altanova), headquartered in Taino, Italy, for a purchase price of approximately $115 million, net of cash acquired. Altanova is a supplier of diagnostic products, monitoring systems and services related to power generation, transmission and distribution networks, renewable energy and storage, and process industries to customers in more than 100 countries. Since the date of acquisition, the operating results for the Altanova business have been included as part of the USG segment. The acquisition date fair value of the assets acquired and liabilities assumed were as follows: $9.7 million of accounts receivable, $5.6 million of inventory, $1.2 million of property, plant and equipment, $9.0 million of other assets, $12.8 million of accounts payable and accrued expenses, $6.9 million of other liabilities, $16.7 million of deferred tax liabilities, $50.5 million of customer relationships and $4.3 million of tradenames. The tradename was determined to have a useful life of ten years and the customer relationships were determined to have a useful life of twenty years. The acquired goodwill of $71.1 million relates to the excess value associated with opportunities to expand the services and products that the Company can offer to its customers, access to new markets, and synergies anticipated by combining Altanova with existing USG businesses. The goodwill is not deductible for tax purposes.\nWe accounted for these acquisitions using the purchase method of accounting, and accordingly, we allocated the respective purchase prices to the assets (including intangible assets) acquired and liabilities assumed based on estimated fair values at the date of acquisition. We have included the financial results from these acquisitions in our financial statements from the date of acquisition.\n3. Technical Packaging Divestiture\nIn December 2019, we completed the sale of our Technical Packaging business segment, consisting of our wholly-owned subsidiaries Thermoform Engineered Quality LLC, Plastique Ltd. and Plastique sp. z o.o. (the Technical Packaging Business), to Sonoco Plastics, Inc. and Sonoco Holdings, Inc. (Buyers), two wholly-owned subsidiaries of Sonoco Products Company (NYSE:SON). The companies within this segment provide innovative solutions to the medical and commercial markets for thermoformed packages and specialty products using a wide variety of thin gauge plastics and pulp. Results of operations, financial position and cash flows for the Technical Packaging business are reflected as discontinued operations in the Consolidated Financial Statements and related notes for all periods presented.\nNet sales and pretax (loss) from the Technical Packaging business were $16.5 million and $(0.3) million, respectively, in 2020. We received net proceeds from the sale of approximately $184 million and recorded $76.5 million after-tax net earnings on the sale in 2020. We finalized a contractual working capital adjustment and paid $0.2 million to the buyer during the third quarter of 2020.\n4. Goodwill and Other Intangible Assets\nIncluded on the Consolidated Balance Sheets at September 30, 2022 and 2021 are the following intangible assets gross carrying amounts and accumulated amortization:\n(Dollars in thousands)\nGoodwill\n$\n492,709\n504,853\nIntangible assets with determinable lives:\nPatents\nGross carrying amount\n$\n2,353\n2,131\nLess: accumulated amortization\n1,091\nNet\n$\n1,262\n1,159\nCapitalized software\nGross carrying amount\n$\n106,583\n93,671\nLess: accumulated amortization\n70,476\n63,740\nNet\n$\n36,107\n29,931\nCustomer Relationships\nGross carrying amount\n$\n287,447\n288,530\nLess: accumulated amortization\n96,921\n80,882\nNet\n$\n190,526\n207,648\nOther\nGross carrying amount\n$\n13,985\n13,177\nLess: accumulated amortization\n7,440\n4,398\nNet\n$\n6,545\n8,779\nIntangible assets with indefinite lives:\nTrade names\n$\n160,024\n161,733\nWe performed our annual evaluation of goodwill and intangible assets for impairment during the fourth quarter of 2022 and concluded that no impairment existed at September 30, 2022. There were no accumulated impairment losses as of September 30, 2022.\nThe changes in the carrying amount of goodwill attributable to each business segment for 2022 and 2021 are as follows:\n(Dollars in millions)\nA&D\nTest\nUSG\nTotal\nBalance as of September 30, 2020\n$\n102.1\n34.1\n271.9\n408.1\nAcquisition activity\n2.2\n-\n95.2\n97.4\nForeign currency translation and other\n-\n-\n(0.6)\n(0.6)\nBalance as of September 30, 2021\n$\n104.3\n34.1\n366.5\n504.9\nAcquisition activity\n5.7\n-\n(4.7)\n1.0\nForeign currency translation and other\n-\n(0.1)\n(13.1)\n(13.2)\nBalance as of September 30, 2022\n$\n110.0\n34.0\n348.7\n492.7\nAmortization expense related to intangible assets with determinable lives was $25.9 million, $20.8 million and $21.8 million in 2022, 2021 and 2020, respectively. Patents are amortized over the life of the patents, generally ten to twenty years. Capitalized software is amortized over the estimated useful life of the software, generally three to seven years. Customer relationships are generally amortized over thirteen to twenty years. Intangible asset amortization for fiscal years 2023 through 2027 is estimated at $18.5 million in 2023, and approximately $17 million in years 2024 through 2027.\n5. Accounts Receivable\nAccounts receivable, net of the allowance for credit losses, consisted of the following at September 30, 2022 and 2021:\n(Dollars in thousands)\nCommercial\n$\n151,565\n128,952\nU.S. Government and prime contractors\n13,080\n17,389\nTotal\n$\n164,645\n146,341\n6. Inventories, Net\nInventories, net, from continuing operations consisted of the following at September 30, 2022 and 2021:\n(Dollars in thousands)\nFinished goods\n$\n32,471\n32,998\nWork in process\n38,492\n34,201\nRaw materials\n91,440\n79,949\nTotal\n$\n162,403\n147,148\n7. Income Tax Expense\nWe allocated total income tax expense for the years ended September 30, 2022, 2021 and 2020 to income tax expense as follows:\n(Dollars in thousands)\nIncome tax expense from continuing operations\n$\n24,115\n17,175\n13,510\nIncome tax expense from discontinued operations\n-\n-\n23,501\nTotal income tax expense (benefit)\n$\n24,115\n17,175\n37,011\nThe components of income from continuing operations before income taxes for 2022, 2021 and 2020 consisted of the following:\n(Dollars in thousands)\nUnited States\n$\n90,674\n70,214\n23,951\nForeign\n15,761\n10,457\n12,455\nTotal income before income taxes\n$\n106,435\n80,671\n36,406\nThe principal components of income tax expense (benefit) from continuing operations for 2022, 2021 and 2020 consist of:\n(Dollars in thousands)\nFederal:\nCurrent\n$\n7,248\n14,807\n10,495\nDeferred\n9,752\n(1,598)\n1,311\nState and local:\nCurrent\n1,635\n2,257\n1,984\nDeferred\n1,774\n(786)\n(932)\nForeign:\nCurrent\n4,645\n2,922\n2,875\nDeferred\n(939)\n(427)\n(2,223)\nTotal\n$\n24,115\n17,175\n13,510\nThe actual income tax expense from continuing operations for 2022, 2021 and 2020 differs from the expected tax expense for those years (computed by applying the U.S. Federal corporate statutory rate) as follows:\nFederal corporate statutory rate\n21.0\n%\n21.0\n%\n21.0\n%\nState and local, net of Federal benefits\n2.9\n1.9\n2.3\nImpact of foreign operations\n(0.3)\n(0.4)\n1.3\nFederal research credit\n(0.3)\n(0.9)\n(3.7)\nExecutive compensation\n0.5\n0.9\n1.6\nValuation allowance\n(0.3)\n-\n(6.8)\nU.S. tax on GILTI\n1.8\n1.0\n3.2\nGILTI foreign tax credits\n(1.5)\n(0.6)\n(2.7)\nFDII deduction\n(0.9)\n(1.7)\n(2.6)\nPension plan termination charge\n-\n-\n23.4\nOther, net\n(0.2)\n0.1\n0.1\nEffective income tax rate\n22.7\n%\n21.3\n%\n37.1\n%\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets and liabilities at September 30, 2022 and 2021 are presented below:\n(Dollars in thousands)\nDeferred tax assets:\nInventories\n$\n4,990\n4,267\nPension and other postretirement benefits\nTiming differences related to revenue recognition\n9,365\nLease liabilities\n7,073\n7,614\nNet operating and capital loss carryforwards - domestic\nNet operating loss carryforward - foreign\n3,396\n4,279\nOther compensation-related costs and other cost accruals\n9,032\n8,174\nState credit carryforward\n1,676\n2,639\nForeign credit carryforward\nTotal deferred tax assets\n27,670\n37,931\nDeferred tax liabilities:\nROU assets\n(7,073)\n(7,614)\nGoodwill\n(11,691)\n(13,746)\nAcquisition intangible assets\n(62,051)\n(62,052)\nDepreciation, software amortization\n(24,503)\n(22,418)\nNet deferred tax liabilities before valuation allowance\n(77,648)\n(67,899)\nLess valuation allowance\n(1,208)\n(2,011)\nNet deferred tax liabilities\n$\n(78,856)\n(69,910)\nWe had a foreign net operating loss (NOL) carryforward of $12.1 million at September 30, 2022, which reflects tax loss carryforwards in Germany, South Africa, Canada, Japan and the United Kingdom. Approximately $10.4 million of the tax loss carryforwards have no expiration date while the remaining $1.7 million will expire between 2031 and 2041. We had net foreign credit carryforwards of $0.2 million, that will expire between 2041 and 2042.We had deferred tax assets related to state NOL carryforwards of $0.6 million at September 30, 2022 which expire between 2025 and 2042. We also had net state research and other credit carryforwards of $1.7 million of which $0.9 million expires between 2024 and 2037. The remaining $0.8 million does not have an expiration date.\nThe valuation allowance for deferred tax assets as of September 30, 2022 and 2021 was $1.2 million and $2.0 million, respectively. The net change in the total valuation allowance for each of the years ended September 30, 2022 and 2021 was a decrease of $0.8 million and an increase of $0.1 million, respectively.We established a valuation allowance against state credit carryforwards of $0.6 million at September 30, 2021. This balance was released as of September 30, 2022. In addition, we maintained a valuation allowance against state NOL carryforwards that are not expected to be realized in future periods of $0.5 million at September 30 of both 2022 and 2021. Lastly, we established a valuation allowance against certain NOL carryforwards in foreign jurisdictions which may not be realized in future periods of $0.7 million and $0.9 million at September 30, 2022 and 2021, respectively.\nAs of September 30, 2022, the Company does not have any material unrecognized tax benefits.\n8. Debt\nDebt consists of the following at September 30, 2022 and 2021:\n(Dollars in thousands)\nTotal borrowings\n$\n153,000\n154,000\nCurrent portion of long-term debt and short-term borrowings\n(20,000)\n(20,000)\nTotal long-term debt, less current portion\n$\n133,000\n134,000\nThe Credit Facility includes a $500 million revolving line of credit as well as provisions allowing for an increase of the credit facility commitment amount by an additional $250 million, if necessary, with the consent of the lenders. The bank syndication supporting the facility is comprised of a diverse group of eight banks led by JP Morgan Chase Bank, N.A., as Administrative Agent. The Credit Facility matures September 27, 2024, with balance due by this date.\nInterest on borrowings under the Credit Facility is calculated at a spread over either the New York Federal Reserve Bank Rate, the prime rate, or the London Interbank Offered Rate (LIBOR), depending on various factors. The Credit Facility also requires a facility fee ranging from 10 to 25 basis points per annum on the unused portion. The interest rate spreads and the facility fee are subject to increase or decrease depending on the Companys leverage ratio.\nThe Credit Facility is secured by the unlimited guaranty of our direct and indirect material U.S. subsidiaries and the pledge of 100% of the equity interests of our direct and indirect material foreign subsidiaries. The financial covenants of the Credit Facility include a leverage ratio and an interest coverage ratio. As of September 30, 2022, we were in compliance with all covenants.\nAt September 30, 2022, we had approximately $339 million available to borrow under the Credit Facility, plus the $250 million increase option subject to the lenders consent, in addition to $97.7 million cash on hand. We classified $20 million as the current portion of long-term debt as of September 30, 2022, as we intend to repay this amount within the next twelve months; however, we have no contractual obligation to repay such amount during the next twelve months.\nDuring 2022 and 2021, our maximum aggregate short-term borrowings at any month-end were $208 million and $174 million, respectively, and the average aggregate short-term borrowings and outstanding based on month-end balances were $189.8 million and $71.3 million, respectively. The weighted average interest rates were 2.11% and 1.20% for 2022 and 2021, respectively. As of September 30, 2022, the interest rate on our debt was 4.12%. The letters of credit issued and outstanding under the Credit Facility totaled $8.0 million and $8.5 million at September 30, 2022 and 2021, respectively.\n9. Capital Stock\nThe 30,707,748 and 30,666,173 common shares as presented in the accompanying Consolidated Balance Sheets at September 30, 2022 and 2021 represent the actual number of shares issued at the respective dates. We held 4,854,997 and 4,604,741 common shares in treasury at September 30, 2022 and 2021, respectively.\nIn August 2021, our Board of Directors approved a new common stock repurchase program authorizing us to repurchase shares of our stock from time to time in Managements discretion, in the open market or otherwise, up to a maximum total repurchase amount of $200 million (or the maximum amount permitted under our bank credit agreements, if less). This program is scheduled to expire September 30, 2024. We repurchased approximately 257,500 shares under this program in 2022 at an aggregate cost of $20.0 million. We did not repurchase any shares in 2021 or 2020.\n10. Share-Based Compensation\nWe provide compensation benefits to certain key employees under several share-based plans providing for performance-accelerated and/or time-vested restricted stock unit awards, and to non-employee directors under a separate compensation plan for non-employee directors. As of September 30, 2022, our equity compensation plans had a total of 580,437 shares authorized and available for future issuance.\nPerformance-Accelerated Restricted Stock Unit (PARS) Awards, Time-Vested Restricted Stock Unit (RSU) Awards, and Performance Share Unit (PSU) Awards\nA PARS award represents the right to receive a specified number of shares of Company common stock if and when the award vests. A PARS award is not stock and does not give the recipient any rights as a shareholder until it vests and is paid out in shares of stock. PARS awards currently outstanding have a five-year vesting period, with accelerated vesting if certain targets based on market conditions are achieved. In these cases, if it is probable that the performance condition will be met, the Company recognizes compensation cost on a straight-line basis over the shorter performance period; otherwise, it will recognize compensation cost over the longer service period. Compensation cost for the outstanding PARS awards is being recognized over the shorter performance period, as it is probable the performance condition will be met. The PARS award grants were valued at the stock price on the date of grant.\nThe terms of the RSU awards are similar to those of the PARS awards, but without any provision for acceleration of the vesting date. Each RSU represents the right to receive one share of Company common stock if the recipient remains continuously employed by the Company until the award vests, in this case 3 ½ years after the effective award date. The RSU award grants were valued at the stock price on the date of grant.\nBeginning in fiscal year 2022, the Company granted PSU awards with a three-year vesting period, with each PSU representing the right to receive one share of Company common stock if certain performance targets are achieved. The targets are based on achieving certain EBITDA metrics and a Total Shareholder return (rTSR) metric over a three-year period.\nPretax compensation expense related to the above awards for continuing operations was $6.1 million, $5.6 million and $4.3 million for 2022, 2021 and 2020, respectively.\nThe following summary presents information regarding outstanding share-based compensation awards as of the specified dates, and changes during the specified periods:\nFY 2022\nFY 2021\nFY 2020\nEstimated\nEstimated\nEstimated\nWeighted\nWeighted\nWeighted\nShares\nAvg. Price\nShares\nAvg. Price\nShares\nAvg. Price\nNonvested at October 1,\n226,705\n$\n76.15\n220,300\n$\n66.55\n281,004\n$\n59.72\nGranted\n117,045\n82.54\n51,476\n108.05\n45,723\n74.80\nVested\n(75,327)\n56.87\n(35,753)\n64.40\n(89,822)\n50.51\nCancelled\n(3,056)\n89.51\n(9,318)\n70.50\n(16,605)\n60.48\nNonvested at September 30,\n265,367\n$\n84.29\n226,705\n$\n76.15\n220,300\n$\n66.55\nCompensation Plan for Non-Employee Directors\nIn addition to an annual cash retainer, we provide each non-employee director with an annual equity award having a grant date market value of $180,000, based on the NYSE closing price of the Companys stock on the date of grant. For calendar years prior to 2021, the award consisted of actual shares of Company stock, but beginning in January 2021, the award has been in the form of Restricted Stock Units, each of which represents the right to receive one share of Company stock at the end of a one-year vesting period. At the end of the vesting period, each award will be converted into the right to receive the same number of actual shares of common stock, plus additional shares representing the value of the quarterly dividends which would have accrued on the underlying shares during the vesting period. Compensation expense related to the non-employee director grants was $1.2 million, $1.3 million and $1.3 million for 2022, 2021 and 2020, respectively.\nTotal Share-Based Compensation\nThe total share-based compensation cost that has been recognized in results of operations and included within SG&A from continuing operations was $7.3 million, $6.9 million and $5.6 million for 2022, 2021 and 2020, respectively. The total income tax benefit recognized in results of operations for share-based compensation arrangements was $1.5 million, $1.4 million and $1.2 million for 2022, 2021 and 2020, respectively. As of September 30, 2022, there was $11.2 million of total unrecognized compensation cost related to share-based compensation arrangements. That cost is expected to be recognized over a weighted-average period of 1.7 years.\n11. Retirement and Other Benefit Plans\nOn November 14, 2019, our Board of Directors approved a resolution to terminate the Companys defined benefit pension plan (the Plan) effective as of February 29, 2020. In connection with the termination, we contributed $25.7 million of cash to the Plan during 2020, settled approximately $32.4 million of Plan liabilities during 2020 through lump-sum payments from existing plan assets to eligible participants who elected to receive them, and recorded approximately $40.6 million of charges associated with these settlements. During 2020, we settled approximately $69.1 million of Plan liabilities by entering into an agreement to purchase annuities from a third-party insurance company. This agreement covered active and former employees and their beneficiaries, with the insurance company assuming the future annuity payments for these individuals.\nSubstantially all our domestic employees are covered by a defined contribution plan maintained by the Company. In addition, we offer unfunded post-retirement pre-Medicare health insurance benefits to a small number of eligible retirees and employees. We formerly provided unfunded post-retirement life insurance to qualifying retired employees who retired before 2005, but ceased providing this coverage on July 31, 2020. There was no financial impact of this plan in 2022.\n12. Business Segment Information\nWe are organized based on the products and services we offer, and we classify our continuing business operations in three reportable segments for financial reporting purposes: Aerospace & Defense (A&D), Utility Solutions Group (USG) and RF Shielding and Test (Test). In addition, for reporting certain financial information we treat Corporate activities as a separate segment. The former Technical Packaging segment was divested in December 2019 and is reflected as discontinued operations for 2020.\nThe A&D segments operations consist of PTI Technologies Inc. (PTI), VACCO Industries (VACCO), Crissair, Inc. (Crissair), Mayday Manufacturing Co. (Mayday), Westland Technologies, Inc. (Westland), Globe Composite Solutions, LLC (Globe) and Networks Electronic Company, LLC (NEco).The companies within this segment primarily design and manufacture specialty filtration, fluid control and naval products, including hydraulic filter elements and fluid control devices used in aerospace and defense applications, unique filter mechanisms used in micro-propulsion devices for satellites, custom designed filters for manned aircraft and submarines, products and systems to reduce vibration and/or acoustic signatures and otherwise reduce or obscure a vessels signature, and other communications, sealing, surface control and hydrodynamic related applications to enhance U.S. Navy maritime survivability; precision-tolerance machined components for the aerospace and defense industry; metal processing services; and miniature electro-explosive devices utilized in mission-critical defense and aerospace applications.\nThe USG segments operations consist of Doble Engineering Company and related subsidiaries including Morgan Schaffer and Altanova (collectively, Doble), and NRG Systems, Inc. (NRG). Doble is an industry leader in the development, manufacture and delivery of diagnostic testing and data management solutions that enable electric power grid operators to assess the integrity of high-voltage power delivery equipment. It combines three core elements for customers - diagnostic test and condition monitoring instruments, expert consulting, and testing services - and provides access to its large reserve of related empirical knowledge. NRG is a global market leader in the design and manufacture of decision support tools for the renewable energy industry, primarily wind and solar. The recent acquisition of Altanova not only complements our existing products and services but its strong market share in Europe and Asia provides a significant international platform for our USG segment.\nThe Test segments operations consist of ETS-Lindgren Inc. and related subsidiaries (ETS-Lindgren). ETS-Lindgren is an industry leader in designing and manufacturing products which provide its customers with the ability to identify, measure and contain magnetic, electromagnetic and acoustic energy. It supplies its customers with a broad range of isolated environments and turnkey systems, including RF test facilities, acoustic test enclosures, RF and magnetically shielded rooms, secure communication facilities, RF measurement systems and broadcast and recording studios. Many of these facilities include proprietary features such as shielded doors and windows. ETS-Lindgren also provides the design, program management, installation and integration services required to successfully complete these types of facilities. ETS-Lindgren also supplies customers with a broad range of components including RF absorptive materials, RF filters, active compensation systems, antennas, antenna masts, turntables and electric and magnetic probes, RF test cells, proprietary measurement software and other test accessories required to perform a variety of tests. ETS-Lindgren offers a variety of services including calibration for antennas and field probes, chamber certification, field surveys, customer training and a variety of product tests. ETS-Lindgren serves the acoustics, medical, health and safety, electronics, wireless communications, automotive and defense markets.\nAccounting policies of the segments are the same as those described in the summary of significant accounting policies in Note 1 to the Consolidated Financial Statements. The operating units within each reporting segment have been aggregated because of similar economic characteristics and meet the other aggregation criteria of FASB ASC 280.\nWe evaluate the performance of our operating units based on EBIT, which is defined as earnings before interest and taxes. EBIT on a consolidated basis is a non-GAAP financial measure. Intersegment sales and transfers are not significant. Segment assets consist primarily of customer receivables, inventories, capitalized software and fixed assets directly associated with the production processes of the segment. Segment depreciation and amortization is based upon the direct assets listed above. The tables below are presented on the basis of continuing operations and exclude discontinued operations.\nNet Sales\n(Dollars in millions)\nYear ended September 30,\nA&D\n$\n351.4\n314.8\n351.9\nUSG\n278.4\n202.9\n191.7\nTest\n227.7\n197.7\n186.9\nConsolidated totals\n$\n857.5\n715.4\n730.5\nNo customer exceeded 10% of consolidated sales in 2022 or 2021 and one customer exceeded 10% of consolidated sales in 2020.\nEBIT\n(Dollars in millions)\nYear ended September 30,\nA&D\n$\n68.4\n56.5\n69.9\nUSG\n57.6\n40.9\n24.4\nTest\n32.6\n27.6\n27.2\nReconciliation to consolidated totals (Corporate)\n(47.3)\n(42.1)\n(78.4)\nConsolidated EBIT\n111.3\n82.9\n43.1\nLess: interest expense\n(4.9)\n(2.2)\n(6.7)\nEarnings before income tax\n$\n106.4\n80.7\n36.4\nIdentifiable Assets\n(Dollars in millions)\nYear ended September 30,\nA&D\n$\n295.2\n270.0\nUSG\n220.0\n197.5\nTest\n174.6\n153.6\nCorporate\n964.7\n956.2\nConsolidated totals\n$\n1,654.5\n1,577.3\nCorporate consists primarily of deferred taxes, acquired intangible assets including goodwill and cash balances.\nCapital Expenditures\n(Dollars in millions)\nYear ended September 30,\nA&D\n$\n9.4\n10.4\n15.9\nUSG\n14.4\n11.6\n12.4\nTest\n8.3\n4.7\n3.6\nCorporate\n-\n-\n0.2\nConsolidated totals\n$\n32.1\n26.7\n32.1\nIn addition to the above amounts, we incurred expenditures for capitalized software of $12.9 million, $8.8 million and $9.0 million in 2022, 2021 and 2020, respectively.\nDepreciation and Amortization\n(Dollars in millions)\nYear ended September 30,\nA&D\n$\n11.1\n10.4\n9.4\nUSG\n12.6\n13.5\n14.4\nTest\n5.4\n5.2\n5.0\nCorporate\n19.2\n12.9\n12.5\nConsolidated totals\n$\n48.3\n42.0\n41.3\nDepreciation expense of property, plant and equipment was $22.4 million, $21.2 million and $19.5 million for 2022, 2021 and 2020, respectively.\nGeographic Information\nNet Sales\n(Dollars in millions)\nYear ended September 30,\nUnited States\n$\n603.2\n517.0\n529.4\nAsia\n122.4\n92.3\n96.3\nEurope\n72.4\n53.5\n51.3\nCanada\n31.2\n27.0\n31.7\nIndia\n10.3\n12.4\n10.3\nOther\n18.0\n13.2\n11.5\nConsolidated totals\n$\n857.5\n715.4\n730.5\nLong-Lived Assets\n(Dollars in millions)\nYear ended September 30,\nUnited States\n$\n141.5\n141.0\nMexico\n5.8\n3.8\nOther\n8.7\n9.5\nConsolidated totals\n$\n156.0\n154.3\nWe attribute net sales to countries based on the location of the customer. We attribute long-lived assets to countries based on the location of the asset.\n13. Commitments and Contingencies\nAt September 30, 2022, we had $8.0 million in letters of credit outstanding as guarantees of contract performance and cash amounts that exceeded federally insured amounts. As a normal incident of the businesses in which we are engaged, various claims, charges and litigation are asserted or commenced from time to time against us. Additionally, we are currently involved in various stages of investigation and remediation relating to environmental matters. It is the opinion of Management that the aggregate costs involved in the resolution of these matters, and final judgments, if any, which might be rendered against us are adequately accrued, are covered by insurance or are not likely to have a material adverse effect on our financial results as the estimated exposure to loss is not material.\n14. Leases\nEffective October 1, 2019 we adopted ASC 842, Leases. We determine at lease inception whether an arrangement that provides control over the use of an asset is a lease. We recognize at lease commencement a right-of-use (ROU) asset and lease liability based on the present value of the future lease payments over the lease term (including anticipated renewals). We have elected not to recognize a ROU asset and lease liability for leases with terms of 12 months or less. Certain of our leases include options to extend the term of the lease for up to 20 years. When it is reasonably certain that we will exercise the option, Management includes the impact of\nthe option in the lease term for purposes of determining total future lease payments. As most of our lease agreements do not explicitly state the discount rate implicit in the lease, Management uses our incremental borrowing rate on the commencement date to calculate the present value of future payments based on the tenor of each arrangement.\nOur leases for real estate commonly include escalating payments. We include these variable lease payments in the calculation of our ROU asset and lease liability. In addition to the present value of the future lease payments, the calculation of the ROU asset also includes any deferred rent, lease pre-payments and initial direct costs of obtaining the lease.\nIn addition to the base rent, real estate leases typically contain provisions for common-area maintenance and other similar services, which are considered non-lease components for accounting purposes. Non-lease components are excluded from our ROU assets and lease liabilities and expensed as incurred.\nOur leases are for office space, manufacturing facilities, and machinery and equipment.\nThe components of lease costs are shown below:\nYear Ended\nYear Ended\nSeptember 30,\nSeptember 30,\n(Dollars in thousands)\nFinance lease cost:\nAmortization\n$\n1,572\n2,413\nInterest on lease liabilities\n1,235\nOperating lease cost\n6,347\n5,879\nTotal lease cost\n$\n8,892\n9,527\nAdditional information related to leases is shown below:\nYear Ended\nYear Ended\nSeptember 30,\nSeptember 30,\n(Dollars in thousands)\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n6,101\n5,504\nOperating cash flows from finance leases\n1,228\nFinancing cash flows from finance leases\n1,224\n1,757\nRight-of-use assets obtained in exchange for operating lease liabilities\n$\n4,160\n15,609\nWeighted-average remaining lease term:\nOperating leases\n9.3\nyrs\n10.3\nyrs\nFinance leases\n12.0\nyrs\n11.7\nyrs\nWeighted-average discount rate:\nOperating leases\n3.2\n%\n3.1\n%\nFinance leases\n4.6\n%\n4.2\n%\nThe table below is a reconciliation of future undiscounted cash flows to the operating and finance lease liabilities, and the related ROU assets, presented on our Consolidated Balance Sheet on September 30, 2022:\n(Dollars in thousands)\nOperating\nFinance\nYears Ending September 30:\nLeases\nLeases\n$\n5,953\n2,256\n5,132\n2,315\n3,790\n2,370\n2,881\n2,434\n2027 and thereafter\n17,029\n18,997\nTotal minimum lease payments\n34,785\n28,372\nLess: amounts representing interest\n4,760\n7,189\nPresent value of net minimum lease payments\n$\n30,025\n21,183\nLess: current portion of lease obligations\n5,172\n1,331\nNon-current portion of lease obligations\n24,853\n19,852\nROU assets\n$\n29,150\n17,343\nThe table below is a reconciliation of future undiscounted cash flows to the operating and finance lease liabilities, and the related ROU assets, presented on our Consolidated Balance Sheet on September 30, 2021:\n(Dollars in thousands)\nOperating\nFinance\nYears Ending September 30:\nLeases\nLeases\n$\n5,448\n3,153\n4,679\n3,235\n4,032\n3,319\n3,654\n3,399\n2026 and thereafter\n20,453\n25,516\nTotal minimum lease payments\n38,266\n38,622\nLess: amounts representing interest\n5,691\n9,092\nPresent value of net minimum lease payments\n$\n32,575\n29,530\nLess: current portion of lease obligations\n4,543\n2,180\nNon-current portion of lease obligations\n28,032\n27,350\nROU assets\n$\n31,846\n24,964\nWe include operating and finance lease liabilities in the Consolidated Balance Sheet in accrued other expenses (current portion) and other liabilities (long-term portion). We include operating lease ROU assets as a caption on the Consolidated Balance Sheet and include finance lease ROU assets in Property, plant and equipment on the Consolidated Balance Sheet.\n15. Revenues\n(a) Disaggregation of Revenues\nThe tables below present our revenues by customer type, geographic location, and revenue recognition method for the years ended September 30, 2022 and 2021, as we believe this presentation best depicts how the nature, amount, timing and uncertainty of net sales and cash flows are affected by economic factors. The tables also include a reconciliation of the disaggregated revenue within our reportable segments.\nYear Ended September 30, 2022\n(In thousands)\nA&D\nUSG\nTest\nTotal\nCustomer type:\nCommercial\n$\n144,305\n272,432\n209,016\n625,753\nGovernment\n207,108\n5,935\n18,706\n231,749\nTotal revenues\n$\n351,413\n278,367\n227,722\n857,502\nGeographic location:\nUnited States\n$\n299,158\n180,586\n123,428\n603,172\nInternational\n52,255\n97,781\n104,294\n254,330\nTotal revenues\n$\n351,413\n278,367\n227,722\n857,502\nRevenue recognition method:\nPoint in time\n$\n144,039\n224,502\n58,522\n427,063\nOver time\n207,374\n53,865\n169,200\n430,439\nTotal revenues\n$\n351,413\n278,367\n227,722\n857,502\nYear Ended September 30, 2021\n(In thousands)\nA&D\nUSG\nTest\nTotal\nCustomer type:\nCommercial\n$\n130,217\n199,111\n177,601\n506,929\nGovernment\n184,607\n3,797\n20,107\n208,511\nTotal revenues\n$\n314,824\n202,908\n197,708\n715,440\nGeographic location:\nUnited States\n$\n275,976\n140,545\n100,438\n516,959\nInternational\n38,848\n62,363\n97,270\n198,481\nTotal revenues\n$\n314,824\n202,908\n197,708\n715,440\nRevenue recognition method:\nPoint in time\n$\n136,449\n153,163\n40,609\n330,221\nOver time\n178,375\n49,745\n157,099\n385,219\nTotal revenues\n$\n314,824\n202,908\n197,708\n715,440\n(b) Remaining Performance Obligations\nOur remaining performance obligations, which is the equivalent of our backlog, represent the expected transaction price allocated to our contracts that we expect to recognize as revenue in future periods when we perform under the contracts. These remaining obligations include amounts that have been formally appropriated under contracts with the U.S. Government, and exclude unexercised contract options and potential orders under ordering-type contracts such as Indefinite Delivery, Indefinite Quantity contracts. At September 30, 2022, we had $695.0 million in remaining performance obligations of which we expect to recognize revenues of approximately 80% in the next twelve months.\n(c) Contract assets and contract liabilities\nWe report assets and liabilities related to our contracts with customers on a contract-by-contract basis at the end of each reporting period. At September 30, 2022, our contract assets and contract liabilities totaled $125.2 million and $137.6 million, respectively. At September 30, 2021, our contract assets and contract liabilities totaled $93.8 million and $108.8 million, respectively. During 2022, we recognized approximately $83.8 million in revenues that were included in the contract liabilities balance at September 30, 2021.\nMANAGEMENTS STATEMENT OF FINANCIAL RESPONSIBILITY\nThe Companys Management is responsible for the fair presentation of the Companys financial statements in accordance with accounting principles generally accepted in the United States of America, and for their integrity and accuracy. Management is confident that its financial and business processes provide accurate information on a timely basis.\nManagement, with the oversight of ESCOs Board of Directors, has established and maintains a strong ethical climate in which the Companys affairs are conducted. Management also has established an effective system of internal controls that provide reasonable assurance as to the integrity and accuracy of the financial statements, and responsibility for the Companys assets. Grant Thornton LLP, the Companys independent registered public accounting firm, reports directly to the Audit and Finance Committee of the Board of Directors. The Audit and Finance Committee has established policies consistent with corporate reform laws for auditor independence. In accordance with corporate governance listing requirements of the New York Stock Exchange:\n● A majority of Board members are independent of the Company and its Management.\n● All members of the key Board committees - the Audit and Finance, the Human Resources and Compensation and the Nominating and Corporate Governance Committees - are independent.\n● The independent members of the Board meet regularly without the presence of Management.\n● The Company has a clear code of ethics and a conflict of interest policy to ensure that key corporate decisions are made by individuals who do not have a financial interest in the outcome, separate from their interest as Company officials.\n● The charters of the Board committees clearly establish their respective roles and responsibilities.\n● The Company has a Corporate Ethics Committee, ethics officers at each operating location and an ombudsman hot line available to all domestic employees and all foreign employees have local ethics officers and access to the Companys ombudsman.\nThe Company has a strong financial team, from its executive leadership to each of its individual contributors. Management monitors compliance with its financial policies and practices over critical areas including internal controls, financial accounting and reporting, accountability, and safeguarding of its corporate assets. The internal audit function maintains oversight over the key areas of the business and financial processes and controls, and reports directly to the Audit and Finance Committee. Additionally, all employees are required to adhere to the ESCO Code of Business Conduct and Ethics, which is monitored by the Corporate Ethics Committee.\nManagement is dedicated to ensuring that the standards of financial accounting and reporting that are established are maintained. The Companys culture demands integrity and a commitment to strong internal practices and policies.\nThe Consolidated Financial Statements have been audited by Grant Thornton LLP and KPMG LLP, whose reports are included herein.\nNovember 29, 2022\n/s/Victor L. Richey\n/s/Christopher L. Tucker\nVictor L. Richey\nChristopher L. Tucker\nChairman, Chief Executive Officer\nSenior Vice President\nand President\nand Chief Financial Officer\nEXHIBITS\nThe following exhibits are submitted with and attached to this Form 10-K; exhibit numbers correspond to the exhibit table in Item 601 of Regulation S-K. For a complete list of exhibits including those incorporated by reference, see Item 15(a)(3) of this Form 10-K, above.\nExhibit No.\nExhibit\nSubsidiaries of the Company\n23.1\nConsent of Independent Registered Public Accounting Firm (Grant Thornton LLP)\n23.2\nConsent of Independent Registered Public Accounting Firm (KPMG LLP)\n31.1\nCertification of Chief Executive Officer\n31.2\nCertification of Chief Financial Officer\n*\nCertification of Chief Executive Officer and Chief Financial Officer\n101.INS\n**\nInline XBRL Instance Document\n101.SCH\n**\nInline XBRL Schema Document\n101.CAL\n**\nInline XBRL Calculation Linkbase Document\n101.LAB\n**\nInline XBRL Label Linkbase Document\n101.PRE\n**\nInline XBRL Presentation Linkbase Document\n101.DEF\n**\nInline XBRL Definition Linkbase Document\n**\nCover Page Inline Interactive Data File (contained in Exhibit 101)\n* Furnished (and not filed) herewith pursuant to Item 601(b)(32)(ii) of Regulation S-K.\n** Exhibits 101 and 104 to this report consist of documents formatted in XBRL (Extensible Business Reporting Language) and filed with the Securities and Exchange Commission; they are not included in printed copies of this Report."
}