{
    "cik": "866787",
    "company": "AUTOZONE INC",
    "filing_type": "10-K",
    "filing_date": "2022-10-24",
    "period_of_report": "2022-08-27",
    "sic": "5531",
    "state_of_inc": "NV",
    "state_location": "TN",
    "fiscal_year_end": "0827",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/866787/0001558370-22-015239-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/866787/000155837022015239/azo-20220827x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/866787/0001558370-22-015239.txt",
    "filename": "866787_10K_2022_0001558370-22-015239.htm",
    "content": "Item 1. Business\nIntroduction\nAutoZone, Inc. (AutoZone, the Company, we, our or us) is the leading retailer and distributor of automotive replacement parts and accessories in the Americas. We began operations in 1979 and at August 27, 2022, operated 6,168 stores in the United States (U.S.), 703 stores in Mexico and 72 stores in Brazil. Each store carries an extensive product line for cars, sport utility vehicles, vans and light trucks, including new and remanufactured automotive hard parts, maintenance items, accessories and non-automotive products. At August 27, 2022, in 5,342 of our domestic stores we had a commercial sales program that provides commercial credit and prompt delivery of parts and other products to local, regional and national repair garages, dealers, service stations and public sector accounts. We also have commercial programs in all stores in Mexico and Brazil. We sell the ALLDATA brand automotive diagnostic, repair and shop management software through www.alldata.com. Additionally, we sell automotive hard parts, maintenance items, accessories and non-automotive products through www.autozone.com, and our commercial customers can make purchases through www.autozonepro.com. We also provide product information on our Duralast branded products through www.duralastparts.com. We do not derive revenue from automotive repair or installation services.\nHuman Capital Resources\nWe believe the foundation of our success is our culture, which is rooted in our Pledge and Values and defines how our employees (AutoZoners) take care of customers and fellow AutoZoners. Each AutoZoner works hard to Live the Pledge, share their passion for WOW! Customer Service and Go the Extra Mile every day to continue building and growing AutoZone for our customers.\nWe seek to be the employer of choice as we compete for talent in our retail stores, field supervision, distribution centers, and store support functions. We focus heavily on retention by offering competitive compensation and benefits packages, extensive training and development opportunities and leveraging our business resource groups to support AutoZoners with common interests or backgrounds contribute their voices, time, and talent to helping AutoZoners succeed in their careers.\nAs of August 27, 2022, we employed approximately 112,000 AutoZoners, approximately 62 percent of whom were employed full-time and the remaining 38 percent were employed part-time. About 90 percent of our AutoZoners were employed in stores or in direct field supervision, approximately 6 percent in distribution centers and approximately 4 percent in store support and other functions. Included in the above numbers are approximately 14,500 persons employed in our international operations. We have never experienced any material labor disruption, do not have any collective bargaining agreements and believe that relations with our AutoZoners are good.\nTraining & Development\nWe have a number of different types of jobs and career opportunities. While many of our AutoZoners follow more traditional career paths (e.g., part-time to full-time sales, store manager, district manager, regional manager, vice president), we encourage cross-functional development and support of AutoZoners as they expand their career into other departments and fields of interest. Many members of our senior leadership team have held positions in two or more areas of the business. We also invest in advanced leadership training in order to deepen bench strength and support succession planning. For additional information, see Store Operations-Store Personnel and Training below. We believe these opportunities are important to attract, motivate and retain high quality AutoZoners.\nRecognition\nThe AutoZone Pledge and Values drive our success and foster a strong, unique culture of teamwork and customer service. We encourage the recognition of AutoZoners for a variety of accomplishments, such as going above and beyond to deliver Trustworthy Advice and WOW! Customer Service, taking initiative to prevent incidents and injuries, making contributions to help detect or report internal or external theft or providing significant service to\nhelp others. Whether they work in our stores, distribution centers, support centers or travel to support our customers and business, we believe AutoZoners everywhere should be recognized for their efforts and outstanding performance. We also recognize AutoZoners for their years of service to the organization and our customers.\nDiversity, Equity and Inclusion (DEI)\nEmbraces Diversity is one of our Values, and we have made great strides in our DEI initiatives. With the oversight and support of a cross-functional Diversity Council and DEI Steering Committee, our DEI efforts influence and inform many parts of our human capital management function including talent acquisition, retention, professional development and workforce management. Our first business resource group (BRG) was established in 2014 (AutoZone Womens Initiative). Since then, five other BRGs now support AutoZoners who share common interests or backgrounds and have a mission to contribute their voices, time and talent to helping AutoZoners succeed and grow in their careers.\nHealth and Safety\nWe are committed to providing a safe working and shopping environment for our AutoZoners and customers. Aligned with our values, we strive to continually monitor our working and shopping environment to keep our AutoZoners and customers as safe as possible.\nAdditional information about our human capital resources can be found in our most recent Corporate Social Responsibility (CSR) Report, which is available on our website. Our CSR Report is not, and will not be deemed to be, a part of this Annual Report on Form 10-K or incorporated by reference into any of our other filings with the Securities and Exchange Commission (the SEC).\nStore Operations\nAt August 27, 2022, our stores were in the following locations:\nStore\nCount\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMississippi\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nPuerto Rico\nRhode Island\nSaint Thomas\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVermont\nVirginia\nWashington\nWashington, DC\nWest Virginia\nWisconsin\nWyoming\nTotal Domestic stores\n6,168\nMexico\nBrazil\nTotal stores\n6,943\nStore Formats\nSubstantially all stores are based on standard store formats, resulting in generally consistent appearance, merchandising and product mix. Approximately 90% to 99% of each stores square footage is selling space. In our satellite stores, approximately 40% to 50% of our space is dedicated to hard parts inventory, while our hub stores and mega hubs have 70% to 85% of their space utilized for hard parts. The hard parts inventory area is generally fronted by counters or pods that run the depth or length of the store, dividing the hard parts area from the remainder of the store. The remaining selling space contains displays of maintenance, accessories and non-automotive items.\nWe believe our stores are destination stores, generating their own traffic rather than relying on traffic created by adjacent stores. Therefore, we situate most stores on major thoroughfares with easy access and good parking.\nStore Personnel and Training\nWe provide on-the-job training as well as formal training programs, including an annual national sales meeting with related cascading meetings at our distribution centers, regional offices and stores; store meetings on specific sales and product topics; standardized computer-based training to support culture, safety, salesmanship, compliance and product and job knowledge; and several specialist, vendor and third-party programs to support learning and development in areas requiring technical expertise and specific job knowledge. All domestic AutoZoners are encouraged to complete our in-house product knowledge program and Parts Expert certification, which is developed in partnership with our key suppliers. Training is supplemented with frequent store visits by management. Store managers, commercial sales managers and managers at various levels across the organization receive financial incentives through performance-based bonuses.\nStore Support Centers\nAll store support functions are centralized in our store support centers located in Memphis, Tennessee; Monterrey, Mexico; Chihuahua, Mexico and Sao Paulo, Brazil. We believe that this centralization enhances consistent execution of our merchandising and marketing strategies at the store level, while reducing expenses and cost of sales.\nStore Automation\nAll of our stores have Z-net, our proprietary electronic catalog that enables our AutoZoners to efficiently look up the parts that our customers need and to provide complete job solutions, advice and information for customer vehicles. Z-net provides parts information based on the year, make, model and engine type of a vehicle and also tracks inventory availability at the store, at other nearby stores and through special order. The Z-net display screens are placed on the hard parts counter or pods, where both the AutoZoner and customer can view the screen.\nOur stores utilize our computerized proprietary Point-of-Sale System, which includes bar code scanning and point-of-sale data collection terminals. Our proprietary Store Management System provides administrative assistance, as well as enhanced merchandising information and improved inventory control. We believe the Point-of-Sale System also enhances customer service through faster processing of transactions, while the Store Management System provides simplified warranty and product return procedures.\nCommercial\nOur commercial sales program operates in a highly fragmented market, and we are a leading distributor of automotive parts and other products to local, regional and national repair garages, dealers, service stations and public sector accounts in the Americas. As part of our program, we offer credit and delivery to our customers, as well as online ordering through www.autozonepro.com or through the AutoZone Pro smartphone application. Through our hub and mega hub stores, we offer a greater range of parts and products desired by professional technicians. We have dedicated sales teams focused on independent repair shops as well as national, regional and public sector commercial accounts.\nStore Development\nThe following table reflects our location development during the past five fiscal years:\nFiscal Year\nLocations:\nBeginning\n6,767\n6,549\n6,411\n6,202\n6,029\nSold(1)\n-\n-\n-\n-\nNew\nClosed\n-\n-\nNet new\nRelocated\nEnding\n6,943\n6,767\n6,549\n6,411\n6,202\n(1) 26 Interamerican Motor Corporation (IMC) branches sold on April 4, 2018.\nWe believe expansion opportunities exist in markets we do not currently serve, as well as in markets where we can achieve a larger presence. We undertake substantial research prior to entering new markets. The most important criteria for opening a new store are the projected future profitability and the ability to achieve our required investment hurdle rate. Key factors in selecting new site and market locations for stores include population, demographics, vehicle profile, customer buying trends, commercial businesses, number and strength of competitors stores and the cost of real estate. In reviewing the vehicle profile, we also consider the number of vehicles that are seven years old and older, or our kind of vehicles; these vehicles are generally no longer under the original manufacturers warranties and require more maintenance and repair than newer vehicles. We seek to open new stores in high visibility sites in high traffic locations within or contiguous to existing market areas and attempt to cluster development in markets in a relatively short period of time. In addition to continuing to lease or develop our own locations, we evaluate and may make strategic acquisitions.\nMarketing and Merchandising Strategy\nWe are dedicated to providing customers with superior service and trustworthy advice as well as quality automotive parts and products at a great value in conveniently located, well-designed stores. Key elements of this strategy are:\nCustomer Service\nCustomer service is the most important element in our marketing and merchandising strategy, which is based upon consumer marketing research. We emphasize that our AutoZoners should always put customers first by providing prompt, courteous service and trustworthy advice. Our electronic parts catalog assists in the selection of parts as well as identifying any associated warranties offered by us or our vendors. We sell automotive hard parts, maintenance items, accessories and non-automotive parts through www.autozone.com, for pick-up in store or to be shipped directly to a customers home or business, with next day or same day delivery programs in most of our U.S. markets. Additionally, we offer a smartphone application that provides customers with store locations, driving directions, operating hours, product availability, the ability to purchase products and other information.\nWe also provide specialty tools through our suite of free services. Through our Loan-A-Tool program customers can borrow a specialty tool, such as a steering wheel puller, for which a do-it-yourself (DIY) customer or a repair shop would have little or no use other than for a single job. AutoZoners also provide free diagnostic and related services, including check engine and anti-lock braking system light readings through our AutoZone Fix Finder service, testing of starters, alternators and batteries, battery charging and the collection of used oil for recycling.\nMerchandising\nThe following tables show some of the types of products we sell by major category of items:\nFailure\nMaintenance\nDiscretionary\nA/C Compressors\nBatteries & Accessories\nBearings\nBelts & Hoses\nCalipers\nChassis\nClutches\nCV Axles\nEngines\nFuel Pumps\nFuses\nIgnition\nLighting\nMufflers\nRadiators\nStarters & Alternators\nThermostats\nTire Repair\nWater Pumps\nAntifreeze & Windshield Washer Fluid\nBrake Drums, Rotors, Shoes & Pads\nChemicals, including Brake & Power\nSteering Fluid, Oil & Fuel Additives\nOil & Transmission Fluid\nOil, Cabin, Air, Fuel & Transmission\nFilters\nOxygen Sensors\nPaint & Accessories\nRefrigerant & Accessories\nShock Absorbers & Struts\nSpark Plugs & Wires\nWindshield Wipers\nAir Fresheners\nCell Phone Accessories\nDrinks & Snacks\nFloor Mats & Seat Covers\nInterior & Exterior Accessories\nMirrors\nPerformance Products\nProtectants & Cleaners\nSealants & Adhesives\nSteering Wheel Covers\nStereos & Radios\nTools\nTowing\nWash & Wax\nWe believe customer satisfaction is often impacted by our ability to promptly provide specific automotive products as requested. Each store carries the same basic products, but we tailor our hard parts inventory to the makes and models of the vehicles in each stores trade area, and our sales floor products are tailored to the local stores demographics. Our hub stores (including mega hubs, which carry an even broader assortment) carry a larger assortment of products that are delivered to local satellite stores. We are constantly updating the products we offer to ensure our inventory matches the products our customers need or desire.\nPricing\nWe want to be the value leader in our industry, by consistently providing quality merchandise at the right price, backed by a satisfactory warranty and outstanding customer service. For many of our products, we offer multiple value choices in a good/better/best assortment, with appropriate price and quality differences from the good products to the better and best products. A key differentiating component versus our competitors is our exclusive line of in-house brands, which includes Duralast and the family of Duralast brands, ProElite, Shop Pro, SureBilt, TotalPro, TruGrade and Valucraft. We believe that our overall value compares favorably to that of our competitors.\nBrand Marketing: Marketing and Loyalty\nWe believe that targeted advertising and promotions play important roles in succeeding in todays environment. We are constantly working to understand our customers wants and needs so we can build long-lasting, loyal relationships. We utilize advertising, direct marketing, loyalty programs and promotions primarily to highlight our great value, the availability of high quality parts and develop a relationship with an expanding base of customers. Broadcast and digital media are our primary advertising methods of driving retail traffic, while we leverage a dedicated sales force and our ProVantage loyalty program to drive commercial sales.\nStore Design, Visual Merchandising and Promotional Execution\nWe design and build stores for high visual impact. The typical store utilizes colorful exterior and interior signage, exposed beams and ductwork and brightly lit interiors. Maintenance products, accessories and non-automotive items are attractively displayed for easy browsing by customers. In-store signage and special displays promote products on floor displays, end caps and shelves. We utilize in-store signage, creative product placement and promotions to help educate customers about products that they need.\nPurchasing and Supply Chain\nMerchandise is selected and purchased for all stores through our store support centers located in Memphis, Tennessee; Monterrey, Mexico and Sao Paulo, Brazil. Additionally, we have an office in Shanghai, China to support our sourcing efforts in Asia. In fiscal 2022, one class of similar products accounted for approximately 13 percent of our total revenues, and one vendor supplied approximately 8 percent of our total purchases. No other class of similar products accounted for 10 percent or more of our total revenues, and no other individual vendor provided more than 10 percent of our total purchases. We believe alternative sources of supply exist, at similar costs, for most types of product sold. Most of our merchandise flows through our distribution centers to our stores by our fleet of tractors and trailers or by third-party trucking firms. The distribution centers replenish all stores up to multiple times per week depending on store sales volumes.\nWe ended fiscal 2022 with 272 total domestic hub stores, which have a larger assortment of products as well as regular replenishment items that can be delivered to a store in its network within 24 hours. Hub stores are generally replenished from distribution centers multiple times per week. Hub stores have increased our ability to distribute products on a timely basis to many of our stores and to expand our product assortment.\nAs a subset of our domestic hub stores, we ended fiscal 2022 with 78 domestic mega hubs, an increase of 20 since the end of fiscal 2021. Mega hubs work in concert with our hubs to drive customer satisfaction through improved local parts availability and expanded product assortments. A mega hub store carries inventory of 80,000 to 110,000 unique SKUs, approximately twice what a hub store carries. Mega hubs provide coverage to both surrounding stores and other hub stores multiple times a day or on an overnight basis. Currently, we have over 6,000 domestic stores with access to mega hub inventory. A majority of these stores currently receive mega hub service same day.\nCompetition\nThe sale of automotive parts, accessories and maintenance items is highly competitive due to numerous factors, including name recognition, product availability, customer service, store location and price. AutoZone competes in the aftermarket auto parts industry, which includes both the retail DIY and commercial do-it-for-me (DIFM) auto parts and products markets.\nOur competitors include national, regional and local auto parts chains, independently owned parts stores, online automotive parts stores or marketplaces, wholesale distributors, jobbers, repair shops, car washes and auto dealers, in addition to discount and mass merchandise stores, hardware stores, supermarkets, drugstores, convenience stores, home stores and other retailers that sell aftermarket vehicle parts and supplies, chemicals, accessories, tools and maintenance parts. AutoZone competes on the basis of customer service, including the knowledge and expertise of our AutoZoners; merchandise quality, selection and availability; product warranty; store layouts, location and convenience; price; and the strength of our AutoZone brand name, trademarks and service marks.\nGovernment Relations\nWe are subject to numerous federal, state, and local laws and regulations, many of which are complex, frequently changing and subject to varying interpretations. These laws and regulations relate to, among other things, the marketing and sale of products; proper handling and disposal of hazardous materials, particularly in connection with our used oil, oil filter and battery recycling programs; occupational health and safety; environmental matters; labor and employment; employee wages and benefits; information security and data privacy; real property; financial reporting and disclosure; antitrust and fair competition; international trade and transportation, logistics and delivery operations.\nWhile compliance with the numerous laws and regulations applicable to our business, including environmental regulations, has not had a material adverse effect on capital expenditures, earnings or our competitive position to date, we can make no assurances as to the future costs of compliance. For more information, see the Risk Factors titled Legal and Regulatory Risks and Information Technology, Cybersecurity and Data Privacy Risks in Part I. Item 1A, Risk Factors in this report.\nTrademarks and Patents\nWe regard our trademarks, service marks, patents, domain names, trade dress, trade secrets and other intellectual property as critical to our success and important components of our marketing and merchandising strategies. We have registered several trademarks and service marks in the U.S. Patent and Trademark Office as well as in certain other countries, including without limitation: AutoZone, Get in the Zone, Duralast, Econocraft, ProElite, Shop Pro, SureBilt, TotalPro, TruGrade, Valucraft, and ALLDATA, along with variations of these trademarks. Our trademark registrations have various expiration dates; however, assuming that the trademarks are properly maintained and in use, such registrations may typically be renewed indefinitely.\nSeasonality\nOur business is somewhat seasonal in nature, with the highest sales typically occurring in the spring and summer months of February through September, and the lowest sales in the months of December and January. During short periods of time, a stores sales can be affected by weather conditions. Extremely hot or extremely cold weather may enhance sales by causing parts to fail; thereby increasing sales of seasonal products. Mild or rainy weather tends to soften sales, as parts failure rates are lower in mild weather and elective maintenance is deferred during periods of rainy weather. Over the longer term, we believe the effects of weather balance out, as we have stores throughout the Americas.\nAutoZone Websites\nOur primary website is at www.autozone.com. We make available, free of charge, at www.autozone.com, by clicking Investor Relations located at the bottom of the page, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, proxy statements, registration statements and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities and Exchange Act of 1934, as amended, as soon as reasonably feasible after we electronically file such material with, or furnish it to, the SEC. Our websites and the information contained therein or linked thereto are not intended to be incorporated into this Annual Report on Form 10-K.\nInformation about our Executive Officers\nThe following list describes our executive officers, which are elected by and serve at the discretion of the Board of Directors. The title of each executive officer includes the words Customer Satisfaction which reflects our commitment to customer service.\nWilliam C. Rhodes, III, 57-Chairman, President and Chief Executive Officer, Customer Satisfaction\nWilliam C. Rhodes, III, was named Chairman of AutoZone during fiscal 2007 and has been President, Chief Executive Officer and a director since March 2005. Prior to his appointment as President and Chief Executive Officer, he served in various capacities within the Company since 1994. Prior to 1994, he was a manager with Ernst & Young LLP. Mr. Rhodes is a member of the Board of Directors for Dollar General Corporation.\nJamere Jackson, 53-Executive Vice President, Chief Financial Officer and Store Development, Customer Satisfaction\nJamere Jackson joined AutoZone on September 13, 2020 as Executive Vice President and Chief Financial Officer. Prior to joining AutoZone, from 2018 to 2020, he served as Executive Vice President and Chief Financial Officer of Hertz Global Holdings, Inc., a worldwide rental company. From 2014 to 2018, he served as Chief Financial Officer of Nielsen Holdings plc, an information, data and measurement company. Prior to 2014, he held a variety of leadership roles at General Electric Company. Mr. Jackson serves on the Board of Directors for Eli Lilly & Co.\nPhilip B. Daniele, 53-Executive Vice President-Merchandising, Supply Chain and Marketing, Customer Satisfaction\nPhilip B. Daniele was named Executive Vice President - Merchandising, Supply Chain and Marketing in June 2021. Previously, he served as Senior Vice President - Commercial from 2015 to 2021, Vice President - Commercial Support from 2013 to 2015 and Vice President - Merchandising from 2008 to 2013. He was also a Divisional Vice President - Store Operations from 2005 to 2008. Prior to 2005, Mr. Daniele held several other key management positions with the Company.\nPreston B. Frazer, 46-Executive Vice President - Store Operations, Commercial and Loss Prevention, Customer Satisfaction\nPreston B. Frazer was named Executive Vice President - Store Operations, Commercial and Loss Prevention in June 2021. From 2019 to 2021, he was Senior Vice President - Store Operations. Prior to that, he was Vice President - Store Operations Support. He began his career with AutoZone in 2006 in Finance and has held several key functional roles of increasing responsibility. Prior to joining AutoZone, Mr. Frazer was a senior manager with the accounting firm of KPMG, LLP.\nThomas B. Newbern, 60-Executive Vice President - International, Information Technology and ALLDATA, Customer Satisfaction\nThomas B. Newbern was named Executive Vice President - International, Information Technology and ALLDATA in June 2021. From 2015 to 2021, he was Executive Vice President - Store Operations, Commercial, Loss Prevention and ALLDATA. From 2013 to 2015, he was Senior Vice President - Store Operations and Loss Prevention. From 2012 to 2013, he was Senior Vice President - Store Operations and Store Development. From 2007 to 2012, he was Senior Vice President - Store Operations, and from 1998 to 2007, he was Divisional Vice President -Store Operations. Prior to 1998, Mr. Newbern held several other key management positions with the Company.\nK. Michelle Borninkhof, 48-Senior Vice President and Chief Information Officer, Customer Satisfaction\nK. Michelle Borninkhof was named Senior Vice President and Chief Information Officer during April 2021. Prior to that, she was Chief Information Officer and Vice President for U.S. Technology at McDonalds since 2018. Prior to joining McDonalds, she spent 11 years with Walmart Stores holding various leadership roles including Vice President - International Technology Delivery. Throughout her career, Ms. Borninkhof held various roles in store retail, distribution center operations and process improvement.\nEric S. Gould, 53-Senior Vice President - Supply Chain, Customer Satisfaction\nEric S. Gould was named Senior Vice President, Supply Chain in February 2021. From 2017 to 2021, he served as Vice President, Supply Chain Replenishment and from 2013 to 2017 he served as Vice President - Commercial Sales. He was also Vice President - Replenishment from 2003 to 2013. Prior to 2003, Mr. Gould held several other key management positions within the Company.\nDomingo J. Hurtado, 61-Senior Vice President - International, Customer Satisfaction\nDomingo J. Hurtado Rodríguez was named Senior Vice President - International in September 2018. Prior to that, he was President - AutoZone de México. He has served in various capacities within the Company since 2001, which included leading the Companys expansion into Mexico. Prior to 2001, Mr. Hurtado held different positions with RadioShack including Director General in Mexico and General Manager in Venezuela.\nDennis W. LeRiche, 54-Senior Vice President - Store Operations, Customer Satisfaction\nDennis W. LeRiche was named Senior Vice President - Store Operations in June 2021. From 2015 to 2021, he was a Divisional Vice President - Store Operations. Prior to 2015, Mr. LeRiche held several other key management positions with the Company.\nGrant E. McGee, 60-Senior Vice President - Commercial, Customer Satisfaction\nGrant E. McGee was named Senior Vice President - Commercial in June 2021. From 2007 to 2021, he was a Divisional Vice President - Store Operations. From 2004 to 2007, he was Vice President - Commercial. Prior to 2004, Mr. McGee held several other key positions with the Company.\nCharlie Pleas, III, 57- Senior Vice President - Accounting and Finance, Customer Satisfaction\nCharlie Pleas, III, became Senior Vice President, Finance and Accounting in December, 2021. He was named Senior Vice President and Controller during 2007. Prior to that, he was Vice President and Controller since 2003. Previously, he was Vice President - Accounting since 2000, and Director of General Accounting since 1996. Prior to joining AutoZone, he was a Division Controller with Fleming Companies, Inc. where he served in various capacities during his tenure from 1988 to 1996. Prior to 1988, he worked with Ernst & Young. Mr. Pleas is a member of the Board of Directors for Kirklands Inc.\nAlbert Saltiel, 58-Senior Vice President - Marketing and E-Commerce, Customer Satisfaction\nAlbert Saltiel was named Senior Vice President - Marketing and E-Commerce during October 2014. Previously, he was Senior Vice President - Marketing since 2013. Prior to that, he was Chief Marketing Officer and a key member of the leadership team at Navistar International Corporation. Mr. Saltiel has also been with Sony Electronics as General Manager, Marketing, and Ford Motor Company where he held multiple marketing roles.\nRichard C. Smith, 58-Senior Vice President - Human Resources, Customer Satisfaction\nRichard C. Smith was named Senior Vice President - Human Resources in December 2015. Mr. Smith has been an AutoZoner since 1985, previously holding the position of Divisional Vice President - Store Operations since 1997. Prior thereto, Mr. Smith served in various capacities within the Company.\nKristen C. Wright, 46-Senior Vice President - General Counsel & Secretary, Customer Satisfaction\nKristen C. Wright was named Senior Vice President - General Counsel & Secretary effective January 2014. She previously held the title of Vice President - Assistant General Counsel & Assistant Secretary since January 2012. Before joining AutoZone, Ms. Wright was a partner with the law firm of Bass, Berry & Sims PLC.\nWilliam R. Hackney, 57-Senior Vice President - Merchandising, Customer Satisfaction\nWilliam R. Hackney was named Senior Vice President, Merchandising in October 2022. He had previously served in this role from October 2015 until his retirement on December 31, 2020. His career with AutoZone began in 1983, and he has held several key management roles within the Company, including Vice President - Store Operations Support and Vice President - Merchandising, before returning to AutoZone. Item 1A. Risk Factors\nOur business is subject to a variety of risks and uncertainties. The risks and uncertainties described below could materially and adversely affect our business, financial condition, operating results, cash flows and stock price. The following information should be read in conjunction with the other information contained in this report and other filings that we make with the SEC. These risks and uncertainties are not the only ones we face. Our business could also be affected by additional factors that are presently unknown to us or that we currently believe to be immaterial to our business.\nStrategic and Operational Risks\nIf demand for our products slows, then our business may be materially adversely affected.\nDemand for the products we sell may be affected by a number of factors we cannot control, including:\n● the number of older vehicles in service. Vehicles seven years old or older are generally no longer under the original vehicle manufacturers warranties and tend to need more maintenance and repair than newer vehicles.\n● rising fuel and energy prices. Increases in fuel and energy prices may cause our customers to defer purchases of certain of our products as they use a higher percentage of their income to pay for gasoline and other energy costs and may drive their vehicles less, resulting in less wear and tear and lower demand for repairs and maintenance.\n● the economy. In periods of declining economic conditions, including as a result of inflation, consumers may reduce their discretionary spending by deferring vehicle maintenance or repair. Additionally, such conditions may affect our customers ability to obtain credit. During periods of expansionary economic conditions, more of our DIY customers may pay others to repair and maintain their vehicles instead of working on their own vehicles, or they may purchase new vehicles.\n● the weather. Milder weather conditions may lower the failure rates of automotive parts, while extended periods of rain and winter precipitation may cause our customers to defer maintenance and repair on their vehicles. Extremely hot or cold conditions may enhance demand for our products due to increased failure rates of our customers automotive parts. Additionally, climate changes can create more variability in the short-term or lead to other weather conditions that could impact our business.\n● technological advances. Advances in automotive technology, such as improved parts design can result in cars needing maintenance less frequently and parts lasting longer.\n● the number of miles vehicles are driven annually. Higher vehicle mileage increases the need for maintenance and repair. Mileage levels may be affected by gas prices, ride sharing, weather conditions, and other factors.\n● prevalence of electric vehicles. Increased prevalence of electric vehicles, whether due to changes in consumer preferences or regulatory action banning the sale of new internal combustion vehicles, can result in less frequent parts failures and reduced need for parts.\n● the quality of the vehicles manufactured by the original vehicle manufacturers and the length of the warranties or maintenance offered on new vehicles.\n● restrictions on access to telematics and diagnostic tools and repair information imposed by the original vehicle manufacturers or by governmental regulation. These restrictions may cause vehicle owners to rely on dealers to perform maintenance and repairs.\nThese factors could result in a decline in the demand for our products, which could adversely affect our business and overall financial condition.\nIf we are unable to compete successfully against other businesses that sell the products that we sell, we could lose customers and our sales and profits may decline.\nThe sale of automotive parts, accessories and maintenance items is highly competitive. See Item 1. Business above for additional information regarding our competitive environment.\nAlthough we believe we compete effectively, our competitors may have greater financial and marketing resources allowing them to sell merchandise at lower prices, larger stores with more merchandise, longer operating histories with deeper customer relationships, more frequent customer visits and more effective advertising. Online and multi-channel retailers often have lower operating costs and focus on delivery services, thereby offering customers faster, guaranteed delivery times and low-price or free shipping. In addition, because our business strategy is based on offering superior levels of customer service to complement the products we offer, our cost structure is higher than some of our competitors, which also puts pressure on our margins.\nConsumers are embracing shopping online, including through mobile applications. With the increasing use of digital tools and social media, and our competitors increased focus on optimizing customers online experience, our customers are quickly able to compare prices, product assortment, product availability and feedback from other customers before purchasing products.\nIf we are unable to continue to manage in-stock inventory and costs, provide competitive delivery options, develop successful competitive strategies, including the maintenance of effective promotions, advertising and loyalty programs, develop and execute effective digital and omni-channel strategies or otherwise compete effectively, or if our competitors develop more effective strategies, we could lose customers and our sales and profits may decline.\nWe may not be able to sustain our historic rate of sales growth.\nWe have increased our store count in the past five fiscal years, growing from 6,029 stores at August 26, 2017, to 6,943 stores at August 27, 2022, a compounded annual growth rate of three percent. Additionally, we have increased annual revenues in the past five fiscal years from $10.9 billion in fiscal 2017 to $16.3 billion in fiscal 2022, with a compounded annual growth rate of eight percent. Annual revenue growth is driven by increases in same store sales, the opening of new stores and the development of new commercial programs. See Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations for further discussion of same store sales.\nWe open new stores only after evaluating customer buying trends and market demand/needs, all of which could be adversely affected by persistent unemployment, wage cuts, small business failures and microeconomic conditions unique to the automotive industry. Same store sales are impacted both by customer demand levels and by the prices we are able to charge for our products, which can also be negatively impacted by economic pressures.\nIf we cannot profitably increase our market share in the commercial auto parts business, our sales growth may be limited.\nAlthough we are a leading distributor of automotive parts and other products in the commercial market, we must effectively compete against national and regional auto parts chains, independently owned parts stores, wholesalers, jobbers and online retailers in order to increase our commercial market share. Although we believe we compete effectively in the commercial market on the basis of customer service, merchandise quality, selection and availability, price, product warranty, distribution locations and the strength of our AutoZone brand name, trademarks and service marks, some automotive aftermarket participants have been in business for substantially longer periods of time than we have, and as a result have developed long-term customer relationships and have large available inventories. If we are unable to profitably develop new commercial customers, our sales growth may be limited.\nOur business depends upon hiring, training and retaining qualified employees.\nWe believe much of our brand value lies in the quality of the approximately 112,000 AutoZoners employed in our stores, distribution centers, store support centers and ALLDATA. Our workforce costs represent our largest operating expense, and our ability to meet our labor needs while controlling labor costs is subject to numerous external factors, including market pressures with respect to prevailing wage rates and unemployment levels. Our business is also subject to employment laws and regulations, including those related to minimum wage, benefits and scheduling requirements. In addition, the implementation of potential regulatory changes relating to overtime exemptions and benefits for certain employees under federal and state laws could result in increased labor costs to our business and negatively impact our operating results.\nWe compete with other retail businesses for many of our associates in hourly positions, and these positions have historically had high turnover rates, which can lead to increased training and retention costs, particularly in a competitive labor market. We cannot be assured that we can continue to hire, train and retain qualified employees at current wage rates since we operate in a competitive labor market, and there are currently significant inflationary and other pressures on wages.\nIn the U.S., there has been an increase in workers exercising their right to form or join a union, both generally and in the retail industry. Although none of our employees are currently covered by collective bargaining agreements, there can be no assurance that our employees will not elect to be represented by labor unions in the future. If a significant portion of our work force were to become unionized, our culture and operating model could be challenged by inserting a third party between our current terrific relationships between our leaders and hourly AutoZoners. Further, our labor costs could increase and our business could be negatively affected by other requirements and expectations that could change our company culture, decrease our flexibility and disrupt our business. Further, our responses to any union organizing efforts could negatively impact how our brand is perceived by customers and AutoZoners and have adverse effects on our business and financial results.\nIf we are unable to hire, properly train and retain qualified AutoZoners, we could experience higher employment costs, reduced sales, losses of customers and diminution of our brand or company culture, which could adversely affect our earnings. If we do not maintain competitive wages or benefit packages, our customer service could suffer due to a declining quality of our workforce or, alternatively, our earnings could decrease if we increase our wage rates. A violation or change in employment and labor laws (including changes in existing employment benefit programs such as health insurance) could have a material adverse effect on our results of operations, financial condition and cash flows.\nInability to acquire and provide quality merchandise at competitive prices could adversely affect our sales and results of operations.\nWe are dependent upon our domestic and international vendors continuing to supply us with quality merchandise at competitive prices and payment terms. If our merchandise offerings do not meet our customers expectations, or our customers have a negative perception of our merchandise regarding quality, innovation and safety, we could experience lost sales, increased costs and exposure to legal and reputational risk. In those circumstances, it may be difficult and costly for us to rebuild our reputation and regain the confidence of our customers. All of our vendors must comply with applicable product safety laws, and we are dependent on them to ensure that the products we buy comply with all safety and quality standards. Events that give rise to actual, potential or perceived product safety concerns could expose us to government enforcement action or private litigation, result in costly product recalls and other liabilities and lead to reputational harm and loss of customer confidence. To the extent our suppliers are subject to added government regulation of their product design and/or manufacturing processes, the cost of the merchandise we purchase may rise.\nFurthermore, our vendors are impacted by global economic conditions which in turn impact our ability to source merchandise at competitive prices. For example, inflation, rising interest rates and disruption to the global supply chain have negatively impacted costs and inventory availability and may continue to have a negative impact on future results and profitability. Credit market and other macroeconomic conditions could also have a material adverse effect on the ability of our global and domestic suppliers to finance and operate their businesses.\nIf we experience transitions with any of our significant vendors, or if they experience financial difficulties or otherwise are unable to deliver merchandise to us on a timely basis, or at all, we could have product shortages in our stores that could adversely affect customers perceptions of us and cause us to lose customers and sales.\nDisruptions in our supply chain and other factors affecting the distribution of our merchandise could adversely impact our business.\nA disruption to our supply chain and distribution network could adversely affect our ability to receive and distribute inventory in a timely manner, which could result in low inventory availability, lost sales, increased supply chain costs and loss of customer loyalty, among other things. Such disruptions may result from damage or destruction of our distribution centers or may be the result of macroeconomic conditions impacting the broader supply chain industry at large. For example, in recent years, ports, rails and domestic long-hauls in the U.S. and elsewhere have been negatively impacted by capacity constraints, congestion and delays, periodic labor disputes, security issues, weather-related events, and natural disasters, which have been further exacerbated by the COVID-19 pandemic and other factors beyond our control. Our business and competitive position may be negatively impacted if we are unable to successfully mitigate the impacts of such disruption to our supply chain or if we are unable to manage such disruptions more effectively than our competitors.\nRisks associated with products sourced outside the U.S.\nWe directly imported approximately 15% of our purchases in fiscal 2022, but many of our domestic vendors directly import their products or components of their products. Changes to the price or flow of these goods for any reason, such as civil unrest or acts of war, currency fluctuations, disruptions in maritime lanes, port labor disputes , economic conditions and instability in the countries in which foreign suppliers are located, the financial instability of suppliers, suppliers failure to meet our standards, issues with labor practices of our suppliers or labor problems they may experience (such as strikes, stoppages or slowdowns, which could also increase labor costs during and following the disruption), the availability and cost of raw materials to suppliers, increased import duties or tariffs, merchandise quality or safety issues, shipping and transport availability and cost, increases in wage rates and taxes, transport security, inflation and other factors relating to the suppliers and the countries in which they are located or from which they import, often are beyond our control and could adversely affect our operations and profitability. In addition, the foreign trade policies, tariffs and other impositions on imported goods, trade sanctions imposed on certain countries, import limitations on certain types of goods or of goods containing certain materials from other countries and other factors relating to foreign trade and port labor agreements are beyond our control. These and other factors affecting our suppliers and our access to products could adversely affect our business and financial performance. As we or our domestic vendors increase our imports of merchandise from foreign vendors, the risks associated with these imports will also increase.\nOur ability to grow depends in part on new store openings, existing store remodels and expansions and effective utilization of our existing supply chain and hub network.\nOur continued growth and success will depend in part on our ability to open and operate new stores and expand and remodel existing stores to meet customers needs on a timely and profitable basis. Accomplishing our new and existing store expansion goals will depend upon a number of factors, including the ability to partner with developers and landlords to obtain suitable sites for new and expanded stores at acceptable costs, the hiring and training of qualified personnel and the integration of new stores into existing operations. There can be no assurance we will be able to achieve our store expansion goals, manage our growth effectively, successfully integrate the planned new stores into our operations or operate our new, remodeled and expanded stores profitably.\nIn addition, we extensively utilize our hub network, our supply chain and our logistics management techniques to efficiently stock our stores. We have made, and plan to continue to make, significant investments in our supply chain to improve product availability and product assortment, fulfill evolving consumer product demands and keep up with our long-term store expansion goals. If we fail to effectively utilize our existing hubs and/or supply chains, or if our investments in our supply chain initiatives, including directly sourcing some products from outside the U.S., do not provide the anticipated benefits, we could experience sub-optimal inventory levels in our stores or increases in our operating costs, which could adversely affect our sales volume and/or our margins.\nOur success in international operations is dependent on our ability to manage the unique challenges presented by international markets.\nThe various risks we face in our U.S. operations generally also exist when conducting operations in and sourcing products and materials from outside of the U.S., in addition to the unique costs, risks and difficulties of managing international operations. Our expansion into international markets may be adversely affected by local laws and customs, U.S. laws applicable to foreign operations, and political and socio-economic conditions.\nRisks inherent in international operations also include potential adverse tax consequences, potential changes to trade policies and trade agreements, compliance with the Foreign Corrupt Practices Act and local anti-bribery and anti-corruption laws, greater difficulty in enforcing intellectual property rights, challenges to identify and gain access to local suppliers, and possibly misjudging the response of consumers in foreign countries to our product assortment and marketing strategy.\nIn addition, our operations in international markets are conducted primarily in the local currency of those countries. Since our Consolidated Financial Statements are denominated in U.S. dollars, amounts of assets, liabilities, net sales, and other revenues and expenses denominated in local currencies must be translated into U.S. dollars using exchange rates for the current period. As a result, foreign currency exchange rates and fluctuations in those rates may adversely impact our financial performance.\nBusiness interruptions may negatively impact our operating hours, operability of our computer and other systems, availability of merchandise and otherwise have a material negative effect on our sales and our business.\nBusiness interruptions including war or acts of terrorism, political or civil unrest, unusual or severe weather conditions (including due to the impacts of climate change or otherwise) such as hurricanes, tornadoes, windstorms, fires, earthquakes and floods, public health crises and other disasters or the threat of any of them, may negatively impact the hours and operations of our stores, distribution centers, store support centers or sourcing offices; may negatively impact our supply chain and distribution network; and may impede our ability to source quality merchandise domestically and outside of the U.S. on favorable terms.\nIn the event commercial transportation is curtailed or substantially delayed, we may have difficulty transporting merchandise to our distribution centers and stores resulting in lost sales and/or a potential loss of customer loyalty. Transportation issues could also cause us to cancel purchase orders if we are unable to receive merchandise in our distribution centers. It is not possible to predict all events or circumstances which may negatively disrupt our business in a significant manner, and the near-term and long-term impacts of such disruptions on our business, demand for our products and our growth initiatives will vary significantly based on the facts and circumstances of each such disruption. Furthermore, such business interruptions could cause additional negative impacts of which we are not currently aware or magnify other risks associated with our business and operations.\nOur failure to protect our reputation could have a material adverse effect on our brand name and profitability.\nWe believe our continued strong sales growth is driven in significant part by our AutoZone and private label brand names. The value in our brand names and their continued effectiveness in driving our sales growth is dependent to a significant degree on our ability to maintain our reputation for safety, high product quality, friendliness, WOW! Customer service, trustworthy advice, integrity and business ethics. Any negative publicity about these or other areas involving our business, including our response or lack thereof to external events involving civil unrest, social justice, and political issues, whether or not based in fact, could damage our reputation and may result in reduced demand for our merchandise. The increasing use of technology also poses a risk as customers are able to quickly compare products and prices and use social media to provide feedback in a manner that is rapidly and broadly disseminated. Our brand and reputation could be negatively impacted if negative sentiment about the Company, whether or not based on fact, is shared over social media.\nFailure to comply with ethical, social, product, labor, environmental and anti-corruption standards could also jeopardize our reputation and potentially lead to various adverse actions by consumer or environmental groups, employees or regulatory bodies. Damage to our reputation or loss of consumer confidence for any of these or other reasons could have a material adverse effect on our results of operations and financial condition, as well as require additional resources to rebuild our reputation.\nInformation Technology, Cybersecurity and Data Privacy Risks\n‌We rely heavily on information technology systems for our key business processes. Any damage to, failure of, or interruption in these systems could have a material adverse impact on our business and operating results.\nWe rely extensively on information technology systems, some of which are managed or provided by third-party service providers, to collect, analyze, process, store, manage, transmit and protect key business processes, transactions and data, such as sales data, customer data, employee data, demand forecasting, merchandise ordering, inventory replenishment, supply chain management, payment processing, order fulfillment and more. Delays in the maintenance, updates, upgrading, or patching of these systems, applications or processes could adversely impact their effectiveness or could expose us to security and other risks. Our systems and the third-party systems with which we interact are subject to damage, failure or interruption due to various reasons such as: power or other critical infrastructure outages, facility damage, physical theft, telecommunications failures, malware, security incidents, malicious cyber-attacks, including the use of malicious codes, worms, phishing, spyware, denial of service attacks and ransomware, natural disasters and catastrophic events, inadequate or ineffective redundancy measures; and design or usage errors by AutoZoners, contractors or third-party service providers. Although we seek to effectively maintain and safeguard our systems and our data and we seek to ensure our third-party service providers effectively maintain and safeguard their systems and our data, such efforts are not always successful. As a result, we or our service providers could experience, and on occasion have experienced, one or more errors, interruptions, delays or cessations of service impacting the integrity or availability of our information technology infrastructure. While such incidents have not been material to date, any future incident could significantly disrupt our operations and key business processes, result in the impairment or loss of critical data, be costly and resource-intensive to remedy; harm our reputation and relationship with customers, AutoZoners, vendors and other stakeholders; and have a material adverse impact on our business and operating results.\nIn addition, our information technology systems, infrastructure and personnel require substantial investments, such as replacing existing systems, some of which are older, legacy systems that are less flexible and efficient, with successor systems; making changes to existing systems, including the migration of applications to the cloud; maintaining or enhancing legacy systems that are not currently being replaced; or designing or cost-effectively acquiring new systems with new functionality. These efforts can result in significant potential risks, including failure of the systems to operate as designed, potential loss or corruption of data, cost overruns, or implementation delays or errors, and may result in operational challenges, security control failures, reputational harm, and increased costs that could adversely affect our business operations and results of operations.\nFailure to maintain the security of sensitive personal information or other confidential information in our possession could subject us to litigation or regulatory enforcement action, cause reputational harm and cause us to incur substantial costs or have a material adverse impact on our business and financial condition.\nOur business, like that of most retailers, involves the collection, processing, storage and transmission of personal information relating to our customers, suppliers and AutoZoners and confidential business information relating to AutoZone or other parties with which we do business. This information is handled by us as well as third-party service providers and vendors that provide us with various technology, systems, services and other resources that we use in connection with the handling of this information and in furtherance of our business objectives. Furthermore, we accept payments using a variety of methods, including credit, debit, electronic payments and gift cards, which present information security risks, and we may offer new payment options in the future presenting new risks of which we are currently unaware.\nWhile addressing vulnerabilities is a priority for us, the methods used to obtain unauthorized access are constantly evolving, increasing in frequency and sophistication, and may be difficult to anticipate or detect for long periods of time. There can be no assurance that the security measures we or our third-party service providers and vendors have in place today or introduce in the future in an effort to keep up with growing and evolving risks will prevent or mitigate the impact of a cyber incident or provide us with sufficient visibility to determine if a cyber incident has occurred. Failure to maintain the security of the personal and other confidential information to which we have access could lead to private litigation, regulatory enforcement actions and reputational harm, all of which would require extensive time and financial resources to resolve and could have a material adverse impact our business and financial condition.\nWhile we have not experienced a material breach of our information systems or data to date, unauthorized parties have in the past attempted, and will continue to attempt, to gain access to, or disrupt the effectiveness of, these systems and data as the result of a cyber-attack, employee misconduct, employee error, system compromises, fraud, hacking, phishing attempts, malware, ransomware, other malicious codes or other intentional or unintentional acts. Furthermore, hardware, software or other IT applications that we or a third party develop for our use may contain exploitable vulnerabilities, bugs or design defects or may involve other problems that could unexpectedly compromise information security. For example, in connection with the COVID-19 pandemic, public reports indicated there was a spike in cybersecurity attacks as shelter-in-place orders and work-from-home measures led businesses to increase reliance on virtual environments and communications systems, which had been the subject of increasing third-party vulnerabilities and security risks.\nThe cost to remediate and respond to a cyber incident involving unauthorized use, access, damage or loss of systems, data or other information could be significant. To the extent any cyber-attack or intrusion in our or one of our third-party service providers information systems results in the unauthorized access, loss, damage or misappropriation of information, we may be required under federal and state privacy laws to notify impacted individuals and face substantial liability due to claims arising from customers, financial institutions, regulatory authorities, payment card issuers and others. We maintain insurance coverage that may protect us from losses or claims in connection with certain incidents; however, our insurance coverage may not be sufficient to cover significant losses in any particular situation.\nWe are subject to a complex and evolving body of laws and regulations regarding data privacy and may face increased costs as a result of changes in, enforcement of, or the adoption of new laws and regulations. These costs may have a material adverse impact on our business and results of operations.\nThe regulatory environment related to information security, data collection, processing and use, and data privacy is becoming increasingly rigorous and complex. Multiple states in the U.S. have passed data protection laws designed to provide new rights to consumers and, in some cases, employees. The potential effects of the various laws regulating the collection, processing, transfer and use of personal or protected information are far-reaching and may require significant time, resources and costs to comply, may require changes to our existing practices and processes that are not advantageous to our business, and otherwise limit our ability to use data to provide a more personalized customer experience or as otherwise desired. In addition, failure to comply with applicable requirements by us or our business partners or third-party service providers or vendors could subject us to fines, sanctions, governmental investigations, lawsuits or reputational damage.\nAdditionally, while we seek to comply with these various laws as they take effect, many of the concepts are novel and rulemaking is not finalized. Given the short amount of time between finalized rulemaking and the dates these laws become effective and enforceable, there can be no assurance that compliance efforts taken by us in good faith will be sufficient, and we may be the subject of an investigation or enforcement action instituted by a state agency or other regulatory body.\nIndebtedness, Financial and Market Risks\nWe are self-insured for certain costs associated with our operations and an increase in our insurance claims and expenses may have a material negative impact on us.\nWe are self-insured up to certain limits for workers compensation, employee group medical, general liability, product liability, property and automobile. The types and amounts of insurance may vary from time to time based on our decisions with respect to risk retention and regulatory requirements. Our reserves are established using historical trends and, where appropriate, using a third-party actuary to estimate costs to settle reported claims and claims incurred but not yet reported. Estimated costs are subject to a variety of assumptions and other factors including the severity, duration and frequency of claims, legal costs associated with claims, healthcare trends and projected inflation of related factors. Material increases in the number of insurance claims, changes to healthcare costs, accident frequency and severity, legal expenses and other factors could result in unfavorable difference between actual self-insurance costs and our reserve estimates. As a result, our self-insurance costs could increase which may adversely affect our business, results of operations, financial condition and cash flows.\nA downgrade in our credit ratings or a general disruption in the credit markets could make it more difficult for us to access funds, refinance our debt, obtain new funding or issue debt securities.\nOur short-term and long-term debt is rated investment grade by the major rating agencies. These investment-grade credit ratings have historically allowed us to take advantage of lower interest rates and other favorable terms on our short-term credit lines, in our senior debt offerings and in the commercial paper markets. To maintain our investment-grade ratings, we are required to meet certain financial performance ratios. A change by the rating agencies in these ratios, an increase in our debt, and/or a decline in our earnings could result in downgrades in our credit ratings. A downgrade in our credit ratings could limit our access to public debt markets, limit the institutions willing to provide credit facilities to us, result in more restrictive financial and other covenants in our public and private debt and would likely significantly increase our overall borrowing costs and adversely affect our earnings.\nMoreover, significant deterioration in the financial condition of large financial institutions during the Great Recession resulted in a severe loss of liquidity and availability of credit in global credit markets and in more stringent borrowing terms. We can provide no assurance that such similar events that occurred during the Great Recession will not occur again in the foreseeable future. Conditions and events in the global credit markets could have a material adverse effect on our access to short-term and long-term debt and the terms and cost of that debt.\nLegal and Regulatory Risks\nOur business, results of operations, financial condition and cash flows may be adversely affected by the adoption of new laws, changes to existing laws, increased enforcement activity or other governmental actions.\nWe are subject to numerous federal, state and local laws and regulations, many of which are complex, frequently revised and subject to varying interpretations. These include laws governing employment and labor, wage and hour, environmental matters, proper handling and disposal of hazardous materials and waste, healthcare, data privacy, cybersecurity, the pricing and sale of goods, import and export compliance, transportation and logistics, consumer protection and advertising, among others. These laws may differ substantially in the areas where we operate. Although we have implemented policies and procedures to help ensure compliance with these laws, there can be no certainty that our employees and third parties with whom we do business will not take actions in violation of our policies or applicable laws. If we fail to comply with these laws, rules and regulations, or the manner in which they are interpreted or applied, we may be subject to governmental enforcement action or private litigation resulting in monetary penalties, reputational harm and increased costs of regulatory compliance. Any changes in regulations, the imposition of additional regulations, or the enactment of any new legislation, including tax legislation such as the Inflation Reduction Act of 2022, could have an adverse impact, directly or indirectly, on our financial condition and results of operations. We may also be subject to investigations or audits by governmental authorities and regulatory agencies as a result of enforcing existing laws and regulations or changes in enforcement priorities, which can occur in the ordinary course of business or may result from increased scrutiny from a particular agency or toward a particular industry.\nWe may be adversely affected by legal, regulatory or market responses to global climate change.\nClimate change resulting from increased concentrations of carbon dioxide and other greenhouse gases in the atmosphere could present risks to our operations. For example, we have significant operations in California, where serious drought has made water less available and more costly and has increased the risk of wildfires. Changes in climate patterns leading to extreme heat waves or unusual cold weather at some of our locations can lead to increased energy usage and costs, or otherwise adversely impact our facilities and operations and disrupt our supply chains and distribution systems. Growing concern over climate change has led policy makers in the U.S. to consider the enactment of legislative and regulatory proposals that would impose mandatory requirements on greenhouse gas emissions. Such laws, if enacted, are likely to impact our business in a number of ways. For example, significant increases in fuel economy requirements, new federal or state restrictions on emissions of carbon dioxide or new federal or state incentive programs that may be imposed on vehicles and automobile fuels could adversely affect demand for vehicles, annual miles driven or the products we sell. We may not be able to accurately predict, prepare for and respond to new kinds of technological innovations with respect to electric vehicles and other technologies that minimize emissions. Compliance with any new or more stringent laws or regulations, or stricter interpretations of existing laws, could require additional expenditures by us or our suppliers. Our inability to appropriately respond to such changes could adversely impact our business, financial condition, results of operations or cash flows.\nOur reputation may be adversely affected if we are not able to achieve our Environmental, Social, and Governance (ESG) goals.\nIncreasing governmental and societal attention to ESG matters, including expanding mandatory and voluntary reporting, and disclosure topics such as climate change, sustainability (including with respect to our supply chain), natural resources, waste reduction, energy, human capital, and risk oversight could expand the nature, scope, and complexity of matters that we are required to control, assess, and report. We strive to deliver shared value through our business and our diverse stakeholders expect us to make progress in certain ESG priority issue areas. A failure or perceived failure to meet these expectations could adversely affect public perception of our business, employee morale or customer or shareholder support.\nOur business, financial condition, results of operations and cash flows may be affected by litigation.\nWe are involved in lawsuits, regulatory investigations, governmental and other legal proceedings arising out of the ordinary course of business. Such matters involve significant expense and divert managements attention and resources from other matters. The damages sought against us in these proceedings may be material and may adversely affect our business, results of operations, financial condition and cash flows.\nGeneral Risks\nSignificant changes in macroeconomic and geo-political factors could adversely affect our financial condition and results of operations.\nMacroeconomic conditions impact both our customers and our suppliers. Moreover, the U.S. government continues to operate under historically large deficits and debt burden. Continued distress in global credit markets, business failures, civil unrest, inflation, rising interest rates, foreign exchange rate fluctuations, significant geo-political conflicts, proposed or additional tariffs, continued volatility in energy prices, the impact of a public health crisis or pandemic (such as COVID-19), constraints on the global supply chain and other factors continue to affect the global economy. Moreover, rising energy prices could impact our merchandise distribution, commercial delivery, utility and product costs. It is unclear how such factors could impact our business in the short term. Over a longer period of time, these macroeconomic and geo-political conditions could adversely affect our sales growth, margins and overhead. These could adversely affect our financial condition and operations. Item 1B. Unresolved Staff CommentsError! Bookmark not defined. Item 2. PropertiesError! Bookmark not defined. Item 3. Legal ProceedingsError! Bookmark not defined. Item 4. Mine Safety DisclosuresError! Bookmark not defined.\nPART II‌24 Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities‌24\nStock Performance Graph‌25 Item 6. ReservedError! Bookmark not defined. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations‌Error! Bookmark not defined.\nExecutive SummaryError! Bookmark not defined.\nFor fiscal 2022, we achieved record net income of $2.4 billion, an 11.9% increase over the prior year, and sales growth of $1.6 billion, an 11.1% increase over the prior year. Domestic commercial sales increased 26.5%, which represents 28.8% of our domestic auto parts sales. Both our retail sales and commercial sales grew this past year as we made progress on our initiatives aimed at improving our ability to say Yes to our customers more frequently and accelerating our commercial growth.Error! Bookmark not defined.\nOur business is impacted by various factors within the economy that affect both our consumer and our industry, including but not limited to inflation, fuel costs, wage rates, supply chain disruptions, hiring and other economic conditions. Given the nature of these macroeconomic factors, we cannot predict whether or for how long certain trends will continue, nor can we predict to what degree these trends will impact us in the future.‌Error! Bookmark not defined.\nMiles DrivenError! Bookmark not defined.\nSeven Year Old or Older VehiclesError! Bookmark not defined.\nResults of OperationsError! Bookmark not defined.\nThe following table highlights selected financial information over the past 5 years:‌Error! Bookmark not defined.\nFiscal 2022 Compared with Fiscal 2021Error! Bookmark not defined.\nFiscal 2021 Compared with Fiscal 2020Error! Bookmark not defined.\nQuarterly PeriodsError! Bookmark not defined.\nLiquidity and Capital ResourcesError! Bookmark not defined.\nDebt FacilitiesError! Bookmark not defined.\nStock RepurchasesError! Bookmark not defined.\nFinancial CommitmentsError! Bookmark not defined.\nReconciliation of Non-GAAP Financial MeasuresError! Bookmark not defined.\nReconciliation of Non-GAAP Financial Measure: Cash Flow Before Share Repurchases and Changes in DebtError! Bookmark not defined.\nReconciliation of Non-GAAP Financial Measure: Adjusted Debt to EBITDAR‌Error! Bookmark not defined.\n(1)The fiscal year ended August 31, 2019 consisted of 53 weeks.Error! Bookmark not defined.\nRecent Accounting PronouncementsError! Bookmark not defined.\nCritical Accounting Policies and EstimatesError! Bookmark not defined.\nSelf-Insurance ReservesError! Bookmark not defined.\nIncome TaxesError! Bookmark not defined.\nVendor AllowancesError! Bookmark not defined. Item 7A. Quantitative and Qualitative Disclosures about Market RiskError! Bookmark not defined.\nInterest Rate RiskError! Bookmark not defined.\nForeign Currency RiskError! Bookmark not defined. Item 8. Financial Statements and Supplementary Data‌42\nManagements Report on Internal Control Over Financial ReportingError! Bookmark not defined.\nAutoZone, Inc. Consolidated Statements of IncomeError! Bookmark not defined.\nSee Notes to Consolidated Financial Statements.Error! Bookmark not defined.\nSee Notes to Consolidated Financial Statements.Error! Bookmark not defined.\nAutoZone, Inc. Consolidated Balance SheetsError! Bookmark not defined.\nSee Notes to Consolidated Financial Statements.Error! Bookmark not defined.\nAutoZone, Inc. Consolidated Statements of Cash FlowsError! Bookmark not defined.\nSee Notes to Consolidated Financial Statements.Error! Bookmark not defined.\nAutoZone, Inc. Consolidated Statements of Stockholders DeficitError! Bookmark not defined.\nSee Notes to Consolidated Financial Statements.Error! Bookmark not defined.\nNotes to Consolidated Financial StatementsError! Bookmark not defined.\nNote A - Significant Accounting PoliciesError! Bookmark not defined.\nCost of SalesError! Bookmark not defined.\nOperating, Selling, General and Administrative ExpensesError! Bookmark not defined.\nRecently Issued Accounting Pronouncements:Error! Bookmark not defined.\nNote B - Share-Based PaymentsError! Bookmark not defined.\nOverview of Share-Based Payment PlansError! Bookmark not defined.\nAmended and Restated AutoZone, Inc. 2011 Equity Incentive Award PlanError! Bookmark not defined.\nAutoZone, Inc. Director Compensation ProgramError! Bookmark not defined.\nStock OptionsError! Bookmark not defined.\nRestricted Stock UnitsError! Bookmark not defined.\nStock Appreciation RightsError! Bookmark not defined.\nEmployee Stock Purchase Plan and Executive Stock Purchase PlanError! Bookmark not defined.\nNote C - Accrued Expenses and OtherError! Bookmark not defined.\nNote D - Income TaxesError! Bookmark not defined.\nNote E - Fair Value MeasurementsError! Bookmark not defined.\nMarketable Debt Securities Measured at Fair Value on a Recurring BasisError! Bookmark not defined.\nNon-Financial Assets Measured at Fair Value on a Non-Recurring BasisError! Bookmark not defined.\nFinancial Instruments not Recognized at Fair ValueError! Bookmark not defined.\nNote F - Marketable Debt SecuritiesError! Bookmark not defined.\nNote G - Accumulated Other Comprehensive LossError! Bookmark not defined.\n(1)Foreign currency is shown net of U.S. tax to account for foreign currency impacts of certain undistributed non-U.S. subsidiaries earnings. Other foreign currency is not shown net of additional U.S. tax as other basis differences of non-U.S. subsidiaries are intended to be permanently reinvestedError! Bookmark not defined.\nNote H - Derivative Financial InstrumentsError! Bookmark not defined.\nNote J - Interest ExpenseError! Bookmark not defined.\nNote K - Stock Repurchase ProgramError! Bookmark not defined.\nNote L - 401(k) Savings PlanError! Bookmark not defined.\nNote M - LeasesError! Bookmark not defined.\nNote N - Commitments and ContingenciesError! Bookmark not defined.\nNote O - LitigationError! Bookmark not defined.\nNote P - Segment ReportingError! Bookmark not defined. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure‌Error! Bookmark not defined. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs of August 27, 2022, an evaluation was performed under the supervision and with the participation of AutoZones management, including the Chief Executive Officer and the Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, as amended. Based on that evaluation, our management, including the Chief Executive Officer and the Chief Financial Officer, concluded that our disclosure controls and procedures were effective as of August 27, 2022.\nInternal Control Over Financial Reporting\nA report of AutoZones management on our internal control over financial reporting (as such term defined in Rule 13a-15(f) under the Exchange Act) and a report of Ernst & Young, LLP, an independent registered public accounting firm, on the effectiveness of AutoZones internal control over financial reporting are included in Part I, Item 8 of this document and is incorporated herein by reference.\nChanges in Internal Control Over Financial Reportings\nThere were no changes in our internal control over financial reporting that occurred during the quarter ended August 27, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nAttestation Report of Registered Public Accounting Firm\nOur internal control over financial reporting as of August 27, 2022 has been audited by Ernst & Young, LLP, an independent registered public accounting firm, which also audited our Consolidated Financial Statements for the year ended August 27, 2022, as stated in their report included herein, which expresses an unqualified opinion on the effectiveness of our internal control over financial reporting as of August 27, 2022. Item 9B. Other Information\nNot applicable.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information set forth in Part I, Item 1 of this document in the section entitled Information about our Executive Officers, is incorporated herein by reference in response to this item. Additionally, the information contained in AutoZone, Inc.s Proxy Statement dated October 24, 2022, in the sections entitled Corporate Governance Matters, Proposal 1 - Election of Directors and Delinquent Section 16(a) Reports, is incorporated herein by reference in response to this item.\nThe Company has adopted a Code of Ethical Conduct for Financial Executives that applies to its chief executive officer, chief financial officer, chief accounting officer and other financial executives. The Company has made the Code of Ethical Conduct available at www.autozone.com, which can be accessed by clicking Investor Relations located at the bottom of the page. Item 11. Executive Compensation\nThe information contained in AutoZone, Inc.s Proxy Statement dated October 24, 2022, in the section entitled Executive Compensation, is incorporated herein by reference in response to this item. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information contained in AutoZone, Inc.s Proxy Statement dated October 24, 2022, in the sections entitled Security Ownership of Management and Board of Directors, Security Ownership of Certain Beneficial Owners and Equity Compensation Plans is incorporated herein by reference in response to this item. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information contained in AutoZone, Incs Proxy Statement dated October 24, 2022, in the sections entitled Related Party Transactions and Corporate Governance Matters - Independence is incorporated herein by reference in response to this item. Item 14. Principal Accounting Fees and Services\nThe information contained in AutoZone, Inc.s Proxy Statement dated October 24, 2022, in the section entitled Proposal 2 - Ratification of Independent Registered Public Accounting Firm, is incorporated herein by reference in response to this item.\nPART IV Item 15. Exhibits and Financial Statement Schedules\nThe following information required under this item is filed as part of this report.\n(a) Financial Statements\nThe following financial statements, related notes and reports of independent registered public accounting firm are filed with this Annual Report on Form 10-K in Part II, Item 8:\nReports of Independent Registered Public Accounting Firm\nConsolidated Statements of Income for the fiscal years ended August 27, 2022, August 28, 2021 and August 29, 2020\nConsolidated Statements of Comprehensive Income for the fiscal years ended August 27, 2022, August 28, 2021 and August 29, 2020\nConsolidated Balance Sheets as of August 27, 2022 and August 28, 2021\nConsolidated Statements of Cash Flows for the fiscal years ended August 27, 2022, August 28, 2021 and August 29, 2020\nConsolidated Statements of Stockholders Deficit for the fiscal years ended August 27, 2022, August 28, 2021 and August 29, 2020\nNotes to Consolidated Financial Statements\n(b)\nExhibits\nThe following exhibits are being filed herewith:\n3.1\nRestated Articles of Incorporation of AutoZone, Inc. Incorporated by reference to Exhibit 3.1 to the Quarterly Report on Form 10-Q for the quarter ended February 13, 1999.\n3.2\nSeventh Amended and Restated By-Laws of AutoZone, Inc. Incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K dated March 19, 2018.\n4.1\nIndenture dated as of August 8, 2003, between AutoZone, Inc. and Bank One Trust Company, N.A. Incorporated by reference to Exhibit 4.1 to the Registration Statement on Form S-3 (No. 333-107828) filed August 11, 2003.\n4.2\nAgreement of Resignation, Appointment and Acceptance by and among AutoZone, Inc., The Bank of New York Mellon Trust Company, N.A., as prior Trustee, and Regions Bank, as successor Trustee, dated January 29, 2019. Incorporated by reference to Exhibit 4.2 to the Registration Statement on Form S-3 (No. 333-230719), filed April 4, 2019).\n4.3\nOfficers Certificate dated November 13, 2012, pursuant to Section 3.2 of the indenture dated August 8, 2003, setting forth the terms of the 2.875% Senior Notes due 2023. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated November 13, 2012.\n4.4\nForm of 2.875% Senior Notes due 2023. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated November 13, 2012.\n4.5\nOfficers Certificate dated April 29, 2013, pursuant to Section 3.2 of the indenture dated August 8, 2003, setting forth the terms of the 3.125% Senior Notes due 2023. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated April 29, 2013.\n4.6\nForm of 3.125% Senior Notes due 2023. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated April 29, 2013.\n4.7\nOfficers Certificate dated April 29, 2015, pursuant to Section 3.2 of the Indenture dated August 8, 2003, setting forth the terms of the 3.250% Senior Notes due 2025. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated April 29, 2015.\n4.8\nForm of 3.250% Senior Notes due 2025. Incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K dated April 29, 2015.\n4.9\nOfficers Certificate dated April 21, 2016, pursuant to Section 3.2 of the Indenture dated August 8, 2003, setting forth the terms of the 3.125% Senior Notes due 2026. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated April 21, 2016.\n4.10\nForm 3.125% Senior Notes due 2026. Incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K dated April 21, 2016.\n4.11\nOfficers Certificate dated April 18, 2017, pursuant to Section 3.2 of the Indenture dated August 8, 2003, setting forth the terms of the 3.750% Senior Notes due 2027. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated April 18, 2017.\n4.12\nForm of 3.750% Senior Notes due 2027. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated April 18, 2017.\n4.13\nOfficers Certificate dated April 18, 2019, pursuant to Section 3.2 of the Indenture dated August 8, 2003, setting forth the terms of the 3.125% Senior Notes due 2024. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated April 18, 2019.\n4.14\nOfficers Certificate dated April 18, 2019, pursuant to Section 3.2 of the Indenture dated August 8, 2003, setting forth the terms of the 3.750% Senior Notes due 2029. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated April 18, 2019.\n4.15\nForm of 3.125% Senior Notes due 2024. Incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K dated April 18, 2019.\n4.16\nForm of 3.750% Senior Notes due 2029. Incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K dated April 18, 2019.\n4.17\nOfficers Certificate dated March 30, 2020, pursuant to Section 3.2 of the Indenture, dated August 8, 2003, setting forth the terms of the 3.625% Senior Notes due 2025. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated March 30, 2020.\n4.18\nOfficers Certificate dated March 30, 2020, pursuant to Section 3.2 of the Indenture, dated August 8, 2003, setting forth the terms of the 4.000% Senior Notes due 2030. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated March 30, 2020.\n4.19\nForm of 3.625% Senior Notes due 2025. Incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K dated March 30, 2020.\n4.20\nForm of 4.000% Senior Notes due 2030. Incorporated by reference to Exhibit 4.4 to the Current Report on Form 8-K dated March 30, 2020.\n4.21\nForm of 4.000% Senior Notes due 2030. Incorporated by reference to Exhibit 4.5 to the Current Report on Form 8-K dated March 30, 2020.\n4.22\nForm of 1.650% Senior Notes due 2031. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated August 14, 2020.\n4.23\nForm of 1.650% Senior Notes due 2031. Incorporated by reference to Exhibit 4.3 to the Current Report on Form 8-K dated August 14, 2020.\n4.24\nOfficers Certificate dated August 14, 2020, pursuant to Section 3.2 of the Indenture, dated August 8, 2003, setting forth the terms of the 1.650% Senior Notes due 2031. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated August 14, 2020.\n4.25\nOfficers Certificate dated August 1, 2022, pursuant to Section 3.2 of the Indenture dated August 8, 2003, setting forth the terms of the 4.750% Senior Notes due 2032. Incorporated by reference to Exhibit 4.1 to the Current Report on Form 8-K dated August 1, 2022.\n4.26\nForm of 4.750% Senior Notes due 2032. Incorporated by reference to Exhibit 4.2 to the Current Report on Form 8-K dated August 1, 2022.\n4.27\nDescription of Securities of AutoZone, Inc. Incorporated by reference to Exhibit 4.24 to the Annual Report on Form 10-K dated October 28, 2019.\n*10.1\nSecond Amended and Restated 1998 Director Compensation Plan. Incorporated by reference to Exhibit 10.2 to the Annual Report on Form 10-K for the fiscal year ended August 26, 2000.\n*10.2\nAutoZone, Inc. 2003 Director Compensation Plan. Incorporated by reference to Appendix D to the definitive proxy statement dated November 1, 2002, for the Annual Meeting of Stockholders held December 12, 2002.\n*10.3\nThird Amendment to the AutoZone, Inc. Executive Deferred Compensation Plan. Incorporated by reference to Exhibit 10.1 to the Form 8-K dated December 12, 2012.\n*10.4\nAmended and Restated AutoZone, Inc. 2003 Director Compensation Plan. Incorporated by reference to Exhibit 99.2 to the Current Report on Form 8-K dated January 4, 2008.\n*10.5\nForm of non-compete and non-solicitation agreement for Section 16 executive officers and by AutoZone, Inc.\n*10.6\nAgreement dated February 14, 2008, between AutoZone, Inc. and William C. Rhodes, III. Incorporated by reference to Exhibit 99.4 to the Current Report on Form 8-K dated February 15, 2008.\n*10.7\nAutoZone, Inc. 2015 Executive Incentive Compensation Plan incorporated by reference to Exhibit A to the definitive proxy statement dated October 27, 2014, for the Annual Meeting of Stockholders held December 18, 2014.\n*10.8\nAutoZone, Inc. 2011 Equity Incentive Award Plan, incorporated by reference to Exhibit A to the definitive proxy statement dated October 25, 2010, for the Annual Meeting of Stockholders held December 15, 2010.\n*10.9\nForm of Letter Agreement dated as of December 14, 2010, amending certain Stock Option Agreements of executive officers. Incorporated by reference to Exhibit 10.4 to the Quarterly Report on Form 10-Q dated December 16, 2010.\n*10.10\nForm of Stock Option Agreement under the 2011 Equity Incentive Award Plan. Incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q dated March 17, 2011.\n*10.11\nForm of Stock Option Agreement under the 2011 Equity Incentive Award Plan for officers effective September 27, 2011. Incorporated by reference to Exhibit 10.37 to the Annual Report on Form 10-K for the fiscal year ended August 27, 2011.\n*10.12\nAutoZone, Inc. Enhanced Severance Pay Plan.\n*10.13\nForm of Stock Option Agreement under the 2011 Equity Incentive Award Plan for certain executive officers effective September 27, 2011. Incorporated by reference to Exhibit 10.38 to the Annual Report on Form 10-K for the fiscal year ended August 27, 2011.\n*10.14\nSecond Amendment to the AutoZone, Inc. Executive Deferred Compensation Plan. Incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated December 14, 2011.\n*10.15\nOffer letter dated August 5, 2020, to Jamere Jackson. Incorporated by reference to Exhibit 10.1 on Form 8-K dated September 14, 2020.\n*10.16\nAmended and Restated AutoZone, Inc. Executive Deferred Compensation Plan dated December 17, 2013. Incorporated by reference to Exhibit 10.2 to the Quarterly Report on Form 10-Q dated March 25, 2014.\n*10.17\nAutoZone, Inc. Director Compensation Program effective January 1, 2022.\n*10.18\nAmended and Restated AutoZone, Inc. 2011 Equity Incentive Award Plan dated December 16, 2015. Incorporated by reference to Exhibit A to the definitive proxy statement dated October 26, 2015, for the Annual Meeting of Stockholders held December 16, 2015.\n*10.19\nAutoZone, Inc. Sixth Amended and Restated Executive Stock Purchase Plan. Incorporated by reference to Exhibit A to the definitive proxy statement dated October 24, 2016, for the Annual Meeting of Stockholders held December 14, 2016.\n*10.20\nForm of Restricted Stock Unit Grant Notice and Restricted Stock Unit Award Agreement under the 2011 Equity Incentive Award Plan for officers effective September 27, 2011. Incorporated by reference to Exhibit 10.1 to the Quarterly Report on Form 10-Q dated December 17, 2018.\n*10.21\nAutoZone, Inc. 2020 Omnibus Incentive Award Plan. Incorporated by reference to Exhibit 10.1 to the Current Report on Form 8-K dated December 17, 2020.\n*10.22\nForm of Grant Notice and Award Agreement for Stock Options granted to Officers under the AutoZone, Inc. 2020 Omnibus Incentive Award Plan. Incorporated by reference to Exhibit 10.2 to the Current Report on Form 8-K dated December 17, 2020.\n*10.23\nForm of Grant Notice and Award Agreement for Restricted Stock Units granted to Officers under the AutoZone, Inc. 2020 Omnibus Incentive Award Plan. Incorporated by reference to Exhibit 10.3 to the Current Report on Form 8-K dated December 17, 2020.\n*10.24\nForm of Grant Notice and Award Agreement for Restricted Stock Units granted to Directors under the AutoZone, Inc. 2020 Omnibus Incentive Award Plan. Incorporated by reference to Exhibit 10.4 to the Current Report on Form 8-K dated December 17, 2020.\n*10.25\nFourth Amended and Restated Credit Agreement dated as of November 15, 2021, among AutoZone, Inc. as Borrower, the lenders party thereto and Bank of America, N.A. as Administrative Agent, incorporated by reference to Exhibit 10.1 of the Current Report on Form 8-K dated November 16, 2021.\n*10.26\nAmendment No. 1 to the AutoZone, Inc. 2020 Omnibus Incentive Award Plan. Incorporated by reference to Exhibit 10.34 to the Annual Report on Form 10-K for the fiscal year ended August 28, 2021.\n*10.27\nForm of Grant Notice and Award Agreement for Stock Options granted to Officers under the AutoZone, Inc. 2020 Omnibus Incentive Award Plan.\n*10.28\nForm of Grant Notice and Award Agreement for Restricted Stock Units granted to Officers under the AutoZone, Inc. 2020 Omnibus Incentive Award Plan.\n21.1\nSubsidiaries of the Registrant.\n23.1\nConsent of Independent Registered Public Accounting Firm.\n31.1\nCertification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2\nCertification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350 as adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification of Principal Financial Officer Pursuant to 18 U.S.C. Section 1350 as adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Document\n101.LAB\nInline XBRL Taxonomy Extension Labels Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Document\nCover Page Inline XBRL File\n*\nManagement contract or compensatory plan or arrangement.\n(c) Financial Statement Schedules\nSchedules are omitted because the information is not required or because the information required is included in the financial statements or notes thereto.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAUTOZONE, INC.\nBy:\n/s/ WILLIAM C. RHODES, III\nWilliam C. Rhodes, III\nChairman, President and\nChief Executive Officer\n(Principal Executive Officer)\nDated: October 24, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated:\nSIGNATURE\nTITLE\nDATE\n/s/ WILLIAM C. RHODES, III\nChairman, President and Chief Executive Officer\nOctober 24, 2022\nWilliam C. Rhodes, III\n(Principal Executive Officer)\n/s/ JAMERE JACKSON\nExecutive Vice President, Chief Financial\nOctober 24, 2022\nJamere Jackson\nOfficer and Store Development\n(Principal Financial Officer)\n/s/ J. SCOTT MURPHY\nVice President and Controller\nOctober 24, 2022\nJ Scott Murphy\n(Principal Accounting Officer)\n/s/ DOUGLAS H. BROOKS\nDirector\nOctober 24, 2022\nDouglas H. Brooks\n/s/ MICHAEL A. GEORGE\nDirector\nOctober 24, 2022\nMichael A. GEORGE\n/s/ LINDA A. GOODSPEED\nDirector\nOctober 24, 2022\nLinda A. Goodspeed\n/s/ EARL G. GRAVES, JR.\nDirector\nOctober 24, 2022\nEarl, G. Graves, Jr.\n/s/ ENDERSON GUIMARAES\nDirector\nOctober 24, 2022\nEnderson Guimaraes\n/s/ BRIAN HANNASCH\nDirector\nOctober 24, 2022\nBrian Hannasch\n/s/ D. BRYAN JORDAN\nDirector\nOctober 24, 2022\nD. Bryan Jordan\n/s/ GALE V. KING\nDirector\nOctober 24, 2022\nGale V. King\n/s/ GEORGE R. MRKONIC, JR.\nDirector\nOctober 24, 2022\nGeorge R. Mrkonic, Jr.\n/s/ JILL A. SOLTAU\nDirector\nOctober 24, 2022\nJill A. Soltau"
}