{
    "cik": "885307",
    "company": "JEWETT CAMERON TRADING CO LTD",
    "filing_type": "10-K",
    "filing_date": "2023-11-28",
    "period_of_report": "2023-08-31",
    "sic": "5211",
    "state_of_inc": "OR",
    "state_location": "OR",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/885307/0001079973-23-001665-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/885307/000107997323001665/jctcf_10k-083123.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/885307/0001079973-23-001665.txt",
    "filename": "885307_10K_2023_0001079973-23-001665.htm",
    "content": "ITEM 1. BUSINESS\nForward-Looking Statements\nThis Annual Report on Form 10-K contains forward-looking statements, within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words like plans, expects, aims, believes, projects, anticipates, intends, estimates, will, should, could and similar expressions in connection with any discussion, expectation, or projection of future operating or financial performance, events or trends. Forward-looking statements are based on management's current expectations and assumptions, which are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Actual outcomes and results may differ materially from these expectations and assumptions due to changes in global political, economic, business, competitive, market, regulatory and other factors. We undertake no obligation to publicly update or review any forward-looking information, whether as a result of new information, future developments or otherwise.\nThese factors include, but are not limited to the fact that the Company is in a highly competitive business and may seek additional financing to expand its business, and are set forth in more detail elsewhere in this Annual Report, including in the sections, ITEM 1A, Risk Factors, and ITEM 7, Management's Discussion and Analysis of Financial Condition and Results of Operations.\nIntroduction\nJewett-Cameron Trading Company Ltd. is organized under the laws of British Columbia, Canada. In this Annual Report, the Company, we, our and us refer to Jewett-Cameron Trading Company Ltd. and its subsidiaries.\nThe Companys operations are classified into three reportable operating segments and the parent corporate and administrative segment, which were determined based on the nature of the products offered along with the markets being served. The segments are as follows:\n· Industrial wood products\n· Pet, Fencing and Other\n· Seed processing and sales\n· Corporate and administration\nEffective September 1, 2013, the Company reorganized certain of its subsidiaries. Jewett-Cameron Lumber Corporation (JCLC) was changed to JC USA Inc. (JC USA), which has the following three wholly-owned subsidiaries.\nThe industrial wood products segment reflects the business conducted by Greenwood Products, Inc. (Greenwood). Greenwood is a processor and distributor of industrial wood products. A major product category is treated plywood that is sold to the transportation industry.\nThe pet, fencing and other segments reflect the business of the Jewett-Cameron Company (JCC). JCC is a wholesaler of products based in these categories. Pet products range from enclosures/kennels of varying types and construction primarily out of metal, to items that support the pet home such as beds, bowls and compostable dog waste bags. Fencing and containment products include such products as proprietary gate and fencing components, including trademarked and patented post systems, wood and other fencing infill products, as well as kitted security fencing solutions. Other products include garden, landscaping and miscellaneous products for the home. JCC uses contract manufacturers to make all products. Some of the products that JCC distributes flow through the Companys distribution center located in North Plains, Oregon, and some are shipped direct to the customer from the manufacturer. Primary customers are home centers, eCommerce providers, other retailers, and direct sales to consumers.\nThe seed processing and sales segment reflects the business of Jewett-Cameron Seed Company (JCSC). JCSC processed and distributed agricultural seed. Most of this segments sales were derived from selling seed to distributors with a lesser amount of sales derived from cleaning seed. During the fiscal year ended August 31, 2023, the Company decided to close its JCSC seed subsidiary effective August 31, 2023. JCSC has sold all of its seed inventory and is presently working to sell the segments remaining equipment in preparation for being wound-up. JCSC is continuing to store some seed for its customers while they arrange alternate storage, but the facility is expected to be fully closed by December 31, 2023.\nJC USA provides professional and administrative services, including accounting and credit services, to each of its wholly-owned subsidiary companies.\nTotal Company sales were approximately $54.3 million and $62.9 million during fiscal years ended August 31, 2023 and 2022, respectively.\nThe Company's principal office is located at 32275 NW Hillcrest Street, North Plains, Oregon; and the Companys website address is www.jewettcameron.com. The Companys primary mailing address is P.O. Box 1010, North Plains, OR 97133. The Companys phone number is (503) 647-0110, and the fax number is (503) 647-2272.\nThe Company files reports and other information with the Securities and Exchange Commission located at 100 F Street NE, Washington, D.C. 20549. Copies of these filings may be accessed through their website at www.sec.gov. Reports are also filed under Canadian regulatory requirements on SEDAR, and these reports may be accessed at www.sedar.com.\nThe contact person for the Company is Chad Summers, President and CEO.\nThe Companys authorized capital includes 21,567,564 common shares without par value; and 10,000,000 preferred shares without par value. As of August 31, 2023 and November 27, 2023, there were 3,498,899 common shares outstanding. The Company's common shares are listed on the NASDAQ Capital Market in the United States with the symbol JCTCF.\nThe Company's fiscal year ends on August 31st.\nGeneral Development of Business\nIncorporation and Subsidiaries\nJewett-Cameron Trading Company Ltd. was incorporated under the Company Act of British Columbia on July 8, 1987 as a holding company for Jewett-Cameron Lumber Corporation (JCLC), which was incorporated in September 1953 in Oregon, USA. Jewett-Cameron Trading Company, Ltd. acquired all the shares of JCLC through a stock-for-stock exchange on July 13, 1987, and at that time JCLC became a wholly owned subsidiary. Effective September 1, 2013, the Company completed a reorganization of certain of its subsidiaries and JCLCs name was changed to JC USA Inc. (JC USA). JC USA has the following wholly owned subsidiaries. Jewett-Cameron Seed Company, (JCSC), incorporated in October 2000, Greenwood Products, Inc. (Greenwood), incorporated in February 2002, and Jewett-Cameron Company (JCC) incorporated in September 2013. Jewett-Cameron Trading Company, Ltd. and its subsidiaries have no significant assets in Canada.\nCorporate Development\nIncorporated in 1953, JC USA operated as a small lumber wholesaler based in Portland, Oregon. In September 1984, the original stockholders sold their interest in the corporation to a new group of investors. Two members of that group remained active in the Company. These individuals are Donald Boone, who passed away in May, 2019, and who was the previous Chairman and Director and the former President, Chief Executive Officer, Treasurer, and Principal Financial Officer, transitioning to strictly the Board Chair in 2017; and Michael Nasser, who retired from day-to-day involvement in the business as of December 2022 but remained engaged as a Director. In October 2023, Mr. Nasser voluntarily resigned from the Board of Directors but is available as an advisor to the Board.\nIn July 1987, the Company acquired JC USA in what was not an arms-length transaction.\nIn February 2002, Greenwood was incorporated in anticipation of JC USA acquiring the business and certain assets of Greenwood Forest Products Inc. Greenwood is involved in the processing and distribution of specialty wood products.\nIn June 2012, the Company acquired land and fixed assets located in Manning, Oregon for $250,000 cash. The property was sold in an arms-length transaction in the second quarter of fiscal 2019 for $325,000 cash.\nIn May 2019 Chairman and Co-Founder of the Company Donald M. Boone passed away. Mr. Boone served as President and CEO from 1984 until 2017 when he voluntarily retired from his officer positions and oversaw the addition and successful integration of new management and directors.\nIn April 2023, the Board of Directors decided to close the Companys JCSC seed division. JCSC operates as a seed storage, processing and sales business and was incorporated by the Company in October 2000 in anticipation of JC USA acquiring the business and certain assets of a firm called Agrobiotech Inc. JCSC has been receiving lower quantities of seed for processing, and the demand for its marketing and sales services have declined as costs have been rising. JCSCs facilities and equipment are near the end of the expected useful life and would require significant capital investment to remain operating. Regular operations at JCSC ended effective August 31, 2023, but seed storage operations are expected to continue through approximately December 31, 2023 in order to provide customers time to obtain alterative storage. The entire seed inventory was sold in early October, and the remaining equipment is in the process of being sold. The Company has prioritized career development and retention, and some of the JCSC personnel are being moved to different positions within the Company.\nNarrative Description of Business\nThe Companys operations are classified into four segments: Industrial wood products; Pet, Fencing and Other; Seed processing and sales; and corporate and administration. Sales, income before taxes, assets, depreciation and amortization, capital expenditures, and interest expense by segment are shown in the financial statements under Note 12 Segment Information.\nPet, Fencing and Other - JCC\nThe pet, fencing and other segments reflect the business of Jewett-Cameron Company (JCC), which is a manufacturer and distributor of specialty products and a wholesaler of products formerly conducted by JCLC.\nJCC operates out of a 5.6 acre owned facility located in North Plains, Oregon that includes offices, a warehouse, and a paved yard. This business is a wholesaler, and a manufacturer and distributor of products that include an array of pet enclosures, kennels, and pet welfare and comfort products, proprietary gate support systems, perimeter fencing, greenhouses, and fencing in-fill products made of wood, metal and composites. Examples of the Companys brands include Lucky Dog®, for pet products; Adjust-A-Gate®, Fit-Right®, Perimeter Patrol®, and Lifetime Post™ for gates and fencing; Early Start, Spring Gardner™, Greenline®, and Weatherguard for greenhouses. JCC has also recently become the exclusive distributor of MyEcoWorld® sustainable bag products in the US and Canada. JCC uses contract manufacturers to manufacture its products. Some of the products that JCC distributes flow through the Companys facility in North Plains, Oregon, and some are shipped direct to the customer from the manufacturer. Primary customers are home centers, eCommerce partners, on-line direct consumers as well as other retailers.\nThe home improvement business is seasonal, with higher levels of sales occurring between February and August. Inventory buildup occurs until the start of the season in February and then gradually declines to seasonal low levels at the end of the summer.\nJCC has concentrated on building a customer base for lawn, garden, and pet related products. Management believes this market is less sensitive to downturns in the U.S. economy than is the market for new home construction as its products serve both new and existing home and pet owners.\nThe wood products that JCC distributes are not unique and are available from multiple suppliers. However, the metal products that JCC manufactures and distributes may be somewhat differentiated from similar products available from other suppliers. The company has been successful garnering key patents and trademarks on multiple products that assist their ability to continue to differentiate based on design and functionality.\nJCC owns the patents and manufacturing rights connected with the Adjust-A-Gate® and Fit-Right™ products, which are the gate support systems for wood, vinyl, chain link, and composite fences. The Company completed its purchase of the full trademark rights for Adjust-A-Gate® and filed its registration with the US Patent and Trademark Office in February 2023. Management believes the ownership of these patents and trademarks is an important competitive advantage for these and certain other products. During fiscal 2023, in addition to the additional trademark rights for Adjust-A-Gate®, the Company applied for 2 patents (fiscal 2022 - one) and received 0 patents (2022 - Nil).\nBacklog orders are a factor in this business as customers may place firm priced orders for products for shipments to take place three to four months in the future.\nIndustrial Wood Products - Greenwood\nGreenwood is a wholesale distributor of a variety of specialty wood products. Operations are co-located in the building utilized by JCC.\nHistorically, a major product category was treated plywood that was sold into the marine industry. It migrated from that segment and focused more into the transportation industry. Greenwoods total sales for fiscal 2023 and 2022 were 5% and 4% respectively of total Company sales.\nThe primary market in which Greenwood competes has decreased in economic sensitivity as users are incorporating products into the municipal and mass transit transportations sectors. However, these markets sustained some contractions due to COVID-19 as work shifted from offices to homes, and many individuals utilized transit less due to concerns over exposure. In addition, this segment is prone to disruption of supply chain support which can impact other commodities outside of those specific to the disruption.\nInventory is maintained at non-owned warehouse and wood treating facilities throughout the United States and is primarily shipped to customers on a just-in-time basis. Inventory is generally not purchased on a speculative basis in anticipation of price changes.\nGreenwood has no significant backlog of orders.\nSeed Processing and Sales - JCSC\nJCSC operates out of an approximately 12 acre owned facility located adjacent to North Plains, Oregon. JCSC processes and distributes agricultural seed. Most of this segments sales come from selling seed to distributors with a lesser amount of sales derived from cleaning seed. Sales of seed has seasonality, but it is most affected by weather patterns in multiple parts of the United States that utilize cyclical planting. The annual weather plays an important part in year-to-year sales volatility and specific crop demand. However, profitability around and after the month of August may be higher based on a seasonal surge in cleaning sales, which are more profitable than product sales.\nThe Company ended regular operations at JCSC effective August 31, 2023. The Company has now sold all of its remaining seed inventory and is working to sell the remaining JCSC equipment. Seed storage operations are expected to continue through approximately December 31, 2023 in order to provide customers time to obtain alternative storage.\nAdministrative Services - JC USA\nJC USA is the parent company for the Companys wholly-owned subsidiaries as described above. JC USA operates out of the Companys offices in North Plains, Oregon. It provides professional and administrative services, including warehousing, accounting and credit services, to its subsidiary companies.\nTariffs\nThe Companys metal and other products are largely manufactured in China and are imported into the United States. The Office of the United States Trade Representative (USTR) instituted new tariffs on the importation of a number of products into the United States from China effective September 24, 2018. These new tariffs are a response to what the USTR considers to be certain unfair trade practices by China. The tariffs began at 10%, and subsequently were increased to 25% as of May 10, 2019. A number of the Companys products manufactured in China remain subject to duties of 25% when imported into the United States.\nCustomer Concentration\nThe top ten customers were responsible for 88% and 84% of total Company sales for the years ended August 31, 2023 and August 31, 2022, respectively. Also, the Companys single largest customer was responsible for 35% and 28% of total Company sales for the years ended August 31, 2023 and August 31, 2022 respectively.\nEmployees\nAs of August 31, 2023 the Company had 68 full-time employees (August 31, 2022 - 75 full-time employees). By segment these employees were located as follows: Greenwood 1, JCC 40, JCSC 8, and JC USA 19. Subsequent to the end of the fiscal year, the Company ceased regular operations at JCSC. 4 of the JCSC employees are being transferred to JCC, and the remainder were terminated and offered transition assistance. None of these employees are represented by unions at the Company. Jewett-Cameron Trading Company Ltd. has no direct employees, and the CEO of the Company is employed by JC USA. ITEM 1A. RISK FACTORS\nInvestors should carefully consider the following risk factors and all other information contained in this Annual Report. There is a great deal of risk involved in the business of the company, and any of the following risks could affect our business, its financial condition, its potential profits or, and could result in you losing your entire investment if our business became insolvent. The risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties, including those not presently known to us or that we currently deem immaterial, also may result in decreased revenues, increased expenses or other events which could result in a decline in the price of our common stock.\nRisks Related to Our Common Stock\nWe may decide to acquire assets or enter into business combinations, which could be paid for, either wholly or partially with our common stock and if we decide to do this our current shareholders would experience dilution in their percentage of ownership.\nOur Articles of Incorporation give our Board of Directors the right to enter into any contract without the approval of our shareholders. Therefore, our management could decide to make an investment (buy shares, loan money, etc.) without shareholder approval. If we acquire an asset or enter into a business combination, this could include exchanging a large amount of our common stock, which could dilute the ownership interest of present stockholders.\nFuture stock distributions could be structured in such a way as to be 1) diluting to our current shareholders or 2) could cause a change in control to new investors.\nIf we raise additional funds by selling more of our stock, the new stock may have rights, preferences or privileges senior to those of the rights of our existing stock. If common stock is issued in return for additional funds, the price per share could be lower than that paid by our current stockholders. The result of this would be a lessening of each present stockholders relative percentage interest in our company.\nThe Companys common shares currently trade within the NASDAQ Capital Market in the United States. The average daily trading volume of our common stock was approximately 5,000 shares on NASDAQ for the fiscal year ended August 31, 2023. With this limited trading volume, investors could find it difficult to purchase or sell our common stock.\nRisks Related to Our Business\nA contagious disease outbreak, such as the recent COVID-19 pandemic emergency, could have an adverse effect on our operations and financial condition\nOur business could be negatively affected by an outbreak of an infectious disease due to the consequences of the actions taken by companies and governments to contain and control the virus. These consequences include:\n· The inability of our third-party manufacturers in China and elsewhere to manufacture or deliver products to us in a timely manner, if it all.\n· Isolation requirements may prevent our employees from being able to report to work or being required to work from home or other off-site location which may prevent us from accomplishing certain functions, including receiving products from our suppliers and fulfilling orders for our customers, which may result in an inability to meet our obligations.\n· Our new products may be delayed or require unexpected changes to be made to our new or existing products.\n· The effect of the outbreak on the economy may be severe, including an economic downturn and decrease in employment levels which could result in a decrease in consumer demand for our products.\nThe financial impact of such an outbreak are outside our control and are not reasonable to estimate but may be significant. The costs associated with any outbreak may have an adverse impact on our operations and financial condition and not be fully recoverable or adequately covered by insurance.\nWe could experience a decrease in the demand for our products resulting in lower sales volumes.\nIn the past we have at times experienced decreasing products sales with certain customers. The reasons for this can be generally attributed to: increased competition; general economic conditions; demand for products; and consumer interest rates. If economic conditions deteriorate or if consumer preferences change, we could experience a significant decrease in profitability.\nIf our top customers were lost, we could experience lower sales volumes.\nFor the fiscal year ended August 31, 2023 our top ten customers represented 88% of our total sales, and our single largest customer was responsible for 35% of our total sales. We would experience a significant decrease in sales and profitability and would have to cut back our operations, if these customers were lost and could not be replaced. Our top ten customers are located in North America and are primarily in the retail home improvement and pet industries.\nWe could experience delays in the delivery of our products to our customers causing us to lose business.\nWe purchase our products from other vendors and a delay in shipment from these vendors to us could cause significant delays in our delivery to our customers. This could result in a decrease in sales orders to us and we would experience a loss in profitability.\nGovernmental actions, such as tariffs, and/or foreign policy actions could adversely and unexpectedly impact our business.\nSince the bulk of our products are supplied from other countries, political actions by either our trading country or our own domestic policy could impact both availability and cost of our products. Currently, we see this in regard to tariffs being levied on foreign sourced products entering into the United States, including from China. The continuing tariffs by the United States on certain Chinese goods include some of our products that we purchase from suppliers in China. The company has multiple options to assist in mitigating the cost impacts of these government actions. However, we cannot control the duration or depth of such actions which may increase our product costs which would in turn reduce our margins and potentially decrease the competitiveness of our products. These actions could have a negative effect on our business, results of operations, or financial condition.\nWe could lose our credit agreement and could result in our not being able to pay our creditors.\nWe have a line of credit with U.S. Bank in the amount of $10 million, of which the entire amount is available. We are currently in compliance with the requirements of our existing line of credit. If we lost access to this line of credit it could negatively affect our ability to pay some of our creditors on a timely basis.\nOur information technology systems are susceptible to certain risks, including cyber security breaches, which could adversely impact our operations and financial condition.\nOur operations involve information technology systems that process, transmit and store information about our suppliers, customers, employees, and financial information. These systems face threats including telecommunication failures, natural disasters, and cyber security threats, including computer viruses, unauthorized access to our systems, and other security issues. While we have taken aggressive steps to implement security measures to protect our systems and initiated an ongoing training program to address many of the primary causes of cyber threat with all our employees, such threats change and morph almost daily. There is no guarantee our actions will secure our information systems against all threats and vulnerabilities. The compromise or failure of our information systems could have a negative effect on our business, results of operations, or financial condition.\nIf we fail to maintain an effective system of internal controls, we may not be able to detect fraud or report our financial results accurately, which could harm our business and we could be subject to regulatory scrutiny.\nWe have completed a management assessment of internal controls as prescribed by Section 404 of the Sarbanes-Oxley Act, which we were required to do in connection with our year ended August 31, 2023. Based on this process we did not identify any material weaknesses. Although we believe our internal controls are operating effectively, we cannot guarantee that in the future we will not identify any material weaknesses in connection with this ongoing process. ITEM 1B. UNRESOLVED STAFF COMMENTS\n--- No Disclosure Necessary --- ITEM 2. PROPERTIES\nThe Companys executive offices are located at 32275 NW Hillcrest Street, North Plains, OR 97133. The 5.6 acre facility, which is owned, consists of 55,250 square feet of covered space (10,000 office and 47,250 warehouse), a little over three acres of paved yard space, and was originally completed in October 1995. A 12,000 square foot warehouse expansion was completed in fiscal 2017 which the Company is using for several new product lines. In fiscal 2021, the Company completed the conversion of 2,000 square feet of older warehouse space into 4,000 square feet of office and meeting space on two levels. The facility provides office space for JC USA, including all of the Companys executive offices, and is used as a distribution center to service the Companys customer base for JCC and Greenwood. During fiscal 2022, the Company leased an additional 4,700 square feet of warehouse space located in North Plains.\nThe property associated with JCSC, which is owned, consists of 11.7 acres of land, 105,000 square feet of buildings, rolling stock, and equipment. It is currently used for seed processing and storage. It is located at 31345 NW Beach Road, Hillsboro, OR 97124, which is adjacent to North Plains, OR. With the closure of the seed business, the ultimate disposition of JCSCs property has not been determined and will be evaluated by the Board.\nDuring fiscal 2010, the Company purchased a 2,000 square foot building adjacent to the Companys main facilities that previously housed a seed testing lab located at 31895 NW Hillcrest Street, North Plains, OR 97133. The Company formerly leased the property for $729 per month until the expiration of the lease on January 4, 2010. At that time, the Company exercised its option to buy the land and building for a total cost of $150,946. In fiscal 2020, the Company began a renovation of this building into its new innovation center which will focus on new product development for the Companys subsidiaries. The renovation was completed during fiscal 2021. ITEM 3. LEGAL PROCEEDINGS\nA consortium of California District Attorneys contacted the Company in regard to possible liabilities related to environmental labeling of its plant-based Lucky Dog Poop Bags previously sold in the State of California. The Company has since modified its product marketing statements in response to their concerns, and during the period ended May 31, 2022, accrued $300,000 in anticipation of a settlement. In June 2022, a settlement was finalized which required the Company to pay the previously accrued $300,000 as a cash fine over a four-month period with no admission of guilt by the Company.\nThe Company was one of three named defendants in a Civil Action in Pennsylvania. The matter arises out of a dog allegedly escaping from a Jewett-Cameron kennel product and causing personal injuries to three individuals. The Companys applicable liability insurer provided the defense covering the Companys legal fees and costs. During the fiscal year ended August 31, 2022, the case was settled within the Companys insurance policy limits with no admission of guilt by the Company, and there were no additional costs incurred.\nIn fiscal 2021, the Company initiated arbitration against a former distributor asserting a breach of the distribution agreement and seeking damages. The liability arbitration hearing was held in December 2022. In February 2023, the arbitrator issued its decision and ruled in favor of the Company on the majority of all of its claims. A damages hearing was held in August 2023. In September 2023, the Company settled its arbitration for a cash payment of $2,450,000 which was received in October 2023. ITEM 4. MINE SAFETY DISCLOSURES\n--- No Disclosure Necessary ---\nPART II ITEM 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common shares trade on the NASDAQ Capital Market (formerly the NASDAQ Small Cap Market) in the United States. The trading symbol for the common stock is JCTCF and the CUSIP number for the stock is 47733C-20-7. The common stock began trading on the NASDAQ Small Cap Market in April 1996.\nTable No. 1 lists the volume of trading along with the high, low, and closing sales prices on the NASDAQ Capital Market for the Company's common shares.\nTable No. 1\nNASDAQ Capital Market\nCommon Shares Trading Activity\n(US Dollars)\nPeriod\nEnded Volume High Low Closing\nMonthly\n9/30/23 64,900 $ 4.84 $ 4.50 $ 4.65\nQuarterly\n8/31/23 471,700 $ 5.62 $ 3.70 $ 4.52\n5/31/23 206,500 $ 5.90 $ 4.67 $ 4.65\n2/28/23 296,200 $ 5.98 $ 4.95 $ 5.50\n11/30/22 274,800 $ 6.54 $ 4.85 $ 5.08\n8/31/22 162,600 $ 7.09 $ 6.19 $ 6.36\n5/31/22 271,500 $ 8.25 $ 5.50 $ 6.72\n2/28/22 153,800 $ 9.84 $ 7.15 $ 7.98\n11/30/21 254,100 $ 13.74 $ 9.02 $ 9.15\nAnnually\n8/31/23 1,249,200 $ 6.54 $ 3.70 $ 4.52\n8/31/22 842,000 $ 13.74 $ 5.50 $ 6.36\n8/31/21 1,305,400 $ 12.00 $ 7.23 $ 10.60\n8/31/20 455,600 $ 8.78 $ 5.00 $ 7.55\n8/31/19 1,318,200 $ 10.00 $ 6.23 $ 8.04\nHolders\nComputershare Investor Services Inc. which is located in Vancouver, British Columbia, Canada is the registrar and transfer agent for the common shares.\nOn October 13, 2023 there were 26 registered shareholders and 3,498,899 shares of the Companys common shares outstanding.\nDividends\nThe Company has not declared any dividends since incorporation and does not anticipate that it will do so in the foreseeable future. The present policy of the Company is to retain earnings for use in its operations, expansion of its business, and the possible repurchase of Company shares. There are no restrictions that limit the ability of the Company to pay dividends on common equity or that are likely to do so in the future. Any dividends paid by the Company to U.S. shareholders would be subject to Canadian withholding tax.\nRecent Sales of Securities: Use of Proceeds from Securities\nThe Company has sold no securities in the last 3 fiscal years.\nPurchases of equity securities by the issuer and affiliated purchasers\nThe Company has not repurchased any common shares during the years ended August 31, 2023 or August 31, 2022. ITEM 6. [RESERVED] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operation\nThe Companys operations are classified into three reportable operating segments and the parent corporate and administrative segment, which were determined based on the nature of the products offered along with the markets being served. The segments are as follows:\n· Industrial wood products\n· Pet, Fencing and Other\n· Seed processing and sales\n· Corporate and administration\nQuarterly Results\nThe following table summarizes quarterly financial results in fiscal 2023 and fiscal 2022. (Figures are thousands of dollars except per share amounts).\nFor the Year Ended August 31, 2023\nFirst Second Third Fourth Full\nQuarter Quarter Quarter Quarter Year\nSales $ 12,578 $ 8,143 $ 18,946 $ 14,622 $ 54,289\nGross profit 2,860 1,921 4,413 3,053 12,247\nNet income (loss) (74 ) (972 ) (21 )\nBasic earnings per share $ (0.02 ) $ (0.28 ) $ 0.21 $ 0.08 $ (0.01 )\nDiluted earnings per share $ (0.02 ) $ (0.28 ) $ 0.21 $ 0.08 $ (0.01 )\nFor the Year Ended August 31, 2022\nFirst Second Third Fourth Full\nQuarter Quarter Quarter Quarter Year*\nSales $ 12,918 $ 14,061 $ 20,922 $ 15,001 $ 62,902\nGross profit 2,465 3,424 5,353 2,551 13,793\nNet income (loss) (391 ) 1,494 (209 ) 1,164\nBasic earnings (loss) per share $ (0.11 ) $ 0.08 $ 0.43 $ (0.06 ) $ 0.33\nDiluted earnings (loss) per share $ (0.11 ) $ 0.08 $ 0.43 $ (0.06 ) $ 0.33\n* Fiscal 2023 quarterly per share earnings were calculated using weighted average number of common shares outstanding as of August 31, 2023 of 3,498,899 (2022 - 3,493,807). The sum of the quarterly earnings per share may not equal the full year earnings per share due to the use of the full years weighted average share figure and rounding.\nRESULTS OF OPERATIONS\nFiscal 2023 was a difficult year in our markets. Our operations confronted a number of challenges, including poor weather, negative economic trends and inflationary pressures, and changing consumer spending habits.\nThe primary selling season for our outdoor products in the spring and summer months was greatly shortened by the historically wet and unseasonably cold winter weather which extended across much of the United States well into April. This delayed, and ultimately significantly reduced, our orders from many of our customers, particularly retail hardware and Big Box stores. They maintained their winter inventory longer than usual which reduced their selling period for warm weather products. As a result, they ordered less product from our outdoor lines this year than in ordinary weather years.\nThe post-COVID shift of consumer spending habits, which has been compounded by persistently high levels of inflation, had a negative effect on our sales for the year. These forces were particularly prominent within our home improvement and pet product lines, as consumers reduced their spending on these types of discretionary products from the elevated levels experienced during the pandemic. Our fiscal 2023 sales of $54.2 million is 21% higher than our sales of $44.9 in the last pre-pandemic year of 2020. Although inflation has raised our selling price of our products since 2020, this 21% increase in the dollar amount of sales is still greater than the cumulative inflation rate in the US during the same period.\nFencing sales were largely steady year-over-year, with several product lines exceeding expectations. This performance was especially encouraging considering the poor Spring weather across the country which reduced consumer demand for fence lumber and hardware. Our efforts to increase the visibility of our hardware products and maintain their in-stock availability with several retailers has also contributed to this years sales. We remain at the desired warehouse inventory levels for our key fence products and are experiencing no shipping delays to our customers.\nDuring fiscal 2023, we signed a new sales agreement with one of major lumber customers which changed how we inventory, sell and record our sales for this customer. Our expectation that this new arrangement would provide us with more consistent and predictable fencing sales, while improving the availability of the product in their stores, has been confirmed. Although this agreement requires us to maintain higher levels of fencing inventory than we had in the past, we are pleased with how the arrangement has progressed. In the future, it may be possible to extend this agreement to more of this customers distribution centers that we continue to serve under our prior sales agreements.\nThe pet industry overall has recently experienced a spending downturn from the surge of sales recorded in the prior two years. During the pandemic many Americans worked from home. They acquired new pets and purchased additional supplies for all their pets. This increased spending subsided as many people returned to work outside the home. The higher levels of inflation prevailing over the last 18 months has also dampened consumer spending in the sector. Demand for our pet products have similarly been affected. We relaunched one of our kennel products during 2023, and we also resolved a sales interruption with a significant on-line retailer, both of which have had positive results on sales. Our pet product inventory levels remain higher than usual. Many retailers have a higher than normal level of pet supply inventory on hand due to increasing their purchases during the pandemic prior to the sudden downturn in consumer demand. As a result, we expect overall demand from retailers to remain depressed into 2024 until they are able to work through their own high inventory levels. We remain committed to maintaining our list prices on our primary pet products. There is no urgency to move this inventory as it will not degrade or spoil over time. For our slower moving pet products, we continue to explore opportunities to accelerate sales in those items.\nWe launched our new MyEcoWorld® sustainable bag products during the 4th quarter of fiscal 2023. Under our distribution agreement with SECOS Group of Australia, Jewett-Cameron is the exclusive distributor of their MyEcoWorld® sustainable bag products in the US and Canada. We expect it will take time for sales of these new and innovative premium products to gain traction with retailers and consumers. Since these products are consumables, once they are established, recurring sales will build over time. We are optimistic of the potential of this new product line to grow into a meaningful segment of our business. Consumers are increasingly seeking more environmentally friendly alternatives to conventional hydrocarbon derived plastic products. Our success with our compostable poop bag since its launch several years ago indicates these products are less seasonal and can provide positive contributions to our historically lower revenue quarters.\nGreenwoods primary customers are in the transit sector, which is an industry among the most affected by the COVID-19 pandemic. Transit is beginning to recover from the severe decline in ridership and other serious issues, including shortages of vehicle components and trained drivers and mechanics, that reduced the number of vehicles on the road and the need for Greenwoods engineered wood products. With transits recovery, Greenwoods sales have increased from the pandemic periods but were flat in 2023 compared to 2022. We continue to see a number of marketing opportunities for Greenwoods products in both its current markets and in new sectors, such as construction. We have been actively searching to hire new traders to pursue these new business opportunities, and a new trader was successfully hired in September 2023.\nDuring fiscal 2023, management concluded a comprehensive strategic review of the seed segment. As a result of this review, the Board of Directors made the difficult decision to close JCSC effective August 31, 2023. The review of JCSC, which last reported a full-year profit in fiscal 2020, was initiated due to the segments declining revenue, higher costs, and the lack of success in generating new customers over the last several years. When the seed operation was first opened in 1965, and then acquired by the Company in 2000, the local area around the JCSC operations was rural and dominated by large farming operations, including grass seed farms which made up JCSCs customers. Over the last decade, many agricultural customers in the area around JCSC are converting their acreage from growing cyclical and commoditized grass seed to more specialized higher value crops, such as berries and filberts. Consequently, JCSC has been receiving lower quantities and quality of seed for processing and experiencing less demand for its marketing and sales in recent years. In addition, JCSCs building and equipment are nearing the end of their expected operating life. Over the last several years, the higher costs of maintenance required to maintain operations have had a substantial negative effect on JCSCs margins and has been an important factor in JCSCs operating losses. Taking into consideration the current economic and market trends, and the high cost of new equipment, the Board determined an orderly wind-down of operations and closure of JCSC was the most prudent action.\nThe wind-down of regular operations including seed cleaning was effective August 31, 2023. The process was greatly aided by the retention of the entire JCSC operating staff. As of August 31st, nearly all of the seed inventory had been sold, with the entire remaining inventory sold in September. Some of the equipment and other assets have also been sold, with the remainder being marketed for disposal by the end of calendar 2023. We are providing seed storage for our prior customers through December 2023 to allow them to arrange for new storage and seed cleaning services. We expect full closure of the facility to occur on or about January 1, 2024. Some of the JCSC staff are being moved to other roles within the Company, and transition services were offered for the remainder who were terminated effective August 31, 2023.\nJCSC owns 11.7 acres of land and 105,000 square feet of buildings in Hillsboro, Oregon. The land is very well located at a major interchange immediately adjacent to busy US Highway 26, which is a primary route linking Metro Portland to its Northwest suburbs and then to the Coast beaches. Its close proximity to Portland has meant that since 1990, Hillsboro has been one of the fastest growing cities in Oregon. Much of its original farmland has already been converted into residential areas and new business and industrial developments, including high-technology campuses. Currently, JCSCs land, which lies west of downtown Hillsboro, is zoned for agricultural use. However, there have been ongoing governmental discussions about extending the Urban Growth Boundaries further to the west. These proposed boundary changes could encompass JCSCs land and allow for a rezoning to residential, commercial or industrial use. Therefore, management and the Board have already begun to receive unsolicited inquiries from third-parties about any future sale of JCSCs building and land which would potentially take advantage of the valuable rezoning opportunity. At this time the property has not been listed for sale. The ultimate disposition of these assets has not been determined but will be studied by the Board before any final decision is reached.\nOur inventory as of August 31, 2023 was $18.3 million, which was a decline of over $2.3 million from the end of the prior fiscal year-end, but are higher than we have carried in years prior to fiscal 2022. Some of the change is due to the new fencing distribution agreement with a customer. We are required to maintain a higher level of lumber inventory than we have previously to ensure the availability of these products for this customer, which also serves to optimize our sales. We will continue to maintain higher lumber inventories in future period. Some of our higher inventory level is attributable to changes in our customers purchasing practices in some of our key categories, as many have slowed their purchasing rates post-pandemic in response to widespread changes in the purchasing behaviors of American consumers. A portion of our higher inventory is a result of the supply chain disruptions and other macro-economic issues experienced over the last several years. Some of our products, including our larger and bulkier items, were late in arriving from the manufacturer in China which contributed to our missing much of the busy selling season last year. Since our purchases of these manufactured goods have a protracted lead time, additional orders which in a normal year would have been needed to replace the goods we expected to sell and ship last summer instead stacked up behind the late arriving inventory in our warehouse. Fortunately, this excess inventory does not spoil or turn obsolete. The Company remains committed to selling this inventory as we rework these specific distribution channels, but we expect this to take some time.\nOur management continues to proactively face these challenges and find innovative ways to improve our operations. In response to the supply chain logistic issues and delays we have successfully negotiated new purchase terms with several of our major suppliers which include reducing prepayments and in some cases extended balance due deadlines. Additionally we have arranged for stock of our key products to be produced and stored at the factory with blanket purchase orders and minimal down payment to be available for shipment quicker to meet market demand. When we do make an order for these items the supplier will now be able to pull finished product from this pre-produced supply instead of waiting to begin the production process only after our order has been received. This will quicken the time to fulfil customer direct shipment orders as well as the time for us to receive shipments at our warehouse in Oregon. In addition to shortening our order cycle, these agreements also improve our inventory management and enhances our cash flow.\nWe utilized our bank line of credit for working capital to primarily fund inventory purchases during the pandemic and during the post-pandemic supply chain disruptions in order to ensure we had sufficient inventory on-hand to fulfill as many customer orders as possible. As those supply issues have subsided, we have been able to reduce our need to borrow against the line of credit. Because the Companys current inventory position is strong and we are not purchasing large amounts of new inventory, we have been able to direct much of our positive cash flow generated during our traditionally busy 3rd and 4th fiscal quarters to pay down the bank line of credit. The amounts borrowed under the line of credit have decreased to $1.26 million as of the end of the 4th quarter. As of early October 2023, the remaining $1.26 million borrowed against the line of credit has been repaid and all $10 million of the line is available. The Companys revenues and cash flow continue to be seasonal and highly variable, with the 3rd and 4th quarters of the fiscal year being much busier than the 1st and 2nd quarters due to the Companys current product offerings. Therefore, the availability of a line of credit is important to provide financial flexibility, and management expects to continue to maintain a credit line and draw against it as needed. We are studying the possibility of restructuring or replacing the existing line, as different credit arrangements may potentially provide the Company with greater financial flexibility.\nGross margin for the fiscal year was 22.6%, which is an improvement over the 21.9% gross margin from the prior year. Although our shipping and some raw-material costs have declined from their highs experienced in the last several years, we continue to work off our higher priced inventory acquired when these costs were at their highest. As we sell this high-cost inventory, our costs of goods sold declines. The high inflation rate which has prevailed over the last 24 months has also depressed our margins. Inflation affects our costs of goods more quickly than our ability to raise our selling prices. Any price hikes we introduce takes time to be accepted by our customers and consumers, and also have to be made more gradually in stages. The recent moderation of the inflation rate is allowing our increased selling prices to catch up to our higher costs of goods sold, which is improving our margins.\nIn fiscal 2021, we filed for arbitration against one of our former distributors asserting a breach of the distribution agreement. The liability arbitration hearing was held in December 2022. In February 2023, the arbitrator issued its decision in favor of the Company on the majority of all of our claims. A damages hearing was held in August 2023. Subsequent to the end of the fiscal year, we reached a favorable agreement with the defendant to settle the case. The settlement, which was received in early October, covers our substantial legal fees and some losses due to the breach. We are pleased to have settled the case and that we will no longer have to expend time and money pursuing this case. Our costs to pursue this action have been sizeable, particularly during fiscal 2023, which were included in our selling, general and administrative costs and reduced our income from operations accordingly. Even though the costs in this case were material, we believe it is critical to defend our valuable intellectual property and will take action against any future infringements of our patents, trademarks and contractual agreements.\nThe Board of Directors approved the adoption of an Advance Notice Policy for the nominations of directors by the Companys shareholders. This policy provides shareholders, directors and management with a precise framework for advance notice of nominations of directors by its shareholders. Among other things, the Advance Notice Policy fixes a deadline by which shareholders must submit nominations to the Company before any annual or special meeting of the shareholders, and sets forth the minimum information that a shareholder must include in such notice. The Advance Notice Policy became effective immediately upon its approval by the Board of Directors in May 2023. Common shareholders of the Company will be asked to approve the Advance Notice Policy at the next meeting of shareholders, which is expected to be held in early calendar 2024.\nThe Company has now reached its 70th year in operation. The business has changed and evolved dramatically since it was first incorporated in September 1953. Over the last several years, we have invested substantial amounts of capital into modernizing our organization and streamlining the business to focus on our strengths and core product lines. The resulting operational improvements have strengthened the Company and will allow us to more efficiently deploy our capital towards further growth. The closure of JCSC and conclusion of the expensive arbitration against its former distributor should reduce our operating cash requirements, and improve our operating margins, beginning in fiscal 2024.\nFiscal Years Ended August 31, 2023 and August 31, 2022\nFiscal 2023 sales totaled $54,289,303 compared to sales of $62,901,831 in fiscal 2022, which was a decrease of $8,612,528, or 14%.\nGross margin improved to 22.6% from fiscal 2022s 21.9%. Shipping and transportation expenses have declined from the much higher rates that prevailed in fiscal 2022. High inflation rates also moderated as fiscal 2023 progressed, which allowed us to increase our product sales prices to catch up to the earlier increases in our costs of goods.\nOperating expenses fell slightly by $7,065 to $11,816,441 from $11,823,506 in fiscal 2022. Selling, general and administrative expenses were largely flat at $3,973,055 compared to $4,008,166. Wages and employee benefits fell to $7,445,464 from $7,495,723 as the broad wage inflation continuing in most industries throughout the area and the United States was offset by a lower employee count during the current year. Depreciation and amortization increased to $397,922 from $319,617. Income from operations decreased to $430,684 from $1,969,553 due to the lower level of sales and the higher costs.\nOther items in fiscal 2023 totaled a loss of ($388,213) compared to a loss of ($388,553) in fiscal 2022. These items include interest expense on the bank line of credit of $458,463 in 2023 compared to $163,045 in fiscal 2022, with the increase due to a higher level of borrowing and a significantly higher interest rate in fiscal 2023. Gain on sale of property, plant and equipment was $70,250 in fiscal 2023 and $4,526 in fiscal 2022. Other items in fiscal 2022 also included a payment of $300,000 for the settlement of claims.\nIncluding other items, income before income taxes was $42,471 compared to income of $1,581,000 in fiscal 2022. Income tax expense for fiscal 2023 was $63,097 compared to expense of $416,877 in fiscal 2022. The Company calculates income tax expense based on combined federal and state rates that are currently in effect.\nNet loss in fiscal 2023 was ($20,626), or ($0.01) per share, compared to net income of $1,164,123, or $0.33 per common share, in fiscal 2022. The weighted number of shares outstanding were 3,495,342 in fiscal 2023 and 3,493,807 in fiscal 2022.\nPet, Fencing and Other - JCC\nSales for JCC in fiscal 2023 were $49,219,224 compared to sales of $57,915,828 in fiscal 2022, which represents a decline of $8,696,604, or 15%. Sales of JCC seasonal warmer weather outdoor products was negatively affected by the cold and wet weather that extended into April across much of the United States. This caused many of our customers, including big box retailers, to delay their orders of these products until later into spring. This caused reduction in our sales volume for the season and for the year.\nSales of many of our pet products have not yet recovered to their pandemic period levels. The entire pet supply industry is currently suffering through a downturn of consumer demand. As a result, many retailers currently have excess inventory which has alleviated their need to reorder product. During fiscal 2023, we also experienced production quality issues with a manufacturer on a particular product line. We suspended sales of the line until the problem was corrected, which has successfully been accomplished and sales of the line have resumed.\nThe following table shows a breakdown between the pet, fencing and other categories in this segment. The figures for fiscal 2022 have been revised from those previously reported to reflect the reclassification of certain bag products from pet to other.\nSales in Millions of Dollars Percent of Total Sales\nFiscal Year Pet Fencing Other Pet Fencing Other\n$ 11,217,733 $ 36,078,696 $ 1,922,795 23 % 73 % 4 %\n$ 16,856,059 $ 37,935,911 $ 3,123,858 29 % 66 % 5 %\nIndustrial Wood Products - Greenwood\nSales at Greenwood in fiscal 2023 were $2,605,926, which was almost unchanged from sales of $2,626,209 in fiscal 2022. Greenwoods sales were heavily impacted by the COVID-19 pandemic, as many of their products are sold to municipalities and larger transit operators which experienced lower rider demand and supply shortages of important components and skilled personnel. Since the end of the pandemic and many employees returning to offices, transit industry budgets have increased and demand for Greenwoods products is beginning to recover.\nManagement believes there are significant opportunities to increase Greenwoods sales by targeting new customers not only in the transportation industry, but also in other industries and sectors which Greenwood has not traditionally targeted, such as housing and construction. We have been seeking to add new traders to expand Greenwoods sales efforts, and a new trader was hired in September 2023.\nFor fiscal 2023, Greenwood had an operating loss of ($46,307) compared to operating income of $21,865 for fiscal 2022.\nSeed Processing and Sales - JCSC\nDuring fiscal 2023, the Board of Directors made the difficult decision to permanently close JCSC effective August 31, 2023. Sales for JCSC in fiscal 2023 were $2,464,153 compared to sales of $2,359,794 in fiscal 2022. JCSC had an operating loss of ($251,261) in fiscal 2023 compared to an operating loss of ($517,453) in fiscal 2022.\nCorporate - JC USA\nJC USA, the holding company that provides professional and administrative services for the wholly-owned operating subsidiaries had operating income of $962,459 in fiscal 2023 compared to income of $819,139 in fiscal 2022. The results of JC USA are inter-company transactions and are eliminated on consolidation.\nLIQUIDITY AND CAPITAL RESOURCES\nFiscal Year Ended August 31, 2023\nAs of August 31, 2023, the Company had working capital of $19,134,810 compared to working capital of $19,207,874 as of August 31, 2022. The largest change affecting working capital is a decrease in inventory of $2,293,265 to $18,339,048 from $20,632,313. Other changes in components of working capital include a decrease in cash of $400,767, a decrease in accounts receivable of $1,556,722, a decrease in prepaid expenses of $481,787, and a decrease in prepaid income taxes of $208,963. The decrease in cash is related to the repayment of funds borrowed against the bank line of credit. Prepaid expenses, which is mostly deposits paid for future inventory, declined as the Companys large current inventory position has reduced the need for additional inventory purchases in the near term.\nAccounts payable rose to $2,181,194 from $1,566,047 which is related to the timing of payments due to suppliers. Accrued liabilities increased by $257,154 to $2,113,193 from $1,856,039. Bank indebtedness, which is from the Companys line of credit and has primarily been used to acquire inventory, was $1,259,259 as of August 31, 2023 compared to $7,000,000 as of August 31, 2022. Deferred tax assets rose to $319,875 from $Nil.\nAs of August 31, 2023, accounts receivable and inventory represented 97% of current assets and 80% of total assets. As of August 31, 2022, accounts receivable and inventory represented 94% of current assets and 81% of total assets. Our customers continue to pay on-time, with almost all of our outstanding receivables classified as current.\nFor the fiscal year ended August 31, 2023, the accounts receivable collection period or DSO was 38 days compared to 42 days for the year ended August 31, 2022. Inventory turnover for the year ended August 31, 2023 was 169 days compared to 130 days for the year ended August 31, 2022.\nShort-term and Long-term Debt\nExternal sources of liquidity include a line of credit from U.S. Bank of $10 million, of which approximately $8.74 million was available as of August 31, 2023.\nBorrowing under the line of credit is secured by an assignment of accounts receivable and inventory. Interest was previously calculated solely on the one-month LIBOR rate plus 175 basis points. Beginning with the monthly interest payment due March 31, 2022, the Companys Bank line of credit agreement was revised to change the calculation of the interest rate from the one-month LIBOR rate to the one-month Secured Overnight Financing Rate (SOFR). Interest is now calculated based on the one-month SOFR plus 157 basis points, which as of August 31, 2023 was 6.88% (5.31% + 1.57%). The line of credit has certain financial covenants. The Company is in compliance with these covenants.\nSubsequent to the end of the year, the Company repaid the remaining balance of $1.26 million borrowed against the line of credit utilizing both cash flow and a portion of the cash received from the arbitration settlement.\nCurrent Working Capital Requirements\nIn October 2023, the Company received the cash payment under the arbitration settlement agreement with its former distributor. A portion of this payment was used to repay some of the amount borrowed under the Line of Credit, with the remainder held as working capital.\nBased on the Companys current working capital position, the anticipated reduction in cash needs due to the closure of JCSC, and the unused borrowing capacity under its current line of credit, the Company expects to have sufficient liquidity available to meet its working capital requirements for fiscal 2024.\nOTHER MATTERS\nContractual Obligations and Commercial Commitments\nThe Company currently has no material contractual obligations or commercial commitments other than to suppliers of products or services.\nInflation\nHistorically, inflation has not been a significant issue for the Company. However, beginning in fiscal 2021, a number of product costs increased substantially, including raw materials, energy, and transportation/logistical related costs.\nThese higher costs have negatively affected the Companys gross margins. Typically, the Company passes cost increases on to the customer, and is currently raising its product prices as much as the market will bear. Retailers are currently more receptive to such increases than in the past due to a mutual understanding of the current inflationary environment and the objective reasons for such. Since the ability of the Company to pass through all of the current increase in its product costs to its customers are somewhat limited and occur after such costs are first incurred, management expects that its gross margins will remain under pressure in fiscal 2023.\nThe increases in interest rates as a result of the higher level of inflation in the US economy experienced beginning in calendar 2021 and continuing through 2022 and 2023 has also had a negative effect on the Companys interest expense paid for its borrowing under its line of credit. The interest rate paid by the Company has increased from 1.83% as of November 30, 2021 to 6.88% as of August 31, 2023.\nEnvironmental, Social and Corporate Governance (ESG)\nJewett-Cameron endeavors to be a good steward and provide sustainable products with a positive impact. We strive to operate and grow in a way that honors our environment and relationships for the long term. This also aligns with one of our three value pillars: stewardship.\nEnvironmental\nFor our products, the goal is that 90% of materials can be recycled. Our suppliers are audited to strict commercial and fair practice standards, including our own supplier qualifications regarding facilities, capacity, labor practices, and environmental awareness. Packaging is designed to maximize recyclability and re-use and minimize non-recycled materials, and all waste materials in our own facilities are segregated to maximize recycling. Our facilities have replaced high energy consumption infrastructure with energy efficient HVAC and lighting during our recent remodel.\nActive products and designs utilize either recycled or non-petroleum-based plastics to enhance recycling and composting. This includes the recently introduced compostable dog waste bag, a plant-based product, that is less reliant on fossil fuels used in traditional plastic bags. We also dedicate a percentage of sales to support environmental cleanup efforts.\nSocial\nOur social responsibilities include cultural standards of operations and values which we establish in conjunction with our employees. We regularly provide employees with a corporate engagement survey to benchmark their engagement, satisfaction, and ideas for change. We support educational programs that build the future workforce through active participation in regional and statewide organizations, including the CTE/STEM Employer Coalition and assisting teachers to connect traditional school subjects to practical job site applications. The Company also actively participates in the local community, supported by a Corporate Charitable Giving Charter.\nGovernance\nAs a public company, our processes are outlined and governed by multiple regulations, including Sarbanes-Oxley. Our financial controls are mapped, executed, self-audited as well as regularly audited by outside experts as part of our annual process. We have established risk mitigations that allows for condensed reviews of risks and impacts with our systems in place. An IT Governance Committee aligns execution and security both for ourselves and also for parties with whom we communicate and do business.\nUyghur Forced Labor Prevention Act\nThe Uyghur Forced Labor Prevention Act (UFLPA) is a US Federal Law signed by President Biden in December 2021 which became effective on June 21, 2022. As enforced by U.S. Customs and Border Protection, the UFLPA prohibits any products that are made, mined, or manufactured, in part or in full, in Chinas Xinjiang Uyghur Autonomous Region to be imported into the United States, as they are presumed to have been made with forced labor. Any imports of such goods will be detained and seized by U.S. Customs unless the importer is able to prove that these goods have not been made with forced labor. The Company has ensured that each of its suppliers is in full compliance with the law and none of its products fall under the prohibited goods clause.\nCritical Accounting Policies\nManagement is required to make judgments, estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements, the disclosure of contingent assets and liabilities as of the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. On a regular basis, we evaluate our estimates and assumptions. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. Actual results may differ from these estimates under different assumptions or conditions.\nThe Company has not adopted any new accounting policies that would have a material impact on the consolidated financial statements, nor did it make changes to accounting policies. Management has discussed with the Audit Committee the development, selection and disclosure of accounting estimates used in the preparation of the consolidated financial statements.\nRecent Accounting Pronouncements\nManagement has reviewed the new accounting guidance and determined that there is not a material impact on our financial statements. ITEM 7A. Quantitative and Qualitative Disclosures About Market Risk\nInterest Rate Risk\nThe Company did not have any derivative financial instruments as of August 31, 2023, and the Company does not use derivative instruments for trading purposes.\nChanges in U.S. interest rates affect the interest earned on the Companys cash as well as interest paid on debt. The Company has a line of credit with an interest rate based on published rates that may fluctuate over time based on economic changes in the environment. The Company is subject to interest rate risk and could be subject to increased interest payments against any amounts borrowed against the line of credit if market interest rates fluctuate.\nForeign Currency Risk\nThe Company operates primarily in the United States. However, a relatively small amount of business is conducted in currencies other than U.S. dollars. Also, to the extent that the Company uses contract manufacturers in China, currency exchange rates can influence the Companys purchasing costs. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTAL DATA\nThe financial statements and notes thereto are attached hereto. The audit report of Davidson & Company, LLP Chartered Accountants is included herein immediately preceding the audited consolidated financial statements.\nAudited Consolidated Financial Statements: fiscal 2023 and 2022\nReport of Independent Registered Accounting Firm dated November 27, 2023 (Davidson & Company LLP, Vancouver, Canada, PCAOB ID# 731)\nConsolidated Balance Sheets\nBalance Sheets at August 31, 2023 and August 31, 2022\nConsolidated Statements of Operations\nFor the years ended August 31, 2023 and August 31,\nConsolidated Statements of Stockholders Equity\nFor the years ended August 31, 2023 and August 31,\nConsolidated Statements of Cash Flows\nFor the years ended August 31, 2023 and August 31,\nNotes to Financial Statements\nSchedule II: Valuation and Qualifying Accounts\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\nAUGUST 31, 2023\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Directors of\nJewett-Cameron Trading Company Ltd.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Jewett-Cameron Trading Company Ltd. (the Company), as of August 31, 2023 and 2022, and the related consolidated statements of operations, stockholders equity, and cash flows for the years ended August 31, 2023 and 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023 and 2022, and the results of its operations and its cash flows for the years ended August 31, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatements of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nCompleteness and accuracy of revenue\nAs described in Note 11 to the financial statements, the Company recognized revenue of $54,289,303 for the year ended August 31, 2023. As more fully described in Note 2 to the financial statements, the Company recognized revenue from the sale of industrial wood products, fencing, pet products, other specialty products and seed processing, handling and storage services. Product revenue is recognized when the products are shipped, title passes and the ultimate collection is reasonably assured. Service revenue is recognized when services have been performed and collection of the amounts is reasonably assured.\nThe principal considerations for our determination that the recognition of revenues is a critical audit matter are the volume of low value transactions and the significant value of total revenue recognized. This in turn lead to a high degree of auditor judgment, subjectivity, and effort in performing procedures to evaluate audit evidence for revenues recognized.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the financial statements. Our audit procedures included, among others:\n· Obtaining an understanding of the key controls associated with the Companys material revenue cycles.\n· Evaluating the appropriateness of managements assessment of revenue recognition criteria based on the Companys operations.\n· Performing substantive testing procedures over a sample of revenue entries to invoices, shipping documents, and cash receipts to ensure completeness, occurrence, accuracy and appropriate cut-off of revenue recognized.\n· Assessing if the Companys revenue recognition accounting policy is in accordance with US GAAP.\nWe have served as the Companys auditor since 1999.\n/s/ DAVIDSON & COMPANY LLP\nVancouver Canada Chartered Professional Accountants\nNovember 27, 2023\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(Expressed in U.S. Dollars)\nAS OF AUGUST 31\nASSETS\nCurrent assets\nCash and cash equivalents $ 83,696 $ 484,463\nAccounts receivable, net of allowance of $0 (August 31, 2022 - $0) 5,634,924 7,191,646\nInventory, net of allowance of $497,884 (August 31, 2022 - $800,000) (note 3) 18,339,048 20,632,313\nPrepaid expenses 630,788 1,112,575\nPrepaid income taxes - 208,963\nTotal current assets 24,688,456 29,629,960\nProperty, plant and equipment, net (note 4) 4,655,427 4,828,420\nIntangible assets, net (note 5) 134,845 33,358\nDeferred tax assets (Note 6) 319,875 24,998\nTotal assets $ 29,798,603 $ 34,516,736\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities\nAccounts payable $ 2,181,194 $ 1,566,047\nBank indebtedness (note 7) 1,259,259 7,000,000\nIncome taxes payable (note 6) 147,629 -\nAccrued liabilities 2,113,194 1,856,039\nTotal liabilities 5,701,276 10,422,086\nStockholders equity\nCapital stock (notes 8, 9)\nAuthorized\n21,567,564 common shares, no par value\n10,000,000 preferred shares, no par value\nIssued\n3,498,899 common shares (August 31, 2022 - 3,495,342) 825,468 824,629\nAdditional paid-in capital 765,055 742,591\nRetained earnings 22,506,804 22,527,430\nTotal stockholders equity 24,097,327 24,094,650\nTotal liabilities and stockholders equity $ 29,798,603 $ 34,516,736\nContingencies (Note 14)\nSubsequent events (Note 15)\nThe accompanying notes are an integral part of these consolidated financial statements.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Expressed in U.S. Dollars)\nYEARS ENDED AUGUST 31\nSALES $ 54,289,303 $ 62,901,831\nCOST OF SALES 42,042,178 49,108,772\nGROSS PROFIT 12,247,125 13,793,059\nOPERATING EXPENSES\nSelling, general and administrative 3,973,055 4,008,166\nDepreciation and amortization (notes 4, 5) 397,922 319,617\nWages and employee benefits 7,445,464 7,495,723\nTotal operating expenses 11,816,441 11,823,506\nIncome from operations 430,684 1,969,553\nOTHER ITEMS\nGain on sale of property, plant and equipment 70,250 4,526\nOther income (loss) (note 14) - (230,034 )\nInterest expense (458,463 ) (163,045 )\nTotal other items (388,213 ) (388,553 )\nIncome before income taxes 42,471 1,581,000\nIncome taxes (note 6)\nCurrent (63,097 ) (558,820 )\nDeferred recovery - 141,943\nNet (loss) income for the year $ (20,626 ) $ 1,164,123\nBasic (loss) earnings per common share $ (0.01 ) $ 0.33\nDiluted (loss) earnings per common share $ (0.01 ) $ 0.33\nWeighted average number of common shares outstanding:\nBasic 3,498,236 3,493,807\nDiluted 3,498,236 3,493,807\nThe accompanying notes are an integral part of these consolidated financial statements.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF STOCKHOLDERS' EQUITY\n(Expressed in U.S. Dollars)\nYEARS ENDED AUGUST 31\nCapital Stock\nNumber of Shares Amount Additional paid-in capital Retained earnings Total\nAugust 31, 2021 3,489,161 $ 823,171 $ 687,211 $ 21,363,307 $ 22,873,689\nShares issued pursuant to compensation plans (note 9) 6,181 1,458 55,380 - 56,838\nNet Income - - - 1,164,123 1,164,123\nAugust 31, 2022 3,495,342 $ 824,629 $ 742,591 $ 22,527,430 $ 24,094,650\nShares issued pursuant to compensation plans (note 9) 3,557 22,464 - 23,303\nNet Loss - - - (20,626 ) (20,626 )\nAugust 21, 2023 3,498,899 $ 825,468 $ 765,055 $ 22,506,804 $ 24,097,327\nThe accompanying notes are an integral part of these consolidated financial statements.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Expressed in U.S. Dollars)\nYEARS ENDED AUGUST 31\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet (loss) income for the year $ (20,626 ) $ 1,164,123\nItems not affecting cash:\nDepreciation and amortization 397,922 319,617\nStock-based compensation expense 23,303 56,838\nGain on sale of property, plant and equipment (70,250 ) (4,526 )\nDeferred income taxes (294,877 ) (141,943 )\nChanges in non-cash working capital items:\nDecrease (increase) in accounts receivable 1,556,722 (105,143 )\nDecrease (increase) in inventory 2,293,265 (6,240,948 )\nDecrease in prepaid expenses 481,787 1,193,245\nDecrease in prepaid income taxes 208,963 43,995\nIncrease in accounts payable and accrued liabilities 872,302 274,321\nIncrease in income taxes payable 147,629 -\nNet cash and cash equivalents provided by (used by) operating activities 5,596,140 (3,440,421 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nIncrease in intangible assets (102,500 ) (3,535 )\nProceeds on sale of property, plant and equipment 70,250 -\nPurchase of property, plant and equipment (223,916 ) (1,255,894 )\nNet cash and cash equivalents used in investing activities (256,166 ) (1,259,429 )\nCASH FLOWS FROM FINANCING ACTIVITIES\n(Repayment) proceeds from bank indebtedness (5,740,741 ) 4,000,000\nNet cash and cash equivalents provided by (used in) financing activities (5,740,741 ) 4,000,000\nNet (decrease) in cash and cash equivalents (400,767 ) (699,850 )\nCash and cash equivalents, beginning of year 484,463 1,184,313\nCash and cash equivalents, end of year $ 83,696 $ 484,463\nSupplemental disclosure with respect to cash flows (note 13)\nThe accompanying notes are an integral part of these consolidated financial statements\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n1. NATURE OF OPERATIONS\nJewett-Cameron Trading Company Ltd. was incorporated in British Columbia on July 8, 1987 as a holding company for Jewett-Cameron Lumber Corporation (JCLC), incorporated September 1953. Jewett-Cameron Trading Company, Ltd. acquired all the shares of JCLC through a stock-for-stock exchange on July 13, 1987, and at that time JCLC became a wholly owned subsidiary. Effective September 1, 2013, the Company reorganized certain of its subsidiaries. JCLCs name was changed to JC USA Inc. (JC USA), and a new subsidiary, Jewett-Cameron Company (JCC), was incorporated.\nJC USA has the following wholly owned subsidiaries incorporated under the laws of the State of Oregon: Jewett-Cameron Seed Company, (JCSC), incorporated October 2000, Greenwood Products, Inc. (Greenwood), incorporated February 2002, and JCC, incorporated September 2013. Jewett-Cameron Trading Company Ltd. and its subsidiaries (the Company) have no significant assets in Canada.\nThe Company, through its subsidiaries, operates out of facilities located in North Plains, Oregon. JCCs business consists of the manufacturing and distribution of pet, fencing and other products, wholesale distribution to home centers, other retailers, on-line as well as direct to end consumers located primarily in the United States. Greenwood is a processor and distributor of industrial wood and other specialty building products principally to customers in the marine and transportation industries in the United States. JCSC is a processor and distributor of agricultural seeds in the United States. JC USA provides professional and administrative services, including accounting and credit services, to its subsidiary companies.\nDuring the year ended August 31, 2023, the Company announced that it will be closing its JCSC subsidiary effective August 31, 2023. JCSC is currently in the process of selling the remaining seed inventory and equipment in preparation of being wound-up.\nA number of external factors can adversely affect general workforces, economies and financial markets globally. Examples include, but are not limited to, the COVID-19 global pandemic and political conflict in other regions. It is not possible for the Company to predict the duration or magnitude of adverse results of such external factors and their effect on the Companys business, financial condition, or ability to raise funds.\n2. SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThese consolidated financial statements have been prepared in conformity with generally accepted accounting principles of the United States of America (GAAP) and pursuant to the rules and regulations of the United States Securities and Exchange Commission (SEC).\nBasis of consolidation\nThese consolidated financial statements include the accounts of the Company and its current wholly owned subsidiaries, JC USA, JCC, JCSC, and Greenwood, all of which are incorporated under the laws of Oregon, U.S.A.\nAll inter-company balances and transactions have been eliminated upon consolidation.\nEstimates\nThe preparation of consolidated financial statements in conformity with generally accepted accounting principles in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates incorporated into the Companys consolidated financial statements include the estimated useful lives for depreciable and amortizable assets, the estimated allowances for doubtful accounts receivable and inventory obsolescence, possible product liability and possible product returns, and litigation contingencies and claims. Actual results could differ from those estimates.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n2. SIGNIFICANT ACCOUNTING POLICIES (contd…)\nCash and cash equivalents\nThe Company considers all highly liquid instruments with a maturity of three months or less at the time of issuance to be cash equivalents. At August 31, 2023, cash held was $83,696 compared to $448,708 at August 31, 2022. At August 31, 2023, cash equivalents were $Nil 0 compared to $35,755 at August 31, 2022.\nAccounts receivable\nTrade and other accounts receivable are reported at face value less any provisions for uncollectible accounts considered necessary. Accounts receivable primarily includes trade receivables from customers. The Company estimates doubtful accounts on an item-by-item basis and includes over aged accounts as part of allowance for doubtful accounts, which are generally ones that are ninety days or greater overdue.\nThe Company extends credit to domestic customers and offers discounts for early payment. When extension of credit is not advisable, the Company relies on either prepayment or a letter of credit.\nInventory\nInventory, which consists primarily of finished goods, is recorded at the lower of cost, based on the average cost method, and market. Market is defined as net realizable value. An allowance for potential non-saleable inventory due to excess stock or obsolescence is based upon a review of inventory components.\nProperty, plant and equipment\nProperty, plant and equipment are recorded at cost less accumulated depreciation. The Company provides for depreciation over the estimated life of each asset on a straight-line basis over the following periods:\nSchedule of property plant and equipment useful life\nOffice equipment 3-7 years\nWarehouse equipment 2-10 years\nBuildings 5-30 years\nIntangibles\nThe Companys intangible assets have a finite life and are recorded at cost. Amortization is calculated using the straight-line method over the remaining life of the asset. The intangible assets are reviewed annually for impairment.\nAsset retirement obligations\nThe Company records the fair value of an asset retirement obligation as a liability in the period in which it incurs a legal obligation associated with the retirement of tangible long-lived assets that result from the acquisition, construction, development, and normal use of the long-lived assets. The Company also records a corresponding asset which is amortized over the life of the asset. Subsequent to the initial measurement of the asset retirement obligation, the obligation is adjusted at the end of each period to reflect the passage of time (accretion expense) and changes in the estimated future cash flows underlying the obligation (asset retirement cost). The Company does not have any significant asset retirement obligations.\nImpairment of long-lived assets and long-lived assets to be disposed of\nLong-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to future net cash flows expected to be generated by the asset. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of are reported at the lower of the carrying amount and the fair value less costs to sell.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n2. SIGNIFICANT ACCOUNTING POLICIES (contd…)\nCurrency and foreign exchange\nThese financial statements are expressed in U.S. dollars which is also the functional currency of the Company and its subsidiaries as the Company's operations are primarily based in the United States.\nThe Company does not have non-monetary or monetary assets and liabilities that are in a currency other than the U.S. dollar. Any statement of operations transactions in a foreign currency are translated at rates that approximate those in effect at the time of translation. Gains and losses from translation of foreign currency transactions into U.S. dollars are included in current results of operations.\nEarnings (loss) per share\nBasic earnings (loss) per common share is computed by dividing net income (loss) available to common shareholders by the weighted average number of common shares outstanding in the period. Diluted earnings (loss) per common share takes into consideration common shares outstanding (computed under basic earnings per share) and potentially dilutive common shares.\nThe (loss) earnings per share data for the fiscal years ended August 31, 2023 and 2022 are as follows:\nSchedule of earnings per share, basic and diluted\nNet (loss) income $ (20,626 ) $ 1,164,123\nBasic weighted average number of common shares outstanding 3,498,236 3,493,807\nEffect of dilutive securities\nStock options\n- -\nDiluted weighted average number of common shares outstanding 3,498,236 3,493,807\nBasic and diluted (loss) earnings per common share $ (0.01 ) $ 0.33\nComprehensive income (loss)\nThe Company has no items of other comprehensive income or loss in any year presented. Therefore, net income or loss presented in the consolidated statements of operations equals comprehensive income or loss.\nStock-based compensation\nThe Company accounts for stock-based compensation in accordance with ASC 718, Compensation - Stock Compensation (ASC 718). Equity awards are accounted for at their fair value which is measured on the grant date for stock-settled awards. For full-value awards, fair value is equal to the underlying value of the stock that have time vesting conditions.\nStock-based compensation to employees are recognized as compensation expense in the financial statements based on their fair values. That expense is recognized over the period during which an employee is required to provide services in exchange for the award. Stock-based compensation expense recognized during the period is based on the value of the portion of share-based payment awards that is ultimately expected to vest during the period, or in the period of grant for awards that vest immediately without any future service condition. For awards that vest over time, previously recognized compensation cost is reversed if the service or performance conditions are not satisfied and the award is forfeited. The Company also grants employees and non-employees restricted stock awards (RSAs). The fair value of the RSAs is determined using the fair value of the common shares on the date of the grant. Forfeitures are accounted for as they occur.\nThe Company has not adopted a stock option plan and has not granted any stock options.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n2. SIGNIFICANT ACCOUNTING POLICIES (contd…)\nFinancial instruments\nThe Company uses the following methods and assumptions to estimate the fair value of each class of financial instruments for which it is practicable to estimate such values:\nCash and cash equivalents - the carrying amount approximates fair value because the amounts consist of cash held at a bank and cash held in short term investment accounts.\nAccounts receivable - the carrying amounts approximate fair value due to the short-term nature and historical collectability.\nBank indebtedness - the carrying amount approximates fair value due to the short-term nature of the obligations.\nAccounts payable and accrued liabilities - the carrying amount approximates fair value due to the short-term nature of the obligations.\nThe estimated fair values of the Company's financial instruments as of August 31, 2023 and 2022 follows:\nSchedule of fair value, financial instruments\nCarrying Fair Carrying Fair\nAmount Value Amount Value\nCash and cash equivalents $ 83,696 $ 83,696 $ 484,463 $ 484,463\nAccounts receivable, net of allowance 5,634,924 5,634,924 7,191,646 7,191,646\nAccounts payable and accrued liabilities 4,294,388 4,294,388 3,422,086 3,422,086\nBank Indebtedness 1,259,259 1,259,259 7,000,000 7,000,000\nThe following table presents information about the assets that are measured at fair value on a recurring basis as of August 31, 2023 and indicates the fair value hierarchy of the valuation techniques the Company utilized to determine such fair value. In general, fair values determined by Level 1 inputs utilize quoted prices (unadjusted) in active markets for identical assets. Fair values determined by Level 2 inputs utilize data points that are observable such as quoted prices, interest rates and yield curves. Fair values determined by Level 3 inputs are unobservable data points for the asset or liability, and included situations where there is little, if any, market activity for the asset:\nSchedule of fair value, assets measured on recurring basis\nAugust 31,\nQuoted Prices\nin Active\nMarkets\n(Level 1) Significant\nOther\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nAssets:\nCash and cash equivalents $ 83,696 $ 83,696 $ - $ -\nThe fair values of cash and cash equivalents are measured at amortized cost.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n2. SIGNIFICANT ACCOUNTING POLICIES (contd…)\nIncome taxes\nA deferred tax asset or liability is recorded for all temporary differences between financial and tax reporting and net operating loss carry forwards. Deferred tax expense (benefit) results from the net change during the year of deferred tax assets and liabilities.\nDeferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nShipping and handling costs\nThe Company incurs certain expenses related to preparing, packaging and shipping its products to its customers, mainly third-party transportation fees. All costs related to these activities are included as a component of cost of sales in the consolidated statements of operations. All costs billed to the customer are included as sales in the consolidated statements of operations.\nRevenue recognition\nThe Company recognizes revenue from the sales of lumber, building supply products, industrial wood products, specialty metal products, and other specialty products and tools, when the products are shipped, title passes, and the ultimate collection is reasonably assured. Revenue from the Company's seed operations is generated from seed processing, handling and storage services provided to seed growers, and by the sales of seed products. Revenue from the provision of these services and products is recognized when the services have been performed, products sold and collection of the amounts is reasonably assured.\nRecent Accounting Pronouncements\nThe Company has evaluated all recently issued, but not yet effective, accounting pronouncements and determined that it does not believe that any, if currently adopted, would have a material effect on the Companys financial statements.\n3. INVENTORY\nA summary of inventory as of August 31, 2023 and 2022 is as follows:\nSchedule of inventory\nWood products and metal products $ 18,326,243 $ 20,130,063\nAgricultural seed products 12,805 502,250\nInventory net $ 18,339,048 $ 20,632,313\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n4. PROPERTY, PLANT AND EQUIPMENT\nA summary of property, plant, and equipment as of August 31, 2023 and 2022 is as follows:\nSchedule of property, plant, and equipment\nOffice equipment $ 668,260 $ 636,501\nWarehouse equipment 1,556,424 1,504,867\nBuildings 6,209,162 6,168,080\nLand 559,065 559,065\nProperty plant and equipment gross 8,992,911 8,868,513\nAccumulated depreciation (4,337,484 ) (4,040,093 )\nNet book value $ 4,655,427 $ 4,828,420\nIn the event that facts and circumstances indicate that the carrying amount of an asset may not be recoverable and an estimate of future discounted cash flows is less than the carrying amount of the asset, an impairment loss will be recognized. Management's estimates of revenues, operating expenses, and operating capital are subject to certain risks and uncertainties which may affect the recoverability of the Company's investments in its assets. Although management has made its best estimate of these factors based on current conditions, it is possible that changes could occur which could adversely affect management's estimate of the net cash flow expected to be generated from its operations.\n5. INTANGIBLE ASSETS\nA summary of intangible assets as of August 31, 2023 and 2022 follows:\nSchedule of intangible assets\nIntangible assets 153,195 50,695\nAccumulated amortization (18,350 ) (17,337 )\nNet book value $ 134,845 $ 33,358\n6. INCOME TAXES\nA reconciliation of the provision for income taxes with amounts determined by applying the statutory U.S. federal income tax rate to income before income taxes is as follows:\nSchedule of components of income tax expense\nComputed tax at the federal statutory rate $ 294,398 $ 391,259\nState taxes, net of federal benefit 62,193 172,074\nDepreciation - -\nInventory reserve - -\nOther 1,382 (4,513 )\nProvision for income taxes $ 357,973 $ 558,820\nCurrent income taxes $ 357,973 $ 558,820\nDeferred income taxes (294,877 ) (141,943 )\nIncome tax expense benefit net $ 63,096 $ 416,877\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n6. INCOME TAXES (contd…)\nDeferred income tax asset as of August 31, 2023 of $319,875 (August 31, 2022 - $24,998) reflects the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes.\nSchedule of deferred tax assets and liabilities\nDeferred tax assets:\nAllowance for inventory $ 496,067 $ 273,618\nAllowance for bad debts - -\nDifference between book and tax depreciation (86,895 ) (150,942 )\nTotal deferred tax assets 409,172 122,676\nValuation allowance - -\nNet deferred tax assets 409,172 122,676\nNet deferred tax liability (89,297 ) (97,678 )\nCombined net deferred tax asset (liability) $ 319,875 $ 24,998\n7. BANK INDEBTEDNESS\nBank indebtedness under the Companys line of credit as of August 31, 2023 was $1,259,259 (August 31, 2022 - $7,000,000). During fiscal year ended August 31, 2023, the line of credit was temporarily increased from $10,000,000 to $12,000,000 through August 31, 2023. Effective September 1, 2023, the line of credit returns to the original $10,000,000 limit.\nBank indebtedness, when it exists, is secured by an assignment of accounts receivable and inventory. Interest was previously calculated solely on the one-month LIBOR rate plus 175 basis points. Beginning with the monthly interest payment due March 31, 2022, the Companys Bank Line of Credit agreement was revised to change the calculation of the interest rate from the one-month LIBOR rate to the one-month Secured Overnight Financing Rate (SOFR). Interest is now calculated based on the one-month SOFR plus 157 basis points, which as of August 31, 2023 was 6.88% (5.31% + 1.57%).\nIn conjunction with the temporary increase in the available borrowing limit, additional financial covenants have been added to the line of credit. These new covenants require the Company to maintain certain leverage ratios of borrowed funds to Earnings Before Interest, Taxes, Depreciation and Amortization (EBITDA). The Company is currently in compliance with these covenants.\n8. CAPITAL STOCK\nCommon stock\nHolders of common stock are entitled to one vote for each share held. There are no restrictions that limit the Company's ability to pay dividends on its common stock. The Company has not declared any dividends since incorporation.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n9. RESTRICTED SHARE PLAN\nThe Company has a Restricted Share Plan (the Plan) as approved by shareholders on February 8, 2019. The Plan allows the Company to grant, from time to time, restricted shares as compensation to directors, officers, employees and consultants of the Company. The Restricted Shares are subject to restrictions, including the period under which the shares will be restricted (the Restricted Period) and subject to forfeiture which is determined by the Board at the time of the grant. The recipient of Restricted Shares is entitled to all of the rights of a shareholder, including the right to vote such shares and the right to receive any dividends, except that the shares granted under the Plan are nontransferable during the Restricted Period.\nThe maximum number of Common Shares reserved for issuance under the Plan will not exceed 1% of the then issued and outstanding number of Common Shares at the time of the grant. As of August 31, 2023, the maximum number of shares available to be issued under the Plan was 17,251.\nThe Board of Directors has set the compensation for non-executive Directors under the Plan at 25 common shares for each quarter of service. The cumulative amount of shares earned each fiscal year to be granted shortly after the close of that fiscal year. Non-executive Directors also received a one-time initial grant of 225 common shares which were issued in December 2020.\nDuring the year ended August 31, 2022, the Company made three issuances of common shares under the Plan. Under the first issuance, a total of 2,603 common shares were issued to Officers, Directors and Employees at a deemed price of $10.70 per share. 2,015 of these shares were issued to Officers and Directors without a Restricted Period under the Companys S-8 Registration Statement filed on December 7, 2020. The remaining 588 shares were issued to Employees and have a three-year Restricted Period. Under the second issuance, 2,500 common shares were issued to the Companys Chief Executive Officer at a deemed price of $7.80 per share. These 2,500 common shares were issued without a Restricted Period under the Companys S-8 Registration Statement. 1,078 shares were issued at a deemed price of $8.80 per share as the second years allocation of shares to employees who were granted shares in a three-year vesting period beginning in fiscal 2021.\nDuring the year ended August 31, 2023, 3,557 common shares were issued under the Plan at an average price of $6.55 per share. 500 shares were granted to Directors without a Restricted Period under the Companys S-8 Registration Statement. 3,057 common shares were granted to Officers and Employees and have a three-year Restricted Period.\n10. PENSION AND PROFIT-SHARING PLANS\nThe Company has a deferred compensation 401(k) plan for all employees with at least 6 months of service pending a monthly enrollment time. The plan allows for a non-elective discretionary contribution plus matching employee contributions up to a specific limit. The percentages of contribution remain the discretion of the Board and are reviewed with management annually. For the years ended August 31, 2023 and 2022 the 401(k) compensation expense was $344,336 and $516,991, respectively.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n11. SEGMENT INFORMATION\nThe Company has three principal reportable segments. These reportable segments were determined based on the nature of the products offered. Reportable segments are defined as components of an enterprise about which separate financial information is available that is evaluated regularly by the chief operating decision maker in deciding how to allocate resources and in assessing performance.\nThe Company evaluates performance based on several factors, of which the primary financial measure is business segment income before taxes. The following tables show the operations of the Company's reportable segments.\nFollowing is a summary of segmented information for the years ended August 31:\nSchedule of segment reporting information\nSales to unaffiliated customers:\nIndustrial wood products $ 2,605,926 $ 2,626,209\nPet, Fencing and Other 49,219,224 57,915,828\nSeed processing and sales 2,464,153 2,359,794\n$ 54,289,303 $ 62,901,831\nIncome (loss) before income taxes:\nIndustrial wood products $ (46,307 ) $ 21,865\nPet, Fencing and Other (622,420 ) 1,257,449\nSeed processing and sales (251,261 ) (517,453 )\nCorporate and administrative 962,459 819,139\n$ 42,471 $ 1,581,000\nIdentifiable assets:\nIndustrial wood products $ 814,059 $ 1,012,019\nPet, Fencing and Other 23,520,055 27,152,959\nSeed processing and sales 146,466 471,003\nCorporate and administrative 5,318,023 5,880,755\n$ 29,798,603 $ 34,516,736\nDepreciation and amortization:\nIndustrial wood products $ - $ -\nPet, Fencing and Other 66,243 39,200\nSeed processing and sales 6,120 6,347\nCorporate and administrative 325,559 274,070\n$ 397,922 $ 319,617\nCapital expenditures:\nIndustrial wood products $ - $ -\nPet, Fencing and Other - -\nSeed processing and sales - -\nCorporate and administrative 223,916 1,259,429\n$ 223,916 $ 1,259,429\nThe following table lists sales made by the Company to customers which were in excess of 10% of total sales for the years ended August 31:\nSchedule of sales in excess of ten percent of total sales\nSales $ 34,393,590 $ 33,010,410\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n(Expressed in U.S. Dollars)\n11. SEGMENT INFORMATION (contd…)\nThe Company conducts business primarily in the United States, but also has limited amounts of sales in foreign countries. The following table lists sales by country for the fiscal years ended August 31:\nSchedule of sales by country\nUnited States $ 52,732,300 $ 60,521,611\nCanada 838,824 1,151,901\nMexico/Latin America/Caribbean 472,931 900,941\nEurope 150,083 94,630\nAsia/Pacific 95,165 232,748\nTotal sales by country $ 54,289,303 $ 62,901,831\nAll of the Companys significant identifiable assets were located in the United States as of August 31, 2023 and 2022.\n12. CONCENTRATIONS\nCredit risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk consist primarily of cash and cash equivalents and accounts receivable. The Company places its cash with a high quality financial institution. The Company has concentrations of credit risk with respect to accounts receivable as large amounts of its accounts receivable are concentrated geographically in the United States amongst a small number of customers.\nAt August 31, 2023, two customers accounted for accounts receivable greater than 10% of total accounts receivable for a total of 75%. At August 31, 2022, three customers accounted for accounts receivable greater than 10% of accounts receivable for a total of 64%. The Company controls credit risk through credit approvals, credit limits, credit insurance and monitoring procedures. The Company performs credit evaluations of its commercial customers but generally does not require collateral to support accounts receivable.\nVolume of business\nThe Company has concentrations in the volume of purchases it conducts with its suppliers. For the fiscal year ended August 31, 2023, there were three suppliers which each accounted for greater than 10% of total purchases, and the aggregate purchases amounted to $23,397,156. For the fiscal year ended August 31, 2022, there were two suppliers which each accounted for greater than 10% of total purchases, and the aggregate purchases amounted to $26,817,775.\n13. SUPPLEMENTAL DISCLOSURE WITH RESPECT TO CASH FLOWS\nCertain cash payments for the years ended August 31, 2023 and 2022 are summarized as follows:\nSchedule of cash flow, supplemental disclosures\nCash paid during the year for:\nInterest $ 459,617 $ 163,045\nIncome taxes $ - $ 227,946\nThere were no non-cash investing or financing activities during the years presented.\n14. CONTINGENCIES\na) In fiscal 2021, the Company initiated arbitration against a former distributor asserting a breach of the distribution agreement and seeking damages. The liability arbitration hearing was held in December 2022. In February 2023, the arbitrator issued its decision and ruled in favor of the Company on the majority of its claims. Subsequent to year end in September 2023, the Company settled the arbitration for a cash payment of $2,450,000 which was received by the Company in October 2023.\nb) An association of District Attorneys in the State of California contacted the Company in regards to their investigation into the environmental labeling and marketing of dog waste bags. The District Attorneys claim that labeling certain dog waste bags, including the Company's, as biodegradable or compostable is misleading due to the lack of industrial composting facilities that accept dog waste. During the year ended August 31, 2022, the Company entered into a final settlement agreement which resulted in a $300,000 fine to the Company paid over a four-month period with no admission of guilt by the Company.\nc) The Company was one of three named defendants in a Civil Action in Pennsylvania. The matter was an action seeking compensation for personal injuries and is based on theories of product liability as to the Company. The matter arises out of a dog allegedly escaping from the Companys kennel product and causing personal injuries to three individuals. The Companys applicable liability insurer provided the defense covering the Companys legal fees and costs. During the fiscal year ended August 31, 2022, the case was settled within the Companys insurance policy limits with no admission of guilt by the Company, and there were no additional costs incurred.\n15. SUBSEQUENT EVENTS\na) The remaining $1,260,000 borrowed against the line of credit has been repaid.\nJEWETT-CAMERON TRADING COMPANY LTD. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENT SCHEDULE\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS\nAUGUST 31, 2023\nAdditions Deductions\nBalance at Charged to Credited to Deductions\nBeginning Costs and Costs and From Balance at\nof Year Expenses Expenses Reserves End of Year\nAugust 31, 2023\nAllowance deducted from related\nBalance sheet account:\nInventory $ 800,000 $ 48,177 $ - $ 350,293 $ 497,884\nAccounts Receivable $ - $ - $ - $ - $ -\nAugust 31, 2022\nAllowance deducted from related\nBalance sheet account:\nInventory $ 250,000 $ 557,946 $ - $ 7,946 $ 800,000\nAccounts Receivable $ - $ - $ - $ - $ - ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\n--- No Disclosure Necessary --- ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nManagement has evaluated, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, the effectiveness of our disclosure controls and procedures as of the end of the period covered by this report as defined in Rule 13a-15(e) or Rule 15d-15(e) under the Securities Exchange Act of 1934 (the Exchange Act). Based on that evaluation our Chief Executive Officer and Chief Financial Officer have concluded that as of the end of the period covered by this report our disclosure controls and procedures are effective in ensuring that information required to be disclosed in our Exchange Act reports is (1) recorded, processed, summarized, and reported in a timely manner, and (2) accumulated and communicated to our management including our Chief Executive Officer and Principal Financial Officer as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f). Under supervision and with the participation of our management including our Chief Executive Officer and Chief Financial Officer we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on our evaluation our management concluded that our internal control over financial reporting was effective as of August 31, 2023.\nThis Annual Report on Form 10-K does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit us to provide only managements report in this Annual Report on Form 10-K.\nChanges in Internal Controls\nThere has been no change in our internal control over financial reporting that occurred during our most recent fiscal year that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\n--- No Disclosure Necessary ---\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\n--- No Disclosure Necessary ---\nPART III ITEM 10. Directors, Executive Officers AND CORPORATE GOVERNANCE\nTable No. 4 lists as of November 27, 2023 the names of the Directors of the Company. The Directors will serve until the next Annual Shareholders Meeting or until a successor is duly elected, unless the office is vacated in accordance with the Articles/By-Laws of the Company. All of the Directors are citizens of the United States.\nTable No. 4\nDirectors\nDate First\nElected\nName Age Or Appointed\nGeoff Guilfoy (1) (2) August 2019\nCharles Hopewell February 2017\nSarah Johnson (1) (2) (3) July 2017\nChris Karlin (1) (2) December 2018\nChad Summers November 2022\nMichelle Walker (3) July 2021\nMike Henningsen (3) December 2022\n(1) Member of Audit Committee.\n(2) Member of Compensation Committee.\n(3) Member of Governance Committee.\nTable No. 5 lists, as of November 27, 2023, the names of the executive officers of the Company. The executive officers serve at the pleasure of the Board of Directors. All executive officers are residents and citizens of the United States and spend 100% of their time on the affairs of the Company.\nTable No. 5\nExecutive Officers\nDate of\nName Position Age Board Approval\nChad Summers Chief Executive Officer January 2022\nMitch Van Domelen Chief Financial Officer and\nCorporate Secretary January 2022\nFamily Relationships/Other Relationships/Arrangements\nThere are no arrangements or understandings between any two or more directors or executive officers, pursuant to which he/she was selected as a director or executive officer. There are no family relationships, material arrangements or understandings between any two or more directors or executive officers.\nWritten Management Agreements\n--- No Disclosure Necessary ---\nBusiness Experience\nChad Summers originally joined the Company in October 2019. He was appointed President in May 2021, CEO in January 2022, and was named a Director in November 2022. His prior experience includes participation in start-up ventures in both product and service industries and has a strong background in leadership, consulting, and support. He co-owned and led an international lumber brokering business similar to Jewett-Camerons Greenwood division. This experience provided him the opportunity to oversee and actively manage suppliers in China and throughout SE Asia. He also built a successful consulting practice dedicated to growing manufacturers in association with a west coast regional accounting firm which allowed him the opportunity to establish a deep network of manufacturers, professional services and support connections regionally.\nMitch Van Domelen is a Certified Public Accountant who joined Jewett-Cameron in July 2017 as Controller. He was appointed Chief Financial Officer in January 2022, and was appointed Corporate Secretary in December 2022. Mr. Van Domelen has extensive experience in finance and financial reporting for both public and private companies. Prior to joining Jewett-Cameron, he served as Controller for a national beverage brand where he managed the financial processes and full-cycle accounting for the company and its nine brewpub locations. From 2007 to 2012 he worked in public accounting at a large regional public accounting firm in Lake Oswego, Oregon, auditing both public and private companies. From 2005 to 2007, he served as a Sarbanes-Oxley (SOX) compliance consultant for SEC registrants in the Portland metro area, testing their compliance in both US and International regions. He holds a bachelor's degree in Business Administration from Southern Oregon University. He is a licensed CPA in the State of Oregon and is a member of the Oregon Society of CPA's\nCharles E. Hopewell has over 35 years of experience in senior management positions with manufacturing companies, including serving as CEO of Sunset Manufacturing Inc, Neilsen Manufacturing Inc, and COO of Aluminite Corporation. In his past positions as COO or CEO, he has been involved in all organizational aspects, including sales and marketing, plant and equipment, personnel, and finance. He received a degree in Finance from the University of Oregon and an MBA from Willamette Universitys Atkinson Graduate School of Management. Mr. Hopewell has also worked extensively in local and statewide workforce policy and K-12 CTE education at a Board level.\nGeoff Guilfoy is a management consultant with over 41 years of experience, including over 21 years in management consulting, 17 years in State Government management, and an additional 4 years in the private and non-profit sectors. Prior to founding Lumen Leaders LLC in 2013, he was the partner in charge of the management consulting group at AKT LLP, a regional CPA and business consulting firm. For 28 years, he was an Executive Professor at Willamette Universitys Atkinson Graduate School of Management teaching courses on management consulting, nonprofit management, and government. He currently serves on the Board of Directors of Medical Teams International. He is also a former National Board Member of the Institute of Management Consultants USA and a former Board Member of CoServe International. He has a Bachelor of Science, Management (Accounting) from San Jose State University and an MBA from Willamette University.\nMike Henningsen has extensive experience in operations and logistics. From 1999 to 2018, Mr. Henningsen was Chairman & President of Henningsen Cold Storage, a fourth-generation family business founded in 1923 headquartered in Hillsboro Oregon with logistics facilities in six states. During this period, he also held a number of positions with the International Association of Refrigerated Warehouses (IARW), including Chairman in 2008-2009. Prior to joining the family business, he served as a business banker with Wells Fargo. Mr. Henningsen received both his Bachelors of Science in Business Management and his MBA from the University of Oregon. He currently serves on the Boards of Parr Lumber Company, Willamette Windows, and the Southwest Washington Chapter of the American Red Cross. He also serves as an advisor to the Professional Benefit Services Board in Salem and on the Board of Trustees of Pacific University in Forest Grove, Oregon and the Columbia River Maritime Museum in Astoria, Oregon.\nSarah Johnson has significant experience in supply chain management and best practices, including the planning and implementation of improvements to both the manufacturing and supply processes. She is currently Global Raw Materials Planning Manager at Columbia Sportswear. Previously, she served as the Global Buying Manager and as a Business Process Analyst and Senior Global Buyer at Columbia, which included working with International vendors, principally in Asia and Canada. Ms. Johnson is a graduate of Gonzaga University in Spokane, Washington.\nChris Karlin is a retired banker who began his banking career in 1980. He served as the Senior Vice President and Manager of U.S. Banks National Government Banking Division from 2005 to 2014 and was responsible for the strategic vision of the group. He joined U.S. Bank in 1993 as a Relationship Manager in the National Corporate Division. He has also served as a Regional Manager for the Treasury Management Division in Minneapolis. Prior to joining U.S. Bank, Chris was with Mitsubishi Bank, serving as Group Manager in its Chicago and Columbus offices, focusing on public finance and large corporate markets. Chris is a past Chair of the Oregon Bankers Association (OBA), serves as the Adviser for its Leadership Program and serves on the Board of the OBA's Education Foundation. Chris has degrees in Economics and Finance from Fort Hays State University (Kansas) and a Master of International Management from the Thunderbird School of International Management (Arizona).\nMichelle Walker is a business strategist in Portland with experience in brand development, organizational alignment, and building consumer brands, including both B2B and B2C businesses. Previously, she was CEO of Sock It to Me, Inc., a sock and underwear brand. She also held several senior positions with PepsiCo, including Senior Director and GM of the Lays and Ruffles brands where her responsibility included business strategy, brand positioning, product development, and sales strategy. Prior to joining PepsiCo, she was a Senior Consultant in Valuation Services with PricewaterhouseCoopers where she led business analysis and valuations for both business clients and Real Estate Investment Trusts. She received her bachelors degree in Economics and Psychology from the University of California, San Diego, and an MBA from the University of Texas McComb School of Business.\nInvolvement in Certain Legal Proceedings\nThere have been no events during the last five years that are material to an evaluation of the ability or integrity of any director, person nominated to become a director, executive officer, or control person including:\n1) Any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2) Any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations/other minor offenses);\n3) Being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently enjoining, barring, suspending or otherwise limiting his/her involvement in any type of business, securities or banking activities; and\n4) Being found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nAudit Committee Financial Expert\nGeoff Guilfoy serves as the Audit Committee Chair and has been designated as the financial expert given his extensive background in oversight, financial budgeting and reporting and strategic consultation. Mr. Guilfoy is independent as that term is used in Section 240.14a-101 under the Exchange Act and as defined under NSADAQ Rule 4200(a)(15).\nAudit Committees\nThe Company has an Audit Committee, which recommends to the board of directors the engagement of the independent auditors of the Company and reviews with the independent auditors the scope and results of the Companys audits, the Companys internal accounting controls, and the professional services furnished by the independent auditors to the Company. The board of directors adopted a new Audit Committee Charter in fiscal 2023.\nThe Audit Committee is directly responsible for the appointment, compensation and oversight of auditors; and concerns about accounting and auditing matters; and has the authority to engage independent counsel and other outside advisors.\nThe Audit Committee may delegate to one or more designated members of the Audit Committee the authority to grant pre-approvals required by this policy / procedure. The decisions of any Audit Committee member to whom authority is delegated to pre-approve a service shall be presented to the Audit Committee at its next scheduled meeting.\nIn accordance with the requirements of the U.S. Sarbanes-Oxley Act of 2002 and rules issued by the Securities and Exchange Commission, the Company introduced a procedure for the review and pre-approval of any services performed by Davidson & Company, LLP Chartered Accountants, including audit services, audit related services, tax services and other services. The procedure requires that all proposed engagements of Davidson & Company, LLP Chartered Accountants for audit and permitted non-audit services are submitted to the Audit Committee for approval prior to the beginning of any such services.\nThe current members of the Audit Committee are Geoff Guilfoy (Chair), Sarah Johnson, and Chris Karlin. All members of the Audit Committee are independent within the meaning of the regulations from the SEC regarding audit committee membership. The Audit Committee met five times in fiscal 2023 and four times in fiscal 2022.\nCompensation Committee\nThe Company has a Compensation Committee which recommends to the Board of Directors on compensation matters for the Company, including compensation plans and benefits of executive officers and directors. This includes determining the compensation for senior management, the size and recipients of bonuses, and equity incentive plans, including the grant of options and other awards. The Committee will also recommend executive appointments and complete annual performance evaluations of the Chief Executive Officer and Chief Financial Officer. The Committee also advises on succession plan matters and has the authority to retain outside advisors or consultants.\nThe Committee operates under a written charter, which requires the Committee to consist of at least three members appointed by the Board. The members shall be independent directors, and the Board will designate one member as Chairman of the Committee. The Committee shall meet a minimum of one time per year.\nCurrent members of the Compensation Committee are Chris Karlin (Chair), Sarah Johnson, and Geoff Guilfoy. The Committee met three times in fiscal 2023 and three times in fiscal 2022.\nGovernance Committee\nThe Company has a Governance Committee which devises and recommends to the Board of Directors on governance matters for the Company, including corporate governance policies and the composition and policies of the Board of Directors. The Committee is also tasked with monitoring compliance with these policies once adopted. These include policies that reflect best practices for sound governance, conflict of interest, and environmental and social (ESG) policies. The Committee is also responsible for policies related to Board Director service, including evaluating the current composition of the Board including the necessary diversity, experience, skills and judgment to meet the current and future needs of the Company, and the form and amounts of Director compensation. It will make recommendations for committee members and chairs and evaluate each individual director for continued service. If it is determined that additional directors are required, the Committee will identify, recruit and interview candidates and make nominations of qualified candidates to the Board\nThe Committee operates under a written charter, which requires the Committee to consist of at least two independent members appointed by the Board, with one member designated as Chairman of the Committee. A member appointed by the Board shall be a member of the Committee until replaced by the Board and/or until his or her resignation. The Committee may request or engage a non-Independent Director only for purposes of advice/counsel and such non-Independent Director will not have any voting rights within the Committee.\nCurrent members of the Governance Committee are Michelle Walker (Chair), Sarah Johnson, and Mike Henningsen. The Committee met eight times in fiscal 2023 and three times in fiscal 2022.\nCompliance with Section 16(a) of the Exchange Act\nThe Company has reviewed the Forms 3 and 4 furnished to the Company under Rule 16a-3(e) of the Securities Exchange Act during the most recent fiscal year and the Forms 5 furnished to the Company with respect to its most recent fiscal year, as well as any written representations received by the Company from persons required to file such forms. Management has determined there was one Form 3 report for a newly appointed Director that failed to be filed on a timely basis, as required by Section 16(a) of the Securities Exchange Act during the most recent fiscal year.\nCode of Ethics\nThe Company has a written code of ethics that meets the United States' Sarbanes-Oxley standards. The code is posted on the Companys website.\nLimitation of Liability and Indemnification\nOur certificate of incorporation limits the personal liability of our board members for breaches by them of their fiduciary duties. Our bylaws also require us to indemnify our directors and officers to the fullest extent permitted by British Columbia law. British Columbia law provides that directors of a corporation will not be personally liable for monetary damages for breach of their fiduciary duties as directors, except liability for any of the following acts:\na. any breach of their duty of loyalty to the Company or its stockholders;\nb. acts or omissions not in good faith or which involve intentional misconduct or a knowing violation of law;\nc. unlawful payments of dividends or unlawful stock repurchases, redemptions or other distributions; and\nd. any transaction from which the director derived an improper personal benefit.\nSuch limitation of liability may not apply to liabilities arising under the federal securities laws and does not affect the availability of equitable remedies such as injunctive relief or rescission. In addition, British Columbia laws also permit us to secure insurance on behalf of any officer, director, employee or other agent for any liability arising out of his or her actions in such capacity, regardless of whether indemnification would be permitted under British Columbia law. We currently maintain liability insurance for our directors and executive officers.\nAmong other things, this will provide for indemnification of our directors and executive officers for certain expenses (including attorneys fees), judgments, fines and settlement amounts incurred by any such person in any action or proceeding, including any action by or in the right of the Company, arising out of such persons services as a director or executive officer of ours, any subsidiary of ours or any other company or enterprise to which the person provided services at our request. We believe that these provisions and agreements are necessary to attract and retain qualified persons as directors and executive officers.\nInsofar as indemnification for liabilities arising under the Securities Act may be permitted to our directors, officers, and controlling persons pursuant to the foregoing provisions, or otherwise, we have been advised that in the opinion of the SEC such indemnification is against public policy as expressed in the Securities Act and is, therefore, unenforceable. ITEM 11. EXECUTIVE COMPENSATION\nTable No. 6 details compensation paid or accrued for fiscal 2023, 2022 and 2021 for the Companys chief executive officer, each of the Companys most highly compensated executive officers who were serving as executive officers at the end of the most recently completed financial year and whose total salary and bonus exceeds $100,000 per year.\nLong-term Compensation\nAwards Payouts\nAnnual Compensation\nSecurities\nName and\nOther Restricted Underlying\nAll\nPrincipal Fiscal\nAnnual Stock Options/ LTIP Other\nPosition Year Salary Bonus Comp. Awards SARS (#) Payouts Comp. (1)\nChad Summers,\nChief Executive Officer\n$ 295,833 $ 70,000 $ - $ - $ - $ - $ 20,500\n$ 266,667 $ 78,100 $ - $ 19,500 $ - $ - $ 23,100\nCharles Hopewell,\nFormer Chief Executive Officer (2)\n$ 120,781 $ 60,000 $ - $ - $ - $ - $ 29,600\n$ 266,666 $ 87,384 $ - $ - $ - $ - $ 29,600\nMitch Van Domelen,\nChief Financial Officer\nand Corporate Secretary\n$ 170,833 $ 51,250 $ - $ - $ - $ - $ 20,500\n$ 151,667 $ 45,500 $ - $ - $ - $ - $ 19,037\nMichael Nasser,\nFormer Corporate Secretary\n$ 198,000 $ 75,000 $ - $ - $ - $ - $ 14,400\n$ 198,000 $ 75,000 $ - $ - $ - $ - $ 14,400\n(1) All Other Compensation relates to the Companys 401K contributions for each individual.\n(2) Mr. Hopewell served as Chief Executive Officer until December 31, 2021. The amounts included for fiscal 2022 are for his service as an Officer through December 31, 2021.\nThe Company has the same 401(k) Plan for executives as for all employees: it is a dollar-for-dollar match on 10% of eligible compensation, and a non-elective discretionary contribution based on the first $45,000 of eligible compensation.\nOther than participation in the Companys Restricted Share Plan and 401(k), no funds were set aside or accrued during fiscal 2023 or 2022 to provide pension, retirement or similar benefits for directors or executive officers.\nThe Company has no plans or arrangements with respect to remuneration received or that may be received by executive officers of the Company to compensate such executive officers in the event of termination of employment (as a result of resignation, retirement, change of control) or a change of responsibilities following a change of control.\nNo executive officer or director received other compensation in excess of the lesser of $25,000 or 10% of such officer's cash compensation, and all executive officers or directors as a group did not receive other compensation, which exceeded $25,000 times the number of persons in the group or 10% of the compensation.\nExcept for our Restricted Stock Plan and 401(k) Plan, we have no material stock option plan, bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers. Officers received bonuses, which were determined and approved by the Board of Directors.\nThe Board approved a non-qualified Profit-Sharing plan for employees who did not receive any other form of commission or bonus. The plan is formula based proportionately balancing years of service and compensation. The Board has year-to-year responsibility to review the amount funded to the program and the overall program will be based on a percentage of operating or pre-tax profit.\nRestricted Share Plan\nThe Company has a Restricted Share Plan which allows the Company to grant restricted shares as compensation to directors, officers, employees and consultants of the Company. The Restricted Shares are subject to restrictions, including the period under which the shares will be restricted and subject to forfeiture which is determined by the Board at the time of the grant. The recipient of Restricted Shares is entitled to all of the rights of a shareholder, including the right to vote such shares and the right to receive any dividends, except that the shares granted under the Plan are nontransferable during the Restricted Period.\nThe maximum number of Common Shares reserved for issuance under the Plan will not exceed 1% of the then issued and outstanding number of Common Shares at the time of the grant. During the year ended August 31, 2023, the Company issued 3,557 common shares (fiscal 2022 - 6,181 common shares) under the Restricted Share Plan. Of the 3,557 common shares, 500 of these shares were granted to Directors without a Restricted Period under the Companys S-8 Registration Statement, and the remaining 3,057 common shares were granted to Officers and Employees and have a three-year Restricted Period.\n401(k) Plan\nThe Company has a 401(k) Plan which allows for a non-elective discretionary contribution based on the first $45,000 of eligible compensation. Beginning in fiscal 2019, the Company reduced the percentage amount of the discretionary contribution while adding a matching contribution, which is designed to encourage employees to participate with their own contributions. For the years ended August 31, 2023 and 2022 the 401(k) compensation expense was $344,336 and $516,991, respectively. The decline in the expense in fiscal 2023 from 2022 is due to the Board of Directors approving a lower discretionary contribution for fiscal 2023 than in the prior year.\nThe contributions for Chad Summers for fiscal years 2023 and 2022 were $20,500 and $23,100, and the contributions for Mitch Van Domelen for fiscal 2023 and 2022 were $20,500 and $19,037. The contribution for Charles Hopewell for fiscal 2022 was $29,600. The contribution for Michael Nasser for fiscal 2022 was $14,400. There are no un-funded liabilities.\nStock Options\nThe Company formerly had a stock option program under which stock options to purchase securities from the Company could be granted to directors and employees of the Company on terms and conditions acceptable to the regulatory authorities of Canada, notably the Ontario Securities Commission and the British Columbia Securities Commission.\nDuring the year ended August 31, 2020, the Companys Board of Directors approved the termination of the stock option program. No options were granted in fiscal 2023 or 2022, and the Company had no stock options outstanding as of August 31, 2023 and August 31, 2022.\nLong-Term Incentive Plan / Defined Benefit or Actuarial Plan\nDuring fiscal 2023 the Company had no Long-Term Incentive Plan (LTIP) and no LTIP awards were made. Also, during fiscal 2023 the Company had no Defined Benefit or Actuarial Plan.\nCompensation Committee Interlocks and Insider Participation\nThe Companys Compensation Committee consists of 3 independent directors. None of the members of the Compensation Committee served as an officer or employee of the Company in the prior fiscal year.\nNo board of director member and none of our executive officers have a relationship that would constitute an interlocking relationship with executive officers and directors of another entity.\nEmployment Contracts\nTermination of Employment and Change-in-Control Arrangements\n--- No Disclosure Necessary ---\nDirector Compensation\nThe Company began compensating directors at the rate of $1,000 per month as of January 1, 2019. Directors are also entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of the Board of Directors. The Board of Directors may award special remuneration to any director undertaking any special services on behalf of the Company other than services ordinarily required of a director.\nDuring fiscal 2023 the following cash payments were paid to directors for their service as directors: Charles Hopewell $18,000 (2022 - $8,500); Chad Summers $Nil (2022 - $Nil); Geoff Guilfoy $12,000 (2022 - $12,000); Mike Henningsen $8,000 (2022 - $Nil); Sarah Johnson $12,000 (2022 -$12,000); Chris Karlin $12,000 (2022 - $12,000); Mike Nasser $8,000 (2022 - $Nil); Michelle Walker $12,000 (2022 - $12,000).\nIn November 2020, the Board of Directors approved additional compensation for Directors other than Named Executive Officer members under the Companys Restricted Share Plan. Directors will be granted 25 common shares for each fiscal quarter of service, with the amount earned during the year to be distributed by the end of the first fiscal quarter of the following fiscal year. Directors also received a one-time grant of 225 common shares each upon the approval by the Board, with such shares distributed in December 2020. The value of the 225 shares granted to each non-executive Director was $1,980.\nIn fiscal 2023, the Company issued 500 common shares (2022 - 400 common shares) to directors under the RSA Plan. The value of the shares issued was $2,620 (2022 - $4,240).\nExecutive Officer Compensation\nThe Companys Compensation Committee provides advice and recommendations to the Board of Directors on compensation and benefits for executive officers. As in prior years all judgments regarding executive compensation for fiscal 2023 and 2022 were based primarily upon our assessment of each executive officers performance and contribution towards enhancing long-term shareowner value. We rely upon judgment and not upon rigid guidelines or formulas or short-term changes in our stock price in determining the amount and mix of compensation for each executive officer. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe Company is a publicly owned corporation. It is not controlled directly or indirectly by another corporation or any foreign government.\nTable No. 7 shows directors, executive officers, and 5% shareholders who beneficially owned the Companys common stock and the amount of the Companys voting stock owned as of November 27, 2023.\nTable No. 7.\nShareholdings of Directors, Executive Officers,\nand 5% Shareholders\nName Amount of Beneficial\nand Address of and Voting Percent of\nClass of Beneficial Owner Ownership Class (1)\nCommon Oregon Community Foundation 1,048,534 29.97 %\nCommon Charles E. Hopewell 21,288 0.61 %\nCommon Chad Summers 5,378 0.15 %\nCommon Mitch Van Domelen 1,616 0.05 %\nCommon Geoff Guilfoy 0.01 %\nCommon Sarah Johnson 0.01 %\nCommon Chris Karlin 0.01 %\nCommon Michelle Walker <0.01 %\nCommon Mike Henningsen Nil N/A\nTotal Directors, Executive Officers, and 5% Shareholders 1,078,291 30.82 %\n(1) Based on 3,498,899 shares outstanding as of November 27, 2023 and shares granted under the RSA Plan for which the individual has voting control or are issuable within the next 60 days. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThere have been no transactions or proposed transactions, which have materially affected or will materially affect the Company in which any director, executive officer, or beneficial holder of more than 5% of the outstanding common stock, or any of their respective relatives, spouses, associates or affiliates has had or will have any direct or material indirect interest. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe audit committee is directly responsible for the appointment, compensation and oversight of auditors; and has the authority and the funding to engage independent counsel and other outside advisors.\nThe audit committee may delegate to one or more designated members of the audit committee the authority to grant pre-approvals required by this policy and procedure. The decisions of any audit committee member to whom authority is delegated to pre-approve a service shall be presented to the audit committee at its next meeting.\nIn accordance with the requirements of the U.S. Sarbanes-Oxley Act of 2002 and rules issued by the Securities and Exchange Commission, we introduced a procedure for the review and pre-approval of any services performed by Davidson & Company, LLP Chartered Accountants, including audit services, audit related services, tax services and other services. The procedure requires that all proposed engagements of Davidson & Company, LLP Chartered Accountants for audit and permitted non-audit services are submitted to the finance and audit committee for approval prior to the beginning of any such services.\nFees, including reimbursements for expenses and for professional services rendered by Davidson & Company, LLP Chartered Accountants to the Company were:\nPrincipal Accountant Fiscal Year\nFees and Services\nAudit fees $ 90,000 $ 90,000\nTax fees 10,238 10,500\nAll other fees (1) 30,000 24,750\nTotal $ 132,238 $ 125,250\n(1) FY 2023:\n$10,000 to review the Q1 Form 10-Q\n$10,000 to review the Q2 Form 10-Q\n$10,000 to review the Q3 Form 10-Q\nFY 2022:\n$8,250 to review the Q1 Form 10-Q\n$8,250 to review the Q2 Form 10-Q\n$8,250 to review the Q3 Form 10-Q\nPART III ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(A) Financial Statements and Schedules:\n(B) Exhibits:\nIncorporated by Reference\nFiled or\nFurnished\nNo.\nExhibit Description\nForm\nDate Filed\nNumber\nHerewith\n3.1\nAmended and Restated Articles of Incorporation of Jewett-Cameron Lumber Corporation\n10-Q\n1/13/2014\n3.1\n3.2\nArticles of Incorporation of Jewett-Cameron Company.\n10-Q\n1/13/2014\n3.2\n10.1\nPolicy for the Recovery of Erroneously Awarded Executive Compensation as adopted on November 17, 2023\nX\nSubsidiaries of the Registrant: Refer to page 4 of this Form 10-K\nX\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act, Chad Summers\nX\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act, Mitch Van Domelen\nX\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C., 1350 (Section 906 of the Sarbanes-Oxley Act), Chad Summers\nX\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C., 1350 (Section 906 of the Sarbanes-Oxley Act), Mitch Van Domelen\nX\n101.INS\nXBRL Instance Document\nX\n101.SCH\nXBRL Taxonomy Extension Schema Document\nX\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\nX\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nX\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURE PAGE\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJewett-Cameron Trading Company Ltd.\nRegistrant\nNovember 28, By: /s/ Chad Summers\nChad Summers,\nChief Executive Officer and Director\nNovember 28, 2023 By: /s/ Mitch Van Domelen\nMitch Van Domelen,\nChief Financial Officer and\nCorporate Secretary\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNovember 28, 2023 By: /s/ Charles Hopewell\nCharles Hopewell,\nChairman and Director\nNovember 28, 2023 By: /s/ Geoff Guilfoy\nGeoff Guilfoy,\nDirector\nNovember 28, 2023 By: /s/ Mike Henningsen\nMike Henningsen,\nDirector\nNovember 28, 2023 By: /s/ Sarah Johnson\nSarah Johnson,\nDirector\nNovember 28, 2023 By: /s/ Chris Karlin\nChris Karlin,\nDirector\nNovember 28, 2023 By: /s/ Michelle Walker\nMichelle Walker,\nDirector"
}