{
    "cik": "889353",
    "company": "James Maritime Holdings Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-22",
    "period_of_report": "2022-12-31",
    "sic": "7200",
    "state_of_inc": "DE",
    "state_location": "UT",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/889353/0001096906-23-002268-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/889353/000109690623002268/jmtm_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/889353/0001096906-23-002268.txt",
    "filename": "889353_10K_2022_0001096906-23-002268.htm",
    "content": "Item 1. Business.\nOverview\nJames Maritime Holdings Inc., a Nevada corporation (James Maritime) conducts substantially all of the Companys business through its subsidiaries, its majority-owned subsidiary, Gladiator Solutions Inc. (Gladiator), and its wholly owned subsidiary United Security Specialists Inc. (USS) (James Maritime, Gladiator and USS shall be referred to collectively as the Company). Gladiator produces revenues through the distribution of personal protective products, primarily through mail-in orders to customers or via e-commerce sales generated through their website. USS provides professional security personnel enhanced by smartphone-based security applications. Both Gladiator and USS are based in California.\nOur Company\nJames Maritime has a long history operating in the U.S. public markets. The Company was originally incorporated under the laws of the State of Delaware on March 18, 1992 as Out Takes, Inc. Through Los Alamos Energy, LLC, the Company operated a waste gas electricity plant in Los Alamos, California, which was acquired from American Cogenics in 1996. Due to uncertainties arising from PG&Es bankruptcy, Los Alamos Energy elected to terminate its contract with PG&E, and instead entered into a Participating Generator Agreement with the California Independent System Operator (ISO). Despite its best efforts to adjust to the turbulent California energy markets, the Company was unable to sustain its operations and shut its power plant down in November 2001 because it did not have capital available for the plant maintenance that was required for continued operations.\nIn 2002, because the power plant was inoperable, management began searching for potential merger and combination opportunities, with no success. After the power industry somewhat stabilized in California, the Company entered into a new power purchase agreement with PG&E and attempted to recommence operations. In order to recommence power operations, the Company had to service and refurbish the Los Alamos Energy power generation equipment, and to pay current its obligations with Nicksons Machines amongst other creditors. In order to meet these obligations, the Company attempted to enter into an informal reorganization plan to creditors which, was ultimately unsuccessful, and it became clear that the Company would not be able to move forward in the recommencement of its operations.\nIn June of 2007 the Company filed a Notice of termination of their SEC registration on Form 15 in order to restructure its operations.\nBetween 2007 and 2014 the Company undertook the process of divesting itself of assets in order to pay down creditors, unwinding contracts and reorganizing its business. This process culminated on September 14, 2014, when Lance Hall, the sole officer and director of the Company, and majority interest owner and managing member of Los Alamos Energy, LLC, a California Limited Liability Company (Releasor), entered into a Debt Settlement Agreement with the Company to settle all outstanding debts and obligations of the Company owed to the Releasor or its assigns. The agreement also memorialized a termination and recission agreement which was signed, implemented and all terms of the rescission were completed on March 31, 2013, which effectively terminated and cancelled all ties and obligations to Los Alamos Energy, LLC previously agreed to in the purchase and sale agreement dated August 31, 1998. As part of the agreement Mr. Hall received $25,000 and 300,000 post-split common restricted shares of the Company (issued March 31, 2015), valued at $36,000 giving him control of the Company.\nOn September 18, 2014 Mr. Hall appointed Mr. Masayuki Tsuda, Ms. Kazuyo Horigane as directors, Kip Eardley was appointed to serve as Director, President and CEO of the Company and Mr. Halls resignation was accepted. In September of 2014, the three members of the Board of Directors funded the ongoing cleanup expenses and facilitated a search for synergistic or complementary corporate teaming partners that might be a candidate for a cooperative business combination. After the initial advance, it soon became clear to the Directors that the Companys expenses were too high and likely unsustainable unless they were immediately reduced.\nShortly thereafter, the board of directors voted to redomicile the Company from Delaware to Nevada in order to reduce annual expenses. In conjunction with the redomicile, the Company also effectuated a reverse split of its capital stock and on January 23, 2015, a company named James Maritime Holdings, Inc. was incorporated in the State of Nevada. On February 23, 2015, Out-Takes, Inc. merged with James Maritime Holdings, Inc., with Out-Takes being the surviving company resulting in a redomicile and change of the Company name to James Maritime Holdings, Inc.\nAfter changing its name and re-domiciling to Nevada, the Company began to pursue a growth strategy through merger and acquisition. After vetting numerous merger candidates, the Company eventually entered into a share exchange agreement with Sweet Hemp Alabama in 2019. Sweet Hemp Alabama was engaged in the sale of hemp products through vending machines and other means of distribution.\nIn 2020, it became clear that the Sweet Hemp Alabama share exchange should not be closed because Sweet Hemp could not meet their closing obligations, so the Company began to unwind the contract. Majority voting control of the Company was changed again in March of 2020 when shares were issued to consultants who were hired by the Company to help identify top tier merger candidates as potential acquisition candidates.\nAfter a renewed search process, on December 13, 2021, the Company entered into a share exchange agreement with Gladiator Solutions, Inc. and certain shareholders of Gladiator, and the Company acquired a majority of the issued and outstanding capital stock of Gladiator in exchange for a new issuance of Company common stock to the Gladiator shareholders.\nOn June 11, 2022, the Company entered into a share exchange agreement with United Security Specialists, Inc. and the shareholders of USS, and the Company acquired all of the issued and outstanding capital stock of USS in exchange for a new issuance of Company common stock.\nThe Company continues to aggressively pursue a growth by acquisition model and is currently identifying other potentially attractive M&A candidates in the private security and personal protective equipment industries, as well as in other business verticals that management deems to be of strategic importance.\nOur Business\nAs mentioned above, the Company is currently pursuing an aggressive growth strategy through M&A through strategic acquisition in the private security, personnel protective equipment and defense industries. Through our subsidiaries, James Maritime Holdings, Inc. is well positioned to be at the forefront of personal protective products, private security and government contracting.\nThe strategic acquisition of Gladiator Solutions, Inc. made us a leading personal protective product and technology company with an established line of trusted body armor, ballistic plates and ballistic materials. The timing for this acquisition was well timed to take advantage of an expansion in demand for these products as a result of the recent fighting in the Ukraine and our efforts to supply our allies with lifesaving personal protective equipment. By exporting our products during this critical time, we are able to boost sales and brand recognition for the Gladiator line of ballistics plates while also expanding revenues for additional strategic acquisitions in the defense space.\nShortly after closing our transaction with Gladiator, the Company entered into an agreement to acquire United Security Specialists, Inc., a leading private security company with licenses in California and key guard service contracts for armed and unarmed security services. USS is a recognized industry leader in this rapidly growing market, and this acquisition positions well for potentially uncertain times ahead where security and protective services will be increasingly shifted onto the private security industry. As this segment of the market continues to expand, we will be able to leverage the Gladiator product line for any contracts that require armed security with ballistic plates, or whenever our private security clients have security teams that require ballistic plates.\nWe hope to continue this trend as we expand into other security industry verticals as we identify additional acquisition candidates with disruptive, transformative or high technology defense systems and products that we can market to our existing client based at an affordable cost. We will continue to identify acquisition candidates with existing or developmental technologies for unmanned systems, space and satellite communications, electronic warfare and Command, Control, Communication, Computing, Combat, Intelligence Surveillance and Reconnaissance (C5ISR) Systems. Increasingly complicated compliance requirements and capital requirements will ensure that the barriers to entry in this space remain high, and we anticipate that upcoming requirements like Cyber Security Maturity Model Certification will force small businesses out of this space and away from defense contracting because they will not be able to justify the time and capital required to bid on government contracts. Moreover, the challenges with hiring quality guards, and the costs of insurance and inflation will continue to force a consolidation in the private security industry as poorly run security companies are forced out of the business.\nIndustry Background\nIn 2022, the U.S. increased its National Security Budget by 5.6% to $782,000,000,000 for Fiscal Year 2022 and approved $813,300,000,000 for Fiscal Year 2023 representing an additional 4%. In May 2022, the Additional Ukraine Supplemental Appropriations Act, 2022, was approved providing an additional $40,000,000,000 to help support the Ukraine. Meanwhile, according to a research study published to Globe Newswire by The Insight Partners1, the homeland security market is expected to grow in size from a value of $188,990,000,000 in 2022 to $275,500,000,000 by 2028 representing a compound annual growth rate of 6.5%.\nManagement for the Company believes that the best way to capture this growing market is by aggressively expanding our operations through acquisition.\nAbout Gladiator Solutions, Inc.\nGladiator Solutions Inc. was originally developed by Law Enforcement and Military Personnel with one simple idea…to ensure the highest level of safety and comfort, at an affordable price. Our key emphasis is to provide our customers with lighter, safer and more affordable solutions that have greater ballistic capability. Our full line of hard armor plates, tactical ballistic plate carriers, soft armor inserts and vests, helmets, shields, and other ballistic products and accessories incorporate the latest materials and technology to ensure maximum protection and performance.\n_______________________________\n1 https://www.theinsightpartners.com/reports/homeland-security-market\nGladiator is an original equipment manufacturer (OEM) of personal protective systems. Whether for local law enforcement, federal and state agencies or the military, our High-Performance Polyethylene (HPPE) and hybrid UHMWP/Ceramic armor provides the highest level of protection at the lightest weight.\nGladiator products are leading the way with ultimate protection, extreme comfort, minimal weight products at unsurpassed value.\nGladiator products are tested and certified in accordance with protocols developed by the National Institute of Justice, US Military Specification and European Ballistics Standards.\nGladiator proudly employs retired Law Enforcement and Military personnel across virtually all functional areas within the Gladiator organization including Sales & Marketing, Distribution, Operations, Product Development/Innovation and Tactical Training.\nWhat Sets Gladiator Apart?\nWe offer top quality solutions for Federal, State and Local Law Enforcement agencies, First Responders, National Armed forces, and Independent Security Contractors.\nUnsurpassed Quality & Value\nOur products provide extreme lightweight, incredible comfort, maximum strength solutions at affordable prices, without compromising performance, durability or quality.\nRound Dispersion Technology (RDT)\nOur ballistic plates absorb the round rather than deflecting/spalling like steel or fracturing like Ceramic. RDT spreads the kinetic energy delivered by the round from the point of impact to the surrounding area, diffusing the forces of impact over a larger area and dispersing the force of the round impact.\nTesting Protocol\nTo ensure the highest quality solutions, we age, test and certify our NIJ & Special Threat plates to and beyond certification standards. This enables Gladiator to warranty our plates to 10 years vs. the industry standard 5 years. While most testing is conducted with the widest spread for impact points (to reduce the kinetic energy absorbed by the armor material),we target the smallest area possible with the highest concentration of kinetic energy in a localized area of impact, providing Gladiator with the confidence that we are providing the highest strength to weight ratio solution to our customers.\nMaterials & Composition\nOur products are manufactured from high strength, high durability materials. The performance of these materials enables Gladiator to provide a 10-year warranty. While other products tend to break down over time, our products are manufactured from Polyethylene and Ceramic materials, providing a long and unsurpassed service life.\nCompliance\nWe conduct our sales in accordance with Department of Justice (DOJ), the Commerce Department and the Department of State ruled governing all export controls including the International Traffic in Arms Regulation (ITAR).\nCustomer Satisfaction\nOur customer service is industry leading, delivering products within 4-6 weeks of order and providing timely updates throughout the production process.\nGladiators Capabilities\nIn addition to providing the highest quality ballistic protection, Gladiator also offers a full arrangement of tactical outfitting and equipment from some of the most respected brands in the industry.\nUniform Apparel Military and Law Enforcement\n·\nLE Duty and Patrol Uniforms\n·\nLE Under Cover Apparel\n·\nMilitary Field Uniforms\n·\nUniform Footwear\n·\nHats, Ball Caps and Belts\n·\nEmbroidery and Screen Printing\nDuty Gear Military and Law Enforcement\n·\nArmor Carriers (hard & soft)\n·\nChest Rigs\n·\nPouches; ammunition, radio, medical, admin\n·\nPacks and Bags\n·\nDuty Belts and War Belts\n·\nHolsters, up to Level III retention, light & laser compatible\nMedical Gear\n·\nIFAK and First AID kits and Products\n·\nField Trauma Kits and Products\n·\nMedical Supplies and Equipment\nOptical Enhancement Devices\n·\nNight Vision Goggles\n·\nNight Vision Scopes\n·\nIR Devices\nAbout United Security Specialists\nUSS Mission\nThe mission of USS is to recruit right, train right, and respond early. Our clients should expect day-to-day quality, consistency, and professionalism. Our security personnel are more experienced, better supervised, and are dedicated to the highest level of work.\nUSS History\nUSS was built on ethics and integrity. Kyle and Henry founded this company in 2017 when they discovered a number of industry practices that were neither ethical nor acceptable. Since both of them had been around in this industry for decades, starting USS was an exciting endeavor that had allowed them to utilize and combine their years of experience with their solid work ethic and integrity. We value every client that has partnered with us, and we work to establish a solid relationship with our team. It is the strong relationship bonds that help our company continue to grow and to serve more valued partners.\nOur Guards\nWe have highly trained and committed professionals from law enforcement, military, and security veterans communities who are all specializing in providing one thing: on site, visible protection. We take pride in delivering the highest level of trust to our clients; therefore, we have a robust qualifying process to ensure all our team members are not just qualified but also enthusiastic and professional.\nOur Services\nWe pride ourselves in providing the most reliable protection in the security guard industry. With over 10 years of experience, we have proven to be unshakable and trustworthy. To enhance our service, we implement the latest technology into our process. With our mobile app provided by SilverTrac, our guards are able to check in, make reports and take photos in real time as they patrol.\nUSS will also focus on adding services which customize real-time remote monitoring enhanced by artificial intelligence with timely in person security response.\nUSS services are grouped into three main categories:\n1) On Site Protection\n2) Mobile Patrol\n3) Event Security\n___________________________________________________________________________________\nOn Site Protection\nAs a trusted provider of security specialists in the Bay Area, we understand the importance of reliable, professional and courteous security service, especially when it involves on-site protection at your establishment. Regardless of the scale of your need, from a single guard at the reception area to deploying multiple teams of officers for warehouse protection, USS will provide your organization with a solution that fits for you and your team.\nStarting with our risk assessment framework, our expertise is in efficiently and effectively developing solutions that match different combinations of business environments and their specific security needs.\n___________________________________________________________________________________\nMobile Patrol\nHaving security specialists check in on your property on a scheduled route is a prevalent approach for many businesses that do not require a constant on-site presence. Our risk assessment team will help determine the most appropriate time frame and frequency of the patrolling route. Our licensed security specialists will carry out all of the inspection procedures designed specifically for your site according to plan. All activities are updated through our proprietary real-time reporting and location-tracking technology. We pride ourselves in utilizing the latest technology to enhance our services. With our mobile app provided by SilverTrac, our guards are able to check in, file incident reports and take photos in real time as they patrol.\n___________________________________________________________________________________\nEvent Security\nUSS has an outstanding track record as a top tier event security partner. We have solid experience with security and crowd control at major concerts, outdoors events and convention center programs. Our specialists are well-trained for large events so they can easily identify potential threats and mitigate them to avoid interruptions and disturbances. With USS as your partner, you can focus on the event agenda knowing that your employees and guests are safe, litigation risk is reduced, and your event will go off without a hitch.\n___________________________________________________________________________________\nOur Competitive Strengths\nOur competitive edge in the security industry lies in our in-field support and quality control through responsiveness to customers, investment in field, our supervisors and our administrative support. For guard services, this allows us to minimize the #1 strategic risk for our industry, which is litigation risk. Another competitive advantage that we have is our access to a pipeline of highly professional, military-trained and experienced personnel for our high-end clients facing significant threats such as synagogues and schools.\nIn the protective products industry, our strength is the unsurpassed quality and value of our products. Not only are our products light weight and comfortable, but we are able to provide the maximum level of ballistic protection at affordable prices, and without compromising performance, durability or quality.\nOur desire to drive innovation and create ever lighter, stronger, more practical and effective products and protection solutions is what drives us. As a lean, flexible and nimble company, we are constantly challenging the status quo within our organization, and we are never set in our ways. Through innovation we are able to deliver a lighter, thinner and more effective for ballistic protective plate for law enforcement, military and responsible civilians.\nWe are always working harder to strengthening the Gladiator community by raising our standards of customer service and overall customer satisfaction. Our team is an industry leader in customer service, and we achieve this by delivering products much faster that our competition, usually within 4-6 weeks while providing timely updates throughout the production process.\nOur Growth and Marketing Strategy\nWe believe that those who protect and serve and risk their lives to preserve our way of life, shouldnt have to spend a fortune to protect themselves.\n-Matt Materazo, Founder & CEO\nThe elements of our growth strategy start with our commitment to continuous capital reinvestment into our Company, its subsidiaries and our strategic industry partners. We lead by example and set the pace for our industry in order to attract the leading regional security companies and protective products companies to join us as stakeholders. The core of our business growth strategy is to engage directly with our community stakeholders in growing urban markets where the breakdown of cultural values and community investment has left a vacuum of need.\nRisks Associated with Our Business\nOur business is subject to numerous risks, which are more fully described in the section entitled Risk Factor beginning on page 14 of this document. We may be unable, for many reasons, including those that are beyond our control, to implement our business strategy.\nAs a result of these risks and other risks there is no guarantee that we will experience growth or profitability in the future.\nRecent Developments\nThere are several trends that provide opportunities and risks for USS:\no\nThe breakdown and underfunding of traditional law enforcement leading to passive response to riots, resulting break-ins, shoplifting, and property destruction on the large scale (See Portland 2020).\no\nThe rise of the lawless corollary on the small scale with burgeoning vagrancy, break-ins and theft (e.g., catalytic converters in automobiles, construction materials such as tools and copper conduit).\no\nThe refusal of cities to enforce vagrancy laws and suppress the crime associated with chronic criminal trespassing and its detrimental effect on business. This leads to a transfer of burden to business owners who turn to private security companies to mitigate. This applies to all sectors - residential, commercial and municipal.\no\nFinally, the sense of personal physical risk has been heightened in culture leading to the need to provide protection to employees and residents. For example, employees want protection as they come and go to their vehicle in areas of high crime.\nOur Corporate Information\nOur principal executive offices, and the principal executive offices of Gladiator and USS, are located at 9160 South 300 West, #101 Sandy, UT 84070. Our telephone number is (801) 706-9429. Our Internet website addresses are https://gladiatorsolutions.com and https://www.usselite.com. The information contained on, or that can be accessed through, our website is not a part of this document. We have included our website address in this document solely as an inactive textual reference.\nCritical Accounting Policies and Estimates\nUse of Estimates\nThe preparation of the condensed consolidated financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosure of contingent liabilities at the date of the condensed consolidated financial statements and the reported amounts of expenses during the reporting period. Actual results could differ from those estimates.\nManagement makes estimates that affect certain accounts including deferred income tax assets, accrued expenses, fair value of equity instruments and reserves for any other commitments or contingencies. Any adjustments applied to estimates are recognized in the period in which such adjustments are determined.\nRecent Accounting Pronouncements\nSee Note 2 of the accompanying consolidated financial statements for a discussion of recently issued accounting standards.\nEmployees\nAs of December 31, 2022, we had 168 employees, one of whom is employed as CFO for the Company and its subsidiaries on a full-time basis by the main operating subsidiary, United Security Services. Out of the 168 employees the Company had 152 full time employees and 16 part-time employees. Item 1A. Risk Factors.\nSince we are a smaller reporting company, we are not required to supply the information required by this Item 1A. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nOur corporate office is located at James Maritime Holdings Inc., 9160 South 300 West, #101, Sandy, UT 84070, 70503 +1 801-706-9429. Our website addresses are https://gladiatorsolutions.com and https://www.usselite.com. Item 3. Legal Proceedings.\nThe Company currently has no litigation pending, threatened or contemplated, or unsatisfied judgments.\nFrom time to time, we are also a party to certain legal proceedings incidental to the normal course of our business including the enforcement of our rights under contracts with contractors and suppliers. While the outcome of these legal proceedings cannot at this time be predicted with certainty, we do not expect that these proceedings will have a material effect upon our financial condition or results of operations. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nThe Companys common stock is currently quoted on the OTCQB Market under the symbol JMTM. The following table sets forth the high and low per share sales prices for our common stock for each of the quarters as reported by the OTC Markets.\nYear Ended December 31, 2022\nHigh\nLow\nFourth quarter\n$ 6.33\n$ 5.50\nThird quarter\n$ 6.49\n$ 4.00\nSecond quarter\n$ 6.50\n$ 5.00\nFirst quarter\n$ 6.00\n$ 5.00\nYear Ended December 31, 2021\nHigh\nLow\nFourth quarter\n$ 5.25\n$ 2.00\nThird quarter\n$ 2.99\n$ 1.50\nSecond quarter\n$ 2.99\n$ 1.00\nFirst quarter\n$ 3.13\n$ 2.50\nOn October 2, 2023, the closing sales price reported for our common stock was $6.00 per share and as of that date, we had approximately 123 holders of record of our common stock, and 9,064,129 shares outstanding.\nDividend Policy\nWe have not declared or paid any dividends on our common stock. We intend to retain earnings for use in our operations and to finance our business. Any change in our dividend policy is within the discretion of our board of directors and will depend, among other things, on our earnings, debt service and capital requirements, restrictions in financing agreements, if any, business conditions, legal restrictions and other factors that our board of directors deems relevant.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company has no formally adopted compensation plans or equity incentive plans approved or submitted for approval by the shareholders.\nRecent Sale of Unregistered Securities\nDuring the year ended December 31, 2022, and December 31, 2021 the Company conducted the following sales of unregistered securities pursuant to Regulation D and Section 4(2) of the Securities Act of 1933, as amended. The Company used this amount for working capital.\nThroughout 2021 and 2022, the Company undertook multiple transactions involving the issuance of its common stock. On February 28, 2022, the Company issued 50,000 shares of common stock at a price of $1 per share to an officer, receiving $50,000 as consideration. On May 12, 2022, 100,000 shares were issued at the same price, with the Company receiving a combined total of $100,000 from two distinct investors. On September 23, 2022, as part of a stock-exchange agreement culminating in the acquisition of United Security Solutions, the Company issued 1,000,000 shares of common stock at $1 per share. Notably, 940,000 of these shares were allocated to an officer of USS. On October 11, 2022, the Company issued 100,000 units as part of a share purchase agreement, with each unit comprising one restricted common share and a warrant granting the holder the right to purchase an additional ten restricted shares at a price of $3.50 per share. Subsequently, on October 14, 2022, the Company issued 100,000 shares of common stock at $1 per share to an officer, garnering $100,000 in consideration. The same day, 300,000 shares were issued in return for consulting services, leading to the recognition of $300,000 in consulting expenses.\nOn February 8, 2021, Gladiator consummated a note agreement with Pink Holdings LLC, pursuant to which the Company received a principal sum of $10,000, accruing interest at an annual rate of 6%. This note, maturing on February 7, 2022, stipulates that both principal and accrued interest are due upon reaching maturity. The note accords the issuer an option to convert, either in part or in entirety, the outstanding principal or accrued interest into fully paid and non-assessable common shares of the Company. The conversion price is determined as the lower of 10% of the lowest trading price observed during the five-trading day period concluding on the conversion date per share. The note permits the issuer to convert outstanding amounts into the Companys common shares under specific terms. Funds raised were used for general corporate purposes. This transaction was executed in accordance with Section 4(2) of the Securities Act of 1933 and Regulation D, specifically Rule 504 and or Rule 701, without the engagement of underwriters.\nOn February 26, 2021, Gladiator entered into another note agreement with Pink Holdings LLC. Under this agreement, the Company procured $25,000, subject to an annual interest rate of 6% and maturing on February 25, 2022. The issuer retains the prerogative to convert any portion or the full outstanding amount of principal or interest into the Companys fully paid and non-assessable common shares. The conversion rate is pegged at the lower of 10% of the lowest trading price during the trading day concluding on the conversion date per share. As of December 31, 2022, these notes remain unconverted and are past their respective due dates. Funds raised were allocated for general corporate purposes. This transaction complied with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the involvement of underwriters.\nOn April 9, 2021, the Company issued 50,000 shares at $0.50 per share, collecting $25,000. The funds were used for general corporate purposes and to finance the acquisition of Gladiator and USS. The issuance was executed under Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and/or Rule 701, without the participation of underwriters.\nOn June 2, 2021, the Company issued 200,000 shares as compensation for consulting services, recognizing an expense of $100,000. This issuance was conducted in line with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the engagement of underwriters.\nOn July 20, 2021, the Company issued 750,000 shares to its CEO, CFO, and a Director as compensation for consulting services. On the same day, 1,600,000 preferred shares were converted into 750,000 common shares. Both transactions were completed in compliance with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the participation of underwriters.\nOn August 25, 2021, the Company issued 100,000 shares at $0.50 per share and paid $5,000 for legal services, leading to a recognized legal expense of $55,000. The funds raised were used for general corporate purposes. This transaction was executed in accordance with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the involvement of underwriters.\nOn September 23, 2021, subsequent to the resignation of Mr. Sierra from his position with USS, the Company entered into an agreement to repurchase 100 shares of its common stock previously held by Mr. Sierra. In consideration for the repurchase of the aforementioned shares, USS provided Mr. Sierra with a promissory note, initially valued at $637,500. The repurchase amount was subsequently reduced by an aggregate of $405,545, attributable to distributions previously made by the Company to Mr. Sierra, effectively serving as consideration for the repurchase and cancellation of a corresponding portion of the debt. Consequently, the residual amount, as documented in the promissory note, is $231,955. This note does not bear interest and is structured with monthly installment payments over a four-year term, with the inaugural payment slated for November 15, 2021. Prior to USSs acquisition by James Maritime, the promissory note was discounted at a rate of 6%. However, in light of the acquisition, the notes value was adjusted and recognized at its fair value, which amounted to $182,773. As of the close of the fiscal year on December 31, 2022, the promissory notes outstanding principal is recorded at $168,276. The funds were used for general corporate purposes. The transaction was carried out in compliance with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the involvement of underwriters.\nOn December 23, 2022, Gladiator entered into an agreement wherein the Company received a consideration of $50,000 in exchange for the commitment to issue 50,000 common shares to an officer of the Company. Notably, as of the fiscal year-end on December 31, 2022, these shares had not yet been formally issued. Consequently, in light of the deferred issuance, the transaction was recorded as a liability rather than as an equity transaction on the Companys financial statements for the period ending December 31, 2022. The raised funds were allocated for general corporate purposes. The share commitment was executed in accordance with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the engagement of underwriters.\nOn February 28, 2022, the Company issued 50,000 shares of common stock at $1 per share to an officer, raising $50,000. The funds were used for general corporate purposes and to finance the acquisition of Gladiator and USS. The issuance was conducted in line with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the participation of underwriters.\nOn May 12, 2022, the Company issued 100,000 shares at $1 per share, raising a total of $100,000 from two separate investors. The raised funds were allocated for general corporate purposes and to support the acquisition of Gladiator and USS. The shares were issued under Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504, without the involvement of underwriters.\nOn September 23, 2022, in alignment with a stock-exchange agreement leading to the acquisition of United Security Solutions, the Company issued 1,000,000 shares at $1 per share. Notably, 940,000 of these shares were allotted to an officer of USS. The funds facilitated the acquisition of USS. The transaction was executed under Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the engagement of underwriters.\nOn October 11, 2022, 100,000 units were issued as part of a share purchase agreement. Each unit consisted of one restricted common share and a warrant allowing the holder to purchase ten additional restricted shares at $3.50 per share. The funds raised were intended for general corporate purposes. This transaction complied with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504, without the participation of underwriters.\nOn October 14, 2022, the Company issued 100,000 shares at $1 per share to an officer, generating $100,000. On the same day, 300,000 shares were issued in compensation for consulting services, leading to a recognized consulting expense of $300,000. Both issuances were carried out in accordance with Section 4(2) of the Securities Act of 1933 and Regulation D, Rule 504 and or Rule 701, without the involvement of underwriters.\nAs of January 1, 2021, no warrants were outstanding. During 2022, the Company granted 1,000,000 warrants with an exercise price of $3.50. As of December 31, 2022, these warrants remain outstanding and exercisable at the set exercise price. Item 6. [RESERVED] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nForward-Looking Statements\nThis annual report contains certain information that may constitute forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. While we have specifically identified certain information as being forward-looking in the context of its presentation, we caution you that all statements contained in this report that are not clearly historical in nature, including statements regarding anticipated financial performance, managements plans and objectives for future operations, business prospects, market conditions, and other matters are forward-looking. Forward-looking statements are contained principally in the sections of this report entitled Business, Risk Factors, and Managements Discussion and Analysis of Financial Condition and Results of Operations. Without limiting the generality of the preceding sentence, any time we use the words expects, intends, will, anticipates, believes, confident, continue, propose, seeks, could, may, should, estimates, forecasts, might, goals, objectives, targets, planned, projects, and similar expressions, we intend to clearly express that the information deals with possible future events and is forward-looking in nature. However, the absence of these words or similar expressions does not mean that a statement is not forward-looking. For JMTM, particular uncertainties that could cause our actual results to be materially different than those expressed in our forward-looking statements include, without limitation:\n·\nour ability to maintain and grow our existing customer base;\n·\nthe amount and timing of our cash flows and earnings, which may be impacted by customer, competitive, supplier and other dynamics and conditions;\n·\nour ability to maintain or improve margins through business efficiencies;\n·\nour ability to launch new product and service offerings that achieve market acceptance with acceptable margins;\n·\nchanges in law, economic and financial conditions, including tax law changes, changes to privacy requirements, changes to telemarketing, email marketing and similar consumer protection laws, interest and exchange rate volatility, and trade tariffs applicable to the products we sell;\n·\nthe impact of potential information technology, cybersecurity or data security breaches.\nForward-looking information involves risks, uncertainties, and other factors that could cause actual results to differ materially from those expressed or implied in, or reasonably inferred from, such statements, including without limitation, the risks and uncertainties disclosed above. Therefore, caution should be taken not to place undue reliance on any such forward-looking statements. Much of the information in this report that looks toward future performance of our Company is based on various factors and important assumptions about future events that may or may not actually occur. As a result, our operations and financial results in the future could differ materially and substantially from those we have discussed in the forward-looking statements included in the Annual Report. We assume no obligation (and specifically disclaim any such obligation) to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law.\nBusiness Overview\nJames Maritime Holdings, Inc. operates mainly through its subsidiaries, Gladiator and USS. Gladiator specializes in the distribution of personal protective products, largely through mail-in orders and e-commerce channels. On the other hand, USS offers a combination of professional security personnel services, enhanced by smartphone-based security applications, providing a unique blend of traditional and modern security solutions. The consolidated financial statements were prepared according to U.S. GAAP and SEC regulations. The Company has adopted a December 31 fiscal year-end for financial statement reporting.\nThe financial statements were prepared with estimates and assumptions that impact the reported amounts of assets and liabilities. These estimates were used for inventories, impairment of long-term assets, and derivatives. The actual results could differ significantly from these estimates. Business combinations were accounted for using the acquisition method. Assets, liabilities, and any remaining non-controlling interests were recognized at fair value on the acquisition date. The excess of the purchase price over the fair value of assets acquired, net of liabilities assumed, and non-controlling interests, was recognized as goodwill. The company considers investments with an original maturity of three months or less at the purchase date as cash and cash equivalents.\nRecent Developments\nDuring the past two fiscal years, the company underwent significant corporate changes.\nShare Exchange Agreements and Stock Conversions\nJames Maritime solidified its position in the market by becoming the majority shareholder of Gladiator Solutions Inc., holding approximately 86.7% of all shares outstanding as of December 13, 2021. The acquisition of Gladiator Solutions, Inc. resulted in the issuance of 866,667 shares and brought the total common stock balance to 7,354,129 by the end of 2021. Furthermore, on September 23, 2022, the company fortified its portfolio by completing a share exchange agreement with USS, resulting in James Maritime securing 100% of all USS shares. The acquisition of USS resulted in the issuance of 1,000,000 shares by the end of 2022, and the common stock balance reached 9,004,129. Additional paid-in capital also saw a significant increase to $13,656,447, reflecting the stock issuances and compensations during the year.\nThere were multiple issuances of common stock for diverse purposes, ranging from shareholder-related issuances to share-based compensations and acquisitions. In 2021, our preferred stock decreased from 2,000,000 to 400,000 shares. This decrease was primarily due to the conversion of preferred stock to common stock. Specifically, 1,600,000 shares of preferred stock were converted, leading to the issuance of 750,000 shares of common stock. Total shareholders equity, which includes both equity attributable to the company and non-controlling interest, increased from $419,248 at the end of 2021 to $2,182,693 by the end of 2022.\nGoing concern\nThe Companys consolidated financial statements as of December 31, 2022, are prepared using U.S. GAAP, which contemplates continuation of the Company as a going concern. This contemplates the realization of assets and liquidation of liabilities in the ordinary course of business. The Company has yet to establish an ongoing source of revenue to finance its operating expenses and to continue as a going concern.\nAlthough the Company generated net income of $204,894 during the year ended December 31, 2022, the Company generated an operating loss of $2,313,262. The net income generated was mainly caused by $3 million received for the employee retention credit during 2022. The accumulated deficit as of December 31, 2022 is $11,454,076 ($11,658,970 as of December 31, 2021). In order to continue as a going concern, the Company plans to receive funds through the selling of equity securities to existing and new shareholders. The Company is also evaluating potential acquisitions in the corporate security space. Additionally, the Company has created and maintained good customer relationships during 2022 for both USS and Gladiator, which the Company is relying on to potentially generate sustainable sales throughout 2023 and afterward. While management maintains they will be able to continue to generate sufficient cash flows through a combination of operations, debt, and equity raises, there is no guarantee the Company will be able to raise or generate additional funds in the short term to meet present obligations as they come due. Due to these factors, there is substantial doubt the Company may be able to continue as a going concern. The financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nResults of Operations\nYears ended December 31, 2022 and 2021\nFor the year ending December 31, 2022, the Company had net sales of $4,063,122, in contrast to $1,979 in 2021. Accounts receivables reached $722,367 as of December 31, 2022, marking an increase from the absence of any reported receivables as of December 31, 2021. This resulted from a growth in credit sales and longer collection durations in 2022. Intangible assets increased by $2,772,010 from $1,378,270 in 2021 to $4,150,280 in 2022 as a result of the Gladiator and USS acquisitions. Collectively, the assets of the Company expanded from $1,488,730 as of December 31, 2021 to $5,774,808 as of December 31, 2022.\nAccounts payable and accrued expenses increased by $631,966 year over year. Deferred revenue, from advanced payments or unearned revenue, also saw an increase of $230,000 in 2022. Liabilities increased significantly from $1,069,482 as of December 31, 2021 to $3,592,115 as of December 31, 2022.\nCost of Revenue\nThe cost of goods sold for 2022 was $3,213,604, reflecting the heightened sales activities, compared to just $82 in 2021. This growth in sales resulted from enhanced business operations and an expanded customer base as a result of global volatility and military conflicts in 2022.\nGeneral and Administrative\nSelling, general, and administrative expenses were $3,162,780 in 2022, in comparison to $764,257 in 2021. General and administrative expenses increased mainly due to accounting and legal expenses and administrative expenses resulting from our rapid growth via the acquisition of Gladiator and USS.\nOther Income and Expenses\nThere was a gain from employee retention credits amounting to $2,959,811 and a gain on settlement of $398,922 in 2022. However, these gains were offset by interest expenses of $766,579 and financial expenses of $158,797, among other costs. In total, the net other income for 2022 was $2,426,707, a significant increase from net other expense of $3,667 in 2021.\nNet loss and Net Gain\nThe Company reported a net income of $113,445 for 2022, compared to a net loss of $766,027 in 2021. After accounting for the net loss attributable to non-controlling interests, the net income attributable to James Maritime Holdings, Inc. and its subsidiaries for 2022 was $204,894, in contrast to a net loss of $761,727 in 2021. On a per-share basis, the basic and diluted net loss for 2022 was $0.03 and $0.02, respectively, compared to a net loss per share of $0.21 in both basic and diluted terms for 2021.\nLiquidity and Capital Resources\nOperating Activities\nFor the year ended December 31, 2022, the Company reported net cash provided by operating activities of $178,269, up from $16,215 in 2021. This increase can be mainly attributed to the net income of $113,445 reported in 2022, as opposed to the net loss of $766,027 in 2021. Other significant non-cash adjustments in 2022 included the amortization of intangible assets of $780,086, depreciation expenses, and share-based compensation for services amounting to $300,000. Changes in working capital, notably a decrease in accounts receivable by $515,834 and an increase in deferred revenue by $230,000, also impacted cash flows from operating activities.\nInvesting Activities\nIn 2022, the net cash provided by investing activities was $9,637, primarily due to the cash acquired from the acquisition of United Security Specialists, Inc. (USS) of $21,437, offset by an acquisition of property and equipment of $11,800. In comparison, in 2021, the Company had net cash inflows of $60,349 from investing activities, predominantly from the cash acquired from the acquisition of Gladiator Solutions, Inc.\nFinancing Activities\nFinancing activities in 2022 resulted in a net cash inflow of $157,088. This was mainly due to proceeds from the issuance of common stock amounting to $350,000, proceeds from notes of $150,000, and proceeds from loans of $395,500. These inflows were partly offset by payments towards notes and loans, totaling $788,412. In 2021, the financing activities led to a net cash inflow of $19,968, primarily from the proceeds from the issuance of common stock.\nIn summary, the Company experienced a net increase in cash of $344,994 in 2022, bringing the cash balance at the end of the year to $455,454. The cash position was $110,460 at the end of 2021.\nIn addition to the standard cash flows, its important to note the substantial non-cash activities. In 2022, the Company acquired USS through a share-exchange valued at $1,000,000. In 2021, the acquisition of Gladiator Solutions, Inc. through a share-exchange that was valued at $433,334.\nGoing concern\nThe Companys consolidated financial statements as of December 31, 2022, are prepared using U.S. GAAP, which contemplates continuation of the Company as a going concern. This contemplates the realization of assets and liquidation of liabilities in the ordinary course of business. The Company has yet to establish an ongoing source of revenue to finance its operating expenses and to continue as a going concern.\nAlthough the Company generated net income of $204,894 during the year ended December 31, 2022, the Company generated an operating loss of $2,313,262. The net income generated was mainly caused by $3 million received for the employee retention credit during 2022. The accumulated deficit as of December 31, 2022 is $11,454,076 ($11,658,970 as of December 31, 2021). In order to continue as a going concern, the Company plans to receive funds through the selling of equity securities to existing and new shareholders. The Company is also evaluating potential acquisitions in the corporate security space. Additionally, the Company has created and maintained good customer relationships during 2022 for both USS and Gladiator, which the Company is relying on to potentially generate sustainable sales throughout 2023 and afterward. While management maintains they will be able to continue to generate sufficient cash flows through a combination of operations, debt, and equity raises, there is no guarantee the Company will be able to raise or generate additional funds in the short term to meet present obligations as they come due. Due to these factors, there is substantial doubt the Company may be able to continue as a going concern. The financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nOff-Balance Sheet Transactions\nNone. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENTS YEARS\nENDED DECEMBER 31, 2022 AND 2021\nPAGE\nIndependent Auditors Report (PCAOB ID : 270)\nConsolidated Balance Sheets as of December 31, 2022 and 2021\nConsolidated Statements of Operations for the years ended December 31, 2022 and 2021\nConsolidated Statement in Shareholders Equity for the years ended December 31, 2022 and 2021\nConsolidated Statements of Cash flows for the years ended December 31, 2022 and 2021\nNotes to the Consolidated Financial Statements for the years ended December 31, 2022 and 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo Board of Directors and Management of James Maritime Holdings Inc\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of James Maritime Holdings Inc and subsidiaries (collectively, the Company) as of December 31, 2022 and 2021, and the related consolidated statements of operations, shareholders equity, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2022 and 2021, and the results of its operations and its cash flows for the years ended December 31, 2022 and 2021, in conformity with U.S. generally accepted accounting principles.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe financial statements were prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company has an accumulated deficit and has not yet established an ongoing source of revenue to finance its operating expenses. These matters raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB and in accordance with auditing standards generally accepted in the United States of America. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nOctober 24, 2023\nTanner LLC| Key Bank Tower at City Creek | 36 S. State St., Suite 600, Salt Lake City, UT 84111-1400\nMain 801.532.7444 | Fax 801.364.5331 | tannerco.com\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS AS\nOF DECEMBER 31, 2022 AND 2021\nDecember 31,\nDecember 31,\nASSETS\nCash\n$ 455,454\n$ 110,460\nAccounts receivables\n722,367\n-\nPrepaid expenses and other current assets\n70,487\nTotal current assets\n1,248,308\n110,460\nDue from related parties\n7,379\n-\nIntangible assets\n4,150,280\n1,378,270\nProperty and equipment, net\n200,502\n-\nRight-of-use asset\n168,339\n-\nTotal assets\n$ 5,774,808\n$ 1,488,730\nLIABILITIES\nAccounts payable and accrued expenses\n$ 921,230\n$ 289,264\nAccrued payroll expenses\n161,360\n-\nDue to related parties\n-\n154,968\nDeferred revenue\n400,000\n170,000\nCommon stock to-be-issued\n50,000\n-\nNotes payable, current portion\n323,562\n25,955\nConvertible debenture, current portion\n35,000\n30,096\nLoans payable, current portion\n585,831\n-\nEmbedded conversion feature\n331,399\n331,399\nOperating lease liability, current\n114,400\n-\nTotal current liabilities\n2,922,782\n1,001,682\nNotes payable, net of current portion\n110,287\n-\nLoans payable, net of current portion\n490,093\n67,800\nOperating lease liability\n68,953\n-\nTotal liabilities\n3,592,115\n1,069,482\nSHAREHOLDERS EQUITY\nPreferred Stock - Series A, 2,000,000 authorized shares, $0.001 par value; 400,000 shares issued and outstanding, as of December 31, 2022 (400,000 as of December 31, 2021)\nCommon Stock, 90,000,000 shares authorized, $0.001 par value; 9,004,129 shares issued and outstanding as of December 31, 2022 (7,354,129 as of December 31, 2021)\n9,004\n7,354\nAdditional paid-in capital\n13,656,447\n12,008,097\nAccumulated deficit\n(11,454,076 )\n(11,658,970 )\nEquity attributable to shareholders of James Maritime Holdings, Inc.\n2,211,775\n356,881\nNon-controlling interest\n(29,082 )\n62,367\nTotal equity\n2,182,693\n419,248\nTotal liabilities and shareholders equity\n$ 5,774,808\n$ 1,488,730\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS FOR\nTHE YEARS ENDED DECEMBER 31, 2022 AND 2021\nYear ended December 31,\nNet sales\n$ 4,063,122\n$ 1,979\nCost of goods sold\n3,213,604\nGross profit\n849,518\n1,897\nSelling, general, and administrative expenses\n3,162,780\n764,257\nOperating loss\n(2,313,262 )\n(762,360 )\nOther income (expense)\nInterest income\n-\nInterest expense\n(766,579 )\n(2,621 )\nFinancial expenses\n(158,797 )\n-\nChange in fair value of derivative liability\n-\n(1,046 )\nGain on settlement\n398,922\n-\nEmployee retention credit\n2,959,811\n-\nOther expenses\n(6,768 )\n-\nTotal other income (expense), net\n2,426,707\n(3,667 )\nNet income (loss)\n$ 113,445\n$ (766,027 )\nLess: net loss attributable to non-controlling interests\n(91,449 )\n(4,300 )\nNet income (loss) attributable to James Maritime Holdings, Inc. and subsidiaries\n$ 204,894\n$ (761,727 )\nWeighted average number of common shares outstanding:\nBasic\n7,842,865\n5,261,343\nDiluted\n8,271,751\n5,261,343\nNet income (loss) per share:\nBasic\n$ 0.03\n$ (0.21 )\nDiluted\n$ 0.02\n$ (0.21 )\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENT OF SHAREHOLDERS EQUITY FOR\nTHE YEARS ENDED DECEMBER 31, 2022 AND 2021\nTotal Equity\nAdditional\nattributable\nNon-\nTotal\nPreferred Stock\nCommon Stock\nPaid-in\nAccumulated\nto the\ncontrolling\nShareholders\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nCompany\ninterest\nequity\nBalance as at January 1, 2021\n2,000,000\n$ 2,000\n4,387,462\n$ 4,387\n$ 10,901,130\n$ (10,897,243 )\n$ 10,274\n$ -\n$ 10,274\nIssuance of common stock to shareholders\n-\n-\n50,000\n24,950\n-\n25,000\n-\n25,000\nConversion of preferred stock to common stock\n(1,600,000 )\n(1,600 )\n750,000\n-\n-\n-\n-\nShare-based compensation for professional and consulting\nservices\n-\n-\n1,300,000\n1,300\n648,700\n-\n650,000\n-\n650,000\nAcquisition of Gladiator Solutions, Inc.\n-\n-\n866,667\n432,467\n-\n433,334\n66,667\n500,001\nNet loss\n-\n-\n-\n-\n-\n(761,727 )\n(761,727 )\n(4,300 )\n(766,027 )\nBalance as at December 31, 2021\n400,000\n$ 400\n7,354,129\n$ 7,354\n$ 12,008,097\n$ (11,658,970 )\n$ 356,881\n$ 62,367\n$ 419,248\nIssuance of common stock and warrants to shareholders\n-\n-\n350,000\n349,650\n-\n350,000\n-\n350,000\nShare-based compensation for professional and consulting\nservices\n-\n-\n300,000\n299,700\n-\n300,000\n-\n300,000\nAcquisition of United Security Specialists, Inc. (USS)\n-\n-\n1,000,000\n1,000\n999,000\n-\n1,000,000\n-\n1,000,000\nNet income (loss)\n-\n-\n-\n-\n-\n204,894\n204,894\n(91,449 )\n113,445\nBalance as at December 31, 2022\n400,000\n$ 400\n9,004,129\n$ 9,004\n$ 13,656,447\n$ (11,454,076 )\n$ 2,211,775\n$ (29,082 )\n$ 2,182,693\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS FOR\nTHE YEARS ENDED DECEMBER 31, 2022 AND 2021\nYear Ended December 31,\nCash flows from operating activities:\nNet income (loss)\n$ 113,445\n$ (766,027 )\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nBad debt expense\n-\nNon-cash interest expense\n26,051\nAmortization of intangible assets\n780,086\n22,142\nDepreciation expense\n10,882\n-\nDepreciation of right-of-use asset\n14,576\n-\nAccretion expense\n31,694\n1,726\nShare-based compensation for services\n300,000\n650,000\nGain on settlement\n(398,922 )\n-\nChange in fair value of derivative liability\n-\n1,046\nChanges in operating assets and liabilities:\nPrepaid expenses and other current assets\n(60,000 )\n9,086\nAccounts receivable\n(515,834 )\nRight-of-use asset\n10,924\n-\nAccounts payable and accrued expenses\n(101,934 )\n11,523\nAccrued payroll\n(11,006 )\n-\nDue to/from related parties\n(224,726 )\n-\nDeferred revenue\n230,000\n85,250\nOperating lease liability\n(26,967 )\n-\nNet cash provided by operating activities\n178,269\n16,215\nCash flows from investing activities\nCash acquired from acquisition of Gladiator\n-\n60,349\nCash acquired from acquisition of USS\n21,437\n-\nAcquisition of property and equipment\n(11,800 )\n-\nNet cash provided by (used in) investing activities\n9,637\n60,349\nCash flows from financing activities\nProceeds from issuance of common stock\n350,000\n25,000\nProceeds from shares to-be-issued\n50,000\n-\nProceeds from notes\n150,000\n-\nPayment of notes\n(171,944 )\n(5,032 )\nProceeds from loans\n395,500\n-\nPayment of loans\n(616,468 )\n-\nNet cash provided by financing activities\n157,088\n19,968\nNet increase (decrease) in cash\n344,994\n96,532\nCash, beginning of year\n110,460\n13,928\nCash, end of year\n$ 455,454\n$ 110,460\nSupplemental disclosure of cash flow information:\nCash paid during the year:\nInterest paid on loans\n$ 65,991\n$ 782\nInterest paid on notes\n24,122\n-\nCash received during the year:\nCash received from Employee Retention Tax Credit\n$ 2,959,811\n$ -\nSubstantial non-cash activities:\nAcquisition of Gladiator through share-exchange\n$ -\n$ 433,334\nAcquisition of USS through share-exchange\n1,000,000\n-\nThe accompanying notes to the consolidated financial statements are an integral part of these statements.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\n1. Nature and Continuance of Operations\nBusiness Operations Basis of Presentation\nThe accompanying consolidated financial statements include the accounts of James Maritime Holdings Inc. (James Maritime) and its majority-owned subsidiary, Gladiator Solutions Inc. (Gladiator), and its wholly owned subsidiary United Security Specialists Inc. (USS) (collectively as the Company). James Maritime Holdings, Inc. was incorporated in the State of Nevada on January 23, 2015.\nSubstantially all of the Companys business is conducted through its subsidiaries, Gladiator and USS. Gladiator produces revenues through the distribution of personal protective products, primarily through mail-in orders to customers or via e-commerce sales generated through their website. USS provides professional security personnel enhanced by smartphone-based security applications.\nShare Exchange Agreement - Gladiator Solutions, Inc.\nOn December 13, 2021, James Maritime Holdings completed a share exchange agreement with Gladiator.\nAs a result of the exchange, James Maritime became the majority shareholder of Gladiator Solutions Inc., holding approximately 86.7% of all shares outstanding. See Note 3 for further information.\nShare Exchange Agreement - United Security Specialists, Inc.\nOn September 23, 2022, James Maritime Holdings completed a share exchange agreement with USS.\nAs a result of the exchange, James Maritime became the sole shareholder of USS, holding 100% of all shares outstanding. See Note 4 for further information.\nBasis of Presentation and Principles of Consolidation\nThe accompanying consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) and pursuant to the rules and regulations of the SEC. The Company has adopted a December 31 fiscal year-end for financial statement reporting purposes.\nAll operations activity related to James Maritimes subsidiary, Gladiator, will only reflect activity from December 13, 2021 through December 31, 2021, the period for which Gladiator was acquired and owned by James Maritime. All operations from 2022 are included within the year ended December 31, 2022 consolidated statement of operations.\nAll operations activity related to James Maritimes subsidiary, USS, will only reflect activity from September 23, 2022 through December 31, 2022, the period for which USS was acquired and owned by James Maritime.\nAll intercompany balances were eliminated in the consolidated financial statements. Non-controlling interests are classified in the accompanying consolidated balance sheets as a component of equity. The amounts of consolidated net income (loss) attributable to both the Company and the non-controlling interests are separately presented in the accompanying consolidated statement of operations.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nGoing concern\nThe Companys consolidated financial statements as of December 31, 2022, are prepared using U.S. GAAP, which contemplates continuation of the Company as a going concern. This contemplates the realization of assets and liquidation of liabilities in the ordinary course of business. The Company has yet to establish an ongoing source of revenue to finance its operating expenses and to continue as a going concern.\nAlthough the Company generated net income of $204,894 during the year ended December 31, 2022, the Company generated an operating loss of $2,313,262. The net income generated was mainly caused by $3 million received for the employee retention credit during 2022. The accumulated deficit as of December 31, 2022 is $11,454,076 ($11,658,970 as of December 31, 2021). In order to continue as a going concern, the Company plans to receive funds through the selling of equity securities to existing and new shareholders. The Company is also evaluating potential acquisitions in the corporate security space. Additionally, the Company has created and maintained good customer relationships during 2022 for both USS and Gladiator, which the Company is relying on to potentially generate sustainable sales throughout 2023 and afterward. While management maintains they will be able to continue to generate sufficient cash flows through a combination of operations, debt, and equity raises, there is no guarantee the Company will be able to raise or generate additional funds in the short term to meet present obligations as they come due. Due to these factors, there is substantial doubt the Company may be able to continue as a going concern. These financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\n2. Summary of Significant Accounting Policies\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reporting amounts of assets and liabilities.\nEstimates are used for, but not limited to, the accounting for inventories, impairment of long-term assets and derivatives.\nIt is reasonably possible that the estimate of the effect of a condition, situation, or set of circumstances that existing at the date of the financial statements, which management considered in formulating its estimate, could change in the near term due to one or more future confirming events. Accordingly, the actual results of could differ significantly from those estimates.\nBusiness Combinations\nThe Company accounts for all business combinations using the acquisition method of accounting. Under this method, assets and liabilities, including any remaining non-controlling interests, are recognized at fair value at the date of acquisition. The excess of the purchase price over the fair value of assets acquired, net of liabilities assumed, and non- controlling interests is recognized as goodwill. Certain adjustments to the assessed fair values of assets and liabilities, or non-controlling interests made subsequent to the acquisition date, but within the measurement period, which is up to one year, are recorded as adjustments to goodwill. Any adjustments subsequent to the measurement period are recorded in income. Results of operations of the acquired entity are included in the Companys results from the date of the acquisition onward and include amortization expense arising from acquired tangible and intangible assets.\nCash\nThe Company considers all highly liquid investments with an original maturity of three months or less at the date of purchase to be cash and cash equivalents.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nConcentration of Credit Risk\nThe Company maintains its cash accounts with financial institutions, where, at times, deposits exceed federal insurance limits of $250,000. The Company believes that no significant concentration of credit risk exists with respect to these cash balances due to its assessment of the credit worthiness and financial viability of the financial institutions.\nInventories\nInventories consist primarily of finished goods. Costs of finished goods inventories include all costs incurred to bring inventory to its current condition, which includes standard cost paid to suppliers, shipping costs, and other costs. The Company values its inventory using specific identification method of each inventory item. If the Company determines that the estimated net realizable value of its inventory is less than the carrying value of such inventory, it records a charge to cost of goods sold to reflect the lower of cost or net realizable value. If actual market conditions are less favorable than those projected by the Company, further adjustments may be required that would increase the cost of goods sold in the period in which such a determination was made.\nAccounts Receivable\nAccounts receivables are generally recorded at the invoiced amounts, net of an allowance for expected losses. The Company evaluates the collectability of its trade accounts receivable based on a number of factors. In circumstances where the Company becomes aware of a specific customers inability to meet its financial obligations to the Company, a specific reserve for bad debts is estimated and recorded, which reduces the recognized receivable to the estimated amount the Company believes will ultimately be collected. In addition to specific customer identification of bad debts, bad debt charges are recorded based on the Companys historical losses and an overall assessment of past due trade accounts receivable outstanding. The allowance for accounts receivable is established through a provision reducing the carrying value of receivables. At December 31, 2022 and 2021, the Company determined that no allowance was necessary.\nLeases\nThe Company accounts for a contract as a lease when it has the right to direct the use of the asset for a period of time while obtaining substantially all of the assets economic benefits. The Company determines the initial classification and measurement of its right-of-use (ROU) assets and lease liabilities at the lease commencement date and thereafter if modified. ROU assets and liabilities are represented on the balance sheet at the present value of future minimum lease payments to be made over the lease term. Leases that are insignificant or with a 12-month term or less at inception are not recorded on the consolidated balance sheet and are expensed as incurred in the consolidated statements of operations. As of December 31, 2022, the Company leased real estate and office space under non-cancelable operating lease agreements that qualified for ROU accounting treatment.\nProperty and equipment\nThe Company records depreciation when appropriate using the straight-line method over the estimated useful life of the assets. Property and equipment are stated at cost less accumulated depreciation. The estimated useful lives of the Companys property and equipment by class are as follows:\nAsset classes\nUseful lives (in years)\nVehicles\nFurniture and fixtures\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nManagement regularly reviews property, equipment, and other long-lived assets for possible impairment. This review occurs annually or more frequently if events or changes in circumstances indicate the carrying amount of the asset may not be recoverable. Based on managements assessment, there were no indicators of impairment of the Companys property and equipment as of December 31, 2022.\nIntangible Assets\nIntangible assets are recorded at their estimated fair value at the date of acquisition and are allocated to the reporting units that are expected to receive the related benefits. During the years ended December 31, 2022 and 2021, the Company determined that all intangibles were fully recognizable at their net book values and therefore no impairment was deemed necessary.\nOn December 13, 2021, the Company executed a share exchange agreement that resulted in the recognition of intangible assets (see Note 3 - Gladiator Share Exchange Agreement). Management has determined that the intangible assets extrapolated from the share exchange agreement will be amortized over a useful life of 3 years.\nOn September 23, 2022, the Company executed a share exchange agreement that resulted in the recognition of intangible assets (see Note 4 - USS Share Exchange Agreement). Management has determined that the intangible assets extrapolated from the share exchange agreement will be amortized over the useful life of 3 years.\nConvertible Debt and Derivative Liabilities\nThe convertible debt is convertible into shares of common stock at a conversion rate of 10% of the lowest trading price during the previous five trading days. The terms of the embedded conversion feature require embedded derivative instrument treatment and classification as a separate liability. The conversion feature and certain other features are considered embedded derivative instruments, such as a conversion reset provision, a penalty provision and redemption option, which are to be recorded at their fair value as its fair value can be separated from the convertible note and its conversion is independent of the underlying note. The Company records the resulting discount on debt related to the conversion features at initial transaction and amortizes the discount using the effective interest rate method over the life of the debt instruments. The conversion liability is then marked to market each reporting period with the resulting gains or losses shown in the consolidated statement of operations.\nRevenue recognition\nThe Company recognizes revenue when it satisfies its performance obligations by transferring control of promised products or services to its customers, which occurs either at a point in time or over time, depending on when the customer obtains the ability to direct the use of and obtain substantially all of the remaining benefits from the products or services.\nThe Company determines revenue recognition through the following five steps:\n(1) Identify the contract with the customer,\n(2) identify the performance obligations in the contract,\n(3) determine the transaction price,\n(4) allocate the transaction price to the performance obligations in the contract; and\n(5) recognize revenue when, or as, the performance obligations are satisfied.\nNet revenues from Gladiator primarily consist of sales of personal protective products, including armor, plates, helmets, shields, and accessories shipped directly to customers. All revenue transactions for Gladiator comprise a single performance obligation, which consists of the sale of products to customers either through wholesale, intermediary, or direct-to-consumer channels. The company satisfies the performance obligation and records revenues when transfer of control has passed to the customer, based on the terms of sale. In all of the Companies revenue channels, transfer of control takes place at the point of sale upon shipment to customer.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nNet revenues from United Securities primarily consist of security services provided to large residential, industrial, construction and government clients. Contracts with customers contain no incentives or discounts that could cause revenue to be allocated or adjusted over time. The Company does offer discounts, but historically the discounts have been insignificant. The Company satisfies the performance obligation for the agreed-upon period of time and location and records revenues after completion. There are no services that would be considered fulfilled over an extended period of time and necessitate different accounting treatment.\nAdvertising Costs\nAdvertising costs are charged to selling, general, and administrative expenses. Advertising production costs are expensed the first time an advertisement related to such production costs is run. Media (television, print and radio) placement costs are expensed in the month during which the advertisement appears. Advertising expenses for the years ended December 31, 2022 and 2021, were $50,110 and $595, respectively.\nShipping and Handling Costs\nThe Company incurs freight costs associated with shipping goods to customers. These costs are recorded as a component of cost of goods sold. For the years ended December 31, 2022 and 2021, shipping and handling costs totaled $35,122 and $0, respectively.\nEarnings per Share\nBasic earnings per common share is computed by dividing net income (loss) available to common stockholders for the period by the weighted average number of common shares outstanding during the period. Diluted earnings per common share are computed by dividing net income (loss) available to common stockholders for the period by the diluted weighted average common shares outstanding during the period. Diluted earnings per share reflects the potential dilution from common shares issuable through stock options, restricted stock units and other equity awards. For the year ended December 31, 2022, the Company generated a net income, therefore calculated diluted earnings per share with the applicable equity instruments. For the year ended December 31, 2021, the Company generated net losses, therefore applying applicable equity instruments for diluted earnings per share would have had an anti-dilutive effect. Please see Note 14 for the computation of earnings per common share for the years ended December 31, 2022 and 2021.\nFair Value of Financial Instruments\nThe carrying amounts shown for the Companys cash and cash equivalents, accounts receivable, accounts payable and accrued expenses, and notes and loans approximate fair value because of the short-term maturity of those instruments.\nThe Company groups its recurring, non-recurring and disclosure-only fair value measurements into the following levels when making fair value measurement disclosures:\nLevel 1\nInputs are unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2\nInputs are quoted prices for similar assets or liabilities in an active market, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable and market-corroborated inputs which are derived principally from or corroborated by observable market data.\nLevel 3\nInputs are derived from valuation techniques in which one or more significant inputs or value drivers are unobservable.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (an exit price). The Company and its subsidiaries use, as appropriate, a market approach (generally, data from market transactions), an income approach (generally, present value techniques and option-pricing models), and / or a cost approach (generally, replacement cost) to measure the fair value of an asset or liability. These valuation approaches incorporate inputs such as observable, independent market data and/or unobservable data that management believes are predicated on the assumptions market participants would use to price an asset or liability. These inputs may incorporate, as applicable, certain risks such as nonperformance risk, which includes credit risk.\nThe Company received a fair value assessment from a third-party prior to the business combination with Gladiator. See Note 3 for further details and assumptions used in the calculation.\nIncome Taxes\nIncome taxes are accounted for under the asset and liability method. Deferred income tax assets and liabilities are established for temporary differences between the financial reporting basis and the tax basis of the Companys assets and liabilities at tax rates expected to be in effect when such assets or liabilities are realized or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in operations in the period that includes the enactment date of a change in tax rates. Deferred income tax assets are reduced by valuation allowances when necessary. On December 31, 2022 and 2021, the Company had no material unrecognized tax benefits and no adjustments to liabilities or operations were required. The 2019 through 2022 tax years remain subject to examination by federal and most state tax authorities.\nCommitments and Contingencies\nCertain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur. The Company assesses such contingencies related to legal proceedings that are pending against the Company or unasserted claims that may result in such proceedings. The Company evaluates the perceived merits of any legal proceedings, or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is possible but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed.\nNon-controlling Interests\nNon-controlling interests are classified in the accompanying consolidated balance sheet as a component of equity. The amounts of consolidated net income (loss) attributable to both the Company and the non-controlling interests are separately presented in the accompanying consolidated statements of operations.\nRecently Issued Accounting Standards\nIn June 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2016-13. Credit Losses (Topic 326) - Measurement of Credit Losses of Financial Statements Instruments. ASU 2016-13 requires entities to use a forward-looking approach based on current expected credit losses to estimate credit losses on certain types of financial instruments, including trade receivables, which may result in the earlier recognition of allowance for losses. ASU 2016-13 is effective beginning January 1, 2023 and early adoption is permitted. The adoption of ASU 2016-13 is not expected to have any impact on the Companys financial statement presentation or disclosures.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nIn August 2020, the FASB issued ASU 2020-06 Debt- Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40) (ASU 2020-06). The amendment in this update simplifies the accounting for convertible instruments by reducing the number of accounting models available for convertible debt instruments and convertible preferred stock. This update also amends the guidance for the derivatives scope exception for contracts in an entitys own equity to reduce form-over-substance- based accounting conclusions and requires the application of the if-converted method for calculating diluted earnings per share. The update also requires entities to provide expanded disclosures about the terms and features of convertible instruments, how the instruments have been reported in the entitys financial statements, and information about events, conditions, and circumstances that can affect how to assess the amount or timing of an entitys future cash flows related to those instruments. The guidance is effective for interim and annual periods beginning after December 15, 2021, with early adoption permitted, but not earlier than fiscal years beginning after December 15, 2020. The Company has retrospectively adopted ASU 2020-06, effective as of January 1, 2021. The adoption of ASU 2020-06 has a significant impact on the Companys financial statement presentation and disclosures as it relates to the convertible debentures issued during 2021.\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt - Modifications and Extinguishments (Subtopic 470-50), Compensation - Stock Compensation (Topic 718), and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40): Issuers Accounting for Certain Modifications or Exchanges of Freestanding Equity-Classified Written Call Options (ASU 2021-04). ASU 2021-04 provides guidance as to how an issuer should account for a modification of the terms or conditions or an exchange of a freestanding equity- classified written call option (i.e., a warrant) that remains equity classified after modification or exchange as an exchange of the original instrument for a new instrument. An issuer should measure the effect of a modification or exchange as the difference between the fair value of the modified or exchanged warrant and the fair value of that warrant immediately before modification or exchange and then apply a recognition model that comprises four categories of transactions and the corresponding accounting treatment for each category (equity issuance, debt origination, debt modification, and modifications unrelated to equity issuance and debt origination or modification). ASU 2021-04 is effective for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. An entity should apply the guidance provided in ASU 2021- 04 prospectively to modifications or exchanges occurring on or after the effective date. Early adoption is permitted, including adoption in an interim period. If an entity elects to early adopt ASU 2021-04 in an interim period, the guidance should be applied as of the beginning of the fiscal year that includes that interim period. The adoption of ASU 2021-04 is not expected to have any impact on the Companys consolidated financial statement presentation or disclosures.\n3. Share Exchange Agreement with Gladiator Solutions, Inc.\nOn December 13, 2021 (the Gladiator Closing date), Gladiator (the seller) entered into a share exchange agreement with the Company, in which all the outstanding shares of Gladiator, 750,000 common shares, no par value, were exchanged for 1,000,000 shares, $0.001 par value of James Maritimes common stock.\nOn the Closing date, one of the sellers shareholders dissented from participating in the acquisition, which immediately resulted in a noncontrolling interest after the completion of the share purchase agreement. The noncontrolling interest is equivalent to the shareholders proportionate holdings of 100,000 Gladiator shares, or 13.3%. The remaining shareholders with an equity stake of 86.7% exchanged their total aggregate shares of 650,000 for 866,667 of James Maritimes common stock shares.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nThe Company also included contingent considerations if Gladiator meets or exceeds certain earnings before interest, taxes, amortization (EBITDA) thresholds:\n-\n$3,000,000 and 25% during any consecutive twelve-month period commencing on the Gladiator closing date and ending December 31, 2024 (the Measurement period), the Company shall issue one (1) additional share for each two (2) shares of James Maritime stock received by such shareholder;\n-\n$5,000,000 and 25% during the measurement period, one (1) additional share of James Maritime stock for each one (1) share of James Maritime stock received by such shareholder at the closing;\n-\n$10,000,000 during the measurement period, one (1) additional share of James Maritime stock for each one (1) share of James Maritime stock received by such shareholder at the closing;\n-\nConversely, in the event Gladiators revenues and EBITDA percentage does not equal or exceed $2,000,000 and 25%, respectively, during any consecutive twelve-month period commencing on the closing date and ending on the 24-month anniversary of the Closing date, the sellers shareholders shall return to the Company an aggregate of 500,000 shares of James Maritime common stock.\nThe Company utilized a third-party valuation specialist to calculate the intangible assets and estimate the purchase price of the agreement. The valuation utilized a share purchase price of $0.50, which constitutes a Level 2 fair value measurement.\nPurchase price (2)\n$ 433,334\nPlus: Net liabilities assumed (3)\n967,079\nIntangibles (1)\n$ 1,400,413\n(1) Intangibles were determined to consist of two separately identifiable intangible assets to be amortized over their useful lives of 3 years (the average time the company has maintained customer relationships). 50% of the value or\n$700,206 was attributed to Supplier Relationships and 50% of the value or $700,206 was attributed to Customer Relationships.\n(2) The purchase price was calculated by taking the recapitalization of James Maritime Holdings shares of 866,667 (previously 650,000 Gladiator shares) at $0.50 per share, resulting in a total purchase price of $433,334.\n(3) Identifiable assets acquired, and liabilities assumed:\nThe following tables present the allocation of the purchase consideration, which includes tangible assets acquired and liabilities assumed, based on their assessed fair values.\nAssets acquired:\nCash\n$ 60,349\nAccounts receivable\n1,356\nTotal assets acquired\n$ 61,705\nLiabilities assumed:\nAccounts payable and accrued expenses\n$ 264,909\nDeferred revenue\n84,750\nDue to related parties\n154,948\nNote payable\n30,987\nConvertible debenture\n28,370\nLoan\n67,800\nDerivative liability\n330,353\nMinority interest (4)\n66,667\nTotal liabilities assumed\n$ 1,028,784\nNet assets (liabilities) acquired/assumed\n$ (967,079 )\n(4) The non-controlling interest was calculated by taking the Level 2 fair value assessment of price per share of $0.50 and multiplying by the recapitalization of James Maritime Holdings shares of 133,333 (previously 100,000 Gladiator shares), resulting in a non-controlling interest valuation of $66,667.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nIf the share exchange agreement had occurred on January 1, 2021, the pro forma consolidated revenues at December 31, 2021 would have amounted to approximately $308,051 and the consolidated operating loss would have amounted to approximately $1,000,940.\n4. Share Exchange Agreement with United Securities Specialists, Inc. (USS)\nOn September 23, 2022 (the USS Closing date), USS entered into a share exchange agreement with the Company, in which all the outstanding shares, 100 common shares, no par value, were exchanged for 1,000,000 shares, $0.001 par value of James Maritime common stock.\nThe Company also included contingent considerations if USS meets or exceeds certain earnings before interest, taxes, amortization (EBITDA) thresholds:\n-\n$20,000,000 and 15% during any consecutive (12) month period commencing on the Closing date and ending on December 31, 2025 (the Measurement Period), the Company shall issue an aggregate 500,000 shares of James Maritime stock\n-\n$30,000,000 and 15% during the measurement period, the Company shall issue an aggregate 500,000 shares of James Maritime stock\n-\n$40,000,000 and 15% during the measurement period, the Company shall issue an aggregate 500,000 shares of James Maritime stock\n-\n$50,000,000 and15% during the measurement period, the Company shall issue an aggregate 500,000 shares of James Maritime stock\nIf all criteria are met, an aggregate of 2,000,000 earnout shares will be awarded to the Company.\nThe Company utilized a third-party valuation specialist to calculate the intangible assets and estimate the purchase price of the agreement. The valuation utilized a share purchase price of $1.00, which constitutes a Level 2 fair value measurement.\nThe allocation of the purchase price in connection with the acquisition of USS was calculated as follows:\nPurchase price (2)\n$ 1,000,000\nPlus: Net liabilities assumed (3)\n2,439,614\nIntangibles (1)\n$ 3,439,614\n(1) Intangibles were determined to consist of two separately identifiable intangible assets to be amortized over their useful lives of 3 years (the average time the Company has maintained customer and employee relationships). 50% of the value or $1,719,807 was attributable to Employee Expertise and 50% of the value or $1,719,807 was attributable to Customer Relationships.\n(2) The purchase price was calculated by taking the recapitalization of James Maritime Holdings shares of 1,000,000 (previously 100 Company shares) at $1.00 per share, resulting in a total purchase price of $1,000,000.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nThe following tables present the allocation of the purchase consideration, which includes tangible and intangible assets acquired and liabilities assumed, based on their assessed fair values\nAssets acquired:\nCash\n$ 21,437\nAccounts receivable\n206,536\nPrepaid expenses\n10,487\nProperty and equipment\n199,584\nRight-of-use asset\n193,839\nIntangible assets\n99,609\nTotal assets acquired\n$ 731,492\nLiabilities assumed:\nAccounts payable and accrued expenses\n$ 704,637\nAccrued payroll\n172,366\nNotes payable - current and non-current\n1,017,771\nLoan - current and non-current\n1,066,012\nOperating lease liability - current and non-current\n210,320\nTotal liabilities assumed\n$ 3,171,106\nNet assets (liabilities) acquired/assumed\n$ (2,439,614 )\nIf the share exchange agreement had occurred on January 1, 2022, the pro forma consolidated revenues at December 31, 2022 would have amounted to approximately $9,420,417 and the consolidated operating loss would have amounted to approximately $2,301,112.\n5. Intangible Assets\nThe Companys intangible assets are as follows:\nDecember 31,\nDecember 31,\nCustomer relationships\n$ 2,420,014\n$ 700,206\nSupplier relationships\n700,207\n700,206\nEmployee expertise\n1,719,807\n-\nSoftware development costs\n99,609\n-\nLess: accumulated amortization\n(789,357 )\n(22,142 )\nNet intangible assets\n$ 4,150,280\n$ 1,378,270\nAmortization expense for the twelve months ended December 31, 2022 and 2021 equated to $780,086 and $22,142, respectively and is included in selling, general, and administrative expenses in the consolidated statements of operations.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\n6. Property and Equipment\nThe table below displays the Companys property and equipment balances as of December 31, 2022 and 2021, respectively.\nDecember 31,\nDecember 31,\nFurniture and fixtures\n$ 16,062\n$ -\nVehicles\n195,322\n-\nLess: accumulated amortization\n(10,882 )\n-\nTotal property and equipment, net\n$ 200,502\n$ -\nDepreciation expense for the twelve months ended December 31, 2022 and 2021 equated to $10,882 and $nil, respectively and is included in selling, general, and administrative expenses in the consolidated statements of operations.\n7. Lease Payable\nThe Company leases its headquarters office. Leases with an initial term of 12 months or less or are immaterial are not included on the balance sheets. During the year ended December 31, 2020, the Company entered into an office lease for its administrative operations. This lease is for a 48.5-month term, expiring on July 31, 2024, with an initial monthly payment of $8,819. Straight-line rent per month was calculated at $9,522.\nThe components of lease expense included on the Companys consolidated statements of operations were as follows:\nAs of December 31, 2022\nWeighted average remaining lease term (in years)\n1.58\nWeighted average discount rate\n6%\nAmounts relating to operating leases were presented on the consolidated balance sheets as of December 31, 2022 in the following line items:\nDecember 31, 2022\nOperating Leases\nROU lease assets\n$ 168,339\nLease liabilities, short-term\n114,400\nLease liabilities, long-term\n68,953\nFuture minimum lease payments required under operating leases on an undiscounted cash flow basis as of December 31, 2022 is as follows:\nOperating Lease\nFiscal Year\nPayments\n$ 122,512\n73,412\nTotal minimum lease payments\n195,924\nLess: imputed interest\n(12,571 )\nPresent value of future minimum lease payments\n183,353\nLess: current lease liabilities\n(114,400 )\nOperating lease liabilities, non-current\n$ 68,953\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\n8. Accounts Payable and Accrued Expenses\nThe accounts payable and accrued expenses balance consists of the following for the years ended December 31, 2022 and 2021:\nDecember 31,\nDecember 31,\nAccounts payable\n$ 723,886\n$ 248,126\nCredit card liability\n156,115\n11,912\nAccrued interest\n26,809\n1,771\nTaxes payable\n14,420\n27,455\n$ 921,230\n$ 289,264\n9. Notes Payable, current and non-current\nThe following table summarizes the outstanding notes payable amount owed by the Company:\nAs of December 31,\nKapitus (a)\n$ 122,973\n$ 25,955\nHenry Sierra (b)\n168,276\n-\nIOU (c)\n142,600\n-\nTotal notes payable outstanding\n$ 433,849\n$ 25,955\nNotes payable, current portion\n323,562\n25,955\nNotes payable, excluding current\n110,287\n-\n(a)\nOn November 4, 2020 Gladiator received $69,800 from their supplier, Kapitus Servicing Inc. Gladiator agreed to pay back the note in weekly installments of $1,419, which includes interest, for a total term of 15 months from commencement. The interest paid over the maturity period totals $22,336 (45.6% per annum). For the year ended December 31, 2022 and for the period December 13, 2021 through December 31, 2021, Gladiator paid $155 and $240 in interest expense related to this note, respectively. The note has been fully paid off.\nOn August 20, 2021, Gladiator received $25,500 from their supplier, Kapitus Servicing Inc. Gladiator agreed to pay back the note in weekly installments of $519, which includes interest, for a total term of 15 months from commencement. The interest paid over the maturity period totals $8,205 (46.5% per annum). For the year ended December 31, 2022 and for the period December 13, 2021 through December 31, 2021, Gladiator paid $4,514 and $541 in interest expense related to this note, respectively. The note has been fully paid off.\nOn September 15, 2022, Gladiator received additional funding of $150,000 from their supplier, Kapitus Servicing Inc. The Company agreed to pay back the note in weekly installments of $3,003, which includes interest, for a total term of 15 months from commencement. The interest paid over the maturity period totals $45,000 (24% per annum). For the year ended December 31, 2022, Gladiator paid $18,018 in interest expense related to this note.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\n(b)\nOn September 23, 2021, Mr. Sierra resigned from his position of employment with USS. As a result, USS agreed to repurchase 100 shares of common stock held by Mr. Sierra and in exchange, issued a promissory note with a repurchase amount of $637,500. The repurchase amount was reduced by $405,545 as a result of distributions to Mr. Sierra from the Company. The remaining value of $231,955 is to be repaid through the promissory note. This note bears no interest and monthly installment payments are payable over 4 years beginning November 15, 2021. The promissory note was discounted at 6% prior to acquisition, however, was recognized at fair value upon the acquisition of USS by James Maritime, for an adjusted fair value of $182,773. As of December 31, 2022, the note has an outstanding principal of $168,276.\n(c)\nOn May 31, 2022, USS entered into a promissory note agreement with IOU Central Inc. for $336,000, which matures on November 29, 2023. The Company agreed to pay back the note in weekly installments of $5,690 and a final payment of $2,831, which includes interest, as well as incudes $1,038 attributable to the weekly loan guarantee fee. An origination fee of $36,000 and a loan guarantee fee of $81,000 are included in the principal was charged and discounted against the note over the term. As of December 31, 2022, the note has an outstanding principal balance of $211,246 and a debt discount of $68,646.\n10. Loans, current and non-current\nThe following table summarizes the outstanding loans amount owed by the Company:\nAs of December 31,\nQuattro Capital (a)\n$ 237,500\n$ -\nMerchant cash advances (b)\n206,680\n-\nVehicle loans (c)\n117,971\n-\nNewtek (d)\n395,973\n-\nSBA Loan (e)\n67,800\n67,800\nWestwood settlement (f)\n50,000\n-\nTotal loans outstanding\n$ 1,075,924\n$ 67,800\nLoans, current portion\n585,831\n-\nLoans, excluding current\n490,093\n67,800\n(a)\nOn December 9, 2022, Gladiator entered into a collateralized loan of the Companys inventory with Quattro Capital LLC, a third-party lender. The Company received $250,000, maturing 60 days after the effective date, or February 9, 2023. The Company is responsible for paying additional fees related to the escrow agent and brokers in the amounts of $6,000 and $6,500, which is included in the loan balance as a debt discount. The interest will accrue at a non-compounding rate of 25% of the total loan value upon maturity (or $62,500). Penalty interest of $1,200 will accrue daily after the maturity date until the full value of the loan is paid. As of the date these consolidated financial statements are filed, the loan is in default.\n(b)\nOn September 16, 2022, Gladiator entered into a collateralized loan of the Companys future receipts of receivables with Pinnacle Business Funding LLC (PBF). The Company receivednet amount of $145,500 (net of $$4,500 paid for ACH fees) in exchange for $202,500 receivables purchased by PBF. The Company agreed to pay $6,328 per week as funds are made available to be sent to PBF until paid off in its entirety. As of December 31, 2022, $77,368 remains outstanding ($107,578 principal netted against $30,210 of a debt discount).\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\n(b)\nOn November 18, 2021, USS entered into a collateralized loan of the Companys future receipts of receivables with GHI Funding, LLC (GHI). The Company received a net amount of $180,000 (net of $20,000 paid for ACH fees) in exchange for $300,000 receivables purchased by GHI. The Company agreed to pay $2,600 every day for which funds are available to be sent to GHI until paid off in its entirety. As of December 31, 2022, $103,312 remains outstanding.\nOn December 28, 2021, USS entered into a collateralized loan of the Companys future receipts of receivables with Adar Funding, LLC (AF). The Company received a net amount $180,000 (net of $20,000 paid for ACH fees) in exchange for $300,000 receivables purchased by AF. The Company agreed to pay $5,000 every day for which funds are available to be sent to AF until paid off in its entirety. As of December 31, 2022, $26,000 remains outstanding.\n(c)\nUpon acquisition of USS at September 23, 2022, the Company assumed the liabilities for eleven vehicle loans from USS which together had an outstanding total amount of $140,300. During the period beginning September 23, 2022 and ended December 31, 2022, the Company made principal repayments of $47,268 for its vehicle loans. At December 31, 2022, the total amount outstanding is $117,971 with 9 vehicle loans currently outstanding. The Company currently has loans for vehicles with interest rates between 0% and 12.6%, per annum. Monthly payments range from $98 to $695, with an aggregate monthly payment of $4,923. All loans have a term between 1 and 6 years.\n(d)\nOn December 30, 2020, USS entered into a $466,000 loan agreement (NewTek loan) with an outside lender, NewTek Small Business Finance, LLC. The U.S. Small Business Administration (SBA) agreed to guarantee up to 75% of the NewTek loan principal in exchange for a guaranty fee of $10,485. Under the terms of the NewTek loan, the interest rate is the prime rate, plus 2.75% and may be adjusted every change period (every quarter). The interest rate is originally stated at 6%. Monthly installment payments, which include interest, began on February 2, 2021.\n(e)\nOn March 3, 2021, the Company received a loan from the U.S. Small Business Administration (SBA) in the amount of $67,900 with an interest rate of 3.75% per annum. The loan is due and payable thirty (30) years from the date of the note. During 2021 the SBA announced it would be waiving the interest accrual for the first year on new disaster loans, therefore interest accrued as of December 31, 2021 remained $nil. Interest accrued and expensed for the year ended December 31, 2022 is $2,114.\n(f)\nOn July 9, 2021, USS sold $685,000 of their receivables in a purchase agreement with an outside lender, Westwood Funding Solutions, LLC (Westwood). The purchase price of the receivables totaled $685,000, with the Company receiving net proceeds of $500,000 after applicable fees were deducted. The Westwood Funding agreement was guaranteed by the USS CEO. On December 27, 2022, Westwood entered into a settlement agreement with USS for an amount of $125,000. On December 28, 2022 $75,000 was paid towards this balance. The remaining $50,000 as of December 31, 2022 is owed in monthly installments of $10,000 until paid off.\n11. Convertible Notes\nOn February 8, 2021, Gladiator entered into a note agreement with Pink Holdings LLC. The Company received $10,000 at a 6% interest rate per annum, maturing on February 7, 2022. All principal and interest are due upon maturity. The issuer of the note has the option to convert any part, or all of the outstanding interest or principal amount owed into fully paid and non-assessable shares of common stock of the Company at a stock price at the lower of 10% of the lowest trading price during the 5-trading day period ending on the conversion date per share. As of the year ended December 31, 2021, the Company accrued $505 in interest related to this note. Due to the variable nature of the conversion feature, this note was determined to contain a derivative liability. It was valued using the Black-Scholes pricing model with the following inputs: 23,344 shares, stock price of $4.50, exercise price of $0.45, 1 year term, and volatility of 271%.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nOn February 26, 2021, Gladiator entered into a note agreement with Pink Holdings LLC. The Company received $25,000 at a 6% interest rate per annum, maturing on February 25, 2022. All principal and interest are due upon maturity. The issuer of the note has the option to convert any portion, or all of the outstanding interest or principal amount owed into fully paid and non-assessable shares of common stock of the Company at a stock price at the lower of 10% of the lowest trading day period ending on the conversion date per share. As of the year ended December 31, 2021, the Company accrued $1,265 in interest related to this note. Due to the variable nature of the conversion feature, this note was determined to contain a derivative liability. It was valued using the Black-Scholes pricing model with the following inputs: 58,369 shares, stock price of $4.50, exercise price of $0.45, 1 year term, and volatility of 272%.\nAs of December 31, 2022, these notes have not been converted and are overdue.\n12. Common shares to-be-issued\nOn December 23, 2022, the Company received $50,000 as consideration for 50,000 common shares to an officer. These shares were not issued until after year-end, resulting in a liability rather than equity transaction as of the year ended December 31, 2022.\n13. Stockholders Equity\nCommon Stock\na. Authorized\nThe Company is authorized to issue 90,000,000 shares of common stock, each with a par value of $0.001.\nb. Transactions during 2022\nOn February 28, 2022, the Company issued 50,000 shares of common stock at a price of $1 per share to an officer. The Company received $50,000 on consideration for the shares issued.\nOn May 12, 2022, the Company issued 100,000 shares of common stock at a price of $1 per share. The Company received a total of $100,000 from two separate investors as consideration for the shares issued.\nOn September 23, 2022, The Company issued 1,000,000 shares of common stock at a price of $1 per share as part of a stock-exchange agreement, resulting in the acquisition of United Security Specialists, Inc. (see Note 4 - USS Stock Exchange Agreement). 940,000 of those shares were issued to an officer of USS.\nOn October 11, 2022, the Company issued 100,000 units as part of a share purchase agreement. Each unit includes 1 common restricted share and a warrant to purchase 10 additional restricted shares for a purchase price equal to $3.50 per share.\nOn October 14, 2022, the Company issued 100,000 shares of common stock at a price of $1 per share to an officer. The Company received $100,000 in consideration of the shares issued.\nOn October 14, 2022, the Company issued 300,000 shares of common stock for consulting services received, resulting in recognition of $300,000 in the consulting expenses account.\nc. Transactions during 2021\nOn April 9, 2021, the Company issued 50,000 shares of common stock at a price of $0.50 per share. The Company received $25,000 in consideration for the shares issued.\nOn June 2, 2021 the Company issued 200,000 as compensation for consulting services received, resulting in recognition of $100,000 in the consulting expenses account.\nOn July 20, 2021, as compensation for consulting service performed, the Company issued 750,000 shares of common stock equivalent to $375,000 to each of the following related parties: the Companys CEO, the Companys CFO, and a Director of the Company.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nOn July 20, 2021, the Company converted 1,600,000 Preferred shares into 750,000 of Common shares to a related party. See preferred stock section for more detail.\nOn August 25, 2021, the Company paid $5,000 and issued 100,000 shares of common stock at a price of $0.50 per share as consideration for legal services received. As a result of this transaction, the Company recognized $55,000 of legal expenses.\nOn December 27, 2021 the Company issued 866,667 shares of common stock at a price of $0.50 per share as part of a stock exchange agreement, resulting in the acquisition of Gladiator (see Note 3 - Gladiator Stock Exchange Agreement).\nOn December 27, 2021, as compensation for consulting services performed, the Company issued 250,000 shares of common stock to the Director of the Company, at a price of $0.50 per share, resulting in $125,000 recognized in related party consulting expenses.\nPreferred Stock\na. Authorized and voting rights\nThe Company is authorized to issue 2,000,000 shares of its series A preferred stock, each with a par value of $0.001. Each share of the series A preferred stock has the equivalent voting power of (30) thirty shares of the Companys common stock. The series A preferred stock does not have any liquidation or dividend rights or preferences.\nb. Transactions during 2022\nNone.\nc. Transactions during 2021\nOn July 20, 2021 the Company converted 1,600,000 preferred shares held by a related party, in exchange for 750,000 shares of the Companys common stock (the July conversion). The series A preferred stock does not have any native convertible rights, preferences, or other conversion terms, and the Company had not previously signed an agreement setting conversion terms for the July conversion. Therefore, the July conversion met the requirements under ASC 260 to be considered a preferred stock extinguishment for the purposes of calculating the companys earnings per share available to common shareholders.\nWarrants\nThe following table summarizes the Companys warrant activity:\nNumber of\nWarrants\nWeighted Average\nExercise Price\nOutstanding, January 1, 2021\n-\n$ -\nGranted\n-\n-\nExercised\n-\n-\nExpired/Cancelled\n-\n-\nOutstanding, December 31, 2021\n-\n$ -\nGranted\n1,000,000\n3.50\nExercised\n-\n-\nExpired/Cancelled\n-\n-\nOutstanding, December 31, 2022\n1,000,000\n$ 3.50\nExercisable, December 31, 2021\n-\n$ -\nExercisable, December 31, 2022\n1,000,000\n$ 3.50\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\n14. Earnings Per Share\nThe earnings (loss) per share (EPS) is calculated by dividing the net loss attributable to common shareholders less any preferred dividends by the weighted average common shares outstanding during the period. Diluted earnings per share is computed by dividing net income minus preferred dividends by the weighted average number of common shares outstanding plus common stock equivalents (if dilutive).\nOn July 20,2021, the Company converted 1,600,000 shares of Series A preferred stock into 750,000 shares of common stock (see Note 9 - Shareholders Equity). The Series A Preferred Stock does not have any native convertible rights, preferences, or other conversion terms, and the Company had not previously signed an agreement setting conversion terms for the July conversion. Therefore, the July conversion met the requirements under ASC 260 to be considered a preferred stock extinguishment for the purposes of calculating the companys earnings per share available to common shareholders. Under a preferred stock extinguishment, the difference in fair value between the preferred stock and the issued securities is treated as a deemed contribution or dividend. for the purposes of calculating EPS.\nThe following table sets forth the computation of basic and diluted EPS:\nYear ended December 31,\nNet (loss) income\n$ 113,445\n$ (766,027 )\nLess: Net (loss) income attributable to noncontrolling interests\n(91,449 )\n(4,300 )\nLess: Deemed dividend due to preferred stock conversion\n-\n(331,639 )\nNet (loss) income attributable to James Maritime shareholders\n204,894\n(1,093,366 )\nWeighted average common shares outstanding- basic\n7,842,865\n5,261,343\nDilutive effect of convertible debentures and warrants\n428,886\n-\nWeighted average common shares outstanding - diluted\n8,271,751\n5,261,343\nBasic earnings (loss) per share\n$ 0.03\n$ (0.21 )\nDiluted earnings (loss) per share\n$ 0.02\n$ (0.21 )\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nThere are approximately 131,949 number of shares that are not considered in the above calculation of 2021 diluted EPS as they would be anti-dilutive in nature. These shares are attributable to convertible notes issued in 2021. No other equity instruments exist that would be applied in the calculation of diluted earnings per share in the case they were dilutive in nature.\n15. Segment Data and Disaggregated Revenue\nThe following table summarizes the Companys net revenues by distribution channel:\nYear ended December 31,\nE-commerce\n$ 15,230\n$ 695\nDirect-to-consumer\n1,803,136\n1,200\nGuard services\n2,244,756\n-\n$ 4,063,122\n$ 1,895\n16. Concentration of Risk\nThe Company is potentially subject to concentration risk in its sales revenue and sources of inventory.\nThe Company has two major customers that accounted for approximately 29% ($1,195,000) and 19% ($773,239) in sales revenue in 2022. The Company plans to maintain these relationships with customers and leverage these relationships in obtaining more clients in order to hedge their concentration risk.\nThe Company has two major suppliers that accounted for approximately 82% ($1,029,427) and 12% ($151,497) of cost of inventory sold in 2022. The Company plans to maintain these relationships with suppliers and maintains the position that other suppliers are readily available if needed, therefore mitigating any concentration risk.\n17. Income Taxes\nThere were no income tax expenses reflected in the results of operations for the years ended December 31, 2022 and 2021.\nFor the years ended December 31,\nNet income (loss) per book\n$ 113,444\n$ (766,027 )\nFederal statutory income tax rate\n23,823\n(160,866 )\nState income tax, net of federal benefit\n(114,230 )\n(30,176 )\nEmployee Retention Credit\n(621,560 )\n-\nNon-deductible amortization\n164,848\n4,650\nOther\n11,364\nValuation allowance\n535,756\n184,843\nIncome tax\n$ -\n$ -\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nThe tax effects of temporary differences which give rise to deferred tax assets (liabilities) are summarized as follows:\nFor the years ended December 31,\nNet operating loss carry forwards\n$ 846,059\n$ 296,720\nRight of use assets\n4,202\n-\nFixed assets\n(17,785 )\n-\nTotal deferred tax assets\n832,476\n296,720\nValuation allowance\n(832,476 )\n(296,720 )\nNet deferred tax assets\n$ -\n$ -\nThe Company had net operating losses of approximately $3,246,000 for both federal and state that were generated in the current year which do not expire but are subject to an 80% utilization against future taxable income.\nIn assessing the realization of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Deferred tax assets consist primarily of the tax effect of NOL carry-forwards. The Company has provided a full valuation allowance on the deferred tax assets because of the uncertainty regarding its realizability.\nThe Companys policy is to record interest and penalties associated with unrecognized tax benefits as additional income taxes in the statement of operations. As of December 31, 2022, the Company had no unrecognized tax benefits. There were no changes in the Companys unrecognized tax benefits during the years ended December 31, 2022 and 2021. The Company did not recognize any interest or penalties during the 2022 and 2021 fiscal year related to unrecognized tax benefits.\n18. Subsequent Events\nThe Company evaluated subsequent events occurring from January 1, 2023 through October 24, 2023, the date in which the consolidated financial statements were available to be issued.\nOn January 25, 2023, Gladiator entered into a collateralized loan of the Companys future receipts of receivables with BizFund, LLC. The purchase price of the receivables totaled $80,000 in exchange for $106,400 of receivables purchased by BizFund LLC. The Company agreed to weekly installment payments of $4,092 until the balance is paid off.\nOn January 30, 2023, Gladiator entered into a collateralized loan of the Companys future receipts of receivables with Emerald Group Holdings LLC. The purchase price of the receivables totaled $100,000 in exchange for $133,000 of receivables purchased by Emerald Group Holdings LLC. The Company received net proceeds of $96,500 after applicable fees are deducted. The Company agreed to weekly installment payments of $4,750 until the balance is paid off.\nDuring April 2023, Adar Funding LLC and GHI Funding LLC entered into a settlement agreement with USS on the remaining balance of their outstanding loan. The settlement agreement is in the amount of $90,000, payable monthly in sums of $10,000 for the first eight months after the agreement date, and monthly sums of $5,000 for the 9th and 10th months. All prior commitments were forgiven with this agreement.\nOn March 31, 2023, the president of the Company received the 50,000 shares he had paid for prior to year-end, recorded as common shares to-be-issued.\nJAMES MARITIME HOLDINGS INC. AND SUBSIDIARIES\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2022 AND 2021\nOn April 5, 2023, USS entered into a collateralized loan of the Companys future receipts of receivables with Velocity Group USA Inc. (Velocity). The Company received net proceeds of $332,015 (net of $17,985 paid for fees) in exchange for $497,000 receivables purchased by Velocity. The Company agreed to pay $3,381 in daily installments until the loan is paid off in its entirety.\nOn April 18, 2023, the Company received $10,000 in exchange for 10,000 common stock shares to be issued to an individual stockholder.\nOn June 8, 2023, USS entered into another collateralized loan of the Companys future receipts of receivables with Velocity. The Company received net proceeds of $56,615 (net of $3,385 paid for fees) in exchange for $87,000 of receivables purchased by Velocity. The Company agreed to pay $690 in daily installments until the loan is paid off in its entirety.\nOn June 30, 2023, USS entered into a collateralized loan of the Companys future receipts of receivables with Itria Ventures LLC (Itria). The Company received net proceeds of $57,100 (net of $2,900 paid for ACH fees) in exchange for $81,000 of receivables purchased by Itria. The Company agreed to pay $4,050 per week as funds are made available to be sent to Itria until paid off in its entirety. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nThere are not and have not been any disagreements between the Company and its accountants on any matter of accounting principles, practices or financial statement disclosure. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures:\nAs of the end of the period covered by this Form 10-K, management performed, with the participation of our principal executive officer and principal financial officer, an evaluation of the effectiveness of our disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) of the Securities and Exchange Act of 1934, as amended (the Exchange Act). Our disclosure controls and procedures are designed to ensure that information required to be disclosed in the reports we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, to allow timely decisions regarding required disclosures. Based on the evaluation, our principal executive officer and principal financial officer concluded that, as of December 31, 2022, our disclosure controls and procedures were not effective.\nDue to resource constraints, material weaknesses are evident to management regarding our inability to generate all the necessary disclosure for inclusion in our filings with the Securities and Exchanges Commission, which is due to the lack of resources and segregation of duties. We lack sufficient personnel with the appropriate level of knowledge, experience and training in GAAP to meet the demands for a public company, including the accounting skills and understanding necessary to fulfill the requirements of GAAP-based reporting. This weakness causes us to not fully identify and resolve accounting and disclosure issues that could lead to a failure to perform timely internal control and reviews. In addition, the Company has not established an audit committee, does not have any independent outside directors on the Companys Board of Directors, and lacks documentation of its internal control processes.\nManagements Report on Internal Control Over Financial Reporting: Our management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The key internal controls for the Company are provided by executive managements review and approval of all transactions. Our internal control over financial reporting also includes those policies and procedures that:\n(1) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n(2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that our receipts and expenditures are being made only in accordance with the authorization of our management; and\n(3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal controls and procedures over financial reporting as of December 31, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework. Managements assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of these controls.\nBased on this assessment, we have identified material weaknesses in our internal controls, weaknesses in our compliance with US GAAP and weaknesses in our risk assessment and monitoring. The Company lacks sufficient personnel with the appropriate level of knowledge, experience and training in GAAP to meet the demands for a public company, including the accounting skills and understanding necessary to fulfill the requirements of GAAP-based reporting. This weakness causes us to not fully identify and resolve accounting and disclosure issues that could lead to a failure to perform timely internal control and reviews. In addition, the Company has not established an audit committee, does not have any independent outside directors on the Companys Board of Directors, and lacks documentation of its internal control processes, management has concluded that as of December 31, 2022, our internal control over financial reporting was ineffective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\nAttestation Report of the Independent Public Accounting Firm\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to applicable rules of the SEC that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere were no changes in the Companys internal control over financial reporting that occurred during the last fiscal quarter that have materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information.\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nOfficers and Directors\nThe following table contains information as of December 31, 2022 as to each Officer and Director of the Company:\nName\nAge\nPosition\nKip Eardley\nPrincipal Executive Officer, President and Director\nRay Sheets\nPrincipal Financial Officer, Secretary, Treasurer\nBrett Bertolami\nDirector\nDean Polizzotto\nDirector\nKip Eardley, President, 64, Chairman of the Board\nMr. Eardley is the CEO and president of Capital Advisors, LLC, which has specialized in corporate finance and restructuring and as a business development consultant since 1989. He has more than 30 years of experience implementing his management and business development skills to facilitate business growth internally and through acquisitions as an owner, principle, or advisor of more than 75 private and publicly traded companies. Capital Advisors has had a primary focus of assisting companies with business development and corporate finance for private and public corporations. Since 2011 Mr. Eardley has directed his interests and efforts into the corporate security, real estate development and the energy spaces. Mr. Eardley currently serves as the Principal Executive Officer, President and Director of James Maritime Holdings, Inc..\nRaymond Sheets, 58, CFO, Secretary and Treasurer\nMr. Sheets has a Bachelor of Science in Business Administration majoring in accounting with a minor in finance, marketing and economics. He then obtained his CPA certification while working for a small accounting firm specializing in government audits and small business and individual taxes. While working he attended night school at Cleveland Marshal College of Law where he obtained a Law Degree. While attending Law School Raymond opened his own accounting firm specializing in small business taxes and consulting which is still operating today. While in Law School Raymond became a serial entrepreneur leading to multiple business ownership. Raymond purchased or co-founded multiple business maintaining hands on management in multiple ventures with more than 500 individuals. Mr. Sheets currently serves as the Principal Financial Officer, CFO, Secretary, Treasurer of James Maritime Holdings, Inc\nDean A. Polizzotto, 55, Director\nMr. Polizzotto is the Director of international procurement J.P. Instruments for facilities in California, Hong Kong and Shanghai, leading a team of 16 employees to organize and source manufacturers for electronic hardware, injection molded parts, and machined aircraft parts, and act as the liaison between manufacturers overseas in China, Taiwan, Hong Kong, Korea and Singapore, and J.P. Instruments. Mr. Polizzotto has a broad familiarity with a majority of avionics systems for both commercial and light aircraft and is familiar with the operation of GPS based navigation instrumentation, as well as military drone propulsion systems, aircraft fuel flow meters and engine data and temperature analyzers.\nMr. Polizzotto completed a SJD (Doctor of Juridical Science) and LLM Degree in Chinese Law from the University of Hong Kong where he Studied all aspects of Chinese law, government, politics, including Chinese and international financial markets, international trade, Chinese bankruptcy law, current trends in international finance, Chinese trade law, the WTO framework and Chinas reform as part of its WTO commitments and completed Juris Doctorate from the Chapman University College of Law. Dean Polizzotto currently serves as a Director of James Maritime Holdings, Inc.\nBrett Bertolami, 54, Director\nMr. Bertolami has a degree in Economics and Psychology from UNC Charlotte and has used his education to benefit his career which has been primarily in the automotive industry and investing. Brett served in all aspects of the new and used automotive industry, from mechanic to manager of retail and fleet sales, as well as general manager and owner of a successful Ford dealership in Charlotte. For the past 10 years Mr. Bertolami has served as an advisor to, and director of, various private and public corporations and funded and managed the construction of residential projects. Brett is also an active investor in the stock market and emerging growth companies. Mr. Bertolami currently serves as a Director of James Maritime Holdings, Inc.\nFamily Relationships\nNone.\nInvolvement in Certain Legal Proceedings\nNo executive officer or director has been involved in the last ten years in any of the following:\n·\nAny bankruptcy petition filed by or against any business or property of such person, or of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n·\nAny conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n·\nBeing subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities;\n·\nBeing found by a court of competent jurisdiction (in a civil action), the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n·\nBeing the subject of or a party to any judicial or administrative order, judgment, decree or finding, not subsequently reversed, suspended or vacated relating to an alleged violation of any federal or state securities or commodities law or regulation, or any law or regulation respecting financial institutions or insurance companies, including but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail, fraud, wire fraud or fraud in connection with any business entity; or\n·\nBeing the subject of or a party to any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act, any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCorporate Governance by Board - Meetings, Committees and Audit Committee Financial Expert\nIn general, Boards of Directors have responsibility for risk management responsibilities and establishing broad corporate policies and reviewing overall performance rather than day-to-day operations. Also, a primary responsibility of a Board is to oversee the management of the Company and, in doing so, serve the best interests of the Company and its stockholders. Boards select, evaluate and provide for the succession of executive officers and, subject to stockholder election, directors. Boards review and approve corporate objectives and strategies and evaluate significant policies and proposed major commitments of corporate resources. Boards of Directors also participate in decisions that have a potential major economic impact on the Company. Management keeps directors informed of company activity through regular communication, including written reports and presentations at Board and committee meetings.\nWe do not currently have regularly scheduled quarterly Board meetings, nor do we have standing audit, nominating or compensation committees of our Board of Directors, or any committee performing similar functions. Our Board of Directors performs the functions of audit, nominating and compensation committees. As of the date of this report, no member of our Board of Directors qualifies as an audit committee financial expert as defined in Item 407(d)(5) of Regulation SK promulgated under the Securities Act.\nThe Company is evaluating expansion of its current Board of Directors, including the addition of an independent board member with sufficient accounting and financial experience to chair an audit committee, as well as creating charters for its contemplated audit committee and compensation committee.\nDirector Nominations\nAs of December 31, 2022, we did not affect any material changes to the procedures by which our shareholders may recommend nominees to our board of directors. We have not established formal procedures by which security holders may recommend nominees to the Companys board of directors.\nCode of Ethics\nWe have adopted a code of ethics that applies to our principal executive officer, principal financial officer and principal accounting officer, or persons performing similar functions. A copy of our code of ethics may be obtained free of charge by contacting us at the address or telephone number listed on the cover page hereof.\nSection 16 Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934 requires our directors, executive officers and significant stockholders (defined by statute as stockholders beneficially owning more than 10% of our common stock) to file with the SEC initial reports of beneficial ownership, and reports of changes in beneficial ownership, of our common stock. Directors, executive officers and significant stockholders are required by SEC regulations to furnish us with copies of all Section 16(a) forms they file. Based solely on a review of the copies of Forms 3, 4 and 5 (and amendments thereto) filed with the SEC and submitted to us, and on written representations by certain directors and executive officers received by us, we believe that all of our executive officers, directors and significant stockholders complied with all applicable filing requirements under Section 16(a) during the year ended December 31, 2022. Item 11. Executive Compensation.\nSummary Compensation Table\nThe following table shows for the fiscal years ended December 31, 2022 and December 31, 2021 compensation awarded to or paid to, or earned by, our President, Chief Executive Officer and Chief Financial Officer (the Named Executive Officers).\nName and Principal Position\nYear\nSalary ($)\nBonus ($)\nStock\nAwards ($)\nAll Other Compensation ($)\nTotal ($)\nKip Eardley\n$ -\n$ -\n$ 125,000\n$ 10,000\n$ 135,000\n(President)\n$ 0\n$ -\n$ -\n$ 28,000\n$ 28,000\nRay Sheets\n$ -\n$ -\n$ 125,000\n$ -\n$ 125,000\n(Treasurer, Secretary)\n$ 0\n$ -\n$ -\n$ 10,000\n$ 10,000\nNarrative Disclosure to Summary Compensation\nKip Eardley - Effective July 2021, the Company issued common shares to Kip Eardley, the Companys President and Director for services rendered through the 2023 calendar year. Management will enter into a long-term employment agreement that will coincide with funding and revenue targets for the Company.\nRay Sheets - Effective July 2021, the Company issued common shares to Ray Sheets as the Companys Secretary, Treasurer and CFO. In June of 2023 Mr. Sheets entered into an employment agreement with the Companys wholly owned subsidiary as its CFO on a full-time basis by the Companys main operating subsidiary, United Security Services.\nEquity Awards\nOn July 20, 2021, as compensation for services performed, the Company issued 250,000 shares of common stock equivalent to $125,000 to Kip Eardley the Companys President and Director.\nOn July 20, 2021, as compensation for services performed, the Company issued 250,000 shares of common stock equivalent to $125,000 to Ray Sheets the Companys Treasurer, Secretary and Director.\nCompensation of Directors\nName and Principal Position\nYear\nSalary ($)\nBonus ($)\nStock\nAwards ($)\nAll Other Compensation ($)\nTotal ($)\nKip Eardley\n$ -\n$ -\n$ 125,000\n$ 10,000\n$ 135,000\n(Director)\n$ -\n$ -\n$ -\n$ 28,000\n$ 28,000\nRay Sheets\n$ -\n$ -\n$ 125,000\n$ -\n$ 125,000\n(Director)\n$ -\n$ -\n$ -\n$ 10,000\n$ 10,000\nDean Polizzotto\n$ -\n$ -\n$ 125,000\n$ -\n$ 125,000\n(Director)\n$ -\n$ -\n$ -\n$ -\n$ -\nBrett Bertolami\n$ -\n$ -\n$ 125,000\n$ -\n$ 125,000\n(Director)\n$ -\n$ -\n$ -\n$ -\n$ -\nNarrative Disclosure to Summary Compensation\nKip Eardley - Effective July 2021, the Company issued 250,000 common shares as compensation for services to Kip Eardley, the Companys President and Director. The term of the employment agreement runs through December 2023.\nRay Sheets - Effective July 2021, the Company issued 250,000 common shares of the Company to Ray Sheets, the Companys Treasurer, Secretary and CFO. The term of the employment agreement runs through December 2023.\nDean Polizzotto - Effective July, the Company issued 250,000 common shares of the Company to Dean Polizzotto, the Companys Director. The term of the employment agreement runs through December 2023.\nBrett Bertolami - Effective July 2021, the Company issued 250,000 common shares of the Company to Bret Bertolami, the Companys Director. The term of the employment agreement runs through December 2023.\nEquity Awards\nOn July 20, 2021, as compensation for services performed, the Company issued 250,000 shares of common stock equivalent to $125,000 to Kip Eardley the Companys President and Director.\nOn July 20, 2021, as compensation for services performed, the Company issued 250,000 shares of common stock equivalent to $125,000 to Ray Sheets the Companys Treasurer, Secretary and Director.\nOn July 20, 2021, as compensation for services performed, the Company issued 250,000 shares of common stock equivalent to $125,000 to Brett Bertolami the Companys Director.\nOn December 27, 2021, as compensation for services performed, the Company issued 250,000 shares of common stock equivalent to $125,000 to Dean Polizzotto the Companys Director. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth, as of November 2, 2023, certain information with regard to the record and beneficial ownership of the Companys common stock by (i) each person known to the Company to be the record or beneficial owner of 5% or more of the Companys common stock, (ii) each director of the Company, (iii) each of the named executive officers, and (iv) all executive officers and directors of the Company as a group:\nName\nShares of Common Stock Beneficially Owned\nPercent of Class\nTotal\nVoting Percentage for all Classes (fully-diluted)(1)\nKip Eardley(2)\n250,000\n2.8%\n250,000\n1.2%\nDean Polizzotto(2)\n250,000\n2.8%\n250,000\n1.2%\nRaymond W Sheets(2)\n250,000\n2.8%\n250,000\n1.2%\nBrett Bertolami(2)\n250,000\n2.8%\n250,000\n1.2%\nMatthew C. Materazo\n680,000\n7.5%\n680,000\n3.2%\nMercey Falls and CN Corp(3)\n500,000\n5.5%\n500,000\n2.4%\nHuntsman Holdings, Inc.(4)\n500,000\n5.5%\n500,000\n2.4%\nMichelle Turpin\n750,000\n8.23%\n750,000\n3.6%\nKyle Madej\n1,140,000\n12.58%\n1,140,000\n5.4%\nThree Rivers Consulting, LLC(5)\n1,150,700\n12.7%\n1,150,700\n5.5%\nAll Directors/Director nominees and executive officers as a group (4 persons)\n1,000,000\n11.03%\n1,000,000\n4.7%\n__________________\n(1)\nBased on 21,064,129 fully diluted votes based on 400,000 shares of Series A Preferred Stock voting at a rate of 30:1.\n(2)\nDenotes an Officer or Director of the Company.\n(3)\nMercey Falls and CN Corp is beneficially owned by Lieba Chanin, its sole officer and director.\n(4)\nHuntsman Holdings, Inc. is beneficially owned by Hunter Nevitt, its sole officer and director.\n(5)\nThree Rivers Consulting, LLC is beneficially owned by Brian Jacobelli, its sole member and owner. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCertain Relationships and Related Transactions\nNone.\nCorporate Governance and Director Independence\nThe Company has not:\n·\nestablished its own definition for determining whether its directors and nominees for directors are independent nor has it adopted any other standard of independence employed by any national securities exchange or inter-dealer quotation system, though our current director would not be deemed to be independent under any applicable definition given that he is an officer of the Company; nor\n·\nestablished any committees of the board of directors.\nGiven the nature of the Companys business, its limited stockholder base and the current composition of management, the board of directors does not believe that the Company requires any corporate governance committees at this time.\nAs of the date hereof, the entire board serves as the Companys audit committee. Item 14. Principal Accounting Fees and Services.\nIndependent Public Accountants\nOn March 30, 2023, Tanner, LLC, the independent registered public accounting firm for JMTM, was engaged by the Company as its independent registered public accounting firm.\nAudit Fees\nThe aggregate fees billed for the two most recently completed fiscal years ended December 31, 2022 and 2021, for professional services rendered by Tanner, LLC, for the audit of our annual consolidated financial statements, quarterly reviews of our interim, unaudited consolidated financial statements and services normally provided by the independent accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nDecember 31,\nYear Ended\nDecember 31,\nAudit Fees and Audit Related Fees\n$ 84,906.11\n$ 60,682.04\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 84,906.11\n$ 60,682.04\nIn the above table, audit fees are fees billed by our companys external auditor for services provided in auditing our companys annual financial statements for the subject year. Audit-related fees are fees not included in audit fees that are billed by the auditor for assurance and related services that are reasonably related to the performance of the audit review of our companys financial statements. Tax fees are fees billed by the auditor for professional services rendered for tax compliance, tax advice and tax planning. All other fees are fees billed by the auditor for products and services not included in the foregoing categories. Item 15. Exhibits, Financial Statement Schedules.\nExhibit No.\nDescription\n3.1\nAmended and Restated Articles of Incorporation\n3.2\nCertificate of Amendment Series A Preferred Filed with the State of Nevada on April 2, 2021\n3.3\nAmended and Restated By-Laws\n10.1\nForm of Note Agreement\n10.2\nForm of Officers and Directors Agreement\n14.1\nCode of Ethics\n31.1\nCertification of Principal Executive Officer required under Rule 13a-14(a)/15d-14(a) under the Exchange Act.*\n31.2\nCertification of Principal Financial Officer required under Rule 13a-14(a)/15d-14(a) under the Exchange Act.*\n32.1\nCertification of Principal Executive Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n32.2\nCertification of Principal Financial Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n101.INS\nInline XBRL Instance Document.*\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.*\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.*\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.*\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.*\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).*\n____________\n* Filed herewith.\nItem 16. Form 10-K Summary.\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJAMES MARITIME HOLDINGS INC.\nDate: November 2, 2023\nBy:\n/s/ Kip Eardley\nKip Eardley\nPresident (Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Kip Eardley\nPresident\nNovember 2, 2023\nKip Eardley\n(Principal Executive Officer )"
}