{
    "cik": "90168",
    "company": "SIFCO INDUSTRIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-23",
    "period_of_report": "2022-09-30",
    "sic": "3724",
    "state_of_inc": "OH",
    "state_location": "OH",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/90168/0000090168-22-000053-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/90168/000009016822000053/sif-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/90168/0000090168-22-000053.txt",
    "filename": "90168_10K_2022_0000090168-22-000053.htm",
    "content": "Item 1. Business\nA.The Company\nSIFCO Industries, Inc. (\"SIFCO,\" \"Company,\" \"we\" or \"our\"), an Ohio corporation, was incorporated in 1916. The executive offices of the Company are located at 970 East 64th Street, Cleveland, Ohio 44103, and its telephone number is (216) 881-8600.\nSIFCO is engaged in the production of forgings, sub-assemblies, and machined components primarily for the Aerospace and Energy (\"A&E\") markets. The processes and services include forging, heat-treating, chemical processing and machining. The Company's operations are conducted in a single business segment. Information relating to the Company's financial results is set forth in the consolidated financial statements included in Item 8 of this Annual Report on Form 10-K.\nImpact of COVID-19 & Other Factors\nThe lingering impact and residual effects of the coronavirus (\"COVID-19\") pandemic, along with other factors, such as ongoing geopolitical tensions, have created strains on supply chains, and general economic conditions. While the exact timing and pace of recovery in our markets continues to be indeterminable, there are indications that commercial air travel is steadily recovering in certain areas. The long-term outlook remains positive given the nature of the industry, there continues to be uncertainty with respect to when commercial air traffic will return to pre-COVID-19 levels. Given the fluidity of the situation, it is still unclear how lasting and deep the ongoing economic impacts of COVID-19 will last.\nDuring fiscal 2022, the effects of COVID-19 continued to have an impact on the Companys results of operations. The Company has been impacted by delays in receiving orders and obtaining materials required to produce certain products. As sales volumes have fluctuated, the Company has taken measures to reduce costs by furloughing certain of its employees from time to time at one of its plant locations. Additionally, our operations are subject to global economic and geopolitical risks. For example, while the Company does not have a presence in these regions, the ongoing conflict between Russia and Ukraine has impacted economic activity as well as the availability and price of raw materials and energy. The Company continues to actively monitor these factors and find ways to mitigate the impact on its operations.\nB.Principal Products and Services\nOperations\nSIFCO is a manufacturer of forgings and machined components for the A&E markets. We provide our customers with envelope and precision forgings, rough and finished machined components, as well as sub-assemblies. SIFCO services both original equipment manufacturers (\"OEM\") and aftermarket customers with products that range in size from approximately 2 to 1,200 pounds. The Company's strategic vision is to build a leading A&E company positioned for long-term, stable growth and profitability.\nSIFCO's long-term plan is to have a balance comprised of military and commercial aerospace revenues, supplemented with energy, commercial space, and adjacent market components. In fiscal 2022, commercial and military revenues accounted for 47.4% and 52.6% of revenues, respectively, compared with 36.7% in commercial revenues and 63.3% in military revenues in fiscal 2021. The Company's capabilities are focused on supplying critical components, consisting primarily of steel, high temperature alloys, nickel alloys, titanium and aluminum.\nSIFCO operates from multiple locations. SIFCO manufacturing facilities are located in Cleveland, Ohio (\"Cleveland\"); Orange, California (\"Orange\"); and Maniago, Italy (\"Maniago\"). SIFCO's operations are AS 9100D and/or ISO 9001:2015 certified and the Company also holds multiple National Aerospace and Defense Contractors Accreditation Program (NADCAP) certifications and site approvals from key OEM customers. During fiscal year 2022, the Company was subject to a NADCAP audit in Orange pursuant to which maintenance issues were identified that required remediation in order to meet the requisite qualifications for NADCAP Certification. The Company temporarily lost NADCAP Certification at its Orange location in the third quarter of fiscal 2022 and was required to outsource the process that required such certification to a third party. The Company has since regained such NADCAP Certification in Orange in the first quarter of fiscal 2023 and has been able to fully resume operations.\nThe Company's success is not dependent on patents, trademarks, licenses or franchises.\nRaw Materials\nWhile the effects from the COVID-19 pandemic disrupted the global supply chain and availability of raw materials, SIFCO generally has multiple sources for its raw materials, which consist primarily of high-quality metals essential to its business. Suppliers of such materials are located principally in North America and Europe. SIFCO generally does not depend on a single source for the supply of its materials. Due to the limited supply of certain raw materials, some material is provided by a small number of suppliers; however, SIFCO believes that its sources are adequate for its business. The Company has experienced delays in the supply chain, which could effect our ability to timely obtain materials and components from our suppliers in the quantities we require or on favorable terms. As a result of supply chain disruptions and inflationary pressures, the Company has experienced increases in pricing for raw materials which could effect our customer demand and cost. However, SIFCO believes that its ability to pass through raw material costs on certain contractual agreements and discrete orders limits this exposure. For those contractual agreements, in which pass through pricing is not permissible, a material adverse effect upon the profitability of one or more of the affected contracts, future period financial reporting and performance may result.\nProducts\nSIFCOs products are made primarily of steel, high temperature alloys, nickel alloy, titanium and aluminum. SIFCO's product offerings include: OEM and aftermarket components for aircraft and industrial gas turbine engines; steam turbine blades; structural airframe components; aircraft landing gear components; aircraft wheels and brakes; critical rotating components for helicopters; and commercial/industrial products. SIFCO also provides heat-treatment, surface-treatment, non-destructive testing and select machining and sub-assembly of forged components.\nIndustry\nThe performance of the domestic and international air transport industry, the energy industry, as well as government defense spending, directly and significantly impact the performance of SIFCO. The impact of COVID-19 continues to be assessed by the Company as it has significantly impacted the commercial aerospace industry through the ongoing disruption of global travel, which remains uncertain. Therefore, as the effects of the pandemic continue to be fluid and ever changing, the shape and speed of recovery for the commercial aerospace industry remain uncertain. While demand for travel declined at a rapid pace beginning in the second half of our fiscal 2020 and has remained depressed compared to pre-pandemic levels, commercial air travel has progressively shown signs of recovery in recent months with increasing air traffic, primarily in certain domestic markets. The recovery in international commercial air travel has been slower with international travel moderately recovered from COVID-19 pandemic lows. The exact pace and timing of the commercial air travel recovery remains uncertain and is expected to continue to be uneven depending on factors such as trends in the number of COVID-19 infections (e.g., impact of new variants of COVID-19 resurfacing), the continued efficacy and public acceptance of vaccines and easing of quarantines and travel restrictions, among other factors.\nSIFCO supplies new and spare components to the U.S. military for aircraft, helicopters, vehicles, and munitions. The Company's top programs include Blackhawk (H60), V-22, C-130 and. The defense budget in the United States varies from year to year, driven by defense procurement policy and government budget constraints. Coming out of the pandemic, the defense aerospace market has been impacted by COVID overproduction and build rates. Uncertainty may arise if the government reprioritizes funding as a result of, among other factors, potential changes in the threat environment, defense spending levels, government priorities, political leadership, procurement strategy, military strategy and planning, and broader changes in social, economic or political demands or priorities. Certain programs in which the Company participates have seen favorable trends, which are expected to continue.\nSIFCO supplies new and spare components for commercial aircraft, principally for large aircraft produced by Boeing and Airbus. As the pandemic has continued, the decrease in passenger air travel demand has impacted and continues to impact our customers' orders for new aircraft. Current estimates regarding the return of passenger air traffic to pre-COVID-19 levels is another two to four years as recovery has been extremely uneven. Increases in domestic leisure travel has led to some recovery and domestic business travel is expected to pick-up later into 2023, while international travel continues to lag as individual countries and regions have experienced varied recovery from, and resurgences in, the spread of COVID-19. Therefore, build rates, particularly the Boeing 777-9 (formerly 777X), 787, 737 Max and the Airbus A350, declined and partially rebounded in 2022, but not as quickly as previously anticipated.\nSIFCO supplies new and spare components to the energy industry, particularly the industrial gas and steam turbine markets. While alternative energy markets continue to strengthen, oil and gas prices are expected to rebound given rising gas prices from historic lows. As such, it's currently anticipated that purchases of parts and supplies within the industry will increase. SIFCO has positioned itself to be less dependent on OEM production, but with flexibility to address the demand cycle in this segment as well as continuing to support the aftermarket.\nSIFCO also supplies components to the commercial space industry, which is rapidly evolving. An increasing number of commercial companies are participating in the space launch and reentry industry, which brings continuous development, innovation in technologies, and new approaches in this market. We believe there is an opportunity for SIFCO to gain an increased market share as this industry continues to evolve and grow.\nCompetition\nSIFCO competes with numerous companies, both in and tangential to the A&E industry, of which fifteen are known by SIFCO. SIFCO competes with both U.S. and non-U.S. suppliers of forgings, some of which are significantly larger than SIFCO; however, our competitors range from companies focused on the A&E markets to large diversified corporations that may also have business interests outside of the A&E markets to smaller companies that offer a limited portfolio of products in this market. SIFCO believes that it has an advantage and distinguishes itself in the primary markets it serves due to its: (i) demonstrated A&E expertise; (ii) focus on quality and customer service; (iii) operating initiatives such as SMART (Streamlined Manufacturing Activities to Reduce Time/Cost) and Six Sigma; and (iv) broad range of capabilities and offerings. As customers establish and utilize new facilities throughout the world, SIFCO will continue to encounter non-U.S. competition. SIFCO believes it can expand its market share by (i) continuing to increase capacity utilization; (ii) broadening its product lines through investment in equipment that expands its manufacturing capabilities; and (iii) developing new customers in markets where the participants require similar technical competence and service as those in the A&E industries. See further discussion of the risks relating to competition SIFCO faces in Item 1A. Risk Factors\nSet forth below are material risks and uncertainties that could negatively affect our business and financial condition and could cause our actual results to differ materially from those expressed in forward-looking statements contained in this report. Additional risks and uncertainties not presently known to us or that we currently deem immaterial also may impair our business operations and financial condition. We face risks related to the COVID-19 pandemic, its affects, and actions in response thereto, which have exacerbated or could further exacerbate conditions in our risk factors noted below.\nRisks Related to Our Business and Operations\nWe are subject to the cyclical nature of the A&E industries and the continuing or further downturn in these industries could adversely impact the demand for our products.\nThe commercial aerospace industry is historically driven by the demand from commercial airlines for new aircraft. Demand for commercial aircraft is influenced by airline industry profitability, trends in airline passenger traffic, the state of U.S. and world economies, the ability of aircraft purchasers to obtain required financing and numerous other factors including the effects of terrorism, health and safety concerns and environmental constraints imposed upon aircraft operators. The commercial aerospace industry has been significantly impacted by the COVID-19 pandemic and may continue to be negatively impacted for a prolonged period of time and the magnitude of the impacts of the COVID-19 pandemic on this industry cannot be fully understood at this time. We have experienced changes in demand from our customers in this market and the reduction in demand for commercial aircraft will adversely impact our net sales and operating results.\nIn addition to the near term impact of the COVID-19 pandemic on the commercial aerospace industry, there is risk that the industry implements longer-term strategies involving reduced capacity, shifting route patterns, and mitigation strategies related to impacts from COVID-19 and the risk of future public health crises. Furthermore, airlines may experience reduced demand due to reluctance by the flying public to travel due to travel restrictions and/or social distancing requirements. As a result, there is significant uncertainty with respect to when commercial air traffic levels will fully recover, and whether and at what point capacity will return to and/or exceed pre-COVID-19 levels. The COVID-19 pandemic also has increased uncertainty with respect to global trade volumes, which could put negative pressure on cargo traffic levels. Any of these factors would have a significant impact on the demand within the commercial aerospace industry. In addition, a lengthy period of reduced industry-wide demand for commercial aircraft could put additional pressure on our suppliers, resulting in increased procurement costs and/or additional supply chain disruption. To the extent that the COVID-19 pandemic or its aftermath further impacts demand for our products and services or impairs the viability of some of our customers and/or suppliers, our financial condition, results of operations, and cash flows could be adversely affected, and those impacts could be material.\nThe military aerospace cycle is highly dependent on U.S. and foreign government funding; as well as the effects of terrorism, a changing global political environment, U.S. foreign policy, the retirement of older aircraft and technological improvements to new engines. Accordingly, the timing, duration and severity of cyclical upturns and downturns cannot be forecast with certainty. Downturns or reductions in demand could have a material adverse effect on our business.\nThe energy industry is also cyclical in nature. Demand for our new and spare components in this industry is, in turn, driven by the global demand for energy, which is affected by, among other factors, the state of the world economies, the political environments of numerous countries and environmental constraints. The availability of alternative energy to oil and gas, and related prices, also have a large impact on demand. Reductions in demand for products in this market could have a material adverse effect on our business.\nCyclical declines or sustained weakness in these markets could have a material adverse effect on our business.\nGovernment spending priorities and terms may change in a manner adverse to our business.\nAt times, our supplying of products to the U.S. military has been adversely affected by significant changes in U.S. defense and national security budgets. Budget changes that result in a decline in overall spending, program delays, program cancellations or a slowing of new program starts on programs in which we participate could materially adversely affect our business, prospects, financial condition or results of operations. Future levels of expenditures and authorizations for defense-related programs by the U.S. government may decrease, remain constant or shift to programs in areas where we do not currently provide products, thereby reducing the chances that we will be awarded new contracts.\nSIFCO has contracts for programs where the period of performance may exceed one year. Congress and certain foreign governments must usually approve funds for a given program each fiscal year and may significantly reduce funding of a program in a particular year. Significant reductions in these appropriations or the amount of new defense contracts awarded may affect our ability to complete contracts, obtain new work and grow our business. At times when there are perceived threats to national security, U.S. defense spending can increase; at other times, defense spending can decrease. Future levels of defense\nspending are uncertain and subject to congressional debate. Any reduction in future U.S. defense spending levels could adversely impact our sales, operating profit and cash flow.\nFurthermore, business conducted pursuant to U.S. government contracts is subject to extensive procurement regulations and other unique risks. New procurement regulations, or changes to existing requirements, could increase compliance costs or otherwise have a material impact on the operating margins of the portion of our business derived from contracts with the U.S. government. The U.S. government contracting party may modify, curtail, or terminate its contracts and subcontracts with the company without prior notice either at its convenience or for default based on performance, and funding pursuant to our U.S. government contracts may be reduced or withheld as a part of the appropriations process due to fiscal constraints or due to changes in foreign or domestic policy strategy.\nFailure to retain existing contracts or win new contracts under competitive bidding processes may adversely affect our sales.\nSIFCO obtains most of its contracts through a competitive bidding process, and substantially all of the business that we expect to seek in the foreseeable future likely will be subject to a competitive bidding process. Competitive bidding presents a number of risks, including:\na.the need to compete against companies or teams of companies with more financial and marketing resources and more experience in bidding on and performing major contracts than we have;\nb.the need to compete against companies or teams of companies that may be long-term, entrenched incumbents for a particular contract for which we are competing and that have, as a result, greater domain expertise and better customer relations;\nc.the need to compete to retain existing contracts that have in the past been awarded to us on a sole-source basis or that have been incumbent for a long time;\nd.the award of contracts to providers offering solutions at the lowest price technically acceptable, which may lower the profit we may generate under a contract awarded using this pricing method or prevent us from submitting a bid for such work due to us deeming such work to be unprofitable;\ne.the reduction of margins achievable under any contracts awarded to us;\nf.the need to bid on some programs in advance of the completion of their specifications, which may result in unforeseen technological difficulties or increased costs that lower our profitability;\ng.the substantial cost and managerial time and effort, including design, development and marketing activities, necessary to prepare bids and proposals for contracts that may not be awarded to us;\nh.the need to develop, introduce and implement new and enhanced solutions to our customers needs;\ni.the need to locate and contract with teaming partners and subcontractors;\nj.the need to accurately estimate the resources and cost structure that will be required to perform any contract that we are awarded; and\nk.long term agreements - changes in our cost profile over the life of a long-term agreement.\nIf SIFCO wins a contract, and upon expiration, the customer requires further services of the type provided by the contract, there is frequently a competitive rebidding process. There can be no assurance that we will win any particular bid, that we will win the contract at the same profit margin, or that we will be able to replace business lost upon expiration or completion of a contract.\nIf SIFCO is unable to consistently retain existing contracts or win new contract awards, our business, prospects, financial condition and results of operations may be adversely affected.\nThe Company may not receive the full amounts estimated under the contracts in our total backlog, which could reduce our sales in future periods below the levels anticipated, and which makes backlog an uncertain indicator of future operating results.\nAs of September 30, 2022, our total backlog was $81.9 million. Orders may be canceled and scope adjustments may occur, and we may not realize the full amounts of sales that we anticipate in our backlog numbers. Further, there is no assurance that our customers will purchase all the orders represented in our backlog, due in part to the U.S. governments ability to modify, curtail or terminate major programs. Additionally, the timing of receipt of orders, if any, on contracts included in our backlog could change. The failure to realize amounts reflected in our backlog could materially adversely affect our business, financial condition and results of operations in future periods.\nSIFCO business is dependent on a small number of direct and indirect customers.\nA substantial portion of SIFCO's business is conducted with a relatively small number of large direct and indirect customers. In fiscal 2022, one direct customer accounted for approximately 11% percent of our consolidated net sales and two direct\ncustomers and their direct subcontractors accounted for approximately 23% of the Companys consolidated net sales. A financial hardship experienced by any one of these key customers, the loss of any of them or a reduction in or substantial delay of orders from any of them could have a material adverse effect on our business.\nThe Company's failure to identify, attract and retain qualified personnel could adversely affect our existing business, financial condition and results of operations.\nSIFCO may not be able to identify, attract or retain qualified technical personnel, sales and customer service personnel, employees with expertise in forging, or management personnel to supervise such activities. We may also not attract and retain employees who share the Company's core values, who can maintain and grow our existing business, and who are suited to work in a public company environment, which could adversely affect our financial condition and results of operations.\nThe Company's business could be negatively affected by cybersecurity threats, information systems interruptions, intrusions or new software implementations and other disruptions.\nSIFCO faces cyber threats, as well as the potential for business disruptions associated with information technology failures and interruptions, new software implementation, and damaging weather or other acts of nature, and pandemics or other public health crises, which may adversely affect our business.\nAlthough we continue to review and enhance our systems and cybersecurity controls, SIFCO has experienced and expects to continue to experience cybersecurity threats, including threats to our information technology infrastructure and attempts to gain access to the Companys sensitive information, as do our customers, suppliers and subcontractors. Although we maintain information security policies and procedures to prevent, detect, and mitigate these threats, information system disruptions, equipment failures or cybersecurity attacks, such as unauthorized access, malicious software and other intrusions, could still occur and may lead to potential data corruption, exposure of proprietary and confidential information. Further, while SIFCO works cooperatively with its customers, suppliers and subcontractors to seek to minimize the impacts of cyber threats, other security threats or business disruptions, in addition to our internal processes, procedures and systems, it must also rely on the safeguards put in place by those entities.\nAny intrusion, disruption, breach or similar event may cause operational stoppages, fines, penalties, diminished competitive advantages through reputational damages and increased operational costs. The costs related to cyber or other security threats or disruptions may not be fully mitigated by insurance or other means.\nIn connection with the COVID-19 pandemic, we provided for remote work for certain of our employees, which may increase our vulnerability to cyber and other information technology risks. In addition to existing risks, any adoption or deployment of new technologies via acquisitions or internal initiatives may increase our exposure to risks, breaches, or failures, which could materially adversely affect our results of operations or financial condition. Furthermore, the Company may have access to sensitive, confidential, or personal data or information that may be subject to privacy and security laws, regulations, or other contractually-imposed controls. Despite our use of reasonable and appropriate controls, material security breaches, theft, misplaced, lost or corrupted data, programming, or employee errors and/or malfeasance could lead to the compromise or improper use of such sensitive, confidential, or personal data or information, resulting in possible negative consequences, such as fines, ransom demands, penalties, loss of reputation, competitiveness or customers, or other negative consequences resulting in adverse impacts to our results of operations or financial condition.\nSIFCO relies on our suppliers to meet the quality and delivery expectations of our customers.\nThe ability to deliver SIFCO's products on schedule is dependent upon a variety of factors, including execution of internal performance plans, availability of raw materials, internal and supplier produced parts and structures, conversion of raw materials into parts and assemblies, and performance of suppliers and others. We rely on numerous third-party suppliers for raw materials and a large proportion of the components used in our production process. Certain of these raw materials and components are available only from single sources or a limited number of suppliers, or similarly, customers specifications may require SIFCO to obtain raw materials and/or components from a single source or certain suppliers. Many of our suppliers are small companies with limited financial resources and manufacturing capabilities. We do not currently have the ability to manufacture these components ourselves. Consequently, we risk disruptions in our supply of key products and components if our suppliers fail or are unable to perform because of shortages in raw materials, operational problems, strikes, natural disasters, health crises (such as the COVID-19 or other pandemics) or other factors. We have and may continue to experience delays in the delivery of such products as a result of increased demands and pressures on the supply chain, customs, labor issues, geopolitical pressures, disruptions associated with the COVID-19 or other pandemics, changes in political, economic, and social conditions, weather, laws and regulations. Unfavorable fluctuations in price, international trade policies, quality, delivery, and availability of these products could continue to adversely affect the Company's ability to meet demands of customers and cause negative impacts to the Company's cost structure, profitability and its cash flow. It is unclear how our supply chain could\nbe further impacted by COVID-19, including the spread of new variants, and there are many unknowns including how long we will be impacted, the severity of the impacts and the probability of a recurrence of COVID-19 or similar regional or global pandemics. If we were unsuccessful in obtaining those products from other sources or at comparable cost, a disruption in our supply chain could adversely affect our sales, earnings, financial condition, and liquidity.\nWe may have disputes with our vendors arising from, among other things, the quality of products and services or customer concerns about the vendor. If any of our vendors fail to timely meet their contractual obligations or have regulatory compliance or other problems, our ability to fulfill our obligations may be jeopardized. Economic downturns can adversely affect a vendors ability to manufacture or deliver products. Further, vendors may also be enjoined from manufacturing and distributing products to us as a result of litigation filed by third parties, including intellectual property litigation. If SIFCO were to experience difficulty in obtaining certain products, there could be an adverse effect on its results of operations and on its customer relationships and our reputation. Additionally, our key vendors could also increase pricing of their products, which could negatively affect our ability to win contracts by offering competitive prices.\nAny material supply disruptions could adversely affect our ability to perform our obligations under our contracts and could result in cancellation of contracts or purchase orders, penalties, delays in realizing revenues, and payment delays, as well as adversely affect our ongoing product cost structure.\nFailure to perform by our subcontractors could materially and adversely affect our contract performance and its ability to obtain future business.\nThe performance of contracts often involves subcontractors, upon which we rely to complete delivery of products to our customers. SIFCO may have disputes with subcontractors. A failure by a subcontractor to satisfactorily deliver products can adversely affect our ability to perform our obligations as a prime contractor. Any subcontractor performance deficiencies could result in the customer terminating our contract for default, which could expose us to liability for excess costs of re-procurement by the customer and have a material adverse effect on our ability to compete for other contracts.\nThe Company's future success depends on the ability to meet the needs of its customer requirements in a timely manner.\nThe Company believes that the commercial A&E markets in which we operate require sophisticated manufacturing and system-integration techniques and capabilities using composite and metallic materials. The Companys success depends to a significant extent on our ability to acquire, develop, execute and maintain such sophisticated techniques and capabilities to meet the needs of our customers and to bring those products to market quickly and at cost-effective prices. If we are unable to acquire and/or develop, execute and maintain such techniques and capabilities, we may experience an adverse effect to our business, financial condition or results of operation.\nThe Company faces certain significant risk exposures and potential liabilities that may not be covered adequately by insurance or indemnity.\nWe are exposed to liabilities that are unique to the products we provide. While we maintain insurance for certain risks, the amount of insurance or indemnity may not be adequate to cover all claims or liabilities, and we may be forced to bear substantial costs from an accident or incident. It also is not possible for SIFCO to obtain insurance to protect against all operational risks and liabilities. Substantial claims resulting from an incident in excess of the indemnification we receive and our insurance coverage would harm our financial condition, results of operations and cash flows. Moreover, any accident or incident for which we are liable, even if fully insured, could negatively affect our standing with our customers and the public, thereby making it more difficult for us to compete effectively, and could significantly impact the cost and availability of adequate insurance in the future.\nThe Company's business is subject to risks associated with international operations.\nSIFCO has operations in Maniago, Italy and operates internationally. A number of risks inherent in international operations could have a material adverse effect on our results of operations, including:\na.fluctuations in U.S. dollar value arising from transactions denominated in foreign currencies and the translation of certain foreign currency subsidiary balances;\nb.difficulties in staffing and managing multi-national operations;\nc.general economic and political uncertainties and potential for social unrest in countries in which we or our customers operate;\nd.other deterioration of economic conditions, including the effect of inflation on our customers and suppliers;\ne.limitations on our ability to enforce legal rights and remedies;\nf.restrictions on the repatriation of funds;\ng.changes in trade policies, laws, regulations, political leadership and environment, and/or security risks;\nh.tariff regulations;\ni.difficulties in obtaining export and import licenses and compliance with export/import controls and regulations;\nj.the risk of government financed competition;\nk.compliance with a variety of international laws as well as U.S. regulations, rules and practices affecting the activities of companies abroad; and\nl.difficulties in managing and staffing international operations and the required infrastructure costs, including legal, tax, accounting, and information technology.\nWe operate in a highly competitive and price sensitive industry, and customer pricing pressures could reduce the demand and/or price for our products and services.\nThe end-user markets SIFCO serves are highly competitive and price sensitive. We compete globally with a number of domestic and international companies that have substantially greater manufacturing, purchasing, marketing and financial resources than we do. Many of SIFCO's customers have the in-house capability to fulfill their manufacturing requirements. SIFCO's larger competitors may be able to vie more effectively for very large-scale contracts than we can by providing different or greater capabilities or benefits such as technical qualifications, past performance on large-scale contracts, geographic presence, price and availability of key professional personnel. If SIFCO is unable to successfully compete for new business, our net sales growth and operating margins may decline. Competitive pricing pressures may have an adverse effect on our financial condition and operating results. Further, there can be no assurance that competition from existing or potential competitors will not have a material adverse effect on our financial results. If SIFCO does not continue to compete effectively and win contracts, our future business, financial condition, results of operations and our ability to meet its financial obligations may be materially compromised.\nThe Company uses estimates when pricing contracts and any changes in such estimates could have an adverse effect on our profitability and our overall financial performance.\nWhen agreeing to contractual terms, some of which extend for multiple years, SIFCO makes assumptions and projections about future conditions and events. These projections assess the productivity and availability of labor, complexity of the work to be performed, cost and availability of materials, impact of delayed performance and timing of product deliveries. Contract pricing requires judgment relative to assessing risks, estimating contract revenues and costs, and making assumptions for schedule and technical issues. Due to the size and nature of many of our contracts, the estimation of total revenues and costs at completion is complicated and subject to many variables. For example, assumptions are made regarding the length of time to complete a contract since costs also include expected increases in wages, prices for materials and allocated fixed costs. Similarly, assumptions are made regarding the future impact of our efficiency initiatives and cost reduction efforts. Incentives, awards or penalties related to performance on contracts are considered in estimating revenue and profit rates and are recorded when there is sufficient information to assess anticipated performance. Suppliers' assertions are also assessed and considered in estimating costs and profit rates.\nBecause of the significance of the judgment and estimation processes described above, it is possible that materially different amounts could be obtained if different assumptions were used or if the underlying circumstances were to change. Changes in underlying assumptions, circumstances or estimates may have a material adverse effect upon the profitability of one or more of the affected contracts, future period financial reporting and performance, as pass through pricing is not always permissible.\nOur technologies could become obsolete, reducing our revenues and profitability.\nTechnologies related to our products have undergone, and in the future may undergo, significant changes and the future of our business will depend in large part upon the continuing relevance of our forging capabilities. SIFCO could encounter competition from new or revised technologies that render its technologies and equipment less profitable or obsolete in our chosen markets and our operating results may suffer.\nIf the Company fails to maintain an effective system of internal control over financial reporting, it may not be able to accurately or timely report its financial results. As a result, current and potential shareholders could lose confidence in the Company's financial reporting, which would harm the business and the trading price of its common stock.\nThe Sarbanes-Oxley Act, among other things, requires that we maintain effective internal controls for financial reporting and disclosure controls and procedures. In particular, we must perform system and process evaluations and testing of our internal controls over financial reporting to allow management to report on the effectiveness of our internal controls over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act. Compliance with Section 404 may require that we incur substantial accounting expenses and expend significant management efforts. Our testing has, as described below, and in the future may reveal deficiencies in our internal controls over financial reporting that are deemed to be material weaknesses. In the event we identify significant deficiencies or material weaknesses in our internal controls that we cannot remediate in a timely\nmanner, the market price of our stock could decline if investors and others lose confidence in the reliability of our financial statements and we could be subject to sanctions or investigations by the SEC or other applicable regulatory authorities.\nAs further described in Item 9A in our Annual Report on Form 10-K, for the fiscal year ended September 30, 2022, management determined that SIFCOs internal control over financial reporting and its disclosure controls and procedures were not effective. Management identified a material weakness related to lack of precise review controls associated with the valuation of inventory at the Orange location and long-lived asset impairment triggering event indicators in the fourth quarter at the Orange location. Until remediated, this material weakness could result in a material misstatement to the annual or interim consolidated financial statements that would not be prevented or detected on a timely basis. As with any internal control deficiency, there can be no assurance that our remedial measures will be successful or otherwise sufficient to address the material weakness. If the Company is unable to remediate the material weakness, or is otherwise unable to maintain effective internal control over financial reporting or disclosure controls and procedures, or if additional material weaknesses or significant deficiencies in our internal control over financial reporting are discovered or occur in the future, the Companys ability to record, process and report financial information accurately, and to prepare financial statements within required time periods, could be adversely affected, which could subject the Company to litigation or investigations requiring management resources and payment of legal and other expenses, including civil penalties, negatively affect investor confidence in our financial statements and adversely impact our stock price.\nLabor disruptions by our employees or personnel turnover and/or shortage could adversely affect our business.\nAs of September 30, 2022, we employed approximately 348 people. We face competition for management and employees from other companies and organizations. At various points since the start of the COVID-19 pandemic, we furloughed or terminated portions of our workforce as a result of the negative impact the pandemic and its effects had on the demand for our products and services. Although we took measures to maintain good relationships with our workforce, there can be no assurance that the act of furloughing or terminating our employees did not damage employee relations or our ability to attract and retain talent at all levels. As the demand for employees returns to pre-COVID-19 levels, if we continue to experience increased turnover and/or are unable to quickly hire employees and subsequently retain our workforce, or we experience a significant or prolonged work stoppage in such an environment, we may experience increased costs, such as increased overtime to meet demand and increased wage rates to attract and retain employees, and our ability to secure new work and our results of operations and financial condition could be adversely affected. Additionally, two of our locations are parties to collective bargaining agreements. Although we have not experienced any material labor-related work stoppage and consider our relations with our employees to be good, labor stoppages may occur in the future. If the unionized workers were to engage in a strike or other work stoppage, or if SIFCO is unable to negotiate acceptable collective bargaining agreements with the unions, or if other employees were to become unionized, we could experience a significant disruption of our operations, higher ongoing labor costs and possible loss of customer contracts, which could have an adverse effect on our business and results of operations.\nThe price and availability of oil and other energy sources worldwide could adversely impact our results of operations. Unexpected pricing of fuel or a shortage of, or disruption in, the supply of fuel or other energy sources could have a material adverse effect on our and our customers' business, results of operations and financial condition.\nOur results of operations can be directly affected, positively and negatively, by volatility in the cost and availability of energy, which is subject to global supply and demand and other factors beyond our control. The ongoing conflict between Russia and Ukraine has impacted global energy markets, particularly in Europe, leading to high volatility and increasing prices for crude oil, natural gas and other energy supplies. Our customers' businesses are significantly impacted by the availability and pricing of fuel. Weather-related events, natural disasters, terrorism, wars, political disruption or instability involving oil-producing countries, changes in governmental or cartel policy concerning crude oil or aircraft fuel production, labor strikes, cyberattacks or other events affecting refinery production, transportation, taxes, marketing, environmental concerns, market manipulation, price speculation and other unpredictable events may drive actual or perceived fuel supply shortages. In particular, the recent conflict between Russia and Ukraine has caused shortages in the availability of fuel. In the event that the supply of natural gas from Russia stops or is significantly reduced, there may be supply disruptions, increased prices, shutdowns of manufacturing facilities, or further rationing of energy supply within countries where we and/or our customers do business, which could have a material adverse impact on our and our customers' business or results of operations in those countries.\nRisks Related to Financial Matters\nGlobal economic conditions may adversely impact our business, operating results or financial condition.\nDisruption and volatility in global financial markets may lead to increased rates of default and bankruptcy and may negatively impact consumer and business spending levels. Since 2020, the widespread public health crisis caused by the COVID-19 outbreak has adversely impacted the economies and financial markets as well as various industries worldwide, resulting in a\ndownturn that has adversely impacted many businesses, including ours. The ongoing pandemic and other events could adversely affect our business, operating results or financial condition. Current or potential customers may delay or decrease spending on our products and services as their business and/or budgets are impacted by economic conditions. The inability of current and potential customers to pay SIFCO for its products and services may adversely affect its earnings and cash flows.\nFurther, we are exposed to fluctuations in inflation, which could negatively affect our business, financial condition and results of operation. The United States and other jurisdictions have recently experienced high levels of inflation. If the inflation rate continues to increase, it will likely affect our expenses, including, but not limited to, employee compensation and labor expenses and increased costs for supplies, and we may not be successful in offsetting such cost increases.\nWe cannot predict changes in worldwide or regional economic conditions and government policies, as such conditions are highly volatile and beyond our control. If these conditions deteriorate for extended periods, however, our business, results of operations and financial condition could be materially adversely affected.\nOur indebtedness and restrictive covenants under our credit facilities could limit our operational and financial flexibility.\nWe have incurred indebtedness, and may incur additional debt in the future. Our ability to make interest and scheduled principal payments and operate within restrictive covenants could be adversely impacted by changes in the availability, terms and cost of capital, changes in interest rates or changes in our credit ratings or our outlook. These changes could increase our cost of business, limiting our ability to pursue acquisition opportunities, react to market conditions and meet operational and capital needs, thereby placing us at a competitive disadvantage.\nThe funding and costs associated with our pension plans and significant changes in key estimates and assumptions, such as discount rates and assumed long-term returns on assets, actual investment returns on our pension plan assets, and legislative and regulatory actions could affect our earnings, equity and contributions to our pension plans in future periods.\nCertain of the Company's employees are covered by its noncontributory defined benefit pension plans (Plans). The impact of these Plans on our earnings may be volatile in that the amount of expense we record and may materially change from year to year because those calculations are sensitive to changes in several key economic assumptions, including discount rates, inflation, expected return on plan assets, retirement rates and mortality rates. These pension costs are dependent on significant judgment in the use of various estimates and assumptions, particularly with respect to the discount rate and expected long-term rates of return on plan assets. Changes to these estimates and assumptions could have a material adverse effect on our financial position, results of operations or cash flows. Differences between actual investment returns and our assumed long-term returns on assets will result in changes in future pension expense and the funded status of our Plans, and could increase future funding of the Plans. Changes in these factors affect our plan funding, cash flows, earnings, and shareholders equity. Additionally, the Company contributed to a multi-employer retirement plan. While the Company withdrew from this plan to mitigate future costs, the Company may be subject to liability in connection with such withdrawal (see Note 8, Retirement Benefit Plans).\nMarket volatility and adverse capital or credit market conditions may affect our ability to access cost-effective sources of funding and may expose SIFCO to risks associated with the financial viability of suppliers.\nThe financial markets can experience high levels of volatility and disruption, reducing the availability of credit for certain issuers and the financial markets have undergone significant volatility in reaction to the COVID-19 pandemic and various economic factors.\nThe tightening of the credit market and standards, as well as capital market volatility, could negatively impact our ability to obtain additional debt financing on terms equivalent to our existing Credit Agreement. Capital market uncertainty and volatility, together with the Companys market capitalization and status as a smaller reporting company, could also negatively impact our ability to obtain capital market financing or bank financing on favorable terms, or at all, which could have a material adverse effect on our financial position, results of operations or cash flows.\nTightening credit markets could also adversely affect our suppliers' ability to obtain financing. Delays in suppliers' ability to obtain financing, or the unavailability of financing, could negatively affect their ability to perform their contracts with SIFCO and cause our inability to meet our contract obligations. The inability of our suppliers to obtain financing could also result in the need for us to transition to alternate suppliers, which could result in significant incremental costs and delays.\nA write-off of all or part of our goodwill or other intangible assets could adversely affect our operating results and net worth.\nGoodwill and other intangible assets are a component of our assets. At September 30, 2022, goodwill was $3.5 million and other intangible assets were $0.5 million of our total assets of $97.3 million. We may have to write off all or part of our goodwill or other intangible assets if their value becomes impaired. Although this write-off would be a non-cash charge, it could reduce our earnings and our financial condition.\nGeneral Risks\nOur business is subject to risks associated with widespread public health crises, including the current COVID-19 pandemic.\nIn March 2020, the outbreak of COVID-19 was recognized as a pandemic by the World Health Organization, and the outbreak subsequently became increasingly widespread in the United States and other countries in which we conduct business. While we continue to actively monitor the pandemic and take steps to mitigate the risks posed by its spread, there is no guarantee that our efforts will mitigate the adverse impacts of COVID-19 or will be effective. Uncertain factors relating to the COVID-19 pandemic continue to include the duration of the outbreak, the severity of the disease, and the actions taken, or perception of actions that may be taken, to contain or treat its impact, including declarations and/or re-instituting states of emergency, business closures, manufacturing restrictions and a prolonged period of travel, commercial and/or other similar restrictions and limitations. We have continued to see a prolonged impact on the economy, our industry, and our business, with increased challenges for customers, labor shortages, supply chain disruptions, and increasing inflation, among others.\nThe pandemic has affected and is expected to continue to affect certain elements of our operations and business. As a result, we have been operating in industries which have been significantly impacted by the COVID-19 pandemic. As a result of the ongoing impacts of the pandemic, we have experienced, and may in the future experience, production site shutdowns, and workplace disruptions and restrictions on the movement of people, raw materials and goods, both at our own facilities and at the facilities operated by our customers and suppliers. Further or a more prolonged suspension of operations or delayed recovery in our operations, and/or any similar suspension of operations or delayed recovery at one or more of our key suppliers, or the failure of any of our key suppliers, would result in further challenges to our business, leading to a further material adverse effect on our business, financial condition, results of operations, and cash flows.\nWe have experienced and expect to continue to experience unpredictable changes in demand from the markets we serve. The A&E industries have been negatively impacted by the COVID-19 pandemic and its effects as a result of various restrictions on air travel and concern regarding air travel during a pandemic. These factors have caused reductions in demand for commercial aircraft, which have adversely impacted our net sales and operating results and may continue to do so for an extended period of time. Further, an overall reduction in business activity as a result of the disruption has led to a continued softening of the energy market. If the pandemic continues and/or conditions worsen, we may experience additional adverse impacts on our operations, costs, customer orders, and collections of accounts receivable, which may be material. While we are unable to predict the magnitude of the impact of these factors at this time, the loss of, or significant reduction in, purchases by our large customers could have a material adverse effect on our business, financial condition, and results of operations.\nAdditionally, the pandemic could lead to an extended disruption of economic activity whereby the impact on our consolidated results of operations, financial position and cash flows could be material. While the potential economic impact brought by and the duration of the coronavirus outbreak may be difficult to assess or predict, the continuation of a widespread pandemic could result in significant or sustained disruption of global financial markets, reducing our ability to access capital, which could in the future negatively affect our liquidity. While the Company believes it has adequate cash/liquidity available to finance its operations, our ability to make scheduled payments of the principal of, to pay interest on or to refinance our indebtedness, depends on our future performance, which is subject to general economic, financial, competitive and other factors (including the continued impact of COVID-19) beyond our control. In addition, while we believe we have taken appropriate steps to maintain a safe workplace to protect our employees from contracting and spreading the coronavirus, we may not be able to prevent the spread of the virus among our employees, face litigation or other proceedings making claims related to unsafe working conditions, inadequate protection of our employees or other claims. Any of these claims, even if without merit, could result in costly litigation or divert management's attention and resources. Furthermore, we may face a sustained disruption to our operations due to one or more of the factors described above.\nThe impact of the COVID-19 pandemic and its effects may also exacerbate other risks and uncertainties the Company faces or may face. The impact depends on the severity and duration of the current COVID-19 pandemic and actions taken by governmental authorities and other third parties in response, each of which is uncertain, rapidly changing and difficult to predict.\nThe price of our common stock may fluctuate significantly.\nAn active, liquid and orderly market for our common stock may not be sustained, which could depress the trading price of our common stock.\nVolatility in the market price of our common stock may prevent you from being able to sell your shares at or above the price you paid for your shares or at all. The market price of our common stock could fluctuate significantly for various reasons, which include:\na.our quarterly or annual earnings or those of our competitors or our significant customers;\nb.the publics reaction to our press releases, our other public announcements and our filings with the Securities and Exchange Commission;\nc.changes in earnings estimates or recommendations by research analysts who track the stocks of our competitors;\nd.new laws or regulations or new interpretations of laws or regulations applicable to our business;\ne.changes in accounting standards, policies, guidance, interpretations or principles;\nf.changes in general conditions in the domestic and global economies or financial markets, including those resulting from war, incidents of terrorism, health crises (such as the ongoing COVID-19 pandemic) or responses to such events;\ng.litigation involving our company or investigations or audits by regulators into the operations of our company or our competitors;\nh.strategic action by our competitors;\ni.sales of common stock by our directors, executive officers and significant shareholders; and\nj.our stock being closely held by insider holdings and is thinly traded which impacts price volatility.\nIn addition, the stock market in general has experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of those companies. Broad market and industry factors may significantly affect the market price of our common stock, regardless of actual operating performance. In addition, in the past, following periods of volatility in the overall market and the market price of a particular companys securities, securities class action litigation has often been instituted against these companies. If litigation is instituted against us, it could result in substantial costs and a diversion of our managements attention and resources.\nUnanticipated changes in our tax provisions or exposure to additional income tax liabilities could affect our profitability and cash flow.\nSIFCO is subject to income taxes in the United States, Italy and Ireland. Significant judgment is required in determining our provision for income taxes. In the ordinary course of business, there are many transactions and calculations where the ultimate tax determination is uncertain. Changes in applicable income tax laws and regulations, or their interpretation, could result in higher or lower income tax rates or changes in the taxability of certain sales or the deductibility of certain expenses, thereby affecting our income tax expense and profitability. In addition, the final results of any tax audits or related litigation could be materially different from our related historical income tax provisions and accruals. Additionally, changes in our tax rate as a result of changes in our overall profitability, changes in tax legislation, changes in the valuation of deferred tax assets and liabilities, changes in differences between financial reporting income and taxable income, the examination of previously filed tax returns by taxing authorities and continuing assessments of our tax exposures can also impact our tax liabilities and affect our income tax expense, profitability and cash flow.\nDamage or destruction of our facilities caused by storms, earthquakes or other causes could adversely affect our financial results and financial condition.\nWe have operations located in regions of the world that may be exposed to damaging storms, earthquakes and other natural disasters as well as other events outside of our control, such as fires, floods and other catastrophic events. We maintain standard property casualty insurance coverage for our properties and may be able to recover costs associated with certain natural disasters through insurance; however, even if covered by insurance, any significant damage or destruction of our facilities due to such events could result in our inability to meet customer delivery schedules and may result in the loss of customers and significant additional costs to SIFCO. Thus, any significant damage or destruction of our properties could have a material adverse effect on our business, financial condition or results of operations.\nThe occurrence of litigation where we could be named as a defendant is unpredictable.\nFrom time to time, we are involved in various legal and other proceedings that are incidental to the conduct of our business. While we believe no current proceedings, if adversely determined, could have a material adverse effect on our financial results, no assurances can be given. Any such claims may divert financial and management resources that would otherwise be used to benefit our operations and could have a material adverse effect on our financial results.\nOur operations are subject to environmental laws, and complying with those laws may cause us to incur significant costs.\nOur operations and facilities are subject to numerous stringent environmental laws and regulations. Although we believe that we are in compliance with these laws and regulations, future changes in these laws, regulations or interpretations of them, or changes in the nature of our operations may require us to make significant capital expenditures to ensure compliance.  Item 2. Properties\nThe Companys property, plant and equipment include the facilities described below and a substantial quantity of machinery and equipment, most of which consists of industry specific machinery and equipment using special dies, jigs, tools and fixtures and in many instances having automatic control features and special adaptations. In general, the Companys property, plant and equipment are in good operating condition, are well maintained, and its facilities are in regular use. The Company considers its investment in property, plant and equipment as of September 30, 2022 suitable and adequate given the current product offerings for the respective operations in the current business environment. The square footage numbers set forth in the following paragraph are approximations:\nSIFCO operates and manufactures in multiple facilities-(i) an owned 280,000 square foot facility located in Cleveland, Ohio, which is also the site of the Companys corporate headquarters, (ii) leased facilities aggregating approximately 70,500 square feet located in Orange, California, and (iii) owned facilities aggregating approximately 91,000 square feet located in Maniago, Italy. Item 3. Legal Proceedings\nIn the normal course of business, the Company may be involved in ordinary, routine legal actions. The Company cannot reasonably estimate future costs, if any, related to these matters and does not believe any such matters are material to its financial condition or results of operations. The Company maintains various liability insurance coverages to protect its assets from losses arising out of or involving activities associated with ongoing and normal business operations; however, it is possible that the Companys future operating results could be affected by future costs of litigation. See Note 11, Commitments and Contingencies, of the consolidated financial statements for more information regarding the legal proceedings in which the Company is involved.\nItem 4A. Executive Officers of the Registrant\nSet forth below is certain information concerning the Company's executive officers. The executive officers are appointed annually by the Board of Directors.\nPeter W. Knapper - President and Chief Executive Officer\nThomas R. Kubera - Chief Financial Officer\nName Age Title and Business Experience\nPeter W. Knapper 61 President and Chief Executive Officer since June 2016. Prior to joining SIFCO, Mr. Knapper worked for the TECT Corporation from 2007 to 2016 and was the Director of Strategy and Site Development. TECT offers the aerospace, power-generation, transportation, marine, and medical industries a combination of capabilities unique among metal component manufacturers. Prior to this role, Mr. Knapper served as President of TECT Aerospace and Vice President of Operations of TECT Power. In addition, Mr. Knapper spent five years at Rolls Royce Energy Systems, Inc., a subsidiary of Rolls-Royce Holdings plc, as the Director of Component Manufacturing and Assembly. Mr. Knapper brings his strategic and industry experience to his role in management and to the Board of the Company.\nThomas R. Kubera 63 Chief Financial Officer since August 8, 2018. Prior to his appointment, Mr. Kubera was Interim Chief Financial Officer from July 1, 2017 to August 7, 2018 and Chief Accounting Officer since January 31, 2018. Mr. Kubera was Corporate Controller from May 2014 and had served as Interim Chief Financial Officer from April 2015 to May 2015. Prior to joining SIFCO, Mr. Kubera was previously at Cleveland-Cliffs, Inc. (previously known as Cliffs Natural Resources, Inc.) from April 2005 through 2014, most recently as the Controller of Global Operations Services. He also held several assistant controller positions and was a Senior Manager of External Reporting while at Cleveland-Cliffs, Inc.\nPART II\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis Annual Report on Form 10-K may contain various forward-looking statements and includes assumptions concerning the Companys operations, future results and prospects. The words \"will,\" \"may,\" \"designed to,\" \"outlook,\" \"believes,\" \"should,\" \"anticipates,\" \"plans,\" \"expects,\" \"intends,\" \"estimates,\" \"forecasts\" and similar expressions identify certain of these forward-looking statements. These forward-looking statements are based on current expectations and are subject to risk and uncertainties. In connection with the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, the Company provides this cautionary statement identifying important economic, political and technological factors, among others, the absence or effect of which could cause the actual results or events to differ materially from those set forth in or implied by the forward-looking statements and related assumptions. Such factors include the following: (1) the impact on business conditions in general, and on the demand for product in the A&E industries in particular, of the global economic outlook, including the continuation of military spending at or near current levels and the availability of capital and liquidity from banks, the financial markets and other providers of credit; (2) the future business environment, including capital and consumer spending; (3) competitive factors, including the ability to replace business that may be lost at comparable margins; (4) metals and commodities price increases and the Companys ability to recover such price increases; (5) successful development and market introduction of new products and services; (6) continued reliance on consumer acceptance of regional and business aircraft powered by more fuel efficient turboprop engines; (7) continued reliance on military spending, in general, and/or several major customers, in particular, for revenues; (8) the impact on future contributions to the Companys defined benefit pension plans due to changes in actuarial assumptions, government regulations and the market value of plan assets; (9) stable governments, business conditions, laws, regulations and taxes in economies where business is conducted; (10) the ability to successfully integrate businesses that may be acquired into the Companys operations; (11) cyber and other security threats or disruptions faced by us, our customers or our suppliers and other partners; (12) our exposure to additional risks as a result of our international business, including risks related to geopolitical and economic factors, suppliers, laws and regulations; (13) the ability to maintain a qualified workforce; (14) the adequacy and availability of our insurance coverage; (15) our ability to develop new products and technologies and maintain technologies, facilities, and equipment to win new competitions and meet the needs of our customers; (16) our ability to realize amounts in our backlog; (17) investigations, claims, disputes, enforcement actions, litigation and/or other legal proceedings; (18) extraordinary or force majeure events affecting the business or operations of our business; and (19) the impact of the novel COVID-19 pandemic and related impact on the global economy, which may exacerbate the above factors and/or impact our results of operations and financial condition.  Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nThe Companys Common Shares are traded on the NYSE American exchange under the symbol SIF.\nDividends and Shareholders\nThe Company did not declare a cash dividend during fiscal 2022 or fiscal 2021. The Company will continue to evaluate the payment of dividends annually based on its relative profitability, available resources, and investment strategies. The Company currently intends to retain a significant majority of its earnings for operations, focusing on its long-term plan and mitigating the uncertainty of the continuing impact of the COVID-19 pandemic. Additionally, the Companys ability to declare or pay cash dividends is limited by its credit agreement. At November 30, 2022, there were approximately 355 shareholders of record of the Companys Common Shares, as reported by Computershare, Inc., the Companys Transfer Agent and Registrar, which maintains its U.S. corporate offices at 250 Royall Street, Canton, MA 02021.\nReference Part III, Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters for information related to the Companys equity compensation plans.  Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nSIFCO is engaged in the production of forgings and machined and sub-assembled components primarily for the A&E markets. The processes and services include forging, heat-treating, chemical processing and machining. The Company operates under one business segment.\nWhen planning and evaluating its business operations, the Company takes into consideration certain factors, including the following: (i) the projected build rate for commercial, business and military aircraft, as well as the engines that power such\naircraft; (ii) the projected build rate for industrial steam and gas turbine engines; and (iii) the projected maintenance, repair and overhaul schedules for commercial, business and military aircraft, as well as the engines that power such aircraft.\nThe Company operates within a cost structure that includes a significant fixed component. Therefore, higher net sales volumes are expected to result in greater operating income because such higher volumes allow the business operations to better leverage the fixed component of their respective cost structures. Conversely, the opposite effect is expected to occur at lower net sales and related production volumes.\nA. Results of Operations\nOverview\nThe Company produces forged components for (i) turbine engines that power commercial, business and regional aircraft as well as military aircraft and armored military vehicles; (ii) airframe applications for a variety of aircraft; (iii) industrial gas and steam turbine engines for power generation units; and (iv) other commercial applications.\nImpact of COVID-19 & Other Factors\nAs previously noted, the lingering impact and residual effects of the COVID-19 pandemic, along with other factors such as ongoing geopolitical tensions, continue to impact the United States and other countries in which the Company operates, including strains on supply chains and inflationary impacts. During fiscal 2022, the ongoing impact of the COVID-19 pandemic continued to effect the Companys results of operations. Given the long lead times for certain of the Company's products, the Company has continued to see an impact related to the effects of COVID-19 on orders and deliveries in fiscal 2022. While the exact timing and pace of recovery in our markets continues to be indeterminable, there are indications that commercial air travel is steadily recovering. While the long-term outlook remains positive given the nature of the industry, there continues to be uncertainty with the respect to when commercial air traffic will return to pre-COVID-19 levels. Given the fluidity of the situation, it is still unclear how lasting and deep the ongoing economic impacts of COVID-19 will last.\nIn response to the uncertain environment created by the COVID-19 pandemic and its effects, the Company has, at various points in fiscal 2022 and prior periods, taken measures to reduce costs by furloughing and laying off certain of its employees from one of its plant locations that has experienced reduced sales of commercial aerospace products. Such employees have since returned to work.\nAdditionally, our operations are subject to global economic and geopolitical risks. For example, while the Company does not have a presence in these regions, the ongoing conflict between Russia and Ukraine has impacted economic activity as well as the availability and price of raw materials and energy. The Company continues to actively monitor these factors and find ways to mitigate the impact on its operations.\nFiscal Year 2022 Compared with Fiscal Year 2021\nNet Sales\nNet sales comparative information for fiscal 2022 and 2021, respectively, is as follows:\n(Dollars in millions) Years Ended\nSeptember 30, Increase\n(Decrease)\nNet Sales 2022 2021\nAerospace components for:\nFixed wing aircraft $ 39.5 $ 38.5 $ 1.0\nRotorcraft 15.6 27.2 (11.6)\nEnergy components for power generation units 17.4 20.4 (3.0)\nCommercial product and other revenue 11.4 13.5 (2.1)\nTotal $ 83.9 $ 99.6 $ (15.7)\nNet sales in fiscal 2022 decreased 15.8%, or $15.7 million to $83.9 million, compared with $99.6 million in fiscal 2021. Given the long lead times for certain of the Company's products, the Company has seen a greater impact related to the effects of COVID-19 on orders and deliveries in fiscal 2022 than in fiscal 2021. Fixed wing aircraft sales increased $1.0 million compared with the same period last year due to timing of customer orders, an increase in build rates in certain commercial programs and sales for military programs. Rotorcraft sales decreased $11.6 million in fiscal 2022 compared to the same period in fiscal 2021 primarily due to a timing change in requirements after advance ordering from customers in fiscal 2021 to help the\noverall supply chain through the effects of the COVID-19 pandemic. The energy components for power generation units decreased $3.0 million compared with the same period last year due to customer order reductions.\nCommercial net sales were 47.4% of total net sales and military net sales were 52.6% of total net sales in fiscal 2022, compared with 36.7% and 63.3%, respectively, in the comparable period in fiscal 2021. Commercial net sales (which includes energy components) increased $3.2 million to $39.8 million in fiscal 2022, compared to $36.6 million in fiscal 2021 primarily due to the increase in build rates in the commercial aerospace industry. Military net sales decreased $18.9 million to $44.1 million in fiscal 2022, compared to $63.0 million in fiscal 2021 primarily due to timing of orders related to certain military programs as a result of advance ordering in fiscal 2021 and lower munition program volumes, such as H60 and Hellfire missile due to timing.\nCost of Goods Sold\nCost of goods sold (\"COGS\") decreased by $2.6 million, or 3.0%, to $85.8 million, or 102.2% of net sales, during fiscal 2022, compared with $88.4 million or 88.7% of net sales in the comparable period of fiscal 2021. The decrease was primarily due to lower volume from the military and munitions programs, increased raw material pricing and outside processing costs, inventory write down to net realizable value (\"NRV\") of $1.5 million and idle expense of $3.1 million partially offset by cost controlling measures including lower payroll costs of $1.8 million. Net sales decreased at a greater rate than COGS, leading COGS as a percent of net sales to be greater in fiscal 2022 than in fiscal 2021. This was primarily a result of the Company recording idle expense of $3.1 million, an inventory write down to NRV of $1.5 million, and experiencing increased outside processing and raw material costs. Prior year results included $2.1 million of idle expense and $0.3 million of inventory write down to NRV.\nGross Profit (Loss)\nGross profit (loss) decreased by $13.1 million, or 116.6%, to a loss of $1.9 million during fiscal 2022, compared with $11.2 million profit in fiscal 2021. Gross margin percent of sales was (2.2%) during fiscal 2022, compared with 11.3% in fiscal 2021, primarily due to lower volume, inventory write down to NRV of $1.5 million and incremental idle costs of $1.0 million, higher raw material prices, and outside processing costs in fiscal 2022 compared with the prior year, partially offset by lower payroll.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses were $11.9 million, or 14.2% of net sales, during fiscal 2022, compared with $13.5 million, or 13.5% of net sales, in fiscal 2021. The decrease in selling, general and administrative expenses is due to the continued cost reduction efforts by management, including lower wages, commissions and travel expenses, partially offset by higher legal and professional costs.\nAmortization of Intangibles\nAmortization of intangibles decreased $0.7 million to $0.3 million during fiscal 2022, compared with $1.0 million in the comparable period of fiscal 2021. Such decrease was primarily due to certain intangible assets that were fully amortized during fiscal 2022.\nOther/General\nThe Company recorded an operating loss of $14.1 million during fiscal 2022, compared with an operating loss of $1.1 million in fiscal 2021.\nIncluded in the current year results, the Company recognized a gain on extinguishment of debt related to the PPP loan, that was forgiven by the SBA, for $5.1 million. See Note 5, Debt for further discussion. Prior year results included a gain on insurance recoveries of $2.4 million a gain on debt extinguishment of $0.3 million due to partial loan forgiveness at the Company's Maniago location.\nInterest expense was $0.6 million in fiscal 2022 and fiscal 2021. See Note 5, Debt, of the consolidated financial statements for further information.\nThe following table sets forth the weighted average interest rates and weighted average outstanding balances under the Companys debt agreements in fiscal 2022 and 2021:\nWeighted Average\nInterest Rate\nYears Ended September 30, Weighted Average\nOutstanding Balance\nYears Ended September 30,\n2022 2021 2022 2021\nRevolving credit agreement 2.6% 1.5% $ 10.4 million $ 9.1 million\nForeign term debt 2.8% 3.5% $ 6.2 million $ 7.0 million\nOther debt 0.7% 0.9% $ 1.9 million $ 5.7 million\nThe Company believes that inflation did not materially impact its results of operations in either fiscal 2022 or 2021. However, the Company does expect inflationary pressures to have some impact in fiscal 2023.\nIncome Taxes\nThe Companys effective tax rate in fiscal 2022 was 0.4% compared with 62.2% in fiscal 2021. The decrease in the effective tax rate in fiscal 2022 is primarily attributable to tax benefits from adjusting deferred taxes recorded in Italy applied against a year-to-date loss in fiscal 2021 which was non-recurring in fiscal 2022 and changes in jurisdictional mix of income in fiscal 2022 compared with the same period in fiscal 2021. The effective tax rate differs from the U.S. federal statutory rate due primarily to the valuation allowance against the Companys U.S. deferred tax assets and income in foreign jurisdictions that are taxed at different rates than the U.S. statutory tax rate.\nNet Income (Loss)\nNet loss was $9.6 million during fiscal 2022, compared with net loss of $0.7 million in fiscal 2021. The decrease in income in the current period was primarily due to lower volume, increased inventory write down to NRV, higher idle expense, raw material prices as a result of supply chain constraints, excess and obsolete costs, and outside processing expenses, partially offset by the gain on debt extinguishment of debt related to the PPP loan and lower payroll and selling, general and administrative expenses.\nNon-GAAP Financial Measures\nPresented below is certain financial information based on our EBITDA and Adjusted EBITDA. References to EBITDA mean earnings (losses) from operations before interest, taxes, depreciation and amortization, and references to Adjusted EBITDA mean EBITDA plus, as applicable for each relevant period, certain adjustments as set forth in the reconciliations of net income (loss) to EBITDA and Adjusted EBITDA.\nNeither EBITDA nor Adjusted EBITDA is a measurement of financial performance under generally accepted accounting principles in the United States of America (GAAP). The Company presents EBITDA and Adjusted EBITDA because it believes that they are useful indicators for evaluating operating performance and liquidity, including the Companys ability to incur and service debt and it uses EBITDA to evaluate prospective acquisitions. Although the Company uses EBITDA and Adjusted EBITDA for the reasons noted above, the use of these non-GAAP financial measures as analytical tools has limitations. Therefore, reviewers of the Companys financial information should not consider them in isolation, or as a substitute for analysis of the Company's results of operations as reported in accordance with GAAP. Some of these limitations include:\nNeither EBITDA nor Adjusted EBITDA reflects the interest expense, or the cash requirements necessary to service interest payments, on indebtedness;\nAlthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and neither EBITDA nor Adjusted EBITDA reflects any cash requirements for such replacements;\nThe omission of the substantial amortization expense associated with the Companys intangible assets further limits the usefulness of EBITDA and Adjusted EBITDA; and\nNeither EBITDA nor Adjusted EBITDA includes the payment of taxes, which is a necessary element of operations.\nBecause of these limitations, EBITDA and Adjusted EBITDA should not be considered as measures of discretionary cash available to the Company to invest in the growth of its businesses. Management compensates for these limitations by not viewing EBITDA or Adjusted EBITDA in isolation and specifically by using other GAAP measures, such as net income (loss), net sales, and operating profit (loss), to measure operating performance. The Companys calculation of EBITDA and Adjusted EBITDA may not be comparable to the calculation of similarly titled measures reported by other companies.\nThe following table sets forth a reconciliation of net loss to EBITDA and Adjusted EBITDA:\n(Dollars in thousands) Years Ended\nSeptember 30,\n2022 2021\nNet loss $ (9,640) $ (743)\nAdjustments:\nDepreciation and amortization expense 6,348 7,662\nInterest expense, net 646 638\nIncome tax benefit (43) (1,222)\nEBITDA (2,689) 6,335\nAdjustments:\nForeign currency exchange loss, net (1) 15 23\nOther (income) loss, net (2) (149) 215\n(Gain) loss on disposal of assets (3) (7) 209\nGain on insurance recoveries (4) - (2,397)\nGain on debt extinguishment (5) (5,106) (287)\nEquity compensation expense (6) 428 469\nPension settlement/curtailment benefit (7) 208 274\nLIFO impact (8) 729 924\nAdjusted EBITDA $ (6,571) $ 5,765\n(1)Represents the gain or loss from changes in the exchange rates between the functional currency and the foreign currency in which the transaction is denominated.\n(2)Represents miscellaneous non-operating income or expense, such as pension costs or grant income.\n(3)Represents the difference between the proceeds from the sale of operating equipment and the carrying value shown on the Company's books or asset impairment of long-lived assets.\n(4)Represents the difference between the insurance proceeds received for the damaged property and the carrying values shown on the Company's books for the assets that were damaged in the fire at the Orange location that occurred in December 2018.\n(5)Represents the gain on extinguishment of debt and interest for the amount forgiven by the SBA as it relates to the PPP loan in fiscal 2022 and term debt forgiveness as is relates to foreign borrowings in fiscal 2021.\n(6)Represents the equity-based compensation expense recognized by the Company under the 2016 Plan due to granting of awards, awards not vesting and/or forfeitures.\n(7)Represents expense incurred by its defined benefit pension plans related to settlement of pension obligations.\n(8)Represents the change in the reserve for inventories for which cost is determined using the last-in, first-out (LIFO) method.\nReference to the above activities can be found in the consolidated financial statements included in  Item 8. Financial Statements and Supplementary Data\nFinancial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 248)\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Income (Loss)\nConsolidated Balance Sheets\nConsolidated Statements of Cash Flows\nConsolidated Statements of Shareholders' Equity\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nSIFCO Industries, Inc.\nOpinion on the financial statements\nWe have audited the accompanying consolidated balance sheets of SIFCO Industries, Inc. (an Ohio corporation) and subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, comprehensive income (loss), shareholders equity, and cash flows for each of the two years in the period ended September 30, 2022 and the related notes and financial statement schedule included under Item 15(a) (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the two years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical audit matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit\nmatters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nRecoverability of long-lived assets at Orange, California\nAs described further in Note 1 to the financial statements, the Company reviews the carrying value of its long-lived assets when events and circumstances indicate a triggering event has occurred. This review is performed using estimates of future undiscounted cash flows. If the carrying value of a long-lived asset or asset group is greater than the estimated undiscounted future cash flows, the long-lived asset or asset group is considered impaired and an impairment charge is recorded for the amount by which the carrying value exceeds its fair value. We identified the recoverability of long-lived assets at Orange, California as a critical audit matter.\nThe principal considerations for our determination that the recoverability of long-lived assets at Orange, California is a critical audit matter are the high degree of auditor judgement necessary in evaluating certain inputs and assumptions made by management in the undiscounted cash flow analysis. Those assumptions include forecasted revenue and EBITDA and estimated sale price of the asset group at the end of the useful life, which contribute significantly to the undiscounted cash flows of the asset group.\nOur audit procedures related to the analysis included the following, among others.\nWe obtained an understanding of and evaluated the design of controls relating to managements recoverability of long-lived assets analysis, including controls over the determination of the undiscounted cash flows of the asset group and review controls over the reasonableness of key inputs and assumptions.\nWe assessed the reasonableness of the methodologies and significant inputs used to estimate the future cash flows of the asset group, including the revenue and EBITDA growth rates.\nWe assessed the reasonableness of the estimated sale value of the asset group at the end of the useful life.\n/s/ GRANT THORNTON LLP\nWe have served as the Companys auditor since 2002.\nCleveland, Ohio\nDecember 22, 2022\nSIFCO Industries, Inc. and Subsidiaries\nConsolidated Statements of Operations\n(Amounts in thousands, except per share data)\nYears Ended September 30,\n2022 2021\nNet sales $ 83,902 $ 99,591\nCost of goods sold 85,757 88,386\nGross (loss) profit (1,855) 11,205\nSelling, general and administrative expenses 11,909 13,484\nAmortization of intangible assets 313 1,011\n(Gain) loss on disposal or impairment of operating assets (7) 209\nGain on insurance recoveries - (2,397)\nOperating (loss) (14,070) (1,102)\nInterest expense, net 645 638\nGain on debt extinguishment (5,106) (287)\nForeign currency exchange loss, net 15 23\nOther expense, net 59 489\n(Loss) before income tax benefit (9,683) (1,965)\nIncome tax benefit (43) (1,222)\nNet (loss) $ (9,640) $ (743)\nNet (loss) per share:\nBasic $ (1.65) $ (0.13)\nDiluted $ (1.65) $ (0.13)\nWeighted-average number of common shares (basic) 5,830 5,759\nWeighted-average number of common shares (diluted) 5,830 5,759\nSee notes to consolidated financial statements.\nSIFCO Industries, Inc. and Subsidiaries\nConsolidated Statements of Comprehensive Income (Loss)\n(Amounts in thousands)\nYears Ended September 30,\n2022 2021\nNet (loss) $ (9,640) $ (743)\nOther comprehensive (loss) income, net of tax:\nForeign currency translation adjustment, net of tax $0 and $0, respectively\n(837) (102)\nRetirement plan liability adjustment, net of tax $0 and $0, respectively\n1,211 4,491\nInterest rate swap agreement adjustment, net of tax $0 and $0, respectively\n12 -\nComprehensive (loss) income $ (9,254) $ 3,646\nSee notes to consolidated financial statements.\nSIFCO Industries, Inc. and Subsidiaries\nConsolidated Balance Sheets\n(Amounts in thousands, except per share data)\nSeptember 30,\n2022 2021\nASSETS\nCurrent assets:\nCash and cash equivalents $ 1,174 $ 346\nReceivables, net of allowance for doubtful accounts of $111 and $167, respectively\n16,515 19,914\nContract asset 10,172 12,874\nInventories, net 8,969 12,546\nRefundable income taxes 97 101\nPrepaid expenses and other current assets 1,851 1,792\nTotal current assets 38,778 47,573\nProperty, plant and equipment, net 39,272 42,708\nOperating lease right-of-use assets, net 15,167 15,943\nIntangible assets, net 477 874\nGoodwill 3,493 3,493\nOther assets 79 77\nTotal assets $ 97,266 $ 110,668\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nCurrent maturities of long-term debt $ 4,379 $ 9,566\nRevolver 11,163 8,930\nShort-term operating lease liabilities 792 788\nAccounts payable 10,387 9,811\nAccrued liabilities 5,868 6,871\nTotal current liabilities 32,589 35,966\nLong-term debt, net of current maturities 3,508 2,669\nLong-term operating lease liabilities, net of short-term 14,786 15,439\nDeferred income taxes 137 158\nPension liability 4,812 6,073\nOther long-term liabilities 744 741\nShareholders equity:\nSerial preferred shares, no par value, authorized 0 shares\n- -\nCommon shares, par value $1 per share, authorized 10,000 shares; issued and outstanding shares 6,040 at September 30, 2022 and 5,987 at September 30, 2021\n6,040 5,987\nAdditional paid-in capital 11,387 11,118\nRetained earnings 31,956 41,596\nAccumulated other comprehensive loss (8,693) (9,079)\nTotal shareholders equity 40,690 49,622\nTotal liabilities and shareholders equity $ 97,266 $ 110,668\nSee notes to consolidated financial statements.\nSIFCO Industries, Inc. and Subsidiaries\nConsolidated Statements of Cash Flows\n(Amounts in thousands)\nYears Ended September 30,\n2022 2021\nCash flows from operating activities:\nNet (loss) $ (9,640) $ (743)\nAdjustments to reconcile net (loss) to net cash provided by operating activities:\nDepreciation and amortization 6,348 7,662\nAmortization of debt issuance costs 40 72\n(Gain) loss on disposal of operating assets or impairment of operating assets (7) 209\nGain on insurance proceeds received for damaged property - (2,397)\nGain on extinguishment of debt (5,106) (287)\nInventory valuation accounts 1,639 92\nLIFO effect 729 924\nShare transactions under employee stock plan 322 453\nDeferred income taxes (48) (1,288)\nOther long-term liabilities 19 375\nChanges in operating assets and liabilities:\nReceivables 2,633 3,244\nContract assets 2,702 (877)\nInventories 443 1,952\nRefundable income taxes 4 2\nPrepaid expenses and other current assets (138) 157\nOther assets (4) 61\nAccounts payable 808 (4,443)\nAccrued liabilities (419) (1,279)\nAccrued income tax and other (27) 3\nNet cash provided by operating activities 298 3,892\nCash flows from investing activities:\nInsurance proceeds received for damaged property - 4,101\nProceeds from disposal of property, plant and equipment 7 -\nCapital expenditures (3,199) (4,979)\nNet cash used for investing activities (3,192) (878)\nCash flows from financing activities:\nProceeds from term note 261 1,020\nProceeds from long term debt 2,245 -\nRepayments of long-term debt (1,243) (405)\nProceeds from revolving credit agreement 79,802 89,264\nRepayments of revolving credit agreement (77,569) (93,204)\nProceeds from short-term debt borrowings 4,132 3,613\nRepayments of short-term debt borrowings (3,894) (3,354)\nPayments for debt issuance costs - (45)\nNet cash provided by (used for) financing activities 3,734 (3,111)\nIncrease (decrease) in cash and cash equivalents 840 (97)\nCash and cash equivalents at beginning of year 346 427\nEffects of exchange rate changes on cash and cash equivalents (12) 16\nCash and cash equivalents at end of year $ 1,174 $ 346\nSee notes to consolidated financial statements.\nSIFCO Industries, Inc. and Subsidiaries\nSupplemental disclosure of Cash Flow Information\n(Amounts in thousands)\nYears Ended September 30,\n2022 2021\nCash paid during the year:\nCash paid for interest $ (585) $ (397)\nCash paid for income tax, net $ (19) $ (62)\nNon-cash investing and financing activities:\nAdditions to property, plant & equipment - incurred but not yet paid $ 372 $ 257\nSee notes to consolidated financial statements.\nSIFCO Industries, Inc. and Subsidiaries\nConsolidated Statements of Shareholders Equity\n(Amounts in thousands)\nCommon\nShares Additional\nPaid-In\nCapital Retained\nEarnings Accumulated\nOther\nComprehensive\nLoss Total\nShareholders\nEquity\nBalance - September 30, 2020 $ 5,916 $ 10,736 $ 42,339 $ (13,468) $ 45,523\nComprehensive income (loss) - - (743) 4,389 3,646\nPerformance and restricted share expense - 469 - - 469\nShare transactions under employee stock plans 71 (87) - - (16)\nBalance - September 30, 2021 5,987 11,118 41,596 (9,079) 49,622\nComprehensive income (loss) - - (9,640) 386 (9,254)\nPerformance and restricted share expense - 428 - - 428\nShare transactions under employee stock plans 53 (159) - - (106)\nBalance - September 30, 2022 $ 6,040 $ 11,387 $ 31,956 $ (8,693) $ 40,690\nSee notes to consolidated financial statements.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements\n(Amounts in thousands, except per share data)\n1. Summary of Significant Accounting Policies\nA. DESCRIPTION OF BUSINESS\nSIFCO Industries, Inc. and its subsidiaries are engaged in the production of forgings and machined components primarily in the Aerospace and Energy (\"A&E\") market. The Companys operations are conducted in a single business segment, \"SIFCO\" or the \"Company.\"\nImpact of COVID-19 & Other Factors\nThe lingering impact and residual effects of the coronavirus (\"COVID-19\") pandemic, along with other factors, such as ongoing geopolitical tensions, have created strains on supply chains, and general economic conditions. While the exact timing and pace of recovery in our markets continues to be indeterminable, there are indications that commercial air travel is steadily recovering in certain areas. While the long-term outlook remains positive given the nature of the industry, there continues to be uncertainty with the respect to when commercial air traffic will return to pre-COVID-19 levels. Given the fluidity of the situation, it is still unclear how lasting and deep the ongoing economic impacts of COVID-19 will last.\nDuring fiscal 2022, the effects of COVID-19 continued to have an impact on the Companys results of operations. The Company has been impacted by delays in receiving orders and obtaining materials required to produce certain products. As sales volumes have fluctuated, the Company has taken measures to reduce costs by furloughing certain of its employees from time to time at one of its plant locations. Additionally, our operations are subject to global economic and geopolitical risks. For example, while the Company does not have a presence in these regions, the ongoing conflict between Russia and Ukraine has impacted economic activity as well as the availability and price of raw materials and energy. The Company continues to actively monitor these factors and find ways to mitigate the impact on its operations.\nB. PRINCIPLES OF CONSOLIDATION\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiaries. All significant intercompany accounts and transactions have been eliminated in consolidation. The U.S. dollar is the functional currency for all the Companys U.S. operations and its non-operating subsidiaries. For these operations, all gains and losses from completed currency transactions are included in income. The functional currency for the Company's other non-U.S. subsidiaries is the Euro. Assets and liabilities are translated into U.S. dollars at the rates of exchange at the end of the period, and revenues and expenses are translated using average rates of exchange. Foreign currency translation adjustments are reported as a component of accumulated other comprehensive loss in the consolidated statements of shareholders equity.\nC. CASH EQUIVALENTS\nThe Company considers all highly liquid short-term investments with original maturities of three months or less to be cash equivalents. A substantial majority of the Companys cash and cash equivalent bank balances exceed federally insured limits as of September 30, 2022 and 2021.\nD. CONCENTRATIONS OF CREDIT RISK\nReceivables are presented net of allowance for doubtful accounts of $111 and $167 at September 30, 2022 and 2021, respectively. Accounts receivable outstanding longer than the contractual payment terms are considered past due. The Company writes off accounts receivable when they become uncollectible. In fiscal 2022 $53 of accounts receivable were written off against the allowance for doubtful accounts, while in fiscal 2021 $9 of accounts receivable were recovered against the allowance for doubtful accounts. Bad debt benefit totaled $3 and $91 in fiscal 2022 and fiscal 2021, respectively.\nMost of the Companys receivables represent trade receivables due from manufacturers of turbine engines and aircraft components as well as turbine engine overhaul companies located throughout the world, including a significant concentration of U.S. based companies. In fiscal 2022, 11% of the Companys consolidated net sales were from one of its largest customers; and 23% of the Company's consolidated net sales were from the two largest customers and their direct subcontractors, which individually accounted for 12% and 11%, of consolidated net sales, respectively. In fiscal 2021, 20% of the Companys consolidated net sales were from two of its largest customers; and 38% of the Company's consolidated net sales were from three of the largest customers and their direct subcontractors which individually accounted for 17%, 11%, and 10%, of consolidated\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nnet sales, respectively. Other than what has been disclosed, no other single customer or group represented greater than 10% of total net sales in fiscal 2022 and 2021.\nAt September 30, 2022, three of the Companys largest customers had outstanding net accounts receivable balances that were 15%, 11% and 10%, respectively of the total net accounts receivable; and four of the largest customers and their direct subcontractors collectively had outstanding net accounts receivable which accounted for 15%, 11%, 11% and 10%, respectively of total net accounts receivable. At September 30, 2021, none of the Companys largest customers had outstanding net accounts receivable which individually accounted for 10% or more of total net accounts receivable; and one of the largest customers and their direct subcontractors had outstanding net accounts receivable which accounted for 17%, of total net accounts receivable, respectively. The Company performs ongoing credit evaluations of its customers financial conditions. The Company believes its allowance for doubtful accounts is sufficient based on the credit exposures outstanding at September 30, 2022.\nE. INVENTORY VALUATION\nFor a portion of the Company's inventory, cost is determined using the last-in, first-out (LIFO) method. For approximately 42% and 39% of the Companys inventories at September 30, 2022 and 2021, respectively, the LIFO method is used to value the Companys inventories. The first-in, first-out (FIFO) method is used to value the remainder of the Companys inventories, which are stated at the lower of cost or net realizable value. Net realizable value is the estimated selling price in the ordinary course of business less reasonably predictable costs of completion. In order to accurately reflect inventory, the Company wrote down inventory to realizable value of $1,538 and $325 for years ended September 30, 2022 and 2021, respectively.\nThe Company writes down inventory for obsolete and excess inventory each quarter and requires at a minimum that the write down be established based on an analysis of the age of the inventory. In addition, if the Company identifies specific obsolescence, other than that identified by the aging criteria, an additional write down will be recognized. Specific obsolescence and excess write down requirements may arise due to technological or market changes or based on cancellation of an order. The Company did not have a significant write down for obsolete and excess inventory for the years ended September 30, 2022 and 2021.\nF. PROPERTY, PLANT AND EQUIPMENT\nProperty, plant and equipment are stated at cost. Depreciation is generally computed using the straight-line method. Depreciation is provided in amounts sufficient to amortize the cost of the assets over their estimated useful lives. Depreciation provisions are based on estimated useful lives: (i) buildings, including building improvements - 5 to 40 years; (ii) machinery and equipment, including office and computer equipment - 3 to 20 years; (iii) software - 3 to 7 years (included in machinery and equipment); and (iv) leasehold improvements - 6 to 15 years range represent the remaining life or length of the lease, whichever is less (included in buildings).\nThe Company's property, plant and equipment assets by major asset class at September 30 consist of:\n2022 2021\nProperty, plant and equipment:\nLand $ 913 $ 994\nBuildings 16,553 16,931\nMachinery and equipment 93,510 92,871\nTotal property, plant and equipment 110,976 110,796\nLess: Accumulated depreciation\n71,704 68,088\nProperty, plant and equipment, net $ 39,272 $ 42,708\nDepreciation expense was $6,035 and $6,651 in fiscal 2022 and 2021, respectively.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nG. ASSET IMPAIRMENT\nThe Company reviews the carrying value of its long-lived assets (\"asset groups\"), when events and circumstances indicate a triggering event has occurred. This review is performed using estimates of future undiscounted cash flows, which include proceeds from disposal of assets. Under the Accounting Standard Codification (\"ASC\") 360 (\"Topic 360\"), if the carrying value of a long-lived asset is greater than the estimated undiscounted future cash flows, then the long-lived asset is considered impaired and an impairment charge is recorded for the amount by which the carrying value of the long-lived asset exceeds its fair value.\nFiscal 2022\nThe Company continuously monitors triggers to determine if further testing is necessary. In the third and fourth quarters, further assessment was necessary as certain qualitative factors, such as, operating results, historical and forecasted market conditions and projected undiscounted future cash flows triggered a recoverability test on its Orange, California (\"Orange\") location. The results indicated that the long-lived assets, right-of-use assets and definite lived intangible assets were recoverable and did not require further review for impairment.\nFiscal 2021\nThe Company continuously monitors triggers to determine if further testing is necessary. In the fourth quarter, further assessment was necessary as certain qualitative factors, such as, operating results, historical and forecasted market conditions and projected undiscounted future cash flows triggered a recoverability test on its Orange location. The results indicated that the long-lived assets, right-of-use assets and definite lived intangible assets were recoverable and did not require further review for impairment.\nH. GOODWILL AND INTANGIBLE ASSETS\nGoodwill represents the excess of the purchase price paid over the fair value of the net assets of an acquired business. Goodwill is subject to impairment testing if triggered in the interim, and if not, on an annual basis. The Company has selected July 31 as the annual impairment testing date. The first step of the goodwill impairment test compares the fair value of a reporting unit (as defined) with its carrying amount, including goodwill. If the fair value of the reporting unit exceeds its carrying amount, goodwill is not considered impaired. However, if the carrying amount exceeds the fair value, the Company should recognize an impairment charge for the amount by which the carrying amount exceeds the fair value, not to exceed the total amount of goodwill allocated to that reporting unit. See Note 3, Goodwill and Intangibles Assets, of the consolidated financial statements for further discussion of the July 31, 2022 and 2021 annual impairment test results. The Company monitors for triggering events outside of the annual impairment assessment date and no potential triggers were identified through September 30, 2022.\nIntangible assets consist of identifiable intangibles acquired or recognized in the accounting for the acquisition of a business and include such items as a trade name, a non-compete agreement, below market lease, customer relationships and order backlog. Intangible assets are amortized over their useful lives ranging from one year to ten years. Identifiable intangible assets assessment for impairment is evaluated when events and circumstances warrant such a review, as noted within Note 1, Summary of Significant Accounting Policies - Asset Impairment, of the consolidated financial statements.\nI. NET (LOSS) PER SHARE\nThe Companys net loss per basic share has been computed based on the weighted-average number of common shares outstanding. Due to the net loss in the reporting period, zero restricted shares and performance shares are included in the calculation of diluted earnings per share because the effect would be anti-dilutive. In the prior period, net loss per diluted share reflects the effect of the Company's outstanding restricted shares and performance shares under the treasury method. The dilutive effect is as follows:\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nSeptember 30,\n2022 2021\nNet (loss) $ (9,640) $ (743)\nWeighted-average common shares outstanding (basic and diluted) 5,830 5,759\nNet (loss) income per share - basic and diluted: $ (1.65) $ (0.13)\nAnti-dilutive weighted-average common shares excluded from calculation of diluted earnings per share 270 412\nJ. REVENUE RECOGNITION\nThe Company recognizes revenue using the five-step revenue recognition model in which it depicts the transfer of goods to customers in an amount that reflects the consideration to which a company expects to be entitled in exchange for those goods or services. The revenue standard also requires disclosure sufficient to enable users to understand the nature, amount, timing and uncertainty of revenue and cash flows arising from contracts with customers, including qualitative and quantitative disclosures about contracts with customers, significant judgments and changes in judgments and assets recognized from the cost to obtain or fulfill a contract.\nThe Company recognizes revenue in the following manner using the five-step revenue recognition model. A contract exists when there is approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectability of consideration is probable.\nRevenue is recognized when performance obligations under the terms of the contract with a customer of the Company are satisfied. A portion of the Company's contracts are from purchase orders (\"PO's\"), which continue to be recognized as of a point in time when products are shipped from the Company's manufacturing facilities or at a later time when control of the products transfers to the customer. Under the revenue standard, the Company recognizes certain revenue over time as it satisfies the performance obligations because the conditions of transfer of control to the applicable customer are as follows:\nCertain military contracts, which relate to the provisions of specialized or unique goods to the U.S. government with no alternative use, include provisions within the contract that are subject to the Federal Acquisition Regulation (\"FAR\"). The FAR provision allows the customer to unilaterally terminate the contract for convenience and requires the customer to pay the Company for costs incurred plus reasonable profit margin and take control of any work in process.\nFor certain commercial contracts involving customer-specific products with no alternative use, the contract may fall under the FAR clause provisions noted above for military contracts or may include certain provisions within their contract that the customer controls the work in process based on contractual termination clauses or restrictions of the Company's use of the product and the Company possesses a right to payment for work performed to date plus reasonable profit margin.\nAs a result of control transferring over time for these products, revenue is recognized based on progress toward completion of the performance obligation. The selection of the method to measure progress towards completion requires judgment and is based on the nature of the products to be provided. The Company elected to use the cost to cost input method of progress based on costs incurred for these contracts because it best depicts the transfer of goods to the customer based on incurring costs on the contracts. Under this method, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the total estimated costs at completion of the performance obligation. Revenues are recorded proportionally as costs are incurred.\nRevenue is measured as the amount of consideration the Company expects to receive in exchange for transferring goods. An accounting policy election to exclude from transaction price was made for sales, value add, and other taxes the Company collects concurrent with revenue-producing activities when applicable. The Company has elected to recognize incremental costs incurred to obtain contracts, which primarily represent commissions paid to third party sales agents where the amortization period would be less than one year, as selling, general and administrative expenses in the consolidated statements of operations as incurred.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe Company elected a practical expedient under Topic 606 to not adjust the promised amount of consideration for the effects of any significant financing component where the Company expects, at contract inception, that the period between when the Company transfers a promised good to a customer and when the customer pays for that good will be one year or less. Finally, the Company's policy is to exclude performance obligations resulting from contracts with a duration of one year or less from its disclosures related to remaining performance obligations.\nThe amount of consideration to which the Company expects to be entitled in exchange for the goods is not generally subject to significant variations.\nThe Company elected to recognize the cost of freight and shipping when control of the products has transferred to the customer as an expense in cost of goods sold on the consolidated statements of operations, because those are costs incurred to fulfill the promise recognized, not a separate performance obligation. To the extent certain freight and shipping fees are charged to customers, the Company recognizes the amounts charged to customers as revenues and the related costs as an expense in cost of goods sold when control of the related products has transferred to the customer.\nContracts are occasionally modified to account for changes in contract specifications, requirements, and pricing. The Company considers contract modifications to exist when the modification either creates new or changes the existing enforceable rights and obligations. Substantially all of the Company's contract modifications are for goods that are distinct from the existing contract. Therefore, the effect of a contract modification on the transaction price and the Company's measure of progress for the performance obligation to which it relates is generally recognized on a prospective basis.\nContract Balances\nContract assets on the consolidated balance sheets are recognized when a good is transferred to the customer and the Company does not have the contractual right to bill for the related performance obligations. In these instances, revenue recognized exceeds the amount billed to the customer and the right to payment is not solely subject to the passage of time. Amounts do not exceed their net realizable value. Contract liabilities relate to payments received in advance of the satisfaction of performance under the contract. Payments from customers are received based on the terms established in the contract with the customer.\nK. LEASES\nThe leasing standard requires lessees to recognize a Right-of-Use (\"ROU\") asset and a lease liability on the consolidated balance sheet, with the exception of short-term leases. The Company primarily leases its manufacturing buildings, specifically at its Orange location, as well as certain machinery and office equipment. The Company determines if a contract contains a lease based on whether the contract conveys the right to control the use of identified assets for a period in exchange for consideration. Upon identification and commencement of a lease, the Company establishes a ROU asset and a lease liability. Operating leases are included in ROU assets, short-term operating lease liabilities, and long-term operating lease liabilities on the consolidated balance sheets. Finance leases are included in property, plant, and equipment, current maturities of long-term debt and long-term debt on the consolidated balance sheets.\nROU assets and liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. As most of the leases do not provide an implicit rate, the Company uses the incremental borrowing rate based on the information available at commencement date and duration of the lease term in determining the present value of the future payments. Lease expense for operating leases is recognized on a straight-line basis over the lease term, while the expense for finance leases is recognized as depreciation expense and interest expense using the accelerated interest method of recognition.\nL. IMPACT OF RECENTLY ADOPTED ACCOUNTING STANDARDS\nIn December 2019, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standards Update (\"ASU\") 2019-12, \"Income Taxes (ASC 740) - Simplifying the Accounting for Income Taxes,\" which is intended to reduce complexity in the accounting for income taxes while maintaining or improving the usefulness of information provided to financial statement users. The guidance amends certain existing provisions under ASC 740 to address a number of distinct items. The Company adopted ASU 2019-12 effective October 1, 2021. Adoption of the amendments in this ASU did not have an impact to the Company's results of operations and financial condition.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nM. IMPACT OF NEWLY ISSUED ACCOUNTING STANDARDS\nIn June 2016, the FASB issued ASU 2016-13, \"Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments\" and subsequent updates. ASU 2016-13 changes how entities will measure credit losses for most financial assets and certain other instruments that are not measured at fair value through net income. The new guidance will replace the current incurred loss approach with an expected loss model. The new expected credit loss impairment model will apply to most financial assets measured at amortized cost and certain other instruments, including trade and other receivables, loans, held-to-maturity debt instruments, net investments in leases, loan commitments and standby letters of credit. Upon initial recognition of the exposure, the expected credit loss model requires entities to estimate the credit losses expected over the life of an exposure (or pool of exposures). The estimate of expected credit losses should consider historical information, current information and reasonable and supportable forecasts, including estimates of prepayments. Financial instruments with similar risk characteristics should be grouped together when estimating expected credit losses. ASU 2016-13 does not prescribe a specific method to make the estimate, so its application will require significant judgment. ASU 2016-13 is effective for public companies in fiscal years beginning after December 15, 2019, including interim periods within those fiscal years. However, in November 2019, the FASB issued ASU 2019-10, \"Financial Instruments - Credit Loss (Topic 326), Derivatives and Hedging (Topic 815), and Leases (Topic 842),\" which defers the effective date for public filers that qualify as a smaller reporting company (\"SRC\"), as defined by the Securities and Exchange Commission, to fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. Because SIFCO is considered a SRC, the Company does not need to implement this standard until October 1, 2023. The Company will continue to evaluate the effect of adopting ASU 2016-13 will have on the Company's results within the consolidated statements of operations and financial condition.\nIn March 2020, the FASB issued ASU 2020-04, \"Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting,\" which is intended to provide temporary optional expedients and exceptions to the U.S. GAAP guidance on contract modifications and hedge accounting to ease the financial reporting burden related to the expected market transition from the London Interbank Offered Rate (\"LIBOR\") and other interbank offered rates to alternative reference rates. This ASU, along with recently issued ASU 2021-01, which further clarifies the scope of Topic 848, is available immediately and may be implemented in any period prior to the guidance expiration on December 31, 2022. ASU 2020-04 was effective beginning on March 12, 2020, and the Company may elect to apply the amendments prospectively through December 31, 2022. The Company has not applied any optional expedients and exceptions to date, and will continue to evaluate the impact of the guidance and whether it will apply the optional expedients and exceptions.\nN. USE OF ESTIMATES\nAccounting principles generally accepted in the U.S. require management to make a number of estimates and assumptions relating to the reported amounts of assets and liabilities and the disclosure of contingent liabilities, at the date of the consolidated financial statements, and the reported amounts of revenues and expenses during the period in preparing these financial statements. Actual results could differ from those estimates.\nO. RESEARCH AND DEVELOPMENT\nResearch and development costs are expensed as they are incurred. Research and development expenses were nominal in fiscal 2022 and 2021.\nP. DEBT ISSUANCE COSTS\nDebt issuance costs are capitalized and amortized over the life of the related debt. Amortization of debt issuance costs is included in interest expense in the consolidated statements of operations.\nQ. ACCUMULATED OTHER COMPREHENSIVE LOSS\nThe components of accumulated other comprehensive loss as shown on the consolidated balance sheets at September 30 are as follows:\n2022 2021\nForeign currency translation adjustment, net of income tax benefit of $0 and $0, respectively\n$ (6,196) $ (5,359)\nNet retirement plan liability adjustment, net of income tax benefit of $(3,758) and $(3,758), respectively\n(2,509) (3,720)\nInterest rate swap agreement, net of income tax benefit of $0 and $0, respectively\n12 -\nTotal accumulated other comprehensive loss $ (8,693) $ (9,079)\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe following table provides additional details of the amounts recognized into net earnings from accumulated other comprehensive loss, net of tax:\nForeign Currency Translation Adjustment Retirement Plan Liability Adjustment Interest Rates Swap Adjustment Accumulated Other Comprehensive Loss\nBalance at September 30, 2020 $ (5,257) $ (8,211) $ - $ (13,468)\nOther comprehensive income (loss) before reclassifications (102) 3,371 - 3,269\nAmounts reclassified from accumulated other comprehensive loss - 1,120 - 1,120\nNet current-period other comprehensive income (loss) (102) 4,491 - 4,389\nBalance at September 30, 2021 (5,359) (3,720) - (9,079)\nOther comprehensive income (loss) before reclassifications (837) 527 12 (298)\nAmounts reclassified from accumulated other comprehensive loss - 684 684\nNet current-period other comprehensive income (loss) (837) 1,211 12 386\nBalance at September 30, 2022 $ (6,196) $ (2,509) $ 12 $ (8,693)\nThe following table reflects the changes in accumulated other comprehensive loss related to the Company for September 30, 2022 and 2021:\nAmount reclassified from accumulated other comprehensive loss\nDetails about accumulated other comprehensive loss components 2022 2021 Affected line item in the Consolidated Statement of Operations\nAmortization of Retirement plan liability:\nNet actuarial gain 1,003 4,217 (1)\nSettlements/curtailments\n208 274 (1)\n1,211 4,491 Total before taxes\n- - Income tax expense\n$ 1,211 $ 4,491 Net of taxes\n(1) These accumulated other comprehensive loss components are included in the computation of net periodic benefit cost. See Note 8, Retirement Benefit Plans, of the consolidated financial statements for further information.\nR. INCOME TAXES\nThe Company files a consolidated U.S. federal income tax return and tax returns in various state and local jurisdictions. The Companys Irish and Italian subsidiaries also file tax returns in their respective jurisdictions.\nThe Company provides deferred income taxes for the temporary difference between the financial reporting basis and tax basis of the Companys assets and liabilities. Such taxes are measured using the enacted tax rates that are assumed to be in effect when the differences reverse. Deductible temporary differences result principally from recording certain expenses in the financial statements in excess of amounts currently deductible for tax purposes. Taxable temporary differences result principally from tax depreciation in excess of book depreciation.\nThe Company evaluates for uncertain tax positions taken at each balance sheet date. The Company recognizes the financial statement benefit of a tax position only after determining that the relevant tax authority would more likely than not sustain the position. For tax positions meeting the more-likely-than-not threshold, the amount recognized in the financial statements is the\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nlargest cumulative benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the relevant tax authority. The Company's policy for interest and/or penalties related to underpayments of income taxes is to include interest and penalties in tax expenses.\nThe Company maintains a valuation allowance against its deferred tax assets when management believes it is more likely than not that all or a portion of a deferred tax asset may not be realized. Changes in valuation allowances are recorded in the period of change. In determining whether a valuation allowance is warranted, the Company evaluates factors such as prior earnings history, expected future earnings, carry-back and carry-forward periods and tax strategies that could potentially enhance the likelihood of the realization of a deferred tax asset.\nThe Tax Cut and Jobs Act (the \"Act\") includes provisions for Global Intangible Low-Taxed Income (GILTI) wherein minimum taxes are imposed on foreign income in excess of a deemed return on the tangible assets of foreign corporations. This income will effectively be taxed at a 10.5% tax rate. GILTI was effective for the Company starting in fiscal 2019. The Company has elected to account for GILTI as a component of tax expense in the period in which the Company is subject to the rules.\nS. FAIR VALUE MEASUREMENTS\nFair value is defined as the price that would be received to sell an asset, or paid to transfer a liability, in an orderly transaction between market participants at the measurement date. In determining fair value, the Company utilizes certain assumptions that market participants would use in pricing the asset or liability, including assumptions about risk and/or the risks inherent in the inputs to the valuation technique. Based on the examination of the inputs used in the valuation techniques, the Company is required to provide the following information according to the fair value hierarchy. The fair value hierarchy ranks the quality and reliability of the information used to determine fair values.\nFinancial assets and liabilities carried at fair value will be classified and disclosed in one of the following three categories:\nLevel 1 - Quoted market prices in active markets for identical assets or liabilities\nLevel 2 - Observable market based inputs or unobservable inputs that are corroborated by market data\nLevel 3 - Unobservable inputs that are not corroborated by market data\nA financial instruments categorization within the valuation hierarchy is based upon the lowest level of input that is significant to the fair value measurement. The book value of cash equivalents, accounts receivable, and accounts payable are considered to be representative of their fair values because of their short maturities. The carrying value of debt is considered to approximate the fair value based on the borrowing rates currently available to us for loans with similar terms and maturities. Fair value measurements of non-financial assets and non-financial liabilities are primarily used in goodwill, other intangible assets and long-lived assets impairment analysis, the valuation of acquired intangibles and in the valuation of assets held for sale. Goodwill and intangible assets are valued using Level 3 inputs.\nT. SHARE-BASED COMPENSATION\nShare-based compensation is measured at the grant date, based on the calculated fair value of the award and the probability of meeting its performance condition, and is recognized as expense when it is probable that the performance conditions will be met over the requisite service period (generally the vesting period). Share-based expense includes expense related to restricted shares and performance shares issued under the Company's 2007 Long-Term Incentive Plan (Amended and Restated as of November 16, 2016) (as further amended, the \"2016 Plan\"). The Company recognizes share-based expense within selling, general, and administrative expense and adjusts for any forfeitures as they occur.\nU. GOING CONCERN\nIn accordance with ASU 2014-15, \"Presentation of Financial Statements-Going Concern (Subtopic 205-40) (\"ASC 205-40\")\", the Company has the responsibility to evaluate whether conditions and/or events raise substantial doubt about its ability to meet its future financial obligations as they become due within one year after the date that the financial statements are issued. This evaluation requires management to perform two steps. First, management must evaluate whether there are conditions and events that raise substantial doubt about the entitys ability to continue as a going concern. Second, if management concludes that substantial doubt is raised, management is required to consider whether it has plans in place to alleviate that doubt. This evaluation shall initially not take into consideration the potential mitigating effects of plans that have not been fully implemented as of the date the financial statements are issued. Disclosures in the notes to the consolidated financial statements are required if management concludes that substantial doubt exists or that its plans alleviate the substantial doubt that was\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nraised. The consolidated financial statements have been prepared assuming that the Company will continue as a going concern and do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets, or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\nV. RECLASSIFICATIONS\nCertain amounts in prior years have been reclassified to conform to the 2022 consolidated statement presentation. In fiscal 2022, the Company revised its classification within the Consolidated Statement of Cash Flows by moving a prior year amount of $325 of inventories from changes in operating assets and liabilities to adjustments to reconcile net loss to net cash provided by operating activities as this item is non-cash and is not a part of operating assets and liabilities.\n2. Inventories\nInventories at September 30 consist of:\n2022 2021\nRaw materials and supplies $ 2,968 $ 4,111\nWork-in-process 3,356 3,560\nFinished goods 2,645 4,875\nTotal inventories $ 8,969 $ 12,546\nIf the FIFO method had been used for the entire Company, inventories would have been $9,939 and $9,210 higher than reported at September 30, 2022 and 2021, respectively. LIFO expense was $729 in fiscal 2022 and $924 in fiscal 2021.\nIn fiscal 2022, results showed a reduction of inventory resulting in liquidations of LIFO inventory quantities. The estimated liquidation of LIFO inventory quantities results in a projected increase in cost of goods sold of approximately $180 during fiscal 2022. These inventories were carried in prior periods at the then prevailing costs, which were accurate at the time, but differ from the current manufacturing cost and/or material costs. There was $156 of LIFO liquidation in fiscal 2021.\nFor the portion of the Company's inventory not valued at LIFO, inventory is valued at FIFO and stated at the lower of cost or net realizable value. The Company wrote down inventory to net realizable value by $1,538 and $325 for the years ended September 30, 2022 and 2021, respectively.\nThe Company did not have a significant write down for obsolete and excess inventory for the years ended September 30, 2022 and 2021.\nThe allocation of production costs to inventory are based on a normal range of capacity in production. The amount of cost allocated to each unit of production is not increased as a consequence of low production or idle capacity. As a result, the Company recorded idle cost of $3,087 and $2,126 for years ended September 30, 2022 and 2021, respectively.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\n3. Goodwill and Intangible Assets\nThe Companys intangible assets by major asset class subject to amortization as of:\nSeptember 30, 2022 Weighted Average Life at September 30, Original\nCost Accumulated\nAmortization Impairment Currency Translation Net Book\nValue\nIntangible assets:\nTrade name 8 years $ 1,876 $ 1,868 $ - $ - $ 8\nTechnology asset 5 years 1,869 1,869 - - -\nCustomer relationships 10 years 13,589 13,036 - (84) 469\nTotal intangible assets $ 17,334 $ 16,773 $ - $ (84) $ 477\nSeptember 30, 2021\nIntangible assets:\nTrade name 8 years $ 1,876 $ 1,850 $ - $ - $ 26\nTechnology asset 5 years\n1,869 1,869 - - -\nCustomer relationships 10 years\n13,589 12,736 - (5) 848\nTotal intangible assets $ 17,334 $ 16,455 $ - $ (5) $ 874\nThe amortization expense on identifiable intangible assets for fiscal 2022 and 2021 was $313 and $1,011, respectively.\nAmortization expense associated with the identified intangible assets is expected to be as follows:\nAmortization\nExpense\nFiscal year 2023 $ 222\nFiscal year 2024 149\nFiscal year 2025 106\nFiscal year 2026 -\nFiscal year 2027 -\nGoodwill is not amortized, but is subject to an annual impairment test. The Company tests its goodwill for impairment in the fourth fiscal quarter, and in interim periods if certain events occur indicating that the carrying amount of goodwill may be impaired. Factors that would necessitate an interim goodwill impairment assessment include a sustained decline in the Company's stock price, prolonged negative industry or economic trends, or significant under-performance relative to expected, historical or projected future operating results.\nThe Company uses a fair value measurement approach which combines the income (discounted cash flow method) and market valuation (market comparable method) techniques for each of the Companys reporting units that carry goodwill. These valuation techniques use estimates and assumptions including, but not limited to, the determination of appropriate market comparable, projected future cash flows (including timing and profitability), discount rate reflecting the risk inherent in future cash flows, perpetual growth rate, and projected future economic and market conditions (Level 3 inputs).\nAlthough the Company believes its assumptions are reasonable, actual results may vary significantly and may expose the Company to material impairment charges in the future. The methodology for determining fair values was consistent for the periods presented.\n2022 and 2021 Annual Goodwill Impairment Tests\nSIFCO performed its annual impairment test as of July 31, 2022 and 2021, respectively, for the Cleveland, Ohio (\"Cleveland\") reporting unit. Results determined that the fair value of the reporting unit exceeded the carrying value at each assessment date. As a result, no impairment was required as of September 30, 2022 and 2021, respectively.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nGoodwill is expected to be deductible for tax purposes. Changes in the net carrying amount of goodwill were as follows:\nBalance at September 30, 2020 $ 3,493\nGoodwill impairment adjustment -\nCurrency translation -\nBalance at September 30, 2021 3,493\nGoodwill impairment adjustment -\nCurrency translation -\nBalance at September 30, 2022 $ 3,493\n4. Accrued Liabilities\nAccrued liabilities at September 30 consist of:\n2022 2021\nAccrued employee compensation and benefits $ 2,705 $ 4,075\nAccrued workers compensation 912 888\nContract liabilities 807 236\nOther accrued liabilities 1,444 1,672\nTotal accrued liabilities $ 5,868 $ 6,871\n5. Debt\nDebt at September 30 consists of:\n2022 2021\nRevolving credit agreement $ 11,163 $ 8,930\nForeign subsidiary borrowings 7,101 6,632\nFinance lease obligations 192 22\nOther, net of unamortized debt issuance cost ($20) and $(32)\n594 5,581\nTotal debt 19,050 21,165\nLess - current maturities (15,542) (18,496)\nTotal long-term debt $ 3,508 $ 2,669\nCredit Agreement and Security Agreement\nThe Company's asset-based Credit Agreement (as amended, the \"Credit Agreement\"), Security Agreement (Security Agreement) and Export Credit Agreement (as amended, the \"Export Credit Agreement\") are secured by substantially all the assets of the Company and its U.S. subsidiaries and a pledge of 66.67% of the stock of its first-tier non-U.S. subsidiaries. The Credit Agreement (as amended by Fifth Amendment (the \"Fifth Amendment\") described below), consists of a senior secured revolving credit facility with a maximum borrowing of $28,000. The revolving commitment through the Export Credit Agreement, as amended, which lends amounts to the Company on foreign receivables is $7,000. The Credit Agreement also has an accordion feature, which allows the Company to increase maximum borrowings by up to $10,000 upon consent of the Lender (as defined below) or upon additional lenders joining the Credit Agreement. The Credit Agreement and the Export Agreement were amended on February 19, 2021, when the Company and certain of its subsidiaries (collectively, the \"borrowers\") entered into the Fifth Amendment to the Credit Agreement and the First Amendment (the \"First Amendment\") to the Export Credit Agreement, in each case, with JPMorgan Chase Bank, N.A., a national banking association, (the \"Lender\"). The combined maximum borrowings remain unchanged at $35,000; however the maximum borrowing under the Credit Agreement was decreased to $28,000 (from $30,000) and the revolving commitment through the Export Agreement was increased to $7,000 (from $5,000). The Fifth Amendment, among other things, extended the maturity date from August 6, 2021 to February 19, 2024.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe Credit Agreement and the Export Credit Agreement were amended on March 23, 2022, when the Company entered into the Sixth Amendment to the Credit Agreement and the Second Amendment to the Export Agreement with its Lender. The Sixth Amendment, among other things, (i) revised the fixed coverage ratio to exclude the first $1,500 of unfunded capital expenditures through April 20, 2023, (ii) increased the letter of credit sub-limit from $2,000 to $3,000, (iii) modified the reference rate from the London interbank offered rate (\"LIBOR\") to SOFR and (iv) revised the property, plant and equipment component of the borrowing base under the Credit Agreement. The Second Amendment amends the Export Credit Agreement to replace the reference rate from LIBOR to SOFR.\nThe Credit Agreement contains affirmative and negative covenants and events of defaults. Prior to the Fifth Amendment, the Credit Agreement required the Company to maintain a fixed charge coverage ratio (\"FCCR\") of 1.1:1.0 any time the availability is equal to or less than 12.5% of the revolving commitment. However, the Fifth Amendment provides that the Company will not permit the fixed charge coverage ratio to be less than 1.1 to 1.0 as of the last day of any calendar month; provided that the fixed charge coverage ratio will not be tested unless (i) a default has occurred and is continuing, (ii) when the combined availability was less than or equal to the greater of (x) 10% of the lesser of the combined commitments or (y) 10% of the combined borrowing base, and $2,000, for three or more business days in any consecutive 30 day period. In the event of a default, the Company may not be able to access the revolver, which could impact the ability to fund working capital needs, capital expenditures and invest in new business opportunities. The total collateral at September 30, 2022 and September 30, 2021 was $22,711 and $25,370, respectively and the revolving commitment was $35,000 for both periods. Total availability at September 30, 2022 and September 30, 2021 was $9,403 and $14,570, respectively, which exceeds both the collateral and total commitment threshold. Since the availability was greater than the 10.0% of the revolving commitment as of September 30, 2022 and 10.0% of the revolving commitment at September 30, 2021, the FCCR calculation was not required. The Company's letters of credit balance was $1,970 and $1,800 as of September 30, 2022 and 2021, respectively.\nBorrowings will bear interest at the Lender's established domestic rate or SOFR, plus the applicable margin as set forth in the Sixth Amendment. The revolver has a rate based on SOFR plus 2.25% spread, which was 4.86% at September 30, 2022 and a rate based on LIBOR plus 1.75% spread, which was 1.84% at September 30, 2021. The Export Credit Agreement has a rate based on SOFR plus 1.75% spread, which was 4.36% at September 30, 2022 and a rate based on LIBOR plus 1.25% spread, which was 1.3% at September 30, 2021, respectively. The Company also has a commitment fee of 0.25% under the Credit Agreement as amended to be incurred on the unused balance of the revolver.\nForeign subsidiary borrowings\nForeign debt at September 30 consists of:\n2022 2021\nTerm loan $ 3,818 $ 3,127\nShort-term borrowings 2,289 1,867\nFactor 994 1,638\nTotal debt $ 7,101 $ 6,632\nLess - current maturities (4,078) (4,551)\nTotal long-term debt $ 3,023 $ 2,081\nReceivables pledged as collateral $ 792 $ 485\nInterest rates are based on Euribor rates plus spread which range from 1.5% to 5.1%. In September 2020, Maniago entered into a long-term term debt agreement in the amount of $1,465, which was used to repay existing debt and for working capital purposes. The long-term loan repayment schedule is over a 72 month period and has a rate based on Euribor plus 3.20% spread, which was 2.7% at September 30, 2020. To assist with the preservation of liquidity and uncertainty of COVID-19, subsequent to September 30, 2020, Maniago finalized with certain lenders a deferment of payments ranging between 6 to 12 months which has been reflected within the future minimum payment schedule.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe Company factors receivables from one of its customers. The factoring programs are uncommitted, whereby the Company offers receivables for sale to an unaffiliated financial institution, which are then subject to acceptance by the unaffiliated financial institution. Following the sale and transfer of the receivables to the unaffiliated financial institution, the receivables are not isolated from the Company, and effective control of the receivables is not passed to the unaffiliated financial institution, which does not have the right to pledge or sell the receivables. The Company accounts for the pledge of receivables under this agreement as short-term debt and continues to carry the receivables on its consolidated balance sheets.\nThe Maniago location obtained borrowings from two separate lenders in fiscal 2022. The first loan agreement was entered into in October 2021, in the amount of $1,200 with a repayment term of six years. The second loan agreement was entered into in September 2022, in the amount of $1,100 with a repayment term of five years. The proceeds from the first loan were used for working capital and the proceeds from the second loan for capital investment.\nThe Maniago location obtained borrowings from two separate lenders in fiscal 2021. The first loan was for $717 with repayment terms of approximately seven years, of which $287 was forgiven in the same period and was recorded in other income within the consolidated statements of operations and treated as a gain on debt extinguishment. A second loan with a repayment term of five years was obtained in the amount of $303. The proceeds of these loans were used for working capital purposes.\nPayments on debt under foreign debt and other debt (excluding finance lease obligations, see Note 10, Leases, of the consolidated financial statements) over the next 5 years are as follows:\nMinimum debt payments\n2023 $ 4,299\n2024 1,215\n2025 889\n2026 818\n2027 450\nThereafter 44\nTotal Minimum long-term debt payments $ 7,715\nDebt issuance costs\nThe Company had debt issuance costs of $86, which are included in the consolidated balance sheets as a deferred charge in other current assets, net of amortization of $46 and $17 at September 30, 2022 and 2021, respectively.\nOther\nOn April 10, 2020, the Company entered into an unsecured promissory note under the Paycheck Protection Program (the PPP Loan). The PPP Loan had an aggregate principal amount of $5,025. The loan proceeds were used for payroll payments and the SBA granted full forgiveness on January 25, 2022. The Company elected to treat the PPP Loan as debt under FASB Topic 470. As such, the Company derecognized the liability in the second quarter of fiscal 2022 when the loan was forgiven. As of September 30, 2022 and 2021 the PPP loan balance was $0 and $4,764, respectively.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\n6. Revenue\nThe Company produces forged components for (i) turbine engines that power commercial, business and regional aircraft as well as military aircraft and armored military vehicles; (ii) airframe applications for a variety of aircraft; (iii) industrial gas and steam turbine engines for power generation units; and (iv) other commercial applications.\nThe following table represents a breakout of total revenue by customer type:\nYears Ended\nSeptember 30,\n2022 2021\nCommercial revenue $ 39,786 $ 36,587\nMilitary revenue 44,116 63,004\nTotal $ 83,902 $ 99,591\nThe following table represents revenue by the various components:\nYears Ended\nSeptember 30,\nNet Sales 2022 2021\nAerospace components for:\nFixed wing aircraft $ 39,474 $ 38,474\nRotorcraft 15,602 27,214\nEnergy components for power generation units 17,396 20,390\nCommercial product and other revenue 11,430 13,513\nTotal $ 83,902 $ 99,591\nThe following table represents revenue by geographic region based on the Company's selling operation locations:\nYears Ended\nSeptember 30,\nNet Sales 2022 2021\nNorth America $ 68,333 $ 81,719\nEurope 15,569 17,872\nTotal $ 83,902 $ 99,591\nIn addition to the disaggregating revenue information provided above, approximately 56% and 65% of total net sales as of September 30, 2022 and 2021, respectively, was recognized on an over-time basis because of the continuous transfer of control to the customer, with the remainder recognized as a point in time.\nContract Balances\nGenerally, payment is due shortly after the shipment of goods. For performance obligations recognized at a point in time, a contract asset is not established as the billing and revenue recognition occur at the same time. For performance obligations recognized over time, a contract asset is established for revenue that is recognized prior to billing and shipment. Upon shipment and billing, the value of the contract asset is reversed and accounts receivable is recorded. In circumstances where prepayments are required and payment is made prior to satisfaction of performance obligations, a contract liability is established. If the satisfaction of the performance obligation occurs over time, the contract liability is reversed over the course of production. If the satisfaction of the performance obligation is point in time, the contract liability reverses upon shipment.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe following table contains a roll forward of contract assets and contract liabilities for the period ended September 30, 2022 and 2021:\nContract assets - Ending balance, September 30, 2020 $ 11,997\nAdditional revenue recognized over-time 64,384\nLess amounts billed to the customers (63,507)\nContract assets - Ending balance, September 30, 2021 $ 12,874\nAdditional revenue recognized over-time 46,747\nLess amounts billed to the customers (49,449)\nContract assets - Ending balance, September 30, 2022 $ 10,172\nContract liabilities (included within Accrued liabilities) - Ending balance, September 30, 2020 $ (636)\nPayments received in advance of performance obligations (829)\nPerformance obligations satisfied 1,229\nContract liabilities (included within Accrued liabilities) - Ending balance, September 30, 2021 $ (236)\nPayments received in advance of performance obligations (1,691)\nPerformance obligations satisfied 1,120\nContract liabilities (included within Accrued liabilities) - Ending balance, September 30, 2022 $ (807)\nThere were no impairment losses recorded on contract assets during the year ended September 30, 2022 and 2021, respectively.\nRemaining performance obligations\nAs of September 30, 2022 and 2021, the Company has $81,852 and $77,198, respectively, of remaining performance obligations, the majority of which are anticipated to be completed within the next twelve months.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\n7. Income Taxes\nThe components of loss before income tax benefit are as follows:\nYears Ended\nSeptember 30,\n2022 2021\nU.S. $ (6,985) $ (1,523)\nNon-U.S. (2,698) (442)\nLoss before income tax benefit $ (9,683) $ (1,965)\nIncome tax benefit consist of the following:\nYears Ended\nSeptember 30,\n2022 2021\nCurrent income tax provision (benefit):\nU.S. federal $ - $ (1)\nU.S. state and local 14 8\nNon-U.S. (9) 59\nTotal current tax provision 5 66\nDeferred income tax provision (benefit):\nU.S. federal 10 10\nU.S. state and local 3 (2)\nNon-U.S. (61) (1,296)\nTotal deferred tax benefit (48) (1,288)\nIncome tax benefit $ (43) $ (1,222)\nThe income tax benefit in the accompanying consolidated statements of operations differs from amounts determined by using the statutory rate as follows:\nYears Ended\nSeptember 30,\n2022 2021\n(Loss) before income tax benefit $ (9,683) $ (1,965)\nIncome tax (benefit) at U.S. federal statutory rates $ (2,033) $ (413)\nTax effect of:\nForeign rate differential (46) (193)\nPermanent items (1,032) 27\nState and local income taxes 18 6\nFederal tax credits (157) (145)\nValuation allowance 3,198 601\nPrior year tax adjustments - (1,115)\nOther 9 10\nIncome tax benefit $ (43) $ (1,222)\nOn August 16, 2022, the U.S. enacted the Inflation Reduction Act of 2022, which includes a 15% minimum tax on book income of certain large corporations, a 1% excise tax on net stock repurchases after December 31, 2022, and several tax incentives to promote clean energy. The Company does not believe this legislation will have a material impact on the Companys consolidated financial statements and will continue to assess the implications.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nDeferred tax assets and liabilities at September 30 consist of the following:\n2022 2021\nDeferred tax assets:\nNet U.S. operating loss carryforwards $ 6,166 $ 3,833\nNet non-U.S. operating loss carryforwards 1,023 637\nEmployee benefits 1,514 1,761\nInventory reserves 1,045 897\nAllowance for doubtful accounts 33 45\nIntangibles 1,223 1,621\nForeign tax credits 1,724 1,724\nOther tax credits 1,684 1,514\nOther 1,171 1,216\nTotal deferred tax assets $ 15,583 $ 13,248\nDeferred tax liabilities:\nDepreciation (7,298) (7,948)\nPrepaid expenses (286) (359)\nOther (419) (458)\nTotal deferred tax liabilities $ (8,003) $ (8,765)\nNet deferred tax assets 7,580 4,483\nValuation allowance (7,717) (4,641)\nNet deferred tax liabilities $ (137) $ (158)\nAt September 30, 2022, the Company has a non-U.S. tax loss carryforward of approximately $7,190 related to the Companys non-operating and Italian subsidiaries. The Company's non-operating subsidiary ceased operations in 2007 and therefore, a valuation allowance has been recorded against the deferred tax asset related to the Irish tax loss carryforward because it is unlikely that such operating loss can be utilized unless the Irish subsidiary resumes operations. Additionally, a valuation allowance has been recorded against the deferred tax asset related to the Italian tax loss carryforward as it is not more-likely-than-not that the deferred tax asset will be realizable. The non-operating and Italian tax loss carryforwards do not expire.\nThe Company has $1,724 of foreign tax credit carryforwards that are subject to expiration in fiscal 2023-2028, $1,506 of U.S. general business tax credits that are subject to expiration in 2035-2042, $466 of interest expense carryforward that do not expire, and $25,038 of U.S. Federal tax loss carryforwards with $9,107 subject to expiration in fiscal 2037 and $15,931 that do not expire. A valuation allowance has been recorded against the deferred tax assets related to the foreign tax credit carryforwards, U.S. general business credits, and U.S. Federal tax loss carryforwards.\nIn addition, the Company has $178 of U.S. state tax credit carryforwards subject to expiration in fiscal 2022-2024 and $23,994 of U.S. state and local tax loss carryforwards subject to expiration in fiscal 2023-2042. The U.S. state tax credit carryforwards and U.S. state and local tax loss carryforwards have been fully offset by a valuation allowance.\nThe Company reported liabilities for uncertain tax positions, excluding any related interest and penalties, of $22 for both fiscal 2022 and 2021. If recognized, $22 of the fiscal 2022 uncertain tax positions would impact the effective tax rate. As of September 30, 2022, the Company had accrued interest of $16 and recognized $1 for interest and penalties in operations. The Company classifies interest and penalties on uncertain tax positions as income tax expense. A summary of activity related to the Companys uncertain tax position is as follows:\n2022 2021\nBalance at beginning of year $ 22 $ 22\nDecrease due to lapse of statute of limitations - -\nBalance at end of year $ 22 $ 22\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe Company is subject to income taxes in the U.S. federal jurisdiction, Ireland, Italy and various states and local jurisdictions. The Company believes it has appropriate support for its federal income tax returns. The Company is no longer subject to U.S. federal income tax examinations by tax authorities for fiscal years prior to 2019, state and local income tax examinations for fiscal years prior to 2016, or non-U.S. income tax examinations by tax authorities for fiscal years prior to 2007.\nThe Company does not record deferred taxes on the undistributed earnings of its non-U.S. subsidiaries as it does not expect the temporary differences related to those unremitted earnings to reverse in the foreseeable future. As of September 30, 2022, the Company's non-U.S. subsidiaries had accumulated deficits of approximately $2,062. Future distributions of accumulated earnings of the Company's non-U.S. subsidiaries may be subject to nominal withholding taxes.\n8. Retirement Benefit Plans\nDefined Benefit Plans\nThe Company and certain of its subsidiaries sponsor four defined benefit pension plans covering some of its employees. The Companys funding policy for its defined benefit pension plans is based on an actuarially determined cost method allowable under Internal Revenue Service regulations. One of the defined benefit pension plans covers non-union employees of the Companys U.S. operations who were hired prior to March 1, 2003. Benefit accruals ceased in March 2003. A second defined benefit plan covered employees at a business location that closed in December 2013, at which time benefits accruals ceased. The third defined pension plan covers one of the Company's union groups at the Cleveland location. Benefits accruals under this plan ceased in March 2020, when the then-current union disclaimed all interest in the bargaining unit. Curtailment occurred; however, there was no impact to consolidated financial statements. A new union was certified and the collective bargaining agreement was finalized in December 2021, at which time it was agreed that the defined benefit plan would be frozen and retirement benefits are to be provided through a defined contribution plan. The Company sponsors a fourth defined benefit plan for certain employees at its Maniago location. The plan is a severance entitlement payable to the Italian employees who qualified prior to December 27, 2006. The plan is considered an unfunded defined benefit plan and its liability is measured as the actuarial present value of the vested benefits to which the employees would be entitled if they separated at the consolidated balance sheet date.\nThe Company uses a September 30 measurement date for its U.S. defined benefit pension plans. Net pension expense, benefit obligations and plan assets for the Company-sponsored defined benefit pension plans consist of the following:\nYears Ended\nSeptember 30,\n2022 2021\nService cost $ 42 $ 131\nInterest cost 714 699\nExpected return on plan assets (1,362) (1,421)\nAmortization of net loss 476 846\nSettlement cost 208 274\nNet pension expense for defined benefit plans $ 78 $ 529\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe status of all defined benefit pension plans at September 30 is as follows:\n2022 2021\nBenefit obligations:\nBenefit obligations at beginning of year $ 29,330 $ 31,793\nService cost 42 131\nInterest cost 714 699\nActuarial (gain) (5,265) (967)\nBenefits paid (1,970) (2,349)\nCurrency translation (56) 23\nBenefit obligations at end of year $ 22,795 $ 29,330\nPlan assets:\nPlan assets at beginning of year $ 23,211 $ 21,609\nActual return on plan assets (3,376) 3,825\nEmployer contributions 72 126\nBenefits paid (1,970) (2,349)\nPlan assets at end of year $ 17,937 $ 23,211\nAs shown within the above table, there was a decrease in the benefit obligation of $6,535 to $22,795 at September 30, 2022 compared with $29,330 at September 30, 2021. The primary drivers that attributed to the change pertained to increase in the discount rate used partially offset by asset returns.\nPlans in which\nBenefit Obligations\nExceed Assets at\nSeptember 30,\n2022 2021\nReconciliation of funded status:\nPlan assets less than projected benefit obligations $ (4,858) $ (6,119)\nAmounts recognized in accumulated other comprehensive loss:\nNet loss 6,271 7,482\nNet amount recognized in the consolidated balance sheets $ 1,413 $ 1,363\nAmounts recognized in the consolidated balance sheets are:\nAccrued liabilities (46) (46)\nPension liability (4,812) (6,073)\nAccumulated other comprehensive loss - pretax 6,271 7,482\nNet amount recognized in the consolidated balance sheets $ 1,413 $ 1,363\nWhere applicable, the following weighted-average assumptions were used in developing the benefit obligation and the net pension expense for defined benefit pension plans:\nYears Ended\nSeptember 30,\n2022 2021\nDiscount rate for liabilities 5.2 % 2.6 %\nDiscount rate for expenses 2.9 % 3.1 %\nExpected return on assets 6.4 % 7.0 %\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe Company holds investments in pooled separate accounts and common/collective trusts, in which the fair value of assets of the underlying funds are determined in the following ways:\nU.S. equity securities are comprised of domestic equities that are priced using the closing price of the applicable nationally recognized stock exchange, as provided by industry standard vendors such as Interactive Data Corporation.\nNon-U.S. equity securities are comprised of international equities. These securities are priced using the closing price from the applicable foreign stock exchange.\nU.S. bond funds are comprised of domestic fixed income securities. Securities are priced by industry standards vendors, such as Interactive Data Corporation, using inputs such as benchmark yields, reported trades, broker/dealer quotes, or issuer spreads.\n◦Included as part of the U.S. bond funds, are private placement funds, for which fair market value is not always commercially available, the fair value of these investments is primarily determined using a discounted cash flow model, which utilizes a discount rate based upon the average of spread surveys collected from private-market intermediaries who are active in both primary and secondary transactions, and takes into account, among other factors, the credit quality and industry sector of the issuer and the reduced liquidity associated with private placements.\nNon-U.S. bond funds are comprised of international fixed income securities. Securities are priced by Interactive Data Corporation, using inputs such as benchmark yields, reported trades, broker/dealer quotes, or issuer spreads.\nStable value fund is comprised of short-term securities and cash equivalent securities, which seek to provide high current income consistent with the preservation of principal and liquidity. As permitted under relevant securities laws, securities in this type of fund are valued initially at cost and thereafter adjusted for amortization of any discount or premium.\nThe methods described above may produce a fair value calculation that may not be indicative of net realizable value or reflective of future fair values. However, while the Company believes its valuation methods are appropriate and consistent with other market participants, the use of different methodologies or assumptions to determine the fair value of certain financial instruments could result in a different fair value measurement result.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe following tables set forth the asset allocation of the Companys defined benefit pension plan assets and summarize the fair values and levels within the fair value hierarchy for such plan assets as of September 30, 2022 and 2021:\nSeptember 30, 2022 Asset\nAmount Level 2 Level 3\nU.S. equity securities:\nLarge value $ 393 $ 393 $ -\nLarge blend 7,637 7,637 -\nLarge growth 302 302 -\nMid blend 167 167 -\nSmall blend 359 359 -\nNon-U.S. equity securities:\nForeign large blend 1,276 1,276 -\nDiversified emerging markets 63 63 -\nU.S. debt securities:\nInflation protected bond 971 971 -\nIntermediate term bond 6,332 4,503 1,829\nHigh inflation bond 78 78 -\nStable value:\nShort-term bonds 359 359 -\nTotal plan assets at fair value $ 17,937 $ 16,108 $ 1,829\nSeptember 30, 2021 Asset\nAmount Level 2 Level 3\nU.S. equity securities:\nLarge value $ 514 $ 514 $ -\nLarge blend 10,227 10,227 -\nLarge growth 519 519 -\nMid blend 223 223 -\nSmall blend 697 697 -\nNon-U.S. equity securities:\nForeign large blend 1,807 1,807 -\nDiversified emerging markets 86 86 -\nU.S. debt securities:\nInflation protected bond 1,087 1,087 -\nIntermediate term bond 7,396 5,288 2,108\nHigh inflation bond 189 189 -\nNon-U.S. debt securities:\nEmerging markets bonds 164 164 -\nStable value:\nShort-term bonds 302 302 -\nTotal plan assets at fair value $ 23,211 $ 21,103 $ 2,108\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nChanges in the fair value of the Companys Level 3 investments during the years ending September 30, 2022 and 2021 were as follows:\n2022 2021\nBalance at beginning of year $ 2,108 $ 2,098\nActual return on plan assets (279) 52\nPurchases and sales of plan assets, net - (42)\nBalance at end of year $ 1,829 $ 2,108\nInvestment objectives relative to the assets of the Companys defined benefit pension plans are to (i) optimize the long-term return on the plans assets while assuming an acceptable level of investment risk; (ii) maintain an appropriate diversification across asset categories and among investment managers; and (iii) maintain a careful monitoring of the risk level within each asset category. Asset allocation objectives are established to promote optimal expected returns and volatility characteristics given the long-term time horizon for fulfilling the obligations of the Companys defined benefit pension plans. Selection of the appropriate asset allocation for the plans assets was based upon a review of the expected return and risk characteristics of each asset category in relation to the anticipated timing of future plan benefit payment obligations. The Company has a long-term objective for the allocation of plan assets. However, the Company realizes that actual allocations at any point in time will likely vary from this objective due principally to (i) the impact of market conditions on plan asset values and (ii) required cash contributions to and distribution from the plans. The Asset Allocation Range listed below anticipates these potential scenarios and provides flexibility for the plans' investments to vary around the objective without triggering a reallocation of the assets, as noted by the following:\nPercent of Plan Assets at\nSeptember 30, Asset\nAllocation\nRange\n2022 2021\nU.S. equities 49 % 53 % 30% to 70%\nNon-U.S. equities 8 % 8 % 0% to 20%\nU.S. debt securities 41 % 37 % 20% to 70%\nNon-U.S. debt securities - % 1 % 0% to10%\nOther securities 2 % 1 % 0% to 60%\nTotal 100 % 100 %\nExternal consultants assist the Company with monitoring the appropriateness of the above investment strategy and the related asset mix and performance. To develop the expected long-term rate of return assumptions on plan assets, generally the Company uses long-term historical information for the target asset mix selected. Adjustments are made to the expected long-term rate of return assumptions when deemed necessary based upon revised expectations of future investment performance of the overall investments markets.\nThe Company anticipates making approximately $77 in contributions to its defined benefit pension plans during fiscal 2023. The Company has carryover balances from previous periods that may be available for use as a credit to reduce the amount of contributions that the Company is required to make to certain of its defined benefit pension plans in fiscal 2023. The Companys ability to elect to use such carryover balances will be determined based on the actual funded status of each defined benefit pension plan relative to the plans minimum regulatory funding requirements.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe following defined benefit payment amounts are expected to be made in the future:\nYears Ending\nSeptember 30,\nProjected\nBenefit Payments\n2023 $ 2,355\n2024 1,903\n2025 1,968\n2026 1,785\n2027 1,732\n2028-2032 8,032\nMulti-Employer Plan\nAs noted within Note 12, Business Information, one of the bargaining units previously participated in a multi-employer plan; however, as part of the ratification of a new collective bargaining agreement in December 2019, there was a provision to withdraw from the existing multi-employer plan effective December 31, 2019. The withdrawal resulted in a liability of $739, which was recorded within the costs of goods sold line in fiscal 2020 of the consolidated statements of operations and is included in other long-term liabilities. The liability is payable in quarterly installments over the next 20 years. The next four quarterly installments are recorded in accrued liabilities of the consolidated balance sheet.\nThe Company's withdrawal from the multi-employer plan was to mitigate the risks associated with such type of plan. Subsequent to the withdrawal, the remaining risk to the Company is the potential occurrence of a \"mass withdrawal\" of all participating employers within three years of the Company's withdrawal date, in which case the Company could be assessed additional withdrawal liability.\nDefined Contribution Plans\nSubstantially all non-union U.S. employees of the Company and its U.S. subsidiaries are eligible to participate in the Companys U.S. defined contribution plan. The Company makes non-discretionary, regular matching contributions to this plan equal to an amount that represents one hundred percent (100%) of a participants deferral contribution up to one percent (1%) of eligible compensation plus eighty percent (80%) of a participants deferral contribution between one percent (1%) and six percent (6%) of eligible compensation. The Companys regular matching contribution expense for its U.S. defined contribution plan in fiscal 2022 and 2021 was $528 and $571, respectively. This defined contribution plan provides that the Company may also make an additional discretionary matching contribution during those periods in which the Company achieves certain performance levels. The Company did not provide additional discretionary matching contributions in either fiscal 2022 and 2021.\nThe Company sponsors two defined contribution plans for the Cleveland bargaining units that either withdrew from the multi-employer plan (union) pension plan or bargained to freeze the company-sponsored pension plan. Impacted employees were enrolled into one of two newly formed defined contribution plans. The Company makes a non-elective contribution equal to $1.50 or $1.25 per work, vacation, or holiday hour, up to a maximum of 40 hours per week. The Company's non-elective contribution expense was $204 in fiscal 2022 and $112 in fiscal 2021.\nThe Company sponsors a defined contribution plan for certain of its Maniago union employees. The plan is a severance entitlement plan payable to Italian employees based on local government laws, which qualifies as a defined contribution plan.\n9. Stock-Based Compensation\nThe Company has awarded performance and restricted shares under the Company's 2007 Long-Term Incentive Plan (\"2007 Plan\") and the Company's 2007 Long-Term Incentive Plan (Amended and Restated as of November 16, 2016) (as further amended, the \"2016 Plan\"). The aggregate number of shares that may be awarded by the Company under the 2016 Plan is 1,196 shares, less any shares previously awarded and subject to an adjustment for the forfeiture of any unvested shares. In addition, shares that may be awarded are subject to individual recipient award limitations. The shares awarded under the 2016 Plan may be made in multiple forms including stock options, stock appreciation rights, restricted or unrestricted stock, and performance related shares. Any such awards are exercisable no later than ten years from the date of grant.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nThe performance shares that have been awarded under both plans generally provide for the vesting of the Companys common shares upon the Company achieving certain defined financial performance objectives during a period up to three years following the granting of such award. The ultimate number of common shares of the Company that may be earned pursuant to an award ranges from a minimum of no shares to a maximum of 200% of the initial target number of performance shares awarded, depending on the level of the Companys achievement of its financial performance objectives. Beginning in fiscal 2020, the maximum shares that may be achieved was reduced to 150% of target.\nWith respect to such performance shares, compensation expense is being accrued based on the probability of meeting the performance target. The Company is not recognizing compensation expense for three tranches of awards as it has concluded it is not probable that the performance criteria for those awards will be met. During each future reporting period, such expense may be subject to adjustment based upon the Company's financial performance, which impacts the number of shares that it expects to vest upon the completion of a performance period. The performance shares were valued at the closing market price of the Companys common shares on the date of grant. The vesting of such shares is determined at the end of the performance period.\nThe Company has awarded restricted shares to certain of its directors, officers and other employees of the Company. The restricted shares were valued at the closing market price of the Companys common shares on the date of grant, and such value was recorded as unearned compensation. The unearned compensation is being amortized ratably over the restricted stock vesting period of one (1) year or three (3) years.\nIf all outstanding share awards are ultimately earned and vest at the target number of shares, there are approximately 473 shares that remain available for award at September 30, 2022. If any of the outstanding share awards are ultimately earned and vest at greater than the target number of shares, up to the maximum of 200% or 150% of such target, then a fewer number of shares would be available for award.\nStock-based compensation under the 2016 Plan was expense of $428 and $469 for fiscal 2022 and 2021, respectively. As of September 30, 2022, there was $275 of total unrecognized compensation cost related to the performance and restricted shares awarded under the 2016 Plan. The Company expects to recognize this cost over the next year.\nThe following is a summary of activity related to performance and restricted shares:\n2022 2021\nNumber of\nShares Weighted Average\nFair Value at Date\nof Grant Number of\nShares Weighted Average\nFair Value at Date\nof Grant\nOutstanding at beginning of year 406 $ 4.05 371 $ 4.14\nRestricted shares awarded 72 7.18 79 5.76\nRestricted shares earned (75) 6.47 (107) 5.47\nPerformance shares awarded 44 8.00 71 3.74\nAwards forfeited (142) 4.73 (8) 3.18\nOutstanding at end of year 305 $ 4.75 406 $ 4.05\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\n10. Leases\nThe components of lease expense were as follows:\nYear Ended\nSeptember 30, 2022 Year Ended\nSeptember 30, 2021\nLease expense\nFinance lease expense:\nAmortization of right-of use assets on finance leases $ 46 $ 55\nInterest on lease liabilities 4 2\nOperating lease expense 1,696 1,952\nVariable lease cost 118 138\nTotal lease expense $ 1,864 $ 2,147\nThe following table presents the impact of leasing on the consolidated balance sheet at September 30:\nClassification to the consolidated balance sheets 2022 2021\nAssets:\nFinance lease assets Property, plant and equipment, net $ 202 $ 34\nOperating lease assets Operating lease right-of-use assets, net 15,167 15,943\nTotal lease assets $ 15,369 $ 15,977\nCurrent liabilities:\nFinance lease liabilities Current maturities of long-term debt $ 61 $ 17\nOperating lease liabilities Short-term operating lease liabilities 792 788\nNon-current liabilities:\nFinance lease liabilities Long-term debt, net of current maturities 131 5\nOperating lease liabilities Long-term operating lease liabilities, net of short-term 14,786 15,439\nTotal lease liabilities $ 15,770 $ 16,249\nSupplemental cash flow and other information related to leases were as follows:\nSeptember 30, 2022 September 30, 2021\nOther Information\nCash paid for amounts included in measurement of liabilities:\nOperating cash flows from operating leases $ 1,693 $ 1,952\nOperating cash flows from finance leases 3 2\nFinancing cash flows from finance leases 53 59\nRight-of-use assets obtained in exchange for new lease liabilities:\nFinance leases $ 206 $ -\nOperating leases 236 43\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nSeptember 30, 2022 September 30, 2021\nWeighted-average remaining lease term (years):\nFinance leases 3.6 1.1\nOperating leases 13.5 14.4\nWeighted-average discount rate:\nFinance leases 4.70 % 2.83 %\nOperating leases 5.93 % 5.89 %\nFuture minimum lease payments under non-cancellable leases as of September 30, 2022 were as follows:\nYear ending September 30, Finance Leases Operating\nLeases\n2023 $ 69 $ 1,662\n2024 61 1,671\n2025 33 1,669\n2026 27 1,667\n2027 19 1,680\nThereafter - 14,280\nTotal lease payments $ 209 $ 22,629\nLess: Imputed interest (17) (7,051)\nPresent value of lease liabilities $ 192 $ 15,578\n11. Commitments and Contingencies\nIn the normal course of business, the Company may be involved in ordinary, routine legal actions. The Company cannot reasonably estimate future costs, if any, related to these matters; however, it does not believe any such matters are material to its financial condition or results of operations. The Company maintains various liability insurance coverages to protect its assets from losses arising out of or involving activities associated with ongoing and normal business operations; however, it is possible that the Companys future operating results could be affected by future costs of litigation.\nA subsidiary of the Company, Quality Aluminum Forge, LLC (\"Orange\"), was a defendant in a lawsuit filed by Avco Corporation (Avco) in the Pennsylvania State Court, which was filed in August 2019, alleging that certain forged pistons delivered by the Orange plant failed to meet material specifications required by Avco. Avco also sued Arconic, Inc. (Arconic), which was the raw material supplier. The lawsuit has been resolved in a manner satisfactory to all parties pursuant to a confidential settlement agreement for an immaterial amount, and the case was dismissed on October 14, 2021.\nThe Company was a defendant in a purported class action lawsuit filed in the Superior Court of California, County of Orange, which was filed in August 2017, arising from employee wage-and-hour claims under California law for alleged meal period, rest break, hourly and overtime wage calculation, timely wage payment and necessary expenditure indemnification violations; failure to maintain required wage records and furnish accurate wage statements; and unfair competition. A settlement has been reached and the Company received preliminary court approval on July 13, 2020, following a brief delay caused by COVID-19 closures and restrictions. Class action notices were sent at the end of September 2020 and there were no objections to the settlement. On February 4, 2021, the court issued a tentative ruling to grant final approval. The final approval was granted and the previously recorded liability of $315 was paid on March 29, 2021.\nIn fiscal 2021, the insurance claim related to the fire on December 26, 2018 at the Orange location was finalized with the Company's insurance carrier. The Company completed the restoration of the final two of the six presses damaged in the fire at the end of the third quarter of fiscal 2021. The restoration of the building structure was completed as of September 30, 2021.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\nHaving finalized the claim with its insurance carrier, cash proceeds of $4,548 were received in fiscal 2021. As noted in the table below, $3,001 was recognized within the consolidated statements of operations. The Company has business interruption insurance coverage, of which $546 of the amount received was reflected within the cost of goods line within the consolidated statement of operations.\nBalance sheet (Other receivables):\nSeptember 30, 2020 $ 1,547\nCash received (4,548)\nCapital expenditures (equipment) 2,397\nOther expenses 58\nBusiness interruption 546\nSeptember 30, 2021 $ -\nThe following table reflects how the proceeds received impacted the consolidated statements of operations as of September 30, 2021:\nYear Ended\nSeptember 30, 2021\nBalance without insurance proceeds Insurance recoveries Balance with insurance proceeds\nCost of goods sold $ 88,990 $ (604) $ 88,386\nGain on insurance recoveries $ - $ (2,397) $ (2,397)\n(Loss) before income tax benefit $ (4,966) $ (3,001) $ (1,965)\nThe following table demonstrates the total settlement amount since December 26, 2018:\nTotal Claim\nProperty & damage ** $ 20,364\nExtra expense & mitigation expense 4,404\nBusiness interruption 2,932\n$ 27,700\n**$3,640 of total was directed to the landlord of the property for the restoration of the building in response to the fire damage that occurred in 2018 as prescribed by the lease arrangement.\n12. Business Information\nThe Company identifies itself as one reportable segment, SIFCO, which is a manufacturer of forgings and machined components for the A&E markets.\nGeographic net sales are based on location of customer. The United States of America is the single largest country for unaffiliated customer sales, accounting for 72% and 66% of consolidated net sales in fiscal 2022 and 2021, respectively. No other single country represents greater than 10% of consolidated net sales in fiscal 2022 and 2021. Net sales to unaffiliated customers located in various European countries accounted for 19% and 18% of consolidated net sales in fiscal 2022 and 2021, respectively. Net sales to unaffiliated customers located in various Asian countries accounted for 6% and 8% of consolidated net sales in fiscal 2022 and 2021, respectively.\nSubstantially all of the Company's operations and identifiable assets are located within the United States with the exception of its non-U.S. subsidiary located in Maniago, Italy. The identifiable assets for the Company's foreign subsidiaries as of September 30, 2022 were $15,219 compared with $19,586 as of September 30, 2021.\nSIFCO Industries, Inc. and Subsidiaries\nNotes to Consolidated Financial Statements - (Continued)\n2022 2021\nLong-Lived Assets\nUnited States $ 51,801 54,109\nEurope 6,686 8,986\n$ 58,487 63,095\nAt September 30, 2022, approximately 179 of the hourly plant personnel are represented by three separate collective bargaining agreements. The table below shows the expiration dates of the collective bargaining agreements.\nPlant locations Expiration date\nCleveland, Ohio (unit 1) May 15, 2025\nCleveland, Ohio (unit 2) March 31, 2025\nManiago, Italy June 30, 2024\nThe Company is a party to collective bargaining agreements (\"CBA\") with certain employees located in Cleveland, which has two bargaining units. The Company's Cleveland bargaining unit 1 ratified its CBA in fiscal 2020. The second bargaining unit, under its new representative the International Brotherhood of Boilermakers, was ratified in fiscal 2022. The Maniago location is party to the National Collective Agreement in Metalworking, which was renewed in February 2021.\n13. Subsequent events\nThe Company is not aware of any other subsequent events which would require recognition or disclosure in the consolidated financial statements.\nSchedule II\nSIFCO Industries, Inc. and Subsidiaries\nValuation and Qualifying Accounts\nYears Ended September 30, 2022 and 2021\n(Amounts in thousands)\nBalance at\nBeginning\nof Period Additions\n(Reductions)\nCharged to\nExpense Additions\n(Reductions)\nCharged to\nOther\nAccounts Deductions Balance at\nEnd of\nPeriod\nYear Ended September 30, 2022\nDeducted from asset accounts\nAllowance for doubtful accounts $ 167 $ (3) $ - $ (53) (a) $ 111\nInventory valuation accounts¹ 3,769 1,983 11 (679) (b) 5,084\nInventory LIFO reserve 9,210 729 - - 9,939\nDeferred tax valuation allowance 4,641 3,360 (284) - 7,717\nAccrual for estimated liability\nWorkers compensation reserve 888 741 - (717) (c) 912\nYear Ended September 30, 2021\nDeducted from asset accounts\nAllowance for doubtful accounts 249 (91) - 9 (a) 167\nInventory valuation accounts¹ 3,676 275 (180) (2) (b) 3,769\nInventory LIFO reserve 8,286 924 - - 9,210\nDeferred tax valuation allowance 5,329 345 (1,033) - 4,641\nAccrual for estimated liability\nWorkers compensation reserve 546 1,241 (53) (846) (c) 888\n¹Inventory valuation accounts, previously Inventory obsolescence reserve, reflect the impact of excess and obsolete and net realizable value inventory write downs.\n(a) Accounts determined to be uncollectible, net of recoveries\n(b) Inventory sold or otherwise disposed\n(c) Payment of workers compensation claims Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nAs required by Rule 13a-15(b) of the Securities Exchange Act of 1934 (the Exchange Act), the Companys management, including the Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining effective disclosure controls and procedures as defined in Exchange Act Rule 13a-15(e). Our disclosure controls and procedures are designed to ensure that information required to be disclosed in the Companys SEC reports was recorded, processed, summarized, and reported within the time periods specified in Securities and Exchange Commission rules and forms and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nThe Company's internal control over financial reporting may not prevent or detect misstatements because of its inherent limitations, including the possibility of human error, the circumvention or overriding of controls, or fraud. Our disclosure controls and procedures and internal control over financial reporting are designed to provide reasonable assurance of achieving the desired control objectives. Our management recognizes that any control system, no matter how well designed and operated,\nis based upon certain judgments and assumptions and cannot provide absolute assurance that its objectives will be met. Similarly, an evaluation of controls cannot provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, have been detected. If the Company fails to maintain the adequacy of its internal controls, including any failure to implement required new or improved controls, or if the Company experiences difficulties in their implementation, the Company's business and financial results could be harmed, and the Company could fail to meet its financial reporting obligations.\nManagements Report on Internal Control over Financial Reporting\nManagement, including our Chief Executive Officer and Chief Financial Officer, assessed the effectiveness of our internal control over financial reporting as of September 30, 2022. In making this assessment, our management used the criteria for effective internal control over financial reporting described in the 2013 Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management has determined that due to the material weakness described below, our internal control over financial reporting was not effective as of September 30, 2022. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. Notwithstanding the identified material weakness described below, management does not believe that these deficiencies had an adverse effect on our reported operating results or financial condition and management has determined that the financial statements and other information included in this report and other periodic filings present fairly in all material respects our financial condition, results of operations and cash flows at and for the periods presented in accordance with accounting principles generally accepted in the United States (\"GAAP\").\nThe Company identified the following material weakness:\nLack of precise review controls associated with the valuation of inventory at the Orange location and long-lived asset impairment triggering event indicators in the fourth quarter at the Orange location\nRemediation Plan for Material Weakness in Internal Control over Financial Reporting\nManagement and the Company's Board of Directors are committed to improving the Company's overall system of internal controls over financial reporting.\nTo address the material weakness identified in our control environment, the Company is taking the following actions to remediate the material weakness:\nUsing a risk-based approach, management will implement additional monitoring controls through increased oversight and training local management to execute additional controls in detecting material errors.\nWith the oversight of senior management and the Company's Board of Directors, the Company continues to take steps and additional measures to remediate the underlying causes of the identified material weakness, including but not limited to continuing to strengthen organizational structure including holding individuals accountable for their internal control responsibilities.\nAlthough we expect to make meaningful progress on our remediation plan during fiscal year 2023, we cannot estimate how long it will take to complete the process or the costs of actions required. There is no assurance that the aforementioned plans will be sufficient and that additional steps may not be necessary.\nChanges in Internal Control over Financial Reporting and other Remediation\nAs of September 30, 2022, no material changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) occurred during the Company's most recent fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nInformation about the Executive Officers of the Company appears in Part I of this Report.\nThe Company incorporates herein by reference the information required by this Item as to the Directors, procedures for recommending Director nominees and the Audit Committee appearing under the captions Proposal 1 - To Elect Six (6) Directors, and Corporate Governance and Board of Director Matters of the Companys definitive Proxy Statement to be filed with the SEC on or about December 22, 2022.\nThe Directors of the Company are elected annually to serve for one-year terms or until their successors are elected and qualified.\nThe Company has adopted a Code of Ethics within the meaning of Item 406(b) of Regulation S-K under the Securities Exchange Act of 1934, as amended. The Code of Ethics is applicable to, among other people, the Companys Chief Executive Officer, Chief Financial Officer, who is the Companys Principal Financial Officer, and Principal Accounting Officer. The Companys Code of Ethics (including any amendments to, or related waivers from, the Code of Ethics) is available on its website: www.sifco.com. Item 11. Executive Compensation\nThe Company incorporates herein by reference the information appearing under the captions \"Executive Compensation\" and \"Director Compensation\" of the Companys definitive Proxy Statement to be filed with the SEC on or about December 22, 2022. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth information regarding Common Shares to be issued under the Companys equity compensation plans as of September 30, 2022.\nPlan category Number of\nsecurities to\nbe issued\nupon\nexercise of\noutstanding\noptions, warrants and rights Weighted-\naverage\nexercise\nprice of\noutstanding\noptions, warrants and rights Number of\nsecurities\nremaining\navailable for\nfuture\nissuance\nunder equity\ncompensation\nplans\nEquity compensation plans approved by security holders:\n2016 Plan (1) 305,450 N/A 472,806\n(1)Under the 2016 Plan, the aggregate number of common shares that are available to be granted is 1,196,401 shares, with a further limit of no more than 50,000 shares to any one person in any twelve-month period. For additional information concerning the Companys equity compensation plans, refer to the discussion in Note 9, Stock-Based Compensation, of the consolidated financial statements. These securities are issued under time based vesting for retention and/or upon meeting performance objectives.\nThe Company incorporates herein by reference the beneficial ownership information appearing under the captions \"Stock Ownership of Certain Beneficial Owners\" and \"Stock Ownership of Executive Officers, Director and Nominees\" of the Companys definitive Proxy Statement to be filed with the SEC on or about December 22, 2022. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe Company incorporates herein by reference the information required by this item appearing under the captions \"Corporate Governance and Board of Director Matters\" of the Companys definitive Proxy Statement to be filed with the SEC on or about December 22, 2022. Item 14. Principal Accounting Fees and Services\nThe Company incorporates herein by reference the information required by this item appearing under the caption \"Principal Accounting Fees and Services\" of the Companys definitive Proxy Statement to be filed with the SEC on or about December 22, 2022.\nPart IV Item 15. Exhibits, Financial Statement Schedules\n(a) (1) Financial Statements:\nThe following Consolidated Financial Statements; Notes to the Consolidated Financial Statements and the Report of Independent Registered Public Accounting Firm are included in Part II, Item 8 of the Annual Report on Form 10-K.\n(a) (2) Financial Statement Schedules:\nThe following financial statement schedule is included in Item 8:\nSchedule II - Valuation and Qualifying Accounts\nAll other schedules for which provision is made in the applicable accounting regulations of the Securities and Exchange Commission are not required under the related regulations, are inapplicable, or the information has been included in the Notes to the Consolidated Financial Statements.\n(a) (3) Exhibits:\nThe following exhibits are filed with this report or are incorporated herein by reference to a prior filing in accordance with Rule 12b-32 under the Securities and Exchange Act of 1934. (Asterisk denotes exhibits filed with this report)\n*Filed herewith.\n**Management contract or compensatory plan or arrangement.\nExhibit\nNo.\nDescription\n2.1 Stock Purchase Agreement between Riello Investimenti Partners SGR S.p.A., Giorgio Visentini, Giorgio Frassini, Giancarlo Sclabi and Matteo Talmassons and SIFCO Italy Holdings S.R.L (a wholly-owned subsidiary of SIFCO Industries Inc.) dated March 16, 2015 filed as Exhibit 2.1 to the Companys Form 8-K dated July 2, 2015, and incorporated herein by reference\n2.2 Amendment to the Stock Purchase Agreement Riello Investimenti Partners SGR S.p.A., Giorgio Visentini, Giorgio Frassini, Giancarlo Sclabi and Matteo Talmassons and SIFCO Italy Holdings S.R.L (a wholly-owned subsidiary of SIFCO Industries Inc.) dated June 30, 2015 filed as Exhibit 2.2 to the Companys Form 8-K dated July 2, 2015, and incorporated herein by reference\n3.1 Third Amended Articles of Incorporation of SIFCO Industries, Inc., filed as Exhibit 3(a) of the Companys Form 10-Q dated March 31, 2002, and incorporated herein by reference\n3.2 SIFCO Industries, Inc. Amended and Restated Code of Regulations dated January 28, 2016, filed as Exhibit 3.2 of the Companys Form 10-K dated September 30, 2015, and incorporated herein by reference\n*4.1 Description of securities.\n9.1 Voting Trust Agreement dated January 31, 2013, filed as Exhibit 9.1 to the Companys Form 10-Q dated February 11, 2013 and incorporated herein by reference\n9.2 Voting Trust Extension Agreement dated January 15, 2015, filed as Exhibit 9.2 to the Company's Form 10-Q dated February 3, 2015 and incorporated herein by reference\n9.3 Voting Trust Agreement dated January 31, 2017, filed as Exhibit 9.3 to the Company's Form 10-Q dated December 31, 2016 and incorporated herein by reference\n9.4 Voting Trust Extension Agreement dated January 18, 2019, filed as Exhibit 9.4 to the Company's Form 10-Q dated February 14, 2019, and incorporated herein by reference\n9.5 Voting Trust Extension Agreement dated January 27, 2021, filed as Exhibit 9.5 to the Company's Form 10-Q dated February 5, 2021, and incorporated herein by reference\n10.1** SIFCO Industries, Inc. 2007 Long-Term Incentive Plan, filed as Exhibit A of the Companys Proxy and Notice of 2008 Annual Meeting to Shareholders dated December 14, 2007, and incorporated herein by reference\n10.2** Letter Agreement between the Company and Jeffrey P. Gotschall, dated August 12, 2009 filed as Exhibit 10.1 of the Companys Form 8-K dated August 12, 2009 and incorporated herein by reference\n10.3** Amendment No. 1 to the SIFCO Industries, Inc. 2007 Long-Term Incentive Plan, filed as Exhibit A of the Companys Proxy and Notice of 2011 Annual Meeting to Shareholders dated December 15, 2010, and incorporated herein by reference\n10.4** Change in control Agreement and Separation Agreement between the Company and Peter W. Knapper, effective June 29, 2022, filed as Exhibit 10.1 to the Company's Form 8-K dated June 29, 2022 and incorporated herein by reference.\n10.5** Form of SIFCO Industries, Inc. Long-term incentive plan performance share award, filed as Exhibit 10.6 to the Company's Form 10-Q dated May 16, 2016, and incorporated herein by reference\n10.6** Form of SIFCO Industries, Inc. Long-term incentive plan restricted share award, filed as Exhibit 10.7 to the Company's Form 10-Q dated May 16, 2016, and incorporated herein by reference\n10.7 Credit Agreement, dated August 8, 2018, by and among SIFCO Industries, Inc. and Lender named therein and J.P. Morgan Chase Bank, N.A., filed as Exhibit 10.12 to the Company's Form 10-Q dated August 9, 2018, and incorporated herein by reference\n10.8** Amendment and Restatement to the SIFCO Industries, Inc. 2007 Long-Term Incentive Plan, filed as Exhibit A of the Companys Proxy and Notice of 2017 Annual Meeting to Shareholders dated December 6, 2016, and incorporated herein by reference\n10.9** Form of SIFCO Industries, Inc. Long-term incentive plan performance share award, filed as Exhibit 10.14 to the Company's Form 10-Q dated January 31, 2017, and incorporated herein by reference\n10.10** Form of SIFCO Industries, Inc. Long-term incentive plan restricted share award, filed as Exhibit 10.15 to the Company's Form 10-Q dated January 31, 2017, and incorporated herein by reference\n10.11** Form of SIFCO Industries, Inc. Long-term incentive plan restricted share award, filed as Exhibit 10.16 to the Company's Form 10-Q dated January 31, 2017, and incorporated herein by reference\n10.12** Change in Control Agreement and Separation Agreement between the Company and Thomas R. Kubera, effective June 29, 2019, filed as Exhibit 10.2 to the Company's Form 10-Q dated July 1, 2019, and incorporated herein by reference\n10.13 First Amendment to Credit Agreement, dated November 5, 2018, by and among SIFCO Industries, Inc., T & W Forge, LLC, Quality Aluminum Forge, LLC, and JPMorgan Chase Bank, N.A., a national banking association, filed as Exhibit 10.1 to the Company's Form 8-K dated November 8, 2018, and incorporated herein by reference\n10.14 Economic Development Administration Title IX Loan Agreement, dated November 8, 2018, by and between the City of Cleveland and SIFCO Industries, Inc., filed as exhibit 10.2 to the Company's Form 8-K dated November 8, 2018, and incorporated herein by reference\n10.15 Second Amendment to Credit Agreement, dated December 17, 2018, by and among SIFCO Industries, Inc., T&W Forge, LLC., Quality Aluminum Forge, LLC., and JPMorgan Chase Bank, N.A., a national banking association, filed as exhibit 10.2 to the Company's Form 8-K dated December 19, 2018, and incorporated herein by reference\n10.16 Export Credit Agreement, dated December 17, 2018, by and among SIFCO Industries, Inc., T & W Forge, LLC, Quality Aluminum Forge, LLC, and JPMorgan Chase Bank, N.A., a national banking association filed as Exhibit 10.1 to the Company's Form 8-K dated December 19, 2018 and incorporated herein by reference\n10.17 Third Amendment to Credit Agreement, dated March 29, 2019, by and among SIFCO Industries, Inc., Quality Aluminum Forge, LLC., and JPMorgan Chase Bank, N.A., a national banking association, filed as exhibit 10.19 to the Company's Form 10-Q dated May 10, 2019\n10.18 Fourth Amendment to Credit Agreement, dated March 29, 2019, by and among SIFCO Industries, Inc., Quality Aluminum Forge, LLC., and JPMorgan Chase Bank, N.A., a national banking association, filed as exhibit 10.1 to the Company's Form 8-K dated September 24, 2019\n10.19 First Amendment to the SIFCO Industries, Inc. 2007 Long-term Incentive Plan (Amended and Restated as of November 16, 2016) filed as Exhibit A of the Company's Definitive Proxy Statement dated December 16, 2019, and incorporated herein by reference\n10.20 Promissory Note, dated April 10, 2020, by and between SIFCO Industries, Inc. and JPMorgan Chase Bank, N.A., a national banking association, filed as exhibit 10.1 to the Company's Form 8-K dated April 13, 2020, and incorporated herein by reference\n10.21** Form of SIFCO Industries, Inc. Long-term incentive plan restricted share award, filed as Exhibit 10.21 to the Company's Form 10-K dated December 23, 2020, and incorporated herein by reference\n10.22 Fifth Amendment to the Credit Agreement, dated February 19, 2021, by and among SIFCO Industries, Inc., Quality Aluminum Forge, LLC., and JPMorgan Chase Bank, N.A., a national banking association, filed as exhibit 10.1 to the Company's Form 8-K dated February 22, 2021, and incorporated herein by reference.\n10.23 First Amendment to the Export Credit Agreement, dated February 19, 2021, by and among SIFCO Industries, Inc., Quality Aluminum Forge, LLC., and JPMorgan Chase Bank, N.A., a national banking association, filed as exhibit 10.2 to the Company's Form 8-K dated February 22, 2021, and incorporated herein by reference.\n10.24 Sixth Amendment to the Credit Agreement, dated March 23, 2022, by and among SIFCO Industries, Inc., Quality Aluminum Forge, LLC, and JPMorgan Chase Bank, N.A., a national banking association filed as Exhibit 10.1 to the Company's Form 8-K dated March 24, 2022, and incorporated herein by reference\n10.25 Second Amendment to the Export Credit Agreement, dated March 23, 2022, by and among SIFCO Industries, Inc., Quality Aluminum Forge, LLC, and JPMorgan Chase Bank, N.A., a national banking association filed as Exhibit 10.2 to the Company's Form 8-K dated March 24, 2022, and incorporated herein by reference\n14.1 Code of Ethics, filed as Exhibit 14.1 of the Companys Form 8-K dated February 6, 2018, and incorporated herein by reference\n*21.1 Subsidiaries of Company\n*23.1 Consent of Independent Registered Public Accounting Firm\n*31.1 Certification of Chief Executive Officer pursuant to Rule 13a-14(a) / 15d-14(a)\n*31.2 Certification of Chief Financial Officer pursuant to Rule 13a-14(a) / 15d-14(a)\n*32.1 Certification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350\n*32.2 Certification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350\n*101 The following financial information from SIFCO Industries, Inc. Report on Form 10-K for the year ended September 30, 2022 filed with the SEC on December 22, 2022, formatted in XBRL includes: (i) Consolidated Statements of Operations for the years ended September 30, 2022 and 2021, (ii) Consolidated Statements of Comprehensive Income for the years ended September 30, 2022 and 2021, (iii) Consolidated Balance Sheets at September 30, 2022 and 2021, (iv) Consolidated Statements of Cash Flow for the years ended September 30, 2022 and 2021, (vi) Consolidated Statements of Shareholders Equity for the years ended September 30, 2022 and 2021 and (v) the Notes to the Consolidated Financial Statements.\n*104 Cover Page Interactive Data File: the cover page XBRL tags are embedded within the Inline XBRL document and are contained with Exhibit 101\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSIFCO Industries, Inc.\nBy: /s/ Thomas R. Kubera\nThomas R. Kubera\nChief Financial Officer\n(Principal Financial Officer)\nDate: December 22, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below on December 22, 2022 by the following persons on behalf of the Registrant in the capacities indicated.\n/s/ Norman E. Wells, Jr. /s/ Peter W. Knapper\nNorman E. Wells, Jr. Peter W. Knapper\nChairman of the Board President and Chief Executive Officer\n(Principal Executive Officer)\n/s/ Jeffrey P. Gotschall /s/ Donald C. Molten, Jr.\nJeffrey P. Gotschall Donald C. Molten, Jr.\nDirector Director\n/s/ Alayne L. Reitman /s/ Mark J. Silk\nAlayne L. Reitman Mark J. Silk\nDirector Director\n/s/ Hudson D. Smith /s/ Thomas R. Kubera\nHudson D. Smith Thomas R. Kubera\nDirector Chief Financial Officer\n(Principal Financial Officer)"
}