{
    "cik": "915840",
    "company": "BEAZER HOMES USA INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-16",
    "period_of_report": "2023-09-30",
    "sic": "1531",
    "state_of_inc": "DE",
    "state_location": "GA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/915840/0000915840-23-000053-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/915840/000091584023000053/bzh-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/915840/0000915840-23-000053.txt",
    "filename": "915840_10K_2023_0000915840-23-000053.htm",
    "content": "Item 1. Business\nWe are a geographically diversified homebuilder with active operations in 13 states within three geographic regions in the United States: the West, East, and Southeast. Our homes are designed to appeal to homeowners at different price points across various demographic segments and are generally offered for sale in advance of their construction. Our objective is to provide our customers with homes that incorporate extraordinary value and quality, at affordable prices, while seeking to maximize our investment returns over the course of a housing cycle.\nBeazer Homes USA, Inc. was incorporated in Delaware in 1993. Our principal executive offices are located at 2002 Summit Blvd NE, 15th Floor, Atlanta, GA 30319, and our main telephone number is (770) 829-3700. We also provide information about our company, including active communities, through our Internet website located at www.beazer.com. Information on our website is not a part of this Form 10-K and shall not be deemed incorporated by reference.\nLong-Term Business Strategy\nWe continue to execute against our long-term balanced growth strategy, which we define as the expansion of earnings at a faster rate than our revenue growth, supported by a less-leveraged and return-driven capital structure. This strategy provides us with the flexibility to reduce leverage through debt reduction, increase return of capital to investors through stock repurchases, or increase investment in land and other operating assets in response to changing market conditions.\nWe remain committed to this balanced growth strategy, which is designed to increase shareholder value by improving our return on assets while reducing operational risk and debt. For fiscal 2024, we are working towards three multi-year strategic goals as part of our balanced growth strategy:\nreaching more than 200 active communities by the end of fiscal 2026,\nreducing our net debt to net capitalization ratio to below 30% by the end of fiscal 2026, and\nfulfilling our commitment that by the end of the calendar year 2025 every home we start will be Zero Energy Ready, which is discussed further below.\nDifferentiating Beazer Homes\nWe know that our buyers have many choices when purchasing a home. To help us become a builder of choice, we have identified the following three strategic pillars that differentiate Beazer's homes from both resale homes and other newly built homes:\nMortgage Choice - Most of our buyers need to arrange financing in order to purchase a new home. Unlike many of our major competitors, we have no ownership or other interest in a mortgage company, which allows us to partner with our customers to help them get the most competitive interest rates, fees and service levels available. For every Beazer community, we identify Choice Lenders, who are selected for their ability to provide a comprehensive array of products and programs, meet our high customer service standards, and their willingness to compete to earn our customers business. We then provide our customers with an industry-leading online comparison tool that helps them easily compare multiple mortgage offers from Choice Lenders and other lenders side-by-side.\nChoice Plans® - Every family lives in their home differently, which is why we created Choice Plans. Choice Plans provide our buyers with more floor plan flexibility at no additional cost. For example, buyers of to-be-built homes can typically choose between two different configurations in the kitchen/great room and in the primary bedroom/bathroom. Offering these pre-designed floor plan alternatives allows us to offer fewer plans, which improves efficiency and reduces cost while creating living areas that match an individual buyer's lifestyle.\nSurprising Performance - We place an emphasis on building high-quality homes and delivering outstanding customer experience. Our team is hyper-focused on including premium materials and high-caliber construction processes designed to increase performance and efficiency. All Beazer homes are designed and built to provide Surprising Performance, which means more quality, comfort, and savings. We deliver these benefits through our people, materials, and process. Some examples of these benefits are as follows:\nOur homes are built to the latest ENERGY STAR® standards, and we provide buyers with an energy rating (HERS® index score) for their home, completed by a qualified third-party rating company. According to the Residential Energy Services Network (RESNET), the developer of the HERS® index, used homes typically have a HERS® index score (on a scale in which a lower score is better) of 130, while on average new homes built to energy codes have a weighted national HERS score equivalent of 73. For the year ended September 30, 2023, new Beazer homes had an average HERS® index score of 49.\nBeazer is the first national builder to publicly commit to ensuring that by the end of 2025 every home we start will be Zero Energy Ready, which means that every home will meet the requirement of the U.S. Department of Energys Zero Energy Ready Home program and have a HERS® index score (before any benefit of renewable energy production) of 45 or less. With a Zero Energy Ready home, net zero energy consumption can be achieved if a properly sized renewable energy system is attached.\nWe also build Indoor airPLUS qualified homes under the EPA Indoor airPLUS program, which include features to reduce contaminants that lead to poor indoor air quality such as mold, moisture, carbon monoxide, toxic chemicals and more.\nReportable Business Segments\nOur active homebuilding operations consist of the design, sale, and construction of single-family and multi-family homes in the following geographic regions, which represent our reportable segments:\nSegment/State Market(s)\nWest:\nArizona Phoenix\nCalifornia Placer County, Riverside County, Sacramento County, San Diego County, San Bernadino County, Tulare County\nNevada Las Vegas\nTexas Dallas/Ft. Worth, Houston, San Antonio\nEast:\nIndiana Indianapolis\nMaryland/Delaware Anne Arundel County, Baltimore County, Howard County, Sussex County\nTennessee Nashville\nVirginia Fairfax County, Loudoun County, Prince William County, Stafford County\nSoutheast:\nFlorida Orlando\nGeorgia Atlanta\nNorth Carolina Raleigh/Durham\nSouth Carolina Charleston, Myrtle Beach\nMarkets and Product Description\nWe evaluate a number of factors in determining which geographic markets to enter and remain in as well as which consumer segments to target with our homebuilding activities. We compete in the above listed geographic markets across the United States in part to reduce our exposure to any particular regional economy. Within these markets, we build homes in a variety of new home communities. We continually review our markets based on aggregate demographic information, land prices and availability, competitive dynamics, and our own operating results. We use the results of these reviews to re-allocate our investments generally to those markets where we believe we can maximize our profitability and return on capital.\nWe maintain the flexibility to alter our product mix within a given market, depending on market conditions. In determining our product mix, we consider demographic trends, demand for a particular type of product, product affordability, consumer preferences, land availability, margins, timing, and the economic strength of the market. Depending on the market, we attempt to address one or more of the following categories of home buyers: entry-level, move-up, or 55+. Within these buyer groups, we have developed detailed targeted buyer profiles based on demographic and psychographic data, including information about marital and family status, employment, age, affluence, special interests, media consumption, and distance moved. Although we offer a selection of amenities and home customization options, we generally do not build custom homes. In all of our home offerings, we attempt to increase customer satisfaction by incorporating quality and energy-efficient materials, distinctive design features, convenient locations, and competitive prices.\nGatherings - In 2016, Gatherings® by Beazer Homes was officially introduced across several markets within Beazer's geographic footprint through age restricted condominiums. We strive to provide extraordinary value, a strong commitment to customer service, and a quality, lower-maintenance home for those seeking to live in 55+ active adult communities. In addition to condominiums, the Gatherings® brand also includes town homes, villas, duets, and single-family homes. As of September 30, 2023, we have approved communities representing 854 potential future sales.\nMarketing and Sales\nWe make extensive use of digital and traditional marketing vehicles and other promotional activities, including our website (www.beazer.com), real estate listing sites, digital advertising (including search engine marketing and display advertising), social media, video, brochures, direct marketing, and out-of-home advertising (including billboards and signage) located in the immediate areas of our developments, as well as additional activities. In connection with these marketing vehicles, we have registered or applied for registration of trademarks and Internet domain names, including Beazer Homes®, Gatherings®, and Choice Plans®, for use in our business.\nIn response to the changing needs of consumers, our sales operations continue to improve our virtual sales tools to connect with our customers online, including a 24/7 chatbot feature, self-guided tours to allow homebuyers to tour models privately and safely, outside of normal business hours, and self-service appointments to help customers schedule an appointment with ease and speed.\nOur practice is to build, decorate, furnish, and landscape model homes for each community we build and maintain on-site sales offices. As of September 30, 2023, we maintained and owned 242 model homes. We believe that model homes play a particularly important role in our selling efforts, and we are continuously innovating within our model homes to provide a unique, memorable, and hands-on experience, including digital kiosks, interactive site maps/plans, interactive magnetic floor plan boards, interactive cutaway homes, interactive Surprising Performance rooms, signage, and more. The selection of interior features is also a principal component of our marketing and sales efforts.\nOur homes are customarily sold through commissioned new home sales counselors (who work from sales offices located in the model homes used in the community) as well as through independent brokers. Our new home counselors are available to assist prospective homebuyers by providing them with floor plans, pricing information, tours of model homes, the community's unique selling proposition, detailed explanations of our differentiators as discussed above, and associated savings opportunities. Sales personnel are trained internally through a structured training program focused on sales techniques, product familiarity, competitive products in the area, construction schedules, and Company policies around compliance, which management believes results in a sales force with extensive knowledge of our operating policies and housing products. Sales personnel must be licensed real estate agents where required by law.\nWe sometimes use various sales incentives in order to attract homebuyers. The use of incentives depends largely on local economic and competitive market conditions.\nDepending on market conditions, we also at times begin construction on a number of homes for which no signed sales contract exists, known as speculative or spec homes. This speculative inventory satisfies demand by providing near ready or move-in ready homes targeted at relocated personnel and others who require a completed home within a shorter timeframe.\nOperational Overview\nCorporate Operations\nWe perform the following functions at our corporate office to promote standardization and operational excellence:\nevaluate and select geographic markets;\nallocate capital resources for land acquisitions;\nmaintain and develop relationships with lenders and capital markets to create and maintain access to financial resources;\nmaintain and develop relationships with national product vendors;\nperform various centralized functions including accounting, finance, purchasing, legal, risk, planning/design, and marketing activities to support our field operations;\noperate and manage information systems and technology support operations; and\nmonitor the operations of our divisions and trade partners.\nWe allocate capital resources in a manner consistent with our overall business strategy. We will vary our capital allocation based on market conditions, results of operations, and other factors. Capital commitments are determined through consultation among executive and operational personnel who play an important role in ensuring that new investments are consistent with our strategy. Financial controls are also maintained through the centralization and standardization of accounting and finance activities, policies, and procedures.\nField Operations\nThe development and construction of each of our communities is managed by our operating divisions, each of which is led by a regional market leader and/or an area president who reports to our Chief Executive Officer. Within our operating divisions, our field teams are equipped with the skills needed to complete the functions of land acquisition, land entitlement, land development, home construction, local marketing, sales, warranty service, and certain purchasing and planning/design functions. However, the accounting and accounts payable functions of our field operations are concentrated in our national accounting center, which we consider to be part of our corporate operations.\nLand Acquisition and Development\nGenerally, the land we acquire is purchased only after necessary entitlements have been obtained so that we have the right to begin development or construction as market conditions dictate. The term entitlements refers to subdivision approvals, development agreements, tentative maps, or recorded plats, depending on the jurisdiction in which the land is located. Entitlements generally give a developer the right to obtain building permits upon compliance with conditions that are usually within the developer's control. Although entitlements are ordinarily obtained prior to the purchase of land, we are still required to obtain a variety of other governmental approvals and permits during the development process. In limited circumstances, we will purchase property without all necessary entitlements where we have identified an opportunity to build on such property in a manner consistent with our strategy.\nWe select land for purchase based upon a variety of factors, including but not limited to:\ninternal and external demographic and marketing studies;\nsuitability for development during the time period of generally one to five years from the beginning of the development process to the last closing;\nfinancial review as to the feasibility of the proposed project, including profit margins and returns on capital employed;\nthe ability to secure governmental approvals and entitlements;\nenvironmental and legal due diligence;\ncompetition in the area;\nproximity to local traffic corridors, job centers, and other amenities; and\nmanagement's judgment of the real estate market and economic trends and our experience in a particular market.\nWe generally purchase land or obtain an option to purchase land, which, in either case, requires certain site improvements prior to home construction. Where required, we then undertake, or the grantor of the option then undertakes in the case of land under option, the development activities (through contractual arrangements with local developers, general contractors, and/or subcontractors), which include site planning and engineering as well as constructing roads, water, sewer, and utility infrastructures, drainage and recreational facilities, and other amenities. In some transactions, land bankers take title to the land at closing subject to agreements which obligate us to perform all development activities (which may be reimbursed by the land bankers) with respect to the land and provide us with an option to purchase the finished lots. When available in certain markets, we also buy finished lots that are ready for home construction. During our fiscal 2023 and 2022, we continued to pursue land\nacquisition opportunities and develop our land positions, spending $384.2 million and $418.5 million, respectively, for land acquisition and $188.8 million and $155.1 million, respectively, for land development.\nOption Agreements\nWe acquire certain lots by means of option agreements from various sellers and developers, including land banking entities. Option agreements generally require the payment of a cash deposit or issuance of a letter of credit or surety bond for the right to acquire lots during a specified period of time at a specified price.\nUnder option agreements, purchase of the underlying properties is contingent upon satisfaction of certain requirements by us and the sellers. Our liability under option agreements is generally limited to forfeiture of the non-refundable deposits, letters of credit or surety bonds, and other non-refundable amounts incurred, which totaled $165.4 million as of September 30, 2023. The total remaining purchase price, net of cash deposits, committed under all land option agreements was $949.4 million as of September 30, 2023.\nWe expect to exercise, subject to market conditions and seller satisfaction of contract terms, substantially all of our option agreements. Various factors, some of which are beyond our control, such as market conditions, weather conditions, and the timing of the completion of development activities, will have a significant impact on the timing of option exercises or whether lot options will be exercised at all.\nThe following table summarizes land controlled by us by reportable segment as of September 30, 2023:\nLots Owned\nLots with Homes Under Construction (a)\nFinished Lots Lots Under Development Lots Held for Future Development Lots Held for Sale Total Lots Owned Total Lots Under Contract Total Lots Controlled\nWest\nArizona 95 240 223 - - 558 366 924\nCalifornia 294 178 380 - 15 867 837 1,704\nNevada 208 360 180 66 - 814 455 1,269\nTexas 877 1,242 1,596 - 297 4,012 6,575 10,587\nTotal West 1,474 2,020 2,379 66 312 6,251 8,233 14,484\nEast\nIndiana 79 180 131 - - 390 989 1,379\nMaryland/Delaware 127 273 409 - 4 813 907 1,720\nNew Jersey - - - 117 - 117 - 117\nTennessee 156 133 477 - - 766 1,102 1,868\nVirginia 93 80 - - - 173 238 411\nTotal East 455 666 1,017 117 4 2,259 3,236 5,495\nSoutheast\nFlorida 172 91 273 - - 536 1,277 1,813\nGeorgia 110 135 338 - - 583 941 1,524\nNorth Carolina 43 33 580 21 - 677 134 811\nSouth Carolina 151 278 862 68 34 1,393 669 2,062\nTotal Southeast 476 537 2,053 89 34 3,189 3,021 6,210\nTotal 2,405 3,223 5,449 272 350 11,699 14,490 26,189\n(a) This category represents lots upon which construction of a home has commenced, including model homes.\nThe following table summarizes the dollar value of our land under development, land held for future development, and land\nheld for sale by reportable segment as of September 30, 2023:\nin thousands Land Under Development Land Held for Future Development Land Held for Sale\nWest $ 507,784 $ 3,483 $ 14,702\nEast 192,683 10,888 3,201\nSoutheast 170,273 5,508 676\nTotal $ 870,740 $ 19,879 $ 18,579\nBacklog\nBacklog reflects the number of homes for which the Company has entered into a sales contract with a customer but has not yet delivered the home. Ending backlog represents the number of homes in backlog from the previous period plus the number of net new orders (new orders less cancellations) generated during the current period minus the number of homes closed during the current period.\nThe following table summarizes units and dollar value in backlog by reportable segment as of September 30, 2023, 2022 and 2021. Refer to Management's Discussion and Analysis of Results of Operations and Financial Condition in Item 7 of this Form 10-K for additional information.\nAs of September 30,\n2023 2022 2021\nUnits in Backlog Dollar Value in Backlog (in millions) Units in Backlog Dollar Value in Backlog (in millions) Units in Backlog Dollar Value in Backlog (in millions)\nWest 1,033 $ 535.3 1,257 $ 711.6 1,653 $ 736.0\nEast 323 174.7 410 223.7 611 302.0\nSoutheast 355 176.3 424 209.6 522 246.0\nTotal Company 1,711 $ 886.4 2,091 $ 1,144.9 2,786 $ 1,284.0\nASP in backlog (in thousands) $ 518.0 $ 547.5 $ 460.9\nConstruction\nWe typically act as the general contractor for the construction of our new home communities. Our project development activities are controlled by our operating divisions whose employees supervise the construction of each new home community by coordinating the activities of independent subcontractors and suppliers, subjecting their work to quality and cost controls and ensuring compliance with zoning and building codes. We specify that quality and durable materials be used in the construction of our homes. Our subcontractors follow design plans prepared by architects and engineers who are retained or directly employed by us and whose designs are geared to the local market and staying current with changing home design trends as well as expanding our focus on engineering without sacrificing value for our customers.\nAgreements with our subcontractors and materials suppliers are generally entered into after a competitive bidding process during which we obtain information from prospective subcontractors and vendors with respect to their financial condition and ability to perform their agreements with us in accordance with the specifications we provide. Subcontractors typically are retained on a project-by-project basis to complete construction at a fixed price. We do not maintain significant inventories of construction materials, except for materials being utilized for homes under construction. We have numerous suppliers of raw materials and services used in our business. While such materials and services generally have been and continue to be available, from time to time, supply chain disruptions may occur due to material and labor shortages, such as the widespread supply chain disruptions we experienced throughout fiscal 2022. In addition, material prices may fluctuate due to various factors, including demand or supply shortages and the price of certain commodities, which may be beyond the control of us or our vendors. When it is economically advantageous, we enter into regional and national supply contracts with certain of our vendors. We believe that we maintain positive and productive relationships with our suppliers and subcontractors.\nWarranty Program\nWe currently provide a limited warranty ranging from one to two years covering workmanship and materials per our defined standards. In addition, we provide a limited warranty for up to ten years covering only certain defined structural element failures.\nOur homebuilding work is performed by subcontractors who typically must agree to indemnify us with regard to their work and provide certificates of insurance demonstrating that they have met our insurance requirements and have named us as an additional insured under their policies. Therefore, many claims relating to workmanship and materials that result in warranty spending are the primary responsibility of these subcontractors.\nIn addition, we maintain third-party insurance, subject to applicable self-insured retentions, for most construction defects that we encounter in the normal course of business. We believe that our warranty and litigation accruals and third-party insurance are adequate to cover the ultimate resolution of our potential liabilities associated with known and anticipated warranty and construction-defect related claims and litigation. However, there can be no assurance that the terms and limitations of the limited warranty will be effective against claims made by homebuyers; that we will be able to renew our insurance coverage or renew it at reasonable rates; that we will not be liable for damages, the cost of repairs, and/or the expense of litigation surrounding possible construction defects, soil subsidence, or building related claims; or that claims will not arise out of events or circumstances not covered by insurance and/or not subject to effective indemnification agreements with our subcontractors. Please see Note 8 of the notes to the consolidated financial statements in this Form 10-K for additional information.\nCustomer Financing\nAs previously mentioned, we do not provide mortgage origination services. Unlike many of our peers, we have no ownership interest in any lender and are able to promote competition among lenders on behalf of our customers through our Mortgage Choice program. Approximately 88% of our fiscal 2023 customers elected to finance a portion of their home purchase.\nCompetition\nThe development and sale of residential properties is highly competitive and fragmented. We compete for residential sales on the basis of a number of interrelated factors, including location, reputation, amenities, design, quality, and price with numerous large and small homebuilders, including many homebuilders with nationwide operations and greater financial resources and/or lower costs than us. We also compete for residential sales with individual resales of existing homes and available rental housing.\nWe utilize our experience within our geographic markets and the breadth of our product line to vary regional product offerings in response to changing market conditions. We strive to respond to market conditions and to capitalize on the opportunities for advantageous land acquisitions in desirable locations. Our product offerings strive to provide extraordinary value at an affordable price with intentional focus on Millennials and Baby Boomers because they are the two largest demographic groups of potential home buyers.\nSeasonal and Quarterly Variability\nOur homebuilding operating cycle historically has reflected escalating new order activity in the second and third fiscal quarters and increased closings in the third and fourth fiscal quarters. However, these seasonal patterns may be impacted or reduced by a variety of factors, including periods of economic downturn, which may result in decreased revenues and closings.\nGovernment Regulation and Environmental Matters\nWe are subject to a variety of local, state and federal statutes, ordinances, rules and regulations concerning zoning, building, design, constructions, the availability of water, and matters concerning the protection of health, safety and the environment. These laws may result in delays, cause us to incur substantial compliance and other costs, and prohibit or severely restrict development in certain environmentally sensitive regions or areas. Any delay or refusal from government agencies to grant us necessary licenses, permits and approvals could have an adverse effect on our financial condition and results of operations.\nAs part of our due diligence process for land acquisitions, we often use third-party environmental consultants to investigate potential environmental risks, and we require disclosures, representations and warranties from land sellers regarding environmental risks. We also take steps prior to our acquisition of the land to gain reasonable assurance as to the precise scope of any remediation work required and the costs associated with removal, site restoration and/or monitoring. To the extent contamination or other environmental issues have occurred in the past, we will attempt to recover restoration costs from third parties, such as the generators of hazardous waste, land sellers or others in the prior chain of title and/or their insurers.\nIn order to provide homes to homebuyers qualifying for Federal Housing Administration (FHA)-insured or Veterans Affairs (VA)-guaranteed mortgages, we must construct homes in compliance with FHA and VA regulations. These laws and regulations include provisions regarding operating procedures, investments, lending, and privacy disclosures and premiums.\nIn some states, we are required to be registered as a licensed contractor and comply with applicable rules and regulations. Also, in various states, our new home counselors are required to be licensed real estate agents and to comply with the laws and regulations applicable to real estate agents.\nFailure to comply with any of these laws or regulations, where applicable, could result in loss of licensing and a restriction of our business activities in the applicable jurisdiction.\nHuman Capital Resources\nAs of September 30, 2023, we employed 1,067 persons, of whom 277 were sales and marketing personnel and 240 were construction personnel. Although none of our employees are covered by collective bargaining agreements, at times certain of the independent subcontractors engaged by us may be represented by labor unions or may be subject to collective bargaining arrangements.\nA safe and healthy working environment for our employees at every level of our organization is our highest priority. This begins with our health and safety audit system, which is designed to assist our employees in locating resources tailored for their specific employment responsibilities. We also conduct various safety-related inspections and training programs, such as daily visual inspections of our job sites, weekly written safety inspections and bi-weekly toolbox talks with our trade partners. We have also increased our focus on employee wellness by expanding our program options to include a number of webinars, online classes, and virtual support groups.\nWe believe that our employees are critical to our continued growth and success, and competition for qualified personnel is intense across our footprint. To remain competitive, we continue to focus on attracting and retaining qualified employees and providing them with comprehensive training and continuous development. In addition, we center our employee experience on engagement and work-life balance by offering a broad range of company-paid benefits and compensation packages, such as a 12-week parental leave and an unlimited flexible time off program (with no accrual or maximum time away from work).\nWe are also committed to building an inclusive culture in which everyone feels welcome, respected, safe and valued. As we continue to progress in this area, we are reaching across all facets of our functional and operational areas through our bi-annual inclusion and diversity learning program. In 2021, we introduced our Inclusion, Diversity, and Belonging statement and three-year roadmap, including our skills-first hiring approach. The skills-first approach has led to stronger representation of women and ethnic and racial minorities in our workforce. As of September 30, 2023, women made up approximately 43.7% of our workforce and 33.0% of our managerial employees, with ethnic and racial minorities making up approximately 26.0% of our workforce and 16.6% of our managerial employees.\nCharitable Giving\nAcross our Company, our team members are committed to supporting causes that make a difference. From local service activities to Company-wide initiatives, giving back is a central element of our culture, championed by passionate employees and embraced by partners who share our commitment to have a positive impact on the communities we serve.\nAs part of our ongoing commitment to strengthen the communities we serve, we created a wholly-owned title insurance agency, Charity Title Agency. Charity Title Agency donates 100% of its net profits to charity. During the fiscal year ended September 30, 2023, Charity Title Agency made charitable contributions totaling $2.5 million to Beazer Charity Foundation, our Company's philanthropic arm. Beazer Charity Foundation is a non-profit entity that provides donations to unrelated national and local non-profits and is managed by current employees of the Company.\nAvailable Information\nOur Internet website address is www.beazer.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to section 13(a) or 15(d) of the Securities Exchange Act are available free of charge through our website as soon as reasonably practicable after we electronically file with or furnish them to the Securities and Exchange Commission (SEC), and are available in print to any stockholder who requests a printed copy. The SEC maintains a website that contains reports, proxy statements, information statements and other information regarding issuers, including us, that file electronically with the SEC at www.sec.gov.\nIn addition, many of our corporate governance documents are available on our website at www.beazer.com. Specifically, our Audit, Finance, Compensation, and Nominating/Corporate Governance Committee Charters, our Corporate Governance Guidelines and Code of Business Conduct and Ethics are available. Each of these documents is also available in print to any stockholder who requests it.\nThe content on our website is available for information purposes only and is not a part of and shall not be deemed incorporated by reference in this Form 10-K. Item 1A. Risk Factors\nInvesting in our common stock involves a high degree of risk. You should carefully consider the following risk factors, as well as other information in this Form 10-K, before deciding whether to invest in shares of our common stock. The occurrence of any of the events described below could harm our business, financial condition, results of operations, and growth prospects. In such an event, the trading price of our common stock may decline, and you may lose all or part of your investment.\nBusiness and Market Risks\nA number of conditions that affect demand for the homes we sell are outside of our control. Many of these conditions, such as interest rates, inflation, employment levels, wage levels and governmental actions also impact consumer confidence, upon which our business is highly dependent.\nChanges in national and regional economic conditions, as well as local economic conditions where we conduct our operations, may result in more caution on the part of homebuyers and, consequently, fewer home purchases. Demand during the second half of fiscal 2022 was negatively impacted by steep increases in interest rates from January to November 2022, as well as inflation, an uncertain economic outlook, and other macro-economic conditions. Due to these factors, housing market conditions during the first quarter of fiscal 2023 were challenging. Since the second quarter of fiscal 2023, interest rates have been less volatile, allowing homebuyers time to absorb the higher rate environment. As a result, demand and homebuyer traffic improved, and the housing market began to stabilize. Towards the end of September 2023, interest rates began to rise again with mortgage interest rates reaching a two-decade high, which further strained affordability. These economic uncertainties are out of our control and affect buyer sentiment and behavior, as well as the affordability of, and demand for, the homes we sell. These conditions also impact consumer confidence, upon which our business is highly dependent. Adverse changes in any of these conditions could decrease demand and pricing for our homes or result in customer cancellations of pending contracts, which could adversely affect the number of home sales we make or reduce home prices, either of which could result in a decrease in our revenues and earnings and adversely affect our financial condition and results of operations.\nDuring periods of downturn in the homebuilding industry, housing markets across the United States may experience an oversupply of both new and resale home inventory, an increase in foreclosures, reduced levels of consumer demand for new homes, increased cancellation rates, aggressive price competition among homebuilders, and increased incentives for home sales. In the event of a downturn, we would likely experience a material reduction in revenues and margins and our financial condition as well as our results of operations could be adversely affected.\nBecause almost all of our customers require mortgage financing, elevated mortgage interest rates for prolonged periods and further increases in interest rates would likely negatively affect the affordability of the homes we sell. In addition, reductions in mortgage availability or increases in the effective costs of owning a home could prevent our customers from buying our homes and adversely affect our business and financial results.\nSubstantially all of the purchasers of our homes finance their acquisition with mortgage financing. Over the past year, the Federal Reserve raised interest rates multiple times in response to concerns about inflation and economic uncertainties, and it may raise them again. Increases in interest rates increase the costs of owning a home, adversely affect the purchasing power of consumers, and lower demand for the homes we sell, which could result in a decrease in our revenues and earnings and adversely affect our financial condition.\nThe availability of mortgage financing is significantly influenced by governmental entities such as the Federal Housing Administration, Veterans Administration, and Government National Mortgage Association and government-sponsored enterprises known as Fannie Mae and Freddie Mac. If these or other lenders borrowing standards are tightened and/or the federal government were to reduce or eliminate these mortgage loan programs (including due to any failure of lawmakers to agree on a budget or appropriation legislation to fund relevant programs or operations), it would likely make it more difficult for our customers to obtain acceptable financing, which would, in turn, adversely affect our business, financial condition and results of operations.\nMortgage interest expenses and real estate taxes represent significant costs of homeownership. Therefore, when there are changes in federal or state income tax laws that eliminate or substantially limit the income tax deductions relating to these expenses, the after-tax costs of owning a new home can increase significantly. For example, the Tax Cuts and Jobs Act, which was enacted in December 2017, includes provisions that impose significant limitations with respect to these income tax deductions. Under this legislation, through the end of 2025, the annual deduction for real estate property taxes and state and local income or sales taxes has been limited to a combined amount of $10,000 ($5,000 in the case of a separate return filed by a married individual). In addition, through the end of 2025, the deduction for mortgage interest will generally only be available with respect to acquisition indebtedness that does not exceed $750,000 ($375,000 in the case of a separate return filed by a married individual).\nIf we are unsuccessful in competing against our competitors, our market share could decline or our growth could be impeded and, as a result, our financial condition and results of operations could suffer.\nCompetition in the homebuilding industry is intense, and there are relatively low barriers to entry into our business. Increased competition could hurt our business, as it could prevent us from acquiring attractive parcels of land on which to build homes or make such acquisitions more expensive, hinder our market share expansion and lead to pricing pressures on our homes that may adversely impact our margins and revenues. If we are unable to successfully compete, our financial results could suffer and our ability to service our debt could be adversely affected. Our competitors may independently develop land and construct housing units that are superior or substantially similar to our products. Furthermore, many of our competitors have substantially greater financial resources, less leverage, and lower costs of funds and operations than we do. Many of these competitors also have longstanding relationships with subcontractors and suppliers in the markets in which we operate. We currently build in several of the top markets in the nation and, therefore, we expect to continue to face additional competition from new entrants into our markets.\nOur business could be materially and adversely disrupted by an epidemic or pandemic (such as COVID-19), or similar public threat, or fear of such an event, and the measures that international, federal, state and local governments, agencies, law enforcement and/or health authorities implement to address it.\nAn epidemic, pandemic, or similar serious public health issue, and the measures undertaken by governmental authorities to address it, could significantly disrupt or prevent us from operating our business in the ordinary course for an extended period, and thereby, and/or along with any associated economic and/or social instability or distress, have a material adverse impact on our consolidated financial statements.\nFor example, our business and operations were significantly impacted by the COVID-19 pandemic and the corresponding actions taken by governmental authorities. If COVID-19 or another public health emergency were to reemerge, we could again experience material disruptions in our operating environment, impairing our ability to sell and build homes in a typical manner, as occurred in during our 2020 fiscal year, or at all, due to, among other things, increased costs or decreased supply of building materials, reduced availability of subcontractors, employees, and other talent, as a result of infections or recommended self-quarantining, or governmental mandates to direct production activities to support public health efforts. This could result in our recognizing charges in future periods, which may be material, for inventory impairments or land option agreement abandonments, or both, related to our inventory assets.\nShould the adverse impacts described above (or others that are currently unknown) occur, whether individually or collectively, we would expect to experience, among other things, decreases in our net new orders, home closings, average selling prices, revenues, and profitability, and such impacts could be material to our consolidated financial statements. Along with an increase in cancellations of home purchase contracts, if there are prolonged government restrictions on our business and our customers, and/or an extended economic recession, we could be unable to produce revenues and cash flows sufficient to conduct our business; meet the terms of our covenants and other requirements under the Unsecured Revolving Credit Facility, our senior notes, and the related indenture, and/or mortgages and land contracts due to land sellers and other loans; service our outstanding debt. Such a circumstance could, among other things, exhaust our available liquidity (and ability to access liquidity sources) and/or trigger an acceleration to pay a significant portion or all of our then-outstanding debt obligations, which we may be unable to do.\nOperational, Legal and Regulatory Risks\nInflation may adversely affect us by increasing costs beyond what we can recover through price increases.\nInflation can adversely affect us by increasing costs of land, materials, and labor. In addition, inflation is often accompanied by higher interest rates. In an inflationary environment, depending on homebuilding industry and other economic conditions, we may be unable to raise home prices enough to keep up with the rate of inflation, which would reduce our profit margins. Given the inflation over the past two years, we have experienced, and may continue to experience, increases in the prices of land, labor, and materials.\nAn increase in cancellation rates will negatively impact our business and could lead to imprecise estimates related to homes to be delivered in the future (backlog).\nOur backlog reflects the number and value of homes for which we have entered into a sales contract with a customer but have not yet delivered the home. Although these sales contracts typically require a cash deposit and do not make the sale contingent on the sale of the customer's existing home, in some cases a customer may cancel the contract and receive a complete or partial refund of the deposit as a result of local laws or as a matter of our business practices. If industry or economic conditions deteriorate or if mortgage financing becomes less accessible, more homebuyers may have an incentive to cancel their contracts with us, even where they might be entitled to no refund or only a partial refund, rather than complete the purchase. For example, cancellation rates increased significantly from the low teens in the first half of fiscal year 2022 to 17.0% and 32.8% in the third and fourth quarters of fiscal 2022, respectively. Cancellation rates remained elevated through the first quarter of fiscal year 2023, but have since decreased (16.5% in the fourth quarter of fiscal 2023) and returned to a level within our normal historical range as buyers began to adjust to the higher rate environment. Nevertheless, significant cancellations have had, and could again in the future have, a material adverse effect on our business as a result of lost sales revenue and the accumulation of unsold housing inventory. It is important to note that both backlog and cancellation metrics are operational, rather than accounting data, and should be used only as a general gauge to evaluate our performance. There is an inherent imprecision in these metrics based on an evaluation of qualitative factors during the transaction cycle.\nSupply shortages and other risks related to the demand for skilled labor and building materials could increase costs, delay deliveries and could adversely affect our financial condition and results of operations.\nThe residential construction industry experiences price fluctuations and shortages in labor and materials from time to time. Shortages in labor can be due to shortages in qualified trades people, changes in immigration laws and trends in labor migration, lack of availability of adequate utility infrastructure and services, or our need to rely on local subcontractors who may not be adequately capitalized or insured. Shortages of materials can be due to certain disruptions, such as natural disasters, civil or political unrest and conflicts, trade disputes, difficulties in production or delivery or health issues like the COVID-19 pandemic. Labor and material shortages can be more severe during periods of strong demand for housing or during periods in which the markets where we operate experience natural disasters such as hurricanes or flooding as discussed more fully below. Pricing for labor and materials can be affected by the factors discussed above, changes in energy prices, and various other national, regional, and local economic and political factors. For example, government imposed tariffs and trade regulations on imported building supplies have, and in the future could have, significant impacts on the cost to construct our homes. Such measures limit our ability to control costs, which if we are not able to successfully offset such increased costs through higher sales prices, could adversely affect our margins on the homes we build.\nOur long-term success depends on our ability to acquire finished lots and undeveloped land suitable for residential homebuilding at reasonable prices, in accordance with our land investment criteria.\nThe homebuilding industry is highly competitive for suitable land and the risk inherent in purchasing and developing land increases as consumer demand for housing increases. The availability of finished and partially finished developed lots and undeveloped land for purchase that meet our investment criteria depends on a number of factors outside our control, including land availability in general, competition with other homebuilders and land buyers, inflation in land prices, zoning, allowable housing density, the ability to obtain building permits, and other regulatory requirements. Should suitable lots or land become less available, the number of homes we may be able to build and sell could be reduced, and the cost of land could increase, perhaps substantially, which could adversely impact our financial condition and results of operations.\nAs competition for suitable land increases, the cost of acquiring both finished and undeveloped lots and the cost of developing owned land could rise, and the availability of suitable land at acceptable prices may decline, which could adversely impact our financial results. The availability of suitable land assets could also affect the success of our land acquisition strategy and ultimately our long-term strategic goals by impacting our ability to increase the number of actively selling communities, grow our revenues and margins and achieve or maintain profitability.\nReduced numbers of home sales extend the time it takes us to recover land purchase and property development costs, negatively impacting profitability and our results of operations.\nWe incur many costs even before we begin to build homes in a community. Depending on the stage of development a land parcel is in when we acquire it, these may include costs of preparing land, finishing and entitling lots, installing roads, sewers, water systems, and other utilities, taxes, and other costs related to ownership of the land on which we plan to build homes. If the rate at which we sell and deliver homes slows, or if we delay the opening of new home communities, we may incur additional pre-construction costs, and it may take longer for us to recover our costs, which could adversely affect our profitability and results of operations.\nNatural disasters and other related events could result in delays in land development or home construction, increase our costs or decrease demand in the impacted areas.\nThe climates and geology of many of the states in which we operate present increased risks of natural disasters. To the extent that hurricanes, tornadoes, severe storms, heavy or prolonged precipitation, earthquakes, droughts, floods, wildfires or other natural disasters or similar events occur, our homes under construction or our building lots in such states could be damaged or destroyed, which may result in losses exceeding our insurance coverage. For example, in fiscal 2022, Hurricane Ian disrupted our operations in Florida, which resulted in temporary reductions in sales and closings. Natural disasters can also lead to increased competition for subcontractors, which can delay our progress even after the event has concluded. Additionally, and as discussed above, increased competition for skilled labor can lead to cost overruns, as we may have to incentivize the impacted regions limited trade base to work on our homes. Finally, natural disasters and other related events may also temporarily impact demand, as buyers are not as willing to shop for new homes during or after the event. These risks could adversely affect our business, financial condition, and results of operations.\nGlobal economic and political instability and conflicts could adversely affect our business, financial condition or results of operations.\nOur business could be adversely affected by unstable economic and political conditions within the United States and foreign jurisdictions and geopolitical conflicts, such as the conflict between Russia and Ukraine and the conflict in Gaza. While we do not have any customer or direct supplier relationships in Russia, Ukraine, or the Middle East, the current military conflicts, and related sanctions, as well as export controls or actions that may be initiated by nations (e.g., potential cyberattacks, disruption of energy flows, etc.) and other potential uncertainties could adversely affect our supply chain by causing shortages or increases in costs for materials necessary to construct homes and/or increases to the price of gasoline and other fuels. In addition, such events could cause higher interest rates, inflation or general economic uncertainty, which could negatively impact our business partners, employees or customers, or otherwise adversely impact our business.\nTerrorist attacks or acts of war against the United States or increased domestic or international instability could have an adverse effect on our operations.\nAdverse developments in the war on terrorism, terrorist attacks against the United States or any outbreak or escalation of hostilities between the United States and/or any foreign power may cause disruption to the economy, our Company, our employees and our customers, which could negatively impact our financial condition and results of operations.\nWe may incur additional operating expenses or longer construction cycle times due to compliance programs or fines, penalties and remediation costs pertaining to environmental regulations within our markets. Additionally, any violations of such regulations could harm our reputation, thereby negatively impacting our financial condition and results of operations.\nWe are subject to a variety of local, state and federal statutes, ordinances, rules and regulations concerning the protection of health and the environment. The particular environmental laws that apply to any given community vary greatly according to the location of the community site, the site's environmental conditions and the present and former use of the site. Environmental laws may result in delays, may cause us to implement time consuming and expensive compliance programs and may prohibit or severely restrict development in certain environmentally sensitive regions or areas. From time to time, the United States Environmental Protection Agency (EPA) and similar federal or state agencies review homebuilders' compliance with environmental laws and may levy fines and penalties for failure to strictly comply with applicable environmental laws or impose additional requirements for future compliance as a result of past failures. Any such actions taken with respect to us may increase our costs or harm our reputation. Further, we expect that increasingly stringent requirements will be imposed on homebuilders in the future. For example, in November 2022, pursuant to the Global Warming Solutions Act of 2006 (AB32), the California Air Resources Board released a final scoping plan that, among other things, proposes to eliminate the installation of natural gas-powered appliances in favor of electric appliances in new residential construction effective in 2026. Further, in August 2021, the California Energy Commission (CEC) adopted updates to Californias energy code that, among other things, establish electric-ready requirements for electric heating, cooking and vehicle charging effective January 1, 2023 for new permit applications. Environmental regulations can also have an adverse impact on the availability and price of certain raw materials such as lumber. Our communities in California are especially susceptible to restrictive government regulations and environmental laws, particularly surrounding water usage due to continuing drought conditions within that region.\nIn addition, there is a growing concern from advocacy groups and the general public that the emissions of greenhouse gases and other human activities have caused, or will cause, significant changes in weather patterns and temperatures and the frequency and severity of natural disasters. Government mandates, standards and regulations enacted in response to these projected climate change impacts could result in restrictions on land development in certain areas or increased energy, transportation, and raw material costs that may adversely affect our financial condition and results of operations.\nWe are subject to extensive government regulation, which could cause us to incur significant liabilities or restrict our business activities.\nRegulatory requirements could cause us to incur significant liabilities and operating expenses and could restrict our business activities. We are subject to local, state and federal statutes and rules regulating, among other things, certain developmental matters, building and site design, the availability of water and matters concerning the protection of health, safety and the environment. Our operating costs may be increased by governmental regulations, such as building permit allocation ordinances and impact and other fees and taxes, which may be imposed to defray the cost of providing certain governmental services and improvements. Other governmental regulations, such as building moratoriums and no growth or slow growth initiatives, which may be adopted in communities that have developed rapidly, may cause delays in new home communities or otherwise restrict our business activities, resulting in reductions in our revenues. Any delay or refusal from government agencies to grant us necessary licenses, permits and approvals could have an adverse effect on our financial condition and results of operations.\nWe may be subject to significant potential liabilities as a result of construction defect, product liability and warranty claims made against us.\nAs a homebuilder, we have been, and continue to be, subject to construction defect, product liability and home warranty claims, including moisture intrusion and related claims, arising in the ordinary course of business. These claims are common to the homebuilding industry and can be costly.\nWith respect to certain general liability exposures, including construction defect claims, product liability claims and related claims, assessment of claims and the related liability and reserve estimation process is highly judgmental due to the complex nature of these exposures and unique circumstances of each claim. Furthermore, once claims are asserted for construction defects, it can be difficult to determine the extent to which the assertion of these claims will expand geographically. Although we have obtained insurance for construction defect claims, such policies may not be available or adequate to cover liability for damages, the cost of repairs and/or the expense of litigation. Current and future claims may arise out of events or circumstances not covered by insurance and not subject to effective indemnification agreements with our subcontractors.\nAt any given time, we may be the subject of civil litigation that could require us to pay substantial damages or could otherwise have a material adverse effect on us.\nWhile no current material lawsuits are pending, we may be subject to civil litigation regarding claims made by homebuyers. We cannot predict or determine the timing or final outcome of such lawsuits, or the effect that any adverse determinations the lawsuits may have on us. An unfavorable determination in any of the lawsuits could result in the payment by us of substantial monetary damages that may not be covered by insurance. Further, the legal costs associated with the lawsuits and the amount of time required to be spent by management and the Board of Directors on these matters, even if we are ultimately successful, could have a material adverse effect on our business, financial condition and results of operations. In addition to expenses incurred to defend the Company in these matters, under Delaware law and our bylaws, we may have an obligation to indemnify our current and former officers and directors in relation to these matters. We have obligations to advance legal fees and expenses to directors and certain officers.\nOur insurance carriers may seek to rescind or deny coverage with respect to such lawsuits, or we may not have sufficient coverage under our insurance policies. If the insurance companies are successful in rescinding or denying coverage, or if we do not have sufficient coverage under our policies, our business, financial condition and results of operations could be materially adversely affected.\nOur operating expenses could increase if we are required to pay higher insurance premiums or litigation costs for various claims, which could negatively impact our financial condition and results of operations. Additionally, our insurance policies may not offset our entire expense due to limitation in coverages, amounts payable under the policies or other related restrictions.\nThe costs of insuring against construction defect, product liability and director and officer claims are substantial. Increasingly in recent years, lawsuits (including class action lawsuits) have been filed against builders, asserting claims of personal injury and property damage. Our insurance may not cover all of the claims, including personal injury claims, or such coverage may become prohibitively expensive. If we are not able to obtain adequate insurance against these claims, we may experience losses that could negatively impact our financial condition and results of operations, as well as our cash flows.\nHistorically, builders have recovered from subcontractors and their insurance carriers a significant portion of the construction defect liabilities and costs of defense that the builders have incurred. However, insurance coverage available to subcontractors for construction defects is becoming increasingly expensive and the scope of coverage is restricted. If we cannot effectively recover from our subcontractors or their carriers, we may suffer even greater losses.\nA builder's ability to recover against any available insurance policy depends upon the continued solvency and financial strength of the insurance carrier that issued the policy. Many of the states in which we build homes have lengthy statutes of limitations and/or repose applicable to claims for construction defects. To the extent that any carrier providing insurance coverage to us or our subcontractors becomes insolvent or experiences financial difficulty in the future, we may be unable to recover on those policies, thereby negatively impacting our financial condition and results of operations.\nWe are dependent on the services of certain key employees and the loss of their services could hurt our business.\nOur future success depends upon our ability to attract, train and retain skilled personnel, including officers and directors. If we are unable to retain our key employees or attract, train or retain other skilled personnel in the future, it could hinder our business strategy and impose additional costs of identifying and training new individuals. Competition for qualified personnel in all of our operating markets, as well as within our corporate operations, is intense.\nInformation technology failures, cybersecurity breaches or data security breaches could harm our business.\nWe use information technology and other computer resources to perform important operational and marketing activities and to maintain our business records. Certain of these resources are provided to us and/or maintained by third-party service providers pursuant to agreements that specify certain security and service level standards. Our computer systems, including our back-up systems and portable electronic devices, and those of our third-party providers, are subject to damage or interruption from power outages, computer and telecommunication failures, computer viruses, security breaches including malware and phishing, cyberattacks, natural disasters, usage errors by our employees or contractors, and other related risks. As part of our normal business activities, we collect and store certain confidential information, including information about employees, homebuyers, customers, vendors and suppliers. This information is entitled to protection under a number of regulatory regimes. We share some of this information with third parties who assist us with certain aspects of our business. A significant and extended disruption of or breach of security related to our computer systems and back-up systems may result in business disruption, damage our reputation and cause us to lose customers, sales and revenue, result in the unintended misappropriation of proprietary, personal and confidential information, and require us to incur significant expense to remediate or otherwise resolve these issues including financial obligations to third parties, fines, penalties, regulatory proceedings and private litigation with potentially large costs and other competitive disadvantages. While, to date, we have not had a significant cybersecurity breach or attack that had a material impact on our business or results of operations, there can be no assurance that our efforts to maintain the security and integrity of these types of IT networks and related systems will be effective or that attempted security breaches or disruptions would not be successful or damaging.\nFinancial and Liquidity Risks\nOur access to capital and our ability to obtain additional financing could be affected by any downgrade of our credit ratings, as well as limitations in the capital markets or adverse credit market conditions.\nThe Company's credit rating and ratings on our senior notes and our current credit condition affect, among other things, our ability to access new capital, especially debt. Negative changes in these ratings may result in more stringent covenants and higher interest rates under the terms of any new debt. If our credit ratings are lowered or rating agencies issue adverse commentaries in the future, it could have a material adverse effect on our business, financial condition, results of operations and liquidity. In particular, a weakening of our financial condition, including a significant increase in our leverage or decrease in our profitability or cash flows, could adversely affect our ability to obtain necessary funds, result in a credit rating downgrade or change in outlook, or otherwise increase our cost of borrowing.\nOur Senior Notes, Senior Unsecured Revolving Credit Facility, letter of credit facilities and certain other debt impose significant restrictions and obligations on us. Restrictions on our ability to borrow could adversely affect our liquidity. In addition, our indebtedness could adversely affect our financial condition, limit our growth and make it more difficult for us to satisfy our debt obligations.\nOur senior notes, revolving credit facility, letter of credit facilities and certain other debt impose certain restrictions and obligations on us. Under certain of these instruments, we must comply with defined covenants that limit our ability to, among other things, incur additional indebtedness, engage in certain asset sales, make certain types of restricted payments, engage in transactions with affiliates and create liens on our assets. Failure to comply with certain of these covenants could result in an event of default under the applicable instrument. Any such event of default could negatively impact other covenants or lead to cross defaults under certain of our other debt agreements. There can be no assurance that we will be able to obtain any waivers or amendments that may become necessary in the event of a future default situation without significant additional cost or at all.\nOur indebtedness could have important consequences to us and the holders of our securities, including, among other things:\ncausing us to be unable to satisfy our obligations under our debt agreements;\ncausing us to pay higher interest rates upon refinancing indebtedness if interest rates rise;\nmaking us more vulnerable to adverse general economic and industry conditions;\nmaking it difficult to fund future working capital, land purchases, acquisitions, capital expenditures, share repurchases, general corporate or other activities; and\ncausing us to be limited in our flexibility in planning for, or reacting to, changes in our business.\nIn addition, subject to the restrictions of our existing debt instruments, we may incur additional indebtedness. If new debt is added to our current debt levels, the related risks that we now face could intensify. Our growth plans and our ability to make payments of principal or interest on, or to refinance, our indebtedness will depend on our future operating performance and our ability to enter into additional debt and/or equity financings. If we are unable to generate sufficient cash flows in the future to service our debt, we may be required to refinance all or a portion of our existing debt, to sell assets or to obtain additional financing. We may not be able to do any of the foregoing on terms acceptable to us, if at all.\nThe tax benefits of our pre-ownership change net operating loss carryforwards and built-in losses were substantially limited since we experienced an ownership change as defined in Section 382 of the Internal Revenue Code, and portions of our deferred income tax asset have been written off since they were not fully realizable. Any subsequent ownership change, should it occur, could have a further impact on these tax attributes.\nSection 382 of the Internal Revenue Code contains rules that limit the ability of a company that undergoes an ownership change, which is generally defined as any change in ownership of more than 50% of its common stock over a three-year period, to utilize its net operating loss carryforwards, tax credits and certain built-in losses or deductions, as of the ownership change date, that are recognized during the five-year period after the ownership change. These rules generally operate by focusing on changes in the ownership among shareholders owning, directly or indirectly, 5% or more of the company's common stock (including changes involving a shareholder becoming a 5% shareholder) or any change in ownership arising from a new issuance of stock or share repurchases by the company.\nWe currently have an immaterial amount of \"built-in losses\" in our assets, i.e., an excess tax basis over current fair market value, which may result in tax losses as such assets are sold. Those \"built-in losses\" could become significant in the future if market conditions worsen and our inventory is impaired. Net operating losses and tax credits generally may be carried forward for a 20-year period to offset future earnings and reduce our federal income tax liability. Any net operating losses created during or after our fiscal 2019 may be carried forward indefinitely; however, the loss can only be utilized to offset 80% of taxable income generated in a tax year. Built-in losses, if and when recognized, generally will result in tax losses that may then be deducted or carried forward. However, we experienced an ownership change under Section 382 as of January 12, 2010. As a result of this previous ownership change for purposes of Section 382, our ability to use certain net operating loss carryforwards, tax credits and built-in losses or deductions in existence prior to the ownership change was limited by Section 382. We cannot predict or control the occurrence or timing of another ownership change in the future. If another ownership change were to occur, the limitations imposed by Section 382 could result in a material amount of our net operating loss carryforwards and tax credits expiring unused and, therefore, significantly impair the future value of our deferred tax assets.\nOur certificate of incorporation prohibits certain transfers of our common stock that could result in an ownership change. In addition, we are party to a rights agreement intended to act as a deterrent to any person desiring to acquire 4.95% or more of our common stock. In February 2022, our stockholders approved an extension of these protective provisions in our certificate of incorporation and the rights agreement, which as a result are scheduled to expire in November 2025. Any extension of these protective provisions and our entry into a new rights agreement will require additional approval by our stockholders. We cannot guarantee that the requisite stockholder approvals will be obtained. In addition, neither the protective provisions nor the rights agreement offers a complete solution, and an ownership change may occur even if the protective provisions of our charter are extended and a new rights agreement is approved upon expiration. The protective provisions of our certificate of incorporation may not be enforceable against all stockholders and may not prevent all stock transfers that have the potential to cause a Section 382 ownership shift, and the rights agreement may deter, but ultimately may not block all transfers of our common stock that might result in an ownership change.\nThe realization of all or a portion of our deferred income tax assets (including net operating loss carryforwards and tax credits) is dependent upon the generation of future income during the statutory carryforward periods. Our inability to utilize our limited pre-ownership change net operating loss carryforwards, tax credits and recognized built-in losses or deductions, or the occurrence of a future ownership change and resulting additional limitations to these tax attributes, could have a material adverse effect on our financial condition, results of operations, and cash flows.\nWe could experience a reduction in home sales and revenues due to our inability to acquire and develop land for our communities if we are unable to obtain reasonably priced financing.\nThe homebuilding industry is capital intensive and homebuilding requires significant up-front expenditures to acquire land and to begin development. Accordingly, we incur substantial indebtedness to finance our homebuilding activities. If internally generated funds are not sufficient, we would seek additional capital in the form of equity or debt financing from a variety of potential sources, including additional bank financing and/or securities offerings. The amount and types of indebtedness that we may incur are limited by the terms of our existing debt. In addition, the availability of borrowed funds, especially for land acquisition and construction financing, may be greatly reduced nationally, and the lending community may require increased amounts of equity to be invested in a project by borrowers in connection with both new loans and the extension of existing loans. The credit and capital markets have continued to experience significant volatility. If we are required to seek additional financing to fund our operations, the volatility in these markets may restrict our flexibility to access such financing. If we are not successful in obtaining sufficient capital to fund our planned capital and other expenditures, we may be unable to acquire land for our housing developments, thereby limiting our anticipated growth and community count. Additionally, if we cannot obtain additional financing to fund the purchase of land under our option agreements, we may incur contractual penalties and fees.\nInefficient or ineffective allocation of capital could adversely affect our operating results and/or stockholder value.\nOur goal is to allocate capital to maximize our overall long-term returns. This includes growing our land position and growing our active communities. In addition, from time to time we may engage in bond repurchases to reduce our indebtedness and return value to our stockholders through share repurchases. If we do not properly allocate our capital, we may fail to produce optimal financial results and we may experience a reduction in stockholder value, including increased volatility in our stock price.\nRisk Relating to an Investment in our Common Stock\nOur stock price is volatile and could decline.\nThe securities markets in general and our common stock in particular have experienced significant price and volume volatility over the past several years. The market price and volume of our common stock may continue to experience significant fluctuations due not only to general stock market conditions, but also to a change in sentiment in the market regarding our industry, operations or business prospects. The price and volume volatility of our common stock may be affected by:\nfactors influencing home purchases, such as higher interest rates and availability of home mortgage loans, credit criteria applicable to prospective borrowers, ability to sell existing residences and homebuyer sentiment in general;\nthe operating and securities price performance of companies that investors consider comparable to us;\noperating results that vary from the expectations of securities analysts and investors;\nannouncements of strategic developments, acquisitions and other material events by us or our competitors; and\nchanges in global financial markets and global economies and general market conditions, such as inflation, interest rates, commodity and equity prices and the value of financial assets.\nOur ability to raise funds through the issuance of equity or otherwise use our common stock as consideration is impacted by the price of our common stock. A low stock price may adversely impact our ability to reduce our financial leverage, as measured by the ratio of total debt to total capital. Continued high levels of leverage or significant increases may adversely affect our credit ratings and make it more difficult for us to access additional capital. These factors may limit our ability to implement our operating and growth plans.\nWe experience fluctuations and variability in our operating results on a quarterly basis and, as a result, our historical performance may not be a meaningful indicator of future results.\nWe historically have experienced, and expect to continue to experience, variability in home sales and earnings on a quarterly basis. As a result of such variability, our historical performance may not be a meaningful indicator of future results. Our quarterly results of operations may continue to fluctuate in the future as a result of a variety of both national and local factors, including, among others:\nthe timing of home closings and land sales;\nour ability to continue to acquire additional land or secure option agreements to acquire land on acceptable terms;\nconditions of the real estate market in areas where we operate and of the general economy;\ninventory impairments or other material write-downs;\nraw material and labor shortages;\nseasonal home buying patterns; and\nother changes in operating expenses, including the cost of labor and raw materials, personnel and general economic conditions. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of September 30, 2023, we had under lease approximately 23,600 square feet of office space in Atlanta, Georgia to house our corporate headquarters. We also lease and own an aggregate of approximately 160,000 and 4,500 square feet of office space, respectively, for our divisional operations at various locations. All facilities are in good condition, adequately utilized, and sufficient to meet our present operating needs.\nDue to the nature of our business, significant amounts of property are held by us as inventory in the ordinary course of our homebuilding operations. See Note 4 of notes to the consolidated financial statements in this Form 10-K for a further discussion of our inventory. Item 3. Legal Proceedings\nLitigation\nIn the normal course of business, we are subject to various lawsuits. We cannot predict or determine the timing or final outcome of these lawsuits or the effect that any adverse findings or determinations in pending lawsuits may have on us. In addition, an estimate of possible loss or range of loss, if any, cannot presently be made with respect to certain of these pending matters. An unfavorable determination in pending lawsuits could result in the payment by us of substantial monetary damages that may not be fully covered by insurance. Further, the legal costs associated with the lawsuits and the amount of time required to be spent by management and our Board of Directors on these matters, even if we are ultimately successful, could have a material adverse effect on our financial condition, results of operations, or cash flows.\nFor a discussion of our legal proceedings, see Note 8 of the notes to our consolidated financial statements in this Form 10-K. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThe Company lists its common stock on the New York Stock Exchange (NYSE) under the symbol BZH. On November 13, 2023, the last reported sales price of the Company's common stock on the NYSE was $28.44, and we had approximately 194 stockholders of record and 31,322,989 shares of common stock outstanding.\nDividends\nThe indentures under which our senior notes were issued contain certain restrictive covenants, including limitations on the payment of dividends. There were no dividends paid during our fiscal 2023, 2022 or 2021. The Board of Directors will periodically reconsider the declaration of dividends, assuming payment of dividends is not limited under our indentures. The reinstatement of quarterly dividends, the amount of such dividends and the form in which the dividends are paid (cash or stock) will depend upon our financial condition, results of operations, and other factors that the Board of Directors deems relevant.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following table provides information about the Company's shares of common stock that may be issued under our existing equity compensation plans as of September 30, 2023, all of which have been approved by our stockholders:\nPlan Category Number of Common Shares to be Issued Upon Exercise of Outstanding Options, Warrants and Rights Weighted-Average Exercise Price of Outstanding Options, Warrants and Rights Number of Common Shares Remaining Available for Future Issuance Under Equity Compensation Plans\nEquity compensation plans approved by stockholders 13,575 $9.61 810,940\nIssuer Purchases of Equity Securities\nNone.\nPerformance Graph\nThe following graph illustrates the cumulative total stockholder return on Beazer Homes' common stock for the last five fiscal years through September 30, 2023 as compared to the S&P 500 Index and the S&P 500 Homebuilding Index. The graph assumes an investment of $100 at September 30, 2018 in Beazer Homes' common stock and in each of the benchmark indices specified, assumes that all dividends were reinvested, and accounts for the impact of any stock splits, where applicable. Stockholder returns over the indicated period are based on historical data and should not be considered indicative of future stockholder returns.\nComparison of Five Year Cumulative Total Return Assuming $100 Investment as of September 30, 2018\nSeptember 30,\n2018 2019 2020 2021 2022 2023\nu Beazer Homes USA, Inc. $ 100.00 $ 141.90 $ 125.71 $ 164.28 $ 92.09 $ 237.20\ng S&P 500 Index $ 100.00 $ 104.25 $ 120.05 $ 156.07 $ 131.92 $ 160.44\np S&P 500 Homebuilding Index $ 100.00 $ 129.43 $ 174.31 $ 195.80 $ 159.96 $ 258.59 Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations is intended to help the reader understand our Company, business, operations and present business environment and is provided as a supplement to, and should be read together with the sections entitled Risk Factors, and the financial statements and the accompanying notes included elsewhere in this Form 10-K.\nIn addition, the statements in this discussion and analysis regarding industry outlook, our expectations regarding the performance of our business, anticipated financial results, liquidity and the other non-historical statements are forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including, but not limited to, the risks and uncertainties described in Forward-Looking Statements and in Risk Factors above. Our actual results may differ materially from those contained in or implied by any forward-looking statements.\nExecutive Overview and Outlook\nMarket Conditions\nDuring the second half of fiscal 2022, mortgage interest rates began to increase sharply, pushing mortgage payments as a percentage of income substantially above their long-term average. This lack of affordability, along with inflation, an uncertain economic outlook and other macro-economic conditions, led to a significant decrease in new and used home sales that persisted through the first quarter of fiscal 2023. During this time period, sales pace decreased significantly, cancellation rates reached historically high levels, and home prices declined. Starting the second quarter of fiscal 2023, interest rates became less volatile and homebuyers began to adjust to the higher rate environment. As a result, homebuyer traffic and demand improved, leading to a recovery in sales pace and a reduction in cancellation rates. Additionally, the new home market benefited from low levels of resale inventory on the market. Against this backdrop of an evolving economic environment, we were able to generate historically solid financial results during fiscal 2023, with margins and profitability reaching a level that represented our second best year in more than a decade, only behind fiscal 2022.\nTowards the end of September 2023, interest rates began to rapidly rise again which further strained affordability. If mortgage rates persist at current levels or continue to increase, housing market conditions may deteriorate and temper demand. We remain disciplined in our approach to the business and are focused on making the necessary adjustments to adapt in this changing operating environment.\nIt is difficult to predict the near-term direction of mortgage rates, consumer confidence and the overall economy, and the corresponding impact on demand for our homes. While we expect uncertainty in market conditions to persist for some time, we believe the long-term housing market outlook remains positive, supported by a demographic shift towards homeownership and a multimillion unit housing deficit that has accumulated over the past decade.\nFurther, as supply chain conditions have normalized in recent quarters, our construction cycle times have decreased and backlog conversion rates have improved. We continue to strive to reduce build costs through renegotiation and rebidding of construction jobs, reduce cycle times, and prudently manage our overhead costs.\nBalanced Growth Strategy\nFiscal 2023 represented continued progress towards the execution of our balanced growth strategy, which is characterized by growing profitability, improving balance sheet efficiency, and generating returns above our cost of capital. We believe our balanced growth strategy has created significant value for our shareholders. During fiscal 2023, our total stockholders' equity of $1.1 billion exceeded the outstanding balance of our total debt for the first time in over 15 years.\nAs we look to fiscal 2024, we continue to position our business for longer-term growth, while focusing on the appropriate balance between pursuing growth opportunities, controlling risk, and maintaining a strong liquidity position. Our long-term strategic business objectives include increasing active communities to more than 200 by the end of fiscal 2026, reducing our net debt to net capitalization ratio to below 30% by the end of fiscal 2026, and reaching our target of 100% Zero Energy Ready starts by the end of the calendar year 2025.\nOverview of Results for Our Fiscal 2023\nThe following is a summary of our performance against certain key operating and financial metrics during fiscal 2023:\nDuring the fiscal year ended September 30, 2023, sales per community per month was 2.6 compared to 2.8 in the prior year, and our net new orders were 3,866, down 4.8% from 4,061 in the prior year. The decrease in sales pace year-over-year was primarily due to a depressed sales pace of 1.3 in the first quarter of fiscal 2023 driven by the challenging housing market conditions at the time, as discussed above. With mortgage interest rates stabilizing and homebuyers adapting to the market, fiscal second, third, and fourth quarter sales paces of 3.2, 3.2, and 2.6, respectively, were strong by historical standards and reflected typical seasonality, although the recent rise of mortgage rates may temper sales pace in the near-term.\nCancellation rate for the fiscal year ended September 30, 2023 was 20.3%, up from 17.6% in the prior year. Following a period of elevated cancellation rates in the fourth quarter of fiscal 2022 and first quarter of fiscal 2023, cancellation rates decreased and returned to a level within our normal historical range as buyer sentiment improved. The cancellation rate for the quarter ended September 30, 2023 was 16.5%.\nASP for homes closed during the fiscal year ended September 30, 2023 was $517.8 thousand, up 7.0% from $484.1 thousand in the prior year. The increase in closing ASP year-over-year was primarily driven by price appreciation due to existing demand and low levels of resale inventory in the market. Our backlog ASP of $518.0 thousand as of September 30, 2023 was down from $547.5 thousand year-over-year. Our objective to improve new home affordability has led us to slightly alter our product strategy in certain markets by reducing home sizes and/or features included in our base price. These efforts are likely to reduce or eliminate growth in ASP in fiscal 2024. In addition, if mortgage rates continue to rise, challenging market conditions may lead to lower ASP.\nHomebuilding gross margin for the fiscal year ended September 30, 2023 was 19.9%, down from 23.1% in the prior year. Homebuilding gross margin excluding impairments, abandonments, and interest for the fiscal year ended September 30, 2023 was 23.1%, down from 26.3% in the prior year. Homebuilding gross margin peaked in the third quarter of fiscal 2022 followed by a period of decline as we increased price concessions and closing cost incentives in response to rising interest rates and affordability challenges. Although down year-over-year, homebuilding gross margin stabilized during fiscal 2023 and remained strong by historical standards. If market conditions deteriorate due to elevated mortgage rates, gross margin may be compressed in the future.\nDuring the fiscal year ended September 30, 2023, our average active community count of 125 was up 3.9% from 120 in the prior year. We ended the year with an active community count of 134, compared to 123 at the prior year quarter end. We have been working to grow community counts by increasing investments in new communities strategically with a goal of reaching more than 200 active communities by the end of 2026.\nAs of September 30, 2023, our land position included 26,189 controlled lots, up 4.0% from 25,170 as of September 30, 2022. Excluding land held for future development and land held for sale lots, we controlled 25,567 active lots, up 4.8% from the prior year. As of September 30, 2023, we had 14,490 lots, or 56.7% of our total active lots, under option agreements as compared to 13,312 lots, or 54.6% of our total active lots, under option agreements as of September 30, 2022.\nSG&A for the fiscal year ended September 30, 2023 was 11.5% of total revenue compared with 10.9% a year earlier. The increase in SG&A as a percentage of total revenue was primarily due to lower revenues. We remain focused on prudently managing overhead costs.\nSeasonal and Quarterly Variability: Our homebuilding operating cycle historically has reflected escalating new order activity in the second and third fiscal quarters and increased closings in the third and fourth fiscal quarters. However, these seasonal patterns may be impacted or reduced by a variety of factors, including periods of economic downturn, which may result in decreased revenues and closings.\nThe following tables present new order and closings data for the periods presented:\nNew Orders (Net of Cancellations)\n1st Qtr 2nd Qtr 3rd Qtr 4th Qtr Total\n2023 482 1,181 1,200 1,003 3,866\n2022 1,141 1,291 925 704 4,061\n2021 1,442 1,854 1,199 1,069 5,564\nClosings\n1st Qtr 2nd Qtr 3rd Qtr 4th Qtr Total\n2023 833 1,063 1,117 1,233 4,246\n2022 1,019 1,078 1,043 1,616 4,756\n2021 1,114 1,388 1,378 1,407 5,287\nRESULTS OF CONTINUING OPERATIONS\nThe following table summarizes certain key income statement metrics for the periods presented:\nFiscal Year Ended September 30,\n$ in thousands 2023 2022 2021\nRevenue:\nHomebuilding $ 2,198,400 $ 2,302,520 $ 2,127,700\nLand sales and other 8,385 14,468 12,603\nTotal $ 2,206,785 $ 2,316,988 $ 2,140,303\nGross profit:\nHomebuilding $ 438,120 $ 532,149 $ 401,720\nLand sales and other 4,575 5,358 2,535\nTotal $ 442,695 $ 537,507 $ 404,255\nGross margin:\nHomebuilding(a)\n19.9 % 23.1 % 18.9 %\nLand sales and other(b)\n54.6 % 37.0 % 20.1 %\nTotal 20.1 % 23.2 % 18.9 %\nCommissions $ 73,450 $ 74,336 $ 80,125\nGeneral and administrative expenses (G&A) $ 179,794 $ 177,320 $ 163,285\nSG&A (commissions plus G&A) as a percentage of total revenue 11.5 % 10.9 % 11.4 %\nG&A as a percentage of total revenue 8.1 % 7.7 % 7.6 %\nDepreciation and amortization $ 12,198 $ 13,360 $ 13,976\nOperating income $ 177,253 $ 272,491 $ 146,869\nOperating income as a percentage of total revenue 8.0 % 11.8 % 6.9 %\nEffective tax rate(c)\n13.1 % 19.4 % 15.0 %\nInventory impairments and abandonments $ 641 $ 2,963 $ 853\n(Loss) gain on extinguishment of debt, net $ (546) $ 309 $ (2,025)\n(a) Excluding impairments, abandonments, and interest amortized to cost of sales, homebuilding gross margin was 23.1%, 26.3% and 23.0% for the fiscal years ended September 30, 2023, 2022 and 2021, respectively. Please see \"Homebuilding Gross Profit and Gross Margin\" section below for a reconciliation of homebuilding gross profit and the related gross margin excluding impairments and abandonments and interest amortized to cost of sales to homebuilding gross profit and gross margin, the most directly comparable GAAP measure.\n(b) Calculated as land sales and other gross profit divided by land sales and other revenue.\n(c) Calculated as tax expense for the period divided by income from continuing operations. Our income tax expenses are not always directly correlated to the amount of pre-tax income for the associated period due to a variety of factors, including, but not limited to, the impact of tax credits and permanent differences. For the fiscal years ended September 30, 2023, 2022 and 2021, our effective tax rate was impacted by, among other factors, tax credits of $20.3 million, $12.1 million, and $12.1 million, respectively. Please see Note 12 of the notes to our consolidated financial statements in this Form 10-K for details of significant items that impact our effective tax rate.\nReconciliation of Net Income (Loss) to Adjusted EBITDA\nReconciliation of Adjusted EBITDA (a non-GAAP financial measure) to total company net income (loss), the most directly comparable GAAP measure, is provided for each period discussed below. Management believes that Adjusted EBITDA assists investors in understanding and comparing core operating results and underlying business trends by eliminating many of the differences in companies' respective capitalization, tax position, level of impairments, and other non-recurring items. This non-GAAP financial measure may not be comparable to other similarly titled measures of other companies and should not be considered in isolation or as a substitute for, or superior to, financial measures prepared in accordance with GAAP.\nThe following table reconciles our net income (loss) to Adjusted EBITDA for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021 2020 2019\nNet income (loss) $ 158,611 $ 220,704 $ 122,021 $ 52,226 $ (79,520)\nExpense (benefit) from income taxes 23,936 53,267 21,501 17,664 (37,245)\nInterest amortized to home construction and land sales expenses and capitalized interest impaired 68,489 72,058 87,290 95,662 108,941\nInterest expense not qualified for capitalization - - 2,781 8,468 3,109\nEBIT 251,036 346,029 233,593 174,020 (4,715)\nDepreciation and amortization 12,198 13,360 13,976 15,640 14,759\nEBITDA 263,234 359,389 247,569 189,660 10,044\nStock-based compensation expense 7,275 8,478 12,167 10,036 10,526\nLoss (gain) on extinguishment of debt 546 (309) 2,025 - 24,920\nInventory impairments and abandonments(a)\n641 2,524 853 2,111 134,711\nLitigation settlement in discontinued operations - - 120 1,260 -\nRestructuring and severance expenses 335 - (10) 1,317 -\nAdjusted EBITDA $ 272,031 $ 370,082 $ 262,724 $ 204,384 $ 180,201\n(a) In periods during which we impaired certain of our inventory assets, capitalized interest that is impaired is included in the line above titled \"Interest amortized to home construction and land sales expenses and capitalized interest impaired.\"\nReconciliation of Total Debt to Total Capitalization Ratio to Net Debt to Net Capitalization Ratio\nReconciliation of net debt to net capitalization ratio (a non-GAAP financial measure) to total debt to total capitalization ratio, the most directly comparable GAAP measure, is provided for each period below. Management believes that net debt to net capitalization ratio is useful in understanding the leverage employed in our operations and as an indicator of our ability to obtain financing. This non-GAAP financial measure may not be comparable to other similarly titled measures of other companies and should not be considered in isolation or as a substitute for, or superior to, financial measures prepared in accordance with GAAP.\nFiscal Year Ended September 30,\nin thousands 2023 2022\nTotal debt $ 978,028 $ 983,440\nStockholders' equity 1,102,819 939,286\nTotal capitalization $ 2,080,847 $ 1,922,726\nTotal debt to total capitalization ratio 47.0 % 51.1 %\nTotal debt $ 978,028 $ 983,440\nLess: cash and cash equivalents 345,590 214,594\nNet debt 632,438 768,846\nStockholders' equity 1,102,819 939,286\nNet capitalization $ 1,735,257 $ 1,708,132\nNet debt to net capitalization ratio 36.4 % 45.0 %\nHomebuilding Operations Data\nThe following table summarizes new orders and cancellation rates by reportable segment for the periods presented:\nNew Orders, net Cancellation Rates\n2023 2022 2021 23 v 22 22 v 21 2023 2022 2021\nWest 2,244 2,437 3,233 (7.9) % (24.6) % 22.2 % 18.4 % 12.0 %\nEast 859 879 1,172 (2.3) % (25.0) % 18.8 % 16.2 % 9.6 %\nSoutheast 763 745 1,159 2.4 % (35.7) % 15.9 % 16.3 % 10.2 %\nTotal 3,866 4,061 5,564 (4.8) % (27.0) % 20.3 % 17.6 % 11.1 %\nNet new orders for the year ended September 30, 2023 decreased to 3,866, down 4.8% from the year ended September 30, 2022. The decrease in net new orders was driven primarily by a decrease in sales pace from 2.8 sales per community per month in the prior year to 2.6 and an increase in cancellation rates from 17.6% in the prior year to 20.3%, partially offset by an increase in average active community count from 120 in the prior year to 125. The decrease in net new orders was primarily attributed to the low sales pace and high cancellation rates we experienced during our fiscal first quarter as a result of a significant decline in the housing market conditions at the time. Beginning in the second fiscal quarter, sales pace and cancellation rates improved and were in line with historical standards; however, the recent increase in mortgage rates may temper sales pace in the near-term.\nThe table below summarizes backlog units by reportable segment as well as the aggregate dollar value and ASP of homes in backlog as of September 30, 2023, 2022 and 2021:\nAs of September 30,\n2023 2022 2021 23 v 22 22 v 21\nBacklog Units:\nWest 1,033 1,257 1,653 (17.8) % (24.0) %\nEast 323 410 611 (21.2) % (32.9) %\nSoutheast 355 424 522 (16.3) % (18.8) %\nTotal 1,711 2,091 2,786 (18.2) % (24.9) %\nAggregate dollar value of homes in backlog (in millions) $ 886.4 $ 1,144.9 $ 1,284.0 (22.6) % (10.8) %\nASP in backlog (in thousands) $ 518.0 $ 547.5 $ 460.9 (5.4) % 18.8 %\nBacklog reflects the number of homes for which the Company has entered into a sales contract with a customer but has not yet delivered the home. The aggregate dollar value of homes in backlog as of September 30, 2023 decreased 22.6% compared to the prior year due to an 18.2% decrease in backlog units and a 5.4% decrease in the ASP of homes in backlog. The decrease in backlog units was primarily due to lower beginning backlog and lower net new orders year-over-year.\nHomebuilding Revenue, Average Selling Price, and Closings\nThe table below summarizes homebuilding revenue, ASP of our homes closed, and closings by reportable segment for the periods presented:\nHomebuilding Revenue Average Selling Price\n$ in thousands 2023 2022 2021 23 v 22 22 v 21 2023 2022 2021 23 v 22 22 v 21\nWest $ 1,292,060 $ 1,327,770 $ 1,110,208 (2.7) % 19.6 % $ 523.5 $ 468.7 $ 377.0 11.7 % 24.3 %\nEast 503,479 555,598 565,989 (9.4) % (1.8) % 532.2 514.4 477.6 3.5 % 7.7 %\nSoutheast 402,861 419,152 451,503 (3.9) % (7.2) % 484.2 497.2 390.2 (2.6) % 27.4 %\nTotal $ 2,198,400 $ 2,302,520 $ 2,127,700 (4.5) % 8.2 % $ 517.8 $ 484.1 $ 402.4 7.0 % 20.3 %\nClosings\n2023 2022 2021 23 v 22 22 v 21\nWest 2,468 2,833 2,945 (12.9) % (3.8) %\nEast 946 1,080 1,185 (12.4) % (8.9) %\nSoutheast 832 843 1,157 (1.3) % (27.1) %\nTotal 4,246 4,756 5,287 (10.7) % (10.0) %\nWest Segment: Homebuilding revenue decreased by 2.7% for the fiscal year ended September 30, 2023 compared to the prior fiscal year due to a 12.9% decrease in closings, partially offset by a 11.7% increase in ASP. The year-over-year decrease in closings in the West segment was primarily due to lower beginning backlog, partially offset by a higher backlog conversion rate for fiscal 2023 compared to fiscal 2022.\nEast Segment: Homebuilding revenue decreased by 9.4% for the fiscal year ended September 30, 2023 compared to the prior fiscal year due to a 12.4% decrease in closings, partially offset by a 3.5% increase in ASP. The year-over-year decrease in closings in the East segment was primarily due to lower beginning backlog, partially offset by a higher backlog conversion rate for fiscal 2023 compared to fiscal 2022.\nSoutheast Segment: Homebuilding revenue decreased by 3.9% for the fiscal year ended September 30, 2023 compared to the prior fiscal year due to a 2.6% decrease in ASP as well as a decrease in closings of 1.3%. The year-over-year decrease in ASP was due to changes in pricing and product mix. The year-over-year decrease in closings in the Southeast segment is primarily due to lower beginning backlog, partially offset by a higher backlog conversion rate for fiscal 2023 compared to fiscal 2022.\nHomebuilding Gross Profit and Gross Margin\nThe following tables present our homebuilding (HB) gross profit and gross margin by reportable segment and in total. In addition, such amounts are presented excluding inventory impairments and abandonments and interest amortized to cost of sales (COS). Homebuilding gross profit is defined as homebuilding revenue less home cost of sales (which includes land and land development costs, home construction costs, capitalized interest, indirect costs of construction, estimated warranty costs, closing costs, and inventory impairments and abandonment charges).\nReconciliation of homebuilding gross profit and the related gross margin excluding impairments and abandonments and interest amortized to cost of sales (each a non-GAAP financial measure) to their most directly comparable GAAP measures is provided for each period discussed below. Management believes that this information assists investors in comparing the operating characteristics of homebuilding activities by eliminating many of the differences in companies' respective level of impairments and level of debt. These non-GAAP financial measures may not be comparable to other similarly titled measures of other companies and should not be considered in isolation or as a substitute for, or superior to, financial measures prepared in accordance with GAAP.\n$ in thousands Fiscal Year Ended September 30, 2023\nHB Gross\nProfit HB Gross\nMargin Impairments &\nAbandonments\n(I&A) HB Gross\nProfit excluding\nI&A HB Gross\nMargin\nexcluding\nI&A Interest\nAmortized to COS (Interest) HB Gross Profit excluding I&A and\nInterest HB Gross Margin excluding I&A and Interest\nWest $ 307,240 23.8 % $ 487 $ 307,727 23.8 % $ - $ 307,727 23.8 %\nEast 103,102 20.5 % 154 103,256 20.5 % - 103,256 20.5 %\nSoutheast 92,212 22.9 % - 92,212 22.9 % - 92,212 22.9 %\nCorporate & unallocated(a)\n(64,434) - (64,434) 68,489 4,055\nTotal homebuilding $ 438,120 19.9 % $ 641 $ 438,761 20.0 % $ 68,489 $ 507,250 23.1 %\n$ in thousands Fiscal Year Ended September 30, 2022\nHB Gross\nProfit HB Gross\nMargin Impairments &\nAbandonments\n(I&A) HB Gross\nProfit excluding I&A HB Gross\nMargin\nexcluding\nI&A Interest\nAmortized to COS (Interest) HB Gross Profit\nexcluding I&A and\nInterest HB Gross Margin\nexcluding I&A and\nInterest\nWest $ 353,370 26.6 % $ 289 $ 353,659 26.6 % $ - $ 353,659 26.6 %\nEast 137,937 24.8 % 143 138,080 24.9 % - 138,080 24.9 %\nSoutheast 104,341 24.9 % 663 105,004 25.1 % - 105,004 25.1 %\nCorporate & unallocated(a)\n(63,499) - (63,499) 71,619 8,120\nTotal homebuilding $ 532,149 23.1 % $ 1,095 $ 533,244 23.2 % $ 71,619 $ 604,863 26.3 %\n$ in thousands Fiscal Year Ended September 30, 2021\nHB Gross\nProfit HB Gross\nMargin Impairments &\nAbandonments\n(I&A) HB Gross\nProfit excluding I&A HB Gross\nMargin\nexcluding\nI&A Interest\nAmortized to COS\n(Interest) HB Gross Profit\nexcluding I&A and\nInterest HB Gross Margin\nexcluding I&A and\nInterest\nWest $ 270,671 24.4 % $ - $ 270,671 24.4 % $ - $ 270,671 24.4 %\nEast 125,928 22.2 % 465 126,393 22.3 % - 126,393 22.3 %\nSoutheast 98,525 21.8 % 388 98,913 21.9 % - 98,913 21.9 %\nCorporate & unallocated(a)\n(93,404) - (93,404) 87,037 (6,367)\nTotal homebuilding $ 401,720 18.9 % $ 853 $ 402,573 18.9 % $ 87,037 $ 489,610 23.0 %\n(a) Corporate and unallocated includes capitalized interest and capitalized indirect costs expensed to homebuilding cost of sale related to homes closed, as well as capitalized interest and capitalized indirect costs impaired in order to reflect projects in progress assets at fair value.\nOur homebuilding gross profit decreased by $94.0 million to $438.1 million for the fiscal year ended September 30, 2023, compared to $532.1 million in the prior year. The decrease in homebuilding gross profit was primarily driven by a decrease in homebuilding revenue of $104.1 million and a decrease in gross margin of 320 basis points to 19.9%. However, as shown in the tables above, the comparability of our gross profit and gross margin was modestly impacted by impairments and abandonment charges which decreased by $0.5 million and interest amortized to homebuilding cost of sales which decreased by $3.1 million year-over-year (refer to Note 4 and Note 5 of the notes to the consolidated financial statements in this Form 10-K for additional details). When excluding the impact of impairments and abandonment charges and interest amortized to homebuilding cost of sales, homebuilding gross profit decreased by $97.6 million compared to the prior year while homebuilding gross margin decreased by 320 basis points to 23.1%. The year-over-year decrease in gross margin for the fiscal year ended September 30, 2023 was primarily driven by an increase in price concessions and closing cost incentives including rate buydowns, as well as changes in product mix.\nWest Segment: Compared to the prior fiscal year, homebuilding gross profit decreased by $46.1 million due to the decrease in homebuilding revenue and lower gross margin. Homebuilding gross margin, excluding impairments and abandonments, decreased to 23.8%, down from 26.6% in the prior year. The decrease in gross margin was primarily driven by an increase in price concessions, and closing cost incentives including rate buydowns, as well as changes in product mix.\nEast Segment: Compared to the prior fiscal year, homebuilding gross profit decreased by $34.8 million due to a decrease in homebuilding revenue and lower gross margin. Homebuilding gross margin, excluding impairments and abandonments, decreased to 20.5%, down from 24.9% in the prior year. The decrease in gross margin was primarily driven by an increase in price concessions and closing cost incentives including rate buydowns, as well as changes in product mix.\nSoutheast Segment: Compared to the prior fiscal year, homebuilding gross profit decreased by $12.1 million due to a decrease in homebuilding revenue and lower gross margin. Homebuilding gross margin, excluding impairments and abandonments, decreased to 22.9%, down from 25.1% in the prior year. The decrease in gross margin was primarily driven by an increase in price concessions, and closing cost incentives including rate buydowns, as well as changes in product mix.\nMeasures of homebuilding gross profit and gross margin after excluding inventory impairments and abandonments, interest amortized to cost of sales, and other non-recurring items are not GAAP financial measures. These measures should not be considered alternatives to homebuilding gross profit and gross margin determined in accordance with GAAP as an indicator of operating performance.\nIn particular, the magnitude and volatility of non-cash inventory impairments and abandonment charges for the Company and other homebuilders have been significant historically and, as such, have made financial analysis of our industry more difficult. Homebuilding metrics excluding these charges, as well as interest amortized to cost of sales and other similar presentations by analysts and other companies, are frequently used to assist investors in understanding and comparing the operating characteristics of homebuilding activities by eliminating many of the differences in companies' respective level of impairments and levels of debt. Management believes these non-GAAP measures enable holders of our securities to better understand the cash implications of our operating performance and our ability to service our debt obligations as they currently exist and as additional indebtedness is incurred in the future. These measures are also useful internally, helping management to compare operating results and to measure cash available for discretionary spending.\nIn a given period, our reported gross profit is generated from both communities previously impaired and communities not previously impaired. In addition, as indicated above, certain gross profit amounts arise from recoveries of prior period costs, including warranty items that are not directly tied to communities generating revenue in the period. Home closings from communities previously impaired would, in most instances, generate very low or negative gross margins prior to the impact of the previously recognized impairment. Gross margin for each home closing is higher for a particular community after an impairment because the carrying value of the underlying land was previously reduced to the present value of future cash flows as a result of the impairment, leading to lower cost of sales at the home closing. This improvement in gross margin resulting from one or more prior impairments is frequently referred to in the aggregate as the impairment turn or flow-back of impairments within the reporting period. The amount of this impairment turn may exceed the gross margin for an individual impaired asset if the gross margin for that asset prior to the impairment would have been negative. The extent to which this impairment turn is greater than the reported gross margin for the individual asset is related to the specific historical cost basis of that individual asset.\nThe asset valuations that result from our impairment calculations are based on discounted cash flow analyses and are not derived by simply applying prospective gross margins to individual communities. As such, impaired communities may have gross margins that are somewhat higher or lower than the gross margins for unimpaired communities. The mix of home closings in any particular quarter varies to such an extent that comparisons between previously impaired and never impaired communities would not be a reliable way to ascertain profitability trends or to assess the accuracy of previous valuation estimates. In addition, since any amount of impairment turn is tied to individual lots in specific communities, it will vary considerably from period to period. As a result of these factors, we review the impairment turn impact on gross margin on a trailing 12-month basis rather than a quarterly basis as a way of considering whether our impairment calculations are resulting in gross margins for impaired communities that are comparable to our unimpaired communities. For fiscal 2023, our homebuilding gross margin was 19.9% and excluding interest and inventory impairments and abandonments, it was 23.1%. For the same period, homebuilding gross margin was as follows in those communities that have previously been impaired, which represented 87 homes and 2.0% of total closings during fiscal 2023:\nHomebuilding Gross Margin from previously impaired communities:\nPre-impairment turn gross margin (3.7) %\nImpact of interest amortized to COS related to these communities 2.7 %\nPre-impairment turn gross margin, excluding interest amortization (1.0) %\nImpact of impairment turns 23.8 %\nGross margin (post impairment turns), excluding interest amortization 22.8 %\nFor further discussion of our impairment policies, refer to Note 2 and Note 4 of the notes to consolidated financial statements in this Form 10-K.\nLand Sales and Other Revenue and Gross Profit (Loss)\nLand sales relate to land and lots sold that do not fit within our homebuilding programs and strategic plans. We also have other revenue related to title examinations provided for our homebuyers in certain markets. The following tables summarize our land sales and other revenue and related gross profit (loss) by reportable segment for the periods presented:\n$ in thousands Land Sales and Other Revenue\n2023 2022 2021 23 v 22 22 v 21\nWest $ 4,945 $ 3,783 $ 8,370 30.7 % (54.8) %\nEast 2,365 5,149 3,846 (54.1) % 33.9 %\nSoutheast 1,075 5,536 387 (80.6) % 1,330.5 %\nTotal $ 8,385 $ 14,468 $ 12,603 (42.0) % 14.8 %\n$ in thousands Land Sales and Other Gross Profit (Loss)\n2023 2022 2021 23 v 22 22 v 21\nWest $ 2,989 $ 734 $ 2,330 307.2 % (68.5) %\nEast 736 4,206 440 (82.5) % 855.9 %\nSoutheast 850 984 73 (13.6) % 1,247.9 %\nCorporate and unallocated(a)\n- (566) (308) 100.0 % (83.8) %\nTotal $ 4,575 $ 5,358 $ 2,535 (14.6) % 111.4 %\n(a) Includes capitalized interest and capitalized indirect costs expensed to land cost of sale related to land sold, as well as capitalized interest and capitalized indirect costs impaired in order to reflect land held for sale assets at net realizable value.\nFor the fiscal year ended September 30, 2023, land sales and other revenue decreased by 42.0% to $8.4 million, and land sales and other gross profit decreased by 14.6% to $4.6 million compared to the prior year. Year-over-year fluctuations in land sales and other revenue are primarily driven by the timing and volume of land and lot sales closings. Land sales and other gross profit is primarily impacted by the profitability of individual land and lot sale transactions. Future land and lot sales will depend on a variety of factors, including local market conditions, individual community performance, and changing strategic plans.\nOperating Income\nThe table below summarizes operating income by reportable segment for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021 23 v 22 22 v 21\nWest $ 205,850 $ 253,961 $ 181,303 $ (48,111) $ 72,658\nEast 65,021 102,146 84,630 (37,125) 17,516\nSoutheast 57,326 68,726 57,581 (11,400) 11,145\nCorporate and Unallocated(a)\n(150,944) (152,342) (176,645) 1,398 24,303\nOperating income $ 177,253 $ 272,491 $ 146,869 $ (95,238) $ 125,622\n(a) Includes amortization of capitalized interest, capitalization and amortization of indirect costs, impairment of capitalized interest and capitalized indirect costs, expenses related to numerous shared services functions that benefit all segments but are not allocated to the operating segments, and certain other amounts that are not allocated to our operating segments.\nOur operating income decreased by $95.2 million to $177.3 million for the year ended September 30, 2023, compared to operating income of $272.5 million for year ended September 30, 2022, primarily driven by the previously discussed decrease in gross profit, as well as an increase in SG&A expense. The dollar amount of SG&A increased by $1.6 million, or 0.6%, primarily due to higher sales and marketing costs, partially offset by lower commissions expense on lower revenue. Additionally, SG&A as a percentage of total revenue increased year-over-year by 60 basis points from 10.9% to 11.5% primarily due to the decrease in homebuilding revenue.\nWest Segment: The $48.1 million decrease in operating income compared to the prior year was primarily due to the decrease in gross profit previously discussed and higher sales and marketing expenses and other G&A expenses, partially offset by lower commissions expense on lower revenue in the segment.\nEast Segment: The $37.1 million decrease in operating income compared to the prior year was primarily due to the decrease in gross profit previously discussed and higher sales and marketing expenses, partially offset by lower commissions expense on lower revenue, and lower other G&A expenses in the segment.\nSoutheast Segment: The $11.4 million decrease in operating income compared to the prior year was primarily due to the decrease in gross profit previously discussed, partially offset by lower sales and marketing expenses and lower other G&A expenses in the segment.\nCorporate and Unallocated: Our Corporate and unallocated results include amortization of capitalized interest, capitalization and amortization of indirect costs, impairment of capitalized interest and capitalized indirect costs, expenses for various shared services functions that benefit all segments but are not allocated, including information technology, treasury, corporate finance, legal, branding and national marketing, and certain other amounts that are not allocated to our operating segments. For the fiscal year ended September 30, 2023, corporate and unallocated net expenses decreased by $1.4 million from the prior fiscal year, primarily due to lower amortization of capitalized interest to cost of sales on lower homebuilding revenue as well as lower G&A costs.\nBelow operating income, we had one noteworthy year-over-year fluctuation for the fiscal year ended September 30, 2023 compared to the prior year. Specifically, we experienced an increase in other income, net, primarily attributable to a year-over-year increase in interest received due to higher interest rates on operating cash bank accounts.\nIncome Taxes\nWe recognized income tax expense from continuing operations of $24.0 million for the fiscal year ended September 30, 2023, compared to income tax expense from continuing operations of $53.3 million and $21.5 million for our fiscal years ended September 30, 2022 and 2021, respectively. Income tax expense in our fiscal 2023, 2022 and 2021 primarily resulted from income generated in the fiscal year and permanent book/tax differences, partially offset by the generation of additional federal tax credits. Refer to Note 12 of the notes to the consolidated financial statements in this Form 10-K for a further discussion of our income taxes.\nLiquidity and Capital Resources\nOur sources of liquidity include, but are not limited to, cash from operations, proceeds from Senior Notes, our Senior Unsecured Revolving Credit Facility (the Unsecured Facility) and other bank borrowings, the issuance of equity and equity-linked securities, and other external sources of funds. Our short-term and long-term liquidity depends primarily upon our level of net income, working capital management (cash, accounts receivable, accounts payable and other liabilities), and available credit facilities.\nNet changes in cash, cash equivalents, and restricted cash are as follows for the periods presented:\nin thousands 2023 2022 2021\nNet cash provided by operating activities $ 178,057 $ 81,074 $ 31,656\nNet cash used in investing activities (29,670) (14,709) (14,189)\nNet cash used in financing activities (13,926) (88,680) (85,852)\nNet increase (decrease) in cash, cash equivalents, and restricted cash $ 134,461 $ (22,315) $ (68,385)\nOperating Activities\nNet cash provided by operating activities was $178.1 million for the fiscal year ended September 30, 2023. The primary drivers of operating cash flows are typically cash earnings and changes in inventory levels, including land acquisition and development spending. Net cash provided by operating activities during the period was primarily driven by income before income taxes of $182.5 million, which included $21.8 million of non-cash charges, partially offset by a net increase in non-inventory working capital of $11.5 million and an increase in inventory of $14.7 million resulting from land acquisition, land development, and house construction spending to support continued growth.\nNet cash provided by operating activities was $81.1 million for the fiscal year ended September 30, 2022, primarily driven by income before income taxes of $274.0 million, which included $24.0 million of non-cash charges, a net decrease in non-inventory working capital of $14.5 million, partially offset by an increase in inventory of $231.4 million resulting from land acquisition, land development, and house construction spending to support continued growth.\nInvesting Activities\nNet cash used in investing activities for the fiscal year ended September 30, 2023 was $29.7 million, primarily driven by capital expenditures for model homes and information systems infrastructure, and investments in securities.\nNet cash used in investing activities for the fiscal year ended September 30, 2022 was 14.7 million, primarily driven by capital expenditures for model homes and information systems infrastructure.\nFinancing Activities\nNet cash used in financing activities was $13.9 million for the fiscal year ended September 30, 2023, primarily driven by the repurchases of a portion of our 2025 Senior Notes, debt issuance costs for the Unsecured Facility (see Note 7), and tax payments for stock-based compensation awards vesting.\nNet cash used in financing activities was $88.7 million during the fiscal year ended September 30, 2022, primarily driven by repayment of the Senior Unsecured Term Loan (the Term Loan), repurchases of a portion of our 2025 and 2027 Senior Notes, common stock repurchases under our share repurchase program, and tax payments for stock-based compensation awards vesting.\nFinancial Position\nAs of September 30, 2023, our liquidity position consisted of $345.6 million in cash and cash equivalents and $265.0 million of remaining capacity under the Unsecured Facility, compared to $214.6 million in cash and cash equivalents and $244.5 million of remaining capacity under the Secured Revolving Credit Facility as of September 30, 2022. Meanwhile, we invested $573.1 million and $573.6 million in land acquisition and land development during fiscal years ended September 30, 2023 and September 30, 2022, respectively.\nWhile we believe we possess sufficient liquidity, we are mindful of potential short-term or seasonal requirements for enhanced liquidity that may arise to operate and grow our business. As of the date of this report, we believe we have adequate capital resources and sufficient access to external financing sources to satisfy our current and long-term liquidity needs for funds to conduct our operations and meet other needs in the ordinary course of our business, however, we are continually reviewing our capital resources to determine whether we can meet our short- and long-term goals, and we may require additional capital to do so.\nAt times, we may also engage in capital markets, bank loan, project debt or other financial transactions, including the repurchase of debt or potential new issuances of debt or equity securities to support our business needs. The amounts involved in these transactions, if any, may be material. In addition, as necessary or desirable, we may adjust or amend the terms of and/or expand the capacity of the Unsecured Facility, or enter into additional letter of credit facilities, or other similar facility arrangements, in each case with the same or other financial institutions, or allow any such facilities to mature or expire.\nDebt\nWe generally fulfill our short-term cash requirements with cash generated from our operations and available borrowings. Additionally, our Unsecured Facility provides borrowing capacity of $265.0 million, which includes a letter of credit capacity of $100.0 million. As of September 30, 2023, no borrowings and no letters of credit were outstanding under the Unsecured Facility, resulting in a remaining borrowing capacity of $265.0 million. Subsequently in October, 2023, we increased our available borrowing capacity under the Unsecured Facility from $265.0 million to $300.0 million. See Note 7 and Note 18 of the notes to the consolidated financial statements in this Form 10-K for further discussion.\nWe have also entered into a number of stand-alone letter of credit agreements with banks, secured with cash or certificates of deposit. These combined facilities provide for letter of credit needs collateralized by either cash or assets of the Company. We currently have $31.2 million of outstanding letters of credit under these facilities.\nIn the future, we may from time to time seek to continue to retire or purchase our outstanding debt through cash repurchases or in exchange for other debt securities, in open market purchases, privately negotiated transactions, or otherwise. In addition, any material variance from our projected operating results could require us to obtain additional equity or debt financing. There can be no assurance that we will be able to complete any of these transactions in the future on favorable terms or at all. See Note 7 of the notes to the consolidated financial statements in this Form 10-K for additional details related to our borrowings.\nSupplemental Guarantor Information\nAs discussed in Note 7 of the notes to the consolidated financial statements in this Form 10-K, the Company's obligations to pay principal and interest under certain debt agreements are guaranteed on a joint and several basis by substantially all of the Company's subsidiaries. Some of the immaterial subsidiaries do not guarantee the Senior Notes. The guarantees are full and unconditional. Summarized financial information is not presented for Beazer Homes USA, Inc. and the guarantor subsidiaries on a combined basis as the assets, liabilities and results of operations of the combined issuer and guarantors of the guaranteed security are not materially different than corresponding amounts presented in the consolidated financial statements of the parent company.\nCredit Ratings\nOur credit ratings are periodically reviewed by rating agencies. In August 2023, S&P upgraded the Companys corporate credit rating of B to B+, updated the Company's outlook from positive to stable, and upgraded the rating for our senior unsecured notes from B to B+. In October 2023, Moody's upgraded the rating for our senior unsecured notes from B2 to B1, upgraded the Company's issuer corporate family rating from B2 to B1, and updated the Company's outlook from positive to stable. These ratings and our current credit condition affect, among other things, our ability to access new capital. These ratings are not recommendations to buy, sell or hold debt securities. Negative changes to these ratings may result in more stringent covenants and higher interest rates under the terms of any new debt. Our credit ratings could be lowered, or rating agencies could issue adverse commentaries in the future, which could have a material adverse effect on our business, financial condition, results of operations, and liquidity. In particular, a weakening of our financial condition, including any further increase in our leverage or decrease in our profitability or cash flows, could adversely affect our ability to obtain necessary funds, could result in a credit rating downgrade or change in outlook, or could otherwise increase our cost of borrowing.\nStock Repurchases and Dividends Paid\nIn May 2022, the Company's Board of Directors approved a new share repurchase program that authorizes the Company to repurchase up to $50.0 million of its outstanding common stock. This share repurchase program replaced the prior share repurchase program, authorized in the first quarter of fiscal 2019 of up to $50.0 million of common stock repurchases, pursuant to which $12.0 million of the capacity remained prior to the replacement of the program. No share repurchases were made during fiscal years 2023 and 2021. During the fiscal year ended September 30, 2022, the Company repurchased 570 thousand shares of its common stock for $8.2 million at an average price per share of $14.33 through open market transactions. All shares have been retired upon repurchase. The aggregate reduction to stockholders equity related to share repurchases during the fiscal year ended September 30, 2022 was $8.2 million. As of September 30, 2023, the remaining availability of the share repurchase program was $41.8 million. The repurchase program has no expiration date.\nThe indentures under which our Senior Notes were issued contain certain restrictive covenants, including limitations on our payment of dividends. There were no dividends paid during our fiscal years ended September 30, 2023, 2022 or 2021.\nOff-Balance Sheet Arrangements and Aggregate Contractual Commitments\nLot Option Agreements\nIn addition to purchasing land directly, we control a portion of our land supply through lot option agreements with land developers and land bankers, which generally require the payment of cash or the posting of a letter of credit or surety bond for the right to acquire lots during a specified period of time at a specified price. In recent years, we have focused on increasing our lot option agreement usage to minimize risk as we grow our land position. As of September 30, 2023, we controlled 26,189 lots, which includes 272 lots of land held for future development and 350 lots of land held for sale. Of the 25,567 total active lots, we controlled 14,490 of these lots, or 56.7%, through option agreements, as compared to 13,312 active lots controlled, or 54.6% of our total active lots, through option agreements as of September 30, 2022. Lot option agreements allow us to position for future growth while providing the flexibility to respond to market conditions by renegotiating the terms of the options prior to exercise or terminating the agreement.\nUnder option agreements, purchase of the properties is contingent upon satisfaction of certain requirements by us and the sellers, and our liability is generally limited to forfeiture of the non-refundable deposits, letters of credit or surety bonds, and other non-refundable amounts incurred, which totaled $165.4 million as of September 30, 2023. The total remaining purchase price, net of cash deposits, committed under all options was $949.4 million as of September 30, 2023. Subject to market conditions and our liquidity, we may further expand our use of option agreements to supplement our owned inventory supply.\nWe expect to exercise, subject to market conditions and seller satisfaction of contract terms, most of our option agreements. Various factors, some of which are beyond our control, such as market conditions, weather conditions, and the timing of the completion of development activities, will have a significant impact on the timing of option exercises or whether lot options will be exercised at all.\nWe have historically funded the exercise of lot options with operating cash flows. We expect these sources to continue to be adequate to fund anticipated future option exercises. Therefore, we do not anticipate that the exercise of our lot options will have a material adverse effect on our liquidity.\nLetters of Credit and Surety Bonds\nIn connection with the development of our communities, we are frequently required to provide performance, maintenance, and other bonds and letters of credit in support of our related obligations with respect to such developments. The amount of such obligations outstanding at any time varies in accordance with our pending development activities. In the event any such bonds or letters of credit are drawn upon, we would be obligated to reimburse the issuer of such bonds or letters of credit. We had outstanding letters of credit and surety bonds of $31.2 million and $254.2 million, respectively, as of September 30, 2023, primarily related to our obligations to local governments to construct roads and other improvements in various developments.\nContractual Commitments\nThe following table summarizes our aggregate contractual commitments as of September 30, 2023:\nPayments Due by Period\nin thousands Total Less than 1 Year 1-3 Years 3-5 Years More than 5 Years\nSenior notes and junior subordinated notes(a)\n$ 1,010,223 $ - $ 202,195 $ 357,255 $ 450,773\nInterest commitments under senior notes and junior subordinated notes(b)\n362,538 68,154 115,838 88,025 90,521\nObligations related to lots under option 949,447 415,842 419,236 107,204 7,165\nOperating leases 24,161 4,123 7,394 4,677 7,967\nUncertain tax positions(c)\n- - - - -\nTotal $ 2,346,369 $ 488,119 $ 744,663 $ 557,161 $ 556,426\n(a) For a listing of our borrowings, refer to Note 7 of the notes to the consolidated financial statements in this Form 10-K.\n(b) Interest on variable rate obligations is based on rates effective as of September 30, 2023.\n(c) Based on its current inventory of uncertain tax positions and tax carryforward attributes, the Company does not expect a cash settlement of unrecognized tax benefits related to uncertain tax positions in future years. See Note 12 of the notes to the consolidated financial statements in this Form 10-K for additional information regarding the Company's unrecognized tax benefits related to uncertain tax positions as of September 30, 2023.\nWe had outstanding letters of credit and surety bonds of $31.2 million and $254.2 million, respectively, as of September 30, 2023, primarily related to our obligations to local governments to construct roads and other improvements in various developments.\nCritical Accounting Estimates\nOur critical accounting policies require the use of judgment in their application and in certain cases require estimates of inherently uncertain matters. Although our accounting policies are in compliance with accounting principles generally accepted in the United States of America (GAAP), a change in the facts and circumstances of the underlying transactions could significantly change the application of the accounting policies and the resulting financial statement impact. Listed below are those policies that we believe are critical and require the use of complex judgment in their application.\nInventory Valuation - Projects in Progress\nProjects in progress inventory includes homes under construction and land under development grouped together as communities. Generally, upon the commencement of land development activities, it may take three to five years (depending on, among other things, the size of the community and its sales pace) to fully develop, sell, construct and close all the homes in a typical community. Projects in progress are stated at cost unless facts and circumstances indicate that the carrying value of the assets may not be recoverable.\nWe assess our projects in progress inventory for indicators of impairment at the community level on a quarterly basis. We evaluate, among other things, the average sales price and margins on recent home closings, homes in backlog and expected future home sales for each community. If indicators of impairment are present for a community with more than ten homes remaining to close, we perform a recoverability test by comparing the expected undiscounted cash flows for the community to its carrying value. For those communities whose carrying values exceed the aggregate undiscounted cash flows, we perform a discounted cash flow analysis to determine the fair value of the community, and impairment charges are recorded if the fair value of the community's inventory is less than its carrying value.\nThere is uncertainty associated with preparing the undiscounted cash flow analyses because future market conditions will almost certainly be different, either better or worse, than current conditions. Significant valuation assumptions include expected pace of closings, average sales price, expected costs for land development, direct construction, overhead, and interest. The risk of over or under-stating any of the important cash flow variables is greater with longer-lived communities and within markets that have historically experienced greater home price volatility. To address these risks, we consider home price and construction cost appreciation in future years for certain communities that are expected to be selling for more than a year and/or if the market has typically exhibited high levels of price volatility. Absent these assumptions on cost and sales price appreciation, we believe the long-term cash flow analysis would be unrealistic. Finally, we also ensure that the pace of sales and closings used in our undiscounted cash flow analyses are reasonable by considering seasonal variations in sales and closings, our development schedules and what we have achieved historically, and by comparing to those achieved by our competitors for comparable communities.\nThe fair value of the community is estimated based on the present value of the estimated future cash flows using discount rates commensurate with the risk associated with the underlying community. The discount rate used may be different for each community. The factors considered when determining an appropriate discount rate for a community include, among others: (1) community specific factors such as product types, development stage and expected duration of the project, and the competitive factors influencing the sales performance of the community and (2) local market factors such as employment levels, consumer confidence and the existing supply of new and used homes for sale. The assumptions used in the determination of fair value of projects in progress communities are based on factors known to us at the time such estimates are made and our expectations of future operations and market conditions. Due to uncertainties in the estimation process, the significant volatility in market conditions, the long life cycles of many communities, and potential changes in our strategy related to certain communities, actual results could differ significantly from our estimates.\nWarranty Reserves\nThe adequacy of our warranty reserves is based on historical experience and management's estimate of the costs to remediate any claims. Our review includes a quarterly analysis of the historical data and trends in warranty expense by division. An analysis by division allows us to consider market specific factors such as our warranty experience, the number of home closings, the prices of homes, product mix, and other data in estimating our warranty reserves. In addition, our analysis also factors in the existence of any non-recurring or community-specific warranty matters that might not be contemplated in our historical data and trends that may need to be separately estimated based on management's judgment of the ultimate cost of repair for that specific issue.\nAt September 30, 2023, our warranty reserve was $13.0 million, reflecting an accrual range of 0.3% to 1.0% of total revenue recognized for each home closed depending on our loss history in the division in which the home was built. A ten basis point increase in our warranty reserve rate would have increased our accrual and corresponding cost of sales by $2.3 million as of September 30, 2023.\nThere were no material changes in assumptions in calculating our reserve balance for the year ended September 30, 2023.\nOur estimation process is discussed in Note 8 of notes to the consolidated financial statements in this Form 10-K. While we believe that our current warranty reserves are adequate, there can be no assurances that historical data and trends will accurately predict our actual warranty costs or that future developments might not lead to a significant change in the reserve.\nIncome Taxes - Valuation Allowance\nThe carrying amounts of deferred tax assets are reduced by a valuation allowance if an assessment of their components indicates that it is more likely than not that all or some portion of these assets will not be realized. Judgment is required in estimating valuation allowances for deferred tax assets. The realization of a deferred tax asset ultimately depends on the existence of sufficient taxable income in either the carryback or carryforward periods under tax law. We assess the need for valuation allowances for deferred tax assets based on more-likely-than-not realization threshold criteria. In our assessment, appropriate consideration is given to all positive and negative evidence related to the realization of the deferred tax assets. This assessment considers, among other matters, (1) the nature, frequency and severity of any current and cumulative losses; (2) forecasts of future profitability; (3) the duration of statutory carryforward periods; (4) our experience with operating loss and tax credit carryforwards not expiring unused; (5) the Section 382 limitation on our ability to carryforward pre-ownership change net operating losses; (6) recognized built-in losses or deductions; and (7) tax planning alternatives.\nOur assessment of the need for the valuation of deferred tax assets includes assessing the likely future tax consequences of events that have been recognized in our financial statements or tax returns. We base our estimate of deferred tax assets and liabilities on current tax laws and rates and, in certain cases, business plans and other expectations about future outcomes. Changes in existing tax laws or rates could affect actual tax results and future business results may affect the amount of deferred tax liabilities or the valuation of deferred tax assets over time. Our analysis includes several scenarios with both increases and decreases in our estimates of operating income across future periods. Routine or cyclical reductions in our pre-tax earnings would not have changed our assessment of our ability to utilize various tax carryforwards. In addition to various company-specific factors, we consider several positive and negative external factors that may impact our estimates. These factors may include broad economic considerations such as mortgage interest rates, the relative health of the U.S. economy and employment levels, as well as industry or market specific factors such as housing supply and demand outlook.\nIn fiscal 2023, our conclusions about our ability to more likely than not realize all of our federal and certain state tax attributes remain consistent with our prior determinations. We considered positive factors including our recent earnings levels, interest savings from our debt reduction strategies, shortage in housing supply, and our backlog. The negative factors included the overall health of the broader economy, significant increases in mortgage interest rates, and weakened housing demand.\nOur accounting for deferred tax consequences represents our best estimate of future events. It is possible there will be changes that are not anticipated in our current estimates. If those changes resulted in significant and sustained reductions in our pre-tax earnings or our utilization of existing tax carryforwards, it is likely such changes would have a material impact on our financial condition or results of operations. The nature and amounts of the various tax attributes comprising our deferred tax assets are discussed in Note 12 of notes to the consolidated financial statements in this Form 10-K. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are exposed to a number of market risks in the ordinary course of business. Our primary market risk exposure relates to fluctuations in interest rates. We do not believe that our exposure in this area is material to our cash flows or results of operations. As of September 30, 2023, we had variable rate debt outstanding, totaling $74.3 million. A one percent increase in the interest rate for these notes would result in an increase in our interest expense of approximately $1.0 million over the next twelve-month period. The estimated fair value of our fixed rate debt as of September 30, 2023 was $858.5 million, compared to a carrying amount of $903.7 million. The effect of a hypothetical one-percentage point decrease in our estimated discount rates would increase the estimated fair value of the fixed rate debt instruments from $858.5 million to $889.1 million as of September 30, 2023. Item 8. Financial Statements and Supplementary Data\nBEAZER HOMES USA, INC.\nCONSOLIDATED BALANCE SHEETS\nin thousands (except share and per share data) September 30,\n2023 September 30,\nASSETS\nCash and cash equivalents $ 345,590 $ 214,594\nRestricted cash 40,699 37,234\nAccounts receivable (net of allowance of $284 and $284, respectively)\n45,598 35,890\nIncome tax receivable - 9,606\nOwned inventory 1,756,203 1,737,865\nDeferred tax assets, net 133,949 156,358\nProperty and equipment, net 31,144 24,566\nOperating lease right-of-use assets 17,398 9,795\nGoodwill 11,376 11,376\nOther assets 29,076 14,679\nTotal assets $ 2,411,033 $ 2,251,963\nLIABILITIES AND STOCKHOLDERS EQUITY\nTrade accounts payable $ 154,256 $ 143,641\nOperating lease liabilities 18,969 11,208\nOther liabilities 156,961 174,388\nTotal debt (net of debt issuance costs of $5,759 and $7,280, respectively)\n978,028 983,440\nTotal liabilities 1,308,214 1,312,677\nStockholders equity:\nPreferred stock (par value $0.01 per share, 5,000,000 shares authorized, no shares issued)\n- -\nCommon stock (par value $0.001 per share, 63,000,000 shares authorized, 31,351,434 issued and outstanding and 30,880,138 issued and outstanding, respectively)\n31 31\nPaid-in capital 864,778 859,856\nRetained earnings 238,010 79,399\nTotal stockholders equity 1,102,819 939,286\nTotal liabilities and stockholders equity $ 2,411,033 $ 2,251,963\nSee accompanying notes to consolidated financial statements.\nBEAZER HOMES USA, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFiscal Year Ended September 30,\nin thousands (except per share data) 2023 2022 2021\nTotal revenue $ 2,206,785 $ 2,316,988 $ 2,140,303\nHome construction and land sales expenses 1,763,449 1,776,518 1,735,195\nInventory impairments and abandonments 641 2,963 853\nGross profit 442,695 537,507 404,255\nCommissions 73,450 74,336 80,125\nGeneral and administrative expenses 179,794 177,320 163,285\nDepreciation and amortization 12,198 13,360 13,976\nOperating income 177,253 272,491 146,869\n(Loss) gain on extinguishment of debt, net (546) 309 (2,025)\nOther income (expense), net 5,939 1,189 (1,118)\nIncome from continuing operations before income taxes 182,646 273,989 143,726\nExpense from income taxes 23,958 53,271 21,546\nIncome from continuing operations 158,688 220,718 122,180\nLoss from discontinued operations, net of tax (77) (14) (159)\nNet income $ 158,611 $ 220,704 $ 122,021\nWeighted-average number of shares:\nBasic 30,353 30,432 29,954\nDiluted 30,747 30,796 30,437\nBasic income (loss) per share:\nContinuing operations $ 5.23 $ 7.25 $ 4.08\nDiscontinued operations - - (0.01)\nTotal $ 5.23 $ 7.25 $ 4.07\nDiluted income per share:\nContinuing operations $ 5.16 $ 7.17 $ 4.01\nDiscontinued operations - - -\nTotal $ 5.16 $ 7.17 $ 4.01\nSee accompanying notes to consolidated financial statements.\nBEAZER HOMES USA, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' EQUITY\nCommon Stock Paid-in Capital (Accumulated Deficit) Retained Earnings\nin thousands Shares Amount Total\nBalance as of September 30, 2020 31,012 $ 31 $ 856,466 $ (263,326) $ 593,171\nNet income and comprehensive income - - - 122,021 122,021\nStock-based compensation expense - - 12,167 - 12,167\nStock option exercises 198 - 569 - 569\nShares issued under employee stock plans, net 417 - - - -\nForfeiture and other settlements of restricted stock (29) - - - -\nCommon stock redeemed for tax liability (304) - (3,044) - (3,044)\nBalance as of September 30, 2021 31,294 $ 31 $ 866,158 $ (141,305) $ 724,884\nNet income and comprehensive income - - - 220,704 220,704\nStock-based compensation expense - - 8,478 - 8,478\nStock option exercises 1 - 5 - 5\nShares issued under employee stock plans, net 518 - - - -\nForfeiture and other settlements of restricted stock (55) - - - -\nCommon stock redeemed for tax liability (308) - (6,631) - (6,631)\nShare repurchases (570) - (8,154) - (8,154)\nOther activity - $ - $ - $ - $ -\nBalance as of September 30, 2022 30,880 $ 31 $ 859,856 $ 79,399 $ 939,286\nNet income and comprehensive income - - - 158,611 158,611\nStock-based compensation expense - - 7,275 - 7,275\nStock option exercises 14 - 262 - 262\nShares issued under employee stock plans, net 675 - - - -\nForfeiture and other settlements of restricted stock (12) - - - -\nCommon stock redeemed for tax liability (206) - (2,615) - (2,615)\nBalance as of September 30, 2023 31,351 $ 31 $ 864,778 $ 238,010 $ 1,102,819\nSee accompanying notes to consolidated financial statements.\nBEAZER HOMES USA, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nCash flows from operating activities:\nNet income $ 158,611 $ 220,704 $ 122,021\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 12,198 13,360 13,976\nStock-based compensation expense 7,275 8,478 12,167\nInventory impairments and abandonments 641 2,963 853\nDeferred and other income tax expense 23,936 53,267 21,501\nLoss (gain) on disposal of fixed assets 1,113 (332) (392)\nChange in allowance for doubtful accounts - (6) (68)\nLoss (gain) on extinguishment of debt, net 546 (309) 2,025\nChanges in operating assets and liabilities:\nIncrease in accounts receivable (9,708) (10,199) (5,800)\nDecrease in income tax receivable 9,987 - 460\nIncrease in inventory (14,749) (231,445) (147,511)\nIncrease in other assets (2,784) (2,761) (2,384)\nIncrease in trade accounts payable 10,615 10,250 1,199\n(Decrease) increase in other liabilities (19,624) 17,104 13,609\nNet cash provided by operating activities 178,057 81,074 31,656\nCash flows from investing activities:\nCapital expenditures (20,334) (15,048) (14,645)\nProceeds from sale of fixed assets 445 339 456\nPurchases of investment securities (9,779) - -\nOther (2) - -\nNet cash used in investing activities (29,670) (14,709) (14,189)\nCash flows from financing activities:\nRepayment of debt (8,998) (73,900) (82,476)\nRepayment of borrowings from credit facility - (195,000) -\nBorrowings from credit facility - 195,000 -\nDebt issuance costs (2,575) - (901)\nRepurchase of common stock - (8,154) -\nTax payments for stock-based compensation awards (2,615) (6,631) (3,044)\nStock option exercises 262 5 569\nNet cash used in financing activities (13,926) (88,680) (85,852)\nNet increase (decrease) in cash, cash equivalents, and restricted cash 134,461 (22,315) (68,385)\nCash, cash equivalents, and restricted cash at beginning of period 251,828 274,143 342,528\nCash, cash equivalents, and restricted cash at end of period $ 386,289 $ 251,828 $ 274,143\nSee accompanying notes to consolidated financial statements.\nBEAZER HOMES USA, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(1) Description of Business\nBeazer Homes USA, Inc. (we, us, our, Beazer, Beazer Homes and the Company) is a geographically diversified homebuilder with active operations in 13 states within three geographic regions in the United States: the West, East, and Southeast.\nOur homes are designed to appeal to homeowners at different price points across various demographic segments, and are generally offered for sale in advance of their construction. Our objective is to provide our customers with homes that incorporate extraordinary value at an affordable price, delivered through our three strategic pillars of Mortgage Choice, Choice Plans®, and Surprising Performance, while seeking to maximize our investment returns over the course of a housing cycle.\n(2) Basis of Presentation and Summary of Significant Accounting Policies\nBasis of Consolidation\nThe accompanying consolidated financial statements of the Company have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP), and present the consolidated financial position, income, stockholders' equity, and cash flows of Beazer Homes USA, Inc. and its consolidated subsidiaries. Intercompany transactions and balances have been eliminated in consolidation. Our net income is equivalent to our comprehensive income, so we have not presented a separate statement of comprehensive income.\nIn the past, we have discontinued homebuilding operations in various markets. Results from certain of these exited markets are reported as discontinued operations in the accompanying consolidated statements of operations for all periods presented.\nOur fiscal year 2023 began on October 1, 2022 and ended on September 30, 2023. Our fiscal year 2022 began on October 1, 2021 and ended on September 30, 2022. Our fiscal year 2021 began on October 1, 2020 and ended on September 30, 2021.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make informed estimates and judgments that affect the amounts reported in the consolidated financial statements and accompanying notes. Accordingly, actual results could differ from these estimates.\nCash and Cash Equivalents and Restricted Cash\nWe consider highly liquid investments with maturities of three months or less when acquired to be cash equivalents. As of September 30, 2023, the majority of our cash and cash equivalents were on demand deposits with major banks. These assets were valued at par and had no withdrawal restrictions. Restricted cash includes cash restricted by state law or a contractual requirement, including cash collateral for our outstanding cash-secured letters of credit (refer to Note 7).\nAccounts Receivable and Allowance\nAccounts receivable include receivables from municipalities related to the development of utilities or other infrastructure, land banker reimbursements to be received related to land development costs, rebates to be received from our suppliers, escrow proceeds to be received from title companies associated with closed homes, and other miscellaneous receivables. Generally, we receive cash from title companies within a few days of the home being closed. We regularly review our receivable balances for collectability and record an allowance for expected credit losses.\nOwned Inventory\nOwned inventory includes land acquisition costs, land development costs, home construction costs, capitalized interest, real estate taxes, direct overhead costs and capitalized indirect costs incurred during land development and home construction, and common costs that benefit the entire community, less impairments, if any. Land acquisition, land development and other common costs (both incurred and estimated to be incurred) are allocated to individual lots on a pro-rata basis, and the cost of individual lots is transferred to homes under construction when home construction begins. Changes in estimated land and other common costs to be incurred in a community are generally allocated to the remaining lots on a prospective basis. Home construction costs are accumulated on a per-home basis. Cost of home closings includes the specific construction costs of the home and the allocated lot costs. Refer to Note 4 for further discussion of our inventory balance.\nInventory Valuation - Projects in Progress\nProjects in progress inventory includes homes under construction and land under development grouped together as communities. Generally, upon the commencement of land development activities, it may take three to five years (depending on, among other things, the size of the community and its sales pace) to fully develop, sell, construct and close all the homes in a typical community. Projects in progress are stated at cost unless facts and circumstances indicate that the carrying value of the assets may not be recoverable.\nWe assess our projects in progress inventory for indicators of impairment at the community level on a quarterly basis. We evaluate, among other things, the average sales price and margins on recent home closings, homes in backlog and expected future home sales for each community. If indicators of impairment are present for a community with more than ten homes remaining to close, we perform a recoverability test by comparing the expected undiscounted cash flows for the community to its carrying value. This undiscounted cash flow analysis requires important assumptions including, among other things, the current and future home sale prices, margins and the pace of closings to occur in the future. For those communities whose carrying values exceed the aggregate undiscounted cash flows, we perform a discounted cash flow analysis to determine the fair value of the community, and impairment charges are recorded if the fair value of the community's inventory is less than its carrying value.\nThe assumptions used in the determination of fair value of projects in progress communities are based on factors known to us at the time such estimates are made and our expectations of future operations and market conditions. The fair value of the community is estimated using the present value of the estimated future cash flows using discount rates commensurate with the risk associated with the underlying community. Should the estimates or expectations used in determining estimated fair values deteriorate in the future, we may be required to recognize additional impairment charges and write-offs related to these assets, and such amounts could be material.\nInventory Valuation - Land Held for Future Development\nLand held for future development consists of communities for which construction and development activities are expected to occur in the future or have been idled. All applicable carrying costs, such as interest and real estate taxes, are expensed as incurred. Land held for future development is stated at cost unless facts and circumstances indicate that the carrying value of the assets may not be recoverable, such as the future enactment of a development plan or the occurrence of outside events. We evaluate the potential plans for each community in land held for future development if changes in facts and circumstances occur that would give rise to a more detailed analysis for a change in the status of a community.\nInventory Valuation - Land Held for Sale\nLand held for sale includes land and lots that do not fit within our homebuilding programs and strategic plans in certain markets. We record land held for sale at the lower of the asset's carrying value or fair value less costs to sell (net realizable value). Land is classified as held for sale when the following criteria are met:\nmanagement has the authority and commits to a plan to sell the land;\nthe land is available for immediate sale in its present condition, subject only to terms that are usual and customary for sales of land assets;\nthere is an active program to locate a buyer and the plan to sell the property has been initiated;\nthe sale of the land is probable within one year;\nthe property is being actively marketed at a reasonable sale price relative to its current fair value; and\nit is unlikely that the plan to sell will be withdrawn or that significant changes to the plan will be made.\nWe evaluate the net realizable value of a land held for sale asset when indicators of impairment are present. In determining the fair value of the assets less cost to sell, we consider factors including current sales prices for comparable assets in the area, recent market analysis studies, appraisals, any recent legitimate offers and listing prices of similar properties. If the current carrying value of the asset exceeds the estimated fair value less cost to sell, the asset is impaired and written down to its estimated fair value less cost to sell.\nDue to uncertainties in the estimation process, it is reasonably possible that actual results could differ from the estimates used in our analysis. Our assumptions about land sales prices require significant judgment because the market is highly sensitive to changes in economic conditions. We calculate the estimated fair values of land held for sale based on current market conditions\nand assumptions made by management, which may differ materially from actual results and may result in additional impairments if market conditions deteriorate.\nLot Option Agreements and Variable Interest Entities (VIE)\nIn addition to purchasing land directly, we utilize lot option agreements that enable us to defer acquiring portions of properties owned by third parties and unconsolidated entities until we have determined whether to exercise our lot option. The majority of our lot option agreements require a non-refundable cash deposit or issuance of a letter of credit or surety bond based on a percentage of the purchase price of the land for the right to acquire lots during a specified period at a specified price. Purchase of the properties under these agreements is contingent upon satisfaction of certain requirements by us and the sellers. Under lot option agreements, our liability is generally limited to forfeiture of the non-refundable deposits, letters of credit or surety bonds, and other non-refundable amounts incurred. If the Company cancels a lot option agreement, it would result in a write-off of the related deposits and pre-acquisition costs, but would not expose the Company to the overall risks or losses of the applicable entity we are purchasing from. We expect to exercise, subject to market conditions and seller satisfaction of contract terms, most of our remaining option agreements. Various factors, some of which are beyond our control, such as market conditions, weather conditions, and the timing of the completion of development activities, will have a significant impact on the timing of option exercises or whether lot options will be exercised at all.\nThe following table provides a summary of our interests in lot option agreements as of September 30, 2023 and 2022:\nSeptember 30, 2023 September 30, 2022\nin thousands\nDeposits and non-refundable pre-acquisition costs incurred(a)\n$ 165,371 $ 142,433\nRemaining purchase price if lot option agreements are exercised $ 949,447 $ 827,600\n(a) Amount is included as a component of land under development within our owned inventory in the consolidated balance sheets.\nIn accordance with Accounting Standards Codification (ASC) Topic 810, Consolidation (ASC 810), if the entity holding the land under option is a VIE, the Company's deposit represents a variable interest in that entity. ASC 810 requires a company to consolidate a VIE if the company is determined to be the primary beneficiary. To determine whether we are the primary beneficiary of the VIE, we first evaluate whether we have the ability to control the activities of the VIE that most significantly impact its economic performance. Such activities include, but are not limited to, (1) the ability to determine the budget and scope of land development work, if any; (2) the ability to control financing decisions for the VIE; (3) the ability to acquire additional land into the VIE or dispose of land in the VIE not under contract with Beazer; and (4) the ability to change or amend the existing option agreement with the VIE. If we are not determined to control such activities, we are not considered the primary beneficiary of the VIE and thus do not consolidate the VIE. If we do have the ability to control such activities, we will continue our analysis by determining if we are expected to absorb a potentially significant amount of the VIE's losses or, if no party absorbs the majority of such losses, if we will benefit from potentially a significant amount of the VIE's expected gains.\nIf we are the primary beneficiary of the VIE, we will consolidate the VIE even though creditors of the VIE have no recourse against the Company. For those we consolidate, we record the remaining contractual purchase price under the applicable lot option agreement, net of option deposits already paid, to consolidated inventory not owned with an offsetting increase to obligations related to consolidated inventory not owned on our consolidated balance sheets. Also, to reflect the total purchase price of this inventory on a consolidated basis, we present the related option deposits as consolidated inventory not owned. No VIEs required consolidation as of September 2023 and 2022 because we have determined that we were not the primary beneficiary of any VIEs.\nProperty and Equipment, Net\nOur property and equipment is recorded at cost, net of accumulated depreciation. Depreciation is computed on a straight-line basis based on estimated useful lives as follows:\nAsset Class Useful Lives\nBuildings and improvements 25 - 30 years\nInformation systems Lesser of estimated useful life of the asset or 5 years\nFurniture, fixtures and computer and office equipment 3 - 7 years\nModel and sales office improvements Lesser of estimated useful life of the asset or estimated life of the community\nLeasehold improvements Lesser of the lease term or the estimated useful life of the asset\nGoodwill\nGoodwill represents the excess of the purchase price over the fair value of the identifiable net assets from the businesses that we acquire. The Company's entire goodwill balance is recorded in our Southeast reportable segment. The Company evaluates goodwill for impairment at the reporting unit level annually during the fourth quarter or more often if indicators of impairment exist.\nThe Company has the option to perform a qualitative or quantitative assessment to determine whether the fair value of a reporting unit exceeds its carrying value. Qualitative factors may include, but are not limited to, economic conditions, industry and market considerations, cost factors, overall financial performance of the reporting unit and other entity and reporting unit specific events. If after assessing these qualitative factors, the Company determines it is more likely than not that the fair value of the reporting unit is less than the carrying value, then a quantitative assessment is performed.\nThe fair value of the reporting unit is estimated using a combination of the income approach, utilizing the discounted cash flow method, and the market approach, utilizing readily available market valuation multiples. If the estimated fair value of the reporting unit is less than its carrying value, an impairment will be recognized for the amount by which the carrying amount exceeds the reporting units fair value. Determining the fair value of a reporting unit under the quantitative goodwill impairment assessment requires the Company to make estimates and assumptions regarding future operating results, cash flows (including timing), discount rates, expected growth rates, capital expenditures and cost of capital, similar to those a market participant would use to assess fair value. We also make certain assumptions about future economic conditions and other data. Many of the factors used in assessing fair value are outside the control of management, and these assumptions and estimates may change in future periods.\nDuring the fourth quarter of 2023, the Company performed its annual goodwill impairment analysis and concluded our goodwill was not impaired.\nOther Assets\nOur other assets principally include prepaid expenses, assets related to our deferred compensation plan (refer to Note 14 for a discussion of our deferred compensation plan), investment securities, unamortized debt issuance costs on our Senior Unsecured Revolving Credit Facility, and certificates of deposit used to secure our stand-alone letters of credit facilities (refer to Note 7 for a discussion of our credit facilities) .\nOther Liabilities\nOur other liabilities principally include accrued compensations and benefits, accrued interest on our outstanding borrowings, customer deposits, warranty reserves, litigation accruals, income tax liabilities and other accruals related to our operations. Refer to Note 11 for details of our other liabilities.\nIncome Taxes\nOur provision for income taxes is comprised of taxes that are currently payable and deferred taxes that relate to temporary differences between financial reporting carrying values and tax bases of assets and liabilities. Deferred tax assets and liabilities result from deductible or taxable amounts in future years when such assets and liabilities are recovered or settled, and are measured using the enacted tax rates and laws that are expected to be in effect when the assets and liabilities are recovered or settled. We include any estimated interest and penalties on tax related matters in income taxes payable. We recognize the effect of income tax positions only if those positions are more likely than not of being sustained. Recognized income tax positions are measured at the largest amount that is greater than 50% likely of being realized. We record interest and penalties related to unrecognized tax benefits in income tax expense within our consolidated statements of operations. Changes in recognition of measurement are recorded in the period in which the change in judgment occurs. Refer to Note 12 for a detailed discussion of our tax provision, deferred tax assets and valuation allowance.\nOur income tax receivable for fiscal 2022 included the refundable portion of our alternative minimum tax (AMT) credit. We received payment of $9.2 million AMT credit refund as well as interest payment of $0.4 million during our fiscal 2023.\nRevenue Recognition\nWe recognize revenue upon the transfer of promised goods to our customers in an amount that reflects the consideration to which we expect to be entitled by applying the process specified in ASC Topic 606, Revenue from Contracts with Customers.\nThe following table presents our total revenue disaggregated by revenue stream:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nHomebuilding revenue $ 2,198,400 $ 2,302,520 $ 2,127,700\nLand sales and other revenue 8,385 14,468 12,603\nTotal revenue(a)\n$ 2,206,785 $ 2,316,988 $ 2,140,303\n(a) Please see Note 17 for total revenue disaggregated by reportable segment.\nHomebuilding revenue\nHomebuilding revenue is reported net of discounts and is generally recognized when title to and possession of the home is transferred to the buyer at the closing date. The performance obligation to deliver the home is generally satisfied in less than one year from the original contract date. Home sale contract assets consist of cash from home closings held by title companies in escrow for our benefit, typically for less than five days, and are considered accounts receivable. Contract liabilities include customer deposits related to sold but undelivered homes and totaled $27.6 million and $34.3 million as of September 30, 2023 and 2022, respectively. Of the customer liabilities outstanding as of September 30, 2022, $29.2 million was recognized in revenue during the fiscal year ended September 30, 2023 upon closing of the related homes, and $4.6 million was refunded to or forfeited by the buyer.\nLand sales and other revenue\nLand sales revenue relates to land that does not fit within our homebuilding programs and strategic plans. Land sales typically require cash consideration on the closing date, which is generally when performance obligations are satisfied. We also provide title examinations for our homebuyers in certain markets. Revenues associated with our title operations are recognized when closing services are rendered and title insurance policies are issued, both of which generally occur as each home is closed.\nHome Construction Expenses\nHome construction expenses includes the specific construction costs of the home and the allocated lot costs (land acquisition, land development and other common costs are allocated to individual lots on a pro-rata basis based on the number of lots remaining to close within the community). All home closing costs are charged to home construction expenses in the period when the revenues from home closing are recognized.\nSales discounts and incentives include discounts on home prices, discounts on home building options and option upgrades, and seller-paid financing or closing costs, including rate buydowns. Home price discounts and option discounts are accounted for as a reduction in the sale price of the home, thereby decreasing the amount of revenue we recognize on that closing. All other sales incentives are recognized as a cost of selling the home and are included in home construction expenses.\nEstimated future warranty costs are charged to home construction expense in the period when the revenues from home closings are recognized. Such estimated warranty costs generally range from 0.3% to 1.0% of total revenue recognized for each home closed. Additional warranty costs are charged to home construction expenses as necessary based on management's estimate of the costs to remediate existing claims. See Note 8 for a more detailed discussion of warranty costs and related reserves.\nAdvertising Costs\nAdvertising costs related to continuing operations of $15.1 million, $14.4 million and $14.0 million for our fiscal years 2023, 2022 and 2021, respectively, were expensed as incurred and were included in general and administrative (G&A) expenses in the consolidated statements of operations.\nFair Value Measurements\nCertain of our assets are required to be recorded at fair value on a recurring basis, for example, the fair value of our deferred compensation plan assets is based on quoted market prices (Level 1) or market-corroborated inputs (Level 2). Certain of our assets are required to be recorded at fair value on a non-recurring basis when events and circumstances indicate that the carrying value may not be recovered (Level 3). For example, we review our long-lived assets, including inventory, for recoverability when factors indicate an impairment may exist, but no less than quarterly. Fair value is based on estimated cash flows discounted for market risks associated with the long-lived assets. The fair value of certain of our financial instruments approximates their carrying amounts due to the short maturity of these assets and liabilities or the variable interest rates on such obligations. The fair value of our publicly-held debt is generally estimated based on quoted bid prices for these instruments (Level 2). Certain of our other financial liabilities are estimated by discounting scheduled cash flows through maturity or using market rates currently being offered on loans with similar terms and credit quality. See Note 9 for additional discussion of our fair value measurements.\nStock-Based Compensation\nWe use the Black-Scholes option-pricing model to value our stock option grants. Restricted stock awards with market conditions are valued using the Monte Carlo valuation method. Other restricted stock awards without market conditions are valued based on the market price of the Company's common stock on the date of the grant. In addition, we reflect the benefits of tax deductions in excess of recognized compensation cost as an operating cash outflow. Compensation cost arising from all stock-based compensation awards is recognized as expense using the straight-line method over the vesting period and is included in G&A in our consolidated statements of operations. See Note 15 for additional discussion of our stock-based compensation.\nRecent Accounting Pronouncements\nReference Rate Reform. In March 2020, the FASB issued ASU 2020-04, Facilitation of the Effects of Reference Rate Reform on Financial Reporting (ASU 2020-04). ASU 2020-04 provides companies with optional guidance to ease the potential accounting burden associated with transitioning away from reference rates that are expected to be discontinued. This guidance is effective beginning on March 12, 2020, and all entities may elect to apply the amendments prospectively through December 31, 2022. In December 2022, the FASB issued ASU 2022-06, Deferral of the Sunset Date of Topic 848 (ASU 2022-06), to extend the temporary accounting rules under ASC Topic 848, Reference Rate Reform, from December 31, 2022 to December 31, 2024. The Company implemented its transition away from LIBOR on July 1, 2023, and the adoption of ASU 2020-04 and ASU 2022-06 did not have a material impact on its consolidated financial statements and related disclosures.\n(3) Supplemental Cash Flow Information\nThe following table presents supplemental disclosure of non-cash and cash activity as well as a reconciliation of total cash balances between the consolidated balance sheets and consolidated statements of cash flows for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nSupplemental disclosure of non-cash activity:\nIncrease in operating lease right-of-use assets(a)\n$ 10,829 $ 835 $ 2,905\nIncrease in operating lease liabilities(a)\n$ 11,276 $ 835 $ 2,905\nDerecognition of investment in unconsolidated entities(b)\n$ - $ 3,641 $ -\nSupplemental disclosure of cash activity:\nInterest payments $ 67,342 $ 70,132 $ 74,171\nIncome tax payments $ 1,956 $ 4,216 $ 3,462\nTax refunds received $ 9,987 $ - $ 1,078\nReconciliation of cash, cash equivalents and restricted cash:\nCash and cash equivalents $ 345,590 $ 214,594 $ 246,715\nRestricted cash 40,699 37,234 27,428\nTotal cash, cash equivalents, and restricted cash shown in the statement of cash flows $ 386,289 $ 251,828 $ 274,143\n(a) Represents leases renewed or additional leases commenced during the fiscal years ended September 30, 2023, 2022 and 2021.\n(b) Represents the derecognition of investment in unconsolidated entities associated with the carrying value of previously held interest in Imagine Homes upon the acquisition of substantially all of the assets of Imagine Homes during the quarter ended June 30, 2022.\n(4) Owned Inventory\nThe components of our owned inventory are as follows as of September 30, 2023 and 2022:\nin thousands September 30, 2023 September 30, 2022\nHomes under construction $ 644,363 $ 785,742\nLand under development 870,740 731,190\nLand held for future development 19,879 19,879\nLand held for sale 18,579 15,674\nCapitalized interest 112,580 109,088\nModel homes 90,062 76,292\nTotal owned inventory $ 1,756,203 $ 1,737,865\nHomes under construction include homes substantially finished and ready for delivery and homes in various stages of construction, including costs of the underlying lot, direct construction costs and capitalized indirect costs. As of September 30, 2023, we had 2,163 homes under construction, including 779 spec homes totaling $218.0 million (645 in-process spec homes totaling $162.0 million, and 134 finished spec homes totaling $56.0 million). As of September 30, 2022, we had 2,688 homes under construction, including 887 spec homes totaling $246.5 million (793 in-process spec units totaling $208.7 million, and 94 finished spec units totaling $37.8 million).\nLand under development consists principally of land acquisition, land development and other common costs. These land related costs are allocated to individual lots on a pro-rata basis, and the lot costs are transferred to homes under construction when home construction begins for the respective lots. Certain of the fully developed lots in this category are reserved by a customer deposit or sales contract.\nLand held for future development consists of communities for which construction and development activities are expected to occur in the future or have been idled and are stated at cost unless facts and circumstances indicate that the carrying value of the assets may not be recoverable. All applicable carrying costs, such as interest and real estate taxes, are expensed as incurred.\nLand held for sale includes land and lots that do not fit within our homebuilding programs and strategic plans in certain markets, and land is classified as held for sale once certain criteria are met (refer to Note 2). These assets are recorded at the lower of the carrying value or fair value less costs to sell (net realizable value).\nThe amount of interest we are able to capitalize depends on our qualified inventory balance, which considers the status of our inventory holdings. Our qualified inventory balance includes the majority of our homes under construction and land under development but excludes land held for future development and land held for sale (see Note 5 for additional information on capitalized interest).\nTotal owned inventory by reportable segment is presented in the table below as of September 30, 2023 and 2022:\nin thousands Projects in\nProgress (a)\nLand Held for Future\nDevelopment Land Held\nfor Sale Total Owned\nInventory\nSeptember 30, 2023\nWest $ 914,908 $ 3,483 $ 14,702 $ 933,093\nEast 325,395 10,888 3,201 339,484\nSoutheast 297,142 5,508 676 303,326\nCorporate and unallocated(b)\n180,300 - - 180,300\nTotal $ 1,717,745 $ 19,879 $ 18,579 $ 1,756,203\nSeptember 30, 2022\nWest $ 934,309 $ 3,483 $ 14,998 $ 952,790\nEast 313,613 10,888 - 324,501\nSoutheast 284,424 5,508 676 290,608\nCorporate and unallocated(b)\n169,966 - - 169,966\nTotal $ 1,702,312 $ 19,879 $ 15,674 $ 1,737,865\n(a) Projects in progress include homes under construction, land under development, capitalized interest, and model home categories from the preceding table.\n(b) Projects in progress amount includes capitalized interest and indirect costs that are maintained within our Corporate and unallocated segment.\nInventory Impairments\nThe following table presents, by reportable segment, our total impairment and abandonment charges for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nLand Held for Sale:\nWest $ - $ 1,303 $ -\nCorporate and unallocated(a)\n- 565 -\nTotal impairment charges on land held for sale $ - $ 1,868 $ -\nAbandonments:\nWest $ 487 $ 289 $ -\nEast 154 143 465\nSoutheast - 663 388\nTotal abandonments charges $ 641 $ 1,095 $ 853\nTotal impairment and abandonment charges $ 641 $ 2,963 $ 853\n(a) Amount represents capitalized interest and indirects balance that was impaired. Capitalized interest and indirects are maintained within our Corporate and unallocated segment.\nProjects in Progress Impairments\nWe assess our projects in progress inventory for indicators of impairment at the community level on a quarterly basis. If indicators of impairment are present for a community with more than ten homes remaining to close, we perform a recoverability test by comparing the expected undiscounted cash flows for the community to its carrying value. If the aggregate undiscounted cash flows are in excess of the carrying value, the asset is considered to be recoverable and is not impaired. If the carrying value exceeds the aggregate undiscounted cash flows, we perform a discounted cash flow analysis to determine the fair value of the community, and impairment charges are recorded if the fair value of the community's inventory is less than its carrying value.\nNo project in progress impairments were recognized during the fiscal years ended September 30, 2023, 2022 and 2021.\nLand Held for Sale Impairments\nImpairments on land held for sale generally represent write downs of these properties to net realizable value based on sales contracts, letters of intent, current market conditions and recent comparable land sale transactions, as applicable. Absent an executed sales contract, our assumptions related to land sales prices require significant judgment because the real estate market is highly sensitive to changes in economic conditions, and our estimates of sale prices could differ significantly from actual results.\nNo land held for sale impairment charges were recognized during the fiscal years ended September 30, 2023 and 2021. During the fiscal year ended September 30, 2022, we recognized $1.9 million land held for sale impairment charges related to two held for sale communities in the West segment. The fair value of land held for sale inventory is measured on a nonrecurring basis and has been determined using unobservable inputs (Level 3). The impairment-date fair value of land held for sale assets that were impaired during the fiscal year ended September 30, 2022 was $0.9 million. Refer to Note 9 for further discussion on fair value measurements and fair value hierarchy.\nAbandonments\nFrom time to time, we may determine to abandon lots or not exercise certain option agreements that are not projected to produce adequate results or no longer fit with our long-term strategic plan. Additionally, in certain limited instances, we are forced to abandon lots due to seller non-performance, or permitting or other regulatory issues that do not allow us to build on those lots. If we intend to abandon or walk away from a property, we record an abandonment charge to earnings for the non-refundable deposit amount and any related capitalized costs in the period such decision is made. During the fiscal years ended September 30, 2023, 2022 and 2021, we recognized $0.6 million, $1.1 million and 0.9 million in abandonment charges, respectively. As we grow our business in the years ahead, it is likely that the dollar value of abandonments will grow.\n(5) Interest\nInterest capitalized during the fiscal years ended September 30, 2023, 2022 and 2021 was based upon the balance of inventory eligible for capitalization. The following table presents certain information regarding interest for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nCapitalized interest in inventory, beginning of period $ 109,088 $ 106,985 $ 119,659\nInterest incurred 71,981 74,161 77,397\nCapitalized interest impaired - (439) -\nInterest expense not qualified for capitalization and included as other expense(a)\n- - (2,781)\nCapitalized interest amortized to home construction and land sales expenses(b)\n(68,489) (71,619) (87,290)\nCapitalized interest in inventory, end of period $ 112,580 $ 109,088 $ 106,985\n(a) The amount of interest capitalized depends on the qualified inventory balance, which considers the status of the Company's inventory holdings. Qualified inventory balance includes the majority of homes under construction and land under development but excludes land held for future development and land held for sale.\n(b) Capitalized interest amortized to home construction and land sales expenses varies based on the number of homes closed during the period and land sales, if any, as well as other factors.\n(6) Property and Equipment\nThe following table presents our property and equipment as of September 30, 2023 and 2022:\nin thousands September 30, 2023 September 30, 2022\nModel furnishings and sales office improvements $ 24,736 $ 22,544\nInformation systems 25,745 23,074\nFurniture, fixtures and office equipment 12,692 11,019\nLeasehold improvements 3,026 4,124\nBuildings and improvements 1,382 1,671\nProperty and equipment, gross 67,581 62,432\nLess: Accumulated depreciation (36,437) (37,866)\nProperty and equipment, net $ 31,144 $ 24,566\n(7) Borrowings\nThe Company's debt, net of unamortized debt issuance costs consisted of the following as of September 30, 2023 and 2022:\nin thousands Maturity Date September 30, 2023 September 30, 2022\n6.750% Senior Notes (2025 Notes)\nMarch 2025 202,195 211,195\n5.875% Senior Notes (2027 Notes)\nOctober 2027 357,255 357,255\n7.250% Senior Notes (2029 Notes)\nOctober 2029 350,000 350,000\nUnamortized debt issuance costs (5,759) (7,280)\nTotal Senior Notes, net 903,691 911,170\nJunior Subordinated Notes (net of unamortized accretion of $26,436 and $28,503, respectively)\nJuly 2036 74,337 72,270\nSecured Revolving Credit Facility February 2024(a)\nN/A(c)\n-\nSenior Unsecured Revolving Credit Facility October 2026(b)\n- N/A(c)\nTotal debt, net $ 978,028 $ 983,440\n(a) The Secured Revolving Credit Facility (Secured Facility) provided working capital and letter of credit capacity of $250.0 million and was scheduled to mature in February 2024; however, the Secured Facility was terminated early in October 2022 in conjunction with the Company entering into the Senior Unsecured Revolving Credit Facility. We recorded a loss on extinguishment of debt of $0.5 million during the fiscal year ended September 30, 2023 due to write-off of debt issuance costs related to the early termination of the Secured Facility. As of September 30, 2022, no borrowings were outstanding and $5.5 million letters of credit were outstanding under the Secured Facility, resulting in a remaining capacity of $244.5 million.\n(b) The Senior Unsecured Revolving Credit Facility was entered into on October 13, 2022. Refer to below for further discussion.\n(c) N/A - not applicable\nAs of September 30, 2023, the future maturities of our borrowings were as follows:\nFiscal Years Ending September 30,\nin thousands\n2024 $ -\n2025 202,195\n2026 -\n2027 357,255\n2028 -\nThereafter 450,773\nTotal $ 1,010,223\nSenior Unsecured Revolving Credit Facility\nOn October 13, 2022, the Company entered into a Senior Unsecured Revolving Credit Facility (Unsecured Facility), which replaced the Secured Facility. The Unsecured Facility provides for a revolving credit facility with borrowing capacity of $265.0 million, which includes a letter of credit facility of up to $100.0 million. The Company also will have the right from time to time to request to increase the size of the commitments under the Unsecured Facility by up to $135.0 million for a maximum of $400.0 million. The Unsecured Facility terminates on October 13, 2026 (Termination Date), and the Company may borrow, repay, and reborrow amounts under the Unsecured Facility until the Termination Date.\nObligations of the Company under the Unsecured Facility are jointly and severally guaranteed by certain of the Companys existing and future direct and indirect subsidiaries, excluding, among others, certain specified unrestricted subsidiaries.\nAs of September 30, 2023, no borrowings and no letters of credit were outstanding under the Unsecured Facility, resulting in a remaining capacity of $265.0 million. The Unsecured Facility requires compliance with certain covenants, including affirmative covenants, negative covenants and financial covenants. As of September 30, 2023, the Company believes it was in compliance with all such covenants.\nOn October 12, 2023, the Company increased its available borrowing capacity under the Unsecured Facility from $265.0 million to $300.0 million. Refer to Note 18 for further discussion.\nLetter of Credit Facilities\nThe Company has entered into stand-alone letter of credit agreements with banks, secured with cash or certificates of deposit, to maintain pre-existing letters of credit and to provide for the issuance of new letters of credit (in addition to the letters of credit issued under the Secured Facility and the Unsecured Facility). As of September 30, 2023 and 2022, the Company had letters of credit outstanding under these additional facilities of $31.2 million and $29.7 million, respectively. The Company may enter into additional arrangements to provide additional letter of credit capacity.\nSenior Notes\nThe Company's Senior Notes are unsecured obligations ranking pari passu with all other existing and future senior indebtedness. Substantially all of the Company's significant subsidiaries are full and unconditional guarantors of the Senior Notes and are jointly and severally liable for obligations under the Senior Notes and the Unsecured Facility. Each guarantor subsidiary is a wholly owned subsidiary of Beazer Homes.\nAll unsecured Senior Notes rank equally in right of payment with all existing and future senior unsecured obligations, senior to all of the Company's existing and future subordinated indebtedness and effectively subordinated to the Company's existing and future secured indebtedness, to the extent of the value of the assets securing such indebtedness. The unsecured Senior Notes and related guarantees are structurally subordinated to all indebtedness and other liabilities of all of the Company's subsidiaries that do not guarantee these notes, but are fully and unconditionally guaranteed jointly and severally on a senior basis by the Company's wholly-owned subsidiaries party to each applicable indenture.\nThe Company's Senior Notes are issued under indentures that contain certain restrictive covenants which, among other things, restrict our ability to pay dividends, repurchase our common stock, incur certain types of additional indebtedness, and make certain investments. Compliance with the Senior Note covenants does not significantly impact the Company's operations. The Company believes it was in compliance with the covenants contained in the indentures of all of its Senior Notes as of September 30, 2023.\nDuring the fiscal year ended September 30, 2023, we repurchased $9.0 million of our outstanding 2025 Notes using cash on hand, resulting in a net loss on extinguishment of debt of less than $0.1 million. Subsequently in October 2023, we repurchased an additional $4.3 million of our outstanding 2025 Notes using cash on hand, resulting in a net loss on extinguishment of debt of less than $0.1 million, and bringing the outstanding balance on our 2025 Notes to $197.9 million.\nDuring the fiscal year ended September 30, 2022, we repurchased $6.0 million of our outstanding 2027 Notes and $18.4 million of our outstanding 2025 Notes using cash on hand, resulting in a gain on extinguishment of debt of $0.3 million.\nDuring the fiscal year ended September 30, 2021, we repurchased $30.7 million of our outstanding 2027 Notes using cash on hand, resulting in a net loss on extinguishment of debt of $2.0 million.\nFor additional redemption features, refer to the table below that summarizes the redemption terms of our Senior Notes:\nSenior Note Description Issuance Date Maturity Date Redemption Terms\n6.750% Senior Notes\nMarch 2017 March 2025 Callable at any time prior to March 15, 2020, in whole or in part, at a redemption price equal to 100.000% of the principal amount, plus a customary make-whole premium; on or after March 15, 2020, callable at a redemption price equal to 105.063% of the principal amount; on or after March 15, 2021, callable at a redemption price equal to 103.375% of the principal amount; on or after March 15, 2022, callable at a redemption price equal to 101.688% of the principal amount; on or after March 15, 2023, callable at a redemption price equal to 100.000% of the principal amount, plus, in each case, accrued and unpaid interest\n5.875% Senior Notes\nOctober 2017 October 2027 Callable at any time prior to October 15, 2022, in whole or in part, at a redemption price equal to 100.000% of the principal amount, plus a customary make-whole premium; on or after October 15, 2022, callable at a redemption price equal to 102.938% of the principal amount; on or after October 15, 2023, callable at a redemption price equal to 101.958% of the principal amount; on or after October 15, 2024, callable at a redemption price equal to 100.979% of the principal amount; on or after October 15, 2025, callable at a redemption price equal to 100.000% of the principal amount, plus, in each case, accrued and unpaid interest.\n7.250% Senior Notes\nSeptember 2019 October 2029 Callable at any time prior to October 15, 2024, in whole or in part, at a redemption price equal to 100.000% of the principal amount, plus a customary make-whole premium; on or after October 15, 2024, callable at a redemption price equal to 103.625% of the principal amount; on or after October 15, 2025, callable at a redemption price equal to 102.417% of the principal amount; on or after October 15, 2026, callable at a redemption price equal to 101.208% of the principal amount; on or after October 15, 2027, callable at a redemption price equal to 100.000% of the principal amount, plus, in each case, accrued and unpaid interest\nJunior Subordinated Notes\nThe Company's unsecured junior subordinated notes (Junior Subordinated Notes) mature on July 30, 2036 and have an aggregate principal balance of $100.8 million as of September 30, 2023. The securities have a floating interest rate as defined in the Junior Subordinated Notes Indentures, which was a weighted-average of 8.08% as of September 30, 2023. The obligations relating to these notes are subordinated to the Unsecured Facility and the Senior Notes. In January 2010, the Company restructured $75.0 million of these notes (Restructured Notes) and recorded them at their then estimated fair value. Over the remaining life of the Restructured Notes, we will increase their carrying value until this carrying value equals the face value of the notes. As of September 30, 2023, the unamortized accretion was $26.4 million and will be amortized over the remaining life of the Restructured Notes. The remaining $25.8 million of the Junior Subordinated Notes are subject to the terms of the original agreement, have a floating interest rate equal to a three-month LIBOR (on and prior to June 30, 2023) plus 2.45% per annum, or three-month SOFR (on and after July 1, 2023) plus 2.71% per annum, resetting quarterly, and are redeemable in whole or in part at par value. The material terms of the $75.0 million Restructured Notes are identical to the terms of the original agreement except that the floating interest rate is subject to a floor of 4.25% and a cap of 9.25%. In addition, beginning on June 1, 2012, the Company has the option to redeem the $75.0 million principal balance in whole or in part at 75% of par value; beginning on June 1, 2022, the redemption price increased by 1.785% annually. As of September 30, 2023, the Company believes it was in compliance with all covenants under the Junior Subordinated Notes.\n(8) Contingencies\nBeazer Homes and certain of its subsidiaries have been and continue to be named as defendants in various construction defect claims, complaints, and other legal actions. The Company is subject to the possibility of loss contingencies related to these defects as well as others arising from its business. In determining loss contingencies, we consider the likelihood of loss and our ability to reasonably estimate the amount of such loss. An estimated loss is recorded when it is considered probable that a liability has been incurred and the amount of loss can be reasonably estimated.\nWarranty Reserves\nWe currently provide a limited warranty ranging from one to two years covering workmanship and materials per our defined quality standards. In addition, we provide a limited warranty for up to ten years covering only certain defined structural element failures.\nOur homebuilding work is performed by subcontractors who typically must agree to indemnify us with regard to their work and provide certificates of insurance demonstrating that they have met our insurance requirements and have named us as an additional insured under their policies. Therefore, many claims relating to workmanship and materials that result in warranty spending are the primary responsibility of these subcontractors.\nWarranty reserves are included in other liabilities within the consolidated balance sheets, and the provision for warranty accruals is included in home construction expenses in the consolidated statements of operations. Reserves covering anticipated warranty expenses are recorded for each home closed, which are a function of the number of home closings in the period, the selling prices of the homes closed and the rates of accrual per home estimated as a percentage of the selling price of the home. Management assesses the adequacy of warranty reserves each reporting period based on historical experience and the expected costs to remediate potential claims. Our review includes a quarterly analysis of the historical data and trends in warranty expense by division. An analysis by division allows us to consider market specific factors such as warranty experience, the number of home closings, the selling prices of homes, product mix, and other data in estimating warranty reserves. In addition, the analysis also contemplates the existence of any non-recurring or community-specific warranty-related matters that might not be included in historical data and trends that may need to be separately estimated based on management's judgment of the ultimate cost of repair for that specific issue. While estimated warranty liabilities are adjusted each reporting period based on the results of our quarterly analyses, we may not accurately predict actual warranty costs, which could lead to significant changes in the reserve.\nIn addition, we maintain third-party insurance, subject to applicable self-insured retentions, for most construction defects that we encounter in the normal course of business. We believe that our warranty and litigation accruals and third-party insurance are adequate to cover the ultimate resolution of our potential liabilities associated with known and anticipated warranty and construction-defect related claims and litigation. However, there can be no assurance that the terms and limitations of the limited warranty will be effective against claims made by homebuyers; that we will be able to renew our insurance coverage or renew it at reasonable rates; that we will not be liable for damages, the cost of repairs, and/or the expense of litigation surrounding possible construction defects, soil subsidence, or building related claims; or that claims will not arise out of events or circumstances not covered by insurance and/or not subject to effective indemnification agreements with our subcontractors.\nChanges in warranty reserves are as follows for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nBalance at beginning of period $ 13,926 $ 12,931 $ 13,052\nWarranty provision\n9,672 13,093 11,827\nWarranty expenditures (10,552) (12,098) (11,948)\nBalance at end of period $ 13,046 $ 13,926 $ 12,931\nInsurance Recoveries\nThe Company has insurance policies that provide for the reimbursement of certain warranty costs incurred above specified thresholds for each period covered. Amounts recorded for anticipated insurance recoveries are reflected within the consolidated statements of operations as a reduction of home construction expenses, if applicable. Amounts not yet received from our insurer are recorded on a gross basis, without any reduction for the associated warranty expense, within accounts receivable on our consolidated balance sheets, if applicable.\nLitigation\nIn the normal course of business, we and certain of our subsidiaries are subject to various lawsuits and have been named as defendants in various claims, complaints, and other legal actions, most relating to construction defects, moisture intrusion, and product liability. Certain of the liabilities resulting from these actions are covered in whole or in part by insurance.\nWe cannot predict or determine the timing or final outcome of these lawsuits or the effect that any adverse findings or determinations in pending lawsuits may have on us. In addition, an estimate of possible loss or range of loss, if any, cannot presently be made with respect to certain of these pending matters. An unfavorable determination in pending lawsuits could result in the payment by us of substantial monetary damages that may not be fully covered by insurance. Further, the legal costs associated with the lawsuits and the amount of time required to be spent by management and our Board of Directors on these matters, even if we are ultimately successful, could have a material adverse effect on our financial condition, results of operations, or cash flows.\nWe have an accrual of $9.4 million and $9.8 million in other liabilities on our consolidated balance sheets related to litigation matters as of September 30, 2023 and 2022, respectively.\nSurety Bonds and Letters of Credit\nWe had outstanding letters of credit and surety bonds of $31.2 million and $254.2 million, respectively, as of September 30, 2023, related principally to our obligations to local governments to construct roads and other improvements in various developments.\n(9) Fair Value Measurements\nAs of the dates presented, we had assets on our consolidated balance sheets that were required to be measured at fair value on a recurring or non-recurring basis. We use a fair value hierarchy that requires us to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value as follows:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities;\nLevel 2 - Inputs other than quoted prices included in Level 1 that are observable either directly or indirectly through corroboration with market data; and\nLevel 3 - Unobservable inputs that reflect our own estimates about the assumptions market participants would use in pricing the asset or liability.\nCertain of our assets are required to be recorded at fair value on a non-recurring basis when events and circumstances indicate that the carrying value of these assets may not be recoverable. We review our long-lived assets, including inventory, for recoverability when factors indicate an impairment may exist, but no less than quarterly. The fair value of assets deemed to be impaired is determined based upon the type of asset being evaluated. The fair value of our owned inventory assets, when required to be calculated, is further discussed within Notes 2 and 4. Due to the substantial use of unobservable inputs in valuing the assets on a non-recurring basis, they are classified within Level 3.\nDetermining within which hierarchical level an asset or liability falls requires significant judgment. We evaluate our hierarchy disclosures each quarter. The following table presents the period-end balances of assets measured at fair value for each hierarchy level:\nin thousands Level 1 Level 2 Level 3 Total\nAs of September 30, 2023\nDeferred compensation plan assets(a)\n$ 6,495 $ - $ - $ 6,495\nAs of September 30, 2022\nDeferred compensation plan assets(a)\n$ - $ 3,179 $ - $ 3,179\nAs of September 30, 2021\nDeferred compensation plan assets(a)\n$ - $ 2,730 $ - $ 2,730\n(a) Amount is measured at fair value on a recurring basis and included in other assets within the consolidated balance sheets.\nThe fair value of cash and cash equivalents, restricted cash, accounts receivable, trade accounts payable, other liabilities, and amounts due under the Unsecured Facility (if outstanding) approximate their carrying amounts due to the short maturity of these assets and liabilities. When outstanding, obligations related to land not owned under option agreements approximate fair value.\nThe following table presents the carrying value and estimated fair value of certain other financial liabilities as of September 30, 2023 and 2022:\nSeptember 30, 2023 September 30, 2022\nin thousands Carrying\nAmount(a)\nFair Value Carrying\nAmount(a)\nFair Value\nSenior Notes(b)\n$ 903,691 $ 858,528 $ 911,170 $ 753,338\nJunior Subordinated Notes(c)\n74,337 74,337 72,270 72,270\nTotal $ 978,028 $ 932,865 $ 983,440 $ 825,608\n(a) Carrying amounts are net of unamortized debt issuance costs or accretion.\n(b) The estimated fair value for our publicly-held Senior Notes has been determined using quoted market rates (Level 2).\n(c) Since there is no trading market for our Junior Subordinated Notes, the fair value of these notes is estimated by discounting scheduled cash flows through maturity (Level 3). The discount rate is estimated using market rates currently being offered on loans with similar terms and credit quality. Judgment is required in interpreting market data to develop these estimates of fair value. Accordingly, the estimates presented herein are not necessarily indicative of the amounts that we could realize in a current market exchange.\n(10) Operating Leases\nThe Company leases certain office space and equipment under operating leases for use in our operations. We recognize operating lease expense on a straight-line basis over the lease term. Certain of our lease agreements include one or more options to renew. The exercise of lease renewal options is generally at our discretion. Variable lease expense primarily relates to maintenance and other monthly expense that do not depend on an index or rate.\nWe determine if an arrangement is a lease at contract inception. Lease and non-lease components are accounted for as a single component for all leases. Operating lease right to use (ROU) assets and liabilities are recognized at the lease commencement date based on the present value of the future lease payments over the expected lease term, which includes optional renewal periods if we determine it is reasonably certain that the option will be exercised. As our leases do not provide an implicit rate, the discount rate used in the present value calculation represents our incremental borrowing rate determined using information available at the commencement date.\nOperating lease expense is included as a component of general and administrative expenses in our consolidated statements of operations. Sublease income and variable lease expenses are de minimis. For the fiscal years ended September 30, 2023, 2022 and 2021, we recorded operating lease expense of $4.0 million, $4.0 million and $4.3 million, respectively. Cash payments on lease liabilities during the fiscal years ended September 30, 2023, 2022 and 2021 totaled $4.3 million, $4.4 million and $4.8 million, respectively.\nAt September 30, 2023 and 2022, weighted-average remaining lease term and discount rate were as follows:\nSeptember 30,\n2023 2022\nWeighted-average remaining lease term 7.0 years 4.3 years\nWeighted-average discount rate 5.98% 4.43%\nThe following is a maturity analysis of the annual undiscounted cash flows reconciled to the carrying value of the operating lease liabilities as of September 30, 2023:\nFiscal Years Ending September 30,\nin thousands\n2024 $ 4,123\n2025 4,003\n2026 3,391\n2027 2,466\n2028 2,211\nThereafter 7,967\nTotal lease payments(a)\n24,161\nLess: imputed interest 5,192\nTotal operating lease liabilities $ 18,969\n(a) Lease payments excludes $3.5 million legally binding minimum lease payments for an office lease signed but not yet commenced as of September 30, 2023. The related ROU asset and operating lease liability are not reflected on the Company's consolidated balance sheet as of September 30, 2023.\n(11) Other Liabilities\nOther liabilities include the following as of September 30, 2023 and 2022:\nin thousands September 30, 2023 September 30, 2022\nAccrued compensations and benefits $ 50,242 $ 57,781\nCustomer deposits 27,577 34,270\nAccrued interest 23,132 22,723\nWarranty reserves 13,046 13,926\nLitigation accruals 9,404 9,832\nIncome tax liabilities 272 320\nOther 33,288 35,536\nTotal $ 156,961 $ 174,388\n(12) Income Taxes\nThe Company's expense from income taxes from continuing operations consists of the following for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nCurrent federal $ - $ - $ -\nCurrent state 1,896 4,859 1,126\nDeferred federal 18,997 47,239 20,331\nDeferred state 3,065 1,173 89\nTotal expense from income taxes $ 23,958 $ 53,271 $ 21,546\nThe Company's expense from income taxes from continuing operations differs from the amount computed by applying the federal income tax statutory rate as follows for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nIncome tax computed at statutory rate $ 38,356 $ 57,538 $ 30,182\nState income taxes, net of federal benefit 2,874 4,482 1,564\nDeferred rate change 665 346 (904)\nPermanent differences 2,216 2,952 2,433\nTax credits (20,287) (12,081) (12,088)\nOther, net 134 34 359\nTotal expense from income taxes $ 23,958 $ 53,271 $ 21,546\nThe principal differences between our effective tax rate and the U.S. federal statutory rate for fiscal years 2023, 2022 and 2021 relate to state taxes, permanent differences and tax credits. Due to the effects of tax credits, our income tax expense is not always directly correlated to the amount of pre-tax income for the associated periods.\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of our assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The tax effects of significant temporary differences that give rise to the net deferred tax assets are as follows as of September 30, 2023 and 2022:\nin thousands September 30, 2023 September 30, 2022\nDeferred tax assets:\nFederal and state net operating loss and tax credit carryforwards $ 138,856 $ 149,299\nIncentive compensation 11,422 12,914\nWarranty and other reserves 6,918 7,091\nInventory adjustments 3,942 6,716\nIntangible assets - 1,515\nProperty, equipment and other assets 1,276 771\nUncertain tax positions 705 705\nOther 2,504 2,743\nTotal deferred tax assets 165,623 181,754\nValuation allowance (30,438) (25,396)\nTotal deferred tax assets, net of valuation allowance $ 135,185 $ 156,358\nDeferred tax liabilities:\nIntangible assets (1,236) -\nTotal deferred tax liabilities (1,236) -\nNet deferred tax assets 133,949 156,358\nAs of September 30, 2023, our gross deferred tax assets above included $26.5 million of federal net operating loss (NOL) carryforwards, $78.1 million of federal tax credits, and $37.6 million of state NOL carryforwards. The majority of our federal NOL carryforwards expire in our fiscal 2033, our federal tax credits expire at various dates through our fiscal 2043, and our state NOL carryforwards expire at various dates through our fiscal 2043. As of September 30, 2023, valuation allowance of $30.4 million remains on various state NOL carryforwards for which the Company has concluded that it is more likely than not that these attributes will not be realized.\nWe experienced an ownership change as defined in Section 382 of the Internal Revenue Code (Section 382) as of January 12, 2010. Section 382 contains rules that limit the ability of a company that undergoes an ownership change to utilize its net operating loss carryforwards, tax credits and certain built-in losses or deductions recognized during the five-year period after the ownership change to offset future taxable income. Because the five-year period has expired, we have determined the actual impact and final classification of those amounts, which are properly reflected in the amounts presented above. There can be no assurance that another ownership change, as defined in the tax law, will not occur. If another ownership change occurs, a new annual limitation on the utilization of net operating loss carryforwards, tax credits and built-in losses would be determined as of that date. This limitation, should one be required in the future, is subject to assumptions and estimates that could differ from actual results.\nValuation Allowance\nA reduction of the carrying amounts of deferred tax assets by a valuation allowance is required if, based on the available evidence, it is more likely than not that such assets will not be realized. Accordingly, we assess the need to establish valuation allowances for deferred tax assets periodically based on the more-likely-than-not realization threshold criterion. In our assessment, appropriate consideration is given to all positive and negative evidence related to the realization of the deferred tax assets. This assessment considers, among other matters, the nature, frequency and severity of current and cumulative losses, forecasts of future profitability, the duration of statutory carryforward periods, the Company's experience with operating loss carryforwards and tax credit carryforwards not expiring unused, the Section 382 limitation on our ability to carryforward pre-ownership change net operating losses, recognized built-in losses or deductions, and tax planning alternatives. Our assessment, while rooted in actual Company performance, are highly subjective and rely on certain estimates, including forecasts, which could differ materially from actual results.\nIn fiscal 2023, our conclusions about our ability to more likely than not realize all of our federal and certain state tax attributes remain consistent with our prior determinations. We considered positive factors including our recent earnings levels, interest savings from our debt reduction strategies, shortage in housing supply, and our backlog. The negative factors included the overall health of the broader economy, significant increases in mortgage interest rates, and weakened housing demand. As of September 30, 2023, the Company will have to cumulatively generate $712.9 million in pre-tax income over the course of its carryforward period to realize its deferred tax assets prior to their expiration, which, as previously discussed, is the Company's fiscal 2043.\nUnrecognized Tax Benefits\nA reconciliation of our unrecognized tax benefits is as follows for the beginning and end of each period presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nBalance at beginning of year $ 3,358 $ 3,358 $ 3,441\nAdditions for tax positions related to current year - - -\nAdditions for tax positions related to prior years - - -\nReductions in tax positions of prior years - - -\nLapse of statute of limitations - - (83)\nBalance at end of year $ 3,358 $ 3,358 $ 3,358\nIf we were to recognize our $3.4 million gross unrecognized tax benefits remaining as of September 30, 2023, substantially all would impact our effective tax rate. Additionally, we had no accrued interest and penalties as of September 30, 2023, 2022 and 2021. If applicable, we would record interest and penalties related to unrecognized tax benefits in income tax expense within our consolidated statements of operations.\nIn the normal course of business, we are subject to audits by federal and state tax authorities regarding various tax liabilities. The statute of limitations for our major tax jurisdictions remains open for examination for fiscal year 2007 and subsequent years. As of September 30, 2023, we do not expect that any of our uncertain tax positions will reverse within the next twelve months.\n(13) Stockholders' Equity\nPreferred Stock\nThe Company currently has no shares of preferred stock outstanding.\nCommon Stock\nAs of September 30, 2023, the Company had 63,000,000 shares of common stock authorized and 31,351,434 shares both issued and outstanding.\nCommon Stock Repurchases\nIn May 2022, the Company's Board of Directors approved a new share repurchase program that authorizes the Company to repurchase up to $50.0 million of its outstanding common stock. This share repurchase program replaced the prior share repurchase program, authorized in the first quarter of fiscal 2019 of up to $50.0 million of common stock repurchases, pursuant to which $12.0 million of the capacity remained prior to the replacement of the program. No share repurchases were made during fiscal years 2023 and 2021. During the fiscal year ended September 30, 2022, the Company repurchased 570 thousand shares of its common stock for $8.2 million at an average price per share of $14.33 through open market transactions. All shares have been retired upon repurchase. The aggregate reduction to stockholders equity related to share repurchases during the fiscal year ended September 30, 2022 was $8.2 million. As of September 30, 2023, the remaining availability of the share repurchase program was $41.8 million. The repurchase program has no expiration date.\nDividends\nThe indentures under which our Senior Notes were issued contain certain restrictive covenants, including limitations on our payment of dividends. There were no dividends paid during our fiscal 2023, 2022 or 2021.\nSection 382 Rights Agreement\nOur certificate of incorporation prohibits certain transfers of our common stock that could result in an ownership change as defined in Section 382. In addition, we are party to a rights agreement intended to act as a deterrent to any person desiring to acquire 4.95% or more of our common stock. These instruments are designed to preserve the value of certain tax assets associated with our net operating loss carryforwards, tax credits and built-in losses under Section 382. In February 2022, our stockholders approved an extension of these protective provisions in our certificate of incorporation and the rights agreement.\n(14) Retirement and Deferred Compensation Plans\n401(k) Retirement Plan\nThe Company sponsors a defined-contribution plan that is a tax-qualified retirement plan under section 401(k) of the Internal Revenue Code (the Plan). Substantially all employees are eligible for participation in the Plan. Participants may defer and contribute from 1% to 80% of their salary to the Plan, with certain limitations on highly compensated individuals. The Company matches up to 50% of the participant's contributions limited to 6% of the participant's earnings. The participant's contributions vest immediately, while the Company's contributions vest over five years. The total Company contributions for the fiscal years ended September 30, 2023, 2022 and 2021 were $3.2 million, $3.5 million and $3.2 million, respectively. During fiscal 2023, 2022 and 2021, participants forfeited $0.7 million, $0.3 million and $0.8 million, respectively, of unvested matching contributions.\nDeferred Compensation Plan\nThe Beazer Homes USA, Inc. Deferred Compensation Plan (the DCP) is a non-qualified deferred compensation plan for a select group of executives and highly compensated employees. The DCP allows the executives to defer current compensation on a pre-tax basis to a future year, until termination of employment. The objectives of the DCP are to assist executives with financial planning and capital accumulation and to provide the Company with a method of attracting, rewarding and retaining executives. Participation in the DCP is voluntary. The Company may voluntarily make a contribution to the participants' DCP accounts. For the years ended September 30, 2023, 2022 and 2021, the Company contributed $0.2 million, $0.2 million and $0.2 million, respectively, to the participants' DCP accounts in the form of voluntary contributions, which was recorded as compensation expense within general and administrative expenses in our consolidated statements of operations. Deferred compensation assets of $6.5 million and $3.2 million as of September 30, 2023 and 2022, respectively, are included in other assets on our consolidated balance sheets and are recorded at fair value. Deferred compensation liabilities of $6.5 million and $5.5 million as of September 30, 2023 and 2022, respectively, are included in other liabilities on our consolidated balance sheets. During fiscal 2023, the Company fully funded the DCP using cash on hand.\n(15) Stock-Based Compensation\nThe Company has shares available for grant under the Amended and Restated 2014 Beazer Homes USA, Inc. Long-Term Incentive Plan. We issue new shares upon the exercise of stock options and the grant of restricted stock awards. In cases of forfeitures and cancellations, those shares are returned to the share pool for future issuance. As of September 30, 2023, we had 0.8 million shares of common stock for issuance under our various equity incentive plans, of which 0.8 million shares are available for future grants.\nStock-based compensation expense is included in general and administrative expenses in our consolidated statements of operations. Following is a summary of stock-based compensation expense related to stock options and restricted stock awards for the fiscal years ended 2023, 2022 and 2021, respectively.\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nStock options expense $ - $ 1 $ 25\nRestricted stock awards expense 7,275 8,477 12,142\nStock-based compensation expense $ 7,275 $ 8,478 $ 12,167\nStock Options\nStock options have an exercise price equal to the fair market value of the common stock on the grant date, generally vest two or three years after the date of grant, and may be exercised thereafter until their expiration, subject to forfeiture upon termination of employment as provided in the applicable plan. Under certain conditions of retirement, eligible participants may receive a partial vesting of stock options. Stock options generally expire on the eighth anniversary from the date such options were granted, depending on the terms of the award.\nThe fair value of each stock option granted is estimated on the date of grant using the Black-Scholes option-pricing model (Black-Scholes Model). As of both September 30, 2023 and 2022, there was less than $0.1 million of total unrecognized compensation cost related to unvested stock options. The cost remaining as of September 30, 2023 is expected to be recognized over a weighted-average period of 1.8 years.\nDuring fiscal 2018, the Compensation Committee of our Board of Directors approved the Employee Stock Option Program (ESOP). This program is available to all full-time employees and is designed to enable employees to share in potential price appreciation of the Company's stock. The ESOP matches stock purchases made by eligible employees meeting certain conditions with an option to purchase an additional share of the Company's shares on a one-to-one basis. The exercise price of the options granted is equal to the closing price of the Company's stock on the day the underlying shares are purchased by the employee, which is also the ESOP grant date. The options will vest on the second anniversary of the date of grant but are forfeited if (1) the eligible employee no longer works for the Company or (2) the underlying shares are sold before the two-year vesting period is over. The total number of options available under the ESOP is limited to 100,000, each for one share of the Company's common stock, of which 32,068 options were granted through the end of fiscal 2023.\nDuring the fiscal years ended September 30, 2023 and 2022, we issued 100 and 236 stock options, respectively, all were issued under the ESOP. No stock options were issued during the fiscal year ended September 30, 2021.\nFollowing is a summary of stock option activity for the periods presented:\nFiscal Year Ended September 30,\n2023 2022 2021\nShares Weighted-\nAverage\nExercise\nPrice Shares Weighted-\nAverage\nExercise\nPrice Shares Weighted-\nAverage\nExercise\nPrice\nOutstanding at beginning of period 27,507 $ 14.31 114,259 $ 17.89 392,465 $ 15.47\nGranted 100 27.98 236 16.58 - -\nExercised (13,796) 19.00 (988) 11.32 (278,206) 14.48\nExpired - - (86,000) 19.11 - -\nForfeited (236) 16.58 - - - -\nOutstanding at end of period 13,575 $ 9.61 27,507 $ 14.31 114,259 $ 17.89\nExercisable at end of period 13,475 $ 9.48 27,271 $ 14.29 113,309 $ 17.95\nRestricted Stock Awards\nThe fair value of each restricted stock award with market conditions is estimated on the date of grant using the Monte Carlo valuation method. The fair value of restricted stock awards without market conditions is based on the market price of the Company's common stock on the date of grant. If applicable, the cash-settled component of any awards granted to employees is accounted for as a liability, which is adjusted to fair value each reporting period until vested.\nCompensation cost arising from restricted stock awards granted to employees is recognized as an expense using the straight-line method over the vesting period. As of September 30, 2023 and 2022, there was $6.9 million and $7.3 million, respectively, of total unrecognized compensation cost related to unvested restricted stock awards. The cost remaining as of September 30, 2023 is expected to be recognized over a weighted-average period of 1.7 years.\nDuring fiscal 2023, we issued time-based restricted stock awards and performance-based restricted stock awards with a payout subject to certain performance and market conditions. Each award type is discussed below.\nPerformance-Based Restricted Stock Awards\nDuring the fiscal year ended September 30, 2023, we issued 157,430 shares of performance-based restricted stock (2023 Performance Shares), containing market conditions, to our executive officers and certain other employees. The 2023 Performance Shares are structured to be awarded based on the Company's performance under three pre-determined financial and operational metrics at the end of the three-year performance period. After determining the number of shares earned based on the financial and operational metrics, which can range from 0% to 175% of the targeted number of shares, the award will be subject to further upward or downward adjustment by as much as 30% based on the Company's relative total shareholder return (TSR) compared against a selected small to mid-cap homebuilder peers during the three-year performance period. The 2023 Performance Shares were valued using the Monte Carlo valuation model due to the existence of the TSR market condition and had an estimated fair value of $12.67 per share on the date of grant.\nA Monte Carlo valuation model requires the following inputs: (1) the expected dividend yield on the underlying stock; (2) the expected price volatility of the underlying stock; (3) the risk-free interest rate for the period corresponding with the expected term of the award; and (4) the fair value of the underlying stock. For the Company and each member of the peer group, the following inputs were used, as applicable, in the Monte Carlo valuation model to determine the fair value as of the grant date for performance-based restricted stock granted in each of the fiscal years ended.\nFiscal Year Ended September 30,\n2023 2022 2021\nExpected volatility range 41.5% - 86.9%\n41.0% - 89.0%\n26.1% - 67.0%\nRisk-free interest rate 4.26 % 0.81 % 0.23 %\nDividend yield - - -\nGrant-date stock price range $10.31 - $93.50\n$21.40 - $142.99\n$14.07 - $4,318.03\nEach of our performance shares represent a contingent right to receive one share of the Company's common stock if vesting is satisfied at the end of the three-year performance period. Our performance stock award plans provide that any performance shares earned in excess of the target number of performance shares issued may be settled in cash or additional shares at the discretion of the Compensation Committee. We have no current plans to cash settle any additional performance-based restricted shares in the future.\nThe performance criteria of the 2021 Performance Share grant were satisfied as of September 30, 2023. Based on the actual performance level achieved, 210,176 performance-based restricted stock awards from the 2021 Performance Share grant cliff vested at the end of the three-year vesting period on November 16, 2023. Of the total $2.7 million compensation cost related to these awards, we have recognized $0.7 million, $1.2 million and $0.5 million during the fiscal years ended September 30, 2023, 2022 and 2021, respectively. The remaining $0.3 million of unrecognized compensation cost will be recognized in the first quarter of fiscal 2024.\nTime-Based Restricted Stock Awards\nDuring the fiscal year ended September 30, 2023, we also issued 425,398 shares of time-based restricted stock (Restricted Shares) to our directors, executive officers, and certain other employees. Restricted Shares are valued based on the market price of the Company's common stock on the date of the grant. The Restricted Shares granted to our non-employee directors vest on the first anniversary of the grant, while the Restricted Shares granted to our executive officers and other employees generally vest ratably over three years from the date of grant.\nActivity relating to all restricted stock awards for the periods presented is as follows:\nFiscal Year Ended September 30, 2023\nPerformance-Based(a)\nTime-Based Total\nShares Weighted-\nAverage\nGrant\nDate Fair\nValue Shares Weighted-\nAverage\nGrant\nDate Fair\nValue Shares Weighted-\nAverage\nGrant\nDate Fair\nValue\nBeginning of period 436,146 $ 17.76 412,042 $ 18.52 848,188 $ 18.13\nGranted 249,534 14.17 425,398 12.05 674,932 12.83\nVested (334,736) 16.80 (234,218) 18.02 (568,954) 17.30\nForfeited (2,721) 15.20 (9,388) 14.38 (12,109) 14.56\nEnd of period 348,223 $ 16.20 593,834 $ 14.15 942,057 $ 14.91\n(a) Grant and vesting activity during the fiscal year ended September 30, 2023 include 92,104 shares that were issued above target based on performance level achieved under performance-based restricted stock vesting in the current period.\nFiscal Year Ended September 30, 2022\nPerformance-Based(a)\nTime-Based Total\nShares Weighted-\nAverage\nGrant\nDate Fair\nValue Shares Weighted-\nAverage\nGrant\nDate Fair\nValue Shares Weighted-\nAverage\nGrant\nDate Fair\nValue\nBeginning of period 738,155 $ 13.45 486,574 $ 13.79 1,224,729 $ 13.59\nGranted 269,617 18.98 246,844 21.40 516,461 20.14\nVested (552,417) 10.50 (286,182) 13.21 (838,599) 11.42\nForfeited (19,209) 17.27 (35,194) 16.49 (54,403) 16.77\nEnd of period 436,146 $ 17.76 412,042 $ 18.52 848,188 $ 18.13\n(a) Grant and vesting activity during the fiscal year ended September 30, 2022 include 177,759 shares that were issued above target based on performance level achieved under performance-based restricted stock vesting in the current period.\nFiscal Year Ended September 30, 2021\nPerformance-Based(a)\nTime-Based Total\nShares Weighted-\nAverage\nGrant\nDate Fair\nValue Shares Weighted-\nAverage\nGrant\nDate Fair\nValue Shares Weighted-\nAverage\nGrant\nDate Fair\nValue\nBeginning of period 796,024 $ 14.71 610,130 $ 13.85 1,406,154 $ 14.34\nGranted 164,296 17.90 251,788 14.21 416,084 15.67\nVested (222,165) 22.40 (346,856) 14.36 (569,021) 17.50\nForfeited - - (28,488) 11.77 (28,488) 11.77\nEnd of period 738,155 $ 13.45 486,574 $ 13.79 1,224,729 $ 13.59\n(a) Grant and vesting activity during the fiscal year ended September 30, 2021 include 60,930 shares that were issued above target based on performance level achieved under performance-based restricted stock vesting in the current period.\n(16) Earnings Per Share\nBasic income (loss) per share is calculated by dividing net income (loss) by the weighted-average number of shares outstanding during the period. Diluted income (loss) per share adjusts the basic income (loss) per share for the effects of any potentially dilutive securities in periods in which the Company has net income and such effects are dilutive under the treasury stock method.\nFollowing is a summary of the components of basic and diluted income (loss) per share for the periods presented:\nFiscal Year Ended September 30,\nin thousands (except per share data) 2023 2022 2021\nNumerator:\nIncome from continuing operations $ 158,688 $ 220,718 $ 122,180\nLoss from discontinued operations, net of tax (77) (14) (159)\nNet income $ 158,611 $ 220,704 $ 122,021\nDenominator:\nBasic weighted-average shares 30,353 30,432 29,954\nDilutive effect of restricted stock awards 388 357 461\nDilutive effect of stock options 6 7 22\nDiluted weighted-average shares(a)\n30,747 30,796 30,437\nBasic income (loss) per share:\nContinuing operations $ 5.23 $ 7.25 $ 4.08\nDiscontinued operations - - (0.01)\nTotal $ 5.23 $ 7.25 $ 4.07\nDiluted income per share:\nContinuing operations $ 5.16 $ 7.17 $ 4.01\nDiscontinued operations - - -\nTotal $ 5.16 $ 7.17 $ 4.01\n(a) The following potentially dilutive shares were excluded from the calculation of diluted income per share as a result of their anti-dilutive effect.\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nStock options 11 22 142\n(17) Segment Information\nWe currently operate in 13 states that are grouped into three homebuilding segments based on geography. Revenues from our homebuilding segments are derived from the sale of homes that we construct, land and lot sales, and our title operations. Land sales revenue relates to land that does not fit within our homebuilding programs and strategic plans. We also provide title examinations for our homebuyers in certain markets. Our reportable segments have been determined on a basis that is used internally by management for evaluating segment performance and resource allocations. We have considered the applicable aggregation criteria, and have combined our homebuilding operations into three reportable segments as follows:\nWest: Arizona, California, Nevada, and Texas(a)\nEast: Delaware, Indiana, Maryland, New Jersey(b), Tennessee, and Virginia\nSoutheast: Florida, Georgia, North Carolina, and South Carolina\n(a) On May 20, 2022, we acquired substantially all of the assets of Imagine Homes, a private San Antonio-based homebuilder in which the Company held a one-third ownership stake for the previous 16 years. The results of our San Antonio operations are reported herein within our West reportable segment.\n(b) During our fiscal 2015, we made the decision that we would not continue to reinvest in new homebuilding assets in our New Jersey division; therefore, it is no longer considered an active operation. However, it is included in this listing because the segment information below continues to include New Jersey.\nManagements evaluation of segment performance is based on segment operating income. Operating income for our homebuilding segments is defined as homebuilding and land sales and other revenue less home construction, land development, land sales expense, title operations expense, commission expense, depreciation and amortization, and certain G&A expenses that are incurred by or allocated to our homebuilding segments. The accounting policies of our segments are those described in Note 2.\nThe following tables contain our revenue, operating income, and depreciation and amortization by segment for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nRevenue\nWest $ 1,297,005 $ 1,331,553 $ 1,118,578\nEast 505,844 560,747 569,835\nSoutheast 403,936 424,688 451,890\nTotal revenue $ 2,206,785 $ 2,316,988 $ 2,140,303\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nOperating income\nWest $ 205,850 $ 253,961 $ 181,303\nEast 65,021 102,146 84,630\nSoutheast 57,326 68,726 57,581\nSegment total 328,197 424,833 323,514\nCorporate and unallocated(a)\n(150,944) (152,342) (176,645)\nTotal operating income $ 177,253 $ 272,491 $ 146,869\n(a) Includes amortization of capitalized interest, movement in capitalized indirect costs, expenses related to numerous shared services functions that benefit all segments but are not allocated to the operating segments reported above, including information technology, treasury, corporate finance, legal, branding and national marketing, and other amounts that are not allocated to our operating segments.\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nDepreciation and amortization\nWest $ 7,550 $ 8,178 $ 7,250\nEast 1,662 1,649 2,207\nSoutheast 1,655 1,843 2,552\nSegment total 10,867 11,670 12,009\nCorporate and unallocated(a)\n1,331 1,690 1,967\nTotal depreciation and amortization $ 12,198 $ 13,360 $ 13,976\n(a) Represents depreciation and amortization related to assets held by our corporate functions that benefit all segments.\nThe following table presents capital expenditures by segment for the periods presented:\nFiscal Year Ended September 30,\nin thousands 2023 2022 2021\nCapital expenditures\nWest $ 9,909 $ 7,755 $ 6,924\nEast 2,578 1,208 1,549\nSoutheast 1,452 1,215 1,447\nCorporate and unallocated 6,395 4,870 4,725\nTotal capital expenditures $ 20,334 $ 15,048 $ 14,645\nThe following table presents assets by segment as of September 30, 2023 and 2022:\nin thousands September 30, 2023 September 30, 2022\nAssets\nWest $ 994,597 $ 995,339\nEast 356,020 334,323\nSoutheast 320,430 305,443\nCorporate and unallocated(a)\n739,986 616,858\nTotal assets $ 2,411,033 $ 2,251,963\n(a) Primarily consists of cash and cash equivalents, restricted cash, deferred taxes, capitalized interest and indirect costs, and other items that are not allocated to the segments.\n(18) Subsequent Events\nOn October 12, 2023, the Company delivered activation notices to JP Morgan Chase Bank, N.A., as administrative agent under the Companys Unsecured Facility, in connection with commitment increases by Flagstar Bank, N.A., an existing lender, and Texas Capital Bank, a new lender, pursuant to which the available borrowing capacity under the Unsecured Facility was increased from $265.0 million to $300.0 million.\nAlso, during October 2023, we repurchased $4.3 million of our outstanding 2025 Notes using cash on hand, resulting in a net loss on extinguishment of debt of less than $0.1 million and bringing the outstanding balance on our 2025 Notes to $197.9 million. Refer to Note 7 for additional details related to the Unsecured Facility and debt repurchase.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Beazer Homes USA, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Beazer Homes USA, Inc. and subsidiaries (the \"Company\") as of September 30, 2023 and 2022, the related consolidated statements of operations, stockholders' equity, and cash flows, for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated November 16, 2023, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nOwned Inventory-Valuation of Projects in Progress-Refer to Notes 2 and 4 to the financial statements.\nCritical Audit Matter Description\nProjects in progress inventory includes homes under construction and land under development grouped together as communities. Projects in progress are stated at cost unless facts and circumstances indicate that the carrying value of the assets may not be recoverable. The Company assesses its projects in progress inventory for indicators of potential impairment at the community level on a quarterly basis. The Company evaluates, among other things, the average sales price and margins on current homes and sales contracts in backlog for each community. As of September 30, 2023, the carrying value of the Companys projects in progress inventory was $1.7 billion.\nGiven the subjectivity in determining whether impairment indicators are present at a community, management exercises significant judgment when evaluating for indicators of impairment. Accordingly, auditing managements judgments regarding the identification of impairment indicators involved an increased extent of effort and especially subjective auditor judgment.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the Companys identification of impairment indicators for projects in progress included the following, among others:\na.We tested the operating effectiveness of controls over managements evaluation of impairment indicators.\nb.We evaluated managements impairment indicator analysis by:\ni.Testing whether all communities classified as projects in progress inventory were included in the impairment indicators analysis.\nii.Testing each community classified as projects in progress inventory for indicators of impairment including considering average sales price and margins on current homes and sales contracts in backlog.\niii.Developing an independent expectation of indicators and comparing such expectations to those included in the impairment indicator analysis.\n/s/ Deloitte & Touche LLP\nAtlanta, Georgia\nNovember 16, 2023\nWe have served as the Companys auditor since 1996.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of Beazer Homes USA, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Beazer Homes USA, Inc. and subsidiaries (the Company) as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended September 30, 2023, of the Company and our report dated November 16, 2023, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nAtlanta, Georgia\nNovember 16, 2023 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur management, under the supervision and with the participation of our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), evaluated the effectiveness of the design and operation of the Company's disclosure controls and procedures as of September 30, 2023 pursuant to Rule 13a-15(b) of the Securities Exchange Act of 1934, as amended (Exchange Act). Our disclosure controls and procedures are designed to ensure that information required to be disclosed in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission's rules and forms, and that such information is accumulated and communicated to our management, including our CEO and CFO, as appropriate to allow timely decisions regarding required disclosure. Based on the evaluation, our CEO and CFO concluded that our disclosure controls and procedures were effective as of September 30, 2023.\nManagement's Report on Internal Control over Financial Reporting\nOur management is responsible for the preparation and fair presentation of the consolidated financial statements included in this Annual Report on Form 10-K. The consolidated financial statements have been prepared in conformity with U.S. generally accepted accounting principles (U.S. GAAP) and reflect managements judgments and estimates concerning events and transactions that are accounted for or disclosed.\nOur management is also responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The Companys internal control over financial reporting is a process designed under the supervision of our CEO and CFO to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the Companys financial statements for external purposes in accordance with U.S. GAAP.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements and even when determined to be effective, can only provide reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. Managements assessment was based on criteria for effective internal control over financial reporting described in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 Framework). Based on this assessment, management concluded that the Company has maintained effective internal control over financial reporting as of September 30, 2023. The effectiveness of our internal control over financial reporting as of September 30, 2023 has been audited by Deloitte & Touche LLP, our independent registered public accounting firm, as stated in their report, which is included in Part II, Item 8 - Financial Statements and Supplementary Data.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in the Companys internal control over financial reporting during the quarter ended September 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nRule 10b5-1 Trading Arrangements\nDuring the three months ended September 30, 2023, none of the Companys directors or executive officers adopted or terminated any contract, instruction or written plan for the purchase or sale of Company securities that was intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) or any non-Rule 10b5-1 trading arrangement.\nItem 9C. Disclosure Reporting Regarding Foreign Jurisdictions That Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item is incorporated by reference to our proxy statement for our 2024 Annual Meeting of Stockholders, which is expected to be filed on or before December 29, 2023.\nCode of Ethics\nBeazer Homes has adopted a Code of Business Conduct and Ethics (the Code) that applies to its principal executive officer, principal financial officer, principal accounting officer, and other senior financial officers. In November 2019, the Companys Board of Directors amended the Code. The full text of the Code, as amended, can be found on the Companys website at www.beazer.com. If at any time there is an amendment or waiver of any provision of the Code that is required to be disclosed, information regarding such amendment or waiver will be published on the Companys website. Item 11. Executive Compensation\nThe information required by this item is incorporated by reference to our proxy statement for our 2024 Annual Meeting of Stockholders, which is expected to be filed on or before December 29, 2023. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information relating to securities authorized for issuance under equity compensation plans is set forth above in Item 5 - Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities. All of the other information required by this item is incorporated by reference to our proxy statement for our 2024 Annual Meeting of Stockholders, which is expected to be filed on or before December 29, 2023. Item 13. Certain Relationships and Related Transactions and Director Independence\nThe information required by this item is incorporated by reference to our proxy statement for our 2024 Annual Meeting of Stockholders, which is expected to be filed on or before December 29, 2023. Item 14. Principal Accountant Fees and Services\nOur independent registered public accounting firm is Deloitte & Touche LLP (PCAOB ID No. 34).\nFurther information required by this item is incorporated by reference to our proxy statement for our 2024 Annual Meeting of Stockholders, which is expected to be filed on or before December 29, 2023.\nPART IV Item 15. Exhibits and Financial Statement Schedules\nThe following documents are filed as part of this Annual Report on Form 10-K.\n(a) 1. Financial Statements\nPage Herein\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the fiscal years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Stockholders' Equity for the fiscal years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows for the fiscal years ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\n2. Financial Statement Schedules\nNone required.\n3. Exhibits\nAll exhibits were filed under File No. 001-12822, except as otherwise indicated below.\nExhibit Number Exhibit Description\n3.1 - Amended and Restated Certificate of Incorporation of the Company (incorporated herein by reference to Exhibit 3.1 of the Company's Form 10-K for the year ended September 30, 2008)\n3.2 - Certificate of Amendment, dated April 13, 2010, to the Amended and Restated Certificate of Incorporation of the Company (incorporated herein by reference to Exhibit 3.1 of the Company's Form 10-Q for the quarter ended March 31, 2010)\n3.3 - Certificate of Amendment, dated February 3, 2011, to the Amended and Restated Certificate of Incorporation of the Company, as amended (incorporated herein by reference to Exhibit 3.1 of the Company's Form 8-K filed on February 8, 2011)\n3.4 - Certificate of Amendment, dated October 11, 2012, to the Amended and Restated Certificate of Incorporation of the Company, as amended (incorporated herein by reference to Exhibit 3.1 of the Company's Form 8-K filed on October 12, 2012)\n3.5 - Certificate of Amendment, dated February 2, 2013, to the Amended and Restated Certificate of Incorporation of the Company, as amended (incorporated herein by reference to Exhibit 3.1 of the Company's Form 8-K filed on February 5, 2013)\n3.6 - Certificate of Amendment, dated November 6, 2013, to the Amended and Restated Certificate of Incorporation of the Company, as amended (incorporated herein by reference to Exhibit 3.1 of the Company's Form 8-K filed on November 7, 2013)\n3.7 - Certificate of Amendment, dated November 11, 2016, to the Amended and Restated Certificate of Incorporation of the Company, as amended (incorporated herein by reference to Exhibit 3.8 of the Company's Form 10-K for the year ended September 30, 2016)\n3.8 - Certificate of Amendment, dated as of November 8, 2019, and effective as of November 12, 2019, to the Amended and Restated Certificate of Incorporation of the Company, as amended (incorporated herein by reference to Exhibit 3.8 of the Company's Form 10-K for the year ended September 30, 2019)\n3.9 - Certificate of Amendment, dated November 9, 2022, to the Amended and Restated Certificate of Incorporation of Beazer Homes USA, Inc. (incorporated herein by reference to Exhibit 3.1 of the Companys Form 8-K filed on November 14, 2022)\n3.10 - Fourth Amended and Restated Bylaws of the Company (incorporated herein by reference to Exhibit 3.3 of the Company's Form 10-K for the year ended September 30, 2010)\n4.1 - Specimen Physical Common Stock Certificate of Beazer Homes USA, Inc. (incorporated herein by reference to Exhibit 4.1 of the Company's Form 10-K filed on November 10, 2015)\n4.2 - Section 382 Rights Agreement, dated as of December 7, 2021, and effective as of November 14, 2022, between Beazer Homes USA, Inc. and American Stock Transfer & Trust Company, LLC, as Rights Agent (incorporated herein by reference to Exhibit 4.1 of the Companys Form 8-K filed on November 14, 2022)\n4.3 - Form of Indenture for Senior Debt Securities, between the Company and Regions Bank (incorporated herein by reference to Exhibit 4.2(a) of the Companys Form S-3ASR filed on August 10, 2023)\n4.4 - Form of Indenture for Subordinated Debt Securities, between the Company and Regions Bank (incorporated herein by reference to Exhibit 4.2(b) of the Companys Form S-3ASR filed on August 10, 2023)\n4.5 - Form of Junior Subordinated Indenture, dated June 15, 2006, between the Company and JPMorgan Chase Bank, National Association (incorporated herein by reference to Exhibit 4.1 of the Company's Form 8-K filed on June 21, 2006)\n4.6 - Form of Amended and Restated Trust Agreement, dated June 15, 2006, among the Company, JPMorgan Chase Bank, National Association, Chase Bank USA, National Association, and certain individuals named therein as Administrative Trustees (incorporated herein by reference to Exhibit 4.2 of the Company's Form 8-K filed on June 21, 2006)\n4.7 - Junior Subordinated Indenture between Beazer Homes USA, Inc. and Wilmington Trust Company, as trustee, dated as of January 15, 2010 (incorporated herein by reference to Exhibit 10.2 of the Company's Form 8-K dated January 21, 2010)\n4.8 - Indenture, dated as of October 10, 2017, between the Company, the Guarantors and U.S. Bank National Association, as trustee (incorporated herein by reference to Exhibit 4.1 of the Companys Form 8-K filed on October 10, 2017)\n4.9 - Form of 5.875% Senior Note due 2027 (incorporated herein by reference to Exhibit 4.2 of the Companys Form 8-K filed on October 10, 2017)\n4.10 - Registration Rights Agreement, dated as of October 10, 2017, between the Company, the Guarantors and Credit Suisse Securities (USA) LLC, as representative of the Initial Purchasers (incorporated herein by reference to Exhibit 4.3 of the Companys Form 8-K filed on October 10, 2017)\n4.11 - Supplemental Indenture, dated April 2, 2014, between Beazer-Inspirada LLC and U.S. Bank National Association, as trustee, related to the Companys 7.250% Senior Notes due 2023 (incorporated herein by reference to Exhibit 4.6(c) to the Companys Form S-4 filed on June 10, 2014 (File No. 333-196637))\n4.12 - Indenture for 6.750% Senior Notes due 2025, dated March 14, 2017, by and among the Company, the Guarantors and U.S. Bank National Association, as trustee (incorporated herein by reference to Exhibit 4.1 of the Companys Form 8-K filed on March 15, 2017)\n4.13 - Form of 6.750% Senior Note due 2025 (incorporated by reference to Exhibit 4.2 of the Companys Form 8-K filed on March 15, 2017)\n4.14 - Registration Rights Agreement, dated as of March 14, 2017, by and among the Company, the Guarantors and Credit Suisse Securities (USA) LLC, as representatives of the Initial Purchasers (incorporated herein by reference to Exhibit 4.3 of the Companys Form 8-K filed March 15, 2017)\n4.15 - Indenture for 7.250% Senior Notes due 2029, dated as of September 24, 2019, by and among the Company, the Guarantors and U.S. Bank National Association, as trustee (incorporated herein by reference to Exhibit 4.1 of the Company's Form 8-K filed on September 24, 2019)\n4.16 - Form of 7.250% Senior Note due 2029 (incorporated herein by reference to Exhibit 4.2 of the Company's 8-K filed on September 24, 2019)\n4.17 - Registration Rights Agreement, dated as of September 24, 2019, by and among the Company, the Guarantors and Credit Suisse Securities (USA) LLC, as representative of the Initial Purchasers (incorporated herein by reference to Exhibit 4.3 of the Company's Form 8-K filed on September 24, 2019)\n4.18 - Description of the Registrant's Securities Registered Pursuant to Section 12 of the Securities Exchange Act of 1934 (incorporated herein by reference to Exhibit 4.37 of the Company's Form 10-K for the year ended September 30, 2021)\n10.1* - Form of Indemnification Agreement (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K filed on July 1, 2008)\n10.2* - 2010 Equity Incentive Plan (incorporated herein by reference to Exhibit 10.1 of the Company's Form 10-Q for the quarter ended March 31, 2010)\n10.3* Form of 2010 Equity Incentive Plan Employee Award Agreement for Option and Restricted Stock Awards (incorporated herein by reference to Exhibit 10.1 of the Company's Form 10-Q for the quarter ended June 30, 2010)\n10.4* - Form of 2010 Equity Incentive Plan Award Agreement for Option and Restricted Stock Awards (Non-Employee Directors) (incorporated herein by reference to Exhibit 10.2 of the Company's Form 10-Q for the quarter ended June 30, 2010)\n10.5* - Form of 2010 Equity Incentive Plan Award Agreement for Option and Restricted Stock Awards (Named Executive Officers) dated as of November 16, 2011 (incorporated herein by reference to Exhibit 10.1 of the Company's 8-K filed on November 22, 2011)\n10.6* - Form of 2010 Equity Incentive Plan Performance Cash Award Agreement (Named Executive Officers) (incorporated herein by reference to Exhibit 10.1 of the Company's 10-Q for the quarter ended December 31, 2012)\n10.7* - 2014 Long-Term Incentive Plan, as amended (incorporated herein by reference to Appendix I of the Companys Form DEF 14A filed on December 19, 2016)\n10.8* - Form of 2014 Long-Term Incentive Plan Award Agreement for Restricted Stock Awards (Named Executive Officers) (incorporated herein by reference to Exhibit 10.21 of the Companys Form 10-K filed on November 13, 2014)\n10.9* - Form of 2014 Long-Term Incentive Plan Award Agreement for TSR Performance Share Awards (Named Executive Officers) (incorporated herein by reference to Exhibit 10.22 of the Companys Form 10-K filed on November 13, 2014)\n10.10* - Form of 2014 Long-Term Incentive Plan Award Agreement for Pre-Tax Income Performance Share Awards (Named Executive Officers) (incorporated herein by reference to Exhibit 10.23 of the Companys Form 10-K filed on November 13, 2014)\n10.11* - Form of 2014 Long-Term Incentive Plan Award Agreement for Restricted Stock Awards (Non-Employee Directors) (incorporated herein by reference to Exhibit 10.24 of the Companys Form 10-K filed on November 13, 2014)\n10.12* - Form of 2014 Long-Term Incentive Plan Award Agreement for Performance Shares (Named Executive Officers) (incorporated herein by reference to Exhibit 10.1 of the Companys Form 10-Q filed on February 4, 2016)\n10.13* - Form of 2014 Long-Term Incentive Plan Award Agreement for Performance Shares (Named Executive Officers) (incorporated herein by reference to Exhibit 10.26 of the Company's Form 10-K filed on November 14, 2017)\n10.14* - Severance and Change In Control Agreement by and between Allan P. Merrill and the Company, effective as of September 18, 2018 (incorporated herein by reference to Exhibit 10.1 of the Companys Form 8-K filed on September 24, 2018)\n10.15* - Severance and Change In Control Agreement by and between Robert L. Salomon and the Company, effective as of September 18, 2018 (incorporated herein by reference to Exhibit 10.2 of the Companys Form 8-K filed on September 24, 2018)\n10.16* - Severance and Change In Control Agreement by and between Keith L. Belknap and the Company, effective as of September 18, 2018 (incorporated herein by reference to Exhibit 10.29 of the Company's Form 10-K filed on November 13, 2018)\n10.17* - Severance and Change in Control Agreement, dated November 20, 2020 (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K/A filed on November 20, 2020)\n10.18* - Letter Agreement dated November 20, 2020 (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K filed on November 20, 2020), as amended\n10.19 - Delayed-Draw Term Loan Facility, dated November 16, 2010, among Beazer Homes USA, Inc., Citibank, N.A. and Citigroup Global Markets Inc. (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K filed on November 18, 2010)\n10.20 - Delayed-Draw Term Loan Facility, dated November 16, 2010, among Beazer Homes USA, Inc., Deutsche Bank AG Cayman Islands Branch and Deutsche Bank Securities Inc. (incorporated herein by reference to Exhibit 10.2 of the Company's Form 8-K filed on November 18, 2010)\n10.21 - First Amendment to the Delayed-Draw Term Loan Facility, dated as of November 16, 2010, by and between Beazer Homes USA, Inc. and Citibank, N.A. (incorporated herein by reference to Exhibit 10.2 of the Company's 8-K filed on August 9, 2012)\n10.22 - First Amendment to the Delayed-Draw Term Loan Facility, dated as of November 16, 2010, by and between Beazer Homes USA, Inc. and Deutsche Bank AG Cayman Islands Branch (incorporated herein by reference to Exhibit 10.3 of the Company's 8-K filed on August 9, 2012)\n10.23 - Second Amended and Restated Credit Agreement, dated as of September 24, 2012, between Beazer Homes USA, Inc., as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent (incorporated herein by reference to Exhibit 10.1 of the Company's 8-K filed on September 26, 2012)\n10.24 - First Amendment to Second Amended and Restated Credit Agreement, dated as of November 10, 2014, between Beazer Homes USA, Inc., as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent (incorporated herein by reference to Exhibit 10.33 of the Companys Form 10-K filed on November 13, 2014)\n10.25 - Second Amendment to Second Amended and Restated Credit Agreement, dated as of November 6, 2015, between Beazer Homes USA, Inc., as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent (incorporated herein by reference to Exhibit 10.34 of the Company's 10-K filed on November 10, 2015)\n10.26 - Credit Agreement, dated March 11, 2016, by and between Beazer Homes USA, Inc. and Wilmington Trust (incorporated herein by reference to Exhibit 10.1 of the Companys Form 8-K filed on March 11, 2016)\n10.27 - Third Amendment to Second Amended and Restated Credit Agreement, dated as of October 13, 2016, by and among Beazer Homes USA, Inc., as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch (incorporated herein by reference to Exhibit 10.1 of the Companys Form 8-K filed October 13, 2016)\n10.28 - Fourth Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent, as amended (incorporated herein by reference to Exhibit 10.1 of the Companys Form 8-K filed on October 24, 2017)\n10.29 - Fifth Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent, as amended (incorporated herein by reference to Exhibit 10.1 of the Companys Form 8-K filed on October 5, 2018)\n10.30 - Sixth Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent, as amended (incorporated herein by reference to Exhibit 10.1 of the Company's Form 10-Q filed on May 2, 2019)\n10.31 - Seventh Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent, as amended (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K filed on September 10, 2019)\n10.32 - Term Loan Agreement, dated as of September 9, 2019, by and among the Company, the subsidiaries of the Company as guarantors thereto, and Credit Suisse International, as lender (incorporated herein by reference to Exhibit 10.2 of the Company's Form 8-K filed on September 10, 2019)\n10.33 - Form of 2014 Long-Term Incentive Plan Award Agreement for Performance Shares (Named Executive Officers) (incorporated herein by reference to Exhibit 10.2 of the Companys Form 10-Q for the quarter ended December 31, 2017)\n10.34 - Eighth Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders and issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, acting as agent, as amended (incorporated herein by reference to Exhibit 10.45 of the Company's Form 10-Q filed on April 4, 2020)\n10.35* - Amended and Restated 2014 Long-Term Incentive Plan (incorporated herein by reference to Appendix I of the Companys Form DEF 14A filed on December 20, 2019)\n10.36 - Ninth Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders party thereto, the issuers party thereto, and Credit Suisse AG, Cayman Islands Branch, as agent, as amended (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K filed on October 13, 2020)\n10.37 - Tenth Amendment to the Second Amended and Restated Credit Agreement, dated as of September 24, 2012, among the Company, as borrower, the lenders and issuers party thereto, and Credit Suisse AG Cayman Islands Branch, acting as agent, as amended (incorporated herein by reference to Exhibit 10.1 of the Company's Form 8-K filed on September 27, 2021)\n10.38 - Credit Agreement, dated as of October 13, 2022, among Beazer Homes USA, Inc., the several lenders from time to time parties thereto and JPMorgan Chase Bank, N.A., as an issuing lender and administrative agent (incorporated by reference to Exhibit 10.1 to the Company's Form 8-K, filed on October 13, 2022\n21 - Subsidiaries of the Company\n22 - List of Guarantor Subsidiaries\n23 - Consent of Deloitte & Touche LLP\n31.1 - Certification pursuant to 17 CFR 240.13a-14 promulgated under Section 302 of the Sarbanes-Oxley Act of 2002\n31.2 - Certification pursuant to 17 CFR 240.13a-14 promulgated under Section 302 of the Sarbanes-Oxley Act of 2002\n32.1 - Certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2 - Certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.1 - Clawback Policy\n101.INS - Inline XBRL Instance Document - The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH - Inline XBRL Taxonomy Extension Schema Document\n101.CAL - Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.LAB - Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE - Inline XBRL Taxonomy Extension Presentation Linkbase Document\n101.DEF - Inline XBRL Taxonomy Extension Definition Linkbase Document\n104 - Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Represents a management contract or compensatory plan or arrangement.\n(b) Exhibits\nReference is made to Item 15(a)3 above. The following is a list of exhibits, included in item 15(a)3 above, that are filed concurrently with this report.\n21 - Subsidiaries of the Company\n22 - List of Guarantor Subsidiaries\n23 - Consent of Deloitte & Touche LLP\n31.1 - Certification pursuant to 17 CFR 240.13a-14 promulgated under Section 302 of the Sarbanes-Oxley Act of 2002\n31.2 - Certification pursuant to 17 CFR 240.13a-14 promulgated under Section 302 of the Sarbanes-Oxley Act of 2002\n32.1 - Certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2 - Certification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.1 - Clawback Policy\n101.INS - Inline XBRL Instance Document - The instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH - Inline XBRL Taxonomy Extension Schema Document\n101.CAL - Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101.LAB - Inline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE - Inline XBRL Taxonomy Extension Presentation Linkbase Document\n101.DEF - Inline XBRL Taxonomy Extension Definition Linkbase Document\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n(c) Financial Statement Schedules\nReference is made to Item 15(a)2 above.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: November 16, 2023 Beazer Homes USA, Inc.\nBy: /s/ Allan P. Merrill\nName: Allan P. Merrill\nChairman, President and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: November 16, 2023 By: /s/ Allan P. Merrill\nName: Allan P. Merrill\nChairman, President, Chief Executive Officer and Director\nDate: November 16, 2023 By: /s/ David I. Goldberg\nName: David I. Goldberg\nSenior Vice President and Chief Financial Officer\nDate: November 16, 2023 By: /s/ Elizabeth S. Acton\nName: Elizabeth S. Acton\nDirector\nDate: November 16, 2023 By: /s/ Lloyd E. Johnson\nName: Lloyd E. Johnson\nDirector\nDate: November 16, 2023 By: /s/ Peter M. Orser\nName: Peter M. Orser\nDirector\nDate: November 16, 2023 By: /s/ Norma A. Provencio\nName: Norma A. Provencio\nDirector\nDate: November 16, 2023 By: /s/ Danny R. Shepherd\nName: Danny R. Shepherd\nDirector\nDate: November 16, 2023 By: /s/ David J. Spitz\nName: David J. Spitz\nDirector\nDate: November 16, 2023 By: /s/ C. Christian Winkle\nName: C. Christian Winkle\nDirector"
}